{"article": [{"url": "https://www.marketwatch.com/story/i-have-a-seven-figure-nest-egg-am-i-saving-too-much-for-retirement-2020-06-30", "published": 1598101580.0, "headline": "I have a seven-figure nest egg â\u0080\u0094 am I saving too much for retirement?", "body": "Hello! I recently had a conversation with a colleague about retirement and was told Iâ\u0080\u0099m saving too much! My wife and I are both 57 and have been aggressive savers ever since my brother, an institutional retirement financial expert, told us to max out our savings when we were 25 years old. As a result, we have saved 25-30% of our income and invested aggressively over the years. We have a very healthy nest egg in the low- to mid-seven figures and no debt other than our home, which is very low interest and will be paid off before retirement. Our children have no student debt. My colleague says we are â\u0080\u009cpostponingâ\u0080\u009d our lives and creating tax problems for when we retire. We have never felt like we have missed out on anything by saving and have lived a full life but is there such a thing as saving too much? Signed, Live for today or save for tomorrow? Dear Live for Today or Save for Tomorrow, Iâ\u0080\u0099ll start with the answer you may not have expected: Yes, there is such a thing as saving too much money, financial advisers said. That doesnâ\u0080\u0099t necessarily mean you personally have saved too much, though. 80% of older Americans can't afford to retire - COVID-19 isn't helping Having an â\u0080\u009coverfundedâ\u0080\u009d retirement isnâ\u0080\u0099t a bad problem to have, but it does raise the question: what are your goals for your finances, the present and your future, and are you meeting them? A big pile of money is great, but itâ\u0080\u0099s even better when you get to use it the way you want. There is no one right answer here, as the situation differs from person to person. There is a balance between saving for the future and living for today, and sometimes, people do overcompensate in one area. â\u0080\u009cIt is important for each person to think about this and determine where their balancing point is,â\u0080\u009d said Mark Beaver, partner and senior financial adviser at Keeler & Nadler. There are scenarios where people do so much planning and saving for the future, and then theyâ\u0080\u0099re robbed of that future for unforeseen and devastating reasons. Or they live it up in the moment and spend more than they save in the present, only to end up with little to no money to rely on in their old age, he said. See:Iâ\u0080\u0099m a 32-year-old stay-at-home mom, and my husband earns $150,000 a year. Will I ever be able to enjoy a retirement? Your colleague isnâ\u0080\u0099t wrong to suggest that some people do â\u0080\u009cpostponeâ\u0080\u009d their lives in the name of aggressively saving, but that could only happen if youâ\u0080\u0099re living so frugally today that youâ\u0080\u0099re not enjoying your life now. Some people save aggressively because theyâ\u0080\u0099re afraid of running out of money later in life, said Christopher Woods, a financial adviser and founder of LifePoint Financial Group. â\u0080\u009cThere are also others who are happy with their lifestyle and donâ\u0080\u0099t see how spending more will make them any happier,â\u0080\u009d he said. â\u0080\u009cAnd thatâ\u0080\u0099s perfectly fine.â\u0080\u009d But now for the good news: In your particular situation, it doesnâ\u0080\u0099t appear that youâ\u0080\u0099ve saved â\u0080\u009ctoo much,â\u0080\u009d said Joel Cundick, a financial adviser at Savant Capital. â\u0080\u009cIf this couple has never felt like they are missing out and have had a full life thus far while accumulating a seven-figure balance sheet, that is the textbook definition of financial success,â\u0080\u009d he said. The balancing point, Beaver said, lies in how you feel about the present while you save for the future. â\u0080\u009cIf itâ\u0080\u0099s keeping you from living the life you want right now because youâ\u0080\u0099re only looking at tomorrow, that is probably too much,â\u0080\u009d he said. You should aim for financial security, but also put your money toward your values, which may include experiences, said Ashley Gragtmans, a behavioral financial adviser at Parsec Financial. â\u0080\u009cIn general, I think itâ\u0080\u0099s hard to â\u0080\u0098save too much,â\u0080\u0099 but if you lack joy along the way, something needs to be re-evaluated,â\u0080\u009d she said. You noted you have not had that problem. So, what can you do from here? Your colleague may be right about setting yourself up for hefty tax bills in the future. How much is owed will depend on many factors, including how much you withdraw in a given year and how you diversify the accounts you withdraw from. For example, you can use traditional retirement plans, which are funded with pretax dollars, as well as Roth accounts, which contain after-tax dollars. When it comes time to withdraw from those assets, the money from the traditional account will be taxed at ordinary income rates, while the latter will be a tax-free distribution. There are pros and cons to using these accounts though, so you have to see what is best for your situation. There are various alternatives and supplemental accounts as well to save money, such as taxable investment portfolios and life insurance. A financial adviser could help you avoid excessive tax burdens and strategize so that youâ\u0080\u0099re getting the most out of your money. Although you seem to have your nest egg in order, there are questions you can ask yourselves so that your retirement plan is well-rounded, said Nadine Burns, president and chief executive officer of A New Path Financial. Questions to consider include: do you have additional income to supplement your retirement, like a pension? When do you plan to claim Social Security and how does that fit into your expected retirement age? (If you retire before you claim, youâ\u0080\u0099ll have to draw down some of those assets before you start receiving benefits.) Are there any health issues in the family, such as dementia, that may warrant long-term care planning? And what do you want to do with your retirement, so that the money youâ\u0080\u0099ve been saving is used well? Aside from planning accordingly for the rest of your years, if you intend to leave money to loved ones or charities, you should have a clear estate plan written up so that your wishes are met, Cundick said. Some advisers have seen their super-saver clients become â\u0080\u009csuper-givers,â\u0080\u009d like Leon LaBrecque, chief growth officer at Sequoia Financial Group. â\u0080\u009cI love saving,â\u0080\u009d he said. â\u0080\u009cHowever, money is nothing but a piece of paper with a picture of a dead president on it until you get rid of it. You can save it for you or save it for others.â\u0080\u009d Charitable giving can also lessen the burden of tax obligations. Also see: All the tax-friendly ways retirees can donate to charity Having an estate plan ensures your hard-earned savings are being used the way you intended them to be used. However, you should consult with a financial professional, especially as rules can change. For example, the Secure Act passed in December eliminated the stretch IRA provision for inherited accounts, which could force loved ones to pay much more in taxes than youâ\u0080\u0099d like. But back to the present: Make sure to continue enjoying life now while you save and prepare for retirement, said Michael Simmons, director of financial planning at Transitions Wealth Management. â\u0080\u009cAt some point, you may have the financial resources but lack the health or even the desire for things such as travel,â\u0080\u009d he said. In the meantime, you should pat yourselves on the back, said Liz Gillette, a financial adviser at MainStreet Planning. â\u0080\u009cFor most of us, investing versus spending is a competing priority that we work to manage. Living life in the now because life is uncertain but saving/investing enough so we donâ\u0080\u0099t compromise our future selves,â\u0080\u009d she said. â\u0080\u009cAs long as that money can be used in ways that serves their values and priorities, I certainly wouldnâ\u0080\u0099t say they have saved â\u0080\u0098too much.â\u0080\u0099â\u0080\u009d Letters are edited for length and style. Have a question about your own retirement savings? Email us at HelpMeRetire@marketwatch.com."}]}