{"article": [{"url": "https://www.marketwatch.com/story/oil-prices-pullback-from-four-month-high-after-inventory-reports-shows-unexpected-build-2020-07-22", "published": 1595430620.0, "headline": "Oil prices end with a slight loss after unexpected build in U.S. supplies", "body": "Oil futures finished slightly lower Wednesday, pulling back a day after settling at their highest since March, pressured by an unexpected weekly climb in U.S. crude stockpiles, as rising tensions between the U.S. and China raised the potential for a decline in energy demand. “At this time of year, we usually see larger draws on crude oil from demand and it is becoming quite clear that is slowing down, especially air travel,” Tariq Zahir, managing member at Tyche Capital Advisors told MarketWatch. The Energy Information Administration reported Wednesday that U.S. crude inventories rose by 4.9 million barrels for the week ended July 17. That compared with an average forecast by analysts polled by S&P Global Platts for a decline of 1.9 million barrels. The American Petroleum Institute on Tuesday reported a climb of 7.5 million barrels. “On the bearish side, the 500-pound gorilla is the virus and any new shutdowns [of the economy] and overall less demand for crude oil,” Zahir said. Oil prices, however, only tallied a modest decline for the session. Among supportive factors, Zahir said the market is in the middle of the Atlantic hurricane season with potential for output disruptions, the U.S. dollar has weakened, and positive results in trials for a COVID-19 vaccine could lead to a return in energy demand. On Wednesday, September WTI crude US:CLU20 CL.1, -1.62%, which is now the front month contract after the August contract expired Tuesday, lost 2 cents, or 0.05%, at $41.90 a barrel on New York Mercantile Exchange after trading as low as $41.14. September Brent crude BRN.1, -0.07% on ICE Futures Europe gave up 3 cents, or 0.07%, $44.29 a barrel, following a 2.4% gain in the previous session. The weekly increase in U.S. supplies may raise questions over a decision by the Organization of the Petroleum Exporting Countries and their allies earlier this month to taper production cuts from 9.7 million barrels per day to 7.7 million barrels starting from August, Lukman Otunuga, senior research analyst at FXTM, told MarketWatch. “Given the state of the global economy and rising coronavirus cases in the United States, oil remains exposed to downside risks.” The EIA data also showed crude stocks at the Cushing, Oklahoma, storage hub edged up by about 1.4 million barrels, while total domestic oil production climbed by 100,000 barrels to 11.1 million barrels a day last week. Gasoline supply fell by 1.8 million barrels, while distillate stockpiles climbed by 1.1 million barrels, according to the EIA. The S&P Global Platts survey had shown expectations for a supply decline of 2 million barrels for gasoline and an inventory increase of 280,000 barrels for distillates. On Nymex, August gasoline US:RBQ20 rose by 0.2% to $1.2828 a gallon, but August heating oil US:HOQ20 fell 0.7% to $1.2707 a gallon. August natural gas US:NGU20 settled at $1.681 per million British thermal units, up 0.4%. The EIA will provide an update on supplies of the commodity Thursday and traders eyed Atlantic storm activity for any potential disruptions to Gulf of Mexico production. Both WTI and Brent crude finished Tuesday at their highest settlements since early March after the European Union reached a deal on a budget agreement and coronavirus recovery fund, raising expectations for an improvement in energy demand. A decline in the U.S. dollar, however, with the ICE U.S. Dollar Index DXY, -0.58% down 0.1% in Wednesday dealings and trading 1% lower for the week, provided some support —limiting losses for oil prices, which are traded in the greenback, said Naeem Aslam, chief market analyst at AvaTrade. Aslam also said that the resurgence in the price of oil recently could foster more supplies that could eventually prove problematic to the bullish uptrend for crude. “On the supply side, you also need to be cautious because higher oil prices are likely to bring more oil on the market because the U.S. shale oil production becomes profitable,” he wrote in a daily note. Commodity investors were also watching Sino-American relations after China’s Foreign Ministry said the U.S. had instructed China to close its consulate in Houston, highlighting simmering tensions between Beijing and Washington that could be viewed as harmful to crude values. China is one of the biggest importers of oil. “Crude prices extended their slide after the China consulate action delivered a strong wave of risk aversion across all asset classes,” said Edward Moya, senior market analyst at Oanda. “The crude demand rebound will struggle since U.S.-Chinese tensions are not going away anytime soon.” Still, “a complete divorce between the world’s two largest economies seems unlikely so the global demand outlook for crude might not get completely derailed here,” he added."}]}