{"article": [{"url": "https://www.marketwatch.com/story/what-contact-tracing-is-and-how-you-can-get-work-doing-it-2020-06-15", "published": 1592215160.0, "headline": "What contact tracing is and how you can get work doing it", "body": "This article is reprinted by permission from NextAvenue.org. It is part of The Coronavirus Outbreak: What You Need To Know Special Report. Demand is keen, training is provided, pay exceeds minimum wage and you can often work from home. With Americans now facing a pandemic and the highest unemployment rate since the Great Depression, COVID-19 contact tracer has become the job of the moment. “When I read about contact tracing and how crucial it would be to getting our world back on track, I thought ‘That is something I could do,’” says Allison Stratton, 56, of San Diego. Plus, her mother-in-law died from COVID-19 in April. “Since I couldn’t help her, I really wanted to help where I could,” Stratton says. She’d had experience with computer software and customer service, skills her county was looking for in contact tracers. So, after seeing an ad on Facebook for contact tracing in her area, Stratton applied. Following a background check, she was accepted and was asked to report for a week of training on the following Monday. These days, Stratton is working full time as a contact tracer in San Diego County for $19.50 per hour.Contact tracing: an old job with new urgency While contact tracing is a new concept to many Americans, public health departments have depended on tracers for decades to control the spread of contagious diseases from syphilis to tuberculosis to HIV. The pandemic job: finding everyone who has been in close contact with a coronavirus-infected person and keep them from passing on the virus to others. Anyone who has been within 6 feet of an infected person for at least 10 to 15 minutes — from two days before the time they started seeing symptoms — is at risk. State and local public health department looking for, and hiring, tracers, do things differently. Some contact-tracing jobs are full time; others are part time. Some states are using volunteers or employing furloughed or reassigned government workers or local students only. Pay — when there is pay — ranges from $15 to $27 per hour. All tracers receive comprehensive training and get a script before they begin. Also see: The best side gigs you can do from home Each state and county has its own qualifying criteria for the job. You may or may not need a bachelor’s degree, a health background or experience with certain computer software. Listening and interpersonal skills are essential, however, along with being meticulous. Fluency in a second language or social work experience may be pluses.How to learn the rules and get trained It’s best to check with your health department to learn its rules. You can also sign up with an independent recruiter like the nonpartisan CONTRACE Public Health Corps, which screens and refers qualified applicants. Or, for training, you can register for a free six-hour Coursera tracing course, developed by the Bloomberg School of Public Health at John’s Hopkins University. The Association of State and Territorial Health Officials (ASTHO) also offers a free three-hour online course on contact tracing. Melissa Monteiro, regional managing director of the nationwide recruiting firm Atrium, oversees contact recruitment for Kentucky. For her tracers, “it’s more about soft skills. You don’t need health experience or a certain background.” When screening candidates, Monteiro looks for people who are inquisitive, empathetic and who can quickly build trust. “People passionate about wanting to help others do really well,” Monteiro adds. Cultural sensitivity is a must, too, says Elizabeth Ruebush, a director of infectious diseases at ASTHO in Arlington, Va. “The tracer has to assess whether the contact is comfortable speaking in English or understands what is being asked. Or whether there may be sensitivity around the person’s immigration status,” says Ruebush, who co-authored the ASTHO course, which is used to train contact tracers in many states.What contact tracers need Tracers also need resilience and fortitude. “You may be talking to people who are really sick. Or contacts may be resistant and not forthcoming with information,” says Monteiro. “People think contact tracing is super easy, but it’s not.” The job requires persistence, too, notes Ruebush: “It takes a few calls to track down some contacts.” She likens the job to detective work, since the list of someone’s contacts can range from a handful to more than five dozen. The cold call can be stressful, Ruebush says. “People may not feel comfortable opening up immediately. You need to assure the person the call is confidential, and your intention is to support them and protect their contacts.” Tracers inform contacts of their exposure to the coronavirus on a particular day, but provide no details about the identity of the infected person. They list COVID-19 symptoms and ask if the contacts have experienced any of them. The contacts are then advised to get tested for the virus and the tracer finds out who they have been around. And a new contact list begins.What coronavirus contacts are told Contacts are asked to quarantine or isolate for a period of days based on their virus exposure date. Even if the exposed person has no symptoms, the tracer encourages them to stay home, check their temperature regularly and call a doctor if symptoms arise. The tracer also explores whether assistance is needed for medical care, child care, grocery delivery or other social services while quarantining. After each call, the tracer completes a form and submits it to a supervisor. Over the next two weeks, the tracer follows up for updates. Bear in mind that some public health departments are inundated with tracer applications. San Diego County took down the ad Stratton responded to after getting more than 1,000 applications within a few days. Read: Yes, America needs to brace itself for a second wave of coronavirus “Not hearing back doesn’t necessarily mean [the applicant] won’t be needed in the future, though,” says Ruebush. “As communities reopen, more cases will follow.” Elaine Replogle of Eugene, Oreg., applied to be a tracer in early May. She teaches part-time at the University of Oregon and felt highly qualified to be a tracer, having proficiency in Spanish, a doctoral degree in medical sociology and research interview experience. Like many others, however, she has received no reply. Eve Glicksman is a freelance journalist in Silver Spring, Md. She is the former managing editor of AAMCNews for the Association of American Medical Colleges. Visit her online portfolio and website. This article is reprinted by permission from NextAvenue.org, © 2020 Twin Cities Public Television, Inc. All rights reserved."}]}