{"article": [{"url": "https://www.marketwatch.com/story/does-your-community-have-what-it-takes-to-help-you-live-longer-2020-09-16", "published": 1600247720.0, "headline": "Does your community have what it takes to help you live longer?", "body": "This article is reprinted by permission from NextAvenue.org. We all want to live healthier, happier, longer lives. But did you know there are three factors about where you live that can help make that happen? A study published in the July 2020 International Journal of Environmental Research and Public Health found that when cities, neighborhoods and community organizations create healthy environments for area residents, the impact on the longevity of their residents can be huge. Four researchers at Washington State University (WSU) examined data on the deaths of Washingtonians aged 75 and older between 2011 and 2015. They found that many of the 2,698 people there who’d been centenarians — 1.8% of the sample — were clustered into a few geographic areas. That led the study authors to look for the environmental, or community, factors most highly associated with living to 100 and beyond.What the researchers found Three of the common factors were a high working-age population percentage, walkability and an area with a higher socioeconomic status, said Rajan Bhardwaj, one of the study’s authors. Each of those factors can be directly impacted by public policy and city planning. And it seems that’s what’s going on in some centenarian hot spots. One of the standout locales in the study was Pullman, Wash., a hilly, midsize college town of around 35,000 in the southeast part of the state. “Our public works director says it’s the water!” Pullman’s mayor, Glenn Johnson, 76, joked. In reality, though, a number of other factors make Pullman an ideal town for healthy aging. Don’t miss: How to get older without screwing it up “We’ve always encouraged a wellness attitude. We’re a ‘Well City, ‘which is a public health initiative in the state of Washington,” Johnson explained. “A lot of the businesses around town also have wellness programs.” From an age diversity standpoint, Pullman is light years ahead of where it used to be.Making Pullman, Wash. a better place to grow older When Johnson came to teach at Washington State University, Pullman back in 1979, he said, “anyone who wanted to retire back then sort of left the area, because there wasn’t anything to attract them or keep them here.” Now, Johnson noted, “we’ve got a senior center with all kinds of activities, there are three top-notch retirement communities or facilities in the area and WSU has a retiree’s association. There are just a ton of amenities.” Ron Wachter, 82, a local businessman who’s lived in Pullman since 1963, agrees. “The golf course is world famous. We’ve got world-class athletes competing at the college and we’ve got the arts and music. I mean, where else can you get a better seat or better entertainment for less money? There’s just a lot to do,” said Wachter. Many of WSU Pullman’s staff and faculty members now retire in Pullman only to start second careers locally, keeping them vibrant and active.How Durant, Okla., is trying to become a better place to age well But nearly 2,000 miles away, in Durant, Okla., residents aren’t aging as well — yet. Life expectancy for residents in and around Durant is at, or slightly below, the national average of 78.6 years. Charla Hall, a professor of psychology at Southeastern Oklahoma State University and 22-year resident of Durant, gave some clues why: “I know that our part of the state deals with diabetes, as an example. Our rates are quite high. And when I’m out in the community, it’s evident that a large percentage of the population struggles with weight. And I see a lot of people smoking; more than when I’m out in other communities.” But things in this college town of 18,000 are starting to change for the better, thanks to a community initiative and partnership with The Blue Zones Project, whose mission is to help people live healthier, longer lives through certain types of environmental design. “We’ll model The Blue Zones’ nine underlying denominators and try to replicate those,” says Ashton Gabbart, the marketing and engagement lead for Blue Zones Project by Sharecare in Durant. “The long-term goal, obviously, is to create a sustainable impact for generations on into the future. We want to lower chronic disease and increase longevity. We’ll measure results in the shorter term, but ultimately this will be a 20- or 30-year project.” To produce those changes, Gabbart and other Blue Zones Project staffers will work with Durant’s city government, business leaders, community development organizations and citizen volunteers to implement a specific and ambitious plan for the future health of Durant’s residents. “We’ll work with restaurants to try to get them to offer more fruits and vegetables, so that making the healthy option is the easy option,” said Gabbart. “Ten of our top 20 worksites [in the area] will need to take the Blue Zones Pledge, creating healthier break rooms — like replacing soda with water or green teas; swapping donuts in the conference room with fresh fruit and scheduling more breaks throughout the day to get up and move naturally.” Durant will also put in biking lanes and more sidewalks, which are lacking in some parts of the community. Also see: COVID-19 has dashed the retirement dreams of these people There will also be specific initiatives for older adults, such as creating volunteer opportunities around social engagement and healthy habits. If the pandemic allows, “we want to get our seniors volunteering at farmers markets, for example and we’re looking at setting up a ‘Walking School Bus’ program, which would pair seniors and elementary school kids to walk to school together,” said Gabbart. Durant is also stepping up to address the socioeconomic factor to help all people in the community live longer, healthier lives. “We want to make sure our lower-income residents have access to healthy food. So, one of the things we’ve talked about is having mobile grocery stores. This addresses food deserts as well as transportation issues that lower-income folks might be facing,” Gabbart said. Hall, who volunteers with the Blue Zones Project in Durant when she’s not teaching, is excited for her hometown’s future. “Over the past several years, we’ve been moving in the right direction. But with Blue Zones coming in, it offers a number of resources that we didn’t have before and that’s exciting.” Rashelle Brown is a longtime fitness professional and freelance writer with hundreds of bylines in print and online. She is a regular contributor for NextAvenue and the Active Network, and is the author of “Reboot Your Body: Unlocking the Genetic Secrets to Permanent Weight Loss” (Turner Publishing). Connect with her on Twitter and Instagram @RashelleBrownMN. This article is reprinted by permission from NextAvenue.org, © 2020 Twin Cities Public Television, Inc. All rights reserved."}]}