{"article": [{"url": "https://www.marketwatch.com/story/trump-trade-adviser-navarro-blasts-beijing-for-spawning-the-coronavirus-and-then-seeding-and-spreading-the-disease-2020-07-03", "published": 1594108880.0, "headline": "Trump trade adviser Navarro blasts Beijing for â\u0080\u0098spawningâ\u0080\u0099 the coronavirus and then â\u0080\u0098seeding and spreadingâ\u0080\u0099 the disease", "body": "White House trade adviser Peter Navarro in a bombastic Friday afternoon television interview accused China of having â\u0080\u009cspawnedâ\u0080\u009d and â\u0080\u009chidâ\u0080\u009d the coronavirus that causes the disease COVID-19 and then sending â\u0080\u009chundreds of thousands of Chinese nationalsâ\u0080\u009d to â\u0080\u009cseed and spreadâ\u0080\u009d the disease â\u0080\u009cto the United States and Italy and everywhere in between.â\u0080\u009d With Navarro disclosing that heâ\u0080\u0099d arrived for the MSNBC interview with preset talking points, host Ali Velshi waded in to inquire whether Navarro was alleging that Beijing had deliberately brought about what ultimately became a global pandemic, Navarro responded: “ â\u0080\u0098I donâ\u0080\u0099t think it matters.â\u0080\u0099 ” He continued: â\u0080\u009cWhat they deliberately did, Ali, and this is beyond reproach in terms of a fact â\u0080\u0094 they deliberately allowed Chinese nationals to come to the United States, Italy and everywhere in between who were infected while they were locking down their own [domestic] transportation network.â\u0080\u009d He went on to accuse the Chinese of failing to raise an early alarm when the outbreak began last year and then â\u0080\u009cunder the shield of the [World Health Organization]â\u0080\u009d not divulging an accurate genomic picture of the virus. â\u0080\u009cThe Chinese Communist Party is responsible for every bad thing weâ\u0080\u0099re experiencing right now,â\u0080\u009d he said. â\u0080\u009cWe need to start pointing the blame at China.â\u0080\u009d He said his market-attention-seizing June 22 lamentation on Fox News, â\u0080\u009cItâ\u0080\u0099s over,â\u0080\u009d was not, as it appeared to have been, about the demise of U.S.-China trade deal itself but about U.S. trust in Chinaâ\u0080\u0099s ruling party, which, he said, sent its trade negotiators to the U.S. without mentioning the viral outbreak that had begun months earlier in Wuhan, China. Opinion:â\u0080\u0098Wildly out of contextâ\u0080\u0099 â\u0080\u0094 Peter Navarro on his own words, and the markets in relation to the economy Stating heâ\u0080\u0099d come to the interview with a second point to make in addition to the finger pointing at China, he returned to a longtime favorite Donald Trump topic, saying, â\u0080\u009cHydroxychloroquine needs a second look,â\u0080\u009d in light of a new study pointing to prospective mortality-rate improvements in a Detroit hospital system. â\u0080\u009cIâ\u0080\u0099m literally sitting on 63 million doses of hydroxychloroquine in the FEMA strategic national stockpile that I canâ\u0080\u0099t give away.â\u0080\u009d Read on:Trump was being â\u0080\u0098tongue in cheekâ\u0080\u0099 when he said the U.S. should â\u0080\u0098slow the testing down,â\u0080\u0099 White House adviser Peter Navarro says Key Words:Trump contradicts narrative that he was speaking in jest when he appeared to advocate a slowdown in coronavirus testing The WHO over the weekend said it had discontinued studies evaluating hydroxychloroquine and the AbbVie ABBV, +0.41% Â HIV drug Kaletra as potential COVID-19 treatments. Navarro, reported to have engaged in at least one heated exchange with Dr. Anthony Fauci, the U.S.â\u0080\u0099s widely respected top infectious-disease expert, did not seek to paper over any animosity in their relationship. â\u0080\u009cHe shouldnâ\u0080\u0099t be viewed as the oracle,â\u0080\u009d Navarro said of Fauci. â\u0080\u009cDr. [Deborah] Birx, sheâ\u0080\u0099s my heroine. I love how she has really tackled this.â\u0080\u009d iframe.twitter-tweet { width: 100% !important; } The trade adviser remained in the science realm when he allowed that the â\u0080\u009dreasonable assumptionâ\u0080\u009d of President Trump and perhaps others that, â\u0080\u009ccome summer, heat and humidity would get rid of the virusâ\u0080\u009d now appears to have been flawed. Key Words: Trump contradicts Navarro and McEnany narrative that he was speaking in jest when he appeared to advocate a slowdown in coronavirus testing The Margin:Peter Navarro challenges â\u0080\u009860 Minutesâ\u0080\u0099 on the White Houseâ\u0080\u0099s coronavirus response â\u0080\u0094 it doesnâ\u0080\u0099t go very well |"}]}