{"article": [{"url": "https://www.marketwatch.com/story/trumps-tiktok-and-wechat-ban-hurts-chinese-internet-stocks-heres-why-his-executive-order-also-puts-pressure-on-microsoft-2020-08-07", "published": 1596799280.0, "headline": "Trumpâ\u0080\u0099s TikTok and WeChat ban hurts Chinese internet stocks â\u0080\u0094 hereâ\u0080\u0099s why his executive order also puts pressure on Microsoft", "body": "U.S. President Donald Trump signed two executive orders on Thursday giving American citizens and businesses 45 days to sever any relations with popular Chinese social media and video-sharing platform TikTok, owned by ByteDance, and messaging app WeChat, a unit of gaming and internet conglomerate Tencent Holdings. - â\u0080\u009cThe spread in the United States of mobile applications developed and owned by companies in the Peopleâ\u0080\u0099s Republic of China (China) continues to threaten the national security, foreign policy, and economy of the United States,â\u0080\u009d Trump wrote in similar language in both orders. - The presidential decision puts pressure on Microsoft MSF, +1.35%, which is engaged in talks with TikTok owner ByteDance to buy the activities of the messaging app in the U.S. and three other countries. Microsoft said earlier this week that it aimed to conclude the discussions by Sept. 15. - Shares of Tencent 700, +0.84% Â fell 5% on the Hong Kong stock exchange, amid a general fall of Chinese internet companies. The Trump orders came a few days after Secretary of State Mike Pompeo had indicated the U.S. was engaged in a broad campaign against Chinese internet companies. - â\u0080\u009cThe U.S. is using national security as an excuse and using state power to oppress non-American businesses. Thatâ\u0080\u0099s just a hegemonic practice,â\u0080\u009d the Chinese foreign ministry said on Friday, warning that Washington would â\u0080\u009cbear the consequencesâ\u0080\u009d of the presidential edits. The outlook: Another day, another step in the escalation of tensions between Washington and Beijing, with Trump unlikely to climb down in the final stretch of the U.S. presidential campaign. The two executive orders wonâ\u0080\u0099t have the same impact in China: The Chinese government seems to care little about the fate of TikTok, which boasts of 100 million U.S. users every month. But WeChat, while having a much smaller footprint in the U.S. with about one million users, has a massive presence in China and is the app of choice of the Chinese diaspora."}]}