{"article": [{"url": "https://www.marketwatch.com/story/white-house-aware-of-russian-bounties-in-2019-and-trump-was-briefed-officials-say-2020-06-29", "published": 1593473540.0, "headline": "White House aware of Russian bounties in 2019 and Trump was briefed, officials say", "body": "Top officials in the White House were aware in early 2019 of classified intelligence indicating Russia was secretly offering bounties to the Taliban for the deaths of Americans, a full year earlier than has been previously reported, according to U.S. officials with direct knowledge of the intelligence. The assessment was included in at least one of President Donald Trump’s written daily intelligence briefings at the time, according to the officials. Then-national security adviser John Bolton also told colleagues he briefed Trump on the intelligence assessment in March 2019. The White House did not respond to questions about Trump or other officials’ awareness of Russia’s provocations in 2019. The White House has said Trump was not — and still has not been — briefed on the intelligence assessments because they have not been fully verified. However, it is rare for intelligence to be confirmed without a shadow of a doubt before it is presented to top officials. Read: Trump’s jaw-dropping calls with foreign leaders threaten national security, CNN report claims Bolton declined to comment Monday when asked by the AP if he had briefed Trump about the matter in 2019. On Sunday, he suggested to NBC’s “Meet the Press” that Trump was claiming ignorance of Russia’s provocations to justify his administration’s lack of a response. “He can disown everything if nobody ever told him about it,” Bolton said. The revelations cast new doubt on the White House’s efforts to distance Trump from the Russian intelligence assessments. The AP reported Sunday that concerns about Russian bounties were also included in a second written presidential daily briefing earlier this year and that current national security adviser Robert O’Brien had discussed the matter with Trump. O’Brien denies he did so. On Monday night, O’Brien said that while the intelligence assessments regarding Russian bounties “have not been verified,” the administration has “been preparing should the situation warrant action.” The administration’s earlier awareness of the Russian efforts raises additional questions about why Trump did not take any punitive action against Moscow for efforts that put the lives of Americans servicemembers at risk. Trump has sought throughout his time in office to improve relations with Russia and its president, Vladimir Putin, moving earlier this year to try to reinstate Russia as part of a group of world leaders it had been kicked out of. Officials said they did not consider the intelligence assessments in 2019 to be particularly urgent, given that Russian meddling in Afghanistan is not a new occurrence. The officials with knowledge of Bolton’s apparent briefing for Trump said it contained no “actionable intelligence,” meaning the intelligence community did not have enough information to form a strategic plan or response. However, the classified assessment of Russian bounties was the sole purpose of the meeting. The officials insisted on anonymity because they were not authorized to disclose the highly sensitive information. The intelligence that surfaced in early 2019 indicated Russian operatives had become more aggressive in their desire to contract with the Taliban and members of the Haqqani Network, a militant group aligned with the Taliban in Afghanistan and designated a foreign terrorist organization in 2012 during the Obama administration. The National Security Council and the undersecretary of defense for intelligence did hold meetings regarding the intelligence. The Pentagon declined to comment and the NSC did not respond to questions about the meetings. Concerns about Russian bounties flared anew this year after members of the elite Naval Special Warfare Development Group, known to the public as SEAL Team Six, raided a Taliban outpost and recovered roughly $500 thousand in U.S. dollars. The funds bolstered the suspicions of the American intelligence community that the Russians had offered money to Taliban militants and other linked associations. The White House contends the president was unaware of this development as well. The officials told the AP that career government officials developed potential options for the White House to respond to the Russian aggression in Afghanistan, which was first reported by The New York Times. However, the Trump administration has yet to authorize any action. The intelligence in 2019 and 2020 surrounding Russian bounties was derived in part from debriefings of captured Talbian militants. Officials with knowledge of the matter told the AP that Taliban operatives from opposite ends of the country and from separate tribes offered similar accounts. The officials would not name the specific groups or give specific locations in Afghanistan or time frames for when they were detained. Dmitry Peskov, a spokesman for Russian President Vladimir Putin, denied that Russian intelligence officers had offered payments to the Taliban in exchange for targeting U.S. and coalition forces. The U.S. is investigating whether any Americans died as a result of the Russian bounties. Officials are focused in particular on an April 2019 attack on an American convoy. Three U.S. Marines were killed after a car rigged with explosives detonated near their armored vehicles as they returned to Bagram Airfield, the largest U.S. military installation in Afghanistan. The Marines exchanged gunfire with the vehicle at some point; however, it’s not known if the gunfire occurred before or after the car exploded. Abdul Raqib Kohistani, the Bagram district police chief, said at the time that at least five Afghan civilians were wounded after the attack on the convoy, according to previous reporting by the AP. It is not known if the civilians were injured by the car bomb or the gunfire from U.S. Marines. The Defense Department identified Marine Staff Sgt. Christopher Slutman, 43, from Newark, Delaware; Sgt. Benjamin Hines, 31, from York, Pennsylvania; and Cpl. Robert Hendriks, 25, from Locust Valley, New York, as the Marines killed in April 2019. The three Marines were all infantrymen assigned to 2nd Battalion, 25th Marines, a reserve infantry unit headquartered out of Garden City, New York. Hendriks’ father told the AP that even a rumor of Russian bounties should have been immediately addressed. “If this was kind of swept under the carpet as to not make it a bigger issue with Russia, and one ounce of blood was spilled when they knew this, I lost all respect for this administration and everything,” Erik Hendriks said. Marine Major Roger Hollenbeck said at the time that the reserve unit was a part of the Georgia Deployment Program-Resolute Support Mission, a reoccurring, six-month rotation between U.S. Marines and Georgian Armed Forces. The unit first deployed to Afghanistan in October 2018. Three other service members and an Afghan contractor were also wounded in the attack. As of April 2019, the attack was under a separate investigation, unrelated to the Russian bounties, to determine how it unfolded. The officials who spoke to the AP also said they were looking closely at insider attacks — sometimes called “green-on-blue” incidents — from 2019 to determine if they are also linked to Russian bounties."}]}