{"article": [{"url": "https://www.marketwatch.com/story/10-year-treasury-yield-stands-near-two-week-low-ahead-of-jobs-report-2020-07-02", "published": 1593708920.0, "headline": "Treasury yields edge lower as doubts of U.S. recovery creep up as coronavirus cases spike", "body": "Treasury yields retreated from their session highs Thursday, amid haven buying driven by concerns that recent U.S. labor-market gains seen in June’s job report could be undermined if the nation fails to bring the coronavirus under control. The bond-market will be shuttered on Friday in honor of Independence Day, based on recommendations from Securities Industry and Financial Markets Association.What are Treasurys doing? The two-year yield TMUBMUSD02Y, 0.156% edged 0.9 basis point lower to 0.155%, contributing to a 1.2 basis point drop for the week. The 10-year note yield TMUBMUSD10Y, 0.777% fell 1.2 basis points to 0.670%, trimming the benchmark maturity’s weekly rise to 3.4 basis points, while the 30-year bond yield TMUBMUSD30Y, 1.576% was unchanged at 1.431%, leaving its weekly rise of 5.9 basis points intact. Both long-dated maturities marked their biggest weekly increase in a month.What’s driving Treasurys? The bond-market initially came under pressure after the U.S. Labor Department reported the U.S. economy had added 4.8 million jobs last month, above the forecast of 3.9 million from MarketWatch-polled economists. The unemployment rate fell to 11.1%, dropping for a second month in a row. Analysts cautioned that the labor market could struggle to recover swiftly if the spreading COVID-19 pandemic slows down consumer spending as Americans stay indoors, not necessarily due to lockdown measures but out of fear of catching the disease. The global tally for confirmed cases of the coronavirus that causes COVID-19 rose above 10.7 million on Thursday, according to data aggregated by Johns Hopkins University, and the U.S. recorded more than 50,000 new cases in a single day, for the first time since the start of the outbreak. Opinion: Fed warns stock market of a second recession if the coronavirus pandemic isn’t brought under control Other data also accompanied the job’s report release. The trade deficit widened in May to $54.6 billion and weekly jobless benefit claims rose by 1.43 million in the seven-day period ended June 27. What did market participants say? “This jobs report is very good, but backward-looking. When you look at the jobless claims numbers it gives you a more sobering perspective on what’s happening in the economy,” said Tony Rodriguez, head of fixed income strategy at Nuveen, in an interview. “There’s continued risk that a second-wave could reverse some of these job gains in July, but that should not take away from the strength of the June data,” said Thomas Simons, senior money market economist at Jefferies."}]}