{"article": [{"url": "https://www.marketwatch.com/story/florida-coronavirus-cases-surge-46-over-the-last-week-but-gov-desantis-says-he-wont-delay-states-reopening-plans-2020-07-01", "published": 1593683840.0, "headline": "Florida coronavirus cases surge 46% over the last week - but Gov. DeSantis says he won't delay state's reopening plans", "body": "Florida is stuck between a surge and a hard stance on reopening. Florida had reported some 159,000 cases as of Thursday morning, most of which do not account for those who are asymptomatic or pre-symptomatic, and 3,550 confirmed deaths from the virus. It reported 9,585 new cases on Saturday, its highest number of new cases in a 24-hour period. On Wednesday, Florida's Department of Health announced 6,563 additional cases of COVID-19, the disease caused by the coronavirus SARS-CoV-2, and 45 new deaths as the state moves into its fifth month of the pandemic. Similar figures are expected Thursday. While COVID-19's progress has slowed in states such as New York, where most cases in the U.S. are still centered, confirmed coronavirus cases have risen in 35 U.S. states, with some of the most populous states such as Florida, Texas and California a key cause for concern. “ 'We're not going back, closing things. I don't think that that's really what's driving it.' ” - Florida Gov. Ron DeSantis on his refusal to close many businesses Unlike officials in California and Texas, however, Florida Gov. Ron DeSantis has said the state will not delay its reopening plans. New cases are up 46% in Florida over the past week, up 27% in Texas, and up 17% in California over the same period, according to a tally by the Washington Post. \"We're not going back, closing things,\" DeSantis, a Republican, said on Tuesday, according to Axios. \"I don't think that that's really what's driving it, people going to a business is not what's driving it. I think when you see the younger folks, I think a lot of it is more just social interactions.\" \"We're open, we know who we need to protect; most of the folks in those younger demographics, although we want them to be mindful of what's going on, are just simply much, much less at risk than the folks who are in those older age groups,\" the governor added. DeSantis instructed bars, which are allowed to open to half of their usual capacity, to stop selling alcohol as one concession to the surge in coronavirus cases, but the state does not have restrictions on the number of people who can gather in stores and gyms. Tattoo artist Caio Chermont gives a customer a tattoo at Atomic Tattoos in the Ybor City neighborhood in Tampa, Fla. Getty Images In California, meanwhile, Gov. Gavin Newsom, a Democrat, said he would take a \"dimmer-switch\" approach to reopening. \"Many people are not being as responsible as we'd like them to be,\" he said. Last weekend, he ordered seven California counties to shut down bars, and he is reviewing others. And in Texas, Gov. Greg Abbott, a Republican, said the spread \"must be corralled.\" Last week, he paused the state's reopening, and ordered bars to close and restaurants to reduce seating capacity. Bars in the state have filed suit against this, the second closure since the pandemic began. Thus far, New York has had the most deaths from COVID-19 in the U.S. (32,043), followed by New Jersey (15,078), Massachusetts (8,053), Illinois (6,951), Pennsylvania (6,684), Michigan (6,193) and California (6,198 ). Texas has reported 2,503 deaths from the virus. “ 'I would not be surprised if we go up to 100,000 a day if this does not turn around.' ” - Anthony Fauci, director of the National Institute of Allergy and Infectious Diseases The COVID-19 pandemic, which was first identified in Wuhan, China in December, had infected 10,719,286 people globally and 2,686,587 in the U.S. as of Wednesday. It had claimed at least 516,786 lives worldwide, 127,681 of which were in the U.S., according to Johns Hopkins University. Anthony Fauci, the director of the National Institute of Allergy and Infectious Diseases for three decades and one of the leading experts on pandemics in the U.S. for the last four decades, warned Tuesday that new COVID-19 cases could continue to appear unless lawmakers and the U.S. public start to take social-distancing rules seriously. He said the recent surges were \"disturbing.\" \"I would not be surprised if we go up to 100,000 a day if this does not turn around,\" Fauci said. The number of confirmed U.S. coronavirus cases hit a new daily high of 40,000 last week, the highest number of daily cases since they reached 36,400 in a 24-hour period in April. The Dow Jones Industrial Index DJIA, +0.56%  and the S&P 500 SPX, +0.87%  were up Thursday on better-than-expected unemployment numbers, despite the surge in coronavirus cases in some of the country's most populous states. The coronavirus pandemic is \"not even close to being over\" and the worst is still to come, the head of the World Health Organization said in what was a grim assessment of the state of affairs some six months after the first cases were reported in China. How COVID-19 is transmitted"}]}