{"article": [{"url": "https://www.marketwatch.com/story/pierce-brosnan-just-listed-his-malibu-retreat-for-a-whopping-100-million-11602269152", "published": 1602255200.0, "headline": "Pierce Brosnan just listed his Malibu retreat for a whopping $100 million", "body": "Mike Helfrich for Chris Cortazzo of Compass, Christopher Polk/NBC Pierce Brosnan and his wife, Keely Brosnan, have listed their luxe Malibu property for an eye-popping $100 million. The property offers 117 feet of beachfront, and the custom-built abode is inspired by Southeast Asian style. Since they built the home, it’s the first time the resortlike retreat, dubbed “Orchid House,” has come up for sale. Can the couple manage to score a nine-digit payday? hey bought the parcel back in the late 1990s, and have lived there for almost two decades. They’re now reportedly spending most of their time on Kauai’s North Shore in Hawaii, and are ready to let their Thai-inspired home go to a buyer who can manage the hefty asking price. Brosnan’s abode has a Thai flavor So what does $100 million buy you? Let’s take a tour of the estate. The couple apparently fell for Thai architecture while the actor was filming there, for the 1997 James Bond film “Tomorrow Never Dies.” The beachfront retreat took about 10 years to complete, Architectural Digest notes. Pierce Brosnan's Malibu retreat Mike Helfrich for Chris Cortazzo of Compass Primo oceanfront property Mike Helfrich for Chris Cortazzo of Compass Living room Mike Helfrich for Chris Cortazzo of Compass Eat-in kitchen Mike Helfrich for Chris Cortazzo of Compass Outdoor, glassed-in dining area Mike Helfrich for Chris Cortazzo of Compass Saltwater pool Mike Helfrich for Chris Cortazzo of Compass Fire pit Mike Helfrich for Chris Cortazzo of Compass Designed for the couple by the architects Ralph and Ross Anderson and built by Albino Construction, the mansion has tropical gardens and ocean views. Its high-end interiors include walls of glass, wide-plank teak floors, and an open floor plan. Entertain in a living and dining room with an oversized fireplace. The living space opens, with floor-to-ceiling glass doors, to wraparound terraces overlooking the Pacific. A gourmet kitchen includes custom teak cabinetry, two stoves, two islands, quartz-crystal countertops, and a dining area with a couch and fireplace. A teak staircase leads up to the master suite, which has two fireplaces, a private balcony, dual dressing rooms, and two bathrooms en suite. The floor also contains a library or art studio, as well as a guest suite. Overall, the floor plan includes five bedrooms and 14 bathrooms, including separate guest quarters. On the lower level, luxury amenities abound, including a projection room with tiered seating and a bar. The wing also includes a gym, bonus or game room, and a spa with sauna and steam room, Japanese soaking tub, cold plunge, and shower. An outdoor shower leads from the spa to the grounds with pool, lanai, and beach. On just over an acre of landscaped grounds, the outdoor spaces include two glass-enclosed areas for dining and lounging, a partially covered deck with multiple seating and dining areas, a gas fire pit, and a path leading to Broad Beach. This custom-built home also comes with a poolhouse/guesthouse, a two-car garage, and guest and street parking. Brosnan’s mansion isn’t the priciest place in Malibu Let’s be clear. Homes in Malibu — especially on the ocean — don’t come cheap. When we looked at $100-million-plus sales in the area a couple of years ago, an agent told us there was “not enough product at the super-high end.” Two years later, far more properties are available in this exclusive enclave of beachfront properties favored by billionaires and celebrities. The Brosnan offering isn’t even the most expensive listing on the market in Malibu. That would be this one, listed for $125 million. Another property, on the market for $115 million, topped our list of the week’s most expensive homes back in February. The $100 million threshold has been broken before for posh properties in this neighborhood. An oceanfront estate that was on the market for $150 million sold for $100 million in August last year. Two years ago, a prestigious property owned by the co-founder of the Hard Rock Café, Peter Morton, sold for $110 million, a record-breaking amount for L.A. County at the time. Is the price right? So is the $100 million price tag on solid ground? We asked some agents for their take. Turns out, $100 million isn’t quite as eye-popping of a price as it used to be. George Penner, CEO of Deasy Penner Podley, notes: “$100 million is certainly a significant number. But [a home on] over an acre on Broad Beach — with unique architecture — doesn’t hit the market every day.” “The property is truly a trophy estate in every way. They’re taking advantage of current market conditions that favor the ultra-luxury ‘shelter in place’ market,” says Cara Ameer, a bicoastal agent with Coldwell Banker licensed in California and Florida. “Aspirational pricing is a common strategy when it comes to putting a property on the market of this caliber,” Ameer adds. “It attracts attention and interest—but this strategy only works if you have a truly exceptional and one-of-a-kind property to back it up. In this case, we have a definite winner.” The desirable oceanfront locale and spacious parcel also contribute to the asking price. “It’s an exceptional property, with more than one acre of prime land with ocean frontage, which is quite rare,” says Shirley Sherman with Douglas Elliman. Sherman adds, “In today’s market, this is what the discerning high-end buyers are looking for. In my opinion, the $100 million price tag in Broad Beach is completely justified.” Now, the goal will be to find a buyer with the bankroll who agrees. Chris Cortazzo of Compass holds the listing. This story was originally published on Realtor.com"}]}