{"article": [{"url": "https://www.marketwatch.com/story/a-sharper-cyclical-rally-could-be-in-the-cards-this-analyst-says-11597072862", "published": 1597064780.0, "headline": "A â\u0080\u0098sharper cyclical rallyâ\u0080\u0099 could be in the cards, this analyst says", "body": "Even though Congress has so far failed to come to an agreement on extending coronavirus fiscal aid, one analyst believes thereâ\u0080\u0099s upside for the stocks that have so far been left out of the rally since the March lows. â\u0080\u009cImproved fiscal package four negotiations, implied real rates plunging on anticipation of the Fed adopting inflation averaging, and decelerating COVID case growth, (and) hospitalizations all support Cyclicals and smaller caps,â\u0080\u009d wrote Evercore ISIâ\u0080\u0099s Dennis DeBusschere. Thereâ\u0080\u0099s some bad-news-is-good-news thinking in DeBusschereâ\u0080\u0099s analysis. Central banks around the world are buying huge swathes of the bond market, leading to what he calls â\u0080\u009cpersistently negative real rates,â\u0080\u009d a topic MarketWatch explored this weekend. With bond yields so low, it takes less for investors to calculate that riskier assets offer a better return. The decline in the equity risk premium is happening at the same time as earnings growth is improving, DeBusschere noted. As for the virus, DeBusschere argues that â\u0080\u009cInvestors are looking through the second wave and increasing 2nd wave hot spot deaths to an easing of the virus as social distancing measures take effect.â\u0080\u009d One closely watched model suggests COVID-19 deaths are estimated to peak this week with a 7-day moving average of 1,110. Â The elephant in the room is still fiscal support, however. â\u0080\u009cA 10% unemployment rate and near record savings rate necessitates additionally fiscal stimulus to offset the continuing economic drag from COVID,â\u0080\u009d Â DeBusschere Â noted. â\u0080\u009cOtherwise, the recovery will be slow until a vaccine becomes available and widely distributed.â\u0080\u009d For now, markets are still pricing in a stimulus deal, he added, â\u0080\u009cthough patience may wear thin if negotiations remain stalled through next week.â\u0080\u009d All is not lost for stocks if thereâ\u0080\u0099s no additional stimulus, he said: even if growth slows, the mega-cap tech stocks COMP, +1.39% that benefit from work-from-home and social distancing backdrops will still outperform. Assuming some sort of stimulus package is passed, DeBusschere sees big upside for energy and financials, and muted upside for materials and industrials. If investors do rotate their exposure, it would mean big potential downside for utilities and REITs, and slowing gains for the consumer discretionary and staples sectors. Itâ\u0080\u0099s important to note that investors have anticipated for some time a rotation away from the perennial winners like tech and into sectors like energy and financials that arenâ\u0080\u0099t as highly valued. During a few trading sessions over the past week or so, itâ\u0080\u0099s almost seemed to be at hand. Other themes that will benefit in this regime, DeBusschere says, are hard assets, like gold GOLD, +2.86%, and the housing market ITB, +0.79%, which is getting a tailwind from lower financing costs and sturdy demand. See: Gold will top $3,000, says this firm, one of the first to call the gold bull market of the 20th century"}]}