{"article": [{"url": "https://www.marketwatch.com/story/will-wearing-a-face-mask-protect-you-from-covid-19-its-complicated-here-are-the-5-biggest-mask-myths-2020-07-09", "published": 1594561820.0, "headline": "Will wearing a face mask protect you from COVID-19? It's complicated. Here are the 5 biggest mask myths", "body": "Since the onset of the pandemic, there has been a lot of confusion regarding face masks. At first, the U.S. Centers for Disease Control and Prevention told the general public not to wear masks if they aren't experiencing coronavirus symptoms or caring for someone with coronavirus. Then the agency reversed its guidance in early April and advised Americans to wear non-N-95 masks or face cloth covering in places where it is difficult to social distance. Following the CDC's announcement, several states including New York adapted mandatory mask mandates. One study estimated that states that issued mandates between April and mid-May averted as many as 230,000 coronavirus cases. Others left it up to cities or counties to issue mandates. But amid a resurgence of coronavirus, states like California and Texas issued state mandates in late June and early July, respectively. A separate study estimates that nearly 45,000 U.S. deaths from coronavirus could be prevented by November if 95% of the population wore masks. The general consensus among infectious disease experts is that it will slow the spread and prevent some transmission. But many have disregarded health-experts' recommendations based on scientific evidence and refuse to wear a mask despite city- and state-wide mandates. See also: Why do so many Americans refuse to wear face masks? Politics is part of it - but only part Some see it as an infringement of personal freedom, while others may not wear masks because of misconceptions which have been shared widely on social media, said Peter Chin-Hong, an infectious disease physician at University of California San Francisco. MarketWatch spoke with Chin-Hong about five common misconceptions.1. You don't need to wear a mask outside since sunlight kills the virus A study published last month estimated that \"90% or more of SARS-CoV-2 virus will be inactivated\" after being exposed to midday sunlight for around 34 minutes. That's led some to believe that it is not necessary to wear a mask while outside. “ 'We have enough compelling data to show that plenty of people get it outside if they're close together without a mask' ” - Peter Chin-Hong, an infectious disease physician at University of California San Francisco But the catch is the study is only applicable to surfaces. Meaning sunlight won't stop someone from spreading the virus if they cough or sneeze near you while you're outside, Chin-Hong said. \"COVID likes people more than sunlight. It cares more about mouths and noses being near each other.\" \"Overall this is a laboratory technical phenomenon that doesn't translate into human transmission. We have enough compelling data to show that plenty of people get it outside if they're close together without a mask.2. You only need to wear a mask if you're experiencing symptoms Asymptomatic and pre-symptomatic transmission accounts for more than half of the cases of coronavirus, according to a study published in the Proceedings of the National Academy of Sciences, a peer-reviewed journal on Monday. In the absence of common symptoms of coronavirus, a person who has the virus may not be prompted to get tested and hence they don't self-isolate. “ 'We can say very clearly that wearing a mask is definitely helpful in preventing acquisition as well as transmission.' ” - Anthony Fauci, director of the National Institute of Allergy and Infectious Diseases There is scant data on the percentage of cases of coronavirus that were prevented from wearing a mask, Anthony Fauci, director of the National Institute of Allergy and Infectious Diseases told lawmakers during his June 23 Congressional testimony. \"We can say very clearly that wearing a mask is definitely helpful in preventing acquisition as well as transmission,\" he said. \"It is always better to have a mask on than to not have a mask on, both for acquisition and for transmission,\" Fauci added.3. Masks won't offer any protection for the person wearing one This is a more complicated one, rooted in truth. The rationale for wearing a mask in the midst of the pandemic is that it will act as a barrier to prevent respiratory droplets from the mouth and nose from dispersing and transmitting the virus to others. That's considered to be the main way the virus spreads. But isn't true 100% that the mask-wearer themselves doesn't receive any protection from it, Chin-Hong said. \"You will get some amount of protection from wearing a mask because it's just like plexiglass. It will block droplets from hitting your nose or mouth.\"4. Wearing a mask will reduce your oxygen levels, right? Wrong. On Facebook FB, +0.26%, one widely shared post in May claimed that wearing a mask will lower your oxygen levels. (The post has since been taken down by Facebook. The company did not immediately respond multiple requests for a comment.) “ In cases where people have low oxygen levels to begin with that wearing a face mask won't lower their oxygen ” Another video making the same claim remains on Facebook but has been flagged for containing false information. In the video, the user, who is a firefighter according to factcheck.org, uses a multi-gas detector to test the levels of oxygen in he breaths in his mask. After a couple of seconds of wearing a mask, he shows that the oxygen in the air he's breathing is lower. (The user who uploaded the video did not immediately respond to a request for comment.) Not only is the claim he's making wrong but he also performed a flawed test to arrive at that conclusion, Chin-Hong told MarketWatch. \"These are distractors,\" he said. \"It's dangerous to bring these thoughts to the public when this public-health intervention can save lives.\" Even before coronavirus, face masks were given to patients who have lung diseases to protect others from them, he said. And in cases where people have low oxygen levels to begin with that wearing a face mask won't lower their oxygen levels. 5. Anything other than an N-95 mask is useless in terms of limiting transmission of the virus \"The 'Tesla TSLA, +1.89%  of masks' are N-95 masks,\" Chin-Hong said, that's why they're reserved for frontline medical workers who are caring for patients who have contracted coronavirus. That said, a cloth mask, bandana or scarf is \"better than not being protected at all.\" Importantly, they provide a barrier to the respiratory droplets that could come in contact with the wearer, he added. Although several studies have attempted to uncover materials that offer the greatest level of protection for a homemade mask, \"it's more important how comfortable you are when you wear it.\" \"They're like trying on a pair of jeans,\" he said. Even if your mask is made from a thin material, which studies have shown offer less protection than a thicker material, if you're comfortable while wearing it you're less likely to touch your face to make adjustments. Bottom line: \"People are using all kinds of excuses not to wear a mask like saying nothing works. If you have high cholesterol I'm not saying you won't get a heart attack if you take medication, it's all about risk reduction,\" Chin-Hong said."}]}