{"article": [{"url": "https://www.marketwatch.com/story/oil-prices-struggle-for-direction-as-worries-persist-over-the-outlook-for-demand-2020-08-14", "published": 1597418840.0, "headline": "Oil slips on demand worries, but U.S. supply declines help solidify weekly price gains", "body": "Oil futures finished lower Friday, with pressure attributed in part to downbeat global demand forecasts from major organizations this week, but prices still ended the week higher following declines in U.S. supplies. “Future demand expectations have been dialed back this week” by the Organization of the Energy Information Administration, the Organization of the Petroleum Exporting Countries and the International Energy Agency, said Michael Hewson, chief market analyst at CMC Markets UK, in a market update. In a monthly report Thursday, the IEA said it expects 2020 global oil demand to contract by 8.1 million barrels a day to 91.9 million barrels a day, year over year. OPEC’s monthly report issued Wednesday called for a larger fall of 9.1 million barrels a day in 2020 demand growth for global petroleum and liquid fuels to 90.6 million barrels per day, while a monthly report from EIA Tuesday forecast 2020 demand at 93.1 million barrels a day, down 8.1 million from 2019. “The demand outlook remains a function of the virus and where it strikes next, while the impasse in Washington over a relief act creates uncertainty as to its magnitude and impact,” Marshall Steeves, energy markets analyst at IHS Markit, told MarketWatch. West Texas Intermediate crude for September delivery CL.1, -1.62% US:CLU20 on the New York Mercantile Exchange fell 23 cents, or 0.5%, to settle at $42.01 a barrel, while the global benchmark, October Brent crude UK:BRNV20 lost 16 cents, or 0.4%, at $44.80 a barrel on ICE Futures Europe. For the week, WTI ended 1.9% higher, while Brent gained 0.9%, according to Dow Jones Market Data. “Global supplies are tightening with fewer Saudi loadings headed for the U.S. and production in the U.S. falling again,” said Steeves. In a weekly report Wednesday, the EIA reported a weekly fall of 300,000 barrels per day to 10.7 million barrels per day in total U.S. oil production, along with a decline of 4.5 million barrels in crude inventories—the third weekly drop in a row. “The crude stock draw in the latest week left inventory levels elevated even as production and imports fell,” Steeves said. “The crude oil stock draw in the latest week only slightly dented the surpluses, now 17% above a year ago and 15% above the five-year average.” However, U.S. production has fallen below 11 million barrels per day, he said. In a sign of potential further declines, Baker Hughes BKR, -1.34% on Friday reported that the number of active U.S. rigs drilling for oil fell for a third straight week, by 4 to 172 this week. Meanwhile, the OPEC+ production cuts remain in effect with a joint monitoring committee scheduled to meet next week, “where a rollover of current quotas is likely through September,” said Steeves. Read:OPEC+ committee expected to take “wait-and-see” approach on output as oil prices reflect “new normal” The Joint OPEC-Non-OPEC Ministerial Monitoring Committee, or JMMC, which monitors compliance with production cuts among OPEC+, is scheduled to hold a meeting via videoconference on Tuesday. At a meeting last month, OPEC+ allowed record production cuts of 9.7 million barrels per day to decrease to 7.7 million barrels per day starting in August. Estimates show that OPEC+ production already increased in July. Compliance among OPEC members and their allies with their production cut agreement fell to 96% in July, from 106% a month earlier, according to a survey from S&P Global Platts, with collective production among OPEC+ up by 1.1 million barrels per day. In other news, Phil Flynn, senior market analyst at The Price Futures Group, pointed out a Reuters report that said China has boosted its U.S. oil purchases ahead of the review of the trade deal, with Chinese state oil companies tentatively booking tankers to ship at least 20 million barrels of U.S. crude this month and next. “Twenty million barrels of oil is a lot of oil,” said Flynn—coming at a time “when U.S. inventories are staring to drain at a very quick pace due to OPEC+ [output] cuts, as well as falling U.S. output. Not to mention improving demand. This should conspire to drive WTI prices higher in the fourth quarter.” A review of the U.S.-China trade deal had been planned for Saturday, but Reuters reported that the review has been postponed. In other energy trading, September gasoline US:RBU20 rose 0.8% to $1.2446 a gallon, with prices up 3.1% for the week, while September heating oil US:HOU20 ended at $1.2367 a gallon, down 0.1% for the session, but up 1.4% for the week. September natural gas US:NGU20 rallied by 8% to $2.356 per million British thermal units, with prices up 5.3% for the week. “We have seen strong [natural gas] demand this week, driven by increased cooling demand,” said Evangeline Cookson, research analyst and meteorologist at Marex Spectron. “These warmer temperatures have led spot demand for week 33 to end 8% above the five-year mean.” Looking ahead, however, “our latest forecast is suggesting a low-pressure system will move eastward across Canada before stretching down the East Coast,” which will “bring cooler temperatures and reduce cooling demand,” she said in a note."}]}