{"article": [{"url": "https://www.marketwatch.com/story/heres-how-a-biden-presidency-could-hurt-financial-services-stocks-2020-07-20", "published": 1595261780.0, "headline": "Here's how a Biden presidency could hurt financial stocks", "body": "As Joe Biden leads President Donald Trump in polls ahead of November's election, analysts are already assessing how financial stocks could be affected by having the veteran Democratic politician in the Oval Office. \"We expect that financial stocks XLF, +0.11%  will sell off later this summer if it looks like a Biden win is likely,\" said KBW analyst Brian Gardner in a note on Sunday. \"In our opinion, investors' fear that the Elizabeth Warren wing of the Democratic Party could be in charge of financial regulation will weigh on financial stocks unless there is signal that a Biden administration will be led by centrists rather than progressives.\" From the archives:All that a 'President Warren' could change just by executive order Height Capital Markets analyst Edwin Groshans said that while the financial-services sector hasn't been called out recently in a big way by the former vice president's White House campaign, there are risks for payday lenders such as Enova International Inc. ENVA, +1.85%, CURO Group Holdings Corp. CURO, +0.71%, Elevate Credit Inc. ELVT, +10.41%  and FirstCash Inc. FCFS, -1.95%. He also sees potential challenges for student-lending and servicing companies such as Navient Corp. NAVI, +0.53%, SLM Corp. SLM, +0.11%  and Nelnet Inc. NNI, -0.86% ; credit reporting agencies Equifax Inc. EFX, +1.53%, Experian PLC EXPN, +1.09% and TransUnion TRU, +0.76% ; and auto lenders like Credit Acceptance Corp. CACC, -0.73%. Here's how the landscape could change for various parts of the financial industry. â\u0080¢ Payday lenders: Biden would have the authority to put in place a new Consumer Financial Protection Bureau director, and Height's Groshans expects the new boss would \"roll back the proposed revisions to payday lending rule in a manner that eliminates the product completely,\" saying it could be \"terminated within three years.\" â\u0080¢ Student loans: Biden is aiming to eliminate tuition fees for community colleges and job training programs tuition, as well as make public colleges and universities free for families earning under $125,000 a year. Such moves \"would reduce education loan originations, potentially materially, and servicing books and federal education loan investment portfolios would shrink as the current books amortize,\" Groshans said in a note on Monday. â\u0080¢ Credit bureaus: Biden has proposed having the CFPB create a public competitor to the credit reporting agencies, and that \"would be negative\" for Equifax, Experian and TransUnion, Groshans wrote. â\u0080¢ Other consumer-focused financial companies: \"The Biden campaign has promised to 'reinvigorate' the CFPB, so we expect a new wave of investigations will be aimed at student loan servicers, mortgage servicers, credit card companies, payday lenders, installment lenders, debt collectors, and credit-reporting agencies,\" said KBW's Gardner. â\u0080¢ Banks: \"Commercial banks were among the industries that benefited the most from the Trump administration's regulatory agenda and banking regulation is likely to shift in a Biden administration, but maybe not as dramatically or as quickly as some investors think,\" Gardner wrote. \"The composition of the Federal Reserve Board (the most consequential banking regulator) will remain mostly the same until 2022, when Chairman Jerome Powell's term expires.\" â\u0080¢ Investment banks and brokers: A Biden administration is likely to increase scrutiny of mergers and acquisitions by being more aggressive in antitrust reviews, which \"could be an overhang for the M&A advisers,\" Gardner said. In addition, the Labor Department \"might scrap the latest proposal for a fiduciary rule and try to return to a version similar to what the Obama administration implemented in 2016.\" â\u0080¢ Exchanges: \"The Biden administration has proposed a financial transaction tax (FTT) which we view as a negative for the exchanges,\" Gardner said. \"Normally, we would dismiss the idea of Congress's passing an FTT, but in a COVID world where the government is searching for revenue to pay for the response to the pandemic, we cannot rule out the possibility that Congress will pass an FTT.\""}]}