{"article": [{"url": "https://www.marketwatch.com/story/united-other-major-airlines-tell-passengers-to-wear-face-masks-or-risk-getting-banned-2020-06-15", "published": 1592264960.0, "headline": "United, other major airlines tell passengers to wear face masks or risk getting banned", "body": "United Airlines and other major U.S. carriers are putting some teeth into their face-mask policies, saying passengers who flout the rules may be banned from flying. United UAL, +0.32% has required face masks for passengers since May 4, but on Monday, the airline said that starting June 18, those who don’t comply with the rules will be placed on “an internal travel restriction list,” losing “their travel privileges on United for a duration of time to be determined pending a comprehensive incident review.” In a statement, United said flight attendants will first explain the policy and ask scofflaws to put on their mask, or offer them one. If they don’t comply, “flight attendants will do their best to de-escalate the situation” and give them a written “policy reminder card.” If they still don’t comply, “the flight attendant will file a report of the incident, which will initiate a formal review process.” Don’t expect air marshals to drag out offending passengers — no physical action will be taken onboard. “Any final decision or actions regarding a customer’s future flight benefits will not occur onboard but instead take place after the flight has reached its destination and the security team has investigated the incident,” United said. Exceptions will be made for passengers with medical conditions or disabilities that prevent them from wearing a mask, and passengers may remove their masks to ea, drink or take medication. United said it expects masks to be mandatory for at least another 60 days. “Wearing a mask is a critical part of helping make air travel safer,” Dr. James Merlino, chief clinical transformation officer at Cleveland Clinic, said in a statement. “The more people in a given space wearing masks, the fewer viral particles are making it into the space around them, decreasing exposure and risk.” “Today’s announcement is an unmistakable signal that we’re prepared to take serious steps, if necessary, to protect our customers and crew,” Toby Enqvist, United’s chief customer officer, said in the statement. The announcement came as the trade group Airlines for America said its member carriers, which include United, Alaska Airlines ALK, +0.15%, American Airlines AAL, +0.34% , Delta Air Lines DAL, +0.39% , Hawaiian Airlines HA, +0.36% , JetBlue Airways JBLU, -0.07% and Southwest Airlines LUV, +1.89% , will be implementing stricter face-mask rules, including possible bans for passengers who don’t follow the rules."}]}