{"article": [{"url": "https://www.marketwatch.com/story/florida-joins-texas-in-rolling-back-reopening-of-state-economy-as-covid-19-cases-spike-2020-06-26", "published": 1593175700.0, "headline": "Florida joins Texas in rolling back reopening of state economy as COVID-19 cases spike", "body": "FORT LAUDERDALE, Fla. (AP) — Florida banned alcohol consumption at its bars Friday after its daily confirmed coronavirus cases neared 9,000, a new record that is almost double the previous mark set just two days ago. The Florida agency that governs bars announced the ban on Twitter just minutes after the Department of Health reported 8,942 new confirmed cases, topping the previous record of 5,500 set Wednesday. Pulse:Texas becomes the first state to reimpose restrictions after lifting stay-at-home order on April 30 State officials have attributed much of the new outbreak to young adults flocking to bars after they reopened in most of the state about a month ago, with many of them ignoring social distancing restrictions aimed at lowering the virus’s spread. More than 24,000 new cases have been reported since Saturday, more than a fifth of the 111,724 cases confirmed since March 1. The department had not updated its death total, which still stood at 3,327. The seven-day average for positive tests dropped slightly to 13.4%, down 1 percentage point from Thursday but still triple the rate of 3.8% of June 1. Florida’s record-setting week for newly confirmed coronavirus cases got even worse with almost 9,000 reported Friday, nearly double the just-set mark and five times more than where the state record stood two weeks ago. More than 24,000 cases have been reported since Saturday, more than a fifth of the 111,724 cases confirmed since March 1. The department had not updated its death total, which still stood at 3,327. A member of Orange County Fire Rescue passes out personal protective equipment including disposable face masks, reusable masks and hand sanitizer to small businesses on Wednesday in Orlando, Fla. Associated Press The seven-day average for positive tests dropped slightly to 13.4%, down 1 percentage point from Thursday but still triple the rate of 3.8% of June 1. The seven-day average for hospitalizations is also creeping up, hitting 172 on Thursday, about 70% higher than it was June 1."}]}