{"article": [{"url": "https://www.marketwatch.com/story/bill-gates-elon-musk-jeff-bezos-and-the-rest-of-the-oligarchic-dozen-just-reached-a-disturbing-milestone-2020-08-18", "published": 1597748960.0, "headline": "Bill Gates, Elon Musk, Jeff Bezos and the rest of the â\u0080\u0098Oligarchic Dozenâ\u0080\u0099 just reached a â\u0080\u0098disturbing milestoneâ\u0080\u0099", "body": "â\u0080\u009cThe rich get richerâ\u0080\u009d doesnâ\u0080\u0099t even begin to tell the story these days. According to the Institute for Policy Studies, the wealth of the top 12 billionaires in the U.S. recently exploded to more than one trillion dollars â\u0080\u0094 yes, 13 digits. The statistic, of course, is an eye-popping figure on its face, made even more so in light of the devastation in the broader economy due to the coronavirus pandemic. â\u0080\u009cThis is a disturbing milestone in the U.S. history of concentrated wealth and power,â\u0080\u009d said Chuck Collins, a director for the Washington D.C.-based progressive think tank. â\u0080\u009cThis is simply too much economic and political power in the hands of twelve people. From the point of view of a democratic self-governing society, this represents an Oligarchic Dozen.â\u0080\u009d Since the pandemic first blew up in the U.S. back in March, the â\u0080\u009cOligarchic Dozenâ\u0080\u009d has enjoyed a 40% surge in its combined wealth â\u0080\u0094 or an increase of $283 billion. Teslaâ\u0080\u0099s TSLA, +1.89% Â Elon Musk has been the biggest beneficiary, with his wealth, as of August 13, tripling to $73 billion. That doesnâ\u0080\u0099t even include the fierce rally in Tesla shares on Monday, which pushed Musk into the fourth position on the Bloomberg Billionaires Index. Hereâ\u0080\u0099s the full list: â\u0080\u009cThe total wealth of the Oligarchic Dozen is greater than the GDP of Belgium and Austria combined,â\u0080\u009d said Omar Ocampo, a researcher for IPSâ\u0080\u0099s program on inequality and the common good. â\u0080\u009cMeanwhile, tens of millions of Americans are unemployed or living paycheck to paycheck, and 170,000 people have died from COVID-19 in the United States.â\u0080\u009d The Oligarchic Dozen, like everybody else, got off to a rough start this year, with the groupâ\u0080\u0099s collective wealth dropping by almost $100 billion from January 1 to March 18. It didnâ\u0080\u0099t take long for their net worth to rebound and surpass their September 2019 levels, except for Warren Buffett BRK.A, +0.06% Â , who is still a couple billion short of his year-ago figure. And itâ\u0080\u0099s not just Bezos and the bunch who have seen fortune smile upon them lately. CEO compensation, overall, climbed to its highest level in seven years last year, and it is positioned to rise once again in 2020, according to an Economic Policy Institute study cited by the Washington Post. In fact, the pay ratio between chief executives and workers at Americaâ\u0080\u0099s 350 biggest companies has widened to 320-to-1, the researchers found. Meanwhile, many on the â\u0080\u009cOligarchâ\u0080\u009d list were having another good run on Tuesday, with Amazon AMZN, +3.01% Â , Alphabet GOOG, +1.97% Â , Tesla and Microsoft MSFT, +2.48% Â , all in the green. The Dow Jones Industrial Average DJIA, +0.56% Â was lagging, while the S&P 500 SPX, +0.87% Â and tech-heavy Nasdaq Composite COMP, +1.39% Â were both pushing higher."}]}