{"article": [{"url": "https://www.marketwatch.com/story/gold-prices-remain-higher-but-pull-back-from-move-above-2000-an-ounce-as-us-dollar-firms-2020-08-03", "published": 1596466640.0, "headline": "Gold prices eke out record high, but pull back from intraday peak near $2,010 as U.S. dollar firms", "body": "Gold prices eked out a slight gain, but enough to finish at a fresh record Monday, with a bounce higher in the U.S. dollar muting some of the rally that had taken bullion temporarily a psychologically significant level near $2,000. A measure of the buck inched higher to start the first trading day in August, with the ICE U.S. Dollar Index DXY, -0.58%, a measure of the currency against a basket of six major rivals, up 0.3% at 93.587, after trading around a two-year low against a basket of a half-dozen currencies. “The dollar bounce has certainly taken the edge off gold, although not before it took another run at $2,000 early in the session,” wrote Craig Erlam, senior market analyst at Oanda in a daily research report. A stronger dollar can make assets priced in the currency more expensive of overseas buyers. “This feels like a very natural place for gold to be experiencing some profit-taking after hitting a new record high last week but there’s nothing to suggest we’re going to see a larger pullback at this stage,” he wrote. A rise in the U.S. government bond yields also appeared to limit gold’s rally. Because gold doesn’t offer a coupon, rising yields from risk-free government bonds can deflate the yellow metal’s haven appeal. The 10-year Treasury note TMUBMUSD10Y, 0.777% yielded 0.556% from 0.54% on Friday, while the 30-year bond TMUBMUSD30Y, 1.576% was yielding 1.246% from 1.198% on Friday, according to FactSet data. December gold GCZ20, +2.17% GC00, +2.17% rose 40 cents, or less than 0.1%, to settle at $1,986.30 an ounce, after touching a fresh intraday peak at 2,009.50, according to FactSet data. Last Friday, bullion posted a weekly climb of 4.7%, while the 10.3% gain in July marked the best monthly rise since February of 2016, according to FactSet data. The yellow metal has enjoyed a rally to all-time records amid concerns about the economic impact of COVID-19 and the actions taken by governments and central banks to help mitigate the harm to businesses in attempting to curtail the spread of the pathogen. The global tally for infections from the disease caused by the novel strain of coronavirus stands at more than 18 million and almost 690,000 deaths, according to data compiled by Johns Hopkins University. Still, equity markets were rising higher amid global manufacturing data that suggests some rebound from weakness is under way. The Nasdaq Composite Index reached an intraday record high above 10,900 earlier Monday, which may be reflective of tapering appetite for gold over other assets. “The risk-on appetite of traders is also a factor in gold’s slide as some dealers are diverting funds into equities,” wrote David Madden, market analyst at CMC Markets UK, in a Monday note. September silver US:SIU20, meanwhile, picked up 20.1 cents, or 1%, to end at $24.417 an ounce, after putting in a weekly slide of 1.2% on Friday, with a monthly return of nearly 30% based on the most actively traded contract. Elsewhere on Comex, September copper US:HGU20 gained 4.4 cents, or 1.5%, on Monday to settle at $2.912 a pound, after a weekly decline of 1% and a monthly advance of 5.1%. October platinum PLV20, +3.99% rose sharply by $12.20, or 1.3%, to end at $931.10 an ounce, following a weekly drop of 4.3% with a monthly rise of 8%. September palladium US:PAU20 shed $5.80, or 0.3%, to reach $2,139.50 an ounce Monday, after palladium declined 9% for the week and notched a monthly gain of 9.1%."}]}