{"article": [{"url": "https://www.marketwatch.com/story/how-a-president-biden-or-a-president-trump-could-affect-the-student-debt-crisis-and-college-affordability-11600702994", "published": 1600939040.0, "headline": "How a President Biden or a President Trump could affect the student-debt crisis and college affordability", "body": "MarketWatch photo illustration/Getty Images|, iStockphoto The last time former Vice President Joe Biden was on the presidential ticket, student debt and college affordability barely rated a mention. Just eight years later, Biden has vowed to make public college free for some and cancel a portion of borrowers’ student debt if he’s elected — proposals that are less sweeping than some offered during the Democratic primary campaign that Biden ultimately won. Since 2012, student debt has grown from $970 billion to nearly $1.6 trillion, according to the Federal Reserve Bank of New York. The Great Recession and its slow recovery pushed more students to school to retrain; squeezed families, hampering their ability to pay for college; pressured state budgets, limiting the amount they sent to public colleges, pushing prices up; and sent graduates into a labor market where wages hadn’t grown much historically, making their higher-than-historical student loan balances difficult to repay. But it’s not just the experience of student debt that’s broadened over the past several years, the rhetoric around it has changed too. Expansive proposals for cancelling student debt have gained traction and prominent battles over the debt held by students who were defrauded by their colleges have shown voters that there are ways to legally discharge borrowers’ federal student loans. In addition, research from a variety of scholars has highlighted the disproportionate impact that America’s debt-financed higher education system has on Black students and families, creating more urgency around changing it. And in the past few months, the coronavirus pandemic has exposed the financial precariousness of so many families and the role that student loans play in the challenges they face keeping up with bills. Now student debt is “squarely on the ballot,” in a way it hasn’t been before, said Natalia Abrams, the executive director of Student Debt Crisis, a borrower advocacy group. “We couldn’t let that go without being recognized,” Abrams said. Her organization decided to endorse Biden, who has vowed to cancel some student debt if elected. The decision to back a candidate marks the first time Student Debt Crisis has endorsed a presidential candidate. Student Debt Crisis joined with Rise, a nonprofit organizing students around eliminating tuition and fees, ending student hunger and homelessness and other issues, to make the endorsement. “With the right person in the White House student borrowers have a chance,” Abrams said. The last time Biden’s opponent, President Donald Trump, was on the ticket, he made brief mention of streamlining the student loan repayment system. This summer, Trump extended a pandemic-related pause on federal student loan payments and collections that was set to expire a month before the election. Here’s what each candidate’s election might mean for the future of the higher education and student loan systems: Joe BidenCollege affordability Biden is proposing to make public college tuition-free for families earning $125,000 or less. Momentum for some kind of free college plan was already building in the lead up to the 2016 election, with the Obama administration proposing to make community college free in 2015 and some states and communities already offering free college programs of their own. Free college became a point of contention in the 2016 Democratic primary, with former Secretary of State Hillary Clinton touting an initiative that would allow students to go to college debt-free, and Senator Bernie Sanders, a Vermont Independent, advocating for a plan to make public college tuition free. The debate was about more than semantics: Supporters of a debt-free college program like Clinton’s argued that it would better target resources to families who need the most help. Advocates of tuition-free college have said its simple messaging would push more low-income students to respond to the proposal, instead of assuming they’d have to fill out tedious paperwork to get access to an affordable college education. By making free college available to everyone, regardless of income, a tuition-free college proposal would create political buy-in that’s typically absent from means-tested programs, advocates argued. Clinton, who ultimately won the 2016 nomination, adopted some of the planks of Sanders’ plan as she faced Trump. Biden is continuing in that vein. Though he isn’t proposing to make college free for every American, his campaign estimates that his plan would cover roughly 80% of families. “The Joe Biden plan is really building off of the compromise that Bernie Sanders and Hillary Clinton struck in 2016,” said Jenna Sablan, an assistant research professor at Georgetown University Center for Education and the Workforce. “The Sanders side wanted universal free college and other parts of the Democratic Party felt like that would be too much of a giveaway.” But the challenges and opportunities related to implementing a free college plan look different today than in 2016. If the Great Recession is any indication, state budgets will likely suffer from the pandemic-induced downturn and any national free college program would rely on some kind of federal state funding partnership. “We’re not going to get a national free college policy without doing something big to restore the money that states are hemorrhaging in their budgets,” said Mark Huelsman, associate director of policy and research at Demos, a progressive think tank. Huelsman said he could see college affordability being a piece of a proposal that would restore state budgets. The Biden campaign didn’t respond to a request for comment, but a bill introduced by Sanders in 2017 that is similar to Biden’s proposed federal-state partnership would cost an estimated $600 billion. The federal-state partnership is part of what makes Jason Delisle, a resident fellow at the American Enterprise Institute, a conservative think tank, skeptical of Biden’s proposal. The idea that states would have to opt-in, makes it difficult for it to be the foundation of a national free college plan, he said. But perhaps more broadly, Delisle worries that a partnership like this could become the basis for the federal government to exert influence on states’ higher education policies, which Delisle says differ for good reason. “It’s a huge proposal and an absolute paradigm shift in the way the federal government would help people pay for college,” Delisle said. He prefers an approach to college affordability Biden advocated as vice president: A $4,000 tax credit — a smaller version of which ultimately became law — to families and students paying for college as a way to defray the cost. “Biden’s support for free college is a completely different approach than the tax credit, the tax credit is essentially a voucher to families and it’s hands off,” Delisle said. With free college, on the other hand, students have to go to public school to take advantage and some states may place requirements on what types of students can attend, Delisle said. In some states that have already created their own free college programs participants must be attending full-time, for example. Student-loan debt cancellation The 2020 Democratic primary was the first major election contest to feature broad initiatives to cancel student debt. Sanders proposed wiping away all outstanding student loans and Senator Elizabeth Warren, a Massachusetts Democrat, touted a plan that would have discharged up to $50,000 in student debt for borrowers earning less than $250,000. Biden has proposed cancelling $10,000 in student debt, an initiative that’s gained traction during the pandemic. The Democratic-led house proposed cancelling that level of student debt for economically distressed borrowers as part of the HEROES Act, their May coronavirus relief proposal. Cancelling $10,000 in student debt would completely wipe away the loan balances of 30% of borrowers, according to a Brookings Institution analysis. Warren and Senator Chuck Schumer, the Senate minority leader, introduced a resolution earlier this month urging the cancellation of up to $50,000 in federal student loans per borrower. The Biden campaign didn’t immediately respond to their proposal, but during a conference call with reporters, Schumer said the former vice president is “very seriously entertaining” it. What Biden has officially proposed thus far is to cancel federal undergraduate student debt for borrowers earning up to $125,000 as long as it was related to their education at a public college, a Historically Black College or university or Minority Serving Institution. Proposals for broad-based student debt cancellation have been criticized for providing a boon to highly-educated and in some cases, wealthy borrowers. Borrowers who attended graduate school typically have the highest student loan balances and so would receive the largest benefit, at least in dollars, from this type of proposal. It appears that Biden’s proposal is structured in part to address those concerns. But delineating between borrowers could wind up excluding groups that in many ways have been victims of our college finance system, borrower advocates say. For example, the gap in student debt between Black and white borrowers tends to grow after graduation in part because Black borrowers are more likely to attend graduate school at a for-profit college — schools that have been criticized for saddling borrowers with large debts for poor outcomes. “What happens is when you start picking and choosing you start leaving people out,” said Persis Yu, the executive director of the Student Loan Borrower Assistance Project at the National Consumer Law Center. Delisle, of the right-leaning AEI, and critics of Biden’s debt cancellation proposal on the left, have called it “arbitrary.” “The current Biden plan reads like the terms and conditions of a Comcast agreement,” said Astra Taylor, a co-founder of the Debt Collective, a debtor advocacy group. “They are so determined to distinguish worthy from unworthy debtors that they end up drawing these incredibly arbitrary lines.” In a statement following Schumer and Warren’s announcement, the Debt Collective members said they “celebrate the momentous nature,” of Senators’ plan. Still, they wrote, “we do not agree with” the $50,000 limit, they wrote, adding that “it is certainly better than,” Biden’s $10,000 cancellation proposal, “and far beyond any Republican plan. But we want to be clear: we need to cancel ALL student debt.” A broad-based student debt cancellation program makes both electoral sense — “student debt cancellation has the potential to bring in voters who might be on the sidelines” — and economic sense, Taylor said. Research has indicated that cancelling student debt would boost the economy. Biden is also proposing tweaks to the student loan system that could expand other pathways for debt discharge. Though he was part of a group of lawmakers who backed a 2005 bankruptcy reform law, which makes it very difficult for borrowers with private student loans to discharge them in bankruptcy, Biden has said that as president, he would urge Congress to reverse that law. In addition, Biden has vowed to streamline a troubled existing loan forgiveness program for public servants and provide up to $10,000 of undergraduate student loan relief (up to five years) for every borrower working in public service. Donald Trump The Trump campaign hasn’t said much about the President’s plans for student debt and college affordability, but voters can get a sense of what might be in store based on what he’s already done as president. One thing that is clear: If reelected, the president likely won’t pursue a free college program. “The reality of Biden’s ‘free college’ plan is that it’s anything but free, and he and his campaign should explain to the American people what the total cost of their socialist plan is and how they expect to pay for it,” Courtney Parella, deputy national press secretary for the Trump campaign, wrote in an emailed statement. Trump’s Secretary of Education, Betsy DeVos, has rolled back an Obama-era provision that required for-profit colleges to prove they were preparing students for gainful employment. In May, Trump vetoed a bipartisan bill passed by Congress that would have required the Education Department to implement an Obama-era version of the “borrower defense rule,” a legal process borrowers can use to have their student loans cancelled if they believe they’ve been defrauded by their colleges. The Trump administration has described the 2016 version of the borrower defense rule as an “overreach,” arguing that its version of the rule would save taxpayers $11 billion over the next 10 years. Borrower advocates have said that the DeVos-era Department of Education’s approach to the borrower defense process would make it difficult for borrowers who have been scammed by for-profit colleges to obtain relief. They’ve also sued DeVos and the Department multiple times over their implementation of the rule. Biden has vowed a return to the for-profit college rules honed during the Obama administration, but Taylor of the Debt Collective — which through its organization of for-profit college borrowers, helped push the Obama administration to streamline the process for discharging debt held by scammed borrowers — said it’s not enough. The Debt Collective has argued for years that the Obama administration didn’t work fast enough when it was clear that major corporations that would ultimately collapse were defrauding students. “The for-profit education sector needs to be eliminated,” Taylor said. “There’s so much data, there’s so much research that shows that they are predatory actors that prey on vulnerable communities.” In 2019, Trump signed a memo that would discharge the student debt of permanently disabled veterans. Prominent Democratic lawmakers have said the memo doesn’t go far enough, arguing that the administration should grant an automatic discharge to all permanently and totally disabled borrowers. These borrowers have a legal right to have their debts wiped away, but they have to face an often challenging bureaucratic process to do so. This summer the Trump administration extended the pause on student loan payments and collections that Congress implemented through the CARES Act, the coronavirus stimulus bill, through Dec. 31. The pause was originally set to expire on Sept. 30. “There was a recognition during this recession that student borrowers were going to have the bottom fall out from under them,” Huelsman said. But it’s unclear what, if any, relief borrowers might receive after the payment pause expires, he said. “For all intents and purposes, the economy is probably not going to be in much better shape than it is now,” at the start of the new year, he said."}]}