{"article": [{"url": "https://www.marketwatch.com/story/after-years-of-talk-tech-companies-appear-to-be-getting-serious-about-diversity-efforts-2020-06-25", "published": 1593520460.0, "headline": "After years of talk, tech companies appear to be getting serious about diversity efforts", "body": "Six years ago today, Facebook Inc. released statistics on the makeup of its global workforce that did not reflect the demographics of its users: Just 3% of its workers were black. The company, citing the creation of a diversity team a year before, vowed to make more hires with lower attrition for under-represented groups. It formed partnerships with key groups to find more women and people of color. And it began offering training to employees in unconscious bias. “We have a long way to go, but we’re absolutely committed to achieving greater diversity at Facebook and across the industry,” Maxine Williams, Facebook’s then-global head of diversity, said at the time. Fast forward to 2020, and Facebook’s FB, +0.26% black workforce has increased to just 3.8%. In a blog post last week, Chief Operating Officer Sheryl Sandberg announced a new effort with more specific goals and support: The company committed to a 30% increase in the number of people of color in leadership positions over the next five years, and will devote $200 million to support black-owned businesses and organizations — part of a $1.1 billion investment in black and diverse suppliers and communities in the U.S. The move from nebulous efforts that proved to be mostly lip service to concrete plans and financial commitments, including specific hiring goals and amounts of money dedicated to the effort, go beyond Facebook. A raft of large and small tech companies have made proclamations in recent days, including Google parent Alphabet Inc. GOOGL, +1.82% , GOOG, +1.97% , Netflix Inc NFLX, +1.43%, Microsoft Corp. MSFT, +2.48% , SAP SE SAP, +0.65% , Apple Inc. AAPL, +1.74% , Mozilla Corp., Pinterest Inc. PINS, -0.50% , Reddit and a number of startups. Undoubtedly, more are to come. Cisco Systems Inc. CSCO, +0.15% , for example, is expected to share plans soon, according to a person familiar with the company’s strategy. See also: Here are tech companies’ plans for increasing diversity amid protests over racial inequality Whether the statements lead to action after years of empty slogans, broken promises and countless panels and working groups on the topic is far from certain, black tech workers and diversity advocates told MarketWatch. “We’ve agreed [inclusion] was a problem since at least 2013, but everyone was waiting for everyone else to do something,” Larry Whiteside Jr., president of International Consortium of Minority Cybersecurity Professionals, which is pushing the cybersecurity industry to hire and recruit more minorities, said in a phone interview. “Social protests have forced the hands of companies, large and small, to take action. It is time.” Companies have been prompted, in large part, by two once-in-a-generation events — a pandemic not seen in the U.S. for a century, coupled with a social protest movement unlike any since 1968 — to finally move the needle on the hiring of minorities at tech companies, employment experts told MarketWatch. “There is a sense of urgency; recent events accelerated our plans,” Judith Williams, SAP’s global head of people sustainability and chief diversity and inclusion officer, told MarketWatch. “We have to change the dynamic of our industry, and better reflect society.” Vows of improved representation aren’t new. For years, tech’s largest players have undertaken efforts to broaden the diversity of their workforces — albeit with minimal progress, as evidenced by the percentage of black tech workers. Black people accounted for 9% of workers in core information-technology occupations in the U.S. last year, compared with 8% in 2015 and 7% in 2010, according to U.S. Bureau of Labor Statistics. Blacks represent 13.4% of the U.S. population, according to the most recent government estimates. “My worry at the beginning of COVID was that companies would see that as an opportunity to take a pass on hiring black women and Latinas, as they did during the 2008 financial crisis,” said Bertina Ceccarelli, chief executive of nonprofit NPower, a leader in tech training programs. “But with the recent protests and acute visibility of systemic racism, this encourages companies to expand recruiting and training plans.” Any progress would be an improvement, she said, citing a two-year study conducted by NPower that shows only 4% of the nation’s tech workforce are black women. See also: Black tech workers hope nationwide protests will force industry to be more inclusive “We’ve heard it before. Some of this stuff is optics. I don’t know if I want to laugh at it or shake my head,” Lisa Love, co-founder and chief marketing officer at Tanoshi, a Silicon Valley startup that provides lower-income households and school districts with educational, affordable devices to close the digital divide, told MarketWatch. “You have to start from Day One on diversity. Your company has to reflect the nation.” The four-year-old company, which is raising $2 million in a seed round, is hopeful that social awareness and empathy with the black community enhances its ability to finally secure venture-capital funding, said Love, who is black. The reticence of Love, Whiteside, and others is real. Six years after their first diversity reports, Alphabet, Apple, Facebook, Microsoft and Twitter Inc. TWTR, -0.23% have increased their black representation by low single-digit percentages, according to a CNBC analysis. Apple’s workforce is 9% black, yet black executives account for only 3% of leadership. Some tech companies have made advances, but their numbers may be skewed by gains outside of technical operations. Amazon.com Inc. AMZN, +3.01% has reported a healthy increase in black employees, to 26.5%, but those numbers are thought to largely rely on warehouse and delivery workers instead of the tech-focused workforce. The same could be said for Apple’s retail workers. Concrete goals and money to fund the efforts could make a difference, though. While others in tech were organizing panels to discuss the issue, Intel Corp. INTC, -1.03% in early 2015 pledged $300 million toward diversity efforts and set 2020 as a deadlines to reach “full representation” in hiring. The company said that it actually achieved that goal in 2018, and is continuing the effort: In a May Corporate Responsibility Report, the company released diversity goals of increasing the number of women in technical roles to 40% and doubling the number of women and underrepresented minorities in senior roles by 2030. After years of fitful starts and unfulfilled promises, the flurry of announcements and pronouncements give hope to people like Jill Barnard, chief financial officer of Televerde, a sales and marketing technology company based in Phoenix. “Most companies just stay in the lane of what is legally required,” Barnard, who is white, told MarketWatch. “We can all do better.”"}]}