{"article": [{"url": "https://www.marketwatch.com/story/kevin-o-leary-says-investing-100-a-week-will-make-you-a-millionaire-by-retirement-2020-09-24", "published": 1602157340.0, "headline": "Kevin Oâ\u0080\u0099 Leary says investing $100 a week will make you a millionaire by retirement", "body": "Everyone approaches retirement differently, but thereâ\u0080\u0099s only one way they should really prepare for it: by investing, said Kevin Oâ\u0080\u0099Leary, a host of ABCâ\u0080\u0099s DIS, +1.53% television series â\u0080\u009cShark Tank.â\u0080\u009d Some people plan for retirement over the course of their careers, while others wait to think about that next stage of their lives when it gets closer. Not all Americans save adequately for their old age, partially because they canâ\u0080\u0099t afford to do so or because they have other, more present-day financial obligations, such as student loans, child care and high costs of living, to worry about. Still, thereâ\u0080\u0099s a portion of the population, albeit small, that pursues retirement early â\u0080\u0094 in some cases, by the time theyâ\u0080\u0099re in their 30s or 40s. They do so by living frugally and dedicating most of their income to the stock market. This movement is known as FIRE, short for â\u0080\u009cfinancial independence, retire early.â\u0080\u009d Oâ\u0080\u0099Leary, founder of the Oâ\u0080\u0099Leary Financial Group, originally spoke about the FIRE movement with Grant Sabatier, an early retiree and host of the Millennial Money podcast, where they also discussed the skills it takes to achieve such a feat. The â\u0080\u009cShark Tankâ\u0080\u009d host, known as Mr. Wonderful on the show, spoke with MarketWatch about how feasible saving for retirement is for most Americans, how they can become millionaires by the time they retire and why Americans need to take the concept of financial independence so seriously. This interview was edited for clarity and length. See: A recession wonâ\u0080\u0099t end the FIRE movement, but it will change it for the better MarketWatch: What were your first thoughts about the FIRE movement and how feasible do you think it is for most Americans? Kevin Oâ\u0080\u0099Leary: It is a very strong, motivational platform. I like the idea of it. The old idea of retiring at 65 or even 60, or 62 â\u0080\u0094 those targets donâ\u0080\u0099t even make sense anymore. The economy has changed so much and a lot of people didnâ\u0080\u0099t start saving soon enough. I make the point that the pandemic has exposed one of those classic â\u0080\u009cking has no clothes onâ\u0080\u009d situations. When I was doing PPP [Paycheck Protection Program] loans with the companies Iâ\u0080\u0099m an investor of, I discovered a majority of them did not have anything saved or even invested for retirement. Some of these people are in their late 20s, some in their late 30s, some in their late 40s. That exposed a big problem to me and the more I dug into it, I found out more than 100 million Americans donâ\u0080\u0099t even have any investment accounts. Thatâ\u0080\u0099s over a third of the population who donâ\u0080\u0099t have anything saved for retirement. So I like the idea of focusing on retirement because it is a wake-up call. But the truth is, when you come to that point in your life, a majority of the people donâ\u0080\u0099t have enough to retire on, given how low interest rates are for savings accounts and they havenâ\u0080\u0099t invested in the markets properly over their entire career. I founded a new app to help solve this problem, Iâ\u0080\u0099m the chairman of it â\u0080\u0094 itâ\u0080\u0099s called Beanstox â\u0080\u0094 and it helps people pull small amounts of capital into a portfolio that invests for them over the next 20, 30, 40 years. MW: You work with a lot of small-business owners, many of whom have been impacted by this pandemic. How can people, especially entrepreneurs and small-business owners, manage keeping their livelihood afloat but also think about their futures and future savings? Oâ\u0080\u0099Leary: Iâ\u0080\u0099ve learned over the years working with all kinds of people â\u0080\u0094 business owners, entrepreneurs, my own employees â\u0080\u0094 that thereâ\u0080\u0099s a very simple tactic you can take in your life that determines whether or not youâ\u0080\u0099re going to be OK when you retire. I call it the 90-day test. It is very simple, and doesnâ\u0080\u0099t even require any technology. Look at everything you bring in, it could be a side hustle, a salary. All of the income, every single dime of it. Then you do the same thing for expenses. What youâ\u0080\u0099ll find is many people are living above their means, and theyâ\u0080\u0099re spending more in a 90-day period than theyâ\u0080\u0099re taking in. Where you find it manifested is credit card debt, which is being charged at 18-21%. It puts people in a horrible place. Youâ\u0080\u0099re losing your net worth every year doing this. The way you change it is so simple. Most people buy stuff they donâ\u0080\u0099t need. So I say everybody can reduce their cash out by about 15%, minimum. It is very simple to do. You just look at the thing youâ\u0080\u0099re going to buy and ask â\u0080\u009cdo I need this or should I take this money and invest it?â\u0080\u009d There are so many different apps that do this. I created one because I couldnâ\u0080\u0099t find what I wanted. Iâ\u0080\u0099m not asking people to become stock pickers and technicians and day traders or to round up their credit card purchases. I am telling people, you can find a way to save $100 a week and invest it. One hundred bucks a week. Thereâ\u0080\u0099s some crap you donâ\u0080\u0099t need to buy that equals $100 and if you do that and start in your early 20s, youâ\u0080\u0099ll end up with $1.5 million in retirement. Thatâ\u0080\u0099s my mission, thatâ\u0080\u0099s my goal. MW: Along with investing apps, what are some other ways Americans can better prepare for their futures? Oâ\u0080\u0099Leary: Iâ\u0080\u0099m a big investor in the wedding industry. I have many companies that service weddings. Honeyfund is one of my companies and we do wedding registries, and we also have the data for years and years. Youâ\u0080\u0099ll find that most marriages fail, most unions fail, within seven years. Fifty percent of the time it has nothing to do with infidelity. It has to do with financial stress. One partner outspends the other, they donâ\u0080\u0099t have a financial plan, they donâ\u0080\u0099t have a goal. Getting married is so euphoric, it is a wonderful thing and I totally endorse it, but you are building a business relationship in the sense youâ\u0080\u0099re going to be taking on obligations. You may buy a home, have children. These things are financial stresses and they need a plan for it. These are the things that are so mundane but when you actually go forward 10, 20 years, you figure if you have a plan you end up in a better place. When I talk to people who are planning their lives, I tell them money sits at the table with you and your family every day. I wrote three books on this, all bestsellers, but they all deal with the same problems over and over again. The basic lessons go right through to investing, having money set aside and not spending on things you donâ\u0080\u0099t need. Itâ\u0080\u0099s a huge problem in America. I used to be in the education market for years. We teach geography, math, reading and everything else, but nothing on financial literacy. Itâ\u0080\u0099s crazy. MW: A lot of people in their 20s and 30s might not want to retire too early but they have a savings number in mind that would give them financial independence. How important is it to achieve financial independence and what does that mean for you? Oâ\u0080\u0099Leary: It means that at the back-end of your life, you have the freedom to pursue the things that matter to you, whether thatâ\u0080\u0099s family, children, travel or hobbies that are important to you. The whole idea of wealth is happiness. I try to tell people, look, if you donâ\u0080\u0099t want tremendous stress in life, because a lot of stress can be unhealthy, you have to have a plan that allows you to have a lifestyle you want to have when youâ\u0080\u0099re past 60 years old. Now what matters to people is: their health, their ability to see their children, if they have them, or their family, the ability to travel. The pandemic has squashed that for a while but we have to make an assumption that in six months from this, things are somewhat normalized. You have to start thinking about what you can get from investing. The market provides on average 6-8% on an annual basis over a long period of time, so you have to start thinking, OK, can I live off of 6% of my portfolio, and after it pays 2% in taxes a distribution of 4%. Youâ\u0080\u0099re going to find you really want to get to $750,000 to $1.5 million invested, so that you can live off of that. The average salary in America is $58,000, and if you work backward, you can save $100 a week. You can put that money in the market, and buy an indexed or exchange-traded fund. Also see: These early retirees saw their investments plunge more than $200,000 â\u0080\u0094 but stoll manage to stay calm MW: How do you think we as a society can do better to help Americans achieve greater financial literacy? Oâ\u0080\u0099Leary: Number 1: Education. Number 2: Making investing really easy and that is one of my mandates for myself in 2021-2022. Iâ\u0080\u0099m crisscrossing the country and doing all kinds of virtual educational events. I developed the app because I learned how hard it is. With it, you can put $100 aside, and build a diversified portfolio. When I first started this journey in financial literacy, I made the assumption people know how to buy stocks and bonds but of course they donâ\u0080\u0099t, we donâ\u0080\u0099t teach them that. MW: Do you think there are any major misconceptions that keep people away from investing? Oâ\u0080\u0099Leary: Thereâ\u0080\u0099s this idea of daytrading that has become very popular, which to me is a speculative gamble really. That is not investing. MW: Was there a time you can remember when you felt you had achieved financial independence? Oâ\u0080\u0099Leary: I was very fortunate. One of my companies was a huge success. It started in a garage and we sold the Learning Company for $4.2 billion. All the founders overnight had this big liquidity event. I tried to retire for three years. I had this strategy, I wanted to see every beach on Earth. It was one of the things I wanted to do. To see these amazing beaches â\u0080\u0094 in Cyprus, Cambodia, Vietnam and Europe. I did them all and I was bored out of my mind. This isnâ\u0080\u0099t life, this sucks. It was going from one place to another and saying I hit this beach. So I have seen every beach on Earth, every beach thatâ\u0080\u0099s famous, but to me that is not an achievement at all. Now I work harder than ever on the things that matter to me. You have to find out what you want with your life, what makes you happy, and how you want to burn your hours of the day. I really enjoy what I do and the only reason I can do it is because I have financial freedom. I achieved it because I worked for it, but retirement doesnâ\u0080\u0099t work for me. MW: In your experience, how have you seen the concept of retirement change and what do you think is most important for people to know when it comes to pursuing some sort of retirement security for themselves? Oâ\u0080\u0099Leary: Retirement isnâ\u0080\u0099t what it used to be in the â\u0080\u009860s, â\u0080\u009870s and â\u0080\u009880s. Retirement now is a change in how you spend your day. Thatâ\u0080\u0099s all. Itâ\u0080\u0099s just a change in how you spend your time and a change in what you pursue. If you elect to pursue something that doesnâ\u0080\u0099t have income associated with it, you need to accumulate enough money in an investment account so it can pay you."}]}