{"article": [{"url": "https://www.marketwatch.com/story/weekend-reads-an-early-warning-sign-for-teslas-stock-2020-09-04", "published": 1599470900.0, "headline": "Weekend reads: An early warning sign for Teslaâ\u0080\u0099s stock", "body": "The tech-heavy Nasdaq Composite Index, after a long and steady rally this year, suffered its biggest two-day loss since mid-March to close out the week. Before those declines, there were warning signs from Wall Street analysts who ordinarily shy away from rating any stock a â\u0080\u009csell.â\u0080\u009d Shares of Tesla TSLA, +1.89% Â had more â\u0080\u009csellâ\u0080\u009d ratings than â\u0080\u009cbuyâ\u0080\u009d ratings, and so did 62 other stocks in the Russell 1000 Index RUI, +0.88%. William Watts explains why itâ\u0080\u0099s too early to call the tech-stock decline a correction. Related Tesla and tech stories: â\u0080¢â\u0080\u0089Teslaâ\u0080\u0099s stock story is one of newbs and rubes â\u0080\u0094 but not quite the way you think it is â\u0080¢â\u0080\u0089Teslaâ\u0080\u0099s stock sinks again to kick off a correction after disclosure of another large seller â\u0080¢â\u0080\u0089After Apple and Tesla stock splits, read this before jumping inWhat the eviction moratoriums really mean The U.S. Centers for Disease Control has ordered a moratorium on evictions through the end of the year to keep people from being displaced during the COVID-19 crisis. Treasury Secretary Steven Mnuchin expects the moratorium to protect about 40 million renters. But if you rent your home, you need to understand important details of the order to make sure you are eligible, as Jacob Passy explains. Related:California eviction moratorium is â\u0080\u0098a real nightmareâ\u0080\u0099 for renters to understand â\u0080\u0094 hereâ\u0080\u0099s what you need to know Getty Images/iStockphoto The desire to retire â\u0080\u0094 when expenses are high Alessandra Malito helps a man 15 years older than his wife who wishes to stop working. They are both high earners, but they have a problem with expenses.Worried about voting by mail? Look to Oregon.Debt and inheritance Quentin Fottrell â\u0080\u0094 MarketWatchâ\u0080\u0099s Moneyist â\u0080\u0094 helps a woman who is concerned about how much of her husbandâ\u0080\u0099s debts she might be liable for if he dies. These affairs may not be so simple, depending on which state you live in. Getty Images Donâ\u0080\u0099t Social Security benefits keep increasing over time? Maybe not.What to do when your online trading service is down Several online brokerage services, including Robinhood, Charles Schwab SCHW, +1.29%, TD Ameritrade US:AMTD and E-Trade US:ETFC Â went down or slowed Aug. 31. Michael Brush has tips on how to lower your risk before these events and what to do when they occur. Estate tax planning Inheritance planning isnâ\u0080\u0099t only for the wealthy. The tax implications for your inheritors can be difficult for them. Bill Bischoff â\u0080\u0094 MarketWatchâ\u0080\u0099s Tax Guy â\u0080\u0094 shares four ways to ease the burden on those you love.Vanguard revises a tax estimate â\u0080\u0098downward by a factor of 15â\u0080\u0099 Vanguard founder John Bogle supported a small tax on financial transactions, but Vanguard itself argued against it in January. But now the mutual fund giant has revised its estimates of how much investors and traders would actually pay, by quite a bit. Michael Edesess explains the math and why Vanguard is still against a transaction tax. Supplied by the company Bored with the stock market? Hereâ\u0080\u0099s an easy alternative If you would like to invest in something real, away from the stock and real-estate markets, Lina Saigol may have something for you. She describes a new and easy platform that lets you invest in rare collectibles for as little as $5. Want more from MarketWatch? Sign up for this and other newsletters, and get the latest news, personal finance and investing advice."}]}