{"article": [{"url": "https://www.marketwatch.com/story/people-are-becoming-less-comfortable-about-air-travel-during-the-pandemic-survey-shows-2020-08-17", "published": 1597673420.0, "headline": "Airlines want people to believe that air travel is safe during the pandemic, but travelers are skeptical", "body": "In a bid to survive, airlines are desperately trying to convince a wary public that measures like mandatory face masks and hospital-grade air filters make sitting in a plane safer than many other indoor settings during the coronavirus pandemic. It isn’t working. Surveys indicate that instead of growing comfortable with air travel, more people are becoming skeptical about it. In the United States, airline bookings have stalled in the past month after slowly rising — a reaction to a new surge of reported virus infections. Globally, air travel is down more than 85% from a year ago, according to industry figures. The implications for the airline industry are grave. Several leading carriers already have filed for bankruptcy protection, and if the hoped-for recovery is delayed much longer, the list will grow. The four largest U.S. airlines lost a combined $10 billion from April through June. Their CEOs say they will survive, but they have lowered their expectations for a rebound. “We were all hoping that by the fall the virus might run its course,” said Southwest Airline LUV, +1.89% s CEO Gary Kelly. “Obviously, that has proven to be dead wrong.” When Consumer Reports surveyed more than 1,000 people in June about their comfort with various activities during the pandemic, 70% said flying was very or somewhat unsafe. They rated going to a hospital emergency room or standing in line to vote as safer. In a survey commissioned by an airline trade group, the biggest concern of travelers was the possibility of sitting next to an infected person. John Kontak, a schoolteacher from Phoenix, said that was his fear as soon as he stepped onto a crowded American Airlines flight this summer to visit his parents in Ohio. “I don’t know anything about this person who is sitting a foot away from me,” Kontak said. “They took the bottom line or the dollar over the safety of passengers. Next time, I’d rather drive back to Ohio than fly — it’s safer because I can control it.” The U.S. Centers for Disease Control and Prevention says sitting within 6 feet (2 meters) of other passengers, often for hours, may increase the risk of getting COVID-19. But CDC also notes that most viruses and other germs don’t spread easily on flights because of how air circulates on planes. Standard & Poor’s said this week that the industry’s prospects have gone “from bad to worse,” with global air traffic dropping by up to 70% this year. In May, S&P said a 55% drop was a worst-case scenario. “It’s going to be a slower and more uneven recovery than one might have expected,” S&P analyst Philip Baggaley said. An airline trade group, the International Air Transport Association, predicts carriers will lose $84 billion this year, making it the worst year in the industry’s history. The group says traffic won’t fully recover until 2024. Asia, where outbreaks were brought under control earlier, is doing better than the U.S. and Europe. Domestic travel inside China has recovered to about two-thirds its year-ago level. In the U.S., traffic is less than one-third of 2019 levels. Air traffic at Europe’s more than 500 airports has tumbled, down 94% in June compared with the same month last year. There were about 4 million passengers, compared with 217 million a year earlier. Travel ticked up when more than two dozen European countries opened borders to one another in early July, but virus cases are rising in several countries, leading to reimposed restrictions. This week, the U.K. imposed a 14-day quarantine requirement on travelers — even Britons returning home — from France and the Netherlands. Travel from outside Europe, including the United States, is still restricted. In the United States, traffic picked up after collapsing by 95% in April but has stalled — down 74% in July, 72% in August. Airlines came into this crisis in the best shape ever financially, thanks to rising demand for travel, reduced competition through mergers, and billions raised by extra fees. Among international carriers, the big state-backed airlines are almost certain to survive. In Asia and the Middle East, they are often seen as vital contributors to the overall economy. Similarly, big European carriers including Lufthansa, Air France-KLM and British Airways may be too important to let fail. It’s too late for U.K.-based Flybe; it shut down in March. Latin America’s two biggest airlines, Avianca and Latam, filed for bankruptcy protection. So did Aeromexico. Virgin Atlantic and Virgin Australia, both part of British mogul Richard Branson’s galaxy of companies, are using the courts to reset debts. In the U.S., Trans States and Compass, which flew smaller planes for the major airlines, and Alaska-based Ravn Air shut down, but the big airlines have survived with billions in government aid and billions more in private borrowing. U.S. airlines have scrambled to reassure travelers that planes are safe. They require passengers to wear face masks and are cleaning cabins more thoroughly, even spraying seats with anti-microbial mist. “You can smell the cleaning fog that’s been done, and everything is wiped down basically top to bottom – chairs, window shades, even the light switches and overhead bins,” said Jason Bounds, a veteran flight attendant at Delta Air Lines. The airlines split in one regard. Delta DAL, +0.39% , Southwest, JetBlue JBLU, -0.07% and Alaska leave some seats empty to create room between passengers. United, American and Spirit do not, arguing that social distancing is impossible on a plane. Most flights have plenty of empty seats, but scenes of full planes alarm travelers. Carol Braddick, a business coach and consultant who splits her time between Phoenix and England, was so worried about the American Airlines AAL, +0.34% leg of her journey to the U.K. that she sought out a COVID-19 test after arriving. “The person I was sitting next to was drinking nonstop, shouting to his friend a row behind him; they were shouting back and forth,” Braddick said. “The combination of alcohol, shouting and no mask is unacceptable, and the flight attendant did nothing.” Braddick put off plans for a couple of short holiday trips within Europe this summer. “The new reality for us is fewer trips, longer stays, and being much more selective about which airline we’ll fly,” she said. Even frequent flyers like Seth Miller, who writes about travel at his PaxEx.aero website, are grounding themselves. “Much as I love and miss travel, it just doesn’t seem worth the risk to me,” he said."}]}