{"article": [{"url": "https://www.marketwatch.com/story/zscaler-earnings-and-forecast-blow-by-expectations-but-stock-dips-in-after-hours-trading-11599682736", "published": 1599669260.0, "headline": "Zscaler earnings and forecast blow by expectations, but stock dips in after-hours trading", "body": "Zscaler Inc. wrapped up its fiscal year by topping all expectations with its fourth-quarter performance and forecast for its new fiscal year, but shares still sank a bit in late trading after a huge push amid pandemic-influenced demand. Zscaler ZS, +2.91% is a security-software offering focused on the cloud, which has made it a popular offering for companies suddenly moving to cloud architecture to support workers who were sent home during the COVID-19 pandemic. Investors have jumped on the stock, which entered the public markets in 2018, and it has more than tripled in the past six months. Zscaler on Wednesday afternoon reported fiscal fourth-quarter losses of $45.9 million, or 38 cents a share, on sales of $125.9 million, up from $86.1 million a year ago. After adjusting for stock-based compensation and other factors, Zscaler reported earnings of 5 cents a share, down from adjusted earnings of 7 cents a share a year ago. Zscaler also reported $194.9 million in billings, an important metric for many software companies that reflects expected long-term revenue under contracts signed during the quarter. Analysts on average expected Zscaler to report adjusted earnings of 3 cents a share on sales of $118.6 million and billings of $175.2 million. For the full year, Zscaler revenue grew 42% to $431.3 million, while adjusted earnings grew to 24 cents a share from 22 cents a share. For the new fiscal year, which began in August, Zscaler guided for revenue growth of roughly 35%, predicting adjusted earnings of 28 cents to 30 cents a share on sales of $580 million to $590 million and billings of $710 million to $720 million. Analysts on average were projecting adjusted earnings of 28 cents a share on sales of $556.1 million and billings of $669.4 million. Zscaler shares dipped between 1% and 4% in after-hours trading immediately following the release of the report, after closing with a 0.8% increase at $134.19. The share price has grown almost 190% so far this year, as the S&P 500 index SPX, +0.87% has returned 4.5%."}]}