{"article": [{"url": "https://www.marketwatch.com/story/tesla-at-2000-is-new-bull-case-for-morgan-stanley-2020-07-07", "published": 1594626320.0, "headline": "Tesla at $2,000 is new â\u0080\u0098bull caseâ\u0080\u0099 for Morgan Stanley", "body": "â\u0080\u009cResilientâ\u0080\u009d demand for Tesla Inc. vehicles is making the Silicon Valley car maker appear as a less risky company that is on more solid financial footing than other car makers. Thatâ\u0080\u0099s from analyst Adam Jonas of Morgan Stanley, who on Tuesday upped his price target on TSLA, +1.89% Â shares to $740, implying a downside of around 47% from Tuesdayâ\u0080\u0099s share price. Jonas also set a â\u0080\u009cbull case scenarioâ\u0080\u009d stock price of $2,070, an upside of around 48%. According to FactSet, which surveyed 32 Tesla analysts, the average price target on the stock is $778, with a handful of outliers setting price targets above $1,000. Recently, analyst Dan Ives of Wedbush also set a â\u0080\u009cbull case scenarioâ\u0080\u009d for Tesla shares at $2,000 alongside his price target of $1,250. Teslaâ\u0080\u0099s second-quarter production and delivery numbers were â\u0080\u009csignificantly aheadâ\u0080\u009d of Morgan Stanleyâ\u0080\u0099s expectations in a three-month period that was shaping up to be â\u0080\u009cextremely difficult,â\u0080\u009d Jonas said. Donâ\u0080\u0099t miss:Tesla stock rockets higher as quarterly sales crush expectations â\u0080\u009cTesla has demonstrated one very powerful differentiating quality vs. many of its auto peers: demand is holding up better,â\u0080\u009d Jonas said in his note. Tesla may see some cash burn from its working capital but it is â\u0080\u009cin position to post an above break-even U.S. GAAP result in (the second quarter).â\u0080\u009d Some long-term concerns remain, chiefly around profits in China, â\u0080\u009cpoorâ\u0080\u009d fundamentals for the auto industry in general, and the â\u0080\u009cinevitableâ\u0080\u009d competition in EV and in autonomous vehicles from well-heeled companies such as Amazon.com Inc. AMZN, +3.01%, Apple Inc. AAPL, +1.74%, Alphabet Inc. GOOG, +1.97% Â and others, Jonas said. Tesla shares have been on a tear in recent sessions, boosted by the quarterly sales data, and on Tuesday were poised for a fifth straight record close. The stock has gained 235% this year, contrasting with losses of 2% and 8% for the S&P 500 index SPX, +0.87% Â and the Dow Jones Industrial Average. DJIA, +0.56% Â"}]}