{"article": [{"url": "https://www.marketwatch.com/story/were-looking-for-a-place-thats-not-too-hot-not-too-cold-and-accepting-of-different-races-where-should-we-retire-2020-07-01", "published": 1595161880.0, "headline": "Weâ\u0080\u0099re looking for a place thatâ\u0080\u0099s not too hot, not too cold, and accepting of different races â\u0080\u0094 where should we retire?", "body": "Dear MarketWatch, We are an Asian Indian couple with about $50,000 a year to spend. We can also afford to buy a house in addition to this. Please help us find places where it doesnâ\u0080\u0099t get too hot in the summer (or colder than Boston in the winter). We also want to live in a place where people are used to and accept different races of people â\u0080\u0094 maybe a college town? Please help us retire! Victor Dear Victor, Not too hot, not too cold, plus acceptance of whoever we are â\u0080\u0094 that Goldilocks scenario is what so many people are looking for. With $50,000 to spend in addition to housing, there are many places that can work for you. There also are many other factors you may want to consider that reflect your own interests, so please take these suggestions as a starting point. If youâ\u0080\u0099re looking for a substantial South Asian community, search for an Indian grocery store. Cary, N.C., and Ann Arbor, Mich., both came up when I looked at a list of Patel Brothers supermarkets, for example. This list of affluent and diverse communities with more than 60,000 residents may inspire other possibilities. You donâ\u0080\u0099t say where you live, unless that reference to Boston weather is my hint. If so, the high property values there could leave you with more money than most for your next house and give you a wider list. I assume youâ\u0080\u0099ve considered and ruled out the New York tri-state area, which certainly fits for diversity but has the downside of cost. Iâ\u0080\u0099m ruling out Florida, Texas and other southern states because of the heat. Here are three college towns to consider. An added bonus: none of these states tax Social Security benefits. As always, make sure you see these places at their worst as well as at their best, whether that reflects the weather, an empty campus or something else. Consider a short-term rental to better explore the area, interact with more residents and decide whether itâ\u0080\u0099s truly a good fit. Talk to a tax pro if thatâ\u0080\u0099s a big concern. Moves are costly; you donâ\u0080\u0099t want to make a big mistake. Winding walking path in Pullen Park, Raleigh, N.C. Getty Images/iStockphoto The Research Triangle area in North Carolina You have three major universities anchoring this region. Iâ\u0080\u0099m not going to take sides given the college sports rivalries down there or even try to pick which city is better â\u0080\u0094 Iâ\u0080\u0099ll leave that to readers in the comments section. Gentrifying Raleigh, the state capital, is home to North Carolina State University and is the biggest with 1.4 million people, â\u0080\u009crough-cut gemâ\u0080\u009d Durham, with close to 285,000 people, has Duke University, and Chapel Hill has the University of North Carolina and about 60,000 residents. Donâ\u0080\u0099t forget fast-growing, suburban Cary as well as Wake Forest (just donâ\u0080\u0099t look for Wake Forest University here) and Carrboro, where the heart of downtown is â\u0080¦ the mostly organic food co-op. Homes are most expensive in Chapel Hill and cheapest in Raleigh and Durham. Using Realtor.com, which like MarketWatch is owned by News Corp., hereâ\u0080\u0099s whatâ\u0080\u0099s on the market now in Raleigh, Durham, Cary and Chapel Hill. Summers may get a bit hot, but the mountains and the coast are just a few hours away. The flip side is that the average low in January is 30 degrees. As for travel, the region boasts a large airport. Downtown Ann Arbor. Getty Images Ann Arbor, Mich. Hereâ\u0080\u0099s a quintessential college town: the University of Michigan and its 43,000 students permeate this city of 121,000. The university is ranked third among public universities by U.S. News & World Report, and it has a large, walkable downtown. Livability.com, which called Ann Arbor the best place to live in America in its 2018 rankings, praised it as a â\u0080\u009cbustling, progressive, park-filled paradiseâ\u0080\u009d and described it â\u0080\u009cnothing if not eclectic.â\u0080\u009d When youâ\u0080\u0099ve had enough of a college town, you can always head to Detroit just 45 minutes away, eventually cross the border to Canada or grab a flight from Detroit Metropolitan Wayne County Airport. Take a look at the housing market, using current listings on Realtor.com. Weather-wise, this wonâ\u0080\u0099t be that different from Boston. But when youâ\u0080\u0099re retired, you can always choose to travel during the winter. A vineyard in Oregonâ\u0080\u0099s Willamette Valley. iStockphoto Corvallis, Ore. Would you go west? This city of about 60,000 is cheaper than hipster Portland and has been ranked as one of Americaâ\u0080\u0099s best college towns (Oregon State University, with about 29,000 students, is here). Itâ\u0080\u0099s walkable, has free public transportation, is one of the most bike-friendly communities in the country and offers plenty of outdoor possibilities. Winters are warmer than Boston â\u0080\u0094 the average lows are just 36 degrees. Average summer highs are in the lower 80s. The rap on Oregon weather, though, is rain. Youâ\u0080\u0099ll certainly get plenty of that in the winter, but this town is drier than Eugene less than an hour to the south. And is rain a fair trade-off for minimal snow? Corvallis isnâ\u0080\u0099t as diverse as either Raleigh or Ann Arbor, but itâ\u0080\u0099s one of the more liberal areas in this state. Itâ\u0080\u0099s at the center of the Willamette Valley, an area surrounded by mountains and home to Oregonâ\u0080\u0099s wine country. Livability.com says â\u0080\u009citâ\u0080\u0099s like living in a national park.â\u0080\u009d Plus youâ\u0080\u0099d be an hour from Oregonâ\u0080\u0099s rocky coast and less than two hours from Portland. Homes are pricier than much of the Triangle and similar to Ann Arbor. Hereâ\u0080\u0099s what properties are on the market now. Readers, where should this couple move?"}]}