{"article": [{"url": "https://www.marketwatch.com/story/beauty-salons-bowling-alleys-and-music-venues-reopen-this-weekend-as-government-doubles-mask-fines-2020-08-14", "published": 1597407260.0, "headline": "Beauty salons, bowling alleys and music venues reopen this weekend, as U.K. government doubles mask fines", "body": "Beauty salons, small wedding receptions and some music venues will be able to resume this weekend, as the government further eases the lockdown rules to try to kick-start the U.K. economy, which has plunged into the deepest recession since records began. But fines will double to a maximum of £3,200 ($4,200) for those who “repeatedly flout” face covering rules. Prime Minister Boris Johnson said that most people in the U.K. are following the rules and doing their part to control the virus, but stressed that they must remain focused and cannot be complacent. “That is why we are strengthening the enforcement powers available to use against those who repeatedly flout the rules. At every stage I have said our plan to reopen society and the economy is conditional and that it relies on continued progress against the virus,” Johnson said. Read:‘No masks please, we’re British:’ When it comes to face coverings, Europeans, Americans and Asians have very different views Fines will also be introduced for people hosting illegal raves or other unlawful gatherings of more than 30 people. From Aug. 15, beauty salons, tattoo studios, spas and barbers in England will be able to offer all close-contact services and treatments, including eyebrow threading, eyelash treatments and facials under new guidance. Hairdressers and salon staff will be required to wear surgical face masks as well as clear visors, after the government’s scientific advisers said stricter social distancing measures should be brought in. The government said that two weeks ago the Office for National Statistics had expressed concerns about a slight increase in the number of people in England testing positive, but the situation now seems to have “leveled off.” The easing of lockdown restrictions comes just two days after the U.K. economy contracted by 20.4% in the three months ended in June, the worst performance among European major economies, and the sharpest fall of the G-7 group of the world’s biggest industrial powers. Read:British economy suffered record collapse in the second quarter Bowling alleys, skating rinks and casinos will also reopen for the first time this weekend, as well as some indoor theaters, music and performance venues, with socially distanced audiences under updated performing arts guidance. Under the plans there will also be trials of sports events with socially distanced spectators, which were canceled at short notice last month as infections rose. “I am pleased to give these often small, independent businesses a much-needed boost as we progress with our plan to kick-start the economy to protect jobs and incomes,” business secretary Alok Sharma said."}]}