{"article": [{"url": "https://www.marketwatch.com/story/tulsa-health-official-trump-rally-likely-contributed-to-coronavirus-surge-2020-07-08", "published": 1594237160.0, "headline": "Tulsa health official: Trump rally 'likely contributed' to coronavirus surge", "body": "OKLAHOMA CITY - President Donald Trump's campaign rally in Tulsa in late June that drew thousands of participants and large protests \"likely contributed\" to a dramatic surge in new coronavirus cases, Tulsa City-County Health Department Director Dr. Bruce Dart said Wednesday. Tulsa County reported 261 confirmed new cases on Monday, a one-day record high, and another 206 cases on Tuesday. By comparison, during the week before the June 20 Trump rally, there were 76 cases on Monday and 96 on Tuesday. Although the health department's policy is to not publicly identify individual settings where people may have contracted the virus, Dart said those large gatherings \"more than likely\" contributed to the spike. \"In the past few days, we've seen almost 500 new cases, and we had several large events just over two weeks ago, so I guess we just connect the dots,\" Dart said. Trump's Tulsa rally, his first since the coronavirus pandemic hit the U.S., attracted thousands of people from around the country. About 6,200 people gathered inside the 19,000-seat BOK Center arena - far fewer than was expected. Dart had urged the campaign to consider pushing back the date of the rally, fearing a potential surge in the number of coronavirus cases. Trump campaign spokesman Tim Murtaugh said the campaign went to great lengths to ensure that those who attended the rally were protected. \"There were literally no health precautions to speak of as thousands looted, rioted, and protested in the streets and the media reported that it did not lead to a rise in coronavirus cases,\" Murtaugh said in a statement. \"Meanwhile, the President's rally was 18 days ago, all attendees had their temperature checked, everyone was provided a mask, and there was plenty of hand sanitizer available for all. \"It's obvious that the media's concern about large gatherings begins and ends with Trump rallies,\" he said. Although masks were provided to rally goers, there was no requirement that participants wear them, and most didn't. A reporter who attended the Trump rally is among those who have tested positive for COVID-19, along with six of Trump's campaign staffers and two members of the Secret Service who worked in advance of the rally. Statewide, Oklahoma health officials on Wednesday reported 673 new confirmed cases of coronavirus, the state's second-highest daily total since the start of the pandemic. The new cases reported by the Oklahoma State Department of Health follow a record high of 858 cases that were reported on Tuesday and bring the total number of confirmed cases in the state to 17,893. The actual number of infections is thought to be much higher because many people haven't been tested and some who get the disease don't show symptoms. The health department also reported three additional COVID-19 deaths, bringing the statewide death toll to 407. In response to a recent surge in coronavirus cases, the cities of Norman and Stillwater have approved mandates that people must wear masks in public. Norman approved its ordinance Tuesday night after a five-hour city council meeting during which citizens on both sides of the issue spoke out. For most people, the coronavirus causes mild or moderate symptoms that clear up within weeks. But for others, especially older adults and people with existing health problems, the virus can cause severe symptoms and be fatal."}]}