{"article": [{"url": "https://www.marketwatch.com/story/canadas-appeal-to-tech-startups-grows-in-wake-of-trump-suspending-h-1b-visas-2020-07-15", "published": 1594829120.0, "headline": "Canadaâ\u0080\u0099s appeal to tech startups grows in wake of Trump suspending H-1B visas", "body": "More U.S. tech startupsâ\u0080\u0099 operations are likely to expand to Canada as the Trump administrationâ\u0080\u0099s recent restrictions on H-1B visas compound the difficulty of hiring skilled engineers, venture capitalists and entrepreneurs say. In late June, the administration barred many foreign workers from entering the U.S. through the end of the year, including many tech specialists on H-1B visas. People.ai, an artificial intelligence-driven sales management platform provider based in San Francisco, is one company looking to the U.S.â\u0080\u0099s northern neighbor. The company is opening an office in Toronto, which will allow its foreign workers to be relocated to Canada if they are forced out of the U.S., said founder and chief executive Oleg Rogynskyy. Now read:Trump signs executive order suspending H-1Bs, other visas. â\u0080\u009cThere have been so many changes to the immigration situation that happened in the last three months. Most of them are negative, and the dynamic is that nobody knows what else is going to happen,â\u0080\u009d said Rogynskyy. In 2019, 22 venture-backed San Francisco Bay Area startups opened offices in Canada, more than the total number from 2009 to 2016, according to research by Inovia Capital, a technology-focused venture capital firm. Coursera and Postmates set up both offices and remote engineering hubs in Canada last year. Through the first six months of 2020, 10 more startups were in the process of setting up offices in Canada, said Antoine Nivard, Inovia Capitalâ\u0080\u0099s principal. Also read:This one sector will be the hardest hit by Trumpâ\u0080\u0099s suspension of H-1B work visas. Canadaâ\u0080\u0099s Global Talent Stream program allows companies to hire skilled workers within weeks. In comparison, the U.S. only issues 85,000 H-1B visas each year and visa processing can take months. As a trade-off, the program encourages â\u0080\u0094 but doesnâ\u0080\u0099t require â\u0080\u0094 companies to recruit Canadians and permanent citizens before transferring engineers through the Global Talent Stream program. â\u0080\u009cOverall, there are not many options as good as Canada right now,â\u0080\u009d Rogynskyy said. The Trump administrationâ\u0080\u0099s proclamation on immigrant workers may block about 29,000 foreign workers on H-1B visas from entering the U.S. this year, according to an estimate by the Migration Policy Institute, a pro-immigration advocacy group. â\u0080\u009cEven before the proclamation, the extra scrutiny given to visa applicants under the Trump administration, the visa processing and the Green Card backlog have already been pushing people who employ tech workers to look at Canada instead of the United States,â\u0080\u009d said Julia Gelatt, a senior policy analyst at the institute. Wonolo Inc., an on-demand staffing platform provider, is another tech company that wants to tap into Canadaâ\u0080\u0099s engineering talent pool. The San Francisco-based company has an engineering team of 40, with 15 working from its Toronto office, which opened last year. Hiring an engineer in Toronto costs 30% to 40% less than in San Francisco, Wonolo co-founder Jeremy Burton said. â\u0080\u009cI expect in the next 12 to 18 months, we would double the size of the team in Toronto,â\u0080\u009d Burton said. â\u0080\u009cWeâ\u0080\u0099re overall very happy with the quality of the talent, so we plan to invest.â\u0080\u009d The company also plans to transfer some key talent from Vietnam to Canada. â\u0080\u009cItâ\u0080\u0099s much easier to get a visa for them to work in Canada than in the United States,â\u0080\u009d he said."}]}