{"article": [{"url": "https://www.marketwatch.com/story/disney-to-lay-off-28000-workers-amid-protracted-park-closures-2020-09-29", "published": 1601405780.0, "headline": "Disney to lay off 28,000 workers, exec says California â\u0080\u0098exacerbatedâ\u0080\u0099 pandemicâ\u0080\u0099s effects", "body": "Walt Disney Co. announced 28,000 layoffs in its Parks, Experiences and Products segment on Tuesday, financial victims of protracted theme-park closures caused by the coronavirus pandemic that an executive says has been â\u0080\u009cexacerbatedâ\u0080\u009d by Californiaâ\u0080\u0099s refusal to allow Disneyland to reopen. The massive job reduction was the most eye-opening among several severe cost-cutting measures made by Disney DIS, +1.53% Â , which has lost billions of dollars in potential revenue because of suspended operations at its amusement parks, live-production units and cruise lines since COVID-19-imposed closures dating back to March. Disney said in its most recent earnings report that COVID-19 had cost its theme-park business roughly $1 billion in operating income in its fiscal second quarter. â\u0080\u009cIn light of the prolonged impact of COVID-19 on our business, including limited capacity due to physical distancing requirements and the continued uncertainty regarding the duration of the pandemic â\u0080\u0094 exacerbated in California by the stateâ\u0080\u0099s unwillingness to lift restrictions that would allow Disneyland to reopen â\u0080\u0094 we have made the very difficult decision to begin the process of reducing our workforce at our Parks, Experiences and Products segment at all levels, having kept non-working cast members on furlough since April, while paying health-care benefits,â\u0080\u009d Josh Dâ\u0080\u0099Amaro, chairman of Disney Parks, Experiences and Products, said in a statement Tuesday. Disneyland and California Adventure in Anaheim, Calif., remain shuttered while theme parks in Florida, Paris, Shanghai, Japan, and Hong Kong have reopened to limited capacity. The California Department of Public Health moved some counties to new â\u0080\u009ctiersâ\u0080\u009d Tuesday allowing some businesses to reopen, but Disneylandâ\u0080\u0099s home of Orange County did not make the cut due to a late spike in cases. Disney initially planned to reopen Disneyland on July 17, but that reopening was delayed indefinitely. â\u0080\u009cAs heartbreaking as it is to take this action, this is the only feasible option we have in light of the prolonged impact of COVID-19 on our business, including limited capacity due to physical distancing requirements and the continued uncertainty regarding the duration of the pandemic,â\u0080\u009d Dâ\u0080\u0099Amaro wrote in a letter to employees. About two-thirds of the 28,000 who lost their jobs worked part-time, according to Dâ\u0080\u0099Amaro. The company did not specify how many were specifically laid off from the parks, with executives and others from the division also facing cuts. Disneyâ\u0080\u0099s parks and resorts division employs more than 100,000 in the U.S. Disney shares were down 1.4% in after-hours trading on Tuesday."}]}