{"article": [{"url": "https://www.marketwatch.com/story/oil-prices-add-to-steep-slide-as-coronavirus-flare-up-stokes-fresh-demand-worries-2020-06-25", "published": 1593098120.0, "headline": "Oil prices settle higher after 2-session drop, but demand worries persist on coronavirus flare-up", "body": "Oil futures settled higher on Thursday after posting two consecutive sessions of declines, but worries about the daily rate of increase in new coronavirus cases in the U.S. and other countries is taking a toll on expectations for demand for crude and keeping prices lower for the week. Some improvement in U.S. economic data and comments from a White House officials helped to calm traders’ nerves over the short-term prospects for the economy. “A big jump in durable goods and assurances by White House Economic Advisor Larry Kudlow that the U.S. was not going to shut the economy down gave us a boost,” said Phil Flynn, senior market analyst at The Price Futures Group. “Cornavirus fears had been driving us lower, but...Kudlow reminded the market to put the coronavirus data in perspective and focus on the positive signs that are coming out of recent economic data,” he told MarketWatch. Orders for durable goods in the U.S. jumped 15.8% in May, better than the 10.3% rise expected by economists polled by MarketWatch. Weekly initial jobless claims, meanwhile, fell slightly to 1.48 million from 1.54 million a week earlier. Against that backdrop, West Texas Intermediate crude for August US:CLQ20 tacked on 71 cents, or 1.9%, to settle at $38.72 a barrel on the New York Mercantile Exchange, following a nearly 5.9% decline on Wednesday, which marked its lowest finish for a front-month contract in a week, according to Dow Jones Market Data. Global benchmark Brent oil for August delivery UK:BRNQ20 rose 74 cents, or 1.8%, to reach $41.05 a barrel on ICE Futures Europe, after receding 5.4% on Wednesday to the lowest level since June 15. For the week, WTI is seeing a drop of 2.6% so far, while Brent has declined 2.7%. Read:AAA expects cheapest summer gasoline prices since 2016 Some U.S. states are reintroducing lockdown measures in the world’s largest economy, as well as companies including Apple AAPL, +1.74% and Walt Disney Co. DIS, +1.53%, reclosing or delaying re-opening businesses. Texas Gov. Greg Abbott said Thursday he is pausing the reopening of the state as it responds to a spike in cases of COVID-19 and hospitalizations. Delaying re-openings is “not attractive for oil traders who have been counting on improving demand,” Flynn wrote in a Thursday morning report. Commodity experts also said that a grim outlook for the global economy from the International Monetary Fund published Wednesday weighed on oil sentiment. The IMF sees a global economic contraction of 4.9%, almost 2 percentage points lower than three months ago. “We are definitely not out of the woods. We have not escaped the great lockdown,” said Gita Gopinath, the IMF’s chief economist, at a press briefing. However, weak oil demand is not expected to be the main factor impacting oil prices this year, according to he Economist Intelligence Unit. Earlier price declines were largely driven by concerns that “rising U.S. stockpiles pointed to slowing GDP growth and a potential [domestic] supply glut,” Cailin Birch, global economist at EIU, told MarketWatch. On Wednesday, the Energy Information Administration’s report showed that U.S. crude inventories rose for a third week in a row, by 1.4 million barrels for the week ended June 19. It also revealed that total domestic oil production climbed by 500,000 barrels a day to 11 million barrels a day. On the production side, global “output remains fairly restrained,” and Saudi Arabia and other members of Organization of the Petroleum Exporting Countries will “largely stick to their production cut agreement in 2020, in the interest of avoiding another price crash,” said Birch. She also pointed out that U.S. crude production has fallen by nearly 20% between the start of March and the start of June, “wiping out nearly two years of production gains.” Birch expects the current “push-and-pull” factors in the oil market ton continue to offset each other in the coming months, keeping Brent prices roughly within a range of $35 to $45 in the second half of this year. Natural-gas futures settled sharply lower after the EIA reported Thursday that domestic supplies of the commodity rose by 120 billion cubic feet for the week ended June 19. That was more than the average increase of 107 billion forecast by analysts polled by S&P Global Platts. July natural gas US:NGN20 fell 7.2% to $1.482 per million British thermal units. The July contract expires at the end of Friday’s trading session. Rounding out action on Nymex, July gasoline US:RBN20 lost 0.2% to $1.1942 a gallon, but July heating oil US:HON20 rose 0.4% to $1.1556 a gallon."}]}