{"article": [{"url": "https://www.marketwatch.com/story/inflation-is-low-now-but-it-still-poses-a-big-threat-to-retirees-financial-security-2020-08-14", "published": 1597487840.0, "headline": "Inflation is low now, but it still poses a big threat to retirees' financial security", "body": "I overlooked an attractive investment when recently discussing how retirees and soon-to-be retirees could hedge their portfolios against inflation. In that column, you may recall, I pointed out that inflation hedges currently are quite cheap. Because hardly anyone expects inflation to be much higher in coming years, you don't have to pay much to purchase inflation protection. And contrarians are interested in such hedges precisely because they are so out of favor. The inflation hedges that I did recommend for your consideration in that column are the Treasury's Inflation-Protected Securities (TIPS). But, as several of you wrote in response to that column, there's another hedge that, in certain circumstances, can be preferable. This alternative I didn't mention: Series I U.S. savings bonds, or I-Bonds. Like TIPS, their interest rate also is pegged to inflation. But their interest is calculated differently and, as a result, their yield in certain circumstances will be superior to those of TIPS. Now in one of those circumstances, since inflation-adjusted (i.e. real) interest rates are negative. To understand why that means I-Bonds will yield more than comparable TIPS, it's helpful to review how TIPS and I-Bonds differ in their inflation protection. â\u0080¢ TIPS adjust for inflation by adjusting the principal value of your bond. The bond's fixed yield is then applied to that adjusted principal value. â\u0080¢ I-Bonds, in contrast, adjust for inflation by adjusting their interest rate. Their yield equals the sum of a fixed rate, set when purchased, and a variable rate benchmarked to the Consumer Price Index. The fixed rate has a floor of 0%. Consider what that means for a soon-to-be retiree wanting to purchase a 30-year inflation-adjusted Treasury security. A 30-year TIPS currently trades at a yield of minus 0.37%, which means that, if purchased today and held until maturity, your return will be that much less that of the Consumer Price Index. In contrast, because an I-Bond purchased today has a fixed rate of 0% and a variable rate equal to the CPI, its return over the next 30 years will be higher than that of the TIPS by 0.32 annualized percentage points. (I am glossing over myriad complexities in the calculation of these actual returns, because of which the actual differential in their returns could deviate slightly from this example.) To translate this into dollars and sense, assume that the Consumer Price Index over the next 30 years is 1.84% annualized, which is what the Cleveland Federal Reserve's inflation expectations model currently is forecasting. For a $10,000 investment made today and held for 30 years, the difference between the TIPS and the I-Bonds returns amounts to a total of nearly $1,800. While that's not huge, it's not nothing either. And you incur no additional risk in the process of earning that higher return.Purchase limits Given this, you might wonder why investors don't always choose I-Bonds over TIPS for at least a portion of the fixed income portion of their portfolio. One reason is that many investors aren't even aware that I-Bonds exist. Another is that you can't buy or sell an I-Bond in the open market. Your only redemption option is with the U.S. Treasury, and you are prevented from doing so in the first year after purchasing an I-Bond. And between one and 12 years after purchase, you forfeit three months of interest when redeeming. Another reason I-Bonds are often overlooked is that you can only purchase $10,000 of them in any given calendar year. So if you want to purchase a greater amount of inflation protection you will have to turn to TIPS. For most of us, however, these purchase limits don't pose as big an obstacle as they might otherwise appear to do. On the contrary, they can actually support a disciplined program of gradually increasing your fixed-income allocation as you approach and then enter into retirement. Imagine that you are 50 years old and have a $500,000-dollar retirement portfolio. If you follow the typical glide path recommended by financial planners to increase your fixed-income allocation as you approach retirement, you will want to increase your fixed-income allocation (and correspondingly reduce your equity allocation) by approximately $10,000 a year for each of the next couple of decades. An I-Bond would be a logical choice for this increased annual allocation. If your portfolio is smaller than this, your annual purchase of I-Bonds would be correspondingly less. You can buy an I-Bond for as little as $25. Of course, there are many other differences between TIPS and I-Bonds, so it's important to do your homework. A good place to start is a page of the U.S. Treasury's website that lists the major differences. Consulting a qualified financial planner is always a good idea as well. Mark Hulbert is a regular contributor to MarketWatch. His Hulbert Ratings tracks investment newsletters that pay a flat fee to be audited. He can be reached at mark@hulbertratings.com."}]}