{"article": [{"url": "https://www.marketwatch.com/story/oecd-boosts-economic-outlook-but-warns-against-tightening-policy-too-quickly-11600247126", "published": 1600246520.0, "headline": "OECD boosts economic outlook but warns against tightening policy too quickly", "body": "An earlier version misstated the OECD’s June estimate for 2021 global growth. A women looks at her smartphone as she walks in a shopping area on August 14, 2020, in Beijing, China. Better-than-expected growth in the U.S. and China helped lift the OECD's estimate for global growth this year. Kevin Frayer/Getty Images The Organization for Economic Cooperation and Development on Wednesday boosted its global economic outlook while warning policy makers not to tighten policy too quickly. The OECD said global gross domestic product will shrink by 4.5% this year, and rise 5% next year. That is a big improvement from what the OECD projected in June, which was for a 6% contraction this year, followed by 5.2% growth in 2021. The OECD credited the improvement to better-than expected outcomes for China and the U.S. in the first half of this year, and a response by governments on a massive scale. But the Paris-based organization said output in many countries at the end of 2021 will still be below the levels at the end of 2019, and well below what was projected before the pandemic. Area 2019 GDP growth 2020 estimate 2021 estimate World 2.6% -4.5% 5% U.S. 2.2% -3.8% 4% China 6.1% 1.8% 8% “It is important that governments avoid the mistake of tightening fiscal policy too quickly, as happened after the last financial crisis. Without continued government support, bankruptcies and unemployment could rise faster than warranted and take a toll on people’s livelihoods for years to come,” said Laurence Boone, the OECD’s chief economist. In the U.S., negotiators are still at an impasse over extending what was $600 a week in federal unemployment benefits that expired in August, which so far has been replaced by a White House executive order for half of that, affecting only a patchwork of states. In the U.K., Chancellor Rishi Sunak said on Tuesday that he did not plan on extending the furlough program that is set to expire at the end of October. Read: U.K. economy has shed 700,000 jobs since March. And it’s about to get worse"}]}