{"article": [{"url": "https://www.marketwatch.com/story/potential-washington-covid-19-super-spreader-events-have-everyone-asking-again-how-does-contact-tracing-work-2020-10-03", "published": 1601731100.0, "headline": "Potential Washington COVID-19 super-spreader events have everyone asking again: How does contact tracing work?", "body": "Contact tracing is an alert system intended to help slow the spread of COVID-19. It is used to let as many people as possible know about their possible contact with those who may have been exposed to the coronavirus and nudge them into quarantine even absent symptoms. Despite its complexity and limitations, it’s one of the handful of effective tools in the fight against the pandemic and can help to allow more businesses and restaurants to reopen sooner and more safely, experts say. The mostly small college campuses that are having some success in limiting spread are using contact tracers, for example. Read:Coronavirus update: Expert calls for ‘radical transparency’ on Trump’s coronavirus treatment and progress as more in president’s circle test positive In fact, the role of contact tracer is a specific job, largely absent from the vernacular until just this year. Some people laid off as a result of the pandemic have sought these jobs. Don’t miss: ‘Just stay calm. It will go away’: A look back at Trump’s shifting stance on face masks and on the threat of COVID-19 After a person tests positive for the virus, a contact tracer would get in touch with that person and attempt to determine where they have been and who they were around. The focus is on close contacts, or people who were within six feet of the infected person for at least 10 minutes or so. Those people would then be asked to self-isolate, monitor themselves for symptoms and get tested if needed. For those showing symptoms, the tracing process starts all over again to determine the new, extended contagion network, Read:Why Trump is at higher risk of more severe illness from unpredictable COVID-19 Contact tracing is done in a variety of ways around the world but a common issue is that determining who a person has been around can get harder as gatherings with friends and family resume, and as bars, restaurants and other places start reopening. Health officials can also become overwhelmed with cases. In the U.S. for example, local health departments may rely on automated texts to alert people who may have been exposed to an infected person. Health officials prefer to call people if possible because it can help build trust, the Associated Press reports. But some people never return calls or texts. There’s also pressure to act quickly. Ideally, most of a person’s contacts would be alerted within a day, in order for the process to be most effective. Favorable results from this tactic also depend in part on how large an event is that is believed to be a point of contagion. Much notoriety followed the 2020 Sturgis, S.D., motorcycle rally, which has since been considered a “super spreader” event, infecting eventually hundreds of thousands of people, according to one study and other news reports. Related:Sturgis motorcycle rally in South Dakota in August linked to more than 250,000 coronavirus cases, study finds Since this week’s back-to-back announcements that President Donald Trump and his adviser Hope Hicks tested positive for coronavirus, at least 10 other people who were in close contact with them have shared similar results. At least six of them attended a White House event last Saturday at which Trump introduced his Supreme Court nominee, Amy Coney Barrett. They include first lady Melania Trump, former White House Counselor Kellyanne Conway, GOP Sen. Mike Lee of Utah, GOP Sen. Thom Tillis of North Carolina, the Rev. John Jenkins, the president of Notre Dame University, and a White House reporter. Coney Barrett had tested positive for COVID this summer and has since recovered. The nomination event was held outdoors, another of the health experts’ recommendations for gatherings, but participants’ adherence to social distancing was in question, as the televised event revealed. Indoor events around the nomination were also held. Trump campaign team member, former New Jersey Gov. Chris Christie announced his positive test result on Saturday. Trump and Democratic presidential challenger Joe Biden held an in-person debate in Ohio this week. The Associated Press contributed to this article."}]}