{"article": [{"url": "https://www.marketwatch.com/story/its-a-five-alarm-fire-a-100-year-fiscal-tsunami-2020-09-11", "published": 1599897260.0, "headline": "'It's a five-alarm fire, a 100-year fiscal tsunami'", "body": "As fall descends on their virus-weary city, New Yorkers have some fresh reasons for optimism. More people are out on the sidewalks. Gyms are open again. Though Broadway's still dark and Manhattan CEOs are grumbling about \"widespread anxiety,\" many offices aren't quite as empty as they were before Labor Day. Meanwhile, indoor dining and classroom learning are both set to return by the end of the month-with restrictions. But there's still a big missing piece in the complex puzzle of New York's slow resurgence, and transit officials are struggling mightily to fit it back in. The subway is still a relative ghost town. \"Come back,\" Patrick Foye, chairman and CEO of the Metropolitan Transportation Authority, was saying a couple of hours after Gov. Andrew Cuomo instituted new $50 fines on Thursday for anyone caught on a train or in a station without a face mask. Is the subway safe? \"Absolutely,\" Foye said. With fewer riders, cleaner trains, overnight shutdowns and mask-wearing already north of 90%, the MTA chairman does seem to have science on his side. But he still needs to gain the confidence of millions of his former riders as well as reluctant Republicans in Washington who've been maddeningly slow to step up with a financial bailout. \"It's a five-alarm fire, a 100-year fiscal tsunami,\" said Foye, a veteran of the Empire State Development Corporation and the Port Authority of New York and New Jersey. \"We get half our revenues from customers based on ridership, and we get a package of subsidies from the state legislature,\" shares of the mortgage-recording tax, payroll-mobility tax and other revenue streams that have also been whacked by the coronavirus pandemic. \"The state of New York and the city of New York are in equally perilous waters,\" Foye said. \"It's only the federal government that has the resources and the capability.\" The stakes could hardly be higher for the New York economy, as the city creaks back to life. Those 36 lines, 472 stations and 691 miles of track aren't just a means of transportation. They are the irrigation system that nourishes all those gleaming Manhattan skyscrapers and has kept the city's economy humming for the past 116 years. No one would get anywhere with a couple of million extra cars on the streets. Subway ridership has been inching back up since the depth of the spring, when fare card swipes and taps were down 95% from last year. Now, the passenger count is off 73%, which comes out to about 1.6 million riders a day. That's a good sign but still far short of the 5 million-plus who rode on a typical weekday last year. Coronavirus update: U.S. case and death tallies keep rising, as Fauci warns not to look on the 'rosy side' MTA figures tell a fascinating story about the metropolitan area's uneven recovery. City bus ridership is almost half back now. And traffic on the MTA's bridges and tunnels-the Triborough Bridge, Queens-Midtown Tunnel, Verrazzano-Narrows Bridge, Brooklyn-Battery Tunnel and five other crossings-is down just 10%, suggesting that many people are still more comfortable in their own cars. On Wednesday, 833,000 cars and trucks paid MTA tolls. Meanwhile, the agency's two commuter lines-the Long Island Rail Road and the Metro-North Railroad-are down even more sharply than the subway. What gives there? Part of it may be that suburban commuters are more likely to own cars. But a bigger explanation, Foye said, is that many white-collar professionals in the suburbs are still working from home or from satellite offices outside the city. \"That's not so possible if you're a construction worker or a waiter or you work in a pharmacy,\" he said. \"You don't have a remote working option.\" But the pattern in New York-cars first, city transit next, suburban rail after that-is a repeat of what's already happened in large European cities, the MTA chairman said. So a big part of the focus now is building confidence at home. Foye noted a recent study from the American Public Transportation Association concluding that transit ridership has not been a vector for spreading the virus. And MTA officials are working with researchers at Columbia University who believe that ultraviolet light can help disinfect a transit system. The subway's overnight closing has helped transit workers and teams from the city's Department of Homeless Services find shelter for homeless people-or at least escort them out of the system. And Cuomo, Foye and other New York officials keep glancing toward Washington, while trying to ease local concerns. \"New Yorkers' behavior does not rest in the hands of Washington,\" Foye emphasized. \"A lot of this is up to us.\" Clearly, there's still a ways to go. Also see: I went to the Met, and here's what I saw At an emergency MTA board meeting in August, budget officials warned that if Washington doesn't step up, the only alternative will be 40% cuts in bus and subway service and 50% cuts on Metro-North and the Long Island Rail Road, plus 8,500 layoffs. Said Foye: \"The Great Depression wasn't nearly as bad as this.\" Ellis Henican is an author based in New York and a former newspaper columnist."}]}