{"article": [{"url": "https://www.marketwatch.com/story/this-is-one-task-everyone-in-their-50s-should-consider-before-its-too-late-2020-09-28", "published": 1601381480.0, "headline": "This is one task everyone in their 50s should consider before it's too late", "body": "Life can be unpredictable - especially when it comes to money and health - but that's all the more reason why people need to prepare. Long-term care planning is a crucial part of preparing for the future, and is important to do as people get closer to retirement - particularly, once they reach their 50s, experts said. \"Not having a policy can really affect your family and your family's future planning and lifestyle,\" said Brian Walsh, a financial planner at Walsh & Nicholson Financial Group, a wealth management firm. \"Having long-term care coverage - that safety net - is a huge peace of mind.\" This type of planning addresses how people will manage health issues in their old age, as well as where they may receive that care and who will provide it. Long-term care is especially useful to those who suffer from physical or cognitive decline when they're elderly. See: This program brings nursing home residents joy in an old-fashioned way The coronavirus pandemic has highlighted numerous potential catastrophes for the elderly and their loved ones, including unexpected illnesses, risks associated with underlying health issues and general lifestyle and risks in nursing homes. Although many nursing homes and assisted living facilities have had staff working hard to protect their elderly patients and residents - such as with restricted access to visitors and constant sanitizing of the facilities - COVID-19 \"ran rampant\" through these establishments, Walsh said. \"I think you'll see people who were planning on entering nursing homes rethink that,\" he said. Read: A new way to pay for the single biggest expense in retirement People are also living longer than their grandparents or great-grandparents did. Insurers paid a record $11 billion in claims to around 310,000 individuals in 2019, according to insurance industry group American Association for Long-Term Care Insurance, or AALTCI, more than half of whom were in their 80s. Read: Your retirement probably won't be anything like your parents' - and that's not good Health care is expensive, and the costs only grow as a person ages. The average 65-year-old couple who retired in 2019 could expect to spend $280,000 in retirement for their health care expenses alone, according to Fidelity Investments. That does not include long-term care insurance or the costs associated with that type of care. That figure is also expected to rise every year for the foreseeable future. The variables that go into choosing the right type of coverage, including the initial ages of the applicant, any health issues they are currently facing, or may face as part of family health history, and how much coverage they want or can afford. Women are more likely to need some form of long-term care because they live longer than men, according to a study about what retirees' can expect regarding long-term care needs. Still, anyone may want to have extra coverage if they are single or without family nearby, said Rob Williams, vice president of financial planning at Charles Schwab. Choosing a plan in your 50s is most cost-effective, he added. Also see: Long-term care insurance: There's no good alternative Insurance carriers offer standalone long-term care policies. There are also life insurance policies with long-term care riders, known as a hybrid policy, which provides the insured with more flexibility about how they use their benefit and if anything is paid out to beneficiaries. Standalone policies can see premiums increase significantly over time, said Joshua Butler, wealth adviser at Girard, a financial services firm. Hybrid policies generally have premiums locked in, he said. Policies can also include automatic inflation adjustments, though that is an added expense. Here's more on how a long-term care policy works. Having a policy in place may give patients more opportunities to consider when they need extra care, but it comes with a hefty price tag. The average annual premium for a 55-year-old couple was $3,050 in 2020, according to the AALTCI. For a single 55-year-old woman, that price was $2,650 and for their male counterparts, $1,700. Premium costs increase the older the applicant is. Medicare does not cover much in the way of long-term care, either. The program does cover the full cost of skilled nursing care for 20 days after a hospitalization, and part of the following 80 days, but then the onus is on the patient. Medicaid only offers financial support for skilled nursing care for low-income seniors. The alternative can be even more expensive, though. Nursing homes could cost nearly $100,000 or more a year, while assisted living costs about half and in-home care about a third of that. Not all Americans have enough money in retirement to pay for those kinds of expenses, especially considering so many people have trouble saving enough for their old age while they're still working. \"[Long-term care planning] could make a significant impact on your retirement,\" Butler said. \"By not taking it into consideration, you're also putting your retirement at risk.\""}]}