{"article": [{"url": "https://www.marketwatch.com/story/watch-fauci-schools-rand-paul-on-herd-immunity-youre-not-listening-2020-09-23", "published": 1600937480.0, "headline": "Watch as Anthony Fauci hits back at Rand Paul over herd immunity: â\u0080\u0098Youâ\u0080\u0099re not listeningâ\u0080\u0099", "body": "Dr. Anthony Fauci has officially lost patience with Sen. Rand Paul. The nationâ\u0080\u0099s leading infectious-disease expert scolded the Republican senator from Kentucky for repeatedly â\u0080\u009cmisconstruingâ\u0080\u009d COVID-19 data during a heated congressional hearing on Wednesday. Paul, who has criticized the economic shutdown measures enacted to limit the spread of the coronavirus, pointedly asked the White House coronavirus task-force member how effective he believes these social-distancing measures have been, and whether Fauci has had any second thoughts about his lockdown recommendations. “ â\u0080\u0098Youâ\u0080\u0099ve misconstrued that, senator, and youâ\u0080\u0099ve done that repetitively in the past.â\u0080\u0099 ” â\u0080\u0094 Dr. Anthony Fauci To make his case, Paul tried to compare the U.S. coronavirus death toll, which just passed a grim 200,000 milestone on Tuesday, to Swedenâ\u0080\u0099s, even though the U.S. is much larger and more populated than the Scandinavian country. After an initial surge in COVID-19 infections and mortalities, Sweden now has one of Europeâ\u0080\u0099s lowest death rates despite never mandating masks or closing down schools, restaurants and gyms. See:Sweden embraced herd immunity, while the U.K. abandoned the idea â\u0080\u0094 so why do they both have high COVID-19 fatality rates? â\u0080\u009cIs man really capable of altering the course of infectious disease through crowd control? The statistics argue a resounding no,â\u0080\u009d Paul said, adding that, â\u0080\u009cdespite all of the things weâ\u0080\u0099ve done in the U.S., our death rate is essentially worse than Sweden, [and] equivalent to the less developed world.â\u0080\u009d It should be noted that Paul was the first U.S. senator to test positive for the coronavirus in March. He was asymptomatic, and he was criticized by some at the time for not quarantining himself while he was waiting for his test results. Fauci countered that Swedenâ\u0080\u0099s death toll is actually much worse than those of comparable neighboring Nordic countries, however, which did impose lockdown measures early in the pandemic. Swedenâ\u0080\u0099s death toll (5,870) is much higher than those of Norway (267) and Finland (341), according to Johns Hopkins University data, and its case count is also much higher. â\u0080\u009cI donâ\u0080\u0099t think itâ\u0080\u0099s appropriate to compare Sweden with us,â\u0080\u009d said Fauci. Research from Columbia University suggests that 36,000 American lives could have been saved by early May, and there could have been at least 700,000 fewer infections by that time, if the government had put broad social-distancing measures in place just one week earlier in March. â\u0080\u009cI donâ\u0080\u0099t regret saying that the only way we could have really stopped the explosion of infection was by essentially ... shutting down,â\u0080\u009d Fauci said. Related:Dr. Fauci tells MarketWatch: I would not get on a plane or eat inside a restaurant Paul taunted Fauci as being â\u0080\u009ca big fanâ\u0080\u009d of New York Gov. Andrew Cuomo, and questioned how the state has managed to bring its coronavirus outbreak under control. â\u0080\u009cHow can we possibly jump up and down and say, â\u0080\u0098Oh, Gov. Cuomo did a great jobâ\u0080\u0099? He had the worst death rate in the world,â\u0080\u009d Paul said, arguing that herd immunity (having enough people become immune to COVID-19 through natural infection or vaccination to make its spread to additional people unlikely) may have been more effective in flattening the curve in New York than anything the local government did. Fauci came back swinging: â\u0080\u009cNo, youâ\u0080\u0099ve misconstrued that, senator, and youâ\u0080\u0099ve done that repetitively in the past,â\u0080\u009d said Fauci, arguing that New York was hit hard by the virus early on, but it got its test-positivity rate down to 1% or less through face-mask mandates, social distancing, pushing people to spend more time in well-ventilated areas outdoors instead of indoors, avoiding crowds and washing hands -- measures that have been recommended by the coronavirus task force and the Centers for Disease Control and Prevention. iframe.twitter-tweet { width: 100% !important; } Paul again countered that the test-positive rate may also have simply dropped because the population â\u0080\u009cdeveloped enough community immunity that theyâ\u0080\u0099re no longer having the pandemic, because they have enough immunity in New York City to actually stop.â\u0080\u009d Fauci interrupted: â\u0080\u009cI challenge that, senator,â\u0080\u009d noting to the moderator that â\u0080\u009cthis happens with Sen. Rand all the time.â\u0080\u009d â\u0080\u009cYou are not listening to what the director of the CDC said, that in New York [the infection rate is] about 22%,â\u0080\u009d Fauci said. â\u0080\u009cIf you believe 22% is herd immunity, I believe youâ\u0080\u0099re alone in that.â\u0080\u009d Epidemiologists estimate that at least 70% of the population attaining immunity is needed to achieve actual herd immunity. New York City has also seen a fresh spate of outbreaks in several neighborhoods in Brooklyn and Queens, so itâ\u0080\u0099s not out of the woods yet. Related:Have you â\u0080\u0098herdâ\u0080\u0099? New York might have immunity â\u0080\u0094 but please donâ\u0080\u0099t count on it, the mayor pleads Paul also tried to push what he called a â\u0080\u009cfascinating field of inquiryâ\u0080\u009d into whether people who have been exposed to other coronaviruses, including the common cold, might have a cross-reactive immunity to the novel coronavirus that causes the disease COVID-19. He said this may be why so many infected patients have minor or no symptoms. Fauci knocked that down, as well, noting that thereâ\u0080\u0099s a recent study debunking the theory, although he told Paul that â\u0080\u009cIâ\u0080\u0099d like to talk to you about that also.â\u0080\u009d Twitter ate the exchange up: iframe.twitter-tweet { width: 100% !important; } iframe.twitter-tweet { width: 100% !important; } iframe.twitter-tweet { width: 100% !important; } Paul chalked the back-and-forth up as a win for himself, however, tweeting out the same clip where he says â\u0080\u009cI take Dr. Fauci to task.â\u0080\u009d iframe.twitter-tweet { width: 100% !important; } Itâ\u0080\u0099s not the first time that Fauci and Paul have sparred. In June, the senator boiled down the doctorâ\u0080\u0099s coronavirus response to â\u0080\u009cWe canâ\u0080\u0099t do this, we canâ\u0080\u0099t do that.â\u0080\u009d Paul said at the time: â\u0080\u009cWe shouldnâ\u0080\u0099t presume that a group of experts somehow knows whatâ\u0080\u0099s best for everyone.â\u0080\u009d Fauci responded, â\u0080\u009cThe only thing that I can do is, to the best of my ability, give you the facts.â\u0080\u009d This article has been updated with Sen. Rand Paulâ\u0080\u0099s response."}]}