{"article": [{"url": "https://www.marketwatch.com/story/pelosi-warns-time-is-running-out-as-conservative-senators-pan-republican-coronavirus-aid-plan-2020-07-27", "published": 1595880140.0, "headline": "Pelosi warns â\u0080\u0098time is running outâ\u0080\u0099 as conservative senators pan Republican coronavirus-aid plan", "body": "WASHINGTON â\u0080\u0094 Unemployment assistance, eviction protections and other relief for millions of Americans are at stake as White House officials agreed Monday to launch negotiations with House Speaker Nancy Pelosi on a new coronavirus aid package thatâ\u0080\u0099s teetering in Congress ahead of looming deadlines. While Senate Republicans struggled to roll out their own $1 trillion proposal, Pelosi implored the White House and GOP lawmakers to stop the infighting and come to the negotiating table with Democrats. Aid runs out Friday for a $600/weekly jobless benefit that Democrats call a lifeline for out-of-work Americans. Republicans want to slash it to $200 a week, saying that the federal bump is too generous on top of state benefits and is discouraging employees from returning to work. â\u0080\u009cTime is running out,â\u0080\u009d Pelosi said. With the virus death toll climbing and 4.2 million infections nationwide, both parties are eager for a deal. There is widespread agreement that more money is needed for virus testing, to help schools prepare to open in the fall and to shore up small businesses. Voters are assessing their handling of the virus crisis before the November election, and President Donald Trumpâ\u0080\u0099s standing is at one of the lowest points of his term, according to a new AP-NORC poll. Treasury Secretary Steven Mnuchin and White House chief of staff Mark Meadows worked through the weekend on the GOP proposal and agreed to meet with Pelosi and Democratic Senate leader Chuck Schumer at the speakerâ\u0080\u0099s office late Monday for talks. The Republicans come to the negotiating table hobbled by infighting and delays. Senate Majority Leader Mitch McConnell, R-Ky., said he wanted to hit â\u0080\u009cpauseâ\u0080\u009d on new spending after Congress approved a sweeping $2.2 trillion relief package in March. But Pelosi, D-Calif., took the opposite approach, swiftly passing a $3 trillion effort with robust Democratic support. In the intervening months, the crisis deepened. McConnell, flanked by top GOP chairs Monday at the Capitol, unveiled his long-awaited proposal. It provides some $105 billion to schools and colleges, the K-12 funds tilted toward campuses that reopen with in-person learning. Thereâ\u0080\u0099s more money for virus testing, $15 billion for child care centers and benefits for businesses, including a fresh round of loans under the Paycheck Protection Program, tax breaks and a sweeping liability shield from COVID-19-related lawsuits. Republicans left out money for cash-strapped states and cities, a priority for Democrats, but included another round of $1,200 direct payments to households that Democrats also support. Based on an earlier formula, people making $75,000 or less would receive the full amount, with the benefit phased out for those earning above $99,000, or double for married couples filing joint taxes. The GOP bill also provides $1.7 billion for a new FBI headquarters in Washington, a non-pandemic-related expense thatâ\u0080\u0099s a top priority for the president but not for lawmakers or McConnell. Trumpâ\u0080\u0099s hotel is across the street from it on Pennsylvania Avenue. â\u0080\u009cSenate Republicans have offered another bold framework to help our nation,â\u0080\u009d McConnell said. He called it a starting point in talks. But conservative Republicans quickly broke ranks on McConnellâ\u0080\u0099s plan, arguing the spending was too much and priorities misplaced. Half the Republican senators could vote against the bill, some warned, and their opposition leaves McConnell heading into negotiations with Pelosi without the full force of the Senate majority behind him. â\u0080\u009cThe focus of this legislation is wrong,â\u0080\u009d Sen. Ted Cruz, R-Texas, one of the billâ\u0080\u0099s most vocal opponents, told reporters at the Capitol. â\u0080\u009cOur priority, our objective, should be restarting the economy.â\u0080\u009d As bipartisan talks unfold, the White House is now suggesting a narrower relief package may be all thatâ\u0080\u0099s possible with Fridayâ\u0080\u0099s approaching deadlines. But Pelosi has resisted tackling a relief package in piecemeal fashion, arguing that broader aid is needed for Americans. She panned the Trump administrationâ\u0080\u0099s desire to reduce the $600 weekly unemployment aid. â\u0080\u009cChildren are hungry, families cannot pay the rent, unemployment is expiring and the Republicans want to pause again and go piecemeal,â\u0080\u009d Pelosi said. â\u0080\u009cWe have stood ready to negotiate for more than two months,â\u0080\u009d she said. She urged them to come to her office â\u0080\u009cand get the job done.â\u0080\u009d The $600 weekly jobless benefits boost, approved as part of the March aid package, officially expires July 31, but because of the way states process unemployment payments, the cutoff was effectively Saturday. Under the GOP proposal, the jobless boost would be reduced to $200 a week for two months through September and phased out to a new system that ensures no more than 70% of an employeeâ\u0080\u0099s previous pay. They argue reductions are needed because some people earn more on unemployment than at work. States could request an additional two months, if needed, to make the transition. Democrats pointed to an assessment from economist Mark Zandi, who called it a â\u0080\u009cpoor policy choice.â\u0080\u009d Zandi said that if the GOP proposal became law, nearly 1 million jobs would be lost by yearâ\u0080\u0099s end and the unemployment rate, now above 11%, would climb more than half a percentage point. Economists widely see signs of trouble in the economy, which showed an uptick in the spring as some states eased stay-home orders and businesses reopened, but it now faces fresh turmoil with a prolonged virus crisis as states clamp down again. Friday is also the end of a federal eviction moratorium on millions of rental units that the White House said it wants to extend in some fashion. At the same time, budget watchers are wary of the rising debt load as Washington piles on unprecedented sums in trying to contain the pandemic and economic fallout."}]}