{"article": [{"url": "https://www.marketwatch.com/story/fed-sees-rates-near-zero-through-2022-says-asset-purchases-will-continue-2020-06-10", "published": 1591808780.0, "headline": "Dovish Fed sees no interest-rate hikes for years, will keep buying assets", "body": "The Federal Reserve on Wednesday maintained a firmly dovish stance despite some tentative signs that the economy is bottoming. The Fed said it doesn’t expect to lift its benchmark interest rate until 2023. Only two of 17 top officials said rates would move slightly higher in 2022. “We’re not even thinking about thinking about raising rates,” Fed Chairman Jerome Powell told reporters. The Fed also announced it would end the steady tapering of its asset purchases. Going forward, the Fed would keep buying Treasurys and mortgage-backed securities, “at least at the current pace.” There had been concerns among some economists and financial markets that these purchases, which the Fed says are supporting market functioning, might end as they have been tapered in recent weeks. At the moment, the Fed will buy $20 billion in Treasurys this week and up to $22.5 billion in mortgage bonds to stimulate the economy in quantitative easing. “The June FOMC meeting has delivered a firmly dovish outcome across both QE and rates in what we view as a concerted effort to prevent any acceleration higher in yields and signal maximum support for the recovery,” said Krishna Guha of Evercore ISI. The central bank’s balance sheet has already topped $7 trillion. Former New York Fed President William Dudley thinks it might hit $10 trillion before the Fed is done. Some economists thought May’s jobs report issued just a few days ago, which showed 2.5 million jobs were created last month after April’s sharp losses, was a good sign. Powell said the report was a welcome surprise but just one month’s data. “I think we have to be honest, its a long road,” Powell said, pointing out there are 20 million people who are displaced in the labor market. Luke Tilley, chief economist for Wilmington Trust Investment Advisors, said he thought Powell was putting pressure on Congress for another stimulus package. “The Fed’s ability to support the economy is clearly limited. The Fed cannot give money away. There is high hope at the Fed that Congress will continue to provide more accommodation and stimulus in the second half of the year...without him explicitly saying it,” Tilley said in an interview. In a statement, the Fed said again it would use its “full range of tools” to support the economy. The central bank once again pledged to keep interest rates near zero until the economy “is on track” for a full recovery. The Fed left unchanged its long-range forecasts for GDP, unemployment and PCE inflation. Live blog recap:Fed provides update on economic outlook and policy thinking The Fed cut its benchmark interest rate to a range of 0-0.25% in mid-March as the economy went into lockdown to slow the spread of COVID-19. The economy has shown some tentative signs of recovery, but the Fed kept a cautious tone. Minutes of the meeting will be released on July 1. Powell said Fed officials discussed tying a rate hike to specific economic conditions, such as inflation returning to target. The Fed is also discussing setting caps on yields on certain Treasury securities. After weeks of gains, U.S. equity benchmarks retreated ahead of the Fed announcement, and the Dow Jones Industrial Average DJIA, +0.56% closed down 282 points. The yield on the 10-year Treasury note TMUBMUSD10Y, 0.777% was down 10 basis points to 0.730. Powell pushed back on criticism that the Fed has put too much money into the economy and is fueling a bubble in stock prices. “What we want is investors to be pricing in risk. We’re not looking to a particular level,” he said. “The concept that we would hold back because we think asset prices were too high...what would happen to the people we’re supposed to be serving?” he added."}]}