{"article": [{"url": "https://www.marketwatch.com/story/peloton-produces-profit-for-the-first-time-amid-pandemic-demand-spike-stock-heads-toward-new-high-11599768987", "published": 1599761000.0, "headline": "Peloton produces profit for the first time amid pandemic-demand spike, stock pushes toward new record", "body": "Peloton Interactive Inc. reported fiscal fourth-quarter earnings Thursday afternoon. MarketWatch photo illustration/iStockphoto A year after its initial public offering, Peloton Interactive Inc. is pedaling toward new highs amid a pandemic that is forcing people into their homes and away from gyms, creating demand for at-home fitness equipment. Peloton PTON, +6.97% on Thursday wrapped up its fiscal year by reporting that sales and subscribers roughly doubled in the 12-month period, and revealed its first profitable quarter as a public company and record quarterly revenue a little less than a year after its September 2019 IPO. Shares fell 3.8% Thursday from Wednesday’s record closing price of $91.17 — more than three times the IPO price of $29 a share — but pushed back toward record highs in after-hours trading following the release of the report, with gains of more than 7%. Peloton reported fiscal fourth-quarter profit of $89.1 million, or 27 cents a share, on sales of $607.1 million, up from $223 million a year ago. Peloton reported a net loss of $47 million in the fiscal fourth quarter a year ago, just ahead of its IPO. Analysts on average expected earnings of 10 cents a share on sales of $586 million, according to FactSet. “It has been another staggering year of growth, and I know all parts of the organization have had to work together to do everything possible to meet the incredible demand for our products and services,” Chief Executive James Foley said in a conference call Thursday. “The strong tailwind we experienced in March as the COVID-19 pandemic took hold has continued to propel demand for our products into the fourth quarter and first couple of months of Q1 fiscal year 2021.” While still attempting to catch up to a flood of orders amid the COVID-19 pandemic — Peloton said Thursday it does not expect order-to-delivery times to normalize until around the end of the calendar year — the company is also looking to expand its customer base. On Monday, Peloton announced that it will reduce the price of its standard exercise bike and introduce a lower-priced treadmill, which could clear a path for potential buyers who were not willing to pay the large upfront costs for its products. It will also introduce a premium bike for fans who want top-of-the-line equipment. Wedbush analysts noted that in a previous survey of 1,200 people, they found that Peloton could “dramatically improve” sales at a lower price point, especially in treadmills. “42% of non-Peloton owners that were interested in fitness and familiar with the brand showed some level of interest in a $2,500 Tread, compared to just 30% showing interest in the current Tread,” the analysts wrote in a Sept. 9 note, after Peloton announced its new lineup. “Among existing Peloton bike owners, the number of respondents saying they would be ‘very interested’ in owning a treadmill from Peloton doubles based on the lower price, from 14% based on the $4,295 price point to 28% assuming a theoretical (at the time) $2,500 price point.” While lower sales prices could hurt hardware margins and average selling prices, much of Peloton’s long-term prognosis focuses on the subscriptions for interactive workout media that owners continue to pay after they have received the equipment. Peloton announced Thursday that it now has 1.09 million subscribers, nearly doubling the 511 million that it reported at the end of its last fiscal year, topping its forecast of 1.04 million to 1.05 million. In total for the fiscal year, Peloton collected revenue of $1.46 billion from the sale of equipment and $363.7 million from subscription services, up from $719 million and $181 million, respectively, in the previous fiscal year. Combined with other revenue from merchandise and other offerings, Peloton ended the year with $1.83 billion in sales, up from $915 million. “By the end of FY 2020 our Peloton membership base grew to approximately 3.1 million, compared to 1.4 million members in the prior year,” Peloton detailed in a letter to shareholders Thursday. “Fueled in part by the challenges associated with COVID-19, member engagement reached new highs with 164 million Connected Fitness Subscription workouts completed in FY 2020.” For the current fiscal year, which began in August, Peloton predicted htat subscribers and revenue would roughly double yet again. The company guided for revenue of $3.5 billion to $3.65 billion, with connected subscribers swelling to 2.05 million to 2.1 million. Analysts on average were predicting revenue of $2.74 billion and subscribers of 1.78 million ahead of the report, according to FactSet. Peloton stock has gained more than 260% since its IPO; the S&P 500 index SPX, +0.87% has returned 17.7% in that time. In after-hours trading Thursday, shares topped $94 following the release of the report."}]}