{"article": [{"url": "https://www.marketwatch.com/story/mcdonalds-puts-reopening-plans-on-hold-as-coronavirus-cases-rise-2020-07-01", "published": 1593627320.0, "headline": "McDonaldâ\u0080\u0099s puts reopening plans on hold as coronavirus cases rise", "body": "McDonaldâ\u0080\u0099s Corp. is pausing the reopening of dine-in service in the U.S. as coronavirus cases continue to spread across states. The burger giant said Wednesday that it would wait three weeks before any new U.S. restaurants add dine-in service to its drive-through, takeout and delivery operations. â\u0080\u009cOur resiliency will be tested again. COVID-19 cases are on the rise,â\u0080\u009d said a company letter by Joe Erlinger, McDonaldâ\u0080\u0099s U.S. president, and Mark Salebra, head of the National Franchisee Leadership Alliance owners association, that was viewed by The Wall Street Journal. McDonaldâ\u0080\u0099s MCD, -0.43% Â operators began offering limited, dine-in service in May, and around 2,200 of its 14,000 U.S. restaurants now allow customers to eat their meals inside. Restaurant owners that began offering dine-in service can continue if their jurisdiction still allows it, the letter said, but the company decided to halt additional openings as a number of state and local governments tighten social-distancing regulations ahead of the July 4 holiday weekend. More states, cities and counties are scaling back on reopening plans for bars and restaurants given a surge in virus cases. On Wednesday, California ordered 19 counties to stop allowing indoor dining and recreation for at least three weeks as cases have rapidly grown in the most populous areas. New York City, meanwhile, delayed indoor dining service that was slated to resume July 6. An expanded version of this report appears on WSJ.com: Also popular on WSJ.com: How success against the coronavirus turned to crisis in California. No, really, your boss wants you to take vacation â\u0080\u0094 now."}]}