{"article": [{"url": "https://www.marketwatch.com/story/debate-goes-green-pence-refuses-to-say-whether-climate-change-is-a-threat-while-vice-presidential-rival-harris-evades-on-green-new-deal-2020-10-07", "published": 1602148220.0, "headline": "Debate turns green: Pence refuses to say whether climate change is a threat, while vice-presidential rival Harris evades on Green New Deal", "body": "Climate change and the environment figured in Wednesday night’s vice-presidential debate, brought into the clash as the moderator asked Sen. Kamala Harris about the Green New Deal. “Vice President Biden said in last week’s debate that he does not support the Green New Deal, but if you look at the Biden-Harris campaign website, it describes the Green New Deal as a crucial framework. What exactly would be the stance of a Biden-Harris administration toward the Green New Deal?” asked the moderator, USA Today’s Susan Page. Harris didn’t answer the question about the legislative framework that aims to address climate change, as the California Democrat instead talked up Democratic presidential nominee Joe Biden’s economic plan. From the archives (March 2019):Senate rejects Green New Deal, with most Democrats voting ‘present’ in protest of McConnell’s calling show vote on the environmental policy framework “First of all, I will repeat, and the American people know, that Joe Biden will not ban fracking,” she said. “Joe Biden has been very clear that he thinks about growing jobs, which is why he will not increase taxes for anyone who makes less than $400,000 a year.” The senator also said “Moody’s MCO, +0.88%, which is a reputable Wall Street firm, has said we’ll create 7 million more jobs than Donald Trump’s.” She said some of the jobs will have to do with “clean energy ICLN, +1.56% and renewable energy.” Opinion:Nouriel Roubini says Biden is better for the economy than Trump Harris added that climate change “is an existential threat to us as human beings,” leading Page to ask Vice President Mike Pence if he believed that as well. Trump’s running mate didn’t answer the question. Related:Here’s where Trump and Biden stand on climate change Also:As vague as it is, the Green New Deal could have a real impact on Corporate America. Here’s why “The climate is changing. We’ll follow the science. But once again, Sen. Harris is denying the fact that they’re going to raise taxes on every American,” Pence said, adding that could come from Biden’s pledge to repeal Trump’s 2017 tax overhaul. “We don’t need a massive $2 trillion Green New Deal that would oppose all new mandates on American businesses and American families,” the former Indiana governor said. Pence and Harris also clashed over the Trump administration’s handling of the coronavirus pandemic and other issues, as they faced off in the sole vice-presidential debate of the 2020 campaign. Now read:Pence, Harris clash over coronavirus and taxes at vice-presidential debate And see:Pence, Harris square off in vice-presidential debate: live blog This report was first published on Oct. 7, 2020."}]}