{"article": [{"url": "https://www.marketwatch.com/story/european-stocks-dow-futures-slip-on-virus-concerns-and-political-uncertainty-11601364991", "published": 1601358980.0, "headline": "European stocks and Dow futures slip on virus concerns and political uncertainty", "body": "The stage of the first U.S. presidential debate as workers complete the final touches on September 28, 2020, in Cleveland, Ohio. eric baradat/Agence France-Presse/Getty Images European stocks slipped on Tuesday, amid political uncertainty and concerns about the economic impact of a second coronavirus wave. Up 2.2% on Monday in its best one-day advance since June 22, the Stoxx Europe 600 SXXP, +0.55% fell 0.5%. Decliners included shopping mall operator Klépierre LI, -2.42%, airline Deutsche Lufthansa LHA, -2.00%, and airports operator Aéroports de Paris ADP, -2.20%, all of which would be harmed by coronavirus restrictions. Total confirmed coronavirus deaths have now topped 1 million globally. The German DAX DAX, +0.06%, French CAC 40 PX1, +0.71% and U.K. FTSE 100 UKX, +0.64% each slipped. Futures on the Dow Jones Industrial Average YM00, +0.82% fell 31 points, after a 410-point surge for the blue chips DJIA, +0.56% on Monday. House Democrats unveiled a $2.2 trillion stimulus package that is meant to be a bargaining tool, with House Speaker Nancy Pelosi and Treasury Secretary Steven Mnuchin due to rekindle negotiations. The U.K. is holding talks this week with the European Union, as it pushes through an internal markets bill that would undo elements of last year’s withdrawal agreement. The main event of the day will come after European and U.S. markets close, which is the first debate between President Donald Trump and former Vice President Joe Biden. Andrew Garthwaite, a strategist at Credit Suisse, said if all of Biden’s policies were implemented, the drag on S&P 500 earnings per share would be about 9%. “However, we think there would be a compromise and watering down of some of the more controversial proposals with only a slim majority likely in the Senate. If the economy is doing poorly, tax hikes would likely be postponed and spending front loaded,” he said. Shares of Ferguson FERG, +0.17% rose 5%, as the plumbing products supplier reported a 4% fall in pretax profits in the July 31-ending fiscal year, reinstated a dividend and said it would resume bolt-on acquisitions. Pulp technology maker Valmet VALMT, -0.46% declined 6% after approaching valve maker Neles NELES, -0.08% about a merger. Valmet, already the top shareholder in Neles, didn’t disclose terms. Engineering giant Alfa Laval ALFA, +0.59% also is trying to buy Neles."}]}