{"article": [{"url": "https://www.marketwatch.com/story/walmart-reaches-deal-to-sell-its-u-k-supermarket-chain-asda-11601635868", "published": 1601621960.0, "headline": "Walmart reaches deal to sell its U.K. supermarket chain Asda", "body": "A man walks past the toilet paper in an Asda supermarket in Walthamstow, east London on September 23, 2020. tolga akmen/Agence France-Presse/Getty Images Walmart on Friday announced a deal to sell its U.K. supermarket chain Asda, which finally rids the U.S. retailing giant of a unit it has long wanted to sell. Walmart WMT, +1.00% sold a majority stake in Asda for £6.8 billion ($8.7 billion) to private-equity firm TDR Capital and privately owned EG Group, which is controlled by the billionaire Issa brothers. It had started a sale process after regulators blocked its plan to merge Asda with rival J Sainsbury SBRY, +1.80% in 2019. Walmart will retain a minority holding, but the deal will reduce its exposure to the hugely competitive British grocery market in which it has struggled. The Issa brothers, co-own a convenience store chain. Judith McKenna, boss of Walmart International said: “We are delighted to be able to announce this deal . . . which we believe creates the right ownership structure for Asda, building on its 71 year-heritage, whilst bringing a new entrepreneurial flair, not only to Asda, but also to U.K. retailing. “I’m delighted that Walmart will retain a significant financial stake, a board seat, and will continue as a strategic partner.” The new owners say they will invest over £1 billion in the next three years in Asda, to further strengthen the business and its supply chain. The strategy remains the same, and the new owners will support and accelerate Asda’s existing strategy of delivering low prices. Asda had lost market share and suffered sinking sales as it struggled to compete in what is a low profit margin, high sales volume, sector. But in recent years, under fresh leadership, it has recovered, although not before parent Walmart had decided it needed to act. Initially it felt consolidation was the way to cut costs and keep prices down. Having failed to achieve that, it looked at an initial public offering, and auction."}]}