{"article": [{"url": "https://www.marketwatch.com/story/gold-prices-edge-higher-as-market-awaits-labor-market-update-2020-07-02", "published": 1593701360.0, "headline": "Gold settles higher with investors casting a wary eye on upbeat U.S. jobs data as cases of COVID-19 continue to rise", "body": "Gold futures settled higher Thursday as investors showed concern over the economic impact of the rising numbers of new COVID-19 cases in the U.S. and around the world, despite improving economic data. A drop in the U.S. unemployment rate and a better-than-expected job growth in June only briefly managed to pull prices lower during Thursday’s session. “Investors do not largely believe that the unemployment rate is going to fall as rapidly as we have seen in the past two months,” Naeem Aslam, chief market analyst at AvaTrade told MarketWatch. The U.S. added 4.8 million jobs in June and the unemployment rate fell for the second straight month to 11.1%. The increase in new jobs easily exceeded the 3.7 million forecast of economists polled by MarketWatch. However, the economy’s recuperation from the coronavirus might already be suffering a setback from a renewed surge in COVID-19 cases. “The employment numbers are spectacular but an 11% unemployment rate is still elevated,” said Jeff Wright, executive vice president of GoldMining Inc. “COVID cases are back on the rise and numerous states have slowed down reopen plans.” New U.S. coronavirus cases hit a single-day record on Wednesday of more than 52,000 while the global total reached 2.64 million and death toll of 127,681. Against that backdrop, August gold US:GCQ20 picked up $10.10, or 0.6%, to settle at $1,790 an ounce, following a 1.1% decline on Wednesday. For the holiday-shorted week, prices based on the most-active contract finished around 0.5% higher than last Friday’s settlement, according to FactSet data. Read:Is the stock market closed Friday? For July 4th, here’s everything investors need to know about trading hours and closures In the longer run, though, gold also could receive support from easy monetary policy, after minutes of the Federal Reserve’s most recent monetary-policy meeting revealed an expectation that the economy likely will require support in the form of highly accommodative monetary policy for “some time.” Read:Gold posts largest quarterly gain in 4 years; talk of record prices by year-end grows Meanwhile, September silver US:SIU20 rose 10 cents, or 0.6%, at $18.322 an ounce after gold’s sister metal fell 2.3% in the prior session. For the holiday-shortened week, silver finished about 1.6% higher than last Friday’s most-active July contract settlement. September copper US:HGU20 settled at $2.7485 a pound, up 0.5% for the session. October platinum PLV20, +3.99% fell 0.3% at $831.60 an ounce and September palladium US:PAU20 shed 0.2% to $1,927.60 an ounce."}]}