{"article": [{"url": "https://www.marketwatch.com/story/stock-index-futures-higher-as-sp-500-nears-all-time-high-2020-08-11", "published": 1597168940.0, "headline": "Dow, S&P 500 see 7-day winning streaks snap in late selloff, dragged down by tech shares", "body": "Stocks stumbled in late trade Tuesday, giving up early gains to end lower as a selloff in tech shares continued and investors assessed the outlook for the economy amid a slowing in the number of new coronavirus cases and a lack of progress toward additional coronavirus aid from Washington.What did major indexes do? The Dow Jones Industrial Average DJIA, +0.56% finished with a loss of 104.53 points or 0.4%, at 27,686.91. The blue-chip gauge was up more than 300 points at its session high. The S&P 500 SPX, +0.87% ended 26.78 points lower, a loss of 0.8%, at 3,333.69. The Dow and the S&P 500 both snapped seven-day winning streaks. The tech-heavy Nasdaq Composite COMP, +1.39% dropped 185.53 points, or 1.7%, closing at 10,782.82. The Russell 2000 index RUT, +0.55% of small-capitalization companies gave up 9.57 points, or 0.6%, ending at 1,575.10. The Dow DJIA, +0.56% on Monday rose 357.96 points, or 1.3%, to finish at 27,791.44, while the S&P 500 SPX, +0.87% edged up 9.19 points, or 0.3%, to close at 3,360.47, just 0.8% away from its Feb. 19 record close of 3,386.15. The Nasdaq Composite COMP, +1.39%, meanwhile, dropped 42.63 points, or 0.4%, ending at 10,968.36.What drove the market? Bruce Bittles, chief investment strategist at Baird, said several factors likely played a role in the late-day sell off, noting that the Dow and S&P 500, after seven days in a row of gains, were technically “overbought.” In addition, enthusiasm around Russia’s COVID-19 vaccine efforts faded throughout the day, he said, but said the most important factor was a sharp rise in Treasury yields that “surprised investors and caught some off guard.” A further sharp rise would likely be a big negative for stocks, he said. Some analysts have been looking for a potentially sharp near-term rotation out of popular growth oriented stocks toward more cyclical shares once there were signs the worst of the pandemic was past and the economy could head toward a fuller reopening. Read:Don’t assume this stock-market value rotation will stick, J.P. Morgan says “In our central scenario, we expect no renewed nationwide lockdowns. Moderate restrictions on activity should be sufficient to keep outbreaks manageable, with a vaccine widely available from 2Q 2021,” said Mark Haefele, chief investment officer for global wealth management at UBS. Combined with expansionary monetary policy and a moderate boost to fiscal stimulus, that would allow for a rebound in economic activity to pre-pandemic levels by 2022, he said, in a note. With yields anchored near record lows, the equity risk premium can normalize to pre-pandemic levels, allowing the S&P 500 to trade at 3,500 by the end of June 2021, Haefele said. The Dow’s biggest gainers were JPMorgan Chase & Co. JPM, -0.57% and American Express Co. AXP, +0.26%, while Apple Inc. AAPL, +1.74% was its biggest drag. “You’re starting to see a big catch up trade,” said Sam Hendel, president and co-portfolio manager at Levin Easterly Capital, in an interview, about the recent rally in equities away from the handful of technology companies that have led stock benchmarks higher, as the pandemic forced many white collar jobs to be done from home. “Tech has really shined,” he said, but added that several catalysts, including optimism around an earnings recovery and the development and distribution of an effective vaccine, would benefit downtrodden stocks over the long run. Meanwhile, the number of new COVID-19 cases in the U.S. has fallen 18% over the past 14 days, according to a New York Times tracker, while deaths have fallen by 6%. Experts also reacted with alarm to Russia’s move to registered the world’s first COVID-19 vaccine without completing Phase 3 trials. The announcement marked a milestone in the race to find a vaccine against the disease, but also raised international concerns that Moscow had rushed the clinical evaluation of the treatment. See: Russia’s accelerated COVID-19 vaccine greeted with alarm as experts say Phase 3 trial is essential Thomas Barkin, president of the Richmond Federal Reserve, became the lasted Fed official to sound an alarm about the U.S. economy if Washington fails to produce another round of pandemic aid to beleaguered workers and businesses hammered by the coronavirus pandemic, saying that without the right stimulus, the economy could suffer a relapse. White House officials and top Democratic lawmakers on Monday indicated they were ready to resume talks on a coronavirus aid package after President Donald Trump over the weekend signed executive orders that would extend some elements of existing help that lapsed at the end of July, though there as little sign of movement. Trump’s orders, meanwhile, could face legal and logistical hurdles. Investors, however, did appear to seize on Trump’s remark late Monday, in which he said the administration was considering a capital-gains tax cut. “This is old news in a sense as Trump has floated this idea before, but markets may have taken it more seriously this time as the president seems eager to bypass the deadlocked Congress if he can,” said Marios Hadjikyriacos, investment analyst at XM, in a note. The National Federation of Independent Business said its Small Business Optimism Index fell to 98.8 in July down 1.8 points from June. Economists surveyed by The Wall Street Journal expected a reading of 99.9. The July producer-price index rose by 0.6% in July. Economists surveyed by MarketWatch had forecast a rise of 0.3%. Core PPI, which strips out food and energy costs, rose 0.3%.Which companies were in focus? Shares of Canada Goose Holdings Inc. GOOS, +0.58% fell 5.2% after the company reported a widening loss and a sharp drop in revenue. Casper Sleep Inc. CSPR, -0.27% shares dropped 6.2% after the mattress seller reported a narrower-than-expected loss in the second quarter. Shares of Uber Technologies Inc. UBER, -0.18% fell 3.3% and Lyft Inc. LYFT, +2.16% lost 1.7% after a California judge on Monday ruled the ride-sharing companies must classify their drivers as employees due to a new state law. Airbnb Inc., another sharing economy company, is getting ready to file its paperwork to go public later this month, laying the groundwork for a potential listing before the end of the year, The Wall Street Journal reported Tuesday, citing people familiar with the matter. Beaten-down financial sector stocks rallied as Treasury yields rose, with the Financial Select Sector SPDR ETF XLF, +0.11% rising 1.2%. Qualcomm Inc. QCOM, +2.06% shares rose 2% after a report that a U.S. appeals court tossed out an antitrust ruling against the chip maker. Wayfair Inc. W, -2.59% shares were rose 3.7% as the company looks to raise $1.2 billion via a convertible-note offering, the specific terms of which weren’t announced. What did other markets do? In Asia trade, China’s CSI 300 index 000300, +2.04% fell 0.9%, while Hong Kong’s Hang Seng Index HSI, -0.30% rose 2.1% and Japan’s Nikkei 225 Index NIK, -0.11% advanced 1.9%. In Europe, the pan-European Stoxx 600 Europe Index SXXP, +0.55% and the FTSE 100 UKX, +0.64% each rallied 1.7%. The yield on the 10-year Treasury note TMUBMUSD10Y, 0.777% rose 7 basis points to 0.64% as investors shunned safe-haven assets. Bond prices move inversely to yields. Gold GC00, +2.17% retreated Tuesday from record territory, with December futures tumbling 4.6% to settle at $1,946.30 an ounce. Crude oil ended lower, with U.S. benchmark futures CL.1, -1.62% down 0.8% to settle at $41.61 a barrel. The greenback was down 0.1%, with the ICE U.S. Dollar Index DXY, -0.58%, a gauge of the buck against a half-dozen major rivals, at 93.63."}]}