{"article": [{"url": "https://www.marketwatch.com/story/trump-says-bidens-not-a-savior-of-americas-soul-but-rather-the-destroyer-of-americas-jobs-2020-08-28", "published": 1598574140.0, "headline": "Trump says Biden's 'not a savior of America's soul,' but rather the 'destroyer of America's jobs'", "body": "President Donald Trump on Thursday night made an effort to turn his Democratic challenger's campaign rallying cries against him, as he accepted the Republican Party's nomination and delivered the last speech at the GOP's four-day convention. \"In America, we don't turn to government to restore our souls. We put our faith in Almighty God,\" Trump said, in a reference to Biden's pledge to \"restore the soul of America.\" \"Joe Biden is not a savior of America's soul. He is the destroyer of America's jobs, and if given the chance, he will be the destroyer of American greatness.\" Trump said his opponent's record is \"a shameful roll call of the most catastrophic betrayals and blunders in our lifetime,\" highlighting Biden's vote for \"the Nafta disaster, the single worst trade deal ever enacted,\" as well as his support of \"China's entry into the World Trade Organization, one of the greatest economic disasters of all time.\" The president said China \"supports Joe Biden and desperately wants him to win. I can tell you that upon very good information.\" \"He repeatedly supported mass amnesty for illegal immigrants. He voted for the Iraq war,\" Trump also said. The address, delivered from the White House grounds, capped the mostly virtual Republican National Convention. It followed testimonials earlier in the week from a range of speakers, including Donald Trump Jr. and Nikki Haley on Monday, first lady Melania Trump and Secretary of State Mike Pompeo on Tuesday, and Vice President Mike Pence on Wednesday. Related:Trump's convention breaks norms - and possibly the Hatch Act Ahead of the president's remarks, Biden's running mate, Sen. Kamala Harris, attacked Trump's handling of the coronavirus crisis, saying he was \"unwilling and unable to deal with this crisis\" in part because he was \"fixated on the stock market SPX, +0.87%  DJIA, +0.56%  over fixing the problem.\" Trump defended his administration's response to the pandemic, saying it launched the largest national mobilization since World War II, and the U.S. has among the lowest case fatality rates of any major country. Trump also seized on a line in Biden's speech a week ago. In his address at the Democratic convention, the former vice president cast himself as \"an ally of the light, not the darkness,\" as he pledged to rebuild the battered U.S. economy and tackle the coronavirus pandemic. \"Joe Biden may claim he is an 'ally of the light,' but when it comes to his agenda, Biden wants to keep you completely in the dark,\" Trump said. He accused the former vice president of planning a $4 trillion tax hike, which \"will totally collapse a rapidly improving economy and once again record stock markets that we have right now will also collapse - that means your 401(k)s.\" \"Biden has promised to abolish the production of American oil, coal, shale and natural gas - laying waste to the economies of Pennsylvania, Ohio, Texas, North Dakota, Oklahoma, Colorado and New Mexico,\" Trump said. \"These same policies led to crippling power outages in California just last week.\" (Biden's campaign has said he does not endorse completely banning fossil fuels, and the cause of California's blackouts is still being investigated.) \"How can Joe Biden claim to be an 'ally of the light' when his own party can't even keep the lights on?\" he asked. The president also said Democrats will \"make every city look like Democrat-run Portland, Oregon. No one will be safe in Biden's America.\" \"If the left gains power, they will demolish the suburbs, confiscate your guns, and appoint justices who will wipe away your Second Amendment and other constitutional freedoms,\" he said. Opinion:Trump, running for re-election, is faking it on the economy and the pandemic Counterpoint:Don't count Trump out - here's how he can still win in November In RealClearPolitics averages of polls as of Thursday, Biden is leading Trump by 7.1 percentage points in nationwide surveys and by 3.7 points in key swing states that are likely to decide the November election."}]}