{"article": [{"url": "https://www.marketwatch.com/story/the-market-is-underpricing-the-possibility-of-a-vaccine-goldman-sachs-strategists-say-11596707265", "published": 1596892220.0, "headline": "The market is underpricing the possibility of a vaccine, Goldman Sachs strategists say", "body": "French engineer-virologist Thomas Mollet looks at 24 well plates adherent cells monolayer infected with a SARS-CoV-2 virus at the Biosafety level 3 laboratory of the Valneva SE Group headquarters in Saint-Herblain, near Nantes, France, on July 30, 2020. jean-francois monier/Agence France-Presse/Getty Images The market is underpricing the possibility of a vaccine, Goldman Sachs strategists say. Forecasts are assuming a nearly 40% chance of a vaccine being broadly available by the first quarter of 2021, and the strategists, led by Kamakshya Trivedi, say there is a good chance that at least one vaccine will be approved by the Food and Drug Administration by the end of November and broadly distributed by the middle of 2021. “This kind of timeline could see a substantial boost to GDP [gross domestic product] relative to a ‘no-vaccine’ case, particularly for the U.S., which is likely to lead the vaccine race and is likely to experience worse outcomes than in Europe without a vaccine,” the strategists say. The steep rise in vaccine probabilities is one key reason that the equity market has managed to make new highs even without definitive improvement in U.S. health outcomes, the strategists add, with the other reason being the fall in inflation-adjusted bond yields. The S&P 500 SPX, +0.87% has climbed 49% from its March lows, and the technology-led Nasdaq Composite COMP, +1.39% has registered 31 records this year. The current equity market level is consistent, they say, with a 60% chance of no vaccine. “On these estimates, options markets may be underpricing the fatness of both ‘tails,’ especially the upside case. Out-of-the-money call options on the S&P 500 (and some other indices) still look attractively priced given our view of the vaccine timeline outcomes,” they say. The strategists also say the U.S. election is being underappreciated, not for its impact on domestic policy but for international relations. The “international implications both in the run-up to the election and beyond will be equally important for market direction in coming months,” they say. While the slow-motion decoupling of the U.S. and China will probably continue regardless of who wins, “a Biden administration would likely use different tactics, including more cooperation with traditional allies and less aggressive use of tariffs.” This, in turn, could lead to another leg of the dollar DXY, -0.58% falling, particularly against the yuan USDCNY, . A vaccine could spark a renewed rotation toward traditional cyclicals, steeper bond-market yield curves, and outperformance in emerging market currencies and equities. “We suspect that it is still too early to position aggressively for that shift, but think that options exposure in some of these areas may already make sense,” they say. School reopening risks, they add, may continue the theme of low real rates, tech leadership, and the defensive rally of the past month. “But with some of these moves getting stretched, investors should be open-minded about the possibility of a shift in leadership across global markets in the months beyond, especially if the news flow on the vaccine front continues to be encouraging,” the strategists said."}]}