{"article": [{"url": "https://www.marketwatch.com/story/dow-futures-jump-more-than-350-points-to-start-the-week-led-by-surge-in-china-markets-2020-07-06", "published": 1594055960.0, "headline": "Dow surges 459 points, Nasdaq clinches fresh record close, despite concerns of economic toll of unfettered U.S. virus cases", "body": "U.S. stocks finished sharply higher Monday, with the Nasdaq scoring a record close, as Wall Street followed surging Chinese equity benchmarks to their best levels in at least two years. Monday’s upbeat market action contrasted with a further spike in U.S. coronavirus cases and a resurgence of business restrictions by state and local authorities struggling to contain the viral outbreak. How did benchmarks perform? The Dow Jones Industrial Average DJIA, +0.56% gained 459.67 points, or 1.8%, to end at 26,287.03. The S&P 500 SPX, +0.87% climbed 49.71 points, or 1.6%, ending at 3,179.72 and booking five straight sessions of gains, its longest streak since Dec. 17, according to Dow Jones Market Data. The Nasdaq Composite Index COMP, +1.39% surged 226.02 points, or 2.2%, to 10,433.65, scoring a fresh closing record. The Dow finished last week’s holiday-shortened period up 3.3%, the S&P 500 put in a weekly gain of 4%, while the Nasdaq returned 4.6%, after closing at a record on Thursday. The U.S. market was closed on Friday in observance of the Independence Day holiday. What drove the market? U.S. stocks ended up sharply Monday, led by shares of financial companies and record-setting technology shares as Wall Street followed Chinese equity markets higher. Goldman Sachs Group Inc. GS, -0.21% share advanced 5.1%, leading the blue-chip Dow higher, along with Boeing Co. BA, -0.39% and Walgreens Boots Alliance Inc. WBA, -1.96%. But Monday’s gains also came with growing doubts about the ability of the U.S. to contain the viral outbreak and its economic fallout, after COVID-19 cases climbed across the U.S. over the Fourth of July weekend. Coronavirus update: U.S. cases reach 2.9 million and death toll tops 130K, as 38 states see cases on the climb “This is potentially setting the U.S. on a very different activity restart path than most Western countries and much of Asia,” warned a BlackRock Investment Institute team led by Mike Pyle, global chief investment strategist, in a note Monday. The BlackRock team lauded the coordinated U.S. fiscal and monetary response in March, but they also warned that the “resurgence of the virus is taking place just as Congress and the White House face a critical decision over whether to extend a number of crisis measures, including additional federal unemployment benefits set to expire at the end of July.” Kristina Hooper, Invesco’s chief global market strategist, also warned that recent improvements on the U.S. jobless front and surprisingly better economic data could be derailed in the coming months if policy makers become complacent in their response to rising COVID-19 infections. “In my view, more fiscal stimulus is clearly needed as so much of the stimulus already enacted is very temporary in nature,” Hooper wrote in a client note. “In addition, we are seeing a growing number of companies announce layoffs and file for bankruptcies while others are voluntarily re-closing stores.” In U.S. economic data, the Institute for Supply Management reported its index of service sector companies jumped to 57.1 in June from 45.4 in May, marking the single-biggest increase since the survey was created in 1997. MarketWatch-polled economists expected to see a reading of 51. Any number above 50 represents an expansion in economic activity. Yet, there were doubts about the sustainability of the positive sentiments. “Thousands of retail shops and bars and restaurants are closing, or soon will be, after the coronavirus pandemic stopped the flow of traffic and crashed sales and revenues and tipped many businesses into financial bankruptcy and, yet, purchasing managers say the outlook for the service sector is looking up,” said Chris Rupkey, chief financial economist for MUFG. Read: Skyrocketing of COVID-19 cases around the U.S. slows dine-in restaurant recovery Market bulls have been attributing rising stocks to optimism around a sharp, or V-shaped, economic recovery in the U.S., as well as Asia, in no small part due to global fiscal and monetary stimulus that helped markets recover from the depths of their mid-March selloff. Beyond the rise in U.S. infections, optimism reflected in equities on Monday also comes despite economists at Goldman Sachs lowering their already downbeat forecast for U.S. domestic growth in 2020 to negative 4.6%, from a previous forecast for a 4.2% drop, pointing to the reimposition of COVID-19 restrictions on business activity. For 2021, the bank is sticking to its forecast for growth to rebound 5.8%. In Asian hours Monday, Chinese shares jumped, with the flagship Shanghai Composite SHCOMP, +1.67% finishing up 5.7%, to the highest level since 2018 and the CSI 300 Index 000300, +2.04% booking a similar return, after a front-page editorial in state-owned paper, China Securities Journal, said fostering a “healthy bull market” is important, according to a translation. The move higher in stocks came as China continued to fends off sanctions and criticism about its decision to impose a national-security law in Hong Kong, a crackdown that has drawn the rebuke of several countries, including the U.S. and Canada. Which stocks were in focus? Buffett’s Berkshire Hathaway BRK.A, +0.06% BRK.B, +0.24% agreed to buy natural-gas transmission and storage assets from Dominion Energy D, -0.34% for about $10 billion including debt, after the investor had refrained from buying assets during the public-health crisis so far. Berkshire Hathaway shares gained 2.2%. Shares of Tesla Inc. TSLA, +1.89% rose 13.5% Monday after a J.P. Morgan analyst raised his stock-price forecast for the electric vehicle maker, thought it remained well below the company’s current value. Shares of Regeneron Pharmaceuticals Inc. REGN, +0.36% gained 0.8% after the drugmaker said it had begun a Phase 3 clinical trial testing an antibody cocktail to prevent COVID-19. Uber Technologies Inc. UBER, -0.18% to purchase food-delivery service Postmates for around $2.65 billion, according to media reports. The ride-hailing company’s shares gained 6%. Shares of Sina Corp. SINA, -0.14% shot up 10.6% after the China-based online media company disclosed that it received a buyout bid from New Wave MMXV Ltd., in a deal that would value Sina at about $2.68 billion. Amazon.com, Inc.’s stock AMZN, +3.01% rose 5.8% to close at $3,057 a share, topping the $3,000 level for the first time in its history and clinching a $1.5 trillion valuation. Unum Therapeutics Inc. US:UMRX surged 394.6% to $2.20 per share, leading the Nasdaq’s gains Monday, after it announced the completion of its acquisition of Kiq LLC, a privately held biotech company, and a near $104.4 million equity raise through the sale of convertible stocks. How did other assets perform? West Texas Intermediate U.S. crude US:CLQ20 for August delivery fell only 2 cents, or 0.05%, to settle at $40.63 a barrel, on the New York Mercantile Exchange. In precious metals, August gold futures US:GCQ20 rose $3.50, or 0.2%, to close at $1,793.50 an ounce. The 10-year Treasury note yield TMUBMUSD10Y, 0.777% was up 1.3 basis points at 0.683%. Bond prices move inversely to yields. The greenback fell 0.4% against a basket of its major rivals, based on trading in the ICE U.S. Dollar Index. DXY, -0.58% In European equities, the Stoxx Europe 600 index SXXP, +0.55% closed up 1.6%, and London’s FTSE 100 UKX, +0.64% climbed 2.1%. Mark DeCambre contributed reporting"}]}