{"article": [{"url": "https://www.marketwatch.com/story/how-to-save-money-in-tough-times-6-dos-and-donts-2020-07-02", "published": 1593884240.0, "headline": "How to save money in tough times: 6 doâ\u0080\u0099s and donâ\u0080\u0099ts", "body": "This article is reprinted by permission from NerdWallet. Probably the last thing you want to think about during a crisis is working on healthy financial habits like saving money. But if youâ\u0080\u0099re able to save, you can make your eventual recovery easier. â\u0080\u009cEvery time you put some [money] away, youâ\u0080\u0099re looking out for your future self,â\u0080\u009d says Saundra Davis, founder and executive director at Sage Financial Solutions, a San Francisco Bay Area-based nonprofit that offers financial coach training and services to people across the wealth spectrum. Whether or not your financial situation has changed since the start of 2020, you may benefit from these saving strategies now or down the road.Do: Reduce costs, including bills if needed Common advice to save money is to cut unnecessary costs. During a continuing crisis such as a pandemic, you might need to redefine what is â\u0080\u009cunnecessary.â\u0080\u009d Be sure to read: Making sense of the new July 15 deadline for filing â\u0080\u0094 and paying â\u0080\u0094 your taxes Start with the cost of bare essentials to operate your household â\u0080\u0094 rent or mortgage, utilities, food â\u0080\u0094 and when you factor bills in, donâ\u0080\u0099t treat them all the same. For example, paying your credit card bill in full every month is normally the best tactic, but in hard times, itâ\u0080\u0099s OK not to follow this rule and just pay the minimum. For loan payments, see if your creditor can offer relief. â\u0080\u009cDonâ\u0080\u0099t have your lender deciding what you can pay,â\u0080\u009d Davis says. â\u0080\u009cSketch out your own budget.â\u0080\u009d This might mean working with your lender to reduce payments or suspend them temporarily.Do: Adjust your savings goals Having a dollar amount to save up to is generally helpful. AnÂ emergency fund, for example, is a standard goal that involves building up three to six monthsâ\u0080\u0099 worth of living expenses. But during an emergency, consider resetting expectations. Also see: Hereâ\u0080\u0099s how many Americans are able to save their stimulus checks â\u0080\u009cIf your income changes, you arenâ\u0080\u0099t beholden to saving a fixed amount,â\u0080\u009d says LaKhaun McKinley, certified financial planner and owner of the firm MNM Vested in Katy, Texas. The way you save might need to be tweaked, too. If you use automatic transfers from checking to savings accounts, see if that amount is still doable for you. If not, reduce the amount. Or, as a last resort, cancel the transfers for now and make one-off transfers when possible. When saving money, â\u0080\u009cthe habit is more important than the amount,â\u0080\u009d Davis says.Do: Find a high savings rate Opening aÂ high-yield savings accountÂ at an online bank is a good strategy, regardless of the economic environment. The national average rate is 0.06%, but some online savings accounts are currently offering over 1% annual percentage yield. The account-opening process can take a few minutes. Opening a high-yield account â\u0080\u009ccan be such a simple way to earn more,â\u0080\u009d says Kelley Long. Sheâ\u0080\u0099s a Chicago-based certified public accountant, financial planner and member of the American Institute of CPAsâ\u0080\u0099 Consumer Financial Education Advocates.Do: Get help from your community to save costs If youâ\u0080\u0099re experiencing financial hardship, call 2-1-1 or visit the website 211.org. This is a free way to learn about resources in your community, including food banks, meal services for seniors and students, shelters, mental health services and more. If youâ\u0080\u0099ve never asked for help like this before, it may feel uncomfortable. But accepting meals or other support can be an important lifeline as well as help you save money. Also see: How bad is it if I withdraw from my 401(k) during the pandemic? â\u0080\u009cWe want to stay aware of whatâ\u0080\u0099s available in our community and give ourselves the emotional room to do things weâ\u0080\u0099ve never done before,â\u0080\u009d Davis says. Some relief is nationwide, includingÂ postponed federal student loan paymentsÂ andÂ coronavirus-specific unemployment programs, but your local community might have additional resources.Donâ\u0080\u0099t: Dip into savings without a plan If you have an emergency fund and you need it now, use it. But estimate the amount you need before withdrawing, and keep tabs on how you spend it. Youâ\u0080\u0099ll eventually need to save up again, and you want to make that process manageable. It might help to settle on a minimum amount you need to keep in a savings account to feel OK. â\u0080\u009cEveryone has a different feeling [for] what would give them that security,â\u0080\u009d Long says. For some people, for example, â\u0080\u009cseeing a comma in your account can have a formative effect on your feeling of financial security.â\u0080\u009dDonâ\u0080\u0099t: Withdraw from savings too often Keep an eye on the frequency with which you turn to your savings account. Banks can charge an excessive savings withdrawal fee if you go over six a month. During COVID-19, the Federal Reserve has paused this rule, but itâ\u0080\u0099s up to each bank to choose whether to charge the fee. Watch out for other fees, too, such as for overdrawing if you dip past your checking account balance. See: The best side gigs you can do from home If youâ\u0080\u0099re running into trouble with fees, examine why you needed more savings than expected. â\u0080\u009cWe might be overaggressive in savings goals. Thatâ\u0080\u0099s usually due to failing to account for certain expenses in our spending plan,â\u0080\u009d Long says. â\u0080\u009cIn a crisis,â\u0080\u009d she adds, â\u0080\u009cwe need to remember that there are times that we canâ\u0080\u0099t be long-term in our thinking.â\u0080\u009dMore from NerdWallet: Cash Accounts and Apps to Buddy Up With Your Investments How to Bank When You Canâ\u0080\u0099t Go to the Bank 3 Ways to Skip Your Bankâ\u0080\u0099s Long Phone Lines Spencer Tierney is a writer at NerdWallet. Email: spencer.tierney@nerdwallet.com. Twitter: @SpencerNerd."}]}