{"article": [{"url": "https://www.marketwatch.com/story/coronavirus-update-pandemic-is-not-even-close-to-being-over-says-who-head-urging-better-testing-and-face-masks-2020-06-30", "published": 1593584420.0, "headline": "Coronavirus update: Pandemic is 'not even close to being over,' says WHO head, urging better testing - and face masks", "body": "The coronavirus pandemic is \"not even close to being over,\" according to the head of the World Health Organization, and the worst is still to come, in what was a grim assessment of the state of affairs some six months after the first cases were reported in China. \"Six months ago, none of us could have imagined how our world - and our lives - would be thrown into turmoil by this new virus,\" Tedros Adhanom Ghebreyesus told reporters at a news briefing on Monday. \"The pandemic has brought out the best and the worst of humanity.\" Tedros said WHO is sending a team to Wuhan, China next week to work on the virus's origins. He stressed that everyone, including those not feeling any symptoms, should continue to socially distance, wash their hands frequently - and wear face masks when appropriate. Tedros said contact tracing is still the most effective tool in containing the spread and expressed frustration at those countries where it has not been working well. See:New York, New Jersey and Connecticut want people coming from hot spots to quarantine - but how will they enforce it? Contact tracing has been notably poor in the U.S., with Dr. Anthony Fauci, the government's top infectious disease expert, saying Friday that the process of tracking down people who may have been exposed to those infected was \"not going well.\" That sentiment was echoed Tuesday by the Harvard Global Health Institute in a report that said most U.S. states are still far behind where they need to be on testing, even as COVID-19 outbreaks grow more severe. A full 35 states are showing increasing rates of infection over a 14-day period, according to a New York Times tracker, and seven states are experiencing a surge in hospitalizations, namely Arizona, Arkansas, California, North Carolina, South Carolina, Tennessee and Texas. See:Why do so many Americans refuse to wear face masks? Politics is part of it - but only part \"While testing has doubled in the nation since our last estimates in May (from around 250,000 to more than 500,000 daily tests), many states opened up before suppressing the virus and are now seeing rapid increases in new cases,\" said the HGHI. \"States can and must work together to ramp up their testing, tracing, and supported isolation strategies (TTSI), combine them with mask wearing, distancing and other measures, and bring case counts down. This can save both lives and billions of dollars.\" See now:Fear of the coronavirus did more to keep people at home than lockdowns, study says Fauci and other members of the White House Task Force created to manage the crisis testified to a Senate Committee on Tuesday on how to get Americans safely back to work and school. Fauci again urged young people, in particular, to behave more responsibly, lamenting the many images on social media of them gathering closely in bars, unmasked. Don't miss:Goldman Sachs has done the math and a national mask mandate to halt the spread of coronavirus would have a big impact on the U.S. economy \"We need to emphasize the responsibility that we have both as individuals and as part of a societal effort to end the epidemic...We've got to get that message out, that we are all in this together. And if we are going to contain this, we've got to contain it together,\" he said. Calling the latest surges \"disturbing,\" Fauci said it the virus is not contained, it could result in up to 100,000 cases a day, up from the daily record of 40,000 set last week. Meanwhile, some state officials are reversing some of the reopening moves of recent weeks, with Arizona Gov. Doug Ducey closing bars, gyms, cinemas, water parks and tubing rentals for at least a month and limiting gatherings to no more than 50 people. Kansas Gov. Laura Kelly said she will sign an executive order mandating the wearing of face masks in public, in an effort to rein in the spread in her state. New Jersey Gov. Phil Murphy said indoor dining will no longer resume on Thursday in time for the July 4 holiday weekend, and New York Gov. Andrew Cuomo is expected to follow suit. Don't miss:Cuomo to Trump: 'Put a mask on it'Latest tallies There are now 10.4 million confirmed cases of COVID-19 worldwide and at least 507,014 people have died, according to data aggregated by Johns Hopkins University. The number of people who have recovered reached 5.3 million. The U.S. continues to lead the world, with a case tally of 2.6 million and death toll of 126,360. The data have been revised down since this morning. Brazil is next with 1.37 million cases and 58,314 deaths, the data show. Russia is third measured by cases at 649,929, followed by India with 566,840 and the U.K. with 314,159. The U.K. has 43,815 fatalities, the highest in Europe and third highest in the world. China has 84,780 cases and 4,641 fatalities. The European Union published a list of countries whose citizens will be allowed to enter the trading block during the summer tourism season and the U.S. did not make the cut, as expected, given it has not contained the spread of COVID-19, the Guardian reported. Travellers from China will be allowed entry, if Beijing offers a reciprocal arrangement. Travellers from Russia, Brazil and India are also banned. What's the latest medical news? Inovio Pharmaceuticals Inc. INO, -1.36%  disclosed early-stage data from a Phase 1 trial of its COVID-19 vaccine candidate, and said it was considered safe and well-tolerated in all 40 of the participants in a Phase 1 clinical trial. However, the company did not disclose data about the participants' antibody response, though it said 94% of 36 trial participants showed \"overall immunological response rates based on preliminary data assessing humoral (binding and neutralizing) and T cell immune responses.\" The stock, which has skyrocketed this year amid high hopes for vaccine development, promptly fell. Three trial participants tested positive for COVID-19 and one left the study for non-clinical reasons. There were some adverse events, though none were serious, that primarily consisted of redness on the skin where the experimental vaccine was administered. Inovio has added older participants to the early-stage trial; the original 40 are between the ages of 18 and 50 years old. It also plans to start a Phase 2/3 study this summer. Inovio is one of a handful of companies in the U.S. studying whether their experimental vaccines can prevent infection with the coronavirus. The U.S. Food and Drug Administration is planning to release an outline of its conditions for approving COVID-19 vaccines later Tuesday, the Wall Street Journal reported. See now: Gilead's coronavirus drug will cost $2,340 - which sounds expensive, but here's why it's not The FDA said no vaccine will be approved unless it clearly demonstrated proof of safety and effectiveness through a clinical study, and will have to be at least 50% more effective than placebo, the WSJ reported. Vaccine makers will be required to keep monitoring safety after approval and recommend that people who received the vaccine be followed for a year after treatment. The FDA assured that it will not reduce standards or cut corners in its review to approve a vaccine, the report said. What's the economy saying? A measure of business conditions in the Chicago region rebounded slightly to 36.6 in June, after falling to a 38-year low in May, according to a report on CNBC. Economists surveyed by Econoday had expected a stronger rebound to 44.5 from 32.3 in May. Any reading below 50 indicates worsening conditions. The Chicago PMI is the last of the regional manufacturing indices before the national ISM data for June is released on Wednesday. Separately, the Conference Board said consumer confidence rose to a three-month high in June, as a reopening economy buoyed the spirits of Americans, but a recent spike in coronavirus cases could dampen any optimism unless it's brought under control soon. The index of consumer confidence rose to 98.1 this month from a revised 85.9 in May, the Conference Board said Tuesday, as MarketWatch's Jeffry Bartash reported. Economists polled by MarketWatch expected a reading of 90.8 in June. The level of confidence is remains well below pre-crisis levels, however, after steep declines in March and April. The index had stood near a 20-year high at 132.6 in February before the pandemic shut down large swaths of the economy. \"Consumer confidence partially rebounded in June but remains well below pre-pandemic levels,\" said Lynn Franco, senior director of economic indicators at the board. \"Faced with an uncertain and uneven path to recovery, and a potential COVID-19 resurgence, it's too soon to say that consumers have turned the corner and are ready to begin spending at pre-pandemic levels.\" See: How COVID-19 could spread on college campuses. Will students be safe?What are companies saying? Memory-chip maker Micron Technology Inc. MU, -0.02% posted better-than-expected earnings for its fiscal second quarter late Monday, boosted by a boom in data centers. The company also offered a strong outlook for the current quarter, despite some issues with the global supply chain due to the pandemic. \"We continue to see healthy demand trend in cloud in the second half of the year,\" Micron Chief Executive Sanjay Mehrotra told analysts on a conference call. \"Cloud is still actually in early innings, and long-term trends for cloud are strong.\" In the second quarter, the company said that the work-from-home economy, e-commerce and videogame streaming all drove a strong surge in demand for more cloud-computing capabilities. Micron's comments echo those that other chip giants, such as Intel Corp. INTC, -1.03% and Nvidia Corp. NVDA, -0.54%, made last quarter. On Monday, Xilinx Inc. XLNX, +14.10% joined the crowd when it updated its guidance for its fiscal first quarter, noting that strong performance in wireless and data center were offsetting weakness in consumer segments. There was less cheery news for auto makers on Tuesday, when Moody's Investors Service said it has downgraded $130 billion worth of debt owed as a result of the coronavirus-induced economic downturn, which the credit rating agency expects will hurt auto demand through 2022. However, the companies that were downgraded were \"weakly positioned\" and had challenges before the coronavirus outbreak. And overall, Moody's said the auto industry is \"much better prepared\" for the current downturn than it was for the 2008 to 2009 recession, and has much better liquidity. Among U.S. auto makers, Moody's rates General Motors Co.'s GM, -0.15% senior unsecured notes at Baa3, the lowest investment grade rating, with a negative outlook, and Ford Motor Co.' F, -1.36%  senior unsecured debt is rated Ba2, or two notches into \"junk\" territory, with a negative outlook. Elsewhere, companies continue to raise capital to boost their liquidity positions and to offer updates on reopening plans and recent performance milestones. Here's the latest news on companies and COVID-19: â\u0080¢ Acuity Brands Inc. AYI, -1.89% reported fiscal third-quarter results that were well above expectations, although sales fell 18.1% from a year ago amid a \"challenging market conditions\" resulting from the pandemic. The lighting and lighting controls company's gross profit margin improved by 170 basis points (1.7 percentage points) to 42.2%, due primarily to lower input costs, contributions from acquisitions and favorable sales mix, partially offset by lower average selling prices. The company said there was still \"great uncertainty\" regarding demand and the timing of the economic recovery because of the pandemic, but it expects pricing pressure and costs related to tariffs to continue in the fourth quarter. â\u0080¢ Aon PLC AON, +0.53% will end the previously announced salary reductions of up to 20%, effective July 1. The consulting company plans to repay employees in full, plus 5% of the withheld salary amounts. Aon continues to expect no jobs will be lost as a result of the pandemic. The decision to end salary reductions is unrelated to any near-term change in financial performance, but is because the expected likelihood of the worst-case economic scenario has decreased significantly. â\u0080¢ Chesapeake Energy Corp. US:CHK said a bankruptcy court has approved its $925 million debtor-in-possession financing, a special loan used in bankruptcy proceedings that the company secured from lenders under its revolving credit facility. The pioneer in fracking filed for Chapter 11 protection on Sunday, battered by a rout in oil and gas prices during the pandemic. The U.S. Bankruptcy Court for the Southern District of Texas also approved a variety of \"first-day\" relief, allowing it to pay owner royalties, employee wages and benefits and to pay certain vendors and suppliers. The company will use the bankruptcy process to bolster its balance sheet and restructure debt to get to a more sustainable capital structure. The company has $16.2 billion in assets and $11.8 billion in debt. â\u0080¢ Cinemark Holdings Inc. CNK, -3.87%  plans to reopen theaters that were closed during the pandemic starting July 24. The Plano, Texas-based company said its cinemas will have enhanced cleaning and safety protocols and will take a phased approach to reopening. The company will screen \"Unhinged\" on July 31, \"The Broken Hearts Gallery\" on Aug. 7, followed by \"Tenet: on Aug. 12, \"Mulan\" on Aug. 21, \"Bill & Ted Face the Music\" on Aug. 28, and \"A Quiet Place Part II\" on Sept. 4. â\u0080¢ Conagra Brands Inc. CAG, +0.18% the owner of food brands, including Birds Eye and Healthy Choice, topped earnings estimates for its fiscal fourth quarter thanks to strong demand for at-home dining during the pandemic. \"Our business clearly benefited from increased at-home eating in the fourth quarter, as the elevated retail demand outweighed the reduced food service demand,\" Chief Executive Sean Connolly said in a statement. \"In retail, many consumers tried our modernized products for the first time and then returned for more. While we are optimistic about the long-term implications of recent consumer behavior shifts, given COVID-19 uncertainties, we are only providing guidance for the first quarter of fiscal 2021. We intend to provide an update on our fiscal 2021 outlook next quarter.\" The company is expecting first-quarter adjusted EPS of 54 cents to 59 cents, compared with a FactSet consensus of 54 cents. â\u0080¢ Forterra Inc. FRTA, -1.86%, a maker of water and drainage pipes, provided a second-quarter sales outlook that was above expectations, as higher average selling prices offset volume declines. The company expects sales of $410 million to $430 million, compared with $410 million a year ago and the FactSet consensus of $391 million. Product unit margins increased in both its business segments, while the volumes were consistent with expectations, with drainage volumes falling in the lower-teens percentage range from a year ago and water volumes staying relatively flat. Separately, the company fully repaid the $180 million borrowed under its revolving credit facility, which it borrowed as a precaution given the uncertainty surrounding the pandemic. Forterra also amended its credit facility to increase the size to $350 million from $300 million and extend the maturity to June 2025. .â\u0080¢ GrowGeneration Corp. GRWG, +0.95% priced an upsized offering of 7.5 million shares at $5.60 each on Tuesday, to raise $42 million. The operator of hydroponic and organic garden centers originally planned to raise just $35 million in the offering. Proceeds will be used to expand its network of centers which currently stands at 27 locations either through organic growth or acquisitions, and for general corporate purposes. The Denver, Colo-based company joins the many companies raising capital via debt or equity offerings during the pandemic. Oppenheimer was sole book-runner on the deal, with Ladenburg Thalmann and Lake Street Capital Markets acting as co-managers. â\u0080¢ Jabil Inc. JBL, -0.08% is launching an operation in the U.S. to make face masks and other personal protective equipment for businesses that are reopening amid the pandemic. St. Petersburg, Fla.-based Jabil, which offers manufacturing and supply chain services, will make industrial face masks and FDA-rated ones at factories in Memphis, Tennessee; Clinton, Massachusetts; and Gurnee, Illinois. The company is expecting to scale up to 1.6 million single-use face masks a day and can ramp up to more than 2 billion a year by this fall. The company expects to serve major U.S. employers, including airlines, retail and restaurant chains and government agencies â\u0080¢ Papa John's International Inc.'s PZZA, -1.18% same-store sales for the five weeks ended June 28 at its North America restaurants rose 24.4% from a year ago, and rose 6.0% internationally, as demand continued to be strong amid the pandemic. For the second quarter, same-store sales at North America restaurants increased 28.0% and rose 5.3% at its international restaurants. The FactSet consensus for overall second-quarter same-store sales is for a 24.7% rise. Only 225 of Papa John's 2,100 restaurants are closed, principally in Europe and Latin America, while \"almost all\" of its North America restaurants are open. â\u0080¢ â\u0080¢ Xilinx Inc. XLNX, +14.10% said that loosening of some restrictions on Chinese companies had helped its business. Xilinx now expects fiscal first-quarter revenue of $720 million to $734 million, up from a prior range of $660 million to $720 million. \"While we have seen some COVID-19 related impacts during the June quarter, our business has generally performed well overall, with stronger than expected revenues in our Wired and Wireless Group and Data Center Group more than offsetting weaker than expected revenues in our consumer-oriented end markets, including automotive, broadcast, and consumer,\" Chief Executive Victor Peng said in the announcement. \"A portion of the revenue strength in the quarter was due to customers accelerating orders following recent changes to the U.S. government restrictions on sales of certain of our products to international customers.\" President Donald Trump eased some restrictions on Huawei this month after lobbying from chip firms; Huawei is a major Xilinx partner. However, a Xilinx spokeswoman clarified to MarketWatch that the changes that affected its revenue were announced in late April and that Huawei was still not being included in the chip maker's forecasts. As Virus Cases Rise, a Florida Restaurant Stays Flexible to Stay Open"}]}