{"article": [{"url": "https://www.marketwatch.com/story/vindman-lawyer-accuses-trump-of-bullying-intimidation-and-retaliation-as-lieutenant-colonel-announces-army-retirement-2020-07-08", "published": 1594226000.0, "headline": "Vindman lawyer accuses Trump of â\u0080\u0098bullying, intimidation, and retaliationâ\u0080\u0099 as lieutenant colonel announces Army retirement", "body": "Lt. Col. Alexander Vindman, whose congressional testimony regarding President Donald Trumpâ\u0080\u0099s conduct while communicating with Ukraineâ\u0080\u0099s president, Volodymyr Zelensky, were central to the Trump impeachment of 2019, has announced his intention to retire from the U.S. Army. He announced the resignation on Twitter, confirming an earlier CNN report: iframe.twitter-tweet { width: 100% !important; } A legal representative had previously put out this statement, indicating that the 45-year-oldâ\u0080\u0099s decision to step away after 21 years of service resulted from the conclusion that his future in the military had been â\u0080\u009cforever limitedâ\u0080\u009d following his testimony in the impeachment inquiry: iframe.twitter-tweet { width: 100% !important; } CNN broke the news of Vindmanâ\u0080\u0099s resignation early Wednesday, reporting that the White House, after dismissing not just Vindman but his twin brother from their posts with the National Security Council, had sought to involve itself in Vindmanâ\u0080\u0099s reassignment, leading one officer to joke, according to the report, that he might man a radar station in Alaska. John Bolton, the former national-security adviser, called Vindmanâ\u0080\u0099s retirement â\u0080\u009ca loss for the country,â\u0080\u009d during an interview with MSNBC. He said the news would provoke a lot of questions, â\u0080\u009cand it should.â\u0080\u009d Vindman, said Bolton, performed admirably in his White House position and merited promotion to the rank of colonel. Vindman, in his testimony before the House last year, directly addressed his father, assuring him that the decision decades earlier to move the family to the United States from what was then the Soviet republic Ukraine had been the right one. â\u0080\u009cDo not worry,â\u0080\u009d he said, referring to his role in the hearing. â\u0080\u009cI will be fine for telling the truth.â\u0080\u009d In America, he said, â\u0080\u009cright matters.â\u0080\u009d"}]}