{"article": [{"url": "https://www.marketwatch.com/story/dow-futures-jump-400-points-as-trump-seen-weighing-1-trillion-stimulus-investors-await-powell-testimony-2020-06-16", "published": 1592326160.0, "headline": "Dow ends 526 points higher, extending win streak to three days, but  Powell says more Congressional spending may be needed", "body": "U.S. stocks closed higher Tuesday, but off the session’s best levels, after Federal Reserve Chairman Jerome Powell suggested more fiscal stimulus may be needed as the American economy may only make a slow recovery from the COVID-19 pandemic. Rising coronavirus cases in several U.S. states are also are concern for investors, even though retail sales and industrial production data show the economy is slowly recovering, and progress on the development of potential therapeutic drugs has been reported. How did benchmarks fare? The Dow Jones Industrial Average DJIA, +0.56% rose 526.82 points, or 2%, to end at 26,289.98. The S&P 500 index SPX, +0.87% added 58.15 points to close at 3,124.74, a gain of 1.9%. The Nasdaq Composite Index COMP, +1.39% advanced 169.84 points, or 1.8%, to end at 9,895.84. All three benchmarks extended their win streak to three straight sessions, but finished below their best levels of the day. On Monday, the Dow closed 157.62 points higher, or 0.6%, at 25,763.16, after falling by as many as 762 points or 3% at its Monday low, The S&P 500added 25.28 points, or 0.8%, finishing at 3,066.59, after hitting an intraday low at 2,965.66, or down 2.5%. The Nasdaq advanced 137.21 points. or 1.4%, ending at 9,726.02. Both the S&P 500 and the Dow on Monday mounted their sharpest reversal to finish in positive territory since March 19, according to Dow Jones Market Data. What drove the market? Stocks closed higher after better-than-expected U.S. retail sales and industrial production data for May, along with a report of progress on a coronavirus therapeutic drug, but Fed Chair Powell suggested that Congress may need to spend more money to ensure the U.S. can reach a full economic recovery, during the first of two days of Congressional testimony. U.S. retail sales jumped by 17.7% in May, the government said Tuesday. Economists polled by MarketWatch had forecast an 8.5% increase. “While this has bolstered arguments in favor of a V-shaped recovery, we caution that the U.S. economy is only in the initial recovery phase – one in which strong growth figures from depressed levels of activity give the false impression of an immediate return to pre-Covid economic dynamism,” wrote an Oxford Economics team led by Gregory Daco, chief U.S. economist, in a note Tuesday following the retail sales update. U.S. industrial production for May rose by 1.4%, as many factories resumed operations after shutdowns spurred by the coronavirus crisis, the Federal Reserve said Tuesday. Capacity utilization came in at 64.8%. Investors also weighed a Bloomberg report that outlined Trump administration plans for a $1 trillion infrastructure spending package. Read: It’s ‘unrealistic’ for investors to bet on Trump administration’s $1 trillion infrastructure plan, analyst says However, Powell reiterated that the road to recovery from the pandemic likely would be a long one and cautioned investors that they shouldn’t overreact to surprisingly good economic data like the May retail sales report published Tuesday because the levels of output and employment remain far below their pre-pandemic levels. “He’s basically being cautious,” Peter Cardillo, chief market economist at Spartan Capital, said,of Powell’s testimony. “The big thing is unemployment. He’s saying that jobs will come back, but it’s going to take a long time. And some people may not be able to get back to work, because some of those service-sector entities have been lost, and probably are lost forever,” he told MarketWatch. Stocks pared gains during Powell’s testimony after the Fed chief said, “I don’t see us wanting to run through the bond market like an elephant,” in reference to the central bank’s announcement on Monday that it is expanding the scope of its $750 billion emergency corporate debt loan facility to include individual corporate bonds, which will be purchased in an index fashion. Recap: Powell testifies to Senate on economic outlook Investors also remain nervous about signs of rising coronavirus cases in the U.S. “One of the greatest fears is a resurgence in the number of cases and what the means for the potential economy recovery,” Michael Arone, chief investment strategist at State Street Global Advisors, told MarketWatch. “That’s what we’ve seen in the past week or so,” he said, adding that news reports on Tuesday about steroid treatments potentially improving the health of COVID-19 patients has helped ease some of the fears around rising infections in certain U.S. states, while also supporting rising stock prices. The BBC reported on Tuesday that dexamethasone, a cheap and widely available steroid, is showing signs of success in low doses when prescribed to patients who are suffering serious symptoms from the illness derived from the coronavirus. The report cited a study from Oxford University, which included 2,000 hospital patients who were given the steroid and were compared with more than 4,000 who didn’t get the drug. The report indicated that for “patients on ventilators it cut death risk from 40% to 28%,” and for “patients needing oxygen it cut death risk from 25% to 20%.” Also on Tuesday Beijing ordered all schools to shutter in an effort to contain a new coronavirus outbreak, which already had spread to neighboring provinces, and said all people will need to be tested for the virus before they are allowed to leave the city, according to a Bloomberg News report. See: Coronavirus update: Global case tally tops 8 million and states reopen businesses even as infections and hospitalizations rise The Fed’s No. 2, Chairman Richard Clarida, will speak later Tuesday. Read: MarketWatch’s Need to Know column: A budding recovery could run into trouble after the election, warns Goldman SachsWhich stocks were in focus? European Union antitrust authorities launched two probes into whether Apple Inc. AAPL, +1.74% violated competition laws through its Apple Pay service and its App Store for software that runs on its mobile devices. Shares of the iPhone maker rose p 2.7%. Shares of iQIYI Inc. IQ, +0.84% settled 25.9% in very active trading Tuesday, after Reuters reported that Tencent Holdings Ltd. TCEHY, +1.98% was looking to become the largest shareholder in the China-based provider of video streaming services. Caesars Entertainment Corp. CZR, -4.36% disclosed Tuesday that revenue for the reopened regional properties, for the period they were operating in May and/or June through June 10 were flat to up 2% from a year ago. Shares advanced 3%. WW International Inc. shares WW, +3.96% gained 18.9% after the Weight Watchers parent company said digital subscriptions boosted numbers from a year ago because of the COVID-19 pandemic. The SPDR S&P Retail ETF XRT, +0.05% rose 2.7%, while the Van Eck Vectors Retail ETF RTH, +0.93% gained 2.4%, led be retailers Macy’s Inc. M, -0.95%, Nordstrom JWN, -2.18% and Kohl’s Corp. KSS, -1.64% after the better-than-expected retail report. Shares of Urban One Inc. UONE, -5.01% soared 315.8% Tuesday, and has now skyrocketed 8-fold in three days. Shares of Nvidia Corp. NVDA, -0.54% and Intel INTC, -1.03% were in focus after Morgan Stanley analyst Joseph Moore downgraded the chip makers to equal weight from overweight Tuesday. Charlotte’s Web Holdings Inc. CWBHF, +11.83% launched a C$67.5 million ($49.9 million) offering of shares through syndication on Tuesday, joining the many companies to issue new equity during the coronavirus pandemic. Cisco Systems Inc. CSCO, +0.15% shares rose 2.5% after the stock was upgraded to buy from neutral at BofA Securities, which also raised its stock price target to $67 from $55. Schlumberger Ltd. SLB, -1.21% shares gained 1.2% Tuesday after it pointed to plans to initiate “major changes” to its organizational structure, aimed at permanently removing over $1.5 billion in costs on an annual basis. Snap Inc. SNAP, -0.18% shares gained 0.7% after an analyst at UBS Global Research on Tuesday said shares are going to rise nearly 20% more, after touching a three-year high earlier this month. Pacific Gas & Electric PCG, +1.79% pleaded guilty Tuesday to killing 84 people in a 2018 wildfire in Northern California, agreeing to pay a maximum fine of $3.5 million, as well as the cost of the investigation. The steps were taken as the company readies to emerge from bankruptcy, with more debt than it started the process with. The company also looked to raise about $8.9 billion in the corporate bond market Tuesday, as part of its restructuring. Shares were up 0.8%. How did other assets fare? West Texas Intermediate U.S. crude US:CLN20 closed higher, adding $1.26 cents, or 3.4%, to settle at $38.38 a barrel on the New York Mercantile Exchange. The greenback traded up 0.3%, as gauged by the ICE U.S. Dollar index DXY, -0.58%. Check out: ‘The dollar is going to fall very, very sharply,’ warns prominent Yale economist Precious metals booked gains, with August gold US:GCM20 on Comex adding $9.30, or 0.5%, settling at $1,736.50 an ounce. The 10-year Treasury note yield TMUBMUSD10Y, 0.777% rose 5 basis points to 0.75%. Bond prices move in the opposite direction of yields. In global equities, the Stoxx Europe 600 index SXXP, +0.55% closed 2.9% higher, while the FTSE 100 index UKX, +0.64% gained 2.9%. In Asia markets, China’s benchmark CSI 300 index 000300, +2.04% closed 1.5% higher on Tuesday, while the Shanghai Composite Index SHCOMP, +1.67% picked up 1.4%, and the Japanese Nikkei NIK, -0.11% surged 4.9%. Hong Kong’s Hang Seng HSI, -0.30% climbed 2.4% and South Korea’s Kospi rose rallied 5.3%."}]}