{"article": [{"url": "https://www.marketwatch.com/story/gold-prices-see-subdued-action-as-metals-wrap-up-month-quarter-and-2020s-first-half-2020-06-30", "published": 1593528080.0, "headline": "Gold prices top $1,800 an ounce to score highest finish since 2011", "body": "Gold futures topped $1,800 an ounce on Tuesday to tally their highest finish since 2011, as uncertainty created by the coronavirus pandemic fed the metal’s appeal as a haven investment. “Gold is one of the only major asset classes to have a positive [year-to-date] return,” said Jeff Klearman, portfolio manager at GraniteShares, which offers the GraniteShares Gold Trust BAR, +1.88%. “The demand destruction wreaked upon the U.S. and global economies and then the resulting unprecedented monetary and fiscal stimulus response here and abroad is the primary driving force behind gold performance this year.” Rising numbers of new cases of COVID-19 in Florida, Texas, California and Arizona have raised concerns about the potential shape of the economic recovery from recession in the U.S. and the rest of the world. “Ongoing uncertainty on the effects of the coronavirus on U.S. and global economic recovery, increased stock market volatility, the upcoming U.S. presidential election, civil unrest in the U.S., global trade friction, along with the continuation of massive monetary and perhaps fiscal stimulus all provide strong support for gold prices,” Klearman told MarketWatch. There’s “very little reason to see gold prices move lower in the near future.” August gold US:GCQ20 rose $19.30, or 1.1%, to settle at $1,800.50 an ounce. That was the highest finish for a most-active contract since Sept. 2011, according to Dow Jones Market Data. In August 2011, gold futures settled at a record $1,891.90. Read:Gold posts largest quarterly gain in 4 years; talk of record prices by year end grows In the first half of this year, gold futures based on the most-active contracts rose just over 18%. For the quarter, the commodity gained nearly 13% and it climbed almost 3% in the month of June. Meanwhile, September silver US:SIU20 which is the most-active contract, rose 57 cents, or 0.6%, to $18.637 an ounce. For the first six months of the year, the white metal climbed 4%, but has surged nearly 32% over the quarter. It tacked on nearly 0.8% in June. Prices for the precious metals notched fresh intraday highs after New York Fed President John Williams said Tuesday that the economy seems to be on the mend, but remains damaged. “The economy is still far from healthy and a full recovery will likely take years to achieve,” Williams said. The market also listened to testimony from Federal Reserve Chairman Jerome Powell and Treasury Secretary Steven Mnuchin. Powell and Mnuchin were offering a House Financial Services Committee guidance on the risks to lifting restrictions on commercial activity against keeping the pandemic in check. Readthe live blog on Mnuchin, Powell testifying before the House panel In Tuesday dealings, the U.S. dollar was down 0.2% as gauged by the ICE U.S. Dollar Index DXY, -0.58%, a measure of the buck against a half-dozen other currencies. The index traded up by around 1% so far this year. A stronger dollar can weigh on precious metals priced in the currency, deflating the appeal of dollar-pegged commodities. Rounding out action on Comex on the day, October platinum PLV20, +3.99% rose 2.8% at $851.20 an ounce, ending down around 13% year to date, while September palladium US:PAU20 added 1.8% to $1,966.90 an ounce, up around 3% so far this year. The most-active September copper contract US:HGU20 added 1.3% to $2.7285 a pound, with prices up roughly 22% for the quarter but down around 2.4% so far this year. “Copper prices are significantly off their lows reached in depths of the coronavirus crisis,” said Klearman, pointing out that they traded down by nearly 30% year to date on March 23. Lockdowns in China and most major economies throughout the world, “reduced real and expected demand for copper,” he said. “Interestingly though, lockdowns also adversely affected copper production with a not insignificant number mines shutting down,” said Klearman. “This reduced copper production counterbalanced reduced demand and helped move prices significantly off their lows.” “With easing coronavirus restrictions throughout the world, both copper demand and supply should increase,” and infrastructure-related fiscal stimulus programs in the U.S., China and elsewhere “could help drive demand above levels pre-pandemic levels,” he said."}]}