{"article": [{"url": "https://www.marketwatch.com/story/what-does-trumps-payroll-tax-deferral-mean-for-your-paycheck-not-much-experts-say-2020-08-10", "published": 1597495280.0, "headline": "Hereâ\u0080\u0099s what Trumpâ\u0080\u0099s payroll-tax deferral could mean for your paycheck", "body": "Workers shouldnâ\u0080\u0099t be waiting for a windfall in their upcoming paychecks, tax-policy experts said Monday as they digested news of President Donald Trumpâ\u0080\u0099s executive order deferring payroll taxes. The order might not bump up take-home money all that much per paycheck â\u0080\u0094 and thatâ\u0080\u0099s assuming employers even pause the tax withholding from Sept. 1 to the end of the year, as the order instructs. With stimulus talks stalling on Capitol Hill, Trump signed the executive order Saturday along with several memorandums to address last monthâ\u0080\u0099s expiration of a supplemental $600 unemployment benefit,looming student-loan bills and a potential eviction crisis. Also see:â\u0080\u0098It should have been mandatory from the beginningâ\u0080\u0099: Ireland says people must wear masks in stores to stop COVID-19 â\u0080\u0094 but why did it take so long? When it came to payroll taxes, Trumpâ\u0080\u0099s order said this: â\u0080\u009cThis modest, targeted action will put money directly in the pockets of American workers and generate additional incentives for work and employment, right when the money is needed most.â\u0080\u009d The order defers the employeeâ\u0080\u0099s obligation to pay a 6.2% Social Security tax per paycheck. It applies to people who â\u0080\u009cgenerallyâ\u0080\u009d make less than $4,000 every two weeks, which works out to an annual salary of $104,000. The order instructs the Treasury Department to look into how the government can forgive the deferred tax payment. For right now, at least, observers say the tax obligation isnâ\u0080\u0099t being forgiven. See also:Social Security could be vulnerable under President Trumpâ\u0080\u0099s plan for payroll taxes Critics question the orderâ\u0080\u0099s effectiveness and legality. Sen. Ben Sasse, a Republican from Nebraska, called it â\u0080\u009cunconstitutional slop.â\u0080\u009d (Trump, in response, criticized Sasse on Twitter TWTR, -0.23% Â for going â\u0080\u009crogue.â\u0080\u009d) New York Times columnist Paul Krugman called it â\u0080\u009cthe hydroxychloroquine of economic policy,â\u0080\u009d referring to the Trump-touted antimalarial drug that a growing body of research suggests is not an effective COVID-19 treatment. “ â\u0080\u0098Itâ\u0080\u0099s not clear whether employers are going to pass the savings on to employees.â\u0080\u0099 ” â\u0080\u0094 Kyle Pomerleau, American Enterprise Institute â\u0080\u009cItâ\u0080\u0099s not clear whether employers are going to pass the savings on to employees,â\u0080\u009d Kyle Pomerleau, a resident fellow at the American Enterprise Institute, a right-leaning think tank, told MarketWatch. Any sort of payroll-tax relief also doesnâ\u0080\u0099t change things for the people who arenâ\u0080\u0099t on payrolls to begin with, Pomerleau added. â\u0080\u009cThereâ\u0080\u0099s a disconnect,â\u0080\u009d he said. â\u0080\u009cThe millions now who are unemployed are in need of greater assistance.â\u0080\u009d Steve Wamhoff, the director of federal tax policy at the left-leaning Institute of Taxation and Economic Policy, was also skeptical. â\u0080\u009cIf your goal is to stimulate the economy â\u0080\u0094 well, there are a lot of low-income people who youâ\u0080\u0099re not going to reach,â\u0080\u009d he said.What are payroll taxes, and what does the Trump order do? Payroll taxes consist of Social Security and Medicare taxes. Every pay period, an employee pays 6.2% of earnings toward Social Security and 1.45% for Medicare taxes. Workers pay the 6.2% Social Security tax on annual earnings up to $137,700. Meanwhile, the employer pays the same rate per paycheck, adding up to a combined 12.4% Social Security tax and 2.9% Medicare tax. In late March, the $2.2 trillion CARES Act said employers could defer paying their share of the Social Security tax from March 27, when Trump signed the CARES Act, to the end of the year. They can pay back one-half of the sum by the end of next year and the second half by the end of 2022. “ The order would put workersâ\u0080\u0099 obligation to pay the 6.2% Social Security tax on hold from Sept. 1 through the end of the year. ” The new executive order puts workersâ\u0080\u0099 6.2% obligation on hold. But what does that mean in practical terms? The median 2018 household income was $63,179, according to U.S. Census Bureau statistics. Suppose a hypothetical taxpayer made $64,000 before taxes. Slicing $64,000 into 26 paychecks paid on a biweekly basis comes out to roughly $2,461 per paycheck, pretax. The 6.2% Social Security tax on that paycheck would be approximately $152. With two paychecks paid each month from September through the end of the year, that comes to a deferred amount of $1,220 â\u0080\u0094 a hypothetical sum around the size of one stimulus check, albeit in smaller installments. But the money is still a â\u0080\u009clong-term obligation,â\u0080\u009d Pomerleau said. At best, itâ\u0080\u0099s an interest-free government loan, he said. Trump has floated the idea of payroll-tax relief before. Freezing payment of employee-side Social Security taxes from September to the end of the year would result in $139.5 billion not going to government coffers, at least for the time being, according to an analysis last month from the Institute of Taxation and Economic Policy. The analysis applied the cap in which taxpayers pay 6.2% on their wages under $137,700, not the executive orderâ\u0080\u0099s $104,000 cap. Payroll taxes brought in $914 billion for Social Security during fiscal year 2019, according to the Congressional Budget Office. There is precedent for altering payroll-tax rules: In the rebound from the Great Recession, the Obama administration trimmed workersâ\u0080\u0099 Social Security tax to 4.2% in 2011 and 2012.Businesses are still ultimately on the hook to pay the taxes Unless thereâ\u0080\u0099s a law changing the situation, the taxes are due at the beginning of next year, according to Mark Mazur, director of the left-leaning Urban-Brookings Tax Policy Center. â\u0080\u009cEmployers will be reluctant to pass along the deferred taxes to their employees, because they may have to figure out how to recoup those funds when they make the deferral payment,â\u0080\u009d Mazur said. There could be additional tax headaches for workers who leave their jobs or businesses that close before the end of the year, he added. “ â\u0080\u0098It is highly questionable whether firms would actually pass the money along to their workers, because it is the businesses that are on the hook for the taxes.â\u0080\u0099 ” â\u0080\u0094 Stephen Stanley, Amherst Pierpont Stephen Stanley, the chief economist at the broker-dealer Amherst Pierpont, also said businesses will have a close eye on the hassle factor. Because the taxes would be deferred, not waived, â\u0080\u009cit is highly questionable whether firms would actually pass the money along to their workers, because it is the businesses that are on the hook for the taxes,â\u0080\u009d he said. If businesses pass along the money and then have to make sure the feds get it back during tax season, â\u0080\u009cthen it would be a messy affair to somehow go about clawing that money back from their workers,â\u0080\u009d Stanley said. Besides, he added, â\u0080\u009cif businesses did pass the tax holiday funding along, it is doubtful that most households would spend the money, figuring that they would have to pay the money back three months later.â\u0080\u009d"}]}