{"article": [{"url": "https://www.marketwatch.com/story/new-york-schools-get-green-light-for-in-person-learningraising-myriad-questions-2020-08-07", "published": 1596824300.0, "headline": "New York schools get green light for in-person learningâ\u0080\u0094raising myriad questions", "body": "New York state schools have the green light to reopen for in-person learning in September with social distancing and health screenings, Gov. Andrew Cuomo announced Fridayâ\u0080\u0094a decision that immediately raised more questions than it answered. â\u0080\u009cIf any state can do this, we can do this,â\u0080\u009d said Cuomo during a conference call with reporters.Â The decision comes as school districts across the U.S. grapple with competing pressures to bring students back in September without exacerbating the spread of the coronavirus. Cuomoâ\u0080\u0099s decision paves the way for New York Cityâ\u0080\u0094the nationâ\u0080\u0099s biggest school district with more than 1.1 million studentsâ\u0080\u0094to return to the classroom, even as school systems in Los Angeles, Chicago and Dallas plan to remain remote this fall. Itâ\u0080\u0099s on track to be the only one of the nationâ\u0080\u0099s top 10 biggest school districts to reopen in-person learning this fall.Â Despite Cuomoâ\u0080\u0099s green light for the state, nearly all of the details will be left up to New Yorkâ\u0080\u0099s 750 school districts, which have only three weeks to hone plans on exactly how students will return, and how schools will monitor the health and safety of pupils and teachers. Coronavirus update: Global case tally climbs above 19 million; U.S. death toll moves above 160,000 after 11 straight days with 1,000-plus fatalitiesÂ So far, districts are proposing everything from a mix of in-person and remote instruction, such as the hybrid model proposed in New York City, to sending children home before lunch to avoid a risky indoor-dining environment, Cuomo said on a conference call with reporters.Â â\u0080\u009cI canâ\u0080\u0099t fashion a plan that would work in every school district; they are just too different,â\u0080\u009d he said.Â Theoretically, individual school districts could still opt to delay the start of in-person learning or go completely remote if they choose, particularly if they face enough pressure from parents and teachers.Â â\u0080\u009cItâ\u0080\u0099s up to them,â\u0080\u009d Cuomo said. â\u0080\u009cIn-person, hybrid, outdoor education, remote education, blended, half day, quarter day, third day â\u0080\u0094 that is all up to their discretion.â\u0080\u009d The state, through the health department, has set only a few hard rules, including a maximum positivity threshold of 5% â\u0080\u0094 meaning the proportion of testing coming back positive â\u0080\u0094 which would automatically trigger a regionâ\u0080\u0099s school buildings to close again. New York City has set a more conservative positivity threshold of 3% for the five boroughs. Schools must conduct health screenings, which at a minimum means daily temperature checks, said Jim Malatras, the president of Empire State College and an adviser to Mr. Cuomo, at the governorâ\u0080\u0099s briefing.Â Districts must also devise a system for testing symptomatic students and staff, he added.Â Also on MarketWatch: Calculating Americaâ\u0080\u0099s eviction crisis: Up to 40 million people are at risk of being kicked out of their homes COVID testing is a major concern among parents, from whom the governor said heâ\u0080\u0099s received a â\u0080\u009cdelugeâ\u0080\u009d of worried phone calls. To address that, he gave districts until the end of next week to finalize and post plans about how testing will be carried out, when a child must be tested and where it will be done. Next week, districts must also publicly post specific plans for tracing outbreaks and explain their remote learning option, he added.Â â\u0080\u009cWeâ\u0080\u0099ve learned from the experiences weâ\u0080\u0099ve had during COVID that remote learning can be quite unequal, given the demographics and given the circumstances,â\u0080\u009d Cuomo said, adding that he wants districts to draw attention to these three areas of concern so parents arenâ\u0080\u0099t forced to go â\u0080\u009cwadingâ\u0080\u009d through lengthy reopening plans.Â The governor also gave districts until Aug. 21 to conduct three town halls with parents â\u0080\u0094 five for big school districts like New York City â\u0080\u0094 and one with teachers. The next few weeks promise parents, teachers and administrators a whirlwind of information, and certainly some disagreement, over reopening right on the cusp of the school year.Â Parents and teachers are feeling particularly unsure in New York City, once the national epicenter of the pandemic and where many lost colleagues or loved ones during the peak of the crisis.Â â\u0080\u009cItâ\u0080\u0099s a cloud that hangs over our school,â\u0080\u009d said Paul Kehoe, who teaches humanities and science at M.S. 250 West Side Collaborative Middle School on Manhattanâ\u0080\u0099s West End Avenue. Students at the school have lost family members, and a fellow teacher was suspected to have died from COVID-19.Â Kehoe, 39, disagrees with New York Cityâ\u0080\u0099s hybrid-learning plan. He would prefer to see schools continue an improved version of all-remote learning as the safest and least disruptive option for students. The logistics of students coming to school on a rotating schedule, potentially spending the other days at one of the cityâ\u0080\u0099s proposed learning centers, all the while taking a bus or public transportation to and from school, creates numerous opportunities for exposure and spread.Â â\u0080\u009cNo matter how much they pretend to have some barriers around, itâ\u0080\u0099s just artifice. Itâ\u0080\u0099s just placating peopleâ\u0080\u0099s concerns,â\u0080\u009d he said.Â Michael Mulgrew, president of the United Federation of Teachers, which represents most public school teachers in the five boroughs, on Friday applauded the stateâ\u0080\u0099s effort to ensure teachers and parents were confident in reopening plans.Â Though, he said, â\u0080\u009cin New York City, that is still an open question.â\u0080\u009d Also see: NYCâ\u0080\u0099s urban oases reopen, providing a much-needed escape for shut-in residents New York City asked parents to decide whether they would opt for all-remote learning by Friday, even though many of the schools have yet to communicate specific details about the school year to parents. Mayor Bill de Blasio said he would offer more districtwide information on Monday and that school- and child-specific information would arrive â\u0080\u009cin the course of the next couple of weeks.â\u0080\u009d Meanwhile, the state health department is still missing reopening plans from 127 school districts, and has already deemed at least 50 plans incomplete or insufficient.Â Without approved plans, however, Cuomo said: â\u0080\u009cSchool districts cannot open.â\u0080\u009d"}]}