{"article": [{"url": "https://www.marketwatch.com/story/the-stock-market-hasnt-made-a-move-this-big-since-1933-11597337248", "published": 1597359980.0, "headline": "The stock market hasn't seen a 100-day gain this strong since 1933", "body": "Agence France-Presse/Getty Images Thursday marked the 100th trading day since the stock market's pandemic panic low on March 23 - and by one measure the subsequent rebound is the strongest in nearly 90 years. The S&P 500 SPX, +0.87% ended slightly lower Thursday, leaving it 50.1% above its March 23 close of 2,237.40. That notched the U.S. stock-market benchmark's biggest 100-trading-day rise since the period ending Aug. 18, 1933, according to Dow Jones Market Data. It's also not far off revisiting its all-time closing high of 3,386.15 set on Feb. 19 - a level it briefly traded above in Wednesday's session and again on Thursday before pulling back in late trade. Read: Why the S&P 500 is knocking on the door of its first record close in 6 months Bespoke Investment Group on Wednesday illustrated the historical scale of the rebound in the tweet below: iframe.twitter-tweet { width: 100% !important; } Is that auspicious? After all, the world was in the throes of the Great Depression in the 1930s - a famously ugly period for equities (though perhaps not as awful as popularly remembered). Regardless, both the current rally and the 1933 rebound follow historically steep selloffs that accompanied global cataclysms. The present rebound comes in the midst of global public health crisis caused by the deadly COVID-19 pandemic, which has infected more than 20 million people world wide and resulted in more than 750,000 deaths, including more than 160,000 U.S. fatalities, according to data compiled by Johns Hopkins University. The S&P 500 logged a record close of 3,386.15 on Feb. 19, then subsequently plunged by 33.9% to its March 23 close at 2,237.40, tumbling as lockdowns in response to the pandemic put the U.S. and much of the global economy on ice. During that stretch, the S&P 500's drop from a record into a bear market - defined as a fall of 20% from a recent peak - was the fastest in history. The Dow Jones Industrial Average DJIA, +0.56%, which had peaked on Feb. 12, achieved the same historic feat on its way to a bear market. It also ended more than 50% above its March 23 low of 18,591.93, joining the S&P 500 in putting the strongest 100-trading-day gain since August 1933. The tech-heavy Nasdaq Composite COMP, +1.39%, meanwhile, is up more than 60% from its March 23 low of 6,860.67, for its strongest 100-trading-day advance since the period ending March 27, 2000, which encompasses the peak of the tech bubble. In fact, according to Dow Jones Market Data, the best 100 trading days on record was the 100 days ending March 10, 2000 when the index gained 87.74%."}]}