{"article": [{"url": "https://www.marketwatch.com/story/stein-mart-files-for-bankruptcy-as-analysts-forecast-pressure-on-usually-robust-off-price-retail-2020-08-12", "published": 1597331960.0, "headline": "Stein Mart files for bankruptcy as analysts forecast pressure on usually-robust off-price retail", "body": "Off-price retailer Stein Mart Inc. announced it filed for bankruptcy on Tuesday amid mounting off-price pressure, a retail category that had been growing before COVID-19. To be sure, Stein Mart US:SMRT , like many other retailers that have filed chapter 11, faced challenges even before the coronavirus pandemic. Fiscal 2019 losses totaled 22 cents per share after a loss of 13 cents per share the year prior. In the most recent quarter, with the coronavirus pandemic raging, losses reached $1.38 per share on revenue of $138.2 million, down from $319.4 million the year before. Neil Saunders, managing director at GlobalData Retail, notes the “relatively weak attractiveness of the Stein Mart brand,” with stores in undesirable locations, low brand recognition, and an online business that was developing, but was too far in the early stages to help when lockdowns went into effect. “For a company that, at the start of this year, was in the process of selling itself to a private investment firm, the bankruptcy is an abrupt change in fortunes that shows the immense damage the pandemic has inflicted on retail,” Saunders wrote. See:Ann Taylor parent joins other retailers that have recently filed for bankruptcy. Here are a few things they have in common. That damage has extended to the off-price category as a whole. Off-price includes names like TJ Maxx parent TJX Cos. TJX, -0.18% , Ross Stores Inc. ROST, +0.56% and Burlington Stores Inc. BURL, +0.22% “The failure of Stein Mart is not only the latest in a long line of retail bankruptcies, it also underlines that even traditionally robust segments like off-price are not immune from pandemic-induced disruption,” Saunders said. Wells Fargo data from last month shows that 85% of 1,000 consumer respondents have become more concerned about heading back to stores. Recent surges in COVID-19 cases are at the heart of that fear. And 40% said they would need more time before going back to a store that sells clothes and shoes. E-commerce sales have accelerated. However, the off-price sector, with its “treasure hunt”-style store experience, doesn’t rely a great deal on e-commerce. In fact, Burlington announced in March that it was shutting down its e-commerce site entirely. Watch:Work from home is here to stay. Here’s what it means for retail “Off-price, which has historically been an outperformer, will be dragged lower as companies such as TJX, Ross Stores. and Burlington Stores share in the mounting pain of mandatory retail store closures and lower traffic,” wrote Moody’s analysts in a report published last week. Moody’s forecasts that operating income in this segment will plunge 120% to 130% in 2020, versus a previous forecast for a 10%-to-15% decline. “We do not expect profitability to return to 2019 levels until 2022 at the earliest,” Moody’s said. Off-price will have some advantage in its focus on value. “Cowen believes that department stores and mall-based retailers will likely lose share over the next few years due to a combination of store closures and a greater shift in consumer preference toward online and value-oriented concepts,” analysts wrote in a recent report. Moreover, off-price is in a position to capitalize on unsold goods that are widespread across retail. “Our checks with consultants suggest that off-price is best positioned post COVID-19 to capitalize on what will be a plethora of goods and brands available across all pricing levels with payment terms averaging 120 days out,” Cowen said. Stein Mart stock took a 37.9% nosedive on Wednesday after the bankruptcy filing. Shares have fallen 77.6% over the year to date while the S&P 500 index SPX, +0.87% is up 4.2%."}]}