{"article": [{"url": "https://www.marketwatch.com/story/european-stocks-trade-lower-amid-earnings-deluge-on-worries-about-slow-recovery-and-second-coronavirus-wave-11596094747", "published": 1596087080.0, "headline": "European stocks and Dow futures trade lower amid earnings deluge and on worries about slow recovery", "body": "Shell Petroleum refinery on Pulau Bukom off Singapore on July 16, 2020. roslan rahman/Agence France-Presse/Getty Images European stocks traded lower on Thursday on the busiest day of second-quarter earnings season, with concerns mounting about a sluggish economic recovery and a possible second wave of the coronavirus pandemic. The Stoxx Europe 600 SXXP, +0.55% dropped 1.4%. U.S. stock futures YM00, +0.82% dropped sharply as European stock markets opened. The German DAX DAX, +0.06% skidded 2.5% and the FTSE 100 UKX, +0.64% dropped 1.7%. Traders were looking at the U.S. economy, where Federal Reserve Chairman Jerome Powell again said the central bank was not even “thinking about thinking about” lifting interest rates, as second-quarter gross domestic product numbers are expected to reveal a 35% annualized drop when they are released at 8:30 a.m. Eastern. Germany reported its worst decline in GDP since 1970, with the eurozone’s top economy falling 10.1% quarter-on-quarter. U.K. Prime Minister Boris Johnson fears a second wave of coronavirus in two weeks, the Daily Mail reported, citing a Downing Street source. Globally, total coronavirus cases passed the 17 million mark. Earnings season continues on both sides of the Atlantic. Earnings per share of Stoxx Europe 600 companies have dropped 42% in the second quarter, according to FactSet Research data on the 40% of results so far. Anheuser-Busch InBev ABI, +0.33% BUD, -0.21% shares surged 6%, as the Budweiser brewer’s profit for the second quarter came in below estimates after a write-down of its African business. But the revenue decline wasn’t as steep as estimated due to its Latin American and Asian businesses. Lloyds Banking Group LLOY, -0.52% slumped 8%, after it recorded an unexpected pretax loss for the first half of 2020 on booking a large impairment charge. Royal Dutch Shell RDSA, +2.08% took a $16.8 billion write-down and said that due to the lag in contracts, the impact of low oil prices is expected to become more significant in the third quarter, and rival Total FP, +1.54% took $8.1 billion of impairments. AstraZeneca AZN, +0.63% rose 2.3%, as the U.K. pharmaceutical giant reported its second-quarter net profit surged and said late-stage trials for the coronavirus vaccine it is developing with University of Oxford researchers are under way. A slate of U.S. earnings also is coming Thursday, with key technology companies Alphabet, Amazon.com, Apple and Facebook all reporting after the close of trade."}]}