{"article": [{"url": "https://www.marketwatch.com/story/mnuchin-says-white-house-democrats-very-far-apart-on-coronavirus-aid-deal-11596035556", "published": 1596041360.0, "headline": "Capitol Hill talks on next  COVID-19 financial aid bill stuck in neutral Wednesday, as lawmakers face Friday deadline", "body": "Mark Meadows, White House chief of staff, left, and Steven Mnuchin, U.S. Treasury secretary, wear protective masks while speaking to members of the media after a meeting with Senate Majority Leader Mitch McConnell, a Republican from Kentucky, not pictured, at the U.S. Capitol in Washington, D.C., U.S., on Thursday, July 23, 2020. Photographer: Al Drago/Bloomberg Capitol Hill talks over the next COVID-19 financial aid bill looked to be stuck in neutral Wednesday, as lawmakers face a self-imposed target day of Friday to get something done but even a narrow extension of some policies is contested. Treasury Secretary Steven Mnuchin started the ball rolling Wednesday morning, saying the focus should turn to a short-term extension of the federal add-on to state unemployment payments to the jobless and the eviction moratorium put in place in March. “As of now, we’re very far apart,” Mnuchin told reporters at the White House, standing next to President Donald Trump before Trump left on a trip to Texas. Because the sides were so far apart, Mnuchin said the focus should turn to a “short-term extension of UI and the evictions,” referring to the extra $600 federal supplement to state jobless benefits the unemployed qualified for up until this week and a moratorium on evictions from buildings with federally-backed loans that expired last week. “We’re going to work on the evictions, so that people don’t get evicted. We’ll work on the payments to the people and the rest of it, we’re so far apart, we don’t care, we really don’t care,” Trump said. The remarks got a chilly reception on Capitol Hill, where Democrats have repeatedly said they do not want to haggle over a “piecemeal” approach after passing their own massive $3.4 trillion bill in May. Asked what she though of the idea as she left a press conference to highlight Democratic efforts to bolster child care, House Speaker Nancy Pelosi, said, “Nothing. Not even ‘not much’ – nothing.” The federal supplement of an extra $600 a week on top of state jobless benefit payments has now expired and labor experts say even if the supplement were revived it would still take several weeks for antiquated state processing systems to reinstate it. The eviction moratorium for renters in buildings with federally-backed mortgages was to expire 120 days after the March 27 enactment of the CARES Act, which was July 25. But under that law, landlords must also provide a 30-day notice to tenants before evicting them, which the Congressional Research Service would delay those evictions until Aug. 24. “We’re looking at deadline obviously of this Friday. The president is very focused on evictions and unemployment. And if we can’t reach an agreement by then, the president wants to look at giving us more time to negotiate,” Mnuchin said. Mnuchin and White House Chief of Staff Mark Meadows met with Senate Republicans on Capitol Hill, but afterwards senators said there was no consensus on the path forward. “The main theme in there was the big gulf between us and the Dems and then, what could we agree on ourselves and distill down, the unemployment,” Sen. Mike Braun, an Indiana Republican, told reporters. “Just ideas, things that could occur.” House Majority Leader Steny Hoyer, a Maryland Democrat, said Wednesday he had told House members to be prepared to stay past the July 31 scheduled recess date for the House if no new bill dealing with the epidemic had been passed. In a related development, the bipartisan Committee for a Responsible Federal Budget said it estimated the Senate Republicans’ package of coronavirus bills unveiled Monday would cost about $1.1 trillion over 10 years. That is less than a third of the cost of the Democratic House bill."}]}