{"article": [{"url": "https://www.marketwatch.com/story/microsoft-dumps-retail-stores-meant-to-rival-apple-is-surface-line-of-gadgets-next-2020-06-26", "published": 1593251540.0, "headline": "Microsoft dumps retail stores meant to rival Apple - Is Surface line of gadgets next?", "body": "Microsoft Corp.'s permanent closure of its retail stores during the global coronavirus pandemic is not surprising, given the negligible amount of revenue the stores contributed to the company, but it may be a sign that the Surface hardware business could eventually be on the chopping block. Microsoft MSFT, +2.48%  announced Friday it will close all its physical retail stores in the U.S., and take a $450 million charge as a result. The company said its sales growth has moved online, even more so during the current pandemic. \"Our hardware and software sales have continued to shift online as our Microsoft product portfolio has evolved to digital products including Microsoft 365, gaming and entertainment,\" wrote David Porter, the corporate vice president for Microsoft Stores, in a blog post. \"We have seen strong growth on Microsoft.com and our digital Xbox and Windows storefronts reaching up to 1.2 billion monthly customers in 190 markets.\" Microsoft delved into retail in 2009, ignoring a failed effort during the dot-com boom, with a store in Scottsdale, Ariz., timed in conjunction with the launch of its Window 7 operating system. It eventually opened a new store in Silicon Valley in 2011, strongly influenced by Apple Inc.'s AAPL, +1.74%  design aesthetic and approach. One consumer product it was pitching at the time was the ill-fated Windows Phone. From 2011: Microsoft store is a poor man's Apple Soon, Microsoft had another line of products to pitch at its stores. In 2012 former Chief Executive Steve Ballmer introduced the Surface tablet that functioned as a laptop and it has evolved into a line of products, including a forthcoming dual-screen Surface Duo that will include a mobile phone and fits in your pocket. Since then, there have been many changes at Microsoft, notably at the top, with the appointment of Satya Nadella at the company's chief executive in 2014. Nadella's focus on cloud computing has rejuvenated the once lumbering software giant which now has a mind-numbing market cap of approximately $1.5 trillion. Under Nadella, many businesses have flourished with high growth rates, but not Surface. As Microsoft heads to the end of its fiscal year, Surface has shown year-over-year sales growth of -4%, 6% and 1% in the first three quarters of the year. In the first fiscal quarter, it was the only one of 11 businesses that Microsoft broke out that declined year-over-year. Losing retail stores may not be much of a drag on Surface, however. Dan Ives, a Wedbush Securities analyst, said that the amount of revenue from retail stores is probably about 2% of the company's total consumer sales. He believes the Surface line will continue going forward, but the lack of a retail presence could affect future sales. \"No retail stores is a gut punch for future laptop sales given its prominence within stores,\" Ives told MarketWatch in an email. Maribel Lopez, principal analyst at Lopez Research, said she believes the Surface will continue to live on, \"not because Microsoft plans to crush the competition, but more because it keeps the developers fresh on what's needed for the various markets.\" \"Microsoft has had more success in devices than any ODMs [original device manufacturers] thought possible,\" Lopez said. \"Its market presence forces ODMs to innovate and forces Microsoft to understand the balance of requirements versus innovation.\" She added that the industry watches Surface and its developments quite closely. Surface is likely to live on for a while. Microsoft will still continue to sell Surface with its retail partners such as Best Buy Co. BBY, +1.45%  and Walmart Inc., WMT, +1.00%  with over 7,000 locations in the U.S. alone, for customers who want to experience all its products in person, including Surface. The company also said it plans to \"re-imagine\" some of the company's spaces, such as in London, New York, Sydney and Redmond, Washington as centers for all of its customers. \"We will continue to co-locate engineering, sales, support, envisioning centers, executive briefing centers, and retail spaces for maximum impact for our customers and our company,\" Microsoft's Porter said in his blog post. It will also continue to invest in its virtual store fronts and video sales and workshops. Microsoft declined to discuss the Surface line's future in detail on Friday. If Surface is not doing well enough to support retail stores, though, why is it worth other expensive efforts as it drags down margins and growth from other areas? Even if Microsoft does not give up on Surface soon, expect it to spend much less on developing and supporting its own gadgets in coming years."}]}