{"article": [{"url": "https://www.marketwatch.com/story/what-did-people-do-with-their-1-200-stimulus-checks-finally-an-answer-11597681021", "published": 1597924760.0, "headline": "What did people do with their $1,200 stimulus checks? Finally an answer", "body": "Lower-income Americans were more likely to spend their stimulus checks, but more Americans may have also spent their stimulus checks if more businesses were open when the checks went out starting in April, research found. (Photo: Getty.) What did people do with their stimulus checks? People who spent most of their stimulus checks account for just 15% of U.S. households, compared to a third of Americans who saved their stimulus checks and more than half used it to pay down debt. That’s according to research conducted by three economists circulated by the National Bureau of Economic Research this week. Americans first began receiving stimulus checks amounting to $1,200 for individuals who earn up to $75,000 in mid-April as part of the $2.2 trillion CARES Act. Married couples earning under $150,000 received $2,400. Democrats and Republicans are currently at an impasse over a second economic stimulus program. In June, nearly one-third of people said they used their stimulus checks to pay bills, according to a survey released by YouGov, a sign that Americans were and are struggling to make ends meet. Those bills — including for cellphones, utilities, cable TV and rent — are the No. 1 priority, even more than purchasing essentials and “relief spending” on apparel, televisions, video games, sporting goods and toys at Walmart WMT, Costco COST and Target TGT. “It’s alarming to look at how many Americans used these funds to keep a roof over their head and pay for necessities considering the federal government has not provided clarity about another round of stimulus payments being provided in the near future,” according to the report by YouGov. Don’t miss: Consumers hold the key to an economic recovery and right now they’re very anxious The latest survey also suggests people are struggling. Americans who spent their stimulus checks primarily were Hispanic, lower-income and lived in larger households compared to Americans who used their checks to pay down debt or saved the majority of it, according to the survey of 11,000 individuals in Nielsen’s NLSN, -4.77% Homescan panel. Nielsen’s Homescan panel, in addition to tracking Americans’ purchasing behavior, directly gauged how Americans used their stimulus checks in the July 2020 survey. One of the major goals of the stimulus checks was to help spur economic activity via consumer spending, one of the driving forces of the U.S. economy. The majority of Americans saving their stimulus checks or using it to pay off debt have an annual household income between $75,000 and $99,999, the U.S. Census Bureau reported earlier this summer in its separate experimental Household Pulse Survey. By contrast, nearly 88% of adults in households with incomes of $25,000 or less planned to use their stimulus payments to meet expenses, the survey of over one million Americans found."}]}