{"article": [{"url": "https://www.marketwatch.com/story/bank-stocks-may-rally-powerfully-once-investors-realize-their-concerns-are-overblown-2020-06-24", "published": 1593067940.0, "headline": "Bank stocks may 'rally powerfully' once investors realize their concerns are overblown", "body": "Bank stocks have taken a beating, and investors have plenty to fear, including the Federal Reserve's stress tests, whose results will be released June 25. Investors expect low interest rates to hamper profits, and a decimated economy to increase loan losses. There's a lot to take in, especially as the reopening of the U.S. economy is marked by rising coronavirus infections in half of the states. But some concerns are overblown, and banks' own change in behavior following the 2008 crisis is expected by many analysts to serve them and their shareholders well. Doug Peta, chief U.S. investment strategist at BCA Research, said the five bank stocks listed below are ideally priced for long-term investors. BCA is an independent research firm based in Montreal and founded in 1949. It has more than 60 analysts and doesn't manage money or run brokerage services. Clients include institutional money managers of all types. Here's how the KBW Bank Index BKX, -0.33%  has performed this year: FactSet The index comprises 24 stocks of universal and large regional U.S. banks. You can see it's above its low when the U.S. stock market bottomed in March. It also took a dive two weeks ago, after the Federal Reserve projected the federal funds rate would remain near zero through 2022. If you look at the \"big four\" U.S. banks - J.P. Morgan Chase & Co. JPM, -0.57%, Bank of America Corp. BAC, +0.47%, Citigroup Inc. C, +0.47%  and Wells Fargo and Co. WFC, - and add U.S. Bancorp USB, -0.83%  of Minneapolis, the stocks are trading on average for 1.2 times tangible book value, down from 1.6 a year ago: Bank Ticker Price/ tangible book value Price/ tangible book value - 1 year ago J.P. Morgan Chase & Co. JPM, -0.57%  1.61 1.92 Bank of America Corp. BAC, +0.47%  1.24 1.55 Citigroup Inc. C, +0.47%  0.73 0.64 Wells Fargo & Co. WFC,  0.83 1.43 U.S. Bancorp USB, -0.83%  1.74 2.52 Averages 1.23 1.61 Source: FactSet These are the largest five U.S. banks by total assets, excluding the investment-banking giants Goldman Sachs Group Inc. GS, -0.21% and Morgan Stanley MS, -0.34%. The big four have diversified businesses, including lending, underwriting, money management and brokerage services. Peta described U.S. Bancorp as a \"pure-play commercial bank.\" In an interview, Peta said current valuations for the group are \"awfully low, based on history,\" and that buying the stocks at similar valuations \"has proven to be a really good entry point.\"Moving parts Let's look at three areas scaring investors away from big bank stocks: 1. Stress tests; 2. Loan quality; and 3. Interest rates.Stress tests and dividends The Federal Reserve concludes its annual two-part stress-test process June 25 at 4:30 ET. The regulator will announce which of the 34 large U.S. banks and U.S. subsidiaries of foreign banks have passed the first part, the Dodd-Frank Act Stress Tests (DFAST). Some of the economic fallout from COVID-19 has been considerably worse than the Fed's \"severely adverse scenario\" that was released in February. So the regulator is augmenting DFAST, but hasn't provided much detail on how. One change, described by Federal Reserve Vice Chair for Supervision Randal K. Quarles on June 19, is a \"sensitivity analysis\" that will consider banks' capital levels under \"a rapid V-shaped recovery,\" as well as a \"slower, more U-shaped recovery,\" through which the economy regains only a small portion of what it lost by the end of 2020, and a \"W-shaped double-dip recession,\" through a second wave of coronavirus containment. The second part of each bank's stress test is the Comprehensive Capital Analysis and Review (CCAR). We'll find out June 25 which of the bank's capital plans were accepted by the Fed, but we won't get all the details until the banks make their own announcements June 29. Even with the group stress-tested under that last dire scenario, Janney Montgomery Scott Director of Research Chris Marinac wrote in a report on June 22: \"While share buybacks may be postponed longer, we feel most banks' common dividends are secure.\" Approval of the Fed to maintain their dividends would do a lot to improve investors' confidence in the stocks. Peta said: \"My base case is, no, don't expect mandated dividend cuts. There is nothing in what [Federal Reserve] Chairman Powell has said publicly that is leaning in that direction.\" On the other hand, KBW managing director Brian Kleinhanzl wrote in a note on June 19 that \"Quarles' comments about dividend payouts were opaque in the Q&A and dividend cuts can still not be ruled out.\" Even if dividends are cut or suspended, Peta sees an opportunity to double-down. \"If you are a shareholder of a bank trading below book [value], you should vastly prefer a dividend cut to a secondary offering that will dilute your holdings. I really think a one- or two-quarter interruption of the dividend or reduction would be a buying opportunity,\" he said.Loan losses and reserves The big banks have been careful with their loan portfolios in the years following the 2008 credit crisis. Check out these 10-year compounded annual growth rates for the five banks' total loans from the end of 2009 through the end of 2019: Bank Compounded annual growth for total loans and leases - end of 2009 through 2019 J.P. Morgan Chase & Co. 4.3% Bank of America Corp. 0.7% Citigroup Inc. 1.5% Wells Fargo & Co. 1.7% U.S. Bancorp 4.2% Source: FactSet Over recent years, banks have shied away from leveraged loans (that is, highly leveraged lending that was greatly curtailed under the 2010 Dodd-Frank banking reform legislation), with the slack, especially for junior-lien loans, taken up mainly by private investment funds, according to Peta. \"Small- and mid-cap borrowers had been effectively orphaned by commercial banks,\" he said, adding that after private investment funds raised capital in 2010 and 2011, \"there was competition among direct lending funds [and] a degradation of standards. So borrowers were calling the shots,\" he said. These comments also apply to \"excesses in the bond market,\" driven by \"a frenzied competition among fixed-income investors to find yield,\" regardless of risk, Peta added. So the banks were left out of a lot of the riskier lending activity during the long economic expansion that ended in the first quarter. This makes the pandemic crisis, as bad as it is, completely different from the 2008 crisis. Here's an FDIC article and a paper by Thomas L. Hogan, a senior fellow at the American Institute for Economic Research and a former fellow at Rice University's Baker Institute for Public Policy, explaining the evolution of the U.S. loan market. Credit quality was very strong through the first quarter, although banks began to set aside billions in reserves for expected loan losses in the second quarter and subsequent quarters. Many sell-side analysts have written that they expect banks' second-quarter provisions for loan-loss reserves to be similar in size to the first-quarter provisions. The provision is the amount a bank adds to loan-loss reserves during a quarter in anticipation of loan losses. Yes, it is the movement of money from one bucket to another. But it directly reduces net income and lowers tier 1 common equity ratios, which are the \"strictest\" of the capital ratios that regulators scrutinize. This table shows massive increases in provisions for loan losses and declines in net income in the first quarter from a year earlier: Bank Provision for loan loss reserves - Q1, 2020 ($mil) Provision for loan loss reserves - Q1, 2019 ($mil) Net income - Q1, 2020 ($mil) Net income - Q1, 2019 ($mil) J.P. Morgan Chase & Co. $8,285 $1,495 $2,852 $9,127 Bank of America Corp. $4,761 $1,013 $4,010 $7,311 Citigroup Inc. $6,446 $1,968 $2,519 $4,653 Wells Fargo & Co. $4,005 $845 $653 $5,860 U.S. Bancorp $993 $377 $1,166 $1,692 Source: FactSet That was a painful quarter, but the five banks were still profitable. With the reopening of the U.S. economy, the boost to loan quality from the great increase in unemployment benefits included in the CARES Act, mortgage loan forbearances and various government lending programs for businesses, it is quite possible that second-quarter provisions will be lower than expected, and even that banks begin making much smaller provisions in succeeding quarters. \"This leaves room for bank stocks to rally powerfully once you close the gap between expectations of what will be written down on banks' books and a much more benign outlook,\" Peta said.Yield curve and profitability On June 11, the KBW Bank Index dropped after bank stocks had plunged out of fear that an extended period of low interest rates would mean narrower net interest margins for banks, leading to a drop in earnings. The idea is that a narrowing of the rate curve - the spread between short-term and long-term interest rates on U.S. Treasury securities - automatically means a narrow spread between what banks earn on loans and investments and what they pay for funds. Odeon Capital Group analyst Richard Bove refuted that assertion. Peta agrees with Bove, because \"under the new duration-matched regime, net interest margin has become insensitive to the shape of the curve.\" Matching funding and asset durations isn't new. Banks learned painful lessons during the savings and loan crisis of the 1980s, when the Federal Reserve raised short-term rates to double digits to fight inflation, leaving some lenders with single-digit-rate loan portfolios losing money every day. This is why banks tend to sell most of the fixed-rate residential mortgage loans they make. Peta shared two charts illustrating that there is no longer a link between banks' net interest margins and the yield curve for U.S. Treasury securities: BCA Research Inc. BCA Research Inc."}]}