{"article": [{"url": "https://www.marketwatch.com/story/uk-airline-easyjet-to-close-three-of-its-airport-hubs-as-coronavirus-wreaks-further-havoc-2020-06-30", "published": 1593569060.0, "headline": "U.K. airline easyJet to close three of its airport hubs as coronavirus wreaks further havoc", "body": "U.K.-based budget airline EZJ, -4.22% said on Tuesday it is considering shutting three of its airport hubs because of the steep drop in travel demand caused by coronavirus. The carrier said in a statement it could close bases at London Stansted, London Southend and Newcastle airports as part of wider cost cutting measures announced in May because of coronavirus. It said the airports would remain part of its route network meaning flights would still land there but it would not retain offices and staff. EasyJet and airlines around the world have been hit hard by coronavirus cutting jobs and forecasting a slow recovery. Many countries have closed their borders and banned nonessential travel, with European Union citizens still barred from traveling to the U.S.. EasyJet said it expects it will take until 2023 for demand to return to 2019 levels, a similar expectation to Ryanair RYA, -2.60% , Europe’s largest low-cost airline. Figures from the U.K.’s Civil Aviation Authority (CAA) show passenger numbers for over 60 U.K. airports were down -98% in May from a year earlier. Read:EasyJet to resume flights on June 15 “Unfortunately the lower demand environment means we need fewer aircraft and have less opportunity for work for our people,” said easyJet chief executive Johan Lundgren. EasyJet previously said it could cut almost a third of its staff in response to the pandemic. Pilots union Balpa said it was shocked at the airline’s plans and called the measures an “excessive overreaction.” Read:EasyJet plans to cut staff numbers by 30% Brian Strutton, Balpa General Secretary, said: “EasyJet paid £174m out to shareholders, got agreements to furlough staff to protect cash, got £600m from the Government, has boasted of having £2.4bn in liquidity, and ticket sales are going through the roof so fast they cannot get pilots back off furlough quickly enough – so why the panic?” The European Union is expected to ease restrictions on nonessential travel from July 1, but it is reported that restrictions will remain in place for travellers from the United States and Brazil."}]}