{"article": [{"url": "https://www.marketwatch.com/story/mcconnell-cancels-senate-votes-for-two-weeks-as-republican-lawmakers-test-positive-for-coronavirus-2020-10-03", "published": 1601743100.0, "headline": "McConnell cancels Senate votes for two weeks as Republican lawmakers test positive for coronavirus", "body": "U.S. Senate Majority Leader Mitch McConnell canceled votes planned in the chamber over the next two weeks, after three recent cases of Covid-19 among Republican senators put the Senate’s functioning at risk but left the schedule unchanged for hearings on Supreme Court nominee Amy Coney Barrett. McConnell (R., Ky.) put off his plans to hold votes on district judges in the Senate next week and said the tight schedule set to confirm Judge Barrett before Election Day would remain in place, even if some lawmakers have to attend virtually. The confirmation hearings are set to start Oct. 12. Republican Sens. Mike Lee of Utah and Thom Tillis of North Carolina, both members of the Judiciary Committee, said Friday they had tested positive for the coronavirus. Sen. Ron Johnson (R., Wis.) said Saturday that he had also received a positive test. The diagnoses set off a scramble on Capitol Hill, where lawmakers were in session over the past week and had multiple opportunities to interact with those infected. Other legislators have said they plan to isolate. McConnell has left open the possibility of calling the full Senate back into session if a deal is reached on a new pandemic relief package. He said he would give senators 24 hours’ notice should they be called back. He added that he planned to arrange a series of “pro forma” sessions, in which the Senate is temporarily gaveled in to order, and to allow the work of the committees to continue as each one sees fit. Senate Minority Leader Chuck Schumer (D., N.Y.) criticized McConnell’s decision, saying, “If it’s too dangerous to have the Senate in session, it’s also too dangerous for committee hearings to continue.” The decision to proceed, he added, “is turning an illegitimate process into a reckless and dangerous one.” McConnell said Friday that Republicans’ “biggest enemy” in holding to their Supreme Court schedule was the virus, and emphasized the need to keep GOP senators healthy. All members of the Democratic caucus are expected to oppose Judge Barrett’s confirmation, along with Republican Sen. Susan Collins of Maine, who opposes completing the process before election day. One place where that “enemy” appears to have been present was the White House event to introduce Judge Barrett as the nominee on Sept. 26. While lawmakers were tested upon arriving and allowed into the Rose Garden only after receiving a negative test result, attendees were told they could remove masks because everyone had tested negative, according to a GOP aide. At least seven people who were there have since tested positive, including Sens. Lee and Tillis. Congress’s Office of the Attending Physician and private doctors have advised senators and aides of their potential risk and suggested testing, according to interviews with aides. A Centers for Disease Control and Prevention-funded study of Covid-19 cases found the average incubation period was about five days, so a person who has contracted the virus could be contagious even after testing negative. An expanded version of this story appears on WSJ.com."}]}