{"article": [{"url": "https://www.marketwatch.com/story/mcdonalds-announces-j-balvin-collaboration-after-getting-a-boost-with-travis-scott-11601921087", "published": 1601983820.0, "headline": "McDonald's announces J Balvin collaboration after getting a boost with Travis Scott", "body": "J Balvin is the latest music artist to partner with the fast-food giant. Getty Images for Spotify McDonald's Corp. has announced a new collaboration with reggaeton artist J Balvin following a successful partnership with Grammy-nominated rapper Travis Scott. The J Balvin meal will include a Big Mac, medium French fries with ketchup and Oreo McFlurry. Oreo is a Mondelez International Inc. MDLZ, +1.41% brand. The J Balvin combo will be available through Nov. 1. iframe.twitter-tweet { width: 100% !important; } The Travis Scott/Cactus Jack collaboration is credited with giving McDonald's MCD, -0.43% September sales a bump. The $6 combo included a Quarter Pounder with cheese, bacon and lettuce; medium French fries with barbecue sauce; and a Sprite beverage . That meal was available until Oct. 4. Read: McDonald's September sales get a boost from rapper Travis Scott The J Balvin combo is only the second time a celebrity name has appeared on the McDonald's menu since 1992, when Michael Jordan was featured. UBS doesn't forecast the J Balvin meal to have the same success as the Travis Scott combo based on price. The Oreo McFlurry is only free when the meal is ordered on the McDonald's app. \"We expect a similar level of success could be difficult given the Travis Scott meal was $6 for the first ~two weeks before switching to app only for the $6 offer, where the impact was more muted,\" analysts said. \"The J Balvin meal value is compelling through the app at $6, but the discount is less significant without the app.\" However, UBS thinks that, like the Travis Scott promotion, this one will drive sales and guests. Analysts note that Travis Scott has more than 33 million Instagram followers while J Balvin has more than 44 million. UBS rates McDonald's stock neutral with a $230 price target. McDonald's stock has gained 15% for the year to date while the Dow Jones Industrial Average DJIA, +0.56% has fallen 1.2% for the period."}]}