{"article": [{"url": "https://www.marketwatch.com/story/the-us-economy-took-another-body-blow-from-covid-19-in-july-but-just-how-bad-was-it-2020-08-08", "published": 1596880100.0, "headline": "The U.S. economy took another body blow from Covid-19 in July. But just how bad was it?", "body": "Whew ! Turns out the U.S. economy didn’t get hurt as badly in July from a resurgence in coronavirus cases as Wall Street feared. But make no mistake: The U.S. recovery did take a blow. The government said Friday that the U.S. regained 1.8 million jobs in July, a number that in any other month would be astonishingly good. But these are obviously not normal times. Read: Economy suffers titanic 32.9% plunge in 2nd quarter, points to drawn-out recovery Also:‘A massive welfare economy’ - federal aid prevents even steeper GDP collapse The rise in hiring in July actually marked a steep dropoff in the labor market’s recovery from a 4.79 million gain in June and a 2.73 million increase in May. The rising number of Covid-19 cases in many American states last month forced many states to reimpose restrictions on businesses and prevent them from rehiring staff. And American consumers themselves have turned more cautious. Adding to the litany of problems, Democrats and Republicans in Congress are still at odds on the next rescue package for the economy, including financial aid for millions of workers who have lost their jobs. A temporary $600 federal benefit supplement for the unemployed expired at the end of July. So did an emergency loan program for small businesses and a moratorium on evictions of delinquent renters. Read:The U.S. has only recovered 42% of the 22.2 million jobs lost from the coronavirus Scott Anderson, chief economist at Bank of the West, worries that future increase in employment won’t be so robust. “This is likely to be the best jobs report we are likely to see for a while and probably exaggerates the health of the U.S. labor market today,” he said. The key is how consumers respond. They’ve lost confidence in the economy over the past month, going out less to shop, eat or travel. If they become even more worried about their jobs or if unemployment benefits aren’t extended, they’re likely to cut spending again as they did early in the pandemic. Retail sales endured a record collapse in March and April. “Without that gigantic bump in benefits, consumers won’t have the fuel to spend. What is going to happen to consumption?” said Dan North, chief North American economist at credit-insurer Euler Hermes. “I think it’s going to come screeching to a halt.” Read:Consumers hold the key to an economic recovery and right now they’re very anxious Consumer spending accounts for almost 70% of U.S. economic activity. Businesses can’t bring back more workers or increase production if sales flatten out or decline again. Then it becomes a vicious circle: Less spending leads to fewer jobs, and few people working leads to even less spending and more layoffs. The first hint of how households have responded will come toward the end of this week with the retail sales report for July. Sales snapped back strongly in the early stage of the recovery, soaring 18.1% in May and rising an additional 7.5% in June. See: MarketWatch Coronavirus Recovery Tracker Retail sales haven’t returned all the way to pre-crisis levels — though they are surprisingly close — but a big slowdown in purchases or, worse, outright decline will send a clear signal that the recovery is flagging. A solid gain of 3% or more, however, would offer a glint of hope that the U.S. rebound is still underway. See:MarketWatch Economic Calendar"}]}