{"article": [{"url": "https://www.marketwatch.com/story/consumer-spending-slows-in-july-as-economic-recovery-loses-some-momentum-2020-08-28", "published": 1598611100.0, "headline": "Consumer spending up 1.9% in July as economic recovery loses some momentum", "body": "The numbers: Americans increased their spending in July for the third month in a row, but at a much slower pace in a sign that an economic rebound from the coronavirus pandemic has lost some steam. Personal spending rose 1.9% last month, the government said Friday. Economists polled by MarketWatch had forecast a 1.6% increase. After a record collapse in March and April, consumer spending roared back in May and also grew sharply in June. Yet a fresh outbreak of the coronavirus hurt the economy last month and sapped the recovery of its earlier momentum. Incomes rose 0.4% largely because of government payments to businesses to keep employees on payrolls. The government pumped massive amounts of money into the economy from April to June when the economy was largely shut down in an effort to contain the spread of the virus. The aid slowed in July but did not dry up entirely. Democrats and Republicans have been unable to agree on another aid package after the expiration of temporary unemployment and other benefits at the end of last month. A closely watched measure of inflation, meanwhile, posted the second big increase in a row. The PCE index, the Federal Reserve’s preferred inflation barometer, rose 0.3% after a 0.5% gain in the prior month. The yearly rate of inflation was still quite mild, however, at 1%. It was running close to 2% just a few months before the disease spread to the United States. A separate measure of inflation that strips out food and energy, known as the core rate, also rose 0.3% in July. It’s risen just 1.3% in the past year, however. Read:U.S. initial jobless claims fall to 1 million in late August and resume downward trend Also:Google searches on how to ‘file for unemployment’ is a crystal ball for jobless claims And: Did the expired $600 federal jobless benefit keep people from going back to work? What happened: Consumers spent more in July on new cars and trucks, health care, eating out, and even hotel rooms as Americans traveled more, the government said. Business in the Age of COVID-19:How the hotel industry is reinventing itself in the pandemic to meet the new demands of guests Spending, however, is still about 5% lower compared with its levels before the crisis started. The extremely high level of savings slipped to 17.8% from 19.2% in the prior month. Americans socked more money away after the viral outbreak in case they lost their jobs or the economy worsened. The extra cash could come in handy if Congress fails to approve more aid, but it won’t last long. The low level of inflation, meanwhile, largely reflects the grave damage done to the economy by the pandemic. Many companies had to cut prices to attract customers after sales slumped. To nudge inflation higher, the Federal Reserve on Thursday adopted a new strategy that makes a big break with its past practice of managing the cost of living. The new approach suggests that interest rates are likely to remain low for a long time. See: MarketWatch Economic Calendar Big picture: Consumer spending has slowed after the huge burst of federal aid in the spring, but it’s held up better than expected even with Congress deadlocked on further assistance. Other reports on retail sales, manufacturing production and home construction also point to an economy showing resilience in the face of the coronavirus onslaught. Read:U.S. durable-goods orders leap 11.2% in July on strong demand for cars and trucks Yet most economists think growth could soften or even stall absent more federal aid. The loss of income could force consumers to spend less and save more, depriving businesses of badly needed sales that are essential for them to bring back more workers. That would leave the economy in a chicken-and-egg scenario. Growth can’t speed up unless more people go back to work, but more people can’t go back to work unless the economy improves. What they are saying? “The rebound in spending was more resilient to the renewed surge in coronavirus cases than we and others thought,” said senior U.S. economist Michael Pearce of Capital Economics. “Quite a bit of the government relief still available in July ended in August, so next month might not look quite as bright,” said chief economist Chris Low of FHN Financial. Market reaction: The Dow Jones Industrial Average DJIA, +0.56% and S&P 500 SPX, +0.87% were modestly higher earlier Friday, with the Dow, on an intraday basis, having erased all of 2020’s losses."}]}