{"article": [{"url": "https://www.marketwatch.com/story/shoppers-will-pay-more-for-the-same-item-online-versus-in-stores-under-new-covid-19-conditions-experts-say-2020-06-19", "published": 1592844560.0, "headline": "Shoppers will pay more for the same item online versus in stores under new COVID-19 conditions, experts say", "body": "Not so long ago, the idea of paying more to buy an item online versus in a store would make shoppers feel like they were being duped. However, in a coronavirus-infected world, a small premium is totally acceptable, experts say. In a June report, global consultancy AlixPartners advises retailers to begin taking steps to “stop the margin leakage” and consider new pricing tools and strategies. Perhaps, the report suggests, a retailer doesn’t need to have the same price for an item in stores and online. “Customers may be more accepting of different prices across channels right now because these variations will likely be prevalent everywhere as all retailers work to get margins back in line with elevated e-commerce penetration,” the report said. Read:Retail sales gains in May may fade once government stimulus money runs out, experts say In these times when shoppers can do a quick price comparison online, it may seem crazy that retailers would consider taking this path. But these are unique times. “Overall, consumers’ willingness to accept price differences between online and in-store has increased as e-commerce penetration has grown and more shoppers have grown to understand and appreciate the convenience of home delivery or click-and-collect,” said Joel Rampoldt, a managing director in the retail practice at AlixPartners. There will be 7.4 million new online shoppers in 2020, according to an eMarketer forecast, with 204 million people in the U.S. ages 14 and older making an e-commerce purchase. Grocery retailer Kroger Co. KR, +0.46% said digital sales grew 92% in the most recent quarter. Walmart Inc. WMT, +1.00% said online sales grew 74%. And Costco Wholesale Corp. COST, +1.19% reported 64.5% digital sales growth in fiscal third-quarter. The increased cost of all this online shopping can put a major squeeze on margins. See:Walmart surpasses eBay in U.S. e-commerce, Amazon still tops: eMarketer Rampoldt says many people used e-commerce for certain items, including groceries, for the first time during the pandemic. And click-and-collect became popular as consumers sought ways to purchase what they needed with the least amount of interaction with other human beings as possible. “Convenience is dazzling,” he said. Rampoldt also says that customers don’t price compare as much as retailers think they do. Instead, customers are more concerned about a change in price to the overall cost of the shopping trip. If the purchase is convenient, the price difference reasonable, and customers can get the items they’re looking for, including seasonal items or other things that they may not buy often, like sunscreen in the summer, then a little price difference won’t hurt. “The bigger effect will be where they choose to shop; where they feel they’ll get a better price overall on their basket going out,” he said. Others think this strategy is all wrong. “Pricing online pressures margin because consumers are just one-click away from another retailer competing on price. Online forces price commoditization (Thank you Amazon),” said Jonathan Treiber, chief executive of RevTrax, a deal management platform. “The only way the a retailer can compete omnichannel is to price consistently across channels and make the rest of the online shopping experience differentiated so that price isn’t the only factor for customers.” Those experiences can include fast shipping and easy returns. Also:Bubble Wrap maker SealedAir and Simplehuman CEOs are prepping for a touchless future after coronavirus But the question of “value” and what consumers think is worth the price, time or effort comes down to a few factors, including the individual shopper mentality and the economy. We’re in a time when many people are still social distancing while others are quickly heading to beaches, salons and restaurants after a period of confinement. We’re also in a time when unemployment has reached shocking levels with millions out of work, though sales of things like bikes and breadmakers have gone through the roof. Gretchen Jezerc, senior vice president of marketing at First Insight, a retail analytics platform that uses data to help clients make decisions about things like pricing, says research is the best way to determine how to proceed. COVID-19, the jobless situation, racial unrest and the myriad other current events consumers are now dealing with have shifted “consumer value equations.” Don’t miss: TJX results show shoppers will head back to stores if the price is right, analysts say “Sales history data are not predictive of what the future is going to hold,” Jezerc said. “Some of the tools we had in the past for willingness to pay and how to set pricing have gone out the window.” So perhaps customers will be OK with a pricing difference under the right circumstances. But if a customer feels cheated by that tactic, then a retailer may find itself facing a backlash. “What hasn’t changed – if you give the customer the sense they’re being ripped off, it’s a massive perception problem,” said AlixPartners’ Rampoldt."}]}