{"article": [{"url": "https://www.marketwatch.com/story/thinking-about-an-ev-here-are-the-6-best-in-2020-2020-08-17", "published": 1597641080.0, "headline": "Thinking about an EV? Here are the 6 best in 2020", "body": "For years, electric cars have been in a slow transition from a burgeoning market to more mainstream, easily accessible vehicles. Electric vehicles are longer-range, cheaper and more practical than ever thanks to advancements in battery and electric motor technologies. Here, ranked, are the best electric cars for 2020.1. Chevrolet Bolt The Chevrolet Bolt tops our EV rankings because it’s a great car on its own merits on top of being an electric car. Not only does it deliver an impressive all-electric range of 259 miles, but its electric powertrain is quite lively. Quick acceleration means that driving this EV doesn’t mean you’re stuck with a slow, boring car. The cabin is quite roomy, making it a good, small family car, and it’s generously equipped with standard features. Upgrading to the Premier trim adds even more luxury without too significant a price hike. The Bolt has a starting MSRP of $36,620, which is admittedly pretty high for a compact Chevy, but that price can come down quite a bit after incentives. 2. Tesla Model 3 The Tesla Model 3 iStock The Tesla Model 3 has been called revolutionary for bringing a premium electric car to the masses. It’s the most affordable way to get behind the wheel of a Tesla TSLA, +1.89% , and it has an impressive standard electric range of 250 miles, which can go all the way up to 322 miles with the long-range battery and all-wheel drive. Other virtues of this Tesla: a beautiful, high-tech interior, fun performance and a lot of cargo space, adding to its practicality. The Model 3 has an attractive starting MSRP of $35,000, but it can get well into the $60,000 range on the higher end of the model range and with the Autopilot suite of semiautonomous driving technologies. See: Tesla’s stock run leads to 5-1 share split3. Hyundai Kona Electric The Hyundai Kona Hyundai The Hyundai HYMTF, -0.02% Kona Electric made an impressive debut when it came out in the 2019 model year as a fantastic little electric crossover. The Kona’s acceleration is thrillingly quick, and it has the composed ride of a more luxurious vehicle. The base SEL has a generous list of standard features, and you might be surprised by how nice the Kona can get in the higher trims. The Kona’s eye-catching style adds to its appeal, and we like that the electric model looks distinctly different from the standard gas-powered Kona. It has an outstanding range of 258 miles and a competitive base MSRP of $37,190, making it a serious competitor to the best EVs in this segment. The Kona is the EV that most Autotrader editors would pick, regardless of ranking. Also see: 8 affordable new cars priced well below $20k4. Kia Niro EV The Kia Niro Kia The Kia Niro EV is another small, attractive, reasonably priced electric crossover that deserves a look. If you’re considering the Niro EV, you should definitely compare it to the similar Kona Electric. The Kia offers a bit more passenger and cargo space, but the Hyundai offers more standard features, more engaging handling and available AWD. Whichever’s right for you depends on your priorities. The Niro EV has a good electric range of 239 miles and an affordable starting MSRP of $32,790 before incentives, making it a strong value choice in practical electric vehicles. Also see: The 10 best new car models of 20205. Hyundai Ioniq Electric The Hyundai Ioniq Hyundai The Hyundai Ioniq Electric became a better EV for 2020, with more power and a longer range. This Hyundai can go 170 miles on a full charge, up from the 124 miles of previous models. The horsepower has been bumped up from 118 to 134, which is significant enough to be noticeable. Other upgrades for 2020 that made this good electric compact hatchback even better include a newly standard 8-in infotainment system, more standard safety technology and more available options, like a 10.25-in touchscreen and ambient lighting. Its starting MSRP of $33,045, before incentives, is pretty good, but for not that much more money, you could upgrade to the Kona Electric and get much more range and power. Check out: A first look at Toyota’s new RAV4 plug-in hybrid6. Nissan Leaf The Nissan Leaf Nissan The Nissan NSANY, -1.50% Leaf deserves credit for being the first mass-market electric car — but in 2020, this EV veteran lags a bit behind the best electric cars. That said, it got some nice updates for 2020 to keep it competitive, like more standard driver assistance tech and a standard 8-in infotainment system with Android Auto and Apple CarPlay. It’s pretty roomy for a small hatchback, and it has a fairly generous standard features list. The Leaf is the most affordable EV on this list, with a starting MSRP of $31,600, but it also has the shortest range — 149 miles from the standard battery. Upgrading to the Leaf Plus gives you a bigger battery with a longer range — up to 226 miles — and it starts at $38,200. Its 226-mile range rivals much pricier EVs, such as the Audi e-tron and the Tesla Model 3. Also see: These 3 EVs are the lowest cost to own over 5 years This story originally ran on Autotrader.com."}]}