{"article": [{"url": "https://www.marketwatch.com/story/u-s-treasury-yields-inch-lower-in-range-bound-trade-11600432794", "published": 1600448780.0, "headline": "U.S. Treasury yields come off lows on signs of strengthening consumer", "body": "U.S. Treasury yields edged up Friday, bouncing off their lows after a stronger-than-expected reading of consumer sentiment helped ease some concerns around the U.S. economic recovery. What are Treasurys doing? The 10-year Treasury note yield TMUBMUSD10Y, 0.777% rose 1.2 basis points to 0.694%, contributing to a 2.6 basis point increase this week. Meanwhile, the 2-year note rate TMUBMUSD02Y, 0.156% was up 0.6 basis point to 0.139%, adding to a single basis point weekly rise. The 30-year bond yield TMUBMUSD30Y, 1.576% picked up 2.5 basis points to 1.453%, extending its weekly climb to 3.5 basis points. Bond prices move inversely to yields.What’s driving Treasurys? Investors have started to fret that the U.S. recovery is stalling again, without an additional injection of fiscal stimulus funds into consumers’ wallets from Congress. But some of those concerns were assuaged after the preliminary reading for the University of Michigan’s consumer sentiment index for September came in at 78.9, up from 74.1 in the prior month. MarketWatch-polled analysts had penned in a forecast of 75.9. Investors remain watchful of household spending as consumption represents around 70% of the U.S. annual economic output. Despite the improvement, the index remains well below its February reading that was north of 100. The bond market ended the week well within its trading range after the Federal Reserve on Wednesday underlined its commitment to keeping monetary policy easy for an extended period and warned of only a slow economic recovery. At its most recent meeting, central bank officials indicated they did not expect any rate hikes until after 2023. Some senior Federal Reserve officials spoke on Friday. St. Louis Fed President James Bullard said inflation may be stronger in coming quarters than Wall Street now expects. But Minneapolis Federal Reserve President Neel Kashkari said warnings that U.S. inflation could soon surge aren’t supported by any evidence, and are tantamount to “ghost stories.”What did market participants say? “It’s a stand-off now between the Fed and the rates market. The funds rate is at rock bottom, and barring the really unexpected, won’t go lower. It can stay lower for longer through, which was the main theme out of the FOMC this week,” said Padhraic Garvey, regional head of research for Americas at ING, in a note."}]}