{"article": [{"url": "https://www.marketwatch.com/story/an-obscure-court-ruling-could-play-havoc-with-tech-companies-earnings-2020-07-16", "published": 1595071280.0, "headline": "An obscure court ruling could play havoc with tech companies' earnings", "body": "With every company expected to talk about the impact of the COVID-19 pandemic on earnings in coming weeks, look out for a completely unrelated issue that could cost technology companies billions of dollars in cash or write-offs. The U.S. Supreme Court in late June declined to hear a case filed by chip maker Altera Corp., now owned by Intel Corp. INTC, -1.03%, that sought to challenge a ruling upholding U.S. tax regulations that define how companies can split costs with foreign units. The result is likely to be a big tax bill or a charge for some tech companies: Facebook FB, +0.26%  and Alphabet Inc. GOOG, +1.97%  GOOGL, +1.82% have already paid and taken charges amounting, respectively, to just more than $2 billion. An additional 20 companies have recorded material charges totaling about $623 million in the past year as a result of the unfavorable Ninth Circuit appellate court ruling, and at least one tech company has already disclosed a charge coming off its second-quarter results. Many more are expected. A MarketWatch review of SEC quarterly and annual filings with the Securities and Exchange Commission found that more than 50 companies - mostly in the technology sector, but with a few exceptions - mentioned the Altera case as potentially material to their finances and all noted that they were following the case closely. Several companies mentioned the case in their 2019 filings as well. More on earnings season: Profits set to plunge as the coronavirus batters all sectors Even with the years-long case seemingly decided and concrete examples of costs from tech companies, mysteries and confusion about the impact of the Altera ruling remain. Some companies believe the effects will not be material to their returns, but some are claiming geography will save them, while some tech companies with large stock-based-compensation totals have oddly not mentioned the case at all. Tech companies, like the rest of corporate America, have many ways to try to avoid income taxes, and one of them has been having their cake and eating it too with offshore entities. Companies typically have an offshore entity in a low-income tax location that acts as the main center on paper for all sales outside the U.S. That revenue was typically taxed at a far lower tax rate than the U.S. entity before tax regulations were changed in 2017. The offshore subsidiaries have related party agreements with the main U.S.-based company, and these agreements determine how costs and expenses are split between them. The U.S. entity typically tries to account for as many costs and expenses as it can, including salaries and stock-based-compensation costs, in the higher tax arena of the U.S., to lower its overall tax bill. \"They want the best of both worlds,\" said Daniel Shaviro, Wayne Perry Professor of Taxation at New York University School of Law. \"It's completely lawful and legitimate,\" he said, adding that personally he thinks it is a scam. Shaviro was one of 19 law professors who signed onto an amicus brief in support of the Internal Revenue Service and the tax code in 2016, when the Altera case landed in front of the U.S. Ninth Circuit Court of Appeals. The appellate court upheld the validity of a 2003 tax regulation that \"seeks to prevent avoidance of U.S. taxes\". The regulation requires that \"certain cost-sharing agreements between related entities, such as a U.S. corporate parent and its offshore subsidiary, include stock-based compensation as part of the shared 'costs,' or else be subject to adjustment by the IRS,\" the tax lawyers wrote. With the Supreme Court declining to review the Ninth Circuit ruling, tech companies are now going back to look at their books, including how they have been expensing stock-based-compensation. Some companies have already taken charges or, in some cases, actually written big checks to the IRS based on the appellate ruling. \"This is about real dollars paid to the IRS, not just a paper issue. This is why Altera cared enough to appeal,\" said Paul Zarowin, professor of accounting at the Stern School of Business at New York University, in an email. But he also noted that the issue is going to matter much less now, because the federal corporate tax rate in the U.S. dropped to 21% from 35% in 2017. For most companies, charges will involve the years before that tax code change in 2017. More from Therese: Luckin Coffee tells the danger of Chinese IPOs, but investors aren't listening Facebook said in its annual report filed with the Securities and Exchange Commission in January that the company paid $5.18 billion in cash for income taxes for the year 2019, of which $1.64 billion was related to the Altera case. The company also said that its tax rate in 2019 increased to 25.5%, doubling from the rate of 12.8% in 2018, primarily due to the increase in taxes from the Altera case. A Facebook spokesman declined to comment beyond its statements in regulatory filings. Many companies may still have to deal with the ruling in current earnings reports, as Xilinx Inc. XLNX, +14.10%  showed late last month. The chip maker said in an earnings update that as a result of the case, the potential impact to earnings for the prior years is approximately $57 million, in line with earlier disclosed estimates of $55 million to $60 million. Its expected tax rate for fiscal 2021 will increase by about 1%-2%. However, the chip maker - as well as a few others - seem to hope that the Supreme Court's decision to allow the Ninth Circuit ruling to stand, leaves some doors still open for change. \"The law is unsettled,\" a Xilinx spokeswoman said in an email. \"But like most large companies we are taking a financial reserve in the event it does need to be paid. The $57 million is for the prior tax years (2017-2020). One to two percent will be what we set aside going forward. Again, we are just setting it aside for now, in the event it needs to be paid.\" Among the two internet companies that have taken the biggest hits so far, Facebook appears to be the only company to actually write the IRS a check. Google parent Alphabet said in its annual report after the Ninth Circuit ruling that the company reversed what was previously a net tax benefit of $418 million related to shared stock-based compensation costs in 2019, a tactic many other companies have also adopted. Other companies are taking sizable charges or reversing tax benefits to the tune of millions of dollars, depending on their size and their employee base. Electronic Arts Inc. EA, +1.15%  said in its annual report on May 5 that while it had recognized one-time tax benefits of $1.76 billion related to a $1.840 billion Swiss deferred tax asset, it partially offset that benefit by a one-time charge of $80 million after the Altera opinion by the Ninth Circuit. Lam Research Inc. LRCX, +2.04%  said in a February quarterly filing that it was reversing a $74.5 million net tax asset associated with stock compensation benefits related to its intercompany sharing arrangements. Twitter Inc. TWTR, -0.23%  recorded a tax provision of $80 million in the third quarter of 2019. Gilead Sciences Inc. GILD, +0.82%  said in its annual report in February that it took a cumulative income tax expense of $114 million in the fourth quarter of 2019 as a result of the Ninth Circuit ruling. Altera's owner, Intel, has not disclosed any expected impact from the latest legal developments, a spokeswoman for the chip giant said, declining to comment any further. Beyond the 20-plus firms that have taken charges, another set of companies believe there may be some material impact but were still uncertain at the time of their 10K or 10Q filings. Some may discuss the ruling and its effects in the coming earnings season. There are some interesting exceptions, especially among young software companies, some of which said they believe the Altera ruling will have no material impact on their financial statements because they have already taken the full valuation allowance against deferred tax assets. Those companies include Pinterest Inc. PINS, -0.50%, Slack Technologies Inc. WORK, +3.36%  and Snap Inc. SNAP, -0.18%, companies that have already written off future potential tax credits - tax credits they received because of ongoing losses - because they have no idea if or when they will ever be profitable. This is a conservative accounting practice, said Zarowin of NYU, because the companies have chosen not to recognize a potential asset. One notable software company that did not address the Altera case directly in its most recent 10K is Salesforce.com Inc. CRM, +2.21% ), a company known for big stock compensation for its employees. Salesforce said in its annual report that it regularly reviews deferred tax assets, but did not answer MarketWatch's questions specifically about the Altera ruling. See also: This California legislator is taking on SmileDirectClub In addition, a small number of companies believe that they will not be subject to a ruling due to the location of the appellate court. The Ninth Circuit is the largest appellate court district in the U.S. covering the states of Alaska, Arizona, California, Hawaii, Idaho, Montana, Nevada, Oregon, and Washington state. One accounting firm, KPMG, noted in an article published by Bloomberg that if a company is outside the Ninth Circuit, they may not have to adhere to the ruling. The basic argument is that U.S. tax courts have to abide by precedent from the local jurisdiction, which companies outside the Ninth District could argue does not include them. \"A taxpayer's location will therefore be an extremely important consideration for the Altera issue,\" nine KPMG practitioners wrote last month. \"Taxpayers outside the Ninth Circuit can continue to treat the 15-0 Tax Court opinion as an authority, whereas taxpayers within the Ninth Circuit cannot.\" A KPMG spokesman said that the article was not providing \"advice,\" but rather \"observations\" that are still valid, and declined to comment further. Some companies are taking this tack, however. For example, in the SEC filings of Forrester Research Inc. FORR, +1.92%  , based in Cambridge, Mass., Groupon Inc. GRPN, -0.33%  , based in Chicago, and PTC Inc. PTC, +2.23%  of Boston, all stated that because they were outside of the Ninth Circuit, they did not believe the ruling applied to their companies, while adding that they continue to monitor the case for future developments. This tactic could be problematic, though, eventually. \"Realistically, it is a done deal in the Ninth Circuit,\" said Shaviro, the professor of tax at NYU Law School. \"In other circuits, personally I would tell the taxpayers, there is not a great point to fighting this.\" Undoubtedly, some companies will continue to fight so they can avoid sending millions or even billions to the IRS for how they handled stock-based compensation in previous years. When quarterly earnings begin to roll in though, investors should be aware that many tech companies may adjust their returns - already battered by the effects of the coronavirus crisis- to account for an obscure tax charge."}]}