{"article": [{"url": "https://www.marketwatch.com/story/heres-what-stock-returns-from-now-until-election-day-tell-us-about-biden-and-trump-2020-09-01", "published": 1598964500.0, "headline": "Hereâ\u0080\u0099s what stock returns from now until Election Day tell us about Biden and Trump", "body": "Be on your guard this election season for those using the stock market to predict who will win the White House in November. Thatâ\u0080\u0099s because the historical data can be tortured to say almost anything. This isnâ\u0080\u0099t to say that there is no relationship between stock market performance, consumer confidence, votersâ\u0080\u0099 moods and the incumbentâ\u0080\u0099s chances of staying in the White House. But, as Campbell Harvey, a Duke University finance professor, told me in an email: â\u0080\u009cThe sample [of past Presidential elections] is too small and there are hundreds of variables.â\u0080\u009d Given this, itâ\u0080\u0099s difficult to come up with any conclusion that has genuine statistical significance. Consider the notion that is currently making the rounds that the stock marketâ\u0080\u0099s direction between Labor Day and Election Day predicts whether the incumbent party wins. On the surface this appears to enjoy strong statistical support, at least since the late 1890s, when the Dow Jones Industrial Average DJIA, +0.56% Â was created. However, as I pointed out in a column a couple of months ago, there is no statistically significant correlation between the incumbentâ\u0080\u0099s re-election chances and the Dowâ\u0080\u0099s return over the trailing one month prior to Election Day â\u0080\u0094 or the trailing six months. Why should the market over a two-month period be a good election forecaster but not over a one- or six-month period? These are statistical red flags, and theyâ\u0080\u0099re not the only ones. As I also pointed out in that earlier column, the Dowâ\u0080\u0099s trailing nine-month return is strongly correlated with the incumbentâ\u0080\u0099s re-election odds, but not the Dowâ\u0080\u0099s trailing eight- or trailing 10-month returns. This discussion brings up a broader statistical lesson we should always keep in mind: To properly assess the significance of a given correlation, we must take into account the number of hypotheses that were analyzed during the process of â\u0080\u009cdiscoveringâ\u0080\u009d that correlation. As the number of tested hypotheses increases, the odds also increase of reaching a conclusion that appears to be statistically significant but isnâ\u0080\u0099t really â\u0080\u0094 a false positive, so to speak. Read: Beware of Wall Street analysts predicting how a President Biden would affect stocks and market sectors Given the widespread availability of historical databases and the pressure on both academics as well as Wall Street analysts to discover â\u0080\u009cuncannyâ\u0080\u009d correlations, the number of hypotheses that get tested is huge. My review of research into alleged correlations between the stock market and election outcomes found hypotheses covering periods as short as one month to as long as four years. It would be surprising if a false positive were not to emerge. There is another reason to question the stock marketâ\u0080\u0099s ability to forecast this upcoming election: Even if it ever did have forecasting ability, it wonâ\u0080\u0099t this time around because keeping the bull market going has in effect become a policy goal of the U.S. government. This ironic result is known in economic circles as Goodhartâ\u0080\u0099s Law. Named for a British economist, Charles Goodhart, this law holds that when a measure becomes a target, it ceases to be a good measure. Vincent Deluard, head of global macro strategy at investment firm StoneX, recently explained the origin of Goodhartâ\u0080\u0099s Law in a note to clients: â\u0080\u009cThe most famous examples of Goodhartâ\u0080\u0099s Law were the Soviet factories which, when given targets on the basis of numbers of nails, produced many tiny useless nails, and when given targets on basis of weight produced a few giant nails. Numbers and weight both correlated well in a pre-central plan scenario. After they are made targets (in different times and periods), they lose that value.â\u0080\u009d “ â\u0080\u0098The stock market, which used to be a measure of the economy, has become a policy target. As a result, it has lost its value as a measure of the real world.â\u0080\u0099 ” â\u0080\u0094 Investment strategist Vincent Deluard â\u0080\u009cIn our case,â\u0080\u009d Deluard continued, â\u0080\u009cthe stock market, which used to be a measure of the economy, has become a policy target. As a result, it has lost its value as a measure of the real world.â\u0080\u009d To nip in the bud the arguments that my discussion is politically motivated, let me remind you that it cuts both ways. If the stock market declines between now and Election Day, the lack of a correlation will be taken as being pro-Republican. And if the market instead rises over the next two months, that lack will be taken as being pro-Democrat. Neither is my intent. The truth is that, when the data are tortured to say something, the conclusions tell us more about the torturersâ\u0080\u0099 biases than about any objective election odds. Mark Hulbert is a regular contributor to MarketWatch. His Hulbert Ratings tracks investment newsletters that pay a flat fee to be audited. He can be reached at mark@hulbertratings.com More:An â\u0080\u0098extremeâ\u0080\u0099 August on the stock market might be telling us something about the November election Plus: Biden blasts Trump for having â\u0080\u0098fomentedâ\u0080\u0099 violence, as presidential race tightens"}]}