{"article": [{"url": "https://www.marketwatch.com/story/he-sold-his-company-for-billions-then-invested-almost-his-entire-fortune-in-these-two-stocks-2020-06-07", "published": 1592039720.0, "headline": "He sold his company for billions, then used almost all the proceeds to invest in two stocks â\u0080\u0094 and only two stocks", "body": "What would Warren Buffett do? Definitely not this. But that didnâ\u0080\u0099t stop Ryan Cohen â\u0080\u0094 who sold Chewy CHWY, +4.96% Â , the company he co-founded, for $3.35 billion back in 2017 â\u0080\u0094 from throwing diversification out the window and plunking almost his entire payout into just two stocks: Apple AAPL, +1.74% and Wells Fargo WFC, , two major components of Buffettâ\u0080\u0099s Berkshire Hathaway BRK.A, +0.06% portfolio. â\u0080\u009cItâ\u0080\u0099s too hard to find, at least for me, what I consider great ideas,â\u0080\u009d he told Bloomberg News, without specifying exactly how much he invested. â\u0080\u009cWhen I find things I have a lot of conviction in, I go all-in.â\u0080\u009d No real estate. No hedge funds. No private equity. No bonds. The same car and home heâ\u0080\u0099s had for years. The rest? â\u0080\u009cAll-inâ\u0080\u009d on Apple and Wells Fargo. Against all conventional wisdom. It hasnâ\u0080\u0099t exactly been a smooth ride, at last for the latter position. He told Bloomberg News that his average cost basis in Wells Fargo is about $46, having built up his position in the second quarter of 2017 when it was trading at $54. Now, the stock is trading below $32. On the flip side, Apple is doing just fine. It rallied 120% over the time frame and represents a much larger chunk of Cohenâ\u0080\u0099s portfolio. Combined, his two positions, according to Bloomberg calculations, have been flat for the past two years to lag the S&P 500 SPX, +0.87% Â . Nevertheless, Cohen, who never went to college, is a fan of Buffett, whom he quotes often. He knows, however, that his highly-concentrated approach would raise plenty of eyebrows among the â\u0080\u009cdiversify!â\u0080\u009d crowd. But â\u0080\u009cI donâ\u0080\u0099t want to swing for a single,â\u0080\u009d he said. Cohen recognizes most people shouldnâ\u0080\u0099t follow his lead. â\u0080\u009cYou need to have the temperament to block the noise,â\u0080\u009d he told Bloomberg. â\u0080\u009cSometimes it feels like a roller coaster.â\u0080\u009d Meanwhile, the stock market keeps charging higher, with the Dow Jones Industrial Average DJIA, +0.56% building on last weekâ\u0080\u0099s strong finish with a premarket rally Sunday night."}]}