{"article": [{"url": "https://www.marketwatch.com/story/rich-people-are-this-much-more-likely-to-socially-distance-themselves-and-wear-masks-than-low-income-folks-2020-06-15", "published": 1592302700.0, "headline": "Some Americans are more likely to socially distance and wear face masks than others - here's why", "body": "The size of a person's bank account might predict just how often they'll be washing their hands, wearing a mask or running out to do errands during the coronavirus pandemic. That's according to a study released Monday that delves into the demographics of people's behavior during the coronavirus pandemic. â\u0080¢ A person in the top-earning segment, averaging $233,895, was almost 54% more likely to engage in social distancing and 33% more likely to increasingly wash their hands and wear a mask than someone making an average of $13,775. Social distancing involves steps like staying 6 feet apart from other people in public, avoiding public spaces, running fewer errands outside the house and taking fewer visits with friends and family. The behavior gaps narrowed as the income gaps narrowed, according to the sample of approximately 1,000 people, split between residents in New York, Florida, Texas and California. â\u0080¢ For example, the same person in the top-earning segment was 12.4% more likely to socially distance themselves than someone making $63,572. At the same time, people in both income bands said they were wearing masks and increasingly washing their hands at the same rate. \"High income is associated with higher levels of self-protective behaviors,\" wrote the authors, from Johns Hopkins University, the University of Vermont, the European University Institute, Seoul National University and the University of Exeter Business. (The National Bureau of Economic Research released the study on Monday.) “ 'It's less burdensome for people to engage in these behaviors when they have more money.' ” - Nicholas Papageorge, Johns Hopkins University Why do some people social distance more than others? \"It's less burdensome for people to engage in these behaviors when they have more money,\" said Nicholas Papageorge, one of the authors, an economist at Johns Hopkins University. It's another insight into the pandemic's uneven effects, experts say. Many higher-paid, white-collar workers are able to work from home, unlike lower-paid workers who work in consumer-facing industries or on a factory floor. What's more, higher earners can retreat to a house in the country; build pools in their backyard rather than go to a public pool or beach; and, for the super wealthy, retreat to their yachts. Another wrinkle in the behavior of the mask-wearing public: Black poll participants were 13% more likely to wear masks than white poll participants, the study said. Other research has found that African Americans with coronavirus are more likely to be hospitalized and die than Caucasians, and African Americans are more likely to have a family member or close friend who has died from the virus. That may give them pause before leaving home without a mask. “ Though the rich are taking more 'self protective' measures, the trend isn't uniform. ” Texas residents were 16% less likely than Californians to practice social distancing, and Florida residents were 12% less likely. The survey was conducted in late April, when those states were reopening while New York and California maintained stricter social-distancing rules. Texas's stay-at-home order expired April 30, and Florida started the first phase of its reopening on May 4. (Florida and Texas have now seen recent upticks in coronavirus cases.) President Donald Trump has rarely worn a mask during the pandemic, and Trump supporters may be less inclined to wear one. Both Texas and Florida voted for Trump in the 2016 U.S. presidential election; California went for Hilary Clinton by millions of votes. By late April, 46% of Republicans told Gallup pollsters they were always practicing social distancing, down four percentage points from mid-April. During that same period, 69% of Democrats said they were sticking with social distancing, down one point from the middle of the month. “ People in lower income brackets braced to lose up to a quarter of their income in this study. ” Men were 15% less likely than women to engage in social distancing, a finding that jibes with other studies on the male view of precautions against the pandemic. Another study said men, more than women, regarded masks as a sign of weakness. One trend held true across the five income groups: Lower earners were braced to lose more money as the pandemic ravaged the economy. People earning anywhere between $13,775 and $63,572 on average said they were set to lose up to a quarter of their household earnings. In comparison, people in the top and second highest income tiers expected to lose around 15% of their household income. Economic consequences for smaller incomes have been devastating. Approximately 40% of all jobs paying less than $40,000 in February were gone in March, according to Federal Reserve Chairman Jerome Powell."}]}