{"article": [{"url": "https://www.marketwatch.com/story/trump-explicitly-links-mail-in-voting-and-his-opposition-to-post-office-financial-relief-2020-08-13", "published": 1597431260.0, "headline": "Trump explicitly links mail-in voting and his opposition to post-office financial relief", "body": "WASHINGTON (AP) — President Donald Trump declared Thursday that he opposes additional funding for the U.S. Postal Service, acknowledging that his position would starve the agency of money Democrats say it needs to process an anticipated surge in mail-in ballots during the coronavirus pandemic. Trump also claimed anew — falsely — that Democrats were pushing for universal mail-in voting and predicted without providing evidence that mail-in voting would lead to massive voter fraud in the November election. Polls indicate Trump is in for a tough re-election fight against Democrat Joe Biden. The Republican president said on Fox Business Network that among the big sticking points for a new congressional virus relief package were the Democrats’ demands for billions of dollars to assist states in protecting the election and to help postal workers process mail-in ballots. Key Words: Trump blasts Democratic demands for postal-service money, saying mail-in voting would be ‘fraudulent’ Biden, responding during a meeting in Delaware on the coronavirus, told reporters the comments were, “Pure Trump. He doesn’t want an election.” Key Words (April 2020):White House officials may or may not explicitly threatened a veto but made clear Trump’s opposition to the inclusion in the CARES Act of post-office rescue funds Trump said on Fox’s “Mornings with Maria”: “They need that money in order to have the post office work so it can take all of these millions and millions of ballots.” He added, “If they don’t get those two items, that means you can’t have universal mail-in voting because they’re not equipped to have it.” Trump has moved to sow public distrust in the Postal Service’s ability to deliver what is expected to be record numbers of mail-in ballots. The agency’s new leader, Postmaster General Louis DeJoy, a major donor to Trump and other Republicans, has instituted operational changes that have led to delivery delays across the U.S. For Democrats, Trump’s new remarks were a clear admission that the president is attempting to restrict voting rights. “The President of the United States is sabotaging a basic service that hundreds of millions of people rely upon, cutting a critical lifeline for rural economies and for delivery of medicines, because he wants to deprive Americans of their fundamental right to vote safely during the most catastrophic public health crisis in over 100 years,” Biden spokesperson Andrew Bates said in a statement. Letter carriers load mail-delivery trucks last month at a U.S. Postal Service facility in McLean, Va. Associated Press Negotiations over a new virus relief package have all but ended, with the White House and congressional leaders far apart on the size, scope and approach for shoring up households, reopening schools and launching a national strategy to contain the coronavirus. While there is some common ground over $100 billion for schools and new funds for virus testing, Democrats also want other emergency funds that Trump rejects. “They want $3.5 billion for something that will turn out to be fraudulent. That’s election money, basically,” Trump said during Thursday’s call-in interview. See: Pelosi says sides remain ‘miles apart’ on coronavirus relief measures Democrats have pushed for $10 billion in all for the Postal Service in talks with Republicans on a huge COVID-19 response bill. That figure, which would include money to help with election mail, is down from a $25 billion plan in a House-passed coronavirus measure. DeJoy, who was tapped to head the Postal Service by a Trump-appointed board of governors and started in June, has said that the agency is in a financially untenable position, but he maintains that it can handle this year’s election mail. He is the first postmaster general in nearly two decades who is not a career postal employee. “Although there will likely be an unprecedented increase in election mail volume due to the pandemic, the Postal Service has ample capacity to deliver all election mail securely and on-time in accordance with our delivery standards, and we will do so,” he told the Postal Service’s governing board last week. Memos obtained by the Associated Press show that Postal Service leadership has pushed to eliminate overtime and halt late delivery trips that are sometimes needed to ensure mail arrives on time, measures that postal workers and union officials say are delaying service. Additional records detail cuts to hours at post offices, including reductions on Saturdays and during lunch hours. See:Critics of Trump White House decry latest ‘Friday night massacre’ as postmaster general sidelines two dozen USPS officials Social-media posts, and a widely cited report by the Vice Media site Motherboard, pointed to the removal without explanation of sorting machines from a number of post-office facilities and of street-corner mailboxes from other locations. iframe.twitter-tweet { width: 100% !important; } iframe.twitter-tweet { width: 100% !important; } iframe.twitter-tweet { width: 100% !important; } iframe.twitter-tweet { width: 100% !important; } iframe.twitter-tweet { width: 100% !important; } The Portland newspaper Willamette Week said the Postal Service confirmed to it that mailboxes were being removed in Portland and in Eugene, home to the University of Oregon, suggesting the fixtures were redundant based on current customer demand. The Postal Service has warned the electoral battleground states Michigan and Pennsylvania that the time frames set forth in their absentee-voter rules may not be realistic given the post office’s mail-delivery capacities, ABC News and others have reported. North Carolina, Minnesota and Maine, too, have been warned by the Postal Service’s general counsel that voters could comply with state requirements but still not have their ballots returned in time to be counted due to USPS limitations, MSNBC reported Friday. Later Friday the Washington Post reported that 46 states and the District of Columbia had all received such warnings from the Postal Service. See:Postal Service is warning 46 states about mail voting delays, report says Democrats, and a handful of Republicans, have sent DeJoy several letters asking him to reverse his changes and criticizing what they say is a lack of openness by he agency. Late Wednesday, Senate Democrats again wrote DeJoy, this time saying he is pushing state election officials to opt for pricier first-class postage for mail-in ballots to be prioritized. “Instead of taking steps to increase your agency’s ability to deliver for the American people, you are implementing policy changes that make matters worse, and the Postal Service is reportedly considering changes that would increase costs for states at a time when millions of Americans are relying on voting by mail to exercise their right to vote,” the Democrats wrote. A spokesman for the Postal Service, David Partenheimer, said in a statement that “certain deadlines concerning mail-in ballots, may be incompatible with the Postal Service’s delivery standards,” especially if election officials don’t pay more for first-class postage. “To the extent that states choose to use the mail as part of their elections, they should do so in a manner that realistically reflects how the mail works,” he said. Judy Beard, legislative and political director for the American Postal Workers Union, said postal workers are up to the task of delivering mail-in ballots this year. “We definitely know that the president is absolutely wrong concerning vote-by-mail,” she said. Rep. Gerry Connolly, D-Va., chair of the House subcommittee on government operations, said Trump is acknowledging that he wants to hold up funding for the U.S. Postal Service to hinder Americans from voting. “The president admits his motive for holding USPS funding hostage is that he doesn’t want Americans to vote by mail,” Connolly said in a statement Thursday. “Why? It hurts his electoral chances. He’s putting self-preservation ahead of public safety, for an election he deserves to lose.” MarketWatch contributed."}]}