{"article": [{"url": "https://www.marketwatch.com/story/stock-market-bull-who-called-rally-off-march-lows-now-says-sp-500-overvalued-by-5-to-10-2020-08-07", "published": 1597052000.0, "headline": "Stock-market bull, who called rally off March lows, now says S&P 500 overvalued by 5% to 10%", "body": "Too far, too fast? Barry Bannister, head of institutional equity strategy at Stifel, called for stocks to bounce back aggressively just before the S&P 500 SPX, +0.87% notched its March 23 low. But the Wall Street veteran, on Friday, said he now thinks the market has overshot, fueled by a surge in liquidity and low real yields, which have driven “an extraordinary P/E-led bull market” off the March low. That rise in the price-to-earnings valuation metric is particularly the case for tech-related growth stocks, he said, in a note, with a price pattern that parallels the late-1990s tech-media-telecom bubble. “Beginning in mid-June, we saw third quarter risks (prolonged virus damage to jobs and growth, much lower 2021 next-year [earnings per share] vs. consensus), which now lead us to believe the S&P 500 is 5-10% over valued heading into late summer/autumn 2020,” Bannister said. Bannister in June scaled back his target for the S&P 500 from 3,250 by the end of August to 3,100 by the end of the year. On June 17, he said stocks had discounted the foreseeable recovery and would consolidate. The S&P 500 has subsequently risen 7.5%, ending Friday at 3,351.28. And while it isn’t his expectation, should a tech-led rally continue to propel the S&P 500 higher through the summer with no downside, the likely driver would be a P/E “boom/bubble” caused by a falling equity risk premium accompanied by an “unusually repressed real 10-year yield,” Bannister said. The equity risk premium is the extra return an investor earns for investing in riskier assets, like stocks, over Treasurys, which are viewed as risk-free. A real yield is the nominal yield on an asset minus future expected inflation. If that scenario were to occur, it would be a “direct consequence of the Federal Reserve once again blowing a bubble with several parallels in history for which a heavy dose of caveat emptor is warranted as that usually ends in tears for investors,” Bannister said. The strategist said the unprecedented stimulus efforts undertaken in response to the COVID-19 pandemic, boosting money supply relative to financial assets, are largely responsible for the market’s V-shaped recovery. The S&P 500 plunged by around a third from its all-time closing high on Feb. 19 through March 23. It has since roared back, ending Friday just 1% away from its peak."}]}