{"article": [{"url": "https://www.marketwatch.com/story/home-price-gains-remained-steady-in-april-as-the-coronavirus-swept-across-the-country-case-shiller-index-shows-2020-06-30", "published": 1593511160.0, "headline": "Home price gains remained steady in April as the coronavirus swept across the country, Case-Shiller index shows", "body": "The numbers: Home-price appreciation maintained a steady pace in April, despite the spread of the coronavirus across the U.S., according to a major price barometer released Tuesday. The S&P CoreLogic Case-Shiller 20-city price index posted a 4% year-over-year gain in April, up from 3.9% the previous month. On a monthly basis, the index increased 0.9% between March and April. Because of the two-month lag in the data included in the price index, this was the first report that accounted for the full effects of the coronavirus pandemic on the housing market. What happened: The national index reported as part of the report noted a 4.7% increase in home prices over the past year across America. Phoenix continued to lead the country with an 8.8% annual price gain in April. Seattle was next, with a 7.3% gain, followed by Minneapolis, where home prices rose 6.4% over the past year. Prices were weaker in the Northeast. Overall, the pace of price growth increased in 12 of the 19 cities Case-Shiller analyzed — the 20-city list once again didn’t include Detroit this month because transaction records for Wayne County, Mich., were unavailable, the report noted. “This is, so far, the only directly visible impact of COVID-19 on the S&P CoreLogic Case-Shiller Indices,” Craig Lazzara, managing director and global head of index investment strategy at S&P Dow Jones Indices, said in the report. “The price trend that was in place pre-pandemic seems so far to be undisturbed, at least at the national level.” The big picture: The coronavirus pandemic hasn’t put downward pressure on home prices, yet. Last week, the Federal Housing Finance Agency released its monthly home price index, which similarly showed prices increasing on a monthly and yearly basis in April on average nationwide. Of course, on a regional basis, some parts of the country did see downturns between March and April in the FHFA’s report, including New England and the South Atlantic region, which runs from Maryland to Florida. Whether this trend will continue will depend largely on the trajectory of the coronavirus pandemic. Until now, home-buying demand has remained high relative to a short supply of homes available for sale. As states began reopening in May, home sales activity rebounded across much of the country. But many of the states that reopened early are now seeing sharp upticks in the number of people testing positive for COVID-19. As a result, states have had to reverse some of their reopening plans to slow the spread of the virus, and it’s not clear yet what effect that will have on consumer confidence or those states’ economies. A recent report from Zillow ZG, -0.42% indicated that a downturn in home prices could be delayed and might come in the second half of the year. “The next question housing will face is whether this growth can continue after demand built up during housing’s brief pause in the pandemic’s early days runs its course,” Zillow senior principal economist Skylar Olsen said in the report. “It’s likely housing will feel the broader economy’s downturn eventually, though to a mild degree, and home values will fall in the coming months.” What they’re saying: “The housing market is likely benefiting from low mortgage rates, stronger demand for larger spaces as more and more people work from home and a desire to move away from crowded cities to avoid exposure to the coronavirus,” said Rubeela Farooqi, chief U.S. economist for High Frequency Economics, in a research note."}]}