{"article": [{"url": "https://www.marketwatch.com/story/carnival-lays-off-more-than-100-ship-officers-2020-09-22", "published": 1600779800.0, "headline": "Carnival lays off more than 100 ship officers", "body": "Carnival Cruise Line, a Carnival Corp. unit, is laying off more than 100 ship officers because the parent company is shedding 18 less-efficient vessels from its fleet across various brands, a spokesman said, as cruise operators haven't been sailing in the U.S. for about six months due to the Covid-19 pandemic. The layoffs represent a small percentage of the unit's ship officers, Carnival Corp. spokesman Roger Frizzell said Tuesday. All ship officers comprise about 10% of Carnival's entire workforce, he added. Mr. Frizzell said other brands could also reduce their workforce in the future due to the fleet reduction, though he declined to specify the number. Carnival, the largest cruise operator in the world, and other companies have voluntarily suspended U.S. sailings until at least Oct. 31. That is a month past the Centers for Disease Control and Prevention's expected expiration of its cruising ban. Costa Cruises, the company's Italian brand, started sailing again on Sept. 6 after a monthslong hiatus brought on by ship outbreaks. Its German brand, AIDA Cruises, will restart operations this fall. The company in May said it was laying off 820 shoreside employees in Florida, with another 537 being furloughed. It also laid off nearly 1,000 shoreside employees in California and Washington state. Carnival said the reductions would result in hundreds of millions of dollars in annual savings. The company had about 7,000 shoreside employees in the U.S. and operated 105 ships world-wide before the pandemic, Mr. Frizzell said. Carnival on average employed 92,000 shipboard employees, as well as 12,000 full-time and 2,000 part-time or seasonal employees, according to its 2019 annual securities filing. Carnival last week reported a preliminary loss of $2.9 billion for the quarter ended Aug. 31 as it burned about $770 million a month. It expects to burn about $530 million a month for the current quarter. Those cash-burn rates fall in line with the $650 million average monthly burn rate for the second half of the year the company previously expected. On Monday, a trade group for cruise operators outlined sailing prerequisites to U.S. regulators, in an effort to demonstrate how cruise lines plan to protect people on their ships amid the pandemic, should they get the green light to restart U.S. operations. The Cruise Lines International Association's plan calls for implementing tighter controls to keep infected people from boarding ships, reducing transmission through air management, as well as steps for addressing positive infections aboard. Write to Dave Sebastian at dave.sebastian@wsj.com"}]}