{"article": [{"url": "https://www.marketwatch.com/story/feds-harker-backs-allowing-economy-to-run-hot-before-raising-interest-rates-2020-07-15", "published": 1594815440.0, "headline": "Fed's Harker backs allowing economy to run hot before raising interest rates", "body": "Philadelphia Fed President Patrick Harker on Wednesday said he would support a change in monetary policy where the central bank would let the economy run hot until inflation rises above the central bank's 2% annual target before raising borrowing costs. \"I'm supportive of the idea of letting inflation get above 2% before we take any action with respect to the federal funds rate,\" Harker said, in an interview on Bloomberg Television. Harker is a voting member of the Fed's interest rate committee this year. On Tuesday, Fed Governor Lael Brainard also backed the idea of letting inflation get over 2% before the Fed takes any action to raise interest rates. This promise is called \"foward guidance\" at the central bank. Typically, the Fed would hike rates preemptively if it saw inflation surging. Former Fed staffer, and now Fed watcher, Krishna Guha said he saw support rising for this new policy and strengthened forward guidance and said it was good for investors who want to take risks. \"Harker's comments suggest growing momentum behind this view at the U.S. central bank and should continue to support risk-appetite as investors look ahead to the coming Fed pivot to a new phase of monetary policy in which the FOMC will make longer range commitments on both rates and quantitative easing,\" Guha, now the vice chairman of Evercore ISI, said in a note to his clients. Harker said that controlling COVID-19 was critical to restoring the health of the economy. He said he was \"a little skeptical\" that the July employment report would be as strong as the prior two month's reports given the resurgence of the virus in the South and West. Harker said he was revising down his forecast for economic growth as a result of the spread of the coronavirus. In a webcast speech later Wednesday to the Center City Proprietors Association, Harker said he expected a negative 20% growth rate in the first half of the year, followed by a 13% gain in the second half. The result would be minus 6% for the entire year. \"That's a much sharper recession than we experienced during the financial crisis,\" he said. \"This is going to be a slow recovery. Until we get the virus under control, we can't get the economy back to full throttle,\" he said."}]}