{"article": [{"url": "https://www.marketwatch.com/story/trump-is-putins-useful-idiot-alexander-vindman-says-2020-09-14", "published": 1600113560.0, "headline": "Trump is Putinâ\u0080\u0099s â\u0080\u0098useful idiot,â\u0080\u0099 Alexander Vindman says", "body": "“ â\u0080\u009cPresident Trump should be considered to be a useful idiot and a fellow traveler, which makes him an unwitting agent of Putin.â\u0080\u009d ” Those are the words of Alexander Vindman, the retired U.S. Army lieutenant colonel who blew the whistle on President Donald Trumpâ\u0080\u0099s dealings with the president of Ukraine last year, in a new interview with The Atlantic. Vindman was an aide with the National Security Council who was alarmed by Trumpâ\u0080\u0099s actions, and testified in Trumpâ\u0080\u0099s impeachment hearings. He retired from the Army in July, claiming his career had been derailed â\u0080\u009cthrough a campaign of bullying, intimidation, and retaliationâ\u0080\u009d by the Trump administration. He opened up to The Atlantic in an interview published Monday, saying â\u0080\u009cI did my duty as an American citizen and Army officer.â\u0080\u009d Vindman said he was disheartened by the presidentâ\u0080\u0099s actions, but felt he had a duty to report Trumpâ\u0080\u0099s demand for a Ukrainian investigation into the Bidens. â\u0080\u009cI had to choose between the president and the Constitution. ... No Army officer wants to be put in that position, but there I was.â\u0080\u009d When asked straight-up by Atlantic editor-in-chief Jeffrey Goldberg if he thought Trump was a Russian intelligence asset, Vindman said Trump was more of â\u0080\u009ca useful idiotâ\u0080\u009d â\u0080\u0094 an unwitting dupe of Russian intelligence â\u0080\u0094 and a â\u0080\u009cfellow travelerâ\u0080\u009d who shares Russian President Vladimir Putinâ\u0080\u0099s disregard for democratic norms. Vindman said he doesnâ\u0080\u0099t know if Russia has blackmail information on Trump, but it doesnâ\u0080\u0099t really matter, since he said Trump naturally acts out of an effort to please Putin. â\u0080\u009cIn the Army we call this â\u0080\u0098free chicken,â\u0080\u0099 something you donâ\u0080\u0099t have to work for â\u0080\u0094 it just comes to you. This is what the Russians have in Trump: free chicken,â\u0080\u009d he said."}]}