{"article": [{"url": "https://www.marketwatch.com/story/amazons-2-billion-fund-for-innovation-in-curbing-climate-change-is-latest-sustainability-effort-from-criticized-delivery-giant-2020-06-23", "published": 1592910440.0, "headline": "Amazon's $2 billion fund for innovation in curbing climate change is latest sustainability effort from criticized delivery giant", "body": "Amazon.com Inc. is creating a $2 billion venture-capital fund focused on technology investments to reduce the impact of climate change, another leg of the sustainability initiatives from the delivery giant whose significant carbon footprint has historically come under fire. Late last year, the company AMZN, +3.01%  set a goal to meet Paris Climate agreement objectives 10 years early, with a pledge to be carbon neutral by 2040 even for its Prime one-day shipping service. Amazon said then it would work toward using 100% renewable energy by 2030 and had placed a big order for electric vans from Rivian, which the online retailer took a $440 million stake in. Related:Microsoft aims to be 'carbon negative' by 2030 In the 2016 Paris pact, nearly 200 countries volunteered to reduce greenhouse gas emissions and keep global temperatures from rising no more than 2 degrees Celsius above pre-industrial levels. Amazon and an advocacy group called Global Optimism co-lead The Climate Pledge, a concerted move toward net-zero carbon emissions by 2040. Verizon VZ, +0.23%  , Reckitt Benckiser and Infosys recently joined the pledge, \"which sends an important signal to the market that there will be rapid growth in demand for products and services that help reduce carbon emissions,\" Amazon said. As part of its work toward those goals, Amazon's Climate Pledge Fund announced Tuesday will direct money at entrepreneurial transportation, energy generation, battery storage, manufacturing, as well as food and agriculture, the company said. \"Companies from around the world of all sizes and stages will be considered, from pre-product startups to well-established enterprises,\" CEO Jeff Bezos said in a statement. \"Each prospective investment will be judged on its potential to accelerate the path to zero carbon and help protect the planet for future generations.\" The $2 billion was described as initial funding and no timeline for its disbursement was given. Related:Utilities should charge electric delivery trucks as a new rate class, take other cost-cutting steps: Amazon-led alliance Bezos separately has already pledged $10 billion of his own fortune toward slowing man-made climate change. Read:The 3 markets that Jeff Bezos should target with his billions earmarked to save the Earth Amazon also released its 2019 sustainability report and an update on the company's sustainability goals and programs, details include: -The company says it's on a path to run on 100% renewable energy by 2025, five years ahead of schedule. As part of The Climate Pledge, Amazon had previously committed to reach 80% renewable energy by 2024 and 100% renewable energy by 2030. -To date, Amazon has announced 91 renewable energy projects around the globe. Together, these projects totaling over 2,900 MW of capacity will deliver more than 7.6 million MWh of renewable energy annually, enough to power 680,000 U.S. homes. -Amazon made two investments from its $100 million Right Now Climate Fund in nature-based solutions and reforestation projects around the world, including a reforestation project in the Appalachians in the U.S. and an urban greening initiative in Berlin, Germany. Disclosing its carbon footprint for the first time late last year, the company reported 44.4 million metric tons of carbon dioxide equivalent for 2018, including purchased electricity and indirect emissions. That means it contributed more greenhouse gas emissions in 2018 than some big competitors in retail, logistics and technology, but less than rival Walmart Inc. WMT, +1.00%  and the world's biggest energy companies. Earlier this year, more than 300 employees of the $1 trillion online retail giant signed their names and job titles to statements on a Medium blog post critical of the company's environmental record and charges that it gives funding to climate-change denying organizations. The online protest was organized by a group called Amazon Employees For Climate Justice. The company claims that since 2015, it has reduced the weight of outbound packaging by 33% and eliminated more than 880,000 tons of packaging material, the equivalent of 1.5 billion shipping boxes. Amazon's stock is trading up 46% in the year to date. The S&P 500 SPX, +0.87%  is down 3.5% over the same span. Read:The shift to thrift: COVID-19 propels an already surging secondhand clothing market"}]}