{"article": [{"url": "https://www.marketwatch.com/story/census-bureau-says-its-complying-with-order-to-keep-counting-but-complaints-continue-to-pile-up-from-workers-2020-10-08", "published": 1602230120.0, "headline": "Census Bureau says it's complying with order to keep counting, but complaints continue to pile up from workers", "body": "The head of the U.S. Census Bureau says in a court declaration that the agency is complying with a judge's order for the 2020 census to continue through the end of October, even as the judge keeps fielding complaints from census takers about corners being cut in order to close cases and workers being laid off for no reason. Agency contracts have been extended allowing people to self-respond to the questionnaire online, by mail or by phone through this month, and census takers are still knocking on doors in areas where 100% of households haven't yet been counted, Census Bureau director Steven Dillingham said in a statement to the court Monday. The statement of compliance from Dillingham was ordered by U.S. District Judge Lucy Koh last week after she determined that the statistical agency and the Commerce Department, which oversees the bureau, had violated her earlier preliminary injunction by picking Oct. 5 to end the census. She threatened to initiate contempt proceedings or sanctions if they again violate her injunction, which the Trump administration has appealed. The judge also required the Census Bureau to send out a text last Friday to all staff working on the 2020 census that said the head count of every U.S. resident was continuing through Oct. 31. Koh's injunction suspended a Sept. 30 deadline for ending the head count and also a Dec. 31 deadline for turning in numbers used to determine how many congressional seats each state gets in a process known as apportionment. By doing this, the deadlines reverted back to a previous Census Bureau plan that had field operations ending Oct. 31 and the reporting of apportionment figures at the end of April. Census Bureau Director Steven Dillingham addresses state and Alaska Native leaders on Jan. 17 in Anchorage. Associated Press With the injunction, the judge sided with civil-rights groups and local governments that had sued the U.S. Census Bureau and the U.S. Department of Commerce. Those groups had argued that minorities and others in hard-to-count communities would be missed if the counting ended in September. Dillingham said in his statement that the Census Bureau would be letting go of some census workers whose responsibilities were done - such as those counting people living in transitory housing. But several census workers said in complaints to Koh's office that they had been laid off when there was still work to do or told that there were no more households to count in their areas when that wasn't the case. A census taker from Texas said in an email sent Monday to Koh's court that a manager from the McAllen office had encouraged census takers, also known as enumerators, to resign, claiming they were 100% done. \"That is not true,\" said the census taker, whose name was redacted in the email. \"There's still a lot of work to be done.\" In a court filing, the Census Bureau's assistant director for field operations, James Christy, said there was no violation of the preliminary injunction in the Texas case since census takers in the McAllen area had completed 99.9% of the households they needed to count. A census field supervisor in San Antonio, Brett Pruit, wrote the judge on Tuesday that he had been ordered last Friday to turn in his devices used for recording questionnaire answers and was asked to provide a resignation letter. Pruitt said he refused. \"Well, it appears that your revised Order is being ignored, just as the original Order was ignored,\" Pruitt wrote. As of Monday, 99.7% of households nationwide had been counted, a figure that surpassed the completion rate in 2010, although Montana, Georgia, South Carolina, Alabama, Mississippi and Louisiana hadn't yet crossed the 99% threshold, according to the Census Bureau. The census determines how many congressional seats and Electoral College votes each state gets and how $1.5 trillion in federal funding is distributed each year. During a virtual hearing on Tuesday, Koh asked the Trump administration for more details on how they decided when an area's count had been completed. She also asked for details on what quality control measures had been eliminated and how many households had been counted using information other than interviews of household members, such as interviews with neighbors or administrative records. Attorneys for local governments and civil rights groups said, given the number of census takers who have come forward with stories questioning the thoroughness of the census, they needed time to investigate whether they should file an amended complaint. Federal government attorneys said everyone in the case should wait until the appellate court has ruled on Koh's injunction. The decision was expected Wednesday and was likely to be appealed to the Supreme Court. Brad Rosenberg, a federal government attorney, warned that the plaintiffs were leading the judge down a path where the court would \"play the role of census czar,\" micromanaging how the 2020 census was conducted."}]}