{"article": [{"url": "https://www.marketwatch.com/story/paying-off-unfunded-pension-liabilities-will-be-a-low-priority-after-covid-19-2020-08-10", "published": 1597058000.0, "headline": "Paying off unfunded pension liabilities will be a low priority after COVID-19", "body": "Our most recent update of state and local pension plans showed that — even after nearly a decade of stock market gains — plans were only about 70% funded in fiscal year 2020. That funded ratio discounts future benefits by the plan’s assumed rate of return (7.2%); the ratio would be lower with a lower discount rate (see figure 1). At the same time, experts from the Center on Budget and Policy Priorities (CBPP) predict that state budget shortfalls from the economic impact of COVID-19 will total a cumulative $555 billion over the period 2020-22. This figure is for states only and does not reflect revenue shortfalls at the local level. The CBPP reports that the projected gap for fiscal year 2021 alone (which started July 1 for most jurisdictions) is much larger than for any year during the Great Recession (see figure 2). The impact on governments has already been dramatic. In the last four months, states and localities have furloughed or laid off 1.5 million workers — double the number during the entire Great Recession. In the next couple of years, states — which must balance their budgets every year — will face the tradeoff of deep cuts in education and health care and further layoffs, on the one hand, and funding their pensions on the other. Most observers would probably agree that pension funding could be postponed. More fundamentally, the standard recommendation that sponsors need to eliminate all their unfunded liability over 30 years is increasingly being called into question. For years, we have argued that liabilities created before plans started to pre-fund their pension benefits should be taken off the backs of today’s workers and financed by outside sources as they come due (and coupled with more conservative funding methods — such as a lower discount rate and shorter amortization period — for liabilities created afterward). More recently, other researchers have made the case for stabilizing the ratio of unfunded liability to state GDP. Such a goal would also stabilize the ratio of debt service to output, requiring no further increases in taxes or cuts in outlays to maintain pensions. These more moderate funding approaches seem sensible in the best of times. But they seem particularly helpful given the history of the 21st century, where the plans have been swamped with the retirement of baby boomers (a phenomenon that should end by 2030), two major market corrections in 2000-01 and 2007-09, and three recessions that depleted the revenues of state and local governments. In this context, blindly accumulating assets equal to 100% of the present value of promised benefits really doesn’t seem like a sensible goal."}]}