{"article": [{"url": "https://www.marketwatch.com/story/watch-out-fire-fans-new-reports-say-retiring-early-can-give-you-alzheimers-2020-08-06", "published": 1597156340.0, "headline": "Early retirement could be bad for your health", "body": "Bad news, folks. Just when you thought it was safe to take this job and, you know, a major scientific commission is warning that early retirement can cause Alzheimer’s—or at least serious cognitive decline. Sorry, FIRE fans. Read: Forget retirement, focus on financial independence This gloomy news appears in an otherwise upbeat major new report on dementia research, conducted by a blue-ribbon global scientific panel, and published in the renowned British medical journal The Lancet. “[A] 12-year study of 1658 people found older retirement age but not number of years working was associated with lower dementia risk,” the Lancet Commission reports. “Another study found a twofold increase in episodic memory loss attributable to retirement…compared to non-retirees, adjusting for health, age, sex, and wealth.” Another cohort study of 3,433 people retiring at an average age of 61 found “verbal memory declined 38%. faster than before retirement.” Just for good measure, they added: “In countries with younger compared with higher retirement ages, average cognitive performance drops more.” Dementia is a much bigger issue than we typically acknowledge. It is destroying far more lives than COVID-19. There are an estimated 50 million people around the world with dementia, and that’s projected to triple over the next 30 years. There is no vaccine on the horizon. And the situation is getting worse. Most of those suffering from the disease are elderly. It is possibly the biggest single worry of those planning for retirement—not only because the disease is so bad but because it can last for years, taking a terrible toll on family, caregivers and family finances. The Lancet Commission consists of more than two dozen top medical scientists from around the world, from Britain to Israel to Australia. It has conducted a new systematic review of all the scientific research on Alzheimer’s and dementia published since its previous report in 2017. The bad news: Scientists still don’t know what causes Alzheimer’s, and are still struggling with medical treatments. The good news? Researchers have now found 12 different things which can drastically lower our risks. “These the 12 modifiable risk factors account for around 40% of world-wide dementias, which consequently could theoretically be prevented or delayed,” they report. Three of the 12 are newly identified, they say. The other nine, first identified in the 2017 report, have since been confirmed by further research, they add. Some of the 12 are things we can each control directly. Those who want to minimize their risks of getting dementia should avoid drinking too much alcohol, researchers say. They should avoid breathing in too much air pollution. They should stop smoking. As early as possible in life they should get their weight down to a healthy level, avoid obesity, take exercise, and lower their blood pressure. And when they start to lose their hearing, they should use a hearing aid. Apparently it really makes a difference. Oh, and finish high school: The more education you get before age 20, the less likely you are to end up with dementia. Other risk factors are more complex to control or avoid, such as avoiding traumatic brain injuries, depression and social isolation. (It’s courtesy of the Department of Irony and Unintended Consequences, by the way, that the COVID-19 lockdown is almost certainly causing spikes in most of these risk factors. People are more isolated, more depressed, they’re drinking more and eating more and exercising less.) Read: All of the ways isolating at home is bad for your health — and a few simple solutions Meanwhile, here’s a cheerful note. The Commission also reports that a big study of more than 15,000 people in China found that people over 65 who read, played games and gambled had reduced risk of getting dementia. Bring on the poker games in the retirement homes."}]}