{"article": [{"url": "https://www.marketwatch.com/story/i-filed-a-joint-tax-return-with-my-estranged-wife-because-she-is-a-gambler-and-her-finances-are-a-mess-but-i-got-no-stimulus-check-what-can-i-do-2020-07-15", "published": 1595611040.0, "headline": "I filed a joint tax return with my estranged wife because she is a gambler and her finances are a mess. But I got NO stimulus check â\u0080\u0094 what can I do?", "body": "Dear Moneyist, I am a full-time student and Iâ\u0080\u0099m 50 years old. I graduate in December 2020 and maintain a 4.0 GPA so I work hard to achieve academic success. Due to achieving such academic prowess, I was limited to work hours throughout the 2019 year and my combined income was $13,000. I separated from my wife, Sharon, four years ago. She inherited a pension worth $172,000 as a result of an untimely death of her ex-husband. Sharon lives in Oklahoma and I live in Arkansas. Sharon had a gambling issue and exhausted all of this income throughout the 2019 tax season. I never saw any of that money other than a birthday cake, a gift, and a night at the casino that she gave to me as part of my birthday present. It was brought to my attention in November that her money was gone. I was not happy, but it is her money and she has to live with it. Related: â\u0080\u0098Iâ\u0080\u0099m astounded that I have NOT received my paymentâ\u0080\u0099: When will I receive my stimulus check? To help her, I filed a joint tax return. Although we are separated, we are good friends and I try to look out for her in any way that I can. We filed in February and, shortly thereafter, the pandemic hit. Her pension worth $171,000, other income totaling $21,000, her gambling winnings of $29,000, and my annual salary of $13,000 put us over the threshold for receiving any CARES Act assistance. In helping Sharon out, I ended up getting screwed. Is there any form of grievance I can file for to obtain the $1,200 I believe I am owed? If so, how can I? Also, will we miss out on the second stimulus, if there should be one? I am out of work as of April and, due to the economic crisis countrywide, jobs are sparse, to say the least. I hope to obtain work at the University this fall in the work/study program, but that will not be until August, if we are allowed on campus. It is proposed at this time that school will resume normal operations this fall, but we all know how suddenly this could change. To top it all off, my income will be even less than $13,000 this year and Sharonâ\u0080\u0099s will be less than $20,000. Mr. Nice Guy Dear Mr. Nice, Sometimes, I come across a â\u0080\u009cneedle on vinylâ\u0080\u009d moment in letters when the music suddenly stops and thereâ\u0080\u0099s an almighty screech of the steel against the record. Itâ\u0080\u0099s usually a moment thatâ\u0080\u0099s crucial to the problem and the solution, one that is directly related to the financial problem and the emotional issue that will hopefully help ensure that you do not make the same mistake again. Sometimes, it seems like we are dealing with a completely separate situation, but then we find out that subsequent challenges are actually the same â\u0080\u009cneedle on vinylâ\u0080\u009d moment happening again and again, and again. “ â\u0080\u0098Did your wife appreciate it? She likely did and made you feel like a nice guy, and that is gratifying, for a time. Plus, it's true! You are a nice guy. But is the nice thing also the most honorable one?â\u0080\u0099 ” â\u0080\u0094 The Moneyist Here was that moment: â\u0080\u009cTo help her, I filed a joint tax return.â\u0080\u009d Your estranged wife has a gambling problem and you swooped in and helped her out. Did your wife appreciate it? She likely did and made you feel like a nice guy, and that is gratifying, for a time. Plus, it's true! You are a nice guy. But is the nice thing also the most honorable one? Appreciation is like cotton candy. It tastes sweet, but it quickly disappears and leaves an odd, sticky taste in your mouth that we canâ\u0080\u0099t quite identify. Thatâ\u0080\u0099s when you realize that appreciation â\u0080\u0094 like that fairground sugar-on-a-stick â\u0080\u0094 is both ephemeral and cheap. You didnâ\u0080\u0099t get screwed. Thatâ\u0080\u0099s a fundamental error in your thinking and your interpretation of the CARES Act. You punkâ\u0080\u0099d yourself, my friend. It was your decision to file jointly and, therefore, itâ\u0080\u0099s your responsibility. You didnâ\u0080\u0099t get screwed by the CARES Act either. The stimulus check is effectively a tax credit on your 2020 income-tax return, so you should be made whole in 2021. True, you wonâ\u0080\u0099t receive your check(s) this year, but you should not lose out on your stimulus entirely. If file your 2020 tax returns as a single filer next year, you are likely to receive the tax credit(s) at that time. Related:I told my family I boycott Chick-fil-A over its support of anti-LGBTQ causes â\u0080\u0094 now they â\u0080\u0098likeâ\u0080\u0099 it on Facebook and go there for lunch Now to the â\u0080\u009cethics and etiquetteâ\u0080\u009d part of your question. This is the trickier part. Sharon made the mistake. You took the fall. A problem shared is a problem halved, right? If only lifeâ\u0080\u0099s conundrums, mathematics and the governmentâ\u0080\u0099s economic stimulus payments worked like that. When the solution addresses the symptoms rather than the cause, a problem shared is often a problem doubled, tripled â\u0080\u0094 and quadrupled. It will keep happening again, my friend, until your wife deals with the source of her gambling addiction, assuming another addiction does not pop up replace this one. “ It will keep happening again, my friend, until your wife deals with the source of her gambling addiction, assuming another addiction does not pop up replace this one. ” â\u0080\u0094 The Moneyist How many times have any of us thrown our hands up and cried to the Heavens, â\u0080\u009cI was just trying to do the right thing!â\u0080\u009d Thatâ\u0080\u0099s not enough. We must also ask ourselves: â\u0080\u009cWhy did I do it?â\u0080\u009d No one wins. Your wife doesnâ\u0080\u0099t win: You enabled her to gamble another day. You donâ\u0080\u0099t win: You could have received $1,200 at a time when you clearly needed it to pay your bills. So why did you help her out? Why did you protect her? Perhaps you can tell this story, engender sympathy from friends and family who can shake their heads and say, â\u0080\u009cOnce again, she done him wrong.â\u0080\u009d Itâ\u0080\u0099s important to help people. Thatâ\u0080\u0099s what we do. But there is a line that you can draw with your wife in future, and there is another better way you can help her, by stepping back and telling her that she needs to stand on her own two feet, and face her problems head-on. You didnâ\u0080\u0099t cause her gambling problem, you are not responsible for it and you canâ\u0080\u0099t cure it. Thatâ\u0080\u0099s not your job. There is a valuable lesson for you here, my friend, and itâ\u0080\u0099s worth a hell of a lot more than $1,200. You can email The Moneyist with any financial and ethical questions related to coronavirus at qfottrell@marketwatch.com Want to read more?Follow Quentin Fottrell on Twitterand read more of his columns here Would you like to sign up to an email alert when a new Moneyist column has been published? If so, click on this link. Hello there, MarketWatchers. Check out the Moneyist private Facebook FB, +0.26% Â group where we look for answers to lifeâ\u0080\u0099s thorniest money issues. Readers write in to me with all sorts of dilemmas. Post your questions, tell me what you want to know more about, or weigh in on the latest Moneyist columns."}]}