{"article": [{"url": "https://www.marketwatch.com/story/us-britain-canada-accuse-russia-of-hacking-virus-vaccine-trials-2020-07-16", "published": 1594893560.0, "headline": "Russia accused by U.S., Britain, Canada of hacking coronavirus vaccine trials", "body": "LONDON (AP) — Britain, the United States and Canada accused Russia on Thursday of trying to steal information from researchers seeking a COVID-19 vaccine. The three nations alleged that hacking group APT29, also known as Cozy Bear and said to be part of the Russian intelligence service, is attacking academic and pharmaceutical research institutions involved in coronavirus vaccine development. Britain’s National Cybersecurity Centre made the announcement, which was coordinated with authorities in the U.S. and Canada. “It is completely unacceptable that the Russian Intelligence Services are targeting those working to combat the coronavirus pandemic,’’ Foreign Secretary Dominic Raab said in a statement. “While others pursue their selfish interests with reckless behaviour, the U.K. and its allies are getting on with the hard work of finding a vaccine and protecting global health.’’ The persistent and ongoing attacks are seen by intelligence officials as an effort to steal intellectual property, rather than to disrupt research. The campaign of “malicious activity’’ is ongoing and includes attacks “”predominantly against government, diplomatic, think-tank, healthcare and energy targets,’’ the National Cybersecurity Centre said in a statement. It was unclear whether any information actually was stolen but the center says individuals’ confidential information is not believed to have been compromised. Cozy Bear, also known as the “dukes,” has been identified by Washington as one of two Russian government-linked hacking groups that broke into the Democratic National Committee computer network and stole emails ahead of the 2016 presidential election. The other group is usually called Fancy Bear. The director of operations for the British cybersecurity center, Paul Chichester, urged “organizations to familiarize themselves with the advice we have published to help defend their networks.” The statement did not say whether Russian President Vladimir Putin knew about the vaccine research hacking, but British officials believe such intelligence would be highly prized. U.S. authorities have for month leveled similar accusations against China. FBI Director Chris Wray said last week, “At this very moment, China is working to compromise American health care organizations, pharmaceutical companies, and academic institutions conducting essential COVID-19 research.” ___ Associated Press Writer Eric Tucker in Washington contributed."}]}