{"article": [{"url": "https://www.marketwatch.com/story/the-case-for-defunding-nursing-homes-2020-07-13", "published": 1594630460.0, "headline": "The case for defunding nursing homes and replacing them with a radically different model", "body": "This article is reprinted by permission from NextAvenue.org. Just as the defund the police movement underscores the institutional racism that cries out for fundamental change, the COVID-19 pandemic ravaging nursing home residents underscores a deep-seated ageism inherent in our institutional model of nursing home care. I believe it is time to defund the institutional model and replace it with a radically different model. Today’s typical nursing home has never come close to meeting the public’s desire for humane and dignified long-term care. Warehousing large numbers of frail elders in hospital-like buildings with residents in double or triple rooms along with staff turnover as high as 100% unavoidably creates a high risk for resident safety and compromises quality of care.Nursing homes in the pandemic Even before the pandemic, 82% of all nursing homes had infection prevention and control deficiencies cited in one or more years from 2013-2017, according to the U.S. Government Accountability Office. And 48% had such a deficiency in multiple years. Despite the $90 billion paid annually by Medicare and Medicaid to nursing homes, and exacting regulatory requirements addressing quality of care and quality of life for the nation’s 1.3 million nursing home residents, we as a society have failed to keep frail elders safe — let alone in an environment that older adults look forward to residing in. Pandemic data from the Centers for Medicare and Medicaid Services indicate that, as of the end of May, over 32,000 nursing home residents had died in the 88% of nursing homes that reported data. Other analyses have reported nursing home resident and staff deaths represent 40% of the nation’s COVID-19 deaths and in some areas, as high as 75%. See: Undetected community transmission in N.Y. drove nursing home deaths, report says As a result, multiple recommendations for change have gained attention. They include ensuring adequate personal protective equipment in nursing homes; disaster plans that facilitate quarantining; more and better trained staff and heightened monitoring and oversight of care. But let’s be clear: These measures do little more than rearrange the deck chairs in a failing system. The COVID-19 pandemic is a 9/11 moment for nursing home care and a test of our ability to reimagine nursing home care that puts the “home” into nursing homes.The green house model As the largest payer for nursing home care, Medicare and Medicaid hold the key. Now is the time to change facility requirements to gradually limit participation in the program only to facilities that provide the following: Small home-like facilities Single rooms and bathrooms A flattened, more flexible staff hierarchy with cross-trained staff A culture focused first on residents’ goals, interests and preferences Fortunately, there is already a model for this kind of facility: the nonprofit Green House Project created by Next Avenue Influencer in Aging Dr. Bill Thomas in 2003. There are 300 Green House facilities nationally, each with 10 or 12 residents who have single rooms and private baths. Some call this “the household model.” Don’t miss: Will COVID-19 force older workers to retire? In The Green House, facilities are designed around a living room with a fireplace and an open kitchen where meals are prepared and shared. The cross-trained staff, backed by nurses and doctors, engage with residents, serving as nurse aides, cooks, cleaners and participants in meals and social activities. Not surprisingly, Green House staff turnover is far below that of traditional nursing homes. Of most importance to policy makers, Green House Project homes have been proven to have high resident, family and worker satisfaction; better quality of care and quality of life than traditional nursing homes; costs comparable to traditional nursing homes and, in the midst of the pandemic, a much greater ability to prevent and contain illness. Read: Social Security is under pressure, senior citizens are battling a health crisis — it’s not easy aging in America Data collected in ongoing research has revealed only one resident death as of May 31 in a sample of 1,862 residents in 178 Green House homes providing skilled nursing. As long as the nursing home industry can rely on the flow of federal money for the current model of care, it has no financial incentive to change, not even after the coronavirus catastrophe. Change that flow, and a major cultural change in long-term care will follow. Charles Sabatino is director of the American Bar Association Commission on Law and Aging and a Next Avenue Influencer in Aging. The views contained in this article represent Charles Sabatino’s opinions and should not be construed to be those of either the American Bar Association or the Commission on Law and Aging unless adopted pursuant to the bylaws of the Association. This article is reprinted by permission from NextAvenue.org, © 2020 Twin Cities Public Television, Inc. All rights reserved."}]}