{"article": [{"url": "https://www.marketwatch.com/story/red-sweatered-midwesterner-ken-bone-isnt-voting-for-trump-but-hes-still-getting-blasted-by-biden-supporters-11602092368", "published": 1602082400.0, "headline": "Red-sweatered Midwesterner Ken Bone isnâ\u0080\u0099t voting Trump, but heâ\u0080\u0099s still getting blasted by Biden backers", "body": "Ken Bone Getty Images â\u0080\u009cWhat does Ken Bone think of all this?â\u0080\u009d asked nobody ever. Well, almost nobody. Newsweek just checked in with Bone, whose 2016 â\u0080\u009c15 minutes of fameâ\u0080\u009d as an undecided voter was sullied by the discovery of his icky Reddit history, and found heâ\u0080\u0099s pretty much sticking to the same message he espoused four years ago. Basically, neither candidate excites him. â\u0080\u009cTo be perfectly honest, Iâ\u0080\u0099d say Iâ\u0080\u0099m uncommitted again,â\u0080\u009d Bone explained. â\u0080\u009cVery, very few people in either of these election cycles were truly undecided. Theyâ\u0080\u0099re uncommitted, which means that you donâ\u0080\u0099t really have a positive opinion of either candidate.â\u0080\u009d Bone, who endorsed Andrew Yang earlier this year, slammed President Trump as a â\u0080\u009cmaster of manipulating peopleâ\u0080\u009d and said Joe Biden isnâ\u0080\u0099t worthy of his support, either. The first presidential debate debacle only solidified his â\u0080\u009cuncommittedâ\u0080\u009d stance. â\u0080\u009cWe kind of got what we expected. In a way, we almost got what we deserved, because weâ\u0080\u0099ve all played our part in raising the temperature of political discourse,â\u0080\u009d he said. â\u0080\u009cIt leads to a couple of people who are probably older than your grandparents, yelling at each other and telling each other to shut up, and talking over each other like drunk relatives at Thanksgiving. It was insanity.â\u0080\u009d Hereâ\u0080\u0099s the video of his comments: div.youtube { height:0; position:relative; padding-bottom:56.25%; } div.youtube > iframe { position: absolute; left: 0; top: 0; width: 100%; height: 100%; } With that, â\u0080\u009cKen Boneâ\u0080\u009d quickly emerged as one of Twitterâ\u0080\u0099s TWTR, -0.23% top trending topics. As it often does with these things, it got ugly in a hurry. iframe.twitter-tweet { width: 100% !important; } iframe.twitter-tweet { width: 100% !important; } iframe.twitter-tweet { width: 100% !important; } Bone, after responding to several of the tweets, shared his conclusion with his 163,500 followers. iframe.twitter-tweet { width: 100% !important; } Bone eventually got off the â\u0080\u009cuncommittedâ\u0080\u009d fence and announced his pick for 2020. â\u0080\u009cI voted Clinton in â\u0080\u009916 and this morning I sealed my mail in ballot having voted for Jo Jorgensen,â\u0080\u009d he said. â\u0080\u009cI donâ\u0080\u0099t agree with either of them 100% but felt they were the best options available to me at the time.â\u0080\u009d Jorgenson, the Libertarian Party nominee, gladly accepted his vote: iframe.twitter-tweet { width: 100% !important; } â\u0080\u0093"}]}