{"article": [{"url": "https://www.marketwatch.com/story/its-dangerous-not-to-be-sending-a-clear-message-to-americans-us-hits-120000-coronavirus-cases-over-july-4th-weekend-with-surges-in-florida-arizona-and-texas-2020-07-05", "published": 1594029380.0, "headline": "'It's dangerous NOT to be sending a clear message to Americans': U.S. hits 156,000 new coronavirus cases over July 4th Holiday", "body": "The U.S. has recorded nearly 156,000 new coronavirus cases over the July Fourth Weekend. COVID-19, first identified in Wuhan, China in December, had infected 11,474,998 people globally and 2,888,729 in the U.S. as of early Monday, up from 2,732,639 on Thursday evening ahead of the long weekend, according to official figures collated by Johns Hopkins University's Center for Systems Science and Engineering. It had claimed 534,825 lives worldwide, and 129,947 in the U.S. “ 'It makes me angry. You know, I understand he has a tough job, but it is dangerous not to be sending a clear message to Americans.' ” - Mayor Steve Adler of Austin, Texas, speaking to CNN's 'State of the Union' While COVID-19's progress has slowed in states such as New York, where most cases in the U.S. are still centered, confirmed coronavirus cases have risen in nearly 40 U.S. states. New cases are up 38% in the Virgin Islands, 37% in Florida over the past week, 34% in Idaho, 32% in Montana and Arizona, 29% in South Carolina, 28% in Texas, and 20% in California, according to this tally by the Washington Post. The rolling seven-day average of new cases hovers at more than 48,300 up from over 11,700 one week ago, the paper added. In Texas, the number of cases rose by over 4,400 on July 5, more than 6,000 the previous day, bringing the total number of cases in the state to at least 200,100. Mayor Steve Adler of Austin, told CNN's T, -1.01% \"State of the Union\" show on Sunday: \"If we don't change the trajectory, we are within two weeks of having our hospitals overrun.\" Citing comments by President Donald Trump that COVID-19 would go away, and the July 4th gathering at the White House with many guests who were not social distancing or wearing masks, Adler, a Democrat, said, \"It makes me angry. You know, I understand he has a tough job, but it is dangerous not to be sending a clear message to Americans.\" “ New York has had the most deaths from COVID-19 in the U.S., followed by New Jersey and Massachusetts. ” Houston Mayor Sylvester Turner, a Democrat, echoed those sentiments on CBS VIAC, -2.34%. \"A month ago one in 10 people were testing positive. Today, it's one in four. The number of people who are getting sick and going to the hospitals has exponentially increased. The number of people in our ICU beds has exponentially increased.\" Turner also said hospitals in his city could be in \"serious trouble\" if they don't get a handle on the spread. Thus far, New York has had the most deaths from COVID-19 in the U.S. (32,206), followed by New Jersey (15,211), Massachusetts (8,183), Illinois (7,020), Pennsylvania (6,753), California (6,373) and Michigan (6,218). Texas has reported 2,628 deaths from the virus. Florida reported 10,059 new cases Sunday after reporting 11,458 new cases Saturday, which was second only to the daily peak of 11,571 in New York last April. It confirmed over 200,100 cases Sunday, up from 190,052 cases the day before. Florida has seen a rise in hospitalizations in recent days and, while most of those were among older people, an 11-year-old boy from Miami-Dade County died from complications from the disease, the youngest person in the state to die from COVID-19 and third child in the state to die from the disease. Miami Mayor Francis Suarez, a Republican, told ABC News DIS, +1.53% : \"The city of Miami was the last city in the entire state of Florida to reopen and I was criticized for waiting so long.\" He added, \"When we reopened people started socializing as if the virus didn't exist.\" He said the rise in cases was \"extremely worrisome.\" Anthony Fauci, director of the National Institute of Allergy and Infectious Diseases for three decades and one of the leading experts on pandemics in the U.S. for the last four decades, has said Americans and lawmakers need to reconsider some of their actions. On Thursday, Fauci said the virus may be mutating to become more transmissible. \"We don't have a connection between whether an individual does worse with this or not. It just seems that the virus replicates better and may be more transmissible. But this is still at the stage of trying to confirm that.\" Fauci focused on three main failings by both the public and authorities: Many states have reopened too quickly, people are not abiding by rules of social distancing, and the authorities could do a better job at contact tracing to track people who have been in contact with those who test positive. The Dow Jones Industrial Index DJIA, +0.56%  and the S&P 500 SPX, +0.87%  were up Monday, after better-than-expected unemployment numbers amid a surge of coronavirus in states that have loosened restrictions. (This story was updated early Monday.) How COVID-19 is transmitted"}]}