{"article": [{"url": "https://www.marketwatch.com/story/stock-futures-point-lower-as-tech-rebound-loses-steam-ahead-of-data-on-jobless-claims-2020-09-10", "published": 1599755900.0, "headline": "Dow sheds more than 400 points, Nasdaq leads market selloff as tech rebound fades", "body": "U.S. stock benchmarks finished lower Thursday after a volatile session, as investor hopes for a further recovery towards last week record highs was undermined by weak labor market data and a lack of progress on another fiscal stimulus bill in Washington, while valuations of technology stocks are still seen too high as the economy struggles to recover from the COVID-19 pandemic. What are major benchmarks doing? The Dow Jones Industrial Average DJIA, +0.56% fell 405.89 points, or 1.5%, to close at 27,534.58 but had been up by as many as 234 points. The S&P 500 SPX, +0.87% shed 59.77 points, or 1.8%, to finish at 3,339.19, after touching an intraday high at 3,425.55. The Nasdaq Composite Index COMP, +1.39% fell 221.97 points, or 2%, closing around 10,919.59, after hitting an intraday high at 11,299.53. Stocks bounced Wednesday after a rout that pushed the Nasdaq into correction territory, falling more than 10% from a record close. The Dow Jones Industrial Average rose 439.58 points, or 1.6%, to finish at 27,940.47, while the S&P 500 advanced 67.12 points, or 2%, to close at 3,398.96. The Nasdaq Composite advanced 293.87 points, or 2.7%, ending at 11,141.56.What’s driving the market? All three U.S. benchmark stock indexes have fallen for four of the past five days with the Nasdaq Composite now down 7.27% so far for September. “Until there’s a clear unambiguous, oversold underpinning, markets will remain volatile,” Quincy Krosby, chief market strategist at Prudential Financial, told MarketWatch. Thursday’s market selloff also comes amid doubts over the prospect of another fiscal stimulus package, a continuing source of volatility for Wall Street. Democrats blocked a Senate Republican bill on the Senate floor Thursday, raising the possibility that a stimulus bill would have to wait until after the November Presidential election. Traders digested a report on U.S. weekly jobless benefit claims, one of the key pieces of economic data amid the coronavirus pandemic, which came in weaker-than-expected, with initial jobless claims at 884,000, compared with the 850,000 expected by economists surveyed by Dow Jones. The total was unchanged from the previous week, the Labor Department said. Continuing claims from those filing for at least two weeks rose from the previous week, hitting 13.385 million, an increase of 93,000 from a week ago and an indicator that the strong jobs improvement through the summer may be tailing off entering the fall. Investors remain fixated on tech and other megacap tech stocks, including Apple Inc. AAPL, +1.74%, Facebook Inc. FB, +0.26%, Amazon.com Inc. AMZN, +3.01% and Microsoft Corp. MSFT, +2.48%, which had led a surge that many investors felt had become euphoric before the Nasdaq’s selloff. Analysts said the tech selloff, relative to the size of the rally from the March pandemic lows, marked less of a retreat than meets the eye. “While a drop of this size from the peak sounds like a steep correction, it remains a minor one given the index had rallied 83% from the March lows in a mere five months,” said Hussein Sayed, chief market strategist at FXTM, referring to the Nasdaq-100 Index NDX, +1.51%. “With a price to earnings ratio of 36, valuations for the index are still significantly overstretched, hence we should expect more volatility in the weeks to come heading into the U.S. presidential election” in November, he said, in a note. Investors also parsed moves by the European Central Bank, which left its policy unchanged at minus 0.5% and its refinancing rate at 0%, while reaffirming it plans to leave rates at present or lower levels until inflation rises to converge with its target at 2%. ECB President Christine Lagarde said the unwelcome strength of the euro was discussed by policy makers, but isn’t something that the bank targets. “The ECB’s admission that the euro’s recent strength is not a significant worry will help propel the currency higher, likely prompting even more alarm behind the ECB’s closed doors,” wrote Seema Shah, chief strategist at Principal Global Investors, in a note. “However, even if Christine Lagarde’s every word had been directed at containing the Euro’s appreciation, that would have been hopelessly optimistic,” the analyst wrote. Read: Euro bulls ready to test ECB’s pain threshold after Lagarde fails to stem rally Meanwhile,the 30-year fixed-rate mortgage hit a new record low, averaging 2.86% for the week ending Sept. 10, falling 13 basis points from the week prior, Freddie Mac reported Thursday. The previous record low was set in early August at 2.88%. A year ago, these loans had an average rate of 3.56%.Which companies are in focus? Shares of ZScaler Inc. ZS, +2.91% fell 1.4% even after the cloud-focused security-software company delivered results for its fiscal fourth-quarter and a fiscal new year outlook that topped expectations. GameStop Corp. GME, -10.89% shares were down more than 15% after the videogame-rental chain reported fiscal second-quarter results that disappointed expectations. Shares of Citigroup Inc. C, +0.47% was off 0.9% Thursday, after the bank said CEO Michael Corbat announced plans to retire, after about eight years in the role and 37 years at the bank. He will retire and step down from the board of directors in February 2021. The bank said Jane Fraser, currently the CEO of global consumer banking, will succeed Corbat as CEO in February. Short seller Hindenburg Research published a report on electric truck maker Nikola Inc. NKLA, -1.36% on Thursday, accusing it of being an “intricate fraud” built on lies told by its Founder and Executive Chairman Trevor Milton over many years. In e-mailed comments, a Nikola spokesperson pushed back on the report’s allegations, saying the company had been vetted by top companies and investors. Shares were down 10.5%. Shares of Quest Diagnostics Inc. DGX, +0.33% rose 3% after the health care diagnostics company raised its full-year outlook for profit and revenue. What are other markets doing? The yield on the 10-year Treasury note TMUBMUSD10Y, 0.777% fell 2 basis points to 0.68%, following a sale of longer-term bonds in the afternoon. Bond prices move inversely to yields. The ICE U.S. Dollar Index DXY, -0.58%, which tracks the performance of the greenback against its major rivals, was up 0.1%. Gold futures GCZ20, +2.17% rose 0.5% to settle at $1,954.20 an ounce, marking a third straight gain for the precious metal. The U.S. crude oil benchmark CL.1, -1.62% fell 75 cents, or 2%, to settle at $37.30 a barrel. The Stoxx Europe 600 index SXXP, +0.55% closed 0.6% lower, while the U.K.’s benchmark FTSE UKX, +0.64% lost 0.2%. In Asia, Hong Kong’s Hang Seng Index HSI, -0.30% and the Shanghai Composite Index SHCOMP, +1.67% both fell 0.6%, while Japan’s Nikkei NIK, -0.11% rose 0.9%."}]}