{"article": [{"url": "https://www.marketwatch.com/story/this-eye-opening-experience-has-me-rethinking-how-social-security-figures-into-my-retirement-planning-11598376840", "published": 1599324860.0, "headline": "This eye-opening experience has me rethinking how Social Security figures into my retirement planning", "body": "Getty Images/iStockphoto Our family’s goal was to achieve financial independence assuming we will have no Social Security benefits. Our full retirement ages are over two decades away, and cuts to the program seem likely. We decided to consider any benefits we may receive as a bonus and haven’t paid much attention to Social Security. I recently shared that I’ve been helping my parents with their finances as they transition into retirement. Seeing how valuable their Social Security payment is has been eye-opening. With a paid-off home and cars and a low tax-burden in retirement, they live a comfortable lifestyle with most of their expenses covered by their Social Security benefits and a very small pension. They need little money from their investment portfolio. This means they could have saved substantially less and retired sooner or spent substantially more on the way to retirement. Seeing this made me realize that ignoring Social Security can be an expensive mistake. So I sought out to answer three questions: What are our Social Security benefits as things stand today? What impact does retiring early have on future Social Security benefits? How should we incorporate uncertain future Social Security benefits into our financial projections? How you accumulate Social Security benefits Social Security calculates your benefit based on the average of your highest 35 years of earnings. You must have at least 10 years of earnings to qualify for Social Security retirement benefits. To better understand how you accumulate Social Security benefits and how retiring early impacts your benefits, it is important to understand the terms AIME, PIA, and bend points. AIME are your average indexed monthly earnings. Social Security adjusts your income for inflation that occurs over your working lifetime. For example, my first year of having taxed Social Security earnings was 1995. The $2,920 of income I earned cutting grass and making pizzas is currently worth over double that amount, $6,163, in 2020 dollars. You can find the inflation adjustment multipliers by year on the Social Security website. PIA is your primary insurance amount and is calculated based on your AIME over your highest-earning 35 years. The next important concept to understand is applying bend points to determine your retirement benefits. The concept of bend points is analogous to our progressive income tax system. It is designed to benefit lower earners more and be progressively less beneficial to higher earners. Up to the first bend point — $960 in 2020 — your income is replaced at 90% of your AIME. If your AIME is exactly $960, you will qualify for a monthly benefit of $864 at your full retirement age. AIME above the first bend point up to the second bend point — $5,785 in 2020 — is replaced at only 32%. For example, someone with a PIA of $1,960 would receive $1,184. Above the second bend point up to the maximal amount, income is replaced at only 15%.The impact of early retirement Retiring before accumulating 35 years of taxable earnings means having years of zero (or very low) taxed earnings factored into your average earnings. This will lower your AIME and PIA. How much you value these benefits is an individual decision that depends on what other assets you have to support you in retirement. How much confidence you have in the Social Security system remaining viable by the time you are eligible for benefits may also impact your decision. In any case, it is worth knowing where you stand with regards to accumulating Social Security benefits. Then you can make an educated decision.The difference between retiring early and claiming benefits early It is important to make a distinction between retiring early and claiming Social Security benefits early. Let’s focus on retiring early, meaning to stop earning or drastically reduce your taxable wages. This will impact the Social Security benefit you accumulate over your working lifetime if you have not yet accumulated 35 years of earnings. It will also impact you if you have accumulated 35 years of earnings and if the earnings you are forgoing later in life would be greater than the earnings you have already accumulated. Either scenario will decrease the average earnings compared to your potential top 35 years of earnings. Claiming Social Security benefits prior to your full retirement age is an entirely separate decision. Full retirement age is currently between 66 and 67 years of age depending on your date of birth. You may claim Social Security retirement benefits as early as age 62. This will reduce your monthly retirement benefit. Conversely, you can delay receiving benefits beyond your full retirement age. In this scenario, you will claim a larger monthly benefit when you do begin. Projecting your Social Security benefits You can obtain your estimated Social Security benefit by setting up an online account with “my Social Security.” You can then access your earnings records and estimated benefits on their website. When calculating your estimated benefits, Social Security assumes you will continue to work until your full retirement age. It projects future benefits based upon your earnings from the two most recent years. Therefore, the benefits you eventually receive may be more or less than the projections depending on your actual future earnings. Placing too much faith in your projected earnings probably isn’t wise. This is particularly true the further out you are from claiming benefits. Still, I’ve realized being ignorant and ignoring benefits you’ve earned isn’t a valid strategy either. Adjusting Social Security benefits for future rarnings On the “my Social Security” website, you can use the Retirement Calculator to experiment with the impact of different levels of ongoing income on your Social Security retirement benefits. My estimated benefit at full retirement age is $1,869 a month based on my 25 years of earnings between 1995 and 2019. Over the last two years, I’ve had very little income taxable by Social Security, totaling less than $6,000. I first changed the calculator to assume future earnings to be $0. This had almost no effect on my estimated benefit, lowering it to $1,852 a month. Entering $90,000 for future earnings raised my estimated benefit by almost $1,000 a month at full retirement age to $2,737. At first glance, this seems like a fair amount of money to leave on the table by retiring early. However, obtaining this level of benefit would require working full-time 19 more years. That would give me 10 more years to complete 35 years of earnings, plus replace the eight years on my earnings record when in college and early retirement when income was less than $10,000 a year, plus my first year of work as a physical therapist when I made only $22,500 working half a year. Next, I looked at the impact of working part-time in semi-retirement. I’ve recently written about how friendly the tax code is for semi-retirees who earn small amounts of income after leaving their careers. What is the impact of part-time work on Social Security benefits? If I made just $1,000 a month ($12,000 a year) in semi-retirement, my benefit at full retirement age would jump by over $100 a month from $1,869 to $1,981 a month. Making $2,000 per month ($24,000 a year) would increase my benefit to $2,144 a month.Determining your inflation-adjusted benefits One piece of information that is not clear from the Social Security site is where your PIA is relative to the bend points. This information is important to determine how impactful working longer would be on your future Social Security benefits. You can determine the relationship between your AIME and the bend points by multiplying your Taxed Social Security Earnings found in your Earnings Record by the inflation adjustment multiplier for each year. An easier way to do this is to enter your earnings record for each year into the Physician on FIRE Social Security calculator. It provides information that is hard to decipher directly from the “my Social Security” website, including the sum of your top 35 years of indexed earnings, your AIME, and whether you’ve reached the first and second bend points.The value of Social Security benefits Previously, we underestimated how valuable Social Security benefits could be. We have no way of knowing how the program will change in the future. So we just threw up our hands and ignored what Social Security benefits will mean for us. My wife Kim and I currently have similar earnings records. If we each get our benefits as projected, we would receive nearly $4,000 a month at our full retirement age. That would more or less cover our current living expenses. Our Social Security benefit is valuable, even if future benefits are substantially reduced. The program is popular enough that it’s unlikely to ever completely go away. We won’t ignore it in retirement calculations going forward. However, it is also widely known that Social Security is underfunded. Moving forward, we’ll pay a bit more attention to our benefits, checking them annually. When running retirement simulations, we’ll run multiple scenarios with 25%, 50%, 75% and 100% of our currently projected benefits. The 25% and 100% scenarios will represent our best guess at absolute worst and best-case scenarios. The 50% and 75% scenarios represent our best guess on the likely range of values of our future Social Security benefits based on our knowledge of it today. More on Social Security: Should we rethink how we tax Social Security benefits? Also: Brett Arends: The assault on Social Security is under way Chris Mamula retired from a career as a physical therapist at age 41. This is abridged from “How Does Retiring Early Impact Social Security Benefits?” You can read the full version on the blog “Can I Retire Yet?” Also from Chris Mamula: I followed the path to FIRE — and learned that early retirement is the wrong goal"}]}