{"article": [{"url": "https://www.marketwatch.com/story/government-whistleblower-who-alleged-white-house-coronavirus-failures-says-he-was-forced-out-01602080505", "published": 1602066560.0, "headline": "Government whistleblower who alleged White House coronavirus failures says he was forced out", "body": "In this image provided by Public Health Emergency, a department of Health and Human Services, Rick Bright is shown in his official photo on April 27, 2017, in Washington. Health and Human Services via AP WASHINGTON (AP) — A high-ranking government whistleblower who alleges the Trump administration fumbled its coronavirus response resigned Tuesday, saying he has been forced out. Lawyers for Dr. Rick Bright said he was sidelined at the National Institutes of Health, where he had been transferred this spring after being ousted as head of a biodefense agency. Attorneys Debra Katz and Lisa Banks said NIH superiors ignored a national coronavirus testing strategy that Bright developed because he had become politically toxic within the Trump administration. “NIH leadership declined to support Dr. Bright’s recommendations because of political considerations, plain and simple,” the lawyers said. “This was the proverbial straw that broke the camel’s back. He can no longer countenance working for an administration that puts politics over science to the great detriment of the American people.” There was no immediate response from the Department of Health and Human Services. Bright had filed a complaint with the Office of Special Counsel, a government agency that investigates whistleblower allegations. He added to his complaint Tuesday, saying his departure from the government comes under duress. Bright is an Ph.D. immunologist who formerly headed the Biomedical Advanced Research and Development Authority, an HHS agency that works to prepare the nation for such threats as a pandemic or a bioterrorism attack. That agency is now playing a central role in the campaign to deliver a coronavirus vaccine. Bright’s expertise is in vaccine development. Bright went public with his complaint in May, alleging he had been summarily removed as agency head because he resisted pressure to flood the New York area with hydroxychloroquine, the malaria drug that President Donald Trump was touting as a treatment for COVID-19. At the time, New York and New Jersey were experiencing the worst days of the virus outbreak and doctors had few treatments to offer desperately ill patients. The Food and Drug Administration ultimately revoked emergency authority for using the malaria drug to treat coronavirus patients. Bright also alleged that his early efforts to secure supplies of N95 respirator masks for health care workers were rebuffed by higher-ups at HHS, who saw him as an alarmist. Shortages of personal protective equipment have been an ongoing concern for hospitals and nursing homes. At the time, Trump dismissed Bright’s allegations as complaints from a “disgruntled employee.” Bright later testified before Congress that the U.S. continued to lack a fully developed strategy to battle the coronavirus, warning that the nation could face the “the darkest winter in modern history” if there is a resurgence. Criticism that Trump underestimated the the virus and failed to prepare the nation has become a central narrative in Democrat Joe Biden’s campaign to deny the president a second term. Some academics project that the death toll from COVID-19 could double by the beginning of next year, to around 400,000. Trump, infected with the coronavirus and hospitalized over the weekend, is now back at the White House. He has tweeted “Don’t be afraid of Covid,” adding: “Don’t let it dominate your life. We have developed, under the Trump Administration, some really great drugs & knowledge.” He says he plans to return to the campaign trail. Bright’s lawyers said the testing plan he developed, and his superiors rejected, emphasized screening for people who show no symptoms of COVID-19 but may be spreading it unwittingly, as well as a focus on Blacks, Latinos and other people who have borne a disproportionately high toll."}]}