{"article": [{"url": "https://www.marketwatch.com/story/with-clock-ticking-lawmakers-set-to-begin-fight-over-next-round-of-coronavirus-aid-11595017223", "published": 1595261180.0, "headline": "Republicans will start work in Senate on $1 trillion coronavirus relief package, Mnuchin says", "body": "Senate Majority Leader Mitch McConnell speaks to reporters following a weekly Senate Republican policy luncheon in June. Getty Images Let’s get ready to rumble. With lawmakers back in Washington after a two-week break, they are set for a frenetic two- or three-week sprint to pass the first big coronavirus aid bill since March, with implications for the fight against the pandemic but also for the November elections. While some things have changed since the $1.7 trillion CARES Act was signed into law March 27, others have not: Cases of COVID-19 continue to increase in many states and many businesses remain shuttered or only partially open. But while the CARES Act debate was largely conducted on the Republican home field of the Senate (the Democratic-held House having gone into recess), Democrats enter this next round publicly confident. Polls show sinking approval ratings for President Donald Trump and narrowing Senate races that increase the odds of a Democratic takeover. Things were already heating up Monday, as White House officials met with a group of Republican senators ahead of a lunch meeting Tuesday, with the full contingent of Senate Republicans to discuss a new bill Tuesday. After Monday’s meeting, Treasury Secretary Steven Mnuchin told a group of reporters that he and Mark Meadows, the White House chief of staff, had discussed money for reopening schools, among several issues. “Schools was a very big component,” he said. But Sen. John Thune, a South Dakota Republican, said there was resistance to one of the White House’s top priorities, a cut in the payroll tax. And he said Republican senators wanted more money for virus testing. “I think that’s a that’s gonna be a priority for our members, for sure. I think that if we’re going to open up schools and continue to try and open up businesses and everything else, then we’ve got to do a better job on testing,” Thune told reporters. House Speaker Nancy Pelosi earlier in the day had criticized Trump for reports that the administration wanted to block additional money for testing. “When we heard over the weekend that the White House was thinking about no more testing, that defied –- that goes beyond ignorance. It’s just beyond the pale. Hopefully, it was a mistake and they’ll back off it because it is so very wrong,” said Pelosi in a televised interview Monday morning. Earlier in the day, at the White House, Mnuchin had said Republicans will start negotiations with a trillion-dollar package. While that would be on top of the $2.4 trillion price tag for the first four coronavirus bills combined, according to the Congressional Budget Office, Pelosi said last week Democrats are sticking with their $3.4 trillion bill that passed the House in May as their opening bid. Senate Majority Leader Mitch McConnell has dismissed the Democrats’ “Heroes Act” as an expensive liberal wish list. Mnuchin said Monday’s negotiators aimed to wrap up talks by the end of the month, and the House is scheduled to leave for the annual August break July 31. Still, things could drag, as the Senate is not set to leave until the first week of August and House lawmakers have been warned they could stay past July 31. “I think you can anticipate this coming to a head in the next three weeks ,” McConnell said during a tour of southeastern Kentucky hospitals last week, according to the Corbin, Ky.-based News Journal. On Monday, McConnell has laid out the Senate GOP’s priorities as children, jobs and health care. That includes coronavirus-related legal liability protections for businesses, health-care providers and schools. “We don’t need an epidemic of lawsuits,” McConnell said at the White House. That issue, liability, and an add-on amount for jobless benefits that expire soon, are likely to be the two biggest sticking points ahead for lawmakers. Pelosi has pooh-poohed the idea of enhanced liability protections, saying instead businesses should be held to standards issued by the Occupational Safety and Health Administration. The unemployment add-on, now $600 a week added to the regular jobless benefit checks, will also be tough to resolve. In their bill, House Democrats would extend the add-on through Jan. 31, 2021, for most, with some unemployed able to claim it through March 31. Many Republicans say the $600 amount is too generous because in some cases an unemployed worker can receive more in benefits than they did at their lost job. But the add-on appears popular, with a recent poll by left-leaning Data for Progress and the Groundwork Collaborative showing 69% of those polled supporting renewal in order to avoid cutting people’s income, including 52% of Republicans. Paring back the add-on from $600 to a lower amount looks like a more likely tack for Republicans. Mnuchin has said one of the administration’s goals is to ensure any new add-on amount doesn’t provide more money than a worker’s old wage. The U.S. Chamber of Commerce proposed cutting back the amount to a maximum of $400 and also phasing it out on state-by-state basis, based on each state’s jobless rate, with the add-on falling to zero at 7%. Trump on Monday restated his desire to see a payroll tax cut in the next bill, even though it has rarely been mentioned by Republicans on Capitol Hill as a priority. “The payroll tax (cut) to me is very important,” Trump said. Democrats are putting up a unified front ahead of the talks. Senate Democratic leader Chuck Schumer told reporters on a conference call Friday, “The bottom line is we’re going to fight for the whole Heroes bill, period.” Not everything will be a hard-fought negotiation, though. The Paycheck Protection Program aimed at helping small businesses keep open by temporarily furloughing workers has been extended into early August and enjoys bipartisan support, though with differences on what tweaks should be made. Democrats, in their bill, proposed a second round of $1,200 stimulus checks to go to households, and the Trump administration has signaled it is open to the idea, though Republicans have talked about focusing aid on lower-income workers. And with school districts deciding whether to hold in-person classes, online ones or some combination as the school year begins, there is bipartisan support on Capitol Hill for money to help them reopen. “I don’t think it should be exclusively based on whether you’re back in a school room, or not. But I think there’s likely that some of the funding will relate to that because there are additional costs when you reopen these buildings,” Sen. Roy Blunt, a Missouri Republican, said Thursday. Even that, though, is a hardly a slam dunk. Trump has tweeted about the idea of withholding federal funds — which are usually a small part of school district budgets — unless they reopen. And Pelosi said the $100 billion included in the House bill is probably inadequate. “We probably will need more money,” she said."}]}