{"article": [{"url": "https://www.marketwatch.com/story/these-are-some-of-retirees-biggest-regrets-2020-02-03", "published": 1592062880.0, "headline": "5 things youâ\u0080\u0099ll wish you knew before you retired", "body": "This article is reprinted by permission from NerdWallet. Most retirees regret not saving more. A 2018 study by Transamerica Center for Retirement Studies found 73% wish theyâ\u0080\u0099d put aside more money on a consistent basis, and half felt they waited too long to get serious about retirement saving. But retirement is about more than the balance in your 401(k).Â Even people with sizable nest eggs can wishÂ they handled certain aspects of retirement differently. Hoping to learn from othersâ\u0080\u0099 mistakes, I asked advisers with the Financial Planning Association and the Alliance of Comprehensive Planners to share their clientsâ\u0080\u0099 biggest regrets about retirement. Thirty-one advisers responded, and their answers revealed some common themes. Among them:â\u0080\u0098I wish we had traveled more while we couldâ\u0080\u0099 All too often, health issues derail peopleâ\u0080\u0099s travel plans, says certified financial planner Serina Shyu of Atlanta. They donâ\u0080\u0099t get around to taking that dream trip or get to see as many places as theyâ\u0080\u0099d hoped. Even homebodies regret missed chances to see loved ones. â\u0080\u009cAnother version is where the health issue isnâ\u0080\u0099t [the retireeâ\u0080\u0099s]. â\u0080\u0098I wish we had gone to see so-and-so,â\u0080\u0099â\u0080\u009d says CFP Daniel B. Moisand of Melbourne, Florida. â\u0080\u009cSometimes we wait to reconnect with friends or family and that person dies or suffers a stroke or dementia.â\u0080\u009d Financial plannersÂ can help people get clarity about how much money they can safely spend in retirement. CFP Linda Y. Leitz of Colorado Springs, Colorado, says sheâ\u0080\u0099s been able to reassure several clients so they could get started on their bucket lists. â\u0080\u009cAs they aged and either had health concerns or just didnâ\u0080\u0099t enjoy being away from home as much, they all were really glad that they traveled,â\u0080\u009d Leitz says. â\u0080\u009cThey donâ\u0080\u0099t mind cutting back in later years because they had done the things that were important to them, early in retirement, while they could enjoy them.â\u0080\u009dâ\u0080\u0098I wish Iâ\u0080\u0099d had something to retire toâ\u0080\u0099 People can be so tired of working, or sick of their particular job, that theyÂ retireÂ at the first opportunity without thinking through how they will spend their time. Many struggle to replace the structure, meaning and purpose their work provided. Also on MarketWatch: Retiree warning: History suggests weâ\u0080\u0099re overdue for a bear market â\u0080\u009cThey look back five or six years after they have retired to realize the time has flown by and they have not done anything,â\u0080\u009d says CFP Jonathan P. Bednar of Knoxville, Tennessee. CFP Jennifer Weber of Lake Success, New York, counsels her clients to think about â\u0080\u009chow to spend their days with meaning.â\u0080\u009d That could mean a part-time job, consulting gigs, volunteering or spending more time with friends and family, she says.â\u0080\u0098I wish I had more friendsâ\u0080\u0099 Something else work provides: social contact. People often donâ\u0080\u0099t realize how much social interaction their workplace provides, says CFP Patti B. Black of Birmingham, Alabama. Black recommends volunteer groups, clubs and classes as potential sources of new friends. â\u0080\u009cPeople may feel â\u0080\u0098out of the loopâ\u0080\u0099 in retirement,â\u0080\u009d Black says. â\u0080\u009cIt takes time and effort to find a new tribe.â\u0080\u009dâ\u0080\u0098I wish we hadnâ\u0080\u0099t bought that houseâ\u0080\u0099 CFP Kevin M. Oâ\u0080\u0099Brien of Northborough, Massachusetts, says some of his clientsâ\u0080\u0099 retirement home purchases triggered serious buyerâ\u0080\u0099s remorse. The clients hadnâ\u0080\u0099t spent enough time in the community before buying, and now wish they lived somewhere else. The cost and stress of changing homes is usually significant. Although moving may be the right choice, no one should buy a retirement home in haste, Oâ\u0080\u0099Brien says. See: The No. 1 thing people with fat savings accounts scrimp on that you likely donâ\u0080\u0099t â\u0080\u009cRetirees should rent in areas theyâ\u0080\u0099re interested in retiring to before making a major purchase,â\u0080\u009d Oâ\u0080\u0099Brien says.â\u0080\u0098I wish weâ\u0080\u0099d talked about our expectations for retirementâ\u0080\u0099 Itâ\u0080\u0099s not uncommon for spouses to have dramatically different visions of retirement. Oâ\u0080\u0099Brien has advised couples where one spouse was thrilled to be the grandkidsâ\u0080\u0099 child care provider while the other longed to travel and be more spontaneous. â\u0080\u009cThey canâ\u0080\u0099t just up and go because they are relied on to watch the grandchildren,â\u0080\u009d Oâ\u0080\u0099Brien says. Different expectations can cause serious ruptures in relationships, and they may be among the reasons why divorce rates for people 55 and older have more than doubled since 1990 even as the overall divorce rate subsides, Black says. Black urges spouses to discuss how they will spend their time, including how the division of household chores might change and even whether theyâ\u0080\u0099ll have lunch together every day. As with so many other aspects of marriage, the willingness to talk through disagreements and find compromises is essential, she says. â\u0080\u009cRetirement is a major life transition, and you have to be patient with yourself and your spouse,â\u0080\u009d Black says.More from NerdWallet: 4 Things to Know if Youâ\u0080\u0099ve Never Budgeted Before Donâ\u0080\u0099t Shop This Way in 2020 Equifax Breach: Claims Cutoff and More Scammers Ahead Liz Weston is a writer at NerdWallet. Email: lweston@nerdwallet.com. Twitter: @lizweston."}]}