{"article": [{"url": "https://www.marketwatch.com/story/here-are-the-biggest-stock-market-bets-among-institutional-and-retail-investors-ranked-2020-06-09", "published": 1592039780.0, "headline": "Here are the biggest stock-market bets among institutional and retail investors, ranked", "body": "There’s a pretty big gulf between how professional investors manage money and the bets made by average people. Like many things, it may have been amplified by the upside-down nature of markets and the economy in the wake of the coronavirus shock — or not. The chart above shows the top five most widely-held stocks by each class of investor; a fuller table, showing the top ten, is below. There are some fairly clear themes. Retail investors are either betting that air travel is going to come back, in a big way, or they're simply picking the stocks that have lost the most value, by some metric, during the global lockdown. Institutional investors, in contrast, are betting on electronic back-office products, particularly payments. What can we learn from these preferences? It’s hard to say but, as DataTrek co-founder Jessica Rabe pointed out in a research note out Tuesday, it’s pretty clear this cadre of individual investors, taken from account activity at online brokerage Robinhood, which is favored by millennials, isn’t prioritizing clean energy investments. “The lack of environmental, social and governance (ESG) friendly names at the top of the Robinhood leaderboard contrasts with the notion that millennials will only back companies that align with those characteristics,” Rabe wrote. “For example, the number of accounts that invested in Ford has doubled since mid-March, while those for American Airlines, Delta and United grew by 8.7x, 9.7x and 14.2x respectively.” See also:This unlikely stock is the biggest winner since the February market top And what to make of the preferences among institutional players? Payments companies won’t be as much in demand in a slowing economy, when consumer spending falls, so it might be seen as a macro bet on an improving landscape. On the other hand, many investors believe the coronavirus episode hastened a technological shift across the global economy. The companies that dominate the electronic payments industry may simply benefit from picking up a bigger share of those transactions. Institutional investors Retail investors Visa Inc. F, -1.36% Ford Motor Co. F, -1.36% Adobe Inc. ADBE, +2.30% General Electric GE, +2.85% Mastercard Inc. MA, +2.09% American Airlines Group Inc. AAL, +0.34% Alphabet Inc. Class A GOOGL, +1.82% Delta Airlines Inc. DAL, +0.39% PayPal Holdings Inc. PYPL, +2.18% Walt Disney Co. DIS, +1.53% salesforce.com Inc. CRM, +2.21% Carnival Corp. CCL, +0.51% Microsoft Corp. MSFT, +2.48% GoPro Inc. GPRO, -0.48% Alibaba Group Holding Ltd. BABA, -0.26% Aurora Cannabis Inc. ACB, -1.37% UnitedHealth Group Inc. UNH, +1.68% Microsoft Corp. MSFT, +2.48% Charter Communications, Inc. CHTR, +1.04% Apple Inc. AAPL, +1.74% Source: UBS Source: Robintrack One notable spot of overlap: Microsoft Corp. makes both lists. One notable contrast: Apple Inc., which comes in at number ten on the Robintrack list of retail investor account holdings, is the single largest underweight among institutional investors, according to UBS’ calculations. Related:These 2 stocks dominated S&P 500 returns in 2019 — and the decade"}]}