{"article": [{"url": "https://www.marketwatch.com/story/thanks-a-lot-covid-bummed-out-boomers-feel-cheated-out-of-retirement-years-2020-09-29", "published": 1601737460.0, "headline": "â\u0080\u0098Thanks a lot, COVID!â\u0080\u0099 Bummed-out boomers feel cheated out of retirement years", "body": "This article is reprinted by permission from NextAvenue.org. It is part ofÂ The Coronavirus Outbreak: What You Need To Know Special Report â\u0080\u009cThese are supposed to be the best years of my life,â\u0080\u009d says Matt, 64, an account manager for a telecom company in the suburbs of Denver (he prefers not to include his last name for this story). â\u0080\u009cIâ\u0080\u0099ve been working like a dog for decades, got the kids through college, then saw my marriage fizzle. Now here I am, almost ready to retire, buy the convertible and start dating with a vengeance, and itâ\u0080\u0099s all going up in smoke. Thanks a lot, COVID!â\u0080\u009d This ire is going around as some boomers see their anticipated next stage of life evaporate asÂ the pandemicÂ continues to have the globe in its grip. Of course, those lucky enough to escape the virus are very grateful for their good health. But as the days, weeks, months and now seasons of being on â\u0080\u009cpauseâ\u0080\u009d unfurl, many of those at midlife and later have had it up to here â\u0080\u0094 and then some. Feelings of frustration and even anger can be hard to overcome if your â\u0080\u009cprime timeâ\u0080\u009d gets twisted like a pretzel. A key factor: Time is of the essence. â\u0080\u009cThe pandemic has brought about a lot of disappointment and changes. Many boomers may feel cheated as expectations for these years and retirement have been upended,â\u0080\u009d says Caroline Atterton, lead therapist for the senior intensive outpatient program at San Diegoâ\u0080\u0099s Sharp Mesa Vista Hospital. â\u0080\u009cBecause the time ahead is limited, there may be a sense of urgency about the need â\u0080\u0098to get on with itâ\u0080\u0099 and do those things that the pre-retirement years made it difficult to do. COVID-19 forces them into a sedentary lifestyle that contradicts those plans.â\u0080\u009d “ I have a friend, Tosia, whoâ\u0080\u0099s a Holocaust survivor now in her 90s. I think what she saw â\u0080\u0094 gunfire, bombs, fires, murder â\u0080\u0094 is worse than staying inside due to coronavirus. Comparatively speaking, this pandemic is perhaps not as horrible. And this too shall end.â\u0080\u009d ” â\u0080\u0094 Dr. Melvin Konner, professor of anthropology, neuroscience and behavioral biology at Emory University This sense of now or never even has a name. â\u0080\u009cAround midlife, we experience whatâ\u0080\u0099s known as a â\u0080\u0098shift in time perspective,â\u0080\u0099 which means we begin to think about the time we have between this moment and the end of life. We start to realize that life is finite and that opportunities for a do-over are less likely,â\u0080\u009d explains Suzanne Degges-White, author and chair of the department of counseling and higher education at the College of Education, Northern Illinois University.Loss of family time and togetherness At this age, a personâ\u0080\u0099s hopes and plans may be treasured, whether they involveÂ bucket-list travelÂ or favorite Friday-night plans. Flora Hanft, of Long Island, loved the life she had constructed pre-COVID-19, and misses activities like visits to local art galleries with her husband. As she says, â\u0080\u009cNow my days are all the same and â\u0080\u0094 like my COVID outfits â\u0080\u0094 shapeless.â\u0080\u009d For others, the most angst-ridden aspect to the pandemic is the loss of family time and togetherness as the generations grow. â\u0080\u009cI was so excited for the arrival of my first grandchild,â\u0080\u009d says Dr. Sharon Wager, a geriatric and hospice physician who lives near Houston. â\u0080\u009cKinsley was born on February 12, and maybe two weeks later, I had my first COVID-19 patient. I felt unsafe personally and worried about spreading the virus,â\u0080\u009d she says. â\u0080\u009cI didnâ\u0080\u0099t see my new granddaughter until June, and then from a distance â\u0080\u0094 no hugging, no kissing.Â I want to hold and snuggle my own sweet grandchild.Â I feel as if being a part of Kinsleyâ\u0080\u0099s early life has been stolen from me.â\u0080\u009dSampling an isolated life While the coronavirus has deeply altered the way all people are living, itâ\u0080\u0099s dealt some in the older generation an especially ferocious wallop. If youâ\u0080\u0099re over 50, you know the fear some younger people have of being within a mile of you. No one wants to be the â\u0080\u009cvirus vectorâ\u0080\u009d that lands you in the hospital. Also see: We want a diverse area with moderate population, warm, beach and culture â\u0080\u0094 so where should we retire? Many,Â manyÂ boomers have received pleading phone calls from their adult children begging them to stay inside 24/7, for fear that they may contract COVID-19 and have it prove fatal. â\u0080\u009cI might as well be a hundred and four versus my real age of 64,â\u0080\u009d says Matt. â\u0080\u009cI almost never leave the house.â\u0080\u009d Boomers have been contemplating the joys of continuing their illusion of agelessness, says Hanft. â\u0080\u009cThe virus doesnâ\u0080\u0099t just restrict their freedom and dreams, but it has codified ageism by calling out that boomers are in the high-risk group,â\u0080\u009d she notes. â\u0080\u009cThis sets back decades of baseball-cap-wearing age denial.â\u0080\u009dDealing with the disappointment The pandemic also amplifies another crummy aspect of growing older: The feeling that youâ\u0080\u0099re no longer in full command. â\u0080\u009cAging can bring a lot of new challenges that are not always expected,â\u0080\u009d says Atterton. â\u0080\u009cIt can be difficult to cope when things do not always turn out as we had planned. This gives rise to feelings of not being in control, which is a source of anxiety.â\u0080\u009d COVID-19 has intensified that exponentially: An invisible enemy is lurking out there and could strike at any moment. If that doesnâ\u0080\u0099t rob people of their sense of agency, what would? In this situation, denial is not your friend: Distracting yourself from the core issue wonâ\u0080\u0099t work (try as you may to watch every possible procedural drama on Netflix NFLX, +1.43% Â ). â\u0080\u009cItâ\u0080\u0099s important to acknowledge and understand oneâ\u0080\u0099s feelings. It makes sense to feel hurt, sad, or cheated. The more one minimizes or pushes these emotions away, the more those unresolved feelings will impact how we feel about ourselves and how we behave,â\u0080\u009d explains Atterton. â\u0080\u009cWe might think, â\u0080\u0098This is never going to endâ\u0080\u0099 or â\u0080\u0098Things will never be as they once were,â\u0080\u0099 making it difficult to see other alternatives.â\u0080\u009d So. Step One is to check in with yourself and accept that, yes, this is a really,Â reallyÂ bad moment thatâ\u0080\u0099s derailing your plans. Sit with that and stop trying to push it away.Try three little words: â\u0080\u0098compared to what?â\u0080\u0099 Dr. Melvin Konner, the Samuel Candler Dobbs professor of anthropology and of neuroscience and behavioral biology at Emory University, says that â\u0080\u0094 next to â\u0080\u009cI love youâ\u0080\u009d â\u0080\u0094 the most important words we can use in this life are: â\u0080\u009cCompared to what?â\u0080\u009d Yes, things may be terrible, but frame it in terms of what past generations have experienced; there is always hardship. â\u0080\u009cUnlike our parentsâ\u0080\u0099 generation, we didnâ\u0080\u0099t live through the Great Depression, nor did we fight fascism to make sure democracy had a future. I have a friend, Tosia, whoâ\u0080\u0099s a Holocaust survivor now in her 90s,â\u0080\u009d Konner says. â\u0080\u009cI think what she saw â\u0080\u0094 gunfire, bombs, fires, murder â\u0080\u0094 is worse than staying inside due to coronavirus. Comparatively speaking, this pandemic is perhaps not as horrible. And this too shall end.â\u0080\u009d Read: Social Security missteps could push millions of elderly Americans into poverty If youâ\u0080\u0099re close to someone who is bemoaning their â\u0080\u009ccheatedâ\u0080\u009d status, you can help them re-spin that viewpoint with this technique from Degges-White: â\u0080\u009cWhen someone is doing a â\u0080\u0098Yes, butâ\u0080\u0099 response, such as, â\u0080\u0098Yes, I could use Zoom ZM, +2.89% Â , but thatâ\u0080\u0099s not the same,â\u0080\u0099 they should be met with a â\u0080\u0098Yes, butâ\u0080\u0099 that counters their perspective: â\u0080\u0098Yes, Zoom isnâ\u0080\u0099t the same, butÂ itâ\u0080\u0099s a great way to hear and see your grandchildren,â\u0080\u0099 or â\u0080\u009cYes, itâ\u0080\u0099s lonely not being able to visit friends, but itâ\u0080\u0099s important that you not only care for your own health, but that of others, too.â\u0080\u009d Or try it on yourself as a self-talk trick.Donâ\u0080\u0099t wallow in frustration Atterton suggests giving yourself some vigorous pep talks when cries of â\u0080\u009cUnfair!â\u0080\u009d well up inside you. â\u0080\u009cWe can practice self-compassion. Be gentle with yourself and cheer yourself on! Tell yourself, â\u0080\u0098I am taking good care of myself during this difficult time. Even though things are not right now, I am going to get through this,â\u0080\u0099â\u0080\u009d she says. â\u0080\u009cOne can also treat the pandemic as an opportunity. Now is the time to learn something new â\u0080\u0094 a new language or yoga â\u0080\u0094 or read more.â\u0080\u009d Atterton also advises people to stay social, even though we must physically distance. â\u0080\u009cPhone or FaceTime with friends and family,â\u0080\u009d she advises. â\u0080\u009cRemember, loneliness and depression in older adults go hand-in-hand. Relationships are of paramount importance here. They lead to increased physical and emotional well-being and improved quality of life.â\u0080\u009d Wager has found that while technology is no substitute for cradling her granddaughter, it does allow for easy contact. â\u0080\u009cMy daughter and I use the Alexa and Tinybeans apps to keep close,â\u0080\u009d she says. Digital tools are also a source of connection for Hanft, who misses her art gallery outings. â\u0080\u009cI am wonkily drawn toÂ virtual museum tours. The technology is getting better, and you can have a glass of wine during the tour â\u0080\u0094 in my case, a Kir â\u0080\u0094 rather than in the overpriced cafe afterwards,â\u0080\u009d she says. â\u0080\u009cAnd I love the virtual piano concertsÂ our friend Michael GarinÂ is doing via Facebook FB, +0.26% Â twice a week.â\u0080\u009d Also see: Americansâ\u0080\u0099 love affair with pickup trucks might be derailing their retirement plansChin up for the younger ones Thinking of others will also help defuse the full brunt of COVID-19 frustration. â\u0080\u009cAs angry as I am about what COVID has done to my life,â\u0080\u009d says Matt, â\u0080\u009cI feel worse for my kids who are just launching their adult lives. I try to be very encouraging when talking to them. I had the freewheeling fun days that they are missing. It feels good to step out of my anger and support them.â\u0080\u009d Konner echoes that as well. Having just turned 74, he says he is glad he is still teaching: â\u0080\u009cThough there are things I would love to do in retirement, I am glad I am connected to young people â\u0080\u0094 they need us to give them perspective, to help them know that their lives will get back on track. I like to remind them if they do the right thing now, one day soon theyâ\u0080\u0099ll be telling stories about surviving the pandemic of 2020.â\u0080\u009d Donâ\u0080\u0099t all of us look forward to those bragging rights? Janet Siroto is an NYC-based journalist and content strategist who specializes in lifestyle, wellness and consumer-trend topics, as well as personal essays. This article is reprinted by permission from NextAvenue.org, Â© 2020 Twin Cities Public Television, Inc. All rights reserved."}]}