{"article": [{"url": "https://www.marketwatch.com/story/biden-says-death-of-justice-ginsburg-highlights-threats-to-us-health-care-2020-09-20", "published": 1600628480.0, "headline": "Biden says death of Justice Ginsburg highlights threats to U.S. health care", "body": "PHILADELPHIA (AP) — Joe Biden on Sunday used the sudden Supreme Court vacancy to reinforce his argument that the upcoming election should be a referendum on President Donald Trump’s handling of health care and the coronavirus. “ The Supreme Court will hear a Republican-led case seeking to throw out the Affordable Care Act, which the Trump administration supports, the week after the Nov. 3 election, and could also hear cases on other salient issues in the next few months, such as voting rights, and potentially even determine a winner of the November presidential election. ” The death on Friday of Justice Ruth Bader Ginsburg jolted the presidential campaign just six weeks before the election and as several states are already voting. Trump has seized on the opportunity to nominate a new justice to motivate his most loyal voters. Biden kept the focus on health care, which has proven to be a winning issue for Democrats during previous elections and could be even more resonant amid the pandemic. The Supreme Court will hear a Republican-led case seeking to throw out the Affordable Care Act, which the Trump administration supports, the week after the Nov. 3 election. Biden charged that Trump is seeking to undermine the protections for people with pre-existing conditions under the ACA, as well as its provisions covering preventative care for women. “Millions of Americans are voting because they know their health care hangs in the balance,” Biden said during remarks at Constitution Center in Philadelphia. “In the middle of the worst global health crisis in living memory, Donald Trump is before the Supreme Court, trying to strip health care coverage away from tens of millions of families.” The Supreme Court could also hear cases on a few more particularly salient issues in the next few months: voting rights, and potentially who wins the November election. Biden is expected to focus in the weeks ahead on the Democratic fight to prevent a nominee from being confirmed to the court, with a particular emphasis on the effect the court could have on health care and climate change. Biden aides stopped short of ruling out the possibility the campaign would advertise around the court fight, though that decision hadn’t been finalized. Trump is promising to put forth a nominee this coming week and Senate Majority Leader Mitch McConnell, R-Ky., has vowed to call a vote. “In a raw political move, this president and the Republican leader have decided to jam a lifetime appointment to the Supreme Court through the United States Senate,” Biden said. “That’s the last thing we need at this moment.” Biden is still not, however, planning to release a list of potential Supreme Court nominees, because putting out a full list, the aide said, would further politicize the court and the nomination process, aides said. Biden’s aides said those interested in his thinking on a justice can look to his long history as chairman of the Senate Judiciary Committee for guidance. Their refusal to put names to Biden’s potential court pick underscores the political peril that the Supreme Court debate holds for Biden. Conservatives are still energized by the issue, and putting out names could offer Trump and his allies a list of bogeymen to use against Biden to rev up his base. Trump himself, at a rally Saturday night, basked in chants of “fill that seat” from the audience, and has pledged to move quickly on a nominee, whom he says will be a woman. Indeed, the Supreme Court has traditionally been seen as a major motivator for conservative voters, for its significance to hot-button social issues like gay rights and abortion. But in recent years, following the contentious confirmation fight over Supreme Court Justice Brett Kavanaugh and a number of high-profile rulings on the Affordable Care Act, polls suggest the issue is becoming more salient for Democrats. A Pew Research Center poll conducted in August suggested a comparable number of Biden and Trump voters view the appointment of Supreme Court justices as “very important” to their vote. While Biden’s aides acknowledge that the issue is still significant for conservatives, they believe it could be a winning one for their campaign, potentially driving support among undecided moderates, young voters and women, who may be energized in particular by the continued legal attacks on abortion rights. They point to the massive fundraising numbers seen for Democrats online — $91.4 million processed through Democratic fundraising engine ActBlue from Friday night through Saturday — as further evidence of the base enthusiasm around the issue. “So, I think in that sense, the vacancy will really sharpen the focus on the stakes in this election when it comes to life and death and the health of Americans,” Sen. Tim Kaine, a Virginia Democrat who was Hillary Clinton’s running mate in 2016, said Sunday. Key Words:Bill Gates says Trump’s partial travel ban made the coronavirus pandemic worse"}]}