{"article": [{"url": "https://www.marketwatch.com/story/gold-prices-perk-up-after-thursdays-stock-selloff-but-set-for-sharply-weekly-drop-2020-09-04", "published": 1599229340.0, "headline": "Gold down a third straight session to post a 2% weekly loss", "body": "Gold futures ended lower for a third straight session on Friday, logging a weekly loss of around 2%, as better-than-expected monthly U.S. employment data helped to strengthen the U.S. dollar. The U.S. jobs report is “a net positive for the economy” and the unemployment rate, still high at 8.4%, is “trending in right direction,” said Jeff Wright, executive vice president of GoldMining Inc. The U.S. regained 1.4 million jobs in August and the unemployment rate posted a surprisingly large decline to 8.4% from 10.2%, marking a fourth straight decline. “In regards to gold, [the jobs report] is a double negative,” Wright told MarketWatch. The data provided a boost to the dollar, which can pressure prices for dollar-denominated gold, and also does not push the Trump administration toward another relief deal, which would be supportive of gold prices through additional fiscal stimulus, he said. The ICE U.S. Dollar Index DXY, -0.58% was trading 0.5% higher for the week. December gold GCZ20, +2.17% GC00, +2.17% fell by $3.50, or 0.2%, to settle at $1,934.30 an ounce, the lowest finish for a most-active contract since Aug. 27, according to FactSet data. December silver SIZ20, +5.96% SI00, +5.96%, meanwhile, declined by 16 cents, or 0.6%, at $26.712, an ounce, following a 1.9% decline in the previous session. For the week, gold saw a 2.1% weekly fall, according to FactSet data, while silver logged a 3.3% drop from last Friday’s most-active contract settlements. In a market update, Naeem Aslam, chief market analyst at AvaTrade, said the jobs data “wasn’t about the [Federal Reserve] shifting its stance on the monetary policy” and instead, was “more about fiscal help in terms of the second stimulus.” He believes the data “confirmed that we still need more help on the fiscal side.” The “absence of fiscal help means more layoffs in the coming weeks and possibly higher bankruptcies,” Aslam said. The moves for precious metals come as investors have unwound bullish bets in equities and repositioned their overall portfolios amid expectations for further turbulence in financial markets. Stocks erased their gains for the week, which may have sent some traders scrambling to cover losses by selling other assets, including gold. In One Chart:Tech stocks and the rest of the market are both very expensive -- but for very different reasons The economy will “need to see continued strength in the months ahead to make the FOMC believe the recovery in the jobs market is sustainable,” said Fawad Razaqzada, market analyst at ThinkMarkets. However, this “alone won’t cut it—not when many economists agree that the pace of hiring will slow down in the months ahead, with the potential for the economy to dip again as the impact of past government stimulus wanes.” Given that, Razaqzada believes “monetary policy will likely remain loose for an extended period of time” and gold should “remain fundamentally supported in the long-term.” Short term, some weakness for gold cannot be ruled out, he said in a note. Elsewhere on Comex, December copper HGZ20, +1.38% settled at $3.062 a pound, up 2.9% on Friday, with most-active contract prices up around 1.4% for the week. October platinum PLV20, +3.99% rose 1% to $898.20 an ounce, ending nearly 4.5% lower for the week, while December palladium PAZ20, +2.31% added 0.9% to $2,343.20 an ounce, for a weekly rise of 5%. “It is possible that palladium is once again being seen as an attractive alternative to gold considering its general precious metals classification,” analysts at Zaner Metals wrote in a daily report. “However, it is more likely that palladium is being lifted because the ongoing recovery in China is starting to foster chatter than Chinese auto sales have turned up thereby increasing auto catalyst demand.”"}]}