{"article": [{"url": "https://www.marketwatch.com/story/welcome-to-new-york-dont-you-dare-go-outside-2020-09-09", "published": 1599657920.0, "headline": "Welcome to New York! Donâ\u0080\u0099t you dare go outside!", "body": "â\u0080\u009cNobody asked me to fill out anything.â\u0080\u009d Roberto Gonzalvo, 33, had just stepped off Peter Pan 8733, the afternoon nonstop from Baltimore. He was still adjusting his eyes to the harsh fluorescent glare of New York Cityâ\u0080\u0099s Port Authority Bus Terminal and about to ride the A train to his cousinâ\u0080\u0099s apartment in Washington Heights. â\u0080\u009cI gave the man my ticket and that was it.â\u0080\u009d He might have gotten in just under the wire. This was a few hours after Mayor Bill de Blasio and Gov. Andrew Cuomo announced â\u0080\u0094 separately, of course â\u0080\u0094 their latest efforts to shore up New Yorkâ\u0080\u0099s defenses against the coronavirus. Though the stateâ\u0080\u0099s infection rate has remained below 1% for a month and counting, things arenâ\u0080\u0099t going nearly so well in many other places. And that has New York officials glancing warily across the map. On Tuesday, Cuomo said that Maryland and three other eastern states â\u0080\u0094 Delaware, Ohio and West Virginia â\u0080\u0094 were being added to the quarantine list, meaning that anyone arriving from any of those places is supposed to remain isolated for 14 days before stepping outside in New York. Gonzalvo sounded surprised when he heard that. â\u0080\u009cIt includes Maryland? Are you sure?â\u0080\u009d It does now. Itâ\u0080\u0099s 34 states in all, including a lot of places that traveling New Yorkers used to like to go. Sure puts a damper on those spontaneous jaunts to Miami or Vegas or New Orleans, the current legal requirement to self-isolate for two weeks after returning to New York. Meanwhile, three former COVID-19 hot spots â\u0080\u0094 Washington, Oregon and Arizona â\u0080\u0094 have managed to earn their way off the bad list. So feel free to book a flight to Portland, Oregon, for some peace and quiet. Or maybe not. But give the Oregon city this much credit: After more than 100 days of protests and street violence over policing practices, the positivity rate is 4.8%, well below the 10% quarantine threshold. Coronavirus update: Global death toll edges toward 900,000 as AstraZeneca halts vaccine trial after patient struck by illness The whole point is to keep New Yorkâ\u0080\u0099s infection rate where it is or send it even lower, and the test data rules. â\u0080\u009cThe infection rate is a pure function of what New Yorkers are doing,â\u0080\u009d Cuomo told reporters at his office in Manhattan on Tuesday, a refrain heâ\u0080\u0099s been sounding for months. So can all this quarantining possibly be enforced? Canâ\u0080\u0099t people just come and fade into the New York crowd? The massive numbers seem to say, â\u0080\u009cWell, duh!â\u0080\u009d Travel is still down because of the virus, but just by way of comparison: The Port Authority terminal counted 8,000 buses on an average weekday last year. To that total, add the 290,000 vehicles that crossed from New Jersey into New York City per day, on the George Washington Bridge, Lincoln Tunnel, Holland Tunnel, Goethals Bridge, Outerbridge Crossing and Bayonne Bridge. And then there are the airports, Amtrak, the commuter rail lines, the ferries and â\u0080\u0094 well, itâ\u0080\u0099s a lot of people to notify on their way into New York. And some of them may not even know the latest wrinkles in the rules, as at least one Port Authority arrivee seemed not to on Tuesday. For his part, de Blasio said that he was expecting universal voluntary compliance. But just in case, he was sending New York City sheriffâ\u0080\u0099s deputies to provide â\u0080\u009ceducationalâ\u0080\u009d presentations on interstate buses and remind everyone of the potential $2,000 fines. Riders on those buses, he said, will be asked to fill out forms detailing where theyâ\u0080\u0099ve been, as well as their contact information and quarantine plans while in New York. â\u0080\u009cThis is so important to keeping us safe,â\u0080\u009d de Blasio has emphasized. The efforts donâ\u0080\u0099t stop there. Last month, the city ordered hotels and short-term rentals to require visitors to complete quarantine forms at check-in. Again, universal voluntary compliance is the hoped-for result with fines â\u0080\u0094 and even potential arrest â\u0080\u0094 for those who loudly refuse to comply or whose noncompliance causes harm. One Brooklyn couple was hauled off an NYC Ferry in handcuffs over the weekend at Brooklyn Bridge Park when they refused the captainâ\u0080\u0099s request to wear face masks. Also see: Why an approved coronavirus vaccine may not end the pandemic quickly But when the numbers are this large, city and state officials really have no choice but to lean on moral persuasion. In fact, most people seem inclined to cooperate, even if a few never will. At the Port Authorityâ\u0080\u0099s north terminal, most people were wearing face masks. Though the crowds at the terminal are noticeably larger than even a week or two ago, they are still down from a normal early September. â\u0080\u009cWhat exactly am I supposed to do?â\u0080\u009d Roberto Gonzalvo asked before he headed off to the subway. â\u0080\u009cStay in the apartment for two weeks?â\u0080\u009d He didnâ\u0080\u0099t say one way or another whether heâ\u0080\u0099d be meeting that requirement. But he did keep his black face mask across his mouth and his nose as he walked toward the Eighth Avenue trains. Ellis Henican is an author based in New York City and a former newspaper columnist."}]}