{"article": [{"url": "https://www.marketwatch.com/story/we-have-a-chance-to-change-the-course-of-history-kamala-harris-accepts-democratic-vice-presidential-nomination-2020-08-19", "published": 1597886420.0, "headline": "'We have a chance to change the course of history' - Kamala Harris accepts Democratic vice-presidential nomination", "body": "Sen. Kamala Harris accepted the Democratic Party's vice-presidential nomination in a deeply personal speech on Wednesday, stressing her upbringing by immigrant parents and outlining a vision to join Joe Biden in defeating President Donald Trump in November's election. Speaking live from the Chase Center in Wilmington, Del., Harris wove between her own biography, her partnership with Biden and searing criticism of Trump, who she said was guilty of a \"failure of leadership.\" \"We are a nation that's grieving. Grieving the loss of life, the loss of jobs, the loss of opportunities, the loss of normalcy. And yes, the loss of certainty,\" she said, invoking the coronavirus pandemic. Harris, a California senator who ran against Biden in the Democratic primaries, is the first Black woman and first person of Indian descent on a major party's ticket. \"In this election, we have a chance to change the course of history,\" Harris said. \"We're all in this fight. You, me and Joe - together.\" Read: The full text of Kamala Harris's speech to the Democratic convention Biden will speak from the same venue on Thursday night during the final evening of the convention. Biden announced Harris as his running mate on Aug. 11, choosing her over other contenders including Sen. Elizabeth Warren and former national-security adviser Susan Rice. Some on Wall Street DJIA, +0.56%  were relieved Harris was chosen over more liberal candidates like Warren, who has called for tighter rules on banks. Now read:Here's what Kamala Harris means and doesn't mean for financial markets. Still, some see Biden's pick of Harris as \"modestly negative\" for financials XLF, +0.11%, since she opposed a bank-deregulation law, but positive for other industries including cannabis MJ, +0.26%. Harris is a sponsor of legislation to decriminalize marijuana at the federal level. During the primaries, Harris said there was \"no question\" she was in favor of banning fracking XLE, -1.59%, and also supported the Green New Deal. She backed Sen. Bernie Sanders's Medicare for All bill, but during her campaign said she wanted a role for private health plans. Biden hasn't endorsed the Green New Deal or Medicare for All. Also see:Here's where Joe Biden has moved to the left - and where he hasn't. In a Biden-Harris White House, the senator could work on issues including police reform, a central political topic in the wake of the killing of George Floyd, an unarmed Black man, in police custody in May. Harris invoked Floyd's name in her speech and noted that the coronavirus has disproportionately killed people of color. \"This is not a coincidence. It is the effect of structural racism,\" she said. Trump has tried to paint the Biden-Harris ticket as far to the left of center, with his campaign dubbing this week's events the party's \"Socialist Convention.\" Trump has accused Harris as being \"very big into raising taxes\" and said she was \"extraordinarily nasty\" to Supreme Court Justice Brett Kavanaugh while questioning him during his 2018 confirmation hearings. At 55, Harris may one day be poised to succeed Biden, who is 77, if he wins the White House in the fall. Biden's age prompted questions about whether he would serve two terms as president and put extra focus on his choice of a running mate. Biden in late April said he viewed himself \"as a transition candidate\" who would have young leaders in his administration. Victor Reklaitis contributed to this article."}]}