{"article": [{"url": "https://www.marketwatch.com/story/trump-says-coronavirus-pandemic-will-probably-unfortunately-get-worse-before-it-gets-better-2020-07-21", "published": 1595355260.0, "headline": "Trump says coronavirus pandemic will â\u0080\u0098probably, unfortunatelyâ\u0080\u0099 get worse before it gets better", "body": "President Donald Trump said Tuesday the coronavirus pandemic would probably worsen before improving, but said getting a vaccine is a â\u0080\u009ctop priorityâ\u0080\u009d as he appeared at a White House virus briefing for the first time since April. In a rare acknowledgment of potential bad news, Trump said the pandemic â\u0080\u009cwill probably, unfortunately, get worse before it gets better, something I donâ\u0080\u0099t like saying about things but thatâ\u0080\u0099s the way it is.â\u0080\u009d After weeks of focusing on issues unrelated to the pandemic and not wearing a mask himself, the president also urged Americans to wear face coverings and practice social distancing to slow the spread of the virus. â\u0080\u009cWeâ\u0080\u0099re asking everybody that when are you are not able to socially distance, wear a mask,â\u0080\u009d Trump said, a day after tweeting a picture of himself wearing one. â\u0080\u009cWhether you like the mask or not, they have an impact,â\u0080\u009d he said. Now read:Trump tweets photo of himself wearing a mask in apparent U-turn: â\u0080\u0098Many people say that it is Patriotic to wear a face mask.â\u0080\u0099 Trumpâ\u0080\u0099s revival of the briefings came as the number of confirmed cases of the coronavirus illness COVID-19 in the U.S. rose above 3.8 million on Tuesday. Trump lags presumptive Democratic presidential nominee Joe Biden in polls before the November election and more Americans disapprove of his handling of the pandemic than approve. A recent Washington Post-ABC News poll found that Americansâ\u0080\u0099 views of Trumpâ\u0080\u0099s handling of the outbreak have deteriorated. The survey showed 38% approved of his handling of the pandemic, down from 46% in May. Sixty percent disapprove, up from 53% in May. In a Quinnipiac University poll released July 15, two-thirds of respondents said they didnâ\u0080\u0099t trust information Trump was giving about the coronavirus. Dr. Anthony Fauci, the U.S. governmentâ\u0080\u0099s top infectious disease expert was notably absent from the briefings unlike press conferences Trump held earlier this year. He told CNN he wasnâ\u0080\u0099t invited. Trump said Dr. Deborah Birx, the White Houseâ\u0080\u0099s coronavirus response coordinator, was â\u0080\u009cright outsideâ\u0080\u009d the room. In recent days, Trump has called Fauci â\u0080\u009ca little bit of an alarmist,â\u0080\u009d as Fauci has defended his own response to the outbreak. Read:Trump vs. Fauci: The president says, â\u0080\u0098He was wrongâ\u0080\u0099; the doctor responds, â\u0080\u0098I donâ\u0080\u0099t regret anything I said.â\u0080\u0099 Trump had regularly appeared at the White House briefing room podium until late April, when he suggested that injecting toxic disinfectant could help treat the coronavirus. The president called the outbreak the â\u0080\u009cChina virusâ\u0080\u009d during the briefing, reprising a slap at Beijing, and said the country â\u0080\u009cshould have stopped it.â\u0080\u009d The initial cases of the virus occurred in Wuhan, China, in December 2019. In recent speeches, Biden has criticized Trump for what he says is his failure to address the COVID-19 pandemic. â\u0080\u009cHeâ\u0080\u0099s quit on you. Heâ\u0080\u0099s quit on this country,â\u0080\u009d Biden said of the president in a speech on Tuesday. Read:Biden unveils $775 billion plan for universal preschool, expanded child and elder care. U.S. stock indexes DJIA, +0.56% Â finished mostly higher Tuesday, encouraged in part by the promise of additional U.S. fiscal stimulus, after the European Union forged a historic budget package intended to dampen the economic impact of the effects of the COVID-19 pandemic."}]}