{"article": [{"url": "https://www.marketwatch.com/story/is-this-age-discrimination-what-older-workers-can-do-when-theyre-marginalized-at-their-job-2020-08-07", "published": 1596815180.0, "headline": "Is this age discrimination? What older workers can do when theyâ\u0080\u0099re marginalized at their job", "body": "This article is reprinted by permission from NextAvenue.org. About 10 years ago, my boss, mentor and close friend Angelina â\u0080\u0094 who was then in her early 50s â\u0080\u0094 lost her job at our well-known and respected Fortune 50 manufacturing company after working her way up to the executive suite. In the year before, I had noticed some subtle and troubling things about how she was being treated. I would attend a meeting and discover Angelina hadnâ\u0080\u0099t been invited. She was also asked to take on assignments well beneath her skill and talent level. Something didnâ\u0080\u0099t add up. When I asked the CEO about this, he said, â\u0080\u009cListen, Angelina has been in this business a long time. Maybe sheâ\u0080\u0099s just tired, thatâ\u0080\u0099s all.â\u0080\u009d Angelina was anything but tired. Thatâ\u0080\u0099s when I knew two things for sure:Â tiredÂ is anÂ ageistÂ code word forÂ oldÂ and marginalizing someone is an effective way to get them to choose to leave, taking the employer off the hook. My neither tired nor old mentor opted to leave the company and went on to do great things elsewhere.Why marginalization at work is insidious and demoralizing Marginalization at work is a clear indicator of ageism. In fact, itâ\u0080\u0099s the most insidious form. And itâ\u0080\u0099s demoralizing. The original meaning of the verb â\u0080\u009cto marginalizeâ\u0080\u009d comes from editing. The editor would write notes off to the side of the document, usually in tiny and practically unreadable print. In todayâ\u0080\u0099s workplace, when an older worker is marginalized, they too are often moved to the side in a position that feels unimportant. Like the notes in the manuscript, theyâ\u0080\u0099re often made to feel tiny. When I wrote my book,Â â\u0080\u009cIâ\u0080\u0099m Not Done: Itâ\u0080\u0099s Time to Talk About Ageism in the Workplace,â\u0080\u009d I interviewed dozens of people in their 50s and 60s who had been pushed out or fired from their jobs. Not one of them had ever received a bad performance review. So, in addition to being upset, they were also mystified. You might want to read: Are you facing early retirement? Hereâ\u0080\u0099s how to prepare As one man told me, â\u0080\u009cIt was almost like my seniority and experience was a negative to my boss, so he stopped including me in meetings about the agencyâ\u0080\u0099s future strategy. But what he didnâ\u0080\u0099t know was that I had a coffee date almost every morning with young employees who wanted to pick my brain.â\u0080\u009d He was terminated during a â\u0080\u009crestructuring.â\u0080\u009d Those young people are still calling him for advice.Marginalization and age discrimination I think most of us understand thatÂ age discriminationÂ is against the law, but we also need to understand that evidence of marginalization is often used to prove that the age discrimination existed. Itâ\u0080\u0099s believed that a lot of companies use marginalization to get older workers to leave, allowing the companies to avoid paying severance. Related: Bye, boomer: the coming cull of workers over 50 Sue Ellen Eisenberg, an attorney with her own firm in Detroit, has taken on dozens of age discrimination cases and she knows marginalization is often a factor. â\u0080\u009cAll of sudden, once-valued employees feel less valued. They are forced into a role that no longer utilizes their strengths, they are literally and figuratively being muted and it can become a self-defeating cycle because the natural reaction is to doubt yourself,â\u0080\u009d says Eisenberg. Donâ\u0080\u0099t miss: As Trump and Biden trade age insults, older workers suffer In reality, she adds, â\u0080\u009cnothing has changed about your abilities as much as the organizationâ\u0080\u0099s natural inclination to gravitate towards the next shiny thing. And once that starts to happen to someone, it can really wear them down, so this idea of leaving starts to sound like a plausible idea.â\u0080\u009d But even when marginalization doesnâ\u0080\u0099t lead to losing your job, it is hurtful and unpleasant.How marginalization can affect your health Whatâ\u0080\u0099s more, marginalization has been proven to have damaging effects on emotional, mental and physical health. When people feel excluded at their workplace, they often describe feelings of anger, fear, depression, anxiety, sadness and stress. As a result, they become even more isolated from their colleagues. Not exactly a formula for top performance. Also see: Age discrimination is still a major obstacle for older workers This then can lead to a vicious cycle. When an employee is relegated to the margin, they simply will not be as well-informed so if they do get a chance to participate, their contribution might not be as sharp as in the past. Self-doubt creeps in and, unwittingly, the employee proves the employerâ\u0080\u0099s â\u0080\u009cSuzy isnâ\u0080\u0099t as good as she used to beâ\u0080\u009d bias. That can then devolve into a performance review that could â\u0080\u009cjustifyâ\u0080\u009d Suzyâ\u0080\u0099s termination.What to do if it happens to you So, what can you do if you think youâ\u0080\u0099re being marginalized at work? Keep learning. Keep sharing your expertise and experience. Keep volunteering for new challenges. If you do those things and the marginalization continues, speak up to your boss or to HR or both.Â Keep notes of those conversations. Then, if nothing changes, consider calling an age discrimination attorney. Above all, donâ\u0080\u0099t let the marginalizing behavior erode your confidence.Â Remind yourself itâ\u0080\u0099s not you, itâ\u0080\u0099sÂ them. Wear your wisdom and experience like the badge of honor it is. Patti Temple Rocks, author ofÂ â\u0080\u009cIâ\u0080\u0099m Not Done,â\u0080\u009d has held senior leadership positions in three sectors of the communications industry: PR, advertising and on the corporate side. She is passionate about fighting age discrimination and helping people understand how it harms individuals, businesses and society as a whole. This article is reprinted by permission from NextAvenue.org, Â© 2020 Twin Cities Public Television, Inc. All rights reserved."}]}