{"article": [{"url": "https://www.marketwatch.com/story/g4s-rejects-382b-offer-from-garda-world-security-2020-09-30", "published": 1601459480.0, "headline": "G4S rejects $3.82B offer from Garda World Security", "body": "--G4S has rejected an offer from Garda World, saying it significantly undervalues the company --Garda World's offer of 190 pence a share was unchanged from its last proposal --G4S said it is well placed to deliver growth, profitability and substantial free cash flow G4S PLC on Wednesday rejected Garda World Security Corporation's 2.97 billion pound ($3.82 billion) cash offer for the London-listed security company. Montreal-based Garda World--which last year mulled a bid for G4S but eventually dropped its interest--formally launched the offer earlier Wednesday, saying it will bring \"experienced, professional management\" to G4S and deploy the resources necessary to solve the significant challenges faced by the business. Accepting G4S shareholders will get 190 pence a share in cash, a 30% premium to the stock's closing price on Friday Sept. 11, the day before Garda World announced its plan to put forward an offer. Responding to the offer, G4S said the value is unchanged from the last proposal it received from Garda World, and that it \"unanimously rejects the offer,\" saying it significantly undervalues the company. G4S added that the company is increasingly well placed to deliver growth, profitability and substantial free cash flow as it executes its strategy. \"Since rejecting GardaWorld's last proposal, G4S has announced continuing resilience in its trading with underlying earnings ahead of the prior year for the first eight months of 2020,\" G4S Chairman John Connolly said. G4S reiterated that it believes the timing of the offer is highly opportunistic given the global pandemic. G4S shares at 1255 GMT were up 9.75 pence, or 5.2%, at 198.85 pence. \"We look forward to meeting with investors to explain the challenges ahead and why this is a full and fair price for an asset which faces turbulent times and difficult operating conditions,\" Garda World Chairman Stephan Cretier said earlier on Wednesday. Write to Ian Walker at ian.walker@wsj.com"}]}