{"article": [{"url": "https://www.marketwatch.com/story/with-the-collapse-of-substantive-covid-related-stimulus-mitch-mcconnell-is-already-trying-to-make-joe-bidens-life-miserable-11602165668", "published": 1602247220.0, "headline": "By saying no to more stimulus, Mitch McConnell is already trying to make Joe Biden's life miserable", "body": "Senate Majority Leader Mitch McConnell Agence France-Presse/Getty Images Blame Donald Trump all you want for Washington's failure to deliver more relief and stimulus to the battered economy. But the failure is not his, not entirely. If Senate Leader Mitch McConnell had wanted to do it, it would have been done. McConnell has gotten everything he wanted out of Trump's presidency: A big tax cut for corporations and the wealthy, a judiciary packed with young conservatives. “ If you want to know why the recovery after the Great Recession was the weakest in modern history, just look at the people in the Republican Caucus who worked overtime to weaken it. ” The Republican senator from Kentucky may be the most powerful person in Washington. His strength doesn't rely on subservience to Trump, but on his skill in orchestrating the most autocratic institution in the land. He's a master, and he plans on being there for a while longer. At 78, he's running for re-election to another six-year term. Victor Reklaitis reports: Trump's stance on major aid is just a reflection that 'votes don't exist in the Senate for a deal,' analyst says The art of no deal Although both men have occasionally mentioned further stimulus, neither Trump nor McConnell wanted another stimulus bill urgently enough to get it done. The \"greatest deal maker\" in history never engaged with the Democrats, and McConnell seemed happy to let the effort fail. Now they are talking about piecemeal proposals that may bail out a few industries, but nothing substantive that would boost the economy, move the needle on the stock market SPX, +0.87% DJIA, +0.56%, or help the people who are struggling to pay the rent or buy food. At first glance, McConnell's indifference to further economic assistance is a puzzle. McConnell was fully onboard with economic stimulus and relief in March and April, when a bipartisan group of lawmakers and administration officials crafted a series of measures that flooded the economy with timely and targeted aid. It wasn't perfect, but it got results. The government assistance approved in March and April kept millions of households, thousands of business, and the U.S. economy in general afloat for much of the summer, before most of the provisions expired. You'd think that another shot of adrenaline before the election could have sealed a Republican victory in November by making the economy a big plus instead of a question mark. More from Rex Nutting: The government kept the economy afloat in the second quarter, so why are Republicans in a rush to pull the support away right before the election? Voters were predisposed to give Trump the benefit of the doubt on the economy. All he needed to do was get the coronavirus under control and the election was his. Jeffry Bartash reports: Trump loses big edge over Biden on the economy as election looms Trump's refusal to take a stimulus deal handed to him by Nancy Pelosi is difficult to understand in purely political terms. When the opposition party is eager to hand you a $4 trillion boost to the economy right before the vote, you don't reject it out of hand. Yet Trump did. So did McConnell. Why? Trump has never played by the traditional rules of politics. What's more, the need for stimulus never suited his approach to the pandemic. Accepting a deal on coronavirus aid might undercut his main campaign talking point: That everything is fine. That the pandemic is totally under control and the economy is roaring back like never before. Opinion: Temporary layoffs are becoming permanent job losses Why did Mitch say no? Some will point to ideology. McConnell didn't want to give that much cash to states poorly run by Democratic governors and mayors, they say. Or maybe Mitch is honestly worried about the national debt. But I think it was McConnell's pragmatism and knack for political calculus that made the difference between the cooperation of the spring and the gridlock of the summer and fall. He knows that no legislation enacted now can save the election for the Republicans. He still wants to win, of course, but he needs a Plan B just in case. McConnell can see the blue wave coming, and he's already angling to make Joe Biden's life miserable, just as he did with Joe's buddy, Barack Obama. And, even if Democrats sweep the election, McConnell, as leader of the opposition in the Senate, would have considerable ability to undermine the Democrats' plans to strengthen the economy.A shameful history Presidents always get too much credit or take too much blame for what happens in the economy. Frequently, it's Congress that has the larger role in economic policy. That's where taxing and spending decisions are made, or blocked. The most underappreciated event in U.S. political economy in the past 20 years has been the role of the Republican Party in sabotaging the economy whenever Democrats are in charge, and allowing the wealthy and connected to loot the public treasury whenever the Republicans are in charge. If you want to know why the recovery after the Great Recession was the weakest in modern history, just look at the people in the Republican Caucus who worked overtime to weaken it. As fiscal policy retreated after Republicans took control of the House in 2010, Fed officials, including Republican Ben Bernanke and Democrat Janet Yellen, pleaded with Congress to join with them in supporting the recovery. They argued that the economy wasn't reaching its full potential, which meant that the long-term unemployed and underemployed were needlessly suffering permanent damage.Something changed It wasn't in the Republicans' political interest to do anything to help the economy until Trump came into office in early 2017. Then, suddenly, McConnell and the fiscal conservatives went on the offense. The spigot was turned back on and federal money once again flooded the economy with so much money that the Fed had to lean against it. Even after the virus hit in March, Republicans thought they were in good shape for November, and so they approved the early rounds of relief, believing the pandemic would be just a memory by November if the economy could get through the temporary lockdowns. Then, in May, McConnell changed his mind. He wasn't interested in doing broad relief and stimulus bills any more. He wanted to wait, and he had his own set of conditions, such as a provision shielding businesses from COVID-related lawsuits. Talking about how needy the economy was went against the GOP party-line denial that everything was fine. Everyone else knew the economy would need more help once the first tranche of aid ran out. Most people assumed that some kind of deal would get done because it had to. Fixing the economy was clearly in Trump's favor. It was also the right thing to do. Federal Reserve Chair Jerome Powell-as good a Republican as you'll find-had been banging the table since the early days of the pandemic for Congress to go big with fiscal stimulus. On Tuesday, hours before Trump tweeted that he would cancel the stimulus talks until after the election, Powell again called on Congress to act.Unnecessary hardships \"Too little support would lead to a weak recovery, creating unnecessary hardship for households and businesses,\" he said. \"Over time, household insolvencies and business bankruptcies would rise, harming the productive capacity of the economy, and holding back wage growth. By contrast, the risks of overdoing it seem, for now, to be smaller. \" Powell noted with pride that the pre-coronavirus economy had finally begun to work for those who had been left behind by the Great Recession 10 years before. People who had lost hope were finally getting jobs again, and low-paid workers were finally getting raises as the labor market finally tightened enough to give workers a little bargaining power. A sluggish recovery would undo all the progress that had been made on reducing inequality and expanding opportunity, Powell warned. The COVID recession has disproportionately hurt women, Blacks, immigrants, young people, renters, children, low-wage workers, city dwellers. Breaking news: Coronavirus relief effort stalled because only the poor are hurting, says former Fed economist Fortunately, Democrats have a long history of cleaning up the messes left by irresponsible Republican administrations. They might have to do it again."}]}