{"article": [{"url": "https://www.marketwatch.com/story/pressure-builds-on-senate-republicans-to-move-in-direction-of-3-trillion-coronavirus-relief-measure-favored-by-democrats-2020-06-26", "published": 1593356180.0, "headline": "Pressure builds on Senate Republicans to move in direction of $3 trillion coronavirus relief measure favored by Democrats", "body": "Sen. Roy Blunt, headed into a weekly a lunch with fellow Republicans, appeared to grin a bit behind his mask when asked if the price tag of the next coronavirus aid package would rise as the President Donald Trump’s polling worsened. “My view has always been that the president would be supportive of big amounts of money going to the economy right now,” he said. The Democrats’ marker for the next package, the $3.448 trillion “Heroes Act,” won’t be taken up by the Senate, but with only two weeks before senators come back from the July 4 break, Republicans like Missouri’s Blunt face decisions on how to build a package and how big to make it. There are signs the discussions are breaking toward a “bigger is better” approach. Of course, how one defines “big” is subjective. On ABC’s “This Week,” House Speaker Nancy Pelosi said she thought Republicans “will come around” and support a large package. She said Fed Chairman Jerome Powell has backed more spending, pointing to the risk of a worse recession. Republicans “know we have to have a bill,” Pelosi said, adding that individual Republicans are calling her to make requests for items to be included in a final package. “[Treasury] Secretary Mnuchin knows there has to be legislation,” she said. “They’ll be friendly.” She said it was not time for face-to-face talks with Mnuchin, explaining that such negotiations typically come at the end of the process. Even though lawmakers are unlikely to turn in earnest to a fifth coronavirus relief package until late July, ideas are percolating. Trump, in a television interview Monday, said there would be another round of checks to individuals. “We will be doing another stimulus package. It’ll be very good. It’ll be very generous,” he said. The White House has reportedly been considering a $1 trillion infrastructure package that could boost the economy. In recent days, a series of polls has shown Trump’s re-election campaign facing a rockier path. New York Times polls Thursday showed him trailing in key battleground states crucial to his 2016 election, and the Real Clear Politics average of national polls put Trump behind presumptive Democratic nominee Joe Biden by 10 percentage points. While those factors may not be enough to nudge the White House and Senate Republicans all the way over to Pelosi’s $3 trillion–plus price tag, they could push them in that general direction. Steve Ellis, president of anti-spending group Taxpayers for Common Sense, said the Democrats put “everything thing they could think of” in their bill. “They won’t get all they want, but it is clear that the president and many senators want something, as well. It is better to do this package more targeted and thought out to ensure the assistance goes where it is most needed and effective,” he said. Sen. Mike Rounds, a South Dakota Republican, said he can see the Paycheck Protection Program being extended and targeted to “those areas that were most dramatically impacted” and possibly another payroll tax break, for workers and companies. “Incentives to go back to work, yes. But to do it safely is the critical part,” Rounds said. “I think people, myself included, are watching the economic numbers carefully. All of the money we appropriated still has not yet been spent. The next bill, if there is one, will be very targeted,” said Sen. John Kennedy, a Louisiana Republican. The Congressional Budget Office has estimated the first four coronavirus bills will cost about $2.404 trillion from 2020 to 2030. The Committee for a Responsible Federal Budget, a bipartisan group focused on the debt, estimates about $1.8 trillion had been disbursed or allocated for disbursement by mid-June. However, some Republican senators are starting with a hard line. Sen. Ron Johnson, the Wisconsin Republican who chairs the Senate Homeland Security and Governmental Affairs Committee, said: “My own advice is, let’s take a look at what has not been obligated, not been spent, and see if there’s a better way of directing that.” “I certainly do not think we’re in a position today to have to authorize even a dollar more.” Sen. Chris Coons, a Delaware Democrat who sits on the Senate Small Business Committee, said factors other than politics could push Republicans toward agreeing to a bigger bill in July. “Three things are coming together this month. The economy is not opening and growing as quickly as many of us had hoped. The pandemic is not as under control as many of us might have expected. And Americans are demanding action to respond to long-standing racial inequalities,” he said. “If what my colleagues hear over the two weeks that they’re back in their states is anything like I’m hearing in Delaware, we’ll end up doing a big package.”"}]}