{"article": [{"url": "https://www.marketwatch.com/story/my-mother-claimed-me-as-a-dependent-in-2019-but-i-was-not-aware-of-this-what-can-i-do-to-claim-my-1200-stimulus-check-2020-05-27", "published": 1592305820.0, "headline": "'My mother claimed me as a dependent in 2019, but I was not aware of this.' What can I do to claim my $1,200 stimulus check?", "body": "Dear Moneyist, My mother claimed me as a dependent in 2019, but I was not aware of this, I had a 2018 and 2019 annual gross income of zero. I was staying with her when she claimed me as a dependant. I am not upset with her. I understand that, at the time, it helped her and didn't hurt me. Now, however, it's a different story. It has kept me from receiving a stimulus check. I filed the non-filer paperwork, and that's how I discovered that I was being claimed, and that I was denied a stimulus. Is there anything I can do now, or in the future, to claim my $1,200 stimulus check? Rob Dispatches from a pandemic: Letter from New York: 'New Yorkers wear colorful homemade masks, while nurses wear garbage bags' Dear Son, It sounds like you have a healthy relationship with your mother. That makes a nice change from many of the letters I've received over the years. Your payment is an advance on a 2020 tax credit, so you should indeed receive $1,200. Now, for the bad news: It won't arrive until next year. “ 'Your payment is effectively an advance on a 2020 tax credit, so you should receive a stimulus payment of up to $1,200. Now, for the bad news.' ” Some 150 million stimulus checks have been sent, and millions more people are awaiting their money. The IRS will send $1,200 payments to individuals with adjusted gross annual income below $75,000, and $2,400 to married couples filing taxes jointly who earn under $150,00 \"In many instances, eligible taxpayers who received a smaller-than-expected economic impact payment may qualify to receive an additional amount early next year when they file their 2020 federal income tax return,\" the IRS said. \"EIPs are technically an advance payment of a new temporary tax credit that eligible taxpayers can claim on their 2020 return. Everyone should keep for their records the letter they receive by mail within a few weeks after their payment is issued,\" it added. Don't miss:'We will not have a vaccine by next winter.' Like the 1918 Spanish flu, CDC says second wave of coronavirus could be worse. So what happens now? Having your bank details on file will help speed the plow for a payment next year. If the IRS does not have your bank-account information on file, it will likely take longer. Approximately 14 million Americans don't have bank accounts or 6.5% of U.S. households. There were glimmers of hope for U.S. workers who are endeavoring to make ends meet with their $1,200. The Democratic-run House of Representatives approved its HEROES Act, a $3 trillion coronavirus relief package, over a week ago, and analysts say it's likely next month or later. You can submit your bank-account and address information through the IRS tracking tool, \"Get My Payment.\" It should also tell you if the IRS needs more bank-account information. In the meantime, I hope you and your mother stay healthy, and safe. The Moneyist: My son is staying with me, yet my financially irresponsible ex-husband received his $500 stimulus check. Is my ex right to keep it? You can email The Moneyist with any financial and ethical questions related to coronavirus at qfottrell@marketwatch.com. Want to read more?Follow Quentin Fottrell on Twitterand read more of his columns here Would you like to sign up to an email alert when a new Moneyist column has been published? If so, click on this link. Hello there, MarketWatchers. Check out the Moneyist private Facebook FB, +0.26%  group where we look for answers to life's thorniest money issues. Readers write in to me with all sorts of dilemmas. Post your questions, tell me what you want to know more about, or weigh in on the latest Moneyist columns."}]}