{"article": [{"url": "https://www.marketwatch.com/story/cdc-extends-us-cruise-ship-ban-to-just-oct-31-2020-09-30", "published": 1601505620.0, "headline": "CDC extends U.S. cruise ship ban to just Oct. 31", "body": "The Centers for Disease Control and Prevention on Wednesday night extended its ban on cruise sailings in the U.S. by a month, to Oct. 31, according to a person familiar with the matter, matching the industry's plans to restart a business that has been largely suspended by the coronavirus pandemic. The no-sail order was set to expire Wednesday, and there has been debate about whether the passenger ships could safely resume operations while the Covid-19 virus continues to spread in parts of the country. The director of the CDC, Robert Redfield, had recommended extending the no sail order into next year but was overruled at a White House meeting this week, according to a federal official familiar with the matter. The news was earlier reported by Axios. The CDC had drafted an order that would leave the ban in effect until February, this person said, but the White House Task Force, chaired by Vice President Mike Pence, decided to extend the order for one month instead. That would give the government more time to work on protective measures, such as limits on capacity, that could be implemented to resume sailings. The CDC is expected to post its updated order as soon as Wednesday, this person said. White House officials didn't want to see the industry further damaged and lose more jobs in hubs like Miami, according to another person familiar with the matter. The cruise operators' trade group, which has voluntarily suspended sailings until Oct. 31, last week released a plan that called for implementing tighter controls to keep infected people from boarding ships, among other measures. Major cruise operators haven't been sailing in the U.S. for about six months, after outbreaks aboard their ships triggered sailing suspensions and tangled efforts to repatriate passengers and crew. Without sailings, the companies have been burning cash as revenue essentially evaporated. Together, Carnival Corp., Royal Caribbean Group and Norwegian Cruise Line Holdings Ltd. have reported more than $10.8 billion in losses for roughly the first half of the year. Some companies are sailing again in Europe. But there has already been an outbreak. Norway's Hurtigruten suspended its expedition cruises in early August, a month and a half after restarting them, after the virus spread among crew members and passengers of its MS Roald Amundsen, a 530-passenger ship that cruises Arctic waters. The CDC says cruise ships are hotbeds for virus transmission, given the population density on board. But merely decreasing the number of people on board doesn't end transmission, the regulator says. There were nearly 3,000 Covid-19 or Covid-like cases and 34 deaths on cruise ships between March 1 and July 10, according to CDC data. Those cases include 99 outbreaks on 123 cruise ships, and 80% of ships within U.S. jurisdiction were affected by Covid-19 during the period, the CDC said. Shares of Carnival, Royal Caribbean and Norwegian rose 3.2%, 3.5% and 5%, respectively, in afternoon trading. The stocks have lost more than half of their values so far this year. --Alex Leary contributed to this article. Write to Betsy McKay at betsy.mckay@wsj.com and Dave Sebastian at dave.sebastian@wsj.com"}]}