{"article": [{"url": "https://www.marketwatch.com/story/physicians-prescribe-steroid-used-to-treat-severely-ill-covid-19-patients-to-trump-2020-10-04", "published": 1601816600.0, "headline": "Trump physicians have administered a steroid used to treat severely ill COVID-19 patients", "body": "President Donald Trump, who on Friday disclosed he had tested positive for the coronavirus, is now being treated with dexamethasone, a steroid that is primarily used to treat severely ill, hospitalized COVID-19 patients. Dr. Sean Conley, Trump’s physician, said Sunday morning during a roughly 10-minute news conference that the president had received his first dose of dexamethasone on Saturday. Dexamethasone is a type of cortisteroid that researchers in the U.K. said in June can reduce deaths in severely ill COVID-19 patients who were on ventilators or oxygen support. The drug has yet to show any benefit in hospitalized patients not on respiratory support. The president was previously prescribed Regeneron Pharmaceuticals Inc.’s REGN, +0.36% still investigational antibody treatment on Friday and Gilead Sciences Inc.’s GILD, +0.82% remdesivir on Saturday. “We [were] really trying to maximize everything that we could do for him,” Conley said. “We debated whether we even started the dexamethasone. And we decided, in this case, the potential benefits early on [in] the course probably outweighed any risks at this time.” Conley also confirmed for the first time that Trump was briefly on supplemental oxygen Friday morning, noting that at that time he had a high fever and “his oxygen saturation was transiently dipping below 94%.” His oxygen-saturation level also dropped down to 93% on Saturday. Conley said he was unsure whether Trump had been given a second round of supplemental oxygen on Saturday. If oxygen saturation levels fall below 90%, this is considered hypoxemia, which can cause shortness of breath, according to the Mayo Clinic. Any reading of between 95% and 100% is considered normal. “In response to transient low oxygen levels … we did initiate dexamethasone therapy,” Dr. Brian Garibaldi, director of the biocontainment unit at Johns Hopkins Medicine and one of the physicians on Trumps’s care team at Walter Reed National Military Medical Center, said during the news conference on Sunday. “Our plan is to continue that for the time being.” The physicians said that Trump’s liver and kidney functions remain normal, and that he hasn’t presented any side effects to remdesivir. “If he continues to look and feel as well as he does today, our hope is that we can plan for a discharge as early as tomorrow to the White House, where he can continue his treatment course,” Garibaldi said. The Food and Drug Administration in May granted an emergency-use authorization to Gilead’s remdesivir as a treatment for severely ill COVID-19 patients. Its primary clinical benefit is that it may reduce recovery time for some hospitalized COVID-19 patients. Regeneron’s REGN-COV2, the first drug prescribed to Trump, is a type of antibody-based treatment called a neutralizing antibody cocktail that is still being studied in clinical trials for people with mild to moderate forms of the disease. It hasn’t received an authorization or approval from the FDA."}]}