{"article": [{"url": "https://www.marketwatch.com/story/oil-prices-try-to-gain-traction-higher-ahead-of-storage-data-2020-09-23", "published": 1600874900.0, "headline": "Oil futures settle higher, but U.S. prices fall short of reclaiming $40 mark", "body": "Oil futures gained on Wednesday as U.S. crude supplies declined for a second week in a row, but U.S. benchmark prices fell short of reclaiming the $40 mark, with coronavirus-related lockdowns in Europe raising expectations for weaker energy demand. Natural-gas futures, meanwhile, rallied by nearly 16%, with traders focused on reported transport disruptions in Texas from storm-related flooding, recent declines in production and signs of strong demand for the fuel, analysts said. The Energy Information Administration reported Wednesday that U.S. crude inventories fell for a second straight week, by 1.6 million barrels for the week ended Sept. 18. That was much less than the average forecast from analysts polled by S&P Global Platts for a decline of 4 million barrels, but the American Petroleum Institute on Tuesday had reported an increase of 691,000 barrels. “While this data remains relevant, oil markets have bigger fish to fry in the form of COVID-19 and fears over another round of lockdowns,” said Lukman Otunuga, senior research analyst at FXTM. “The commodity remains heavily influenced by demand-side factors and the state of the global economy.” Prices likely will remain stuck around the $40 region in the near term, especially if another round of possible lockdowns hit oil demand, he told MarketWatch. On its first full day as the front-month contract, West Texas Intermediate crude for November delivery CL.1, -1.62% CLX20, -1.62% rose 13 cents, or 0.3%, to settle at $39.93 a barrel on the New York Mercantile Exchange after tapping a high of $40.75. Front-month prices settled below the $40 mark for a third consecutive session. The global benchmark, November Brent crude BRN.1, -0.07% BRN.1, -0.07% climbed 5 cents, or 0.1%, to $41.77 a barrel on ICE Futures Europe. EIA data Wednesday also showed crude stocks at the Cushing, Okla., storage hub unchanged for the week at 54.3 million barrels, while total domestic oil production was down by 200,000 barrels at 10.7 million barrels a day. Gasoline supply, meanwhile, fell by 4 million barrels, while distillate stockpiles declined by 3.4 million barrels. The S&P Global Platts survey had shown expectations for a supply fall of 1.9 million barrels for gasoline, while distillates were expected to rise by 1.2 million barrels. On Nymex, October gasoline US:RBV20 tacked on 1.5% to $1.1813 a gallon and October heating oil US:HOV20 rose 1% to $1.1075 a gallon. Going forward, several headwinds exist for crude to have any sustained rally, Tariq Zahir, managing member at Tyche Capital Advisors, told MarketWatch. “The virus has taken center stage as we saw yesterday a return to restrictions being recommended in Europe,” he said. “With our new cases at a level that is concerning going into the flu season a return to any kind of normality here in the U.S. really will be dependent on getting an effective vaccine.” Also on Nymex Wednesday, natural-gas futures led the gains in the energy market, with the October contract US:NGV20 up almost 16% at $2.125 per million British thermal units, the highest front-month finish in a week. Flows to both the Sabine Pass and Freeport LNG export facilities in Texas “remain greatly reduced as Tropical Storm Beta unleashes flooding in the Houston area and inches toward Louisiana,” said Christin Redmond, commodity analyst at Schneider Electric, in a daily note. She also noted signs of strong demand, so if there is no substantial damage to Gulf liquefied natural gas export terminals from the storm known as Beta, “feedgas demand should ramp up again quickly following the storm and could run near full capacity in October.” Read more about what’s led to the natural-gas rally The EIA will provide a weekly update on U.S. natural-gas supplies in storage on Thursday. On average, analysts surveyed by S&P Global Platts expect data to show an increase of 77 billion cubic feet. Taking a look at the bigger picture for oil, the impending return of Libyan crude to the market also is seen weighing on crude prices, analysts said. Libya’s National Oil Company continues to announce progress toward a resumption of supply, “with the latest plan seeing 260,000 barrels a day of supply already next week, around 150,000 b/d higher than what has been typical over recent months,” wrote analysts at JBC Energy, a Vienna-based consulting firm, in a note. The rise in supply comes outside of the agreement by the Organization of the Petroleum Exporting Countries and its allies, a group known as OPEC+, to curb output by 7.7 million barrels a day “and adds pressure to a market which is globally still trying to assess the impact of the latest stagnation in the demand recovery,” they said. Zahir said that, for now, the amount of oil Libya is adding to the market is “not tremendous,” but “the last thing the energy markets needs at this point is more oil coming to the market. We feel the risk is to the downside in the days and weeks to come.”"}]}