{"article": [{"url": "https://www.marketwatch.com/story/on-again-pelosi-says-talking-to-mnuchin-again-friday-about-big-fiscal-stimulus-11602262445", "published": 1602259220.0, "headline": "On again: Pelosi, Mnuchin talk again about big fiscal stimulus, but no deal", "body": "Stocks rallied Friday amid signs of progress on a potential stimulus bill. In this file photo, a trader walks past a screen during the closing bell at the New York Stock Exchange (NYSE) on March 17. (Photo by Johannes EISELE / AFP) (Photo by JOHANNES EISELE/AFP via Getty Images) The carousel of on-again, off-again fiscal stimulus talks in Washington sped up Friday, as bargaining warmed up over a comprehensive deal, a prospect President Trump rejected only three days ago. But after House Speaker Nancy Pelosi and U.S. Treasury Secretary Steven Mnuchin talked by phone, the provisions of the plan for coronavirus testing remained a sticking point. In a tweet, Pelosi spokesman Drew Hammill said the pair talked for about half an hour and Mnuchin “returned to the table with a proposal that attempted to address some of the concerns Democrats have.” He said there was no agreement yet on a “strategic plan” to combat coronavirus. “For this and other provisions, we are still awaiting language from the Administration as negotiations on the overall funding amount continue,” he tweeted. Prior to the Pelosi-Mnuchin discussion breaking up, Trump expressed his hope for a big deal while on a conservative radio talk show. “I would like to see a bigger stimulus package, frankly, than either the Democrats or the Republicans are offering,” Trump told host Rush Limbaugh on what the president’s campaign has called a “radio rally.” “I’d like to see money going to people. It was not their fault that China sent in the plague,” Trump said, blaming Beijing again for the coronavirus pandemic. Pelosi pressed Mnuchin Thursday on whether Trump wanted a comprehensive deal or just a smaller one, after she publicly rejected a standalone bill for airline aid only. Trump appeared Friday to favor a large deal and tweeted “Go Big!” early in the day. iframe.twitter-tweet { width: 100% !important; } The U.S. stock market continued to follow the talks’ progress, but were only moderately up in late afternoon trading DJIA, +0.56%. Read more: Dow on track for biggest weekly gain since August as Trump prepares fiscal stimulus counteroffer Amid reports the administration was willing to go to $1.8 trillion from its previous level of $1.6 trillion in its offer, Larry Kudlow, director of the White House’s National Economic Council, said Trump had signed off on a revised offer. “The President has approved a revised package. He has approved a revised package, he would like to do a deal,” Kudlow said on Fox Business News. The situation marks a sharp turnaround from Tuesday afternoon, when Trump tweeted he was pulling out of talks and both Pelosi and the Republican party Senate Majority Leader Mitch McConnell appeared to accept the negotiations were over until after the election. But McConnell’s path to getting a deal of more than $1 trillion passed in the Senate would appear difficult as he has said some of his Republican colleagues don’t want to see more stimulus spending at all. At a campaign appearance in Kentucky, McConnell said his immediate focus was on getting U.S. Supreme Court nominee Amy Coney Barrett confirmed, as nailing down details of another fiscal stimulus bill, writing legislative language and other issues would mean a deal would take some time to reach the Senate, if one was reached. “The first priority for the Senate is the Supreme Court,” McConnell said. Barrett’s confirmation hearings are slated to start next week. And even if Trump and Democrats can agree on a dollar figure, there is no guarantee they can agree on policies in a package as well. “The devil and the angels are in the details. Part of it is about money and part of it is about policy. And so we’ll continue our conversation today,” Pelosi said in an interview on MSNBC."}]}