{"article": [{"url": "https://www.marketwatch.com/story/consumer-sentiment-falls-in-late-july-as-coronavirus-cases-rise-and-federal-aid-gets-set-to-expire-2020-07-31", "published": 1596191780.0, "headline": "Consumer sentiment falls in late July as coronavirus cases rise and federal aid gets set to expire", "body": "The numbers: Americans grew more worried about the economy toward the end of July after a fresh outbreak of coronavirus cases chipped away at the recovery and cast doubt on how quickly the U.S. will rebound from the worst health-care crisis in a century. The final reading of the consumer sentiment survey in July slipped to 72.5 from an initial 72.9, the University of Michigan said Friday. The index registered 73.2 in June. The level of sentiment is now barely above the pandemic low, erasing most of the momentum gained in late May and June as large swaths of the economy reopened. Read:Consumer confidence wanes in July and points to rockier economic recovery What happened: Consumers expressed less confidence in the current state of the economy. An index that measures attitudes right now fell to 82.8 from 87.1 Americans also doubt the recession will end anytime soon. An index that measures expectations for the next six months sank to 65.9 from 72.3 and matched a six-year low recorded in May. Read:U.S. entered recession in February after end of longest expansion in history Richard Curtin, the chief economist of the sentiment survey, said massive federal aid has kept U.S. from sinking into an even deeper recession, but he fretted that the economy could suffer another dip unless Washington provides more financial relief. The two parties are deadlocked over another aid package with emergency unemployment and other benefits on the cusp of expiring. Read: Capitol Hill talks on next COVID-19 financial aid bill stuck in neutral “The federal relief programs have prevented more substantial declines in consumer finances, partially shielding consumers from the unprecedented surge in job losses, reduced work hours, and salary cuts,” Curtin said. “The lapse of the special jobless benefits will directly hurt the most vulnerable and spread even further by missed rent, mortgage, and other debt payments.” Read: Economy suffers titanic 32.9% plunge in 2nd quarter, points to drawn-out recovery Also:‘A massive welfare economy’ - federal aid prevents even steeper GDP collapse The big picture: The amount of confidence Americans have in the economy and their own financial security has a good track record of predicting the future. Confidence has faltered after the recent outbreak of coronavirus cases and the reimposition of government restrictions. High unemployment is another worry, especially with emergency federal jobless benefits on the cusp of expiring. The economy can’t make big strides in recovering without more government aid and better success at getting the coronavirus under control, analysts say. Read:Jobless claims rise for second straight week as U.S. economic activity slows down What they are saying? “Disappointing, but not much of a surprise,’ said chief economist Scott Brown of Raymond James. Market reaction: The Dow Jones Industrial Average DJIA, +0.56% and S&P 500 SPX, +0.87% were little changed in Friday trades. Stocks have see-sawed over the past week."}]}