{"article": [{"url": "https://www.marketwatch.com/story/vp-nominee-kamala-harris-has-a-particular-climate-change-agenda-environmental-justice-2020-08-12", "published": 1597306700.0, "headline": "VP nominee Kamala Harris has a particular climate-change agenda: environmental justice", "body": "If presumed Democratic presidential nominee Joe Biden’s climate-change policy is, by some accounts, too broad to make implementation a surety, the focus of his newly named vice presidential pick may recast the party’s green agenda moving forward. Senator Kamala Harris, who Biden tapped to be his running mate on Tuesday, has grown increasingly firm in her commitment to a particular angle when it comes to man-made climate change: environmental justice. Her addition to the top of the Democrats’ ticket for November comes just days after she released new legislation, the Climate Equity Act. In it, she and co-sponsors aim to ensure that any environmental regulation or legislation would be rated based on its impact on low-income communities, similar to a Congressional Budget Office score. Read:Kamala Harris on student-loan forgiveness, Medicare, universal basic income, credit scores — and a tax on trading stocks She and Biden spoke together from Delaware on Wednesday, with Harris pledging to create millions of jobs and fight climate change through a clean-energy revolution. “Harris’s strength in messaging climate issues and selling the Biden climate agenda is her ability to tie climate to social justice and public health issues,” wrote Our Daily Planet editors Miro Korenha and Monica Medina. “She approaches climate justice from a prosecutorial lens and much of her own presidential climate plan focused on holding polluters accountable for the damage they’ve inflicted on vulnerable communities as well as strengthening laws to prevent these actions going forward.” For Harris, formerly the district attorney for San Francisco and the attorney general of California, a state that has generally pursued environmental policy beyond federal efforts, the inequity attached to climate-change policy can no longer be ignored. Environmental justice, for instance, extends to addressing pollution known to be several times greater in economically-deprived neighborhoods than their richer counterparts, and includes a more punitive response for polluters. Environmental justice takes on public-health concerns at a time the nation is already on heightened alert over the COVID-19 pandemic and those most vulnerable to its harm. Harris’s climate-change stance, for which she’s linked arms with Rep. Alexandria Ocasio-Cortez, Democrat of New York, and others, carries its own challenges as government bodies and corporations, including tech giants Amazon AMZN, +3.01% and Apple AAPL, +1.74% , attempt to quantify and transparently report on carbon reduction, combating deforestation and more, actions taken even as the Trump administration reduces the potency of the Environmental Protection Agency. Uniform data on climate efforts has been a challenge. Read:Apple joins tech rivals with pledge to be 100% carbon neutral by 2030 Harris previously forwarded a $10 trillion climate plan that would tap both public and private efforts while in the midst of her own pursuit of the Democratic presidential nomination last year. At that time, her plan included a target to reduce greenhouse gas emissions to zero by 2045, five years faster than the target of the Green New Deal framework championed by Ocasio-Cortez and other progressive Democrats. Harris has championed expanding clean-energy tax credits as well as increased vehicle fuel-economy standards. Fuel economy rules were reduced by the Trump administration, initially to a mixed response from most auto makers who had retooled to meet state rules and take advantage of shifting demands of younger consumers. Some of the energy-sector targets like those forwarded by Harris and others are concerning to Republican lawmakers and right-of-center trade groups, including R Street Institute, National Taxpayers Union and others. They generally seek more balance in keeping heating and cooling costs low for Americans and they promote carbon sequestration as a way to harness emissions. Republicans have also been emphasizing the need to keep up trade pressure on the world’s other big emitters, including India and China. Those issues are among the key facets of the proposed GOP-led Growing Climate Solutions Act. A July survey by the left-leaning Climate Power 2020 found that 71% of respondents favor greater government action on climate change; the group said 41% of the voters sampled are Republican. “2020 is the defining moment for how our nation addresses the climate crisis. Vice President Biden’s decision to pick Kamala Harris as his running mate reflects his campaign’s commitment to making climate action a Day 1 priority in a Biden-Harris administration,” said Lori Lodes, executive director of Climate Power 2020."}]}