{"article": [{"url": "https://www.marketwatch.com/story/exxonmobil-will-suspend-its-401-k-matchingas-threats-to-its-dividend-mount-2020-08-06", "published": 1596885800.0, "headline": "ExxonMobil will suspend its 401 (k) matchingâ\u0080\u0094as threats to its dividend mount", "body": "Chances are you own stock in ExxonMobil Corp. XOM, -1.47% Â whether you know it or not. Itâ\u0080\u0099s found in some 2,553 mutual funds and numerous exchange-traded funds, for example. Thatâ\u0080\u0099s on top of the approximately 353,000 people who own it outright in their brokerage accounts. Which is why news that the oil and gas giant is ending 401(k) matching for its 75,000 employees is a big deal. Itâ\u0080\u0099s a signal that XOM is worried about its dividend and is taking drastic measures to shore up the payout, currently 87 cents per quarter. The 401(k) news was first reported by Reuters. The iconic industrial giantâ\u0080\u0094whose roots stretch back to 1870, when John D. Rockefeller founded Standard Oilâ\u0080\u0094has been on the financial defensive for some time. Earlier this year, ExxonMobil said it was slashing capital spending 30% to $23 billion. Thatâ\u0080\u0099ll help maintain the dividend, which costs the company an estimated $15 billion a year. Read: New blow to workers â\u0080\u0094 some companies are cutting 401(k) contributions The dividend has long been considered sacrosanct at ExxonMobil, a classic â\u0080\u009cwidows and orphansâ\u0080\u009d stock. And in a rarity in corporate America, the dividend has been hiked for 37 years in a row, making the company a rare â\u0080\u009cDividend Aristocrat.â\u0080\u009d Itâ\u0080\u0099s a title thatâ\u0080\u0099s anointed to firms that raise their payouts each year for at least a quarter-century, and is considered a matter of great pride by the firm. But the pandemic and resulting economic collapse which crushed energy prices has put the company in a vise. â\u0080\u009cXOMâ\u0080\u0099s balance sheet has been tested by the pandemic and the associated drop in crude oil prices, which have hurt operating cash flows,â\u0080\u009d writes CFRA analyst Stewart Glickman. â\u0080\u009cFor 2020, we see the company as roughly cash flow neutral, and thus preservation of the dividend (so far) has entailed more borrowing.â\u0080\u009d He adds: â\u0080\u009cAssuming crude oil prices do not relapse, we think XOM can sustain the dividend without additional borrowing.â\u0080\u009d This is pure guesswork, as the pandemic rolls on, including fears of so-called â\u0080\u009csecond waveâ\u0080\u009d that could further hurt energy demand and prices. ExxonMobilâ\u0080\u0099s move is the latest in a wave of corporate retrenchments that have occurred since the pandemic and accompanying economic crisis began six months ago. Scores of companies have taken often drastic measures to shore up their balance sheets. Some companies laid off workers. Some furloughed themâ\u0080\u0094a fancy word for a temporary layoff. Others cut or suspended 401(k) contributions to workersâ\u0080\u0099 retirement plans. Others took it to shareholders, slashing, or in some cases, eliminating dividends. This is unquestionably painful for income-oriented investors who have come to rely on dividends to maintain a certain standard of living. ExxonMobil, which just last week reported its second consecutive quarter of losses, amid â\u0080\u009cglobal oversupply and COVID-related demand impacts,â\u0080\u009d has said it remains committed to its dividend. But other oil majors have slashed theirs. Two examples: This spring, Royal Dutch Shell RDS, +4.35% Â cut its dividend for the first time in 80 years; BP BP, -0.74% â\u0080\u0094after saying it was also committed to its dividendâ\u0080\u0094announced a 50% cut two days ago."}]}