{"article": [{"url": "https://www.marketwatch.com/story/stock-futures-mostly-lower-ahead-of-powell-speech-11601983218", "published": 1602005720.0, "headline": "Dow closes 375 points lower as Trump calls end to fiscal stimulus talks until after election", "body": "NICHOLAS KAMM/AFP via Getty Images U.S. benchmark stock indexes closed sharply lower Tuesday after President Donald Trump said he would end negotiations on a new fiscal stimulus package, unnerving investors who hoped Washington lawmakers would strike a deal soon. What are major benchmarks doing? The Dow Jones Industrial Average DJIA, +0.56% gave up a gain of more than 200 points, falling 375.88 points, or 1.3%, to end at 27,772.76, while the S&P 500 SPX, +0.87% finished 47.66 points, or 1.4%, lower at 3,360.97. The Nasdaq Composite COMP, +1.39% fell 177.88 points, or 1.6%, to 11,154.60. The Dow on Monday rose 465.83 points or 1.7% to finish at 28,148.64, while the S&P 500 rose 60.19 points, or 1.8%, to close at 3,408.63. The Nasdaq finished at 11,332.49, up 257.47 points, or 2.3%. What’s driving the market? Stocks swooned after Trump said in a tweet that he would stop negotiating on another fiscal stimulus bill until after the November elections and would focus on advancing Amy Coney Barrett’s confirmation to the Supreme Court. His comments came the day after he left Walter Reed Medical Center after a three-night stay. “Certainly, there was this continual hope in markets that we would get something through [on fiscal stimulus]. That’s now been pushed out by Trump,” Max Gokhman, head of asset allocation at Pacific Life Fund Advisors, told MarketWatch. Fears the economic recovery could stall without another round of fiscal support have been on the rise just as unemployment began falling again in recent months as businesses reopened from lockdowns imposed to combat the coronavirus pandemic. Crunchtime is approaching for a fiscal deal, said Tom Plumb, portfolio manager of the Plumb Balanced Fund, in an interview. A plea Monday by management of Southwest Airlines LUV, +1.89% to union workers to make sacrifices due to the inaction of the federal government was a “shot across the bow,” Plumb said. As traditionally well-managed companies suffer, the potential for mass layoffs and other hardship come more sharply into focus, he said. In a speech to the National Association for Business Economics, Powell repeated that the U.S. economy needs more fiscal support even though the recovery from the “natural disaster” of the coronavirus pandemic so far has been strong. Shares in Cineworld CINE, +0.54% plunged 57% on Monday, after the world’s second-largest movie chain confirmed it will temporarily close its cinemas in the U.K. and the U.S., putting 45,000 jobs at risk. Read: Trump tweets ‘don’t be afraid of COVID,’ sparking heated Twitter exchanges In economic data, the U.S. trade deficit climbed almost 6% in August to $67.1 billion, the third widest gap on record, reflecting a continuing struggle by American exporters to recover all the ground lost in the early stages of the coronavirus pandemic. Economists polled by MarketWatch has forecast a $66.7 billion trade gap. Hiring and job openings in the private sector fell in August in a sign the U.S. labor market was cooling off as an economic recovery lost some of its earlier momentum, a government survey showed. Check out: Trump’s coronavirus recovery, stimulus hope, election clarity: What’s really driving the market? Which companies are in focus? Southwest Airlines shares LUV, +1.89% were up 2.1% after its call for union concessions. Boeing Co. BA, -0.39% shares dropped 6.3% after the aircraft maker forecast an 11% drop in demand for commercial planes in the next decade and, in a separate outlook for the commercial aviation market, said it sees passenger-traffic growth to increase by an average of 4% a year in the next two decades. Apple Inc. AAPL, +1.74% announced it would hold an online event on Oct. 13 that’s expected to bring the launch of its new family of iPhones. Shares were down 3%. Shares of Alexion Pharmaceuticals Inc. ALXN, +1.12% were up 0.5%, after the biopharmaceutical company said it expected to raise its 2020 revenue guidance by more than $200 million, when it reports third-quarter results. Shares of Sonos Inc. SONO are off 7.5% after a Bloomberg report highlighted that Apple Inc. AAPL is no longer selling the company’s speakers in its stores. General Electric Co.’s stock GE, +2.85% fell 4.1% after it received a “Wells notice” from the Securities and Exchange Commission related to accounting practices. Clover Health Investments Corp. announced Tuesday a merger with a “blank-check” company that will take the Medicare Advantage insurer public. What are other markets doing? The yield on the 10-year Treasury note TMUBMUSD10Y, 0.777% fell 1.9 basis points to 0.741%. Yields and bond prices move in opposite directions. In global equities, Hong Kong’s Hang Seng Index HSI, -0.30% rose 0.9%, while Japan’s Nikkei 225 NIK, -0.11% gained 0.5%. The pan-European Stoxx 600 Europe SXXP, +0.55% and London’s FTSE 100 UKX, +0.64% each rose 0.1%. Gold edged lower, with the December contract GOLD, +2.86% falling $11.40, or 0.6% to settle at $1,901.10 an ounce on Comex. Oil futures added to big gains scored on Monday, with the U.S. benchmark CL.1, -1.62% up $1.45, or3.7%, to settle at $40.67 a barrel. The greenback is up 0.2% for the day based on trading in the ICE U.S. Dollar Index. DXY, -0.58%"}]}