{"article": [{"url": "https://www.marketwatch.com/story/the-new-coronavirus-is-mutating-but-that-may-be-a-good-thing-says-top-expert-2020-08-18", "published": 1597851200.0, "headline": "The new coronavirus is mutating, but that 'may be a good thing,' says top expert", "body": "Increased mutation in the new coronavirus \"may be a good thing,\" a top expert has said. Paul Tambyah, senior consultant at the National University of Singapore and president-elect of the International Society of Infectious Diseases, said that a mutation of coronavirus that has been making the rounds in Europe, North America and parts of Asia may be infecting more people, but it is killing fewer. The new strain, known as D614G, has recently shown up in Malaysia and the Philippines. Tambyah said evidence suggests the proliferation of the D614G mutation in some parts of the world has coincided with a fall in death rates, suggesting it is less lethal, in an interview with Reuters, \"Maybe that's a good thing to have a virus that is more infectious but less deadly,\" he said. Barron's:Current dominant strain of COVID-19 more infectious than original: study Tambyah's comments come after Malaysia's director-general of health, Noor Hisham Abdullah, on Sunday urged people to take greater precautions because the strain has now been found in the country. Writing in a Facebook FB, +0.26%  post, Abdullah said the D614G strain was found to be 10 times as likely to infect other individuals as the one reported in Wuhan, China, in December 2019. It also spreads easier by so-called super-spreader individuals. \"The people's cooperation is very needed so that we can together break the chain of infection from any mutation,\" he wrote. Still, Tambyah said, even if the virus is mutating, that won't make potential vaccines less effective. Read:U.K. strikes two COVID-19 vaccine deals for 90 million doses Research in June by scientists at the Scripps Research Institute in Florida found that D614G has had the effect of markedly increasing the number of functional spikes on the viral surface. Those spikes are what allow the virus to bind to and infect cells. \"The number - or density - of functional spikes on the virus is four or five times greater due to this mutation,\" said Scripps virologist Hyeryun Choe, senior author of the study. The World Health Organization has said there is no evidence the strain leads to a more severe disease, Reuters noted."}]}