{"article": [{"url": "https://www.marketwatch.com/story/mnuchin-calls-for-extending-ppp-but-targeting-it-at-smaller-companies-and-restaurants-hotels-2020-07-17", "published": 1594994360.0, "headline": "Mnuchin backs extending PPP but targeting it at 'smaller companies' and restaurants, hotels, as he also talks up loan forgiveness", "body": "U.S. Treasury Secretary Steven Mnuchin on Friday signaled the Trump administration was interested in giving new life to a coronavirus aid program for small businesses but making it more targeted, as he spoke at a House hearing about what may go in Washington's next coronavirus aid package. \"A next phase of relief should extend the PPP, but on a more targeted basis for smaller companies and those that are especially hard hit, such as restaurants, hotels and other travel and hospitality businesses,\" Mnuchin said, referring to the Paycheck Protection Program. He also said that \"certain industries, such as construction, are recovering quickly,\" but travel and retail are facing longer-term challenges. In addition, the Treasury secretary expressed some support for blanket forgiveness of smaller PPP loans, after one lawmaker asked about a proposal to forgive all such loans under $150,000. \"I know one of the things we'll talk about is should we just have forgiveness for all the small loans. I think that's something we should consider,\" Mnuchin said. \"We should obviously make sure there's some fraud protection.\" Related:'My PPP loan allowed me to reopen, but it is not going to allow me to stay open' - restaurant owner lobbies Congress for $120 billion relief fund The Democratic-run House and Republican-run Senate are on break and largely away from Washington, D.C., but lawmakers are set to return Monday and ramp up their negotiations with the Trump administration over what will go in the federal government's next big coronavirus relief package, which is now expected to become reality around early August. Mnuchin's comments came during a hearing held by the House Small Business Committee on the federal government's coronavirus aid programs. In another exchange with a lawmaker, the Treasury secretary appeared to suggest a communications campaign was coming to address a drop in supplies of coins due to virus lockdowns. \"We are working very closely with the Mint and the Federal Reserve on the coin shortage,\" he said. \"As a result of COVID, a lot of the coinage is stuck, but we are working on a public messaging.\" The PPP, which has received $670 billion in funding through April's $484 billion relief package and March's $2.2 trillion CARES Act, has drawn criticism over how public companies scored loans, as well as over sending money to less hard-hit areas and allegedly discriminating against businesses owned by women and minorities. The program has provided about 5 million loans worth $518 billion, according to Small Business Administration data as of Thursday. U.S. stocks SPX, +0.87% DJIA, +0.56% have rallied from their March lows thanks in part to optimism around Washington's aid efforts, and the S&P 500 and Dow industrials on Friday were on track to post weekly gains."}]}