{"article": [{"url": "https://www.marketwatch.com/story/clueless-investors-just-keep-driving-this-stupidly-bullish-stock-market-higher-cnbcs-jim-cramer-says-2020-08-05", "published": 1596632960.0, "headline": "'Clueless' investors just keep driving this 'stupidly bullish' stock market higher, CNBC's Jim Cramer says", "body": "“ 'Sometimes the market rallies and it makes perfect sense. Then there are days like today, when I can't take how stupidly bullish this market can be.' ” That's CNBC \"Mad Money\" host Jim Cramer shaking his head at 'clueless' investors who ignored multiple warning signs to buy up stocks during Tuesday's bullish trading action. \"Never underestimate the power of enthusiastic buyers who do not know what they're doing,\" he said after the Dow Jones Industrial Average DJIA, +0.56%  finished the session with a triple-digit gain. The S&P 500 SPX, +0.87%  and Nasdaq Composite COMP, +1.39%  also ended higher. He specifically pointed to oil giant BP BP, -0.74%  and biopharma firm Sorrento SRNE, +0.67%  as examples. There's \"plenty of stupidity,\" he said, \"especially during earnings season when there's so much news that it's hard to keep track of what's going on.\" BP's surge, in particular, didn't sit right with Cramer, who said it might be the \"dumbest action\" so far this year. \"Not only are they telling you business is terrible, BP is trying to distance itself from crude while preserving cash, but maybe that dividend hike was a mistake,\" he said. In Sorrento's case, Cramer pointed out the stock barely rallied last week when the company announced a new saliva-based Covid-19 test that yields results within half an hour. But then on Tuesday, the stock surged for the same reason. \"The stock market's supposed to be efficient,\" he said, \"but somehow it took Wall Street six days to process this news.\" Watch this clip: As for Wednesday's session, more stupidity? The Dow was up more than 300 points, at last check, while both the S&P and Nasdaq were adding to recent gains, as well. \"Are any of these moves the fault of the Fed?\" Cramer wrote in a separate take. \"No, the fault, as Cassius tells us, is not in our stars like Trump or Powell, but in the buyers themselves.\""}]}