{"article": [{"url": "https://www.marketwatch.com/story/my-mother-in-law-is-narcissistic-my-father-in-law-is-selfish-my-brother-in-law-is-amoral-how-do-we-protect-our-inheritance-2020-10-01", "published": 1601831180.0, "headline": "My mother-in-law is narcissistic. My father-in-law is selfish. My brother-in-law is amoral. How do we protect our inheritance?", "body": "Dear Moneyist, My in-laws are difficult: My mother-in-law is bipolar and narcissistic. My father-in-law is entirely selfish, and my brother-in-law is pretty amoral and lacks scruples. Trust me on this. My father-in-law and mother-in-law live on my brother-in-law’s farm in Florida. My parents-in-law pay for lifestyle expenses, utilities, animal feed, vet bills, etc., and consistently “loan” money to my brother-in-law without hope of repayment. By the way, my brother-in-law is a multimillionaire (although cash poor) and hasn’t worked in 10 years. My father-in-law was a New York City teacher and draws an annual pension worth six figures. Through a lifetime of spending at or beyond their financial limits, my parents-in-law have acquired several valuable pieces (art, antique furniture, etc.) and, due to my father-in-law’s pension, have a few hundred thousand dollars in the bank. The Moneyist:‘He doesn’t give me any money’: My husband has been making secret payments to his parents. Should I tell him to stop? My husband, who is wonderful and responsible, and I are expecting our first child. (We’re so excited.) My husband has asked his father to draw up a will that would exclude us but protect the inheritance of his future grandchild. We both expect that his brother will end up draining my in-laws dry and taking everything valuable for himself. My father-in-law refused to create a will, saying “not to worry about it” and assuring us everything would work out fine. Obviously, that’s no comfort at all. As an aside, my mother-in-law has dementia and relies on her husband as a caretaker; we cannot rely on her help in this matter at all. What can we do to protect the inheritance of our future child? In the absence of a will, would my FIL’s estate be divided evenly between his two children? How can we make sure that my brother-in-law doesn’t drain his parents dry? Thank you, Concerned for my child The Moneyist: ‘We bet on the wrong horse’: I co-signed my nephew’s $55K student loan: He has no degree and no job. What should we do? Dear Mother, I am #TeamFIL. Imagine, for a moment, that you sent this letter to your father-in-law instead of me. What would he think? You lost me on this line: “My mother-in-law has dementia and relies on her husband as a caretaker; we cannot rely on her help in this matter at all.” If you see your mother-in-law’s dementia as an impediment to you and your husband securing your inheritance and/or your child’s inheritance — they are essentially the same thing in this situation — the problem lies not with your in-laws, but with you. Your in-laws have made smart financial decisions in their lives. I trust your father-in-law to make smart decisions in relation to his estate. He may or may not have a will. He may or may not leave money to you and your husband and child. His money. His choice. Trying to control the behavior of others is a fool’s game. It can start with your in-laws’ estate and trickle all the way down to the person standing in line in front of you at the bank: “Why can’t they move faster? Why can’t they take me into account? Why can’t they do what I want?” It is a one-way ticket to a life of anger and frustration where everyone except for you is the problem. If everyone else is the problem — your “selfish” father-in-law, your “narcissistic” mother-in-law, your “amoral” brother-in-law — then you’re the problem. The Moneyist: My wife had a baby in June. She has $160,000 in student loans — and just asked for my ‘blessing’ to work part time Every dollar and cent that goes to helping your brother-in-law is a dollar and cent that does not go to you. It sounds like a frustrating and infuriating situation for you. But it is one entirely of your own making. It’s your father-in-law’s money, his son, his relationship, his business. He may have a will. He may not. But one way to control who your father-in-law leaves his money to in his will, assuming he does have one, is to keep making his business your business, and to keep casting judgment on everyone else in your family except yourself. If I were your father-in-law, I might want to continue helping people after I’m gone. If he is taking care of his wife now, he could leave his estate to the Alzheimer’s Foundation of America or Dementia Society of America, which help elderly people like your mother-in-law. When you try to control other people’s actions and spend your time persuading them to see the world from your point of view, you are effectively playing God. That is probably the most impossible role to play in this life. Play the role of wife, mother, friend and kind daughter-in-law instead. Living a life where you want nothing from anyone is a freeing and happy place to be. You have a child on the way. Your husband cares about you, and it sounds like you think the world of him. You have many good things in your life. Focus on those non-monetary gifts instead. Be #TeamFIL too. You can email The Moneyist with any financial and ethical questions at qfottrell@marketwatch.com. Want to read more?Follow Quentin Fottrell on Twitterand read more of his columns here. Hello there, MarketWatchers. Check out the Moneyist private Facebook FB, +0.26% group where we look for answers to life’s thorniest money issues. Readers write in to me with all sorts of dilemmas. Post your questions, tell me what you want to know more about, or weigh in on the latest Moneyist columns."}]}