{"article": [{"url": "https://www.marketwatch.com/story/forget-earnings-season-whats-the-rest-of-2020-going-to-look-like-2020-07-04", "published": 1594373840.0, "headline": "Forget earnings season. What's the rest of 2020 going to look like?", "body": "Investors will return from a long holiday weekend in the U.S. on Monday to what may be the calm before the storm: a relatively quiet week before a deluge of second-quarter corporate earnings reports are published starting July 13. Most observers are looking past second quarter earnings, as they are likely to not only be awful, but to come without any useful guidance from companies on what to expect for the rest of the year. The bigger question, then, is: what's next? Analysts who spoke with MarketWatch range from very downbeat to cautiously optimistic on the second half of 2020, a year that's already been one for the record books. \"The market is pricing in a (coronavirus) vaccine by Labor Day as well as endless fiscal and monetary stimulus. We have so many positive data points priced in that if we don't get them, markets could go down,\" said David Rosenberg, a longtime analyst now running his own firm, Rosenberg Research. Public health experts are concerned that the pandemic is far from contained as the U.S. headed into the July 4 holiday weekend. Meanwhile Dr. Anthony Fauci, head of the National Institute for Allergies and Infectious Diseases, told CNN last week that the U.S. is unlikely to develop herd immunity to the illness because any vaccine may only be partially effective and a large number of Americans are unlikely to be vaccinated. In election years for the U.S. stock market, \"When the first quarter is negative, and the second quarter is positive, the second half has been higher by an average of 8%,\" said Lindsey Bell, chief investment strategist for Ally Invest. But, Bell added, \"In 2020, anything is possible.\" Here are some broad points of consensus: Earnings season will be moot. Roughly half of all companies in the S&P 500 index have withdrawn earnings guidance, noted Donald Calcagni, chief investment officer with Mercer Advisors, and \"the few who haven't, are just afraid to.\" Bell thinks some companies may be able to give some informal guidance, including perhaps about how the first few weeks of the third quarter are looking, but that may clarify very little. As she noted, FedEx FDX, +0.18%  had a stellar quarter, with a boom in e-commerce pushing its earnings well above Wall Street estimates, but Nike NKE, +0.97%  disappointed. \"I think it's going to be a mixed bag, but estimates are low enough that you could see some nice beats,\" Bell said. All the analysts who spoke with MarketWatch also pointed out that valuations are high, even as actual earnings are likely to be pretty dismal, overall. Related:It's been 100 days since coronavirus sent the stock market to rock bottom. Here's what comes next after its best rally over that period in 80 years Without a lot of economic clarity, headlines are likely to drive markets \"The market's in a holding pattern,\" Calcagni said. \"Ever since the big sell-off in June, I think the market has been looking for direction. Most of the trading now is probably driven by rebalancing.\" Look for headlines on China to whipsaw markets, Bell told MarketWatch. \"Trump wants to blame China for COVID-19 and he believes his base likes him taking a harder stance on China.\" Analysts didn't provide any consensus on whether President Donald Trump or Democrat Joe Biden looks more likely to win the November 2020 election, or which outcome will be more palatable to markets. However, all think that the daily data on coronavirus case counts and progress toward a vaccine or treatment will keep markets hopping. Also important may be the looming fiscal cliff when the extra $600-per-week unemployment benefit ends next month and various moratoria on rent and mortgage payments. While many Washington observers think Congress is likely to extend the extra benefit, that's not a given, and many believe it's so far been responsible for keeping consumer spending and confidence from falling off a cliff. Where do asset prices go from here? It's anyone's guess. \"I think the markets may be vulnerable to another correction,\" Rosenberg said in an interview. \"I am not giving up on the prospect that we re-test the lows. It's not my base case, but it's very interesting that we've made attempts at the highs but not the lows. A re-test would be a healthy thing.\" In a research note out June 30, analysts at DeutscheBank wrote that \"attention will focus on the US Presidential election in what looks to be a tight race, which has historically meant a range bound market till the uncertainty is resolved, followed by a strong rally into year-end regardless of who won.\" The DeutscheBank team are \"bearish\" on the US dollar, and expect the 10-year U.S. Treasury TMUBMUSD10Y, 0.777%  to end the year at 0.70% - roughly where it is now. In the holiday-shortened week, the Dow Jones Industrial Average DJIA, +0.56%  added about 3.3%, bringing its year-to-date decline to 9.5%, while the S&P 500 SPX, +0.87%  gained about 4%, and is now down 3.1% for the year. The Nasdaq Composite COMP, +1.39%  is nearly 14% higher in the year to date, after taking another 4.6% leg up."}]}