{"article": [{"url": "https://www.marketwatch.com/story/brent-oil-scores-lift-from-saudi-price-rise-china-optimism-while-us-crude-weighed-by-rising-coronavirus-cases-2020-07-06", "published": 1594049480.0, "headline": "Brent oil scores a lift from Saudi price rise, China optimism, while rising coronavirus cases pressure U.S. crude", "body": "Crude-oil futures on Monday settled on a mixed note, with the U.S. oil moves pressured by the growth in coronavirus cases, but international prices gaining on hopes of China’s perceived recovery from the pandemic. Brent, the international benchmark oil, also was supported by Saudi Arabia’s decision to raise the premium of its benchmark grade crude, and all other grades, by $1 a barrel, according to Reuters, citing people familiar with the matter, representing the third straight price increase by one of the biggest exporters of oil and the most influential member of the Organization of the Petroleum Exporting Countries. A blockade of oil-producing country Libya also remains in place, hindering exports from the north African producer, and helping to fuel expectations that supplies for crude may tighten more than expected. Mustafa Sanalla, chairman of Libya’s National Oil Company, told the Financial Times (paywall) in an interview over the weekend that “some regional countries are complicating the negotiations while enjoying the absence of Libyan oil from the market.” The oil embargo has driven Libya’s daily oil production to 100,000 a barrel from an average of 1.2 million, the FT reported. “Libya is shipping out a lot less crude and this just helps with that tighter supply theme,” wrote Edward Moya, senior market analyst at Oanda, in a daily research report. “Maybe crude prices have a couple of dollars left in this rally, but the catalyst won’t come from modestly improving economic data, stimulus support for the global economy, tighter supplies, and improving OPEC+ compliance,” he said. “Everyone is bracing for the easing of production cuts in August and that will be when the battle for market share resumes.” Energy-producing nations have “weathered the COVID-19 demand devastation storm and noncompliance [with output cuts] should become the end-of-summer theme for OPEC+,” said Moya. On Monday, West Texas Intermediate crude for August US:CLQ20 lost 2 cents, or 0.05%, to settle at $40.63 a barrel on the New York Mercantile Exchange, after posting a weekly gain of 5% on Thursday, with U.S. markets closed for Independence Day on Friday. Global benchmark Brent oil for September UK:BRNU20, however, rose 30 cents, or 0.7%, from Friday's shortened session on the ICE Futures Europe exchange, to settle at $43.10 a barrel. “Everything is pretty well priced in at this stage and unless we see a significant change on the economic outlook or these new waves of coronavirus,” said Craig Erlam, senior market analyst at Oanda, in a market update. “We may have to wait to see what’s agreed on the output side before we see any further big moves.” The size of output cuts under a pact between members of the Organization of the Petroleum Exporting Countries and their allies is set to decline at the start of August. U.S. markets have been contending with growing cases of COVID-19, with the U.S. adding more than 49,000 new cases on Sunday, according to data compiled by Johns Hopkins University. Cases in the U.S. account for about a quarter of the global total of more than 11.4 million infections. But assets considered risky also have seen an uptrend, partly on the back of hope that China, one of the biggest importers of crude globally, can continue to show progress from emerging from the viral pandemic. Chinese equities rallied Monday. Over in the U.S., a federal judge on Monday ordered the shutdown of the Dakota Access pipeline and said it must be emptied within 30 days, until a more extensive environmental review is completed, according to court documents. The 1,172-mile underground pipeline, which has been in operation since June 2017 and can transport 570,000 barrels of oil per day, runs beneath the Missouri River, north of the Standing Rock Indian Reservation. “While the pipeline closure may be a win for environmentalists and the Standing Rock Sioux tribe, it is another blow to the U.S. shale patch that has already been hit hard from the COVID-19 virus and a historic drop in demand,” said Phil Flynn, senior market analyst at The Price Futures Group. Among the oil products traded on Nymex Monday, August gasoline US:RBQ20 fell by 1.5% to $1.2408 a gallon, while August heating oil US:HOQ20 tacked on 0.9% to $1.2417 a gallon. Meanwhile, Duke Energy Corp. DUK, +0.16% and Dominion Energy D, -0.34% said that they were abandoning plans to build a $8 billion natural-gas pipeline in West Virginia and North Caroline, with Dominion agreeing to unload natural-gas assets to Warren Buffett’s Berkshire Hathaway BRK.A, +0.06% BRK.B, +0.24% for a total of $9.7 billion, including debt. “If completed, the pipeline would have brought gas from the most prolific gas shale region—which also has some of the lowest break-even costs—to the broader market, likely pressuring Henry Hub [gas] prices,” said Robbie Fraser, senior commodity analyst at Schneider Electric, in a daily note. August natural gas US:NGQ20 settled 10 cents, or 5.5%, higher at $1.83 per million British thermal units on Monday, after putting in a weekly gain of 12% on Thursday."}]}