{"article": [{"url": "https://www.marketwatch.com/story/how-to-retrain-for-your-next-career-in-three-months-free-11602170226", "published": 1602261140.0, "headline": "Feel too old to go back to school? How to retrain for your next career in three months â\u0080\u0094 free", "body": "Owen Wilson and Vince Vaughn as Those Middle-Aged Interns A friend in her 50s recently abandoned plans to change career. Although sheâ\u0080\u0099s well educated, with a masterâ\u0080\u0099s degree, and has plenty of technical skills, retraining was going to require a commitment of four years to get another degree. In your teens and 20s, a four-year degree is part of life. But in your 50s, itâ\u0080\u0099s just not viable for many people. They have got mortgages, and children, and other commitments. And they have less career time left in which to recoup their investment. Once youâ\u0080\u0099ve been out of school for more thanÂ 10Â years, the educational requirements to retrain go up, not down. Colleges demand you take more refresher courses and so on. This isnâ\u0080\u0099t just a problem for her. Itâ\u0080\u0099s a problem for all of us. Society as a whole is going to have to find a way of retraining and reskilling more workers in their 40s and 50s. Thatâ\u0080\u0099s because weâ\u0080\u0099re going to need people to work longer before they retire, and because jobs are changing so much and so quickly. If we donâ\u0080\u0099t do it, weâ\u0080\u0099re going to have an older unemployment problem and a retirement problem (and a skills shortage). (Yes, it is sort of the plot of the 2013 comedy â\u0080\u009cThe Internshipâ\u0080\u009d starring Vince Vaughn and Owen Wilson.) COVID-19Â is making this more urgent, not less. More thanÂ four million people overÂ ageÂ 45 have lost their jobs since the start of the year, even with the rebound. Right now, half the unemployed are over 35. So hereâ\u0080\u0099s some good news (for once). Generation, a nonprofit launched by consultants from McKinsey & Co. (where I used to work) have found a way of training, or retraining, people for new, skilled careers, and doing it well, cheaply and fast. How fast? Try one to three months. Yes, really. Cost? To the students, zero. The employers are paying. But the underlying costs arenâ\u0080\u0099t that great anywayâ\u0080\u0094maybe $5,000 or less in more expensive Western countries, they tell me, but as little as $500 in emerging countries where costs are lower. No, of course they arenâ\u0080\u0099t training neurosurgeons in that time, or fully-qualified nurses, or architects. But theyâ\u0080\u0099re training people for skilled roles: Nursing assistants, lab technicians, hospital administrators, contact tracers, green energy jobs. How do you train someone for a completely new and skilled job very quickly? Mona Mourshed, a former McKinsey consultant and the founding CEO of Generation, explains. Itâ\u0080\u0099s a â\u0080\u009cboot camp,â\u0080\u009dÂ she says. The students are learning from 9 to 5, five days a week. And the emphasis is on simulations, role-playing, projects and activities as opposed to just learning theory. They focus on â\u0080\u009con activities as opposed to skills,â\u0080\u009d she says. Working with employers, the people behind Generation analyzed what workers in these jobs were really doing from day to day. â\u0080\u009cWhat you actually need is a studyÂ of 30Â [typical] activities in a day to be able to do your job,â\u0080\u009d says Mourshed.Â It works. In five years, Generation has trained about 38,000 people for new careers and a stunning 86% got jobs within three months, Mourshed says. Most of those are moving into roles with no previous experience. (And this is global. Thereâ\u0080\u0099s a neighborhood of Nairobi, in Kenya, where nearly 10% of the youth have been through the program.) I attended a recent class. Actually, it reminded me of the training programs we used to get when I was at McKinsey: Group sessions, breakouts, lots of problem-solving in teams. Two-dozen students from various backgrounds were halfway through a 12-week course that would make them qualified to get good jobs as (junior) data engineers. Many of the students had no background in IT. Participant Alex Scovell, a former employee at a nonprofit, told me his prior knowledge of coding consisted of taking â\u0080\u009cIntroduction to Pythonâ\u0080\u009d on Udemy. So far, nearly all of those trained are younger people, age 18 to 29. But when Mourshed and I spoke on the phone, sheÂ toldÂ me they are now ramping up â\u0080\u009cReGeneration,â\u0080\u009d a program for the over-35s. â\u0080\u009cWeâ\u0080\u0099re seeing an increasing number of ReGeneration candidates who are applying,â\u0080\u009d she said. â\u0080\u009cPost-COVID, weâ\u0080\u0099re seeing a much greater surgeâ\u0080¦. We think this population is absolutely going to increase. We have to crack this. This population is very underserved, and there are very few programs that provide support to them.â\u0080\u009d Changing careers and retraining later in life, especially from your 40s onward, brings challenges, she says. Many employers are still biased. So far employment rates for workers in the ReGeneration program are lower than for younger workers, though they are still around 55%. â\u0080\u009cHereâ\u0080\u0099s what we know,â\u0080\u009d she says. â\u0080\u009cThereâ\u0080\u0099s often a misconception that midcareer learners are less able to master new skills. That is completely untrue. Thatâ\u0080\u0099s very much a myth. Their mastery levels are on a par [with younger workers], and thatâ\u0080\u0099s across professions.â\u0080\u009d Among the advantages that older workers bring, she points out, are â\u0080\u009cgreater life experiences and judgment.â\u0080\u009d Managing the psychology for older students is a critical factor for success, Mourshed says. Generation has found mentoring is critical, both during and after graduation. â\u0080\u009cIt can often be quite daunting, to shift from something youâ\u0080\u0099ve been doing your life into a new job,â\u0080\u009d says Mourshed. Whatâ\u0080\u0099s the key to success when youâ\u0080\u0099re retraining? â\u0080\u009cThe presence and cultivation of a â\u0080\u0098growth mind-set,â\u0080\u0099â\u0080\u009d she says, citing the work of psychologist Carol Dweck. People who succeed have â\u0080\u009ca fire in the belly,â\u0080\u009d and â\u0080\u009crecognize that if you work hard you will learn. The brain is a muscle. The more effort you put into learning, the better you will get.â\u0080\u009d"}]}