{"article": [{"url": "https://www.marketwatch.com/story/its-unrealistic-for-investors-to-bet-on-trump-administrations-1-trillion-infrastructure-plan-analyst-says-2020-06-16", "published": 1592317400.0, "headline": "Itâ\u0080\u0099s â\u0080\u0098unrealisticâ\u0080\u0099 for investors to bet on Trump administrationâ\u0080\u0099s $1 trillion infrastructure plan, analyst says", "body": "While the Trump administration is reportedly preparing a nearly $1 trillion infrastructure plan, analysts have doubts about whether that type of package could become a reality in divided Washington. â\u0080\u009cA standalone $1T stimulus bill authored by the White House is unrealistic for market participants to anticipate before the election,â\u0080\u009d said Henrietta Treyz, director of economic policy at Veda Partners, in an email to MarketWatch on Tuesday. The White House spending plan would be mostly for traditional infrastructure such as roads and bridges but also set aside funds for 5G wireless infrastructure and rural broadband, said a Bloomberg News report late Monday citing unnamed sources. The current surface transportation law is up for renewal by Sept. 30, and the administration sees that as a possible vehicle to get a broader package, the report also said. â\u0080\u009cThere are three bills in the pipeline between now and the election which could potentially include up to $100B in combined infrastructure spending, but no standalone package is likely given longstanding Republican opposition, Democratsâ\u0080\u0099 preference for a more substantial ~$3T Heroes Act (and separate $760B/5 years infrastructure bill), and the White Houseâ\u0080\u0099s inability to stay on message for any consistent period of time,â\u0080\u009d Treyz also said, referring to a stimulus measure passed by the Democratic-run House last month and an infrastructure plan rolled out in January. â\u0080\u009cWeâ\u0080\u0099ve seen the administration insist that theyâ\u0080\u0099ll be providing payroll tax holidays and substantial infrastructure bills for the last six months and as the last three stimulus bills have shown, they are never incorporated into a final deal on Capitol Hill.â\u0080\u009d Read more:Washington could deliver a â\u0080\u0098small-scaleâ\u0080\u0099 infrastructure bill before November elections The House Transportation and Infrastructure Committee on Wednesday is expected to advance a $494 billion INVEST in America Act, a separate infrastructure measure that Democratic lawmakers rolled out earlier this month. That measureâ\u0080\u0099s â\u0080\u009cheavy focus on the environment including significant funding for public transit and elements of the Green New Dealâ\u0080\u009d has â\u0080\u009cnot built momentum for compromise,â\u0080\u009d said analysts at Height Capital Markets in a note on Tuesday. While the Trump administrationâ\u0080\u0099s plan appears to provide funds for some Democratic priorities, â\u0080\u009ccommon ground on environmental components remains a roadblock,â\u0080\u009d the analysts added. The Height team also said a bipartisan infrastructure package could become reality eventually. â\u0080\u009cIn our view, infrastructure is unlikely to gain traction in the health response and economic stabilization phase of the pandemic/recession because the funds make their way into the economy gradually compared to forms of direct assistance,â\u0080\u009d the analysts wrote. â\u0080\u009cHowever, once the stabilization phase of the governmentâ\u0080\u0099s response evolves into an economic rehabilitation phase, we view infrastructure funding as a high-probability candidate because it is viewed as having a high multiplier effect through the economy.â\u0080\u009d Construction-related stocks were surging Tuesday, while the broad S&P 500 index SPX, +0.87% Â rose 2%. U.S. Concrete Inc. USCR, -2.02% Â jumped 19%, Vulcan Materials Co. VMC, -1.50% climbed 9% and Martin Marietta Materials Inc. MLM, -0.98% Â soared 7%. Trump was due to address rural broadband on Thursday. Separate from a possible infrastructure package, analysts have been expecting Washington to deliver another coronavirus relief measure by late July with a price tag between $1 trillion and $2 trillion. The Republican-run Senate and the Trump administration have emphasized that their priorities in the next package include limiting coronavirus liability for businesses and a potential â\u0080\u009creturn-to-work bonus,â\u0080\u009d while Democratic lawmakersâ\u0080\u0099 priorities include aid for state and local governments."}]}