{"article": [{"url": "https://www.marketwatch.com/story/july-empire-state-index-in-positive-territory-for-first-time-since-pandemic-began-2020-07-15", "published": 1594807340.0, "headline": "July Empire state index in positive territory for first time since pandemic began", "body": "The numbers: Business activity in New York state increased in July for the first time since the pandemic began in March, according to the New York Fed’s Empire State Manufacturing Survey released Wednesday. The Empire State business conditions index rose to 17.2 in July from negative 0.2 in the prior month. A reading above zero indicates improving conditions. Economists had expected a reading of 8.9, according to a survey by Econoday. What happened: Forty-one percent of manufacturers reported that conditions were better in early July than in June, up from 36% in the prior survey. The new-orders index rose 14.5 points to 13.9, indicating that orders increased. Shipments climbed 15.2 points to 18.5. The index for employees rose 3.9 points to 0.4 in July, signaling that employment levels were steady. After jumping to a multiyear high in June, optimism about future conditions cooled a bit this month, with the index for future conditions falling 18.1 points to 38.4. Big picture: The Empire State index has improved steadily since hitting a record low of negative 78.2 in April. More factories are opening, even with new health guidelines in place. The index doesn’t measure levels of activity, just rates of change. It is closely followed because it is the first of several regional manufacturing gauges to be released. While they can frequently be volatile from month to month, taken together the regional indexes present one of the timeliest reads on a crucial cyclical sector. The national ISM factory index rose to 52.6% in June from an 11-year low of 41.5% in April. What are they saying? “Recovery continues, but further significant near-term gains are unlikely,” said Ian Shepherdson, chief economist at Pantheon Macroeconomics. Market reaction: U.S. stocks opened sharply higher on Wednesday. The Dow Jones Industrial Average DJIA, +0.56% rallied in early morning trading."}]}