{"article": [{"url": "https://www.marketwatch.com/story/job-trouble-wave-of-rehiring-after-economy-reopened-to-fade-in-july-after-viral-spiral-2020-08-01", "published": 1596452240.0, "headline": "Job trouble? Wave of rehiring after economy reopened to fade in July after viral spiral", "body": "The engine of the U.S. economy may have gotten clogged again — no thanks to the recent acceleration in coronavirus cases. That’s bad news for Americans hoping to return to their old jobs. Just how much damage has been done will become more evident this week, especially from the U.S. employment report for July due next Friday. The number of jobs regained last month is unlikely to match the huge increases in May and June that totaled a combined 7.5 million. Wall Street DJIA, +0.56% economists predict the U.S. added about 1.5 million jobs in July. Even that estimate may be inflated though by seasonal changes in educational employment at the state and local level, Morgan Stanley contends. Private-sector jobs could increase by less than one million, the investment bank calculated. See: MarketWatch Economic Calendar Whatever the case, a much smaller increase in hiring or rehiring in July would bode ill for the U.S. recovery from the coronavirus pandemic. The government last week reported that gross domestic product sank a whopping 32.9% in the second quarter on an annualized basis, the biggest decline since World War Two. Read: Economy suffers titanic 32.9% plunge in 2nd quarter, points to drawn-out recovery Also:‘A massive welfare economy’ - federal aid prevents even steeper GDP collapse “The big question hovering over next week’s employment report is whether the two-month surge in job gains stopped in July,” says David Donabedian, chief investment officer of CIBC Private Wealth Management. He thinks that’s exactly what happened. It will be hard for the economy to make up a lot of lost ground in the third quarter unless hiring snaps back even faster. See:MarketWatch Coronavirus Recovery Tracker The U.S. lost a record 22 million jobs in March and April, according to Labor Department data. So far the economy has recovered less than one-third of those jobs. The weekly tally of jobless claims, meanwhile, showed an even higher 30 million unemployed people were collecting benefits as of mid-July, representing about one in five Americans who said they were working before the pandemic, according to a Labor Department survey of households. Robert Frick, corporate economist at Navy Federal Credit Union, said many people who expect to return to work are going to find they have no jobs or businesses to which they can return, a “grim reminder” of how much long-term damage the pandemic has caused. “In the long run we are going to see a sobering slowdown in job growth,” he said. The still-high level of unemployment, the viral spiral, and the uncertainty over whether Washington will provide more financial aid has understandably made Americans feel less confidence. On Friday Congressional lawmakers were still at odds on the next relief package with many benefits set to expire at the end of July. A variety of measures that monitor consumer attitudes show a clear deterioration in July that’s likely to bleed over into August. That will make a recovery even harder. Read:Consumer confidence wanes in July and points to rockier economic recovery And:Consumer sentiment falls as coronavirus cases rise and federal aid set to expire The news might not all be negative next week, however. Manufacturers — auto makers in particular — have shown more resilience than the service side of the economy. The closely followed ISM manufacturing survey could show improvement for the third straight month. The housing industry has also snapped back faster than expected amid a surge in home sales. Prospective buyers with secure jobs are taking advantage of record-low interest rates to buy new homes, a trend that may have been fueled by people fleeing the closed spaces of cities with a high number of coronavirus cases. Even that potential bit of good news, however, has been overshadowed by the broader damage to the economy from the latest spike in coronavirus cases in many American states. A full recovery can’t take root and blossom, economists say, until the disease is brought under control. See: Pandemic will continue for some time, experts tell Congress as U.S. case tally nears 4.5 million"}]}