{"article": [{"url": "https://www.marketwatch.com/story/oil-down-sharply-as-us-driving-season-comes-to-end-2020-09-08", "published": 1599578720.0, "headline": "Oil prices settle at lowest since June, with Brent prices below $40", "body": "Oil futures fell Tuesday to their lowest settlement since June, unable to shake off worries about crude demand due to a continued rise in coronavirus cases globally, the end of U.S. summer holiday driving season and a report that Saudi Arabia plans to cut its oil prices in October. The U.S. benchmark, West Texas Intermediate crude for October delivery CL.1, -1.62% US:CLV20 fell $3.01, or 7.6%, to $36.76 a barrel on the New York Mercantile Exchange. November Brent crude BRN.1, -0.07% UK:BRNX20, the global benchmark, lost $2.23, or 5.3%, at $39.78 a barrel on ICE Futures Europe, after a 1.5% decline on Monday, when U.S. markets were closed for Labor Day. Both crude benchmarks marked their lowest front-month contract settlements since June, according to Dow Jones Market Data. The spread between the WTI and Brent benchmarks, meanwhile, was at its widest since Aug. 20. Brent crude was pressured Monday after Saudi Arabia lowered its official selling price for Asian buyers, analysts said, which was taken as a sign of weak demand. Prices were expected to be cut for Asia-bound crude by $1 to $2 a barrel, market sources told S&P Global Platts in the last week of August. The key concern for the market remains demand, and with China having restocked in prior months, sizable fresh Chinese buying appears to be absent from the market at the moment,” said Warren Patterson, global head of commodities at ING, in a note. Read:How a big decline in China’s oil imports may ‘test the resiliency of the market’ After record volumes in June, customs data showed Chinese crude imports in August averaged 11.23 million barrels a day, down from 12.13 million barrels in July and well below the record 12.99 million barrels seen in June, he said, noting that on a year-over-year basis, imports remain up 13%. The decline for oil prices also comes as U.S. driving season, the period between Memorial Day and Labor Day, comes to an end, pointing to seasonal weakness in demand for gasoline. Despite the headline news of the Saudis cutting oil prices and lower demand concerns due to the pandemic, however, Daniel Flynn, a market analyst at The Price Futures Group said he believes the market “already has priced in lower demand and has recovered from the market going negative a few months back.” So if “states continue to reopen, we should see businesses and demand increase to levels that were expected before this nightmare,” he said in a daily report. On Nymex, October gasoline US:RBV20 fell 6.3% to $1.1028 a gallon, while October heating oil US:HOV20 dropped 6.5% to $1.0768 a gallon. Both front-month contracts ended at their lowest since early June. October natural-gas futures US:NGV20 lost 7.3% at $2.40 per million British thermal units."}]}