{"article": [{"url": "https://www.marketwatch.com/story/jobless-claims-fall-almost-250000-to-119-million-to-mark-new-pandemic-low-2020-08-06", "published": 1596707780.0, "headline": "Jobless claims fall almost 250,000 to 1.19 million to mark new pandemic low", "body": "The numbers: Initial jobless claims fell by 249,000 in early August to 1.19 million and touched the lowest level since the coronavirus pandemic began more than four months ago, a surprising decline that suggest some improvement in the labor market despite another surge in coronavirus cases in many U.S. states. New applications for unemployment benefits, a rough gauge of layoffs, slipped for the first time in three weeks to 1.19 million from 1.44 million, the Labor Department said Thursday. It was the biggest one-week decline since early June. Economists polled by MarketWatch had forecast 1.4 million new claims in the seven days ended Aug. 1. These seasonally adjusted figures reflect applications filed the traditional way through state unemployment offices. The big drop in claims might stem in part from the pending expiration of a $600 federal unemployment stipend at the end of July, economists say. The program’s lapse could have led some people to believe they were no longer eligible to file. Another possibility: The spike in coronavirus cases since Memorial Day also began to wane toward the end of last month, potentially helping to stabilize the labor market. “The story here, we think, is that layoffs triggered by the second wave of Covid-19 in the South and West are now falling,” said Ian Shepherdson, chief economist at Pantheon Macroeconomics. See: Job trouble? Wave of rehiring after economy reopened to fade in July after viral spiral Also: Manufacturers expand in July for third straight month, but not all jobs are coming back What happened: The highest jobless claims were reported in California, Florida, Texas, Georgia — states that have experienced fresh outbreaks of COVID-19. Some restrictions were reimposed on businesses and companies were forced to lay off or furlough workers, some for the second time. But cases now appear to be declining again. Similarly, new claims for benefits filed through a temporary federal-relief program fell sharply to 655,707, bringing total U.S. applications for the week to an unadjusted 1.64 million. That’s the lowest level since the crisis began in March. The number of people receiving traditional jobless benefits through the states, meanwhile, dropped by a seasonally adjusted 844,000 to a post-pandemic low of 16.1 million. These so-called continuing claims are reported with a one-week lag. Some 31.3 million people were still receiving benefits through eight state and federal assistance programs as of July 18, up from an unadjusted 30.8 million in the prior week. These figures are reported with a two-week lag. MarketWatch is reporting select jobless claims data using actual or unadjusted figures to give a clearer picture of unemployment. The seasonally adjusted estimates typically expected by Wall Street have become less accurate during the pandemic because its unprecedented nature makes comparisons with the past untenable. Read: Economy suffers titanic 32.9% plunge in 2nd quarter, points to drawn-out recovery Also:‘A massive welfare economy’ - federal aid prevents even steeper GDP collapse Big picture: The flareup in the coronavirus epidemic appears to have blunted the recovery in the labor market not withstanding the surprise decline in new claims. A raft of economic indicators point to a slowdown in hiring and some even point to an outright decline in employment. The government on Friday is expected to report the U.S. created 1.75 million new jobs last month — about two-thirds fewer than the increase in June. The fresh uncertainty is making businesses skittish about bringing back more workers, at least until the latest viral outbreak dies down. And it’s making painstakingly slow negotiations in Washington between Democrats and Republicans on how to extend unemployment benefits even more critical to the well-being of millions of Americans who can’t go back to work through no fault of their own. What they are saying?: “The possibility of mounting layoffs that could become permanent is high,” said Rubeela Farooqi, chief U.S. economist at High Frequency Economics. “Without effective virus containment the recovery remains at risk from ongoing job losses that could further restrain incomes and spending.” Market reaction: The Dow Jones Industrial Average DJIA, +0.56% and S&P 500 SPX, +0.87% were set to open modestly higher in Thursday trades."}]}