{"article": [{"url": "https://www.marketwatch.com/story/new-york-city-is-dead-forever-according-to-this-proud-native-new-yorker-2020-08-17", "published": 1597666100.0, "headline": "New York City is â\u0080\u0098dead forever,â\u0080\u0099 according to this proud native New Yorker", "body": "MARKETWATCH FRONT PAGE Will the city that never sleeps ever wake up? Not according to James Altucher, a best-selling author and former hedge fund manager, who says that New York City is â\u0080\u009cdead... forever.â\u0080\u009d See full story.Democrats to open convention like no other as Bidenâ\u0080\u0099s big party goes virtual Forget the balloon-drops, backslapping and cheering crowds: this yearâ\u0080\u0099s Democratic National Convention, beginning Monday, will be an almost entirely virtual event, as the party faithful gather around computer screens and TVs to celebrate Joe Biden as their presidential nominee. See full story. Did Warren Buffett just bet against the U.S. economy? His latest investment raises some questions Warren Buffett has long been critical of gold as an investment, saying it â\u0080\u009chas no utilityâ\u0080\u009d and that the â\u0080\u009cmagical metalâ\u0080\u009d is no match for â\u0080\u009cAmerican mettle.â\u0080\u009d He once wrote that â\u0080\u009cAnyone watching from Mars would be scratching their headâ\u0080\u009d over how we treat the shiny stuff on this planet. Is he having a change of heart? See full story.U.S. is closing in on doing something it hasnâ\u0080\u0099t done since World War II â\u0080\u0094 borrowing more money than it raises Amid the economic devastation wrought by the coronavirus pandemic, the U.S. government is nearing a fiscal milestone few expected: it will borrow as much or more this year than it raises in taxes and other revenues. See full story.How meat plant COVID outbreaks revealed â\u0080\u0098devastatingâ\u0080\u0099 workplace conditions A series of coronavirus flare-ups in food facilities has highlighted lax labor practices in the U.S., U.K. and Germany. See full story.MARKETWATCH PERSONAL FINANCE Ireland has also recorded one of the highest rates of COVID-related nursing-home deaths in the world, according to a report released in June. See full story."}]}