{"article": [{"url": "https://www.marketwatch.com/story/oil-mixed-as-us-dollar-steadies-2020-07-28", "published": 1595949440.0, "headline": "Oil ends at more than one-week low as traders fret over demand, ahead of weekly supply data", "body": "Oil futures logged their lowest finish in more than a week on Tuesday, as the U.S. dollar steadied and traders continue to fret over the outlook for energy demand, ahead of weekly U.S. petroleum supply data. The ICE U.S. Dollar Index DXY, -0.58%, a measure of the currency against a basket of six major rivals, was up less than 0.1% a day after hitting a two-year low. A weaker dollar can be supportive to commodities priced in the currency, making them less expensive to purchasers using other currencies. “So far, this week’s price movement appears determined to continue the limited momentum and general lack of volatility that has characterized global oil markets for much of the last two months, despite the continuation of several significant risk factors,” said Robbie Fraser, senior commodity analyst at Schneider Electric. “COVID-19 of course still stands out as the most important risk factor for crude and markets at large,” he said in a daily note. “Rising case counts in parts of the world continue to trouble investors, while improving supply/demand conditions and promising early vaccine trials have sometimes tempered those concerns.” With that in mind, “it is a pivotal week for U.S. fundamental data,” he said, starting with crude and product inventories from the American Petroleum Institute late Tuesday, followed by Wednesday’s Energy Information Administration data. “Market bulls will be hoping for strong draws amid recent signs of weakness, though EIA production and demand figures may prove the most important,” he said. Against that backdrop, West Texas Intermediate crude for September delivery CL.1, -1.62% US:CLU20 fell 56 cents, or nearly 1.4%, to settle at $41.04 a barrel on the New York Mercantile Exchange after posting a gain of almost 0.8% Monday. The front-month contract ended at its lowest since July 20. Global benchmark September Brent crude UK:BRNU20 BRN.1, -0.07% declined by 19 cents, or 0.4%, at $43.22 a barrel on ICE Futures Europe, the lowest finish since July 17. On average, the EIA is expected to report a decline of 1.2 million barrels in crude supplies for the week ended July 24, according to a survey of analysts conducted by S&P Global Platts. The survey also showed a forecast for a decline of 2 million barrels in gasoline inventories and pegged distillate supplies at unchanged for the week. Supply data released last week “offered a problematic combo with a slight uptick in production coupled with a decline in virtually all demand categories,” said Fraser. For current oil-price levels to hold, “demand can’t afford to start a string of weekly retreats, however slight.” On Nymex Tuesday, August gasoline US:RBQ20 fell by 0.7% to $1.2656 a gallon and August heating oil US:HOQ20 shed 1% to $1.2421 a gallon. August natural gas US:NGQ20, which expires at the end of Wednesday’s session, settled at $1.80 per million British thermal units, up 3.8% after losing 4.1% Monday. Meanwhile, analysts noted oil has remained largely rangebound in recent trading, with market participants attempting to gauge prospects for demand amid the COVID-19 pandemic. October Brent UK:BRNV20, the most actively traded contract, now trades at around a 40-cent discount to the November contract UK:BRNX20 versus a gap of as little as 7 cents in early July, noted Warren Patterson, head of commodities strategy at ING, in a note. The increasing contango “suggests that the tightening we were seeing in the market has eased somewhat, with the demand outlook more uncertain given the resurgence of COVID-19 cases in some regions,” Patterson said, while the support from strong Chinese crude oil imports in previous months appears to be waning. With signs the U.S. economic recovery may be slowing, Senate Republicans on Monday unveiled a roughly $1 trillion coronavirus relief package, kicking off negotiations with Democrats over a package. A battle looms over supplemental unemployment benefits, with Democrats eager to maintain the existing $600 weekly supplement, while the Republican plan would reduce it to a $200 add-on through September. The supplemental jobless benefits are due to expire at the end of the month. See:Republicans and Democrats both want another round of stimulus checks — but here’s where they disagree The market oil is also preparing for a surge in supply from the Organization of the Petroleum Exporting Countries and their allies, who agreed to relax curbs on output by 2 million barrels a day beginning in August. A Rystad Energy analysis showed that “the upcoming partial return of curtailed OPEC+ oil production from August is set to create a new four-month supply glut of around 170 million barrels.” The analysis is “based on the assumption that oil demand will not rebound as quickly as previously thought due to the persistent expansion of the COVID-19 pandemic in key markets, or what we call a mild second wave of the virus.”"}]}