{"article": [{"url": "https://www.marketwatch.com/story/tesla-stock-options-are-priced-for-an-unusually-big-post-earnings-movebut-the-odds-are-stacked-against-bettors-2020-07-21", "published": 1595421320.0, "headline": "Tesla stock options are priced for an unusually big post-earnings move-but the odds are stacked against bettors", "body": "Tesla Inc. stock options are implying a one-day post-earnings move that is nearly 60% greater than the historical average, but the odds are currently stacked against investors willing to bet on such unusual volatility. The electric-vehicle maker is scheduled to report second-quarter results after Wednesday's closing bell. The average estimates of the 23 analysts surveyed by FactSet is for an adjusted loss of 14 cents a share on revenue of $5.15 billion. The range of estimates is rather wide, with the low numbers at a loss of $2.53 on revenue of $2.77 billion, while the high estimates are earnings of $1.79 a share on revenue of $6.18 billion. Don't miss: Tesla's S&P 500 inclusion is done deal for bulls, analyst says. Saying the electric vehicle maker's stock TSLA, +1.89% has been on a roll would be an understatement, as it has rocketed nearly fourfold (up 279%) this year, while the S&P 500 index SPX, +0.87%  has tacked on 1.2%. The pace of gains has picked in the weeks ahead of earnings, as the stock has run up 47% this month and has closed at records in eight of the past 14 trading days. Meanwhile, the stock gained 1.1% in midday trading on Wednesday. To gauge an expected price move for a stock the day after earnings are reported, options traders use a strategy known as a straddle, which involves the pricing of both bullish (calls) and bearish (puts) options with strike prices at the same at-the-month, or current share price, for expiration at the end of the week. Straddles are pure volatility plays, as they are not directional. A buyer of a straddle makes money if the stock moves in either direction more than the straddle pricing implies, otherwise the straddle expires worthless. Tesla straddles were priced as of around midday Tuesday for the stock to move $208.84 in either direction on Thursday, according to data provided by Option Research & Technology Services (ORATS) principal Matt Amberson. That is 57.4% greater than the average one-day post-earnings move, over the past 12 quarters, of $132.71. To calculate the move, ORATS used the 30-day implied volatility for Tesla shares of 103.9%, which compares with the Cboe Volatility Index (VIX) VIX, -5.15%  for the S&P 500 of 25.2%. FactSet, MarketWatch The question is, should investors bet on the over, and buy the Tesla straddle? While there is no way to know what Tesla will report on Wednesday, not to mention how investors will react to that report, recent post-earnings stock activity suggests the odds are stacked heavily against straddle buyers. So far this earnings season, which is in the middle of its second week, only 17% of straddles bought have made money, according to ORATS, including 22% last week and 10% so far this week. On average, the actual one-day post-earnings moves have been just 55% of what has been implied by the straddles. That compares with a historical win ratio of 37% for the first week of earnings and 31% for the second week. And the actual one-day moves of the stocks of earnings reporters is usually about 88% of the implied move during the first week, and 83% during the second week. Basically, although Tesla's stock has been rather volatile recently, that doesn't mean investors should expect such an unusual move after earnings, good or bad."}]}