{"article": [{"url": "https://www.marketwatch.com/story/existing-home-sales-rebound-strongly-in-june-from-pandemic-fueled-lows-but-will-the-recovery-be-sustainable-in-the-long-term-2020-07-22", "published": 1595415680.0, "headline": "Existing home sales rebound strongly in June from pandemic-fueled lows - but will the recovery be sustainable in the long term?", "body": "The numbers: Sales of previously-owned homes jumped 20.7% in June as states reopened their economies following coronavirus-related lockdowns. Existing-home sales occurred at a seasonally adjusted annual pace of 4.72 million, the National Association of Realtors reported Wednesday. It was a major rebound from May, when sales dropped to the lowest level since July 2010. \"The sales recovery is strong, as buyers were eager to purchase homes and properties that they had been eyeing during the shutdown,\" Lawrence Yun, chief economist at the National Association of Realtors, said in the report. Nevertheless, compared with last year, existing-home sales were still down 11.3% in June. What happened: Home sales surged across every region nationwide. The West saw the biggest increase with a 31.9% uptick last month. Unsold inventory was at a 4-month supply at the end of June, down from May's 4.8-month supply. A 6-month supply of homes is considered indicative of a balanced market. Compared with last year, inventory was down 18.2%. The low supply of homes for sale drove prices higher. The median existing-home price in June was $295,300, up 3.5% from last year. June was the 100th consecutive month in which home prices were up on an annual basis. Big picture: As states reopened businesses following coronavirus-related lockdowns, Americans rushed back into the housing market, suggesting that many buyers simply delayed their purchase of a home rather than deciding to forego it entirely. Record-low mortgage rates added more fuel to the flame, as the decline in rates helped improve affordability at the margins and gave buyers yet another reason to buy a home. However, since June there has been a surge in coronavirus cases across the country, particularly in states with some of the largest real-estate markets in the U.S. including California, Texas and Florida. Experts say that the rise in COVID-19 infections will have some impact on the housing market - the extent of the impact, though, remains to be seen. \"The recent resurgence in case numbers is likely to impact demand and continue to keep inventory at suppressed levels,\" said Ruben Gonzalez, chief economist at real-estate brokerage Keller Williams. \"But agents and consumers have now had ample time to adapt to social distancing practices and virtual tools, so the impact on sales may be less than we saw in April.\" Ultimately, how the housing market fares in the months to come will depend on the strength of the overall economy. A surge in job losses or a wave of evictions could threaten home sales growth in the longer term. Additionally, the constrained supply of homes will continue to limit home sales moving forward. The lack of inventory will likely push prices even higher, which could force some buyers out of the market. \"Home prices rose during the lockdown and could rise even further due to heavy buyer competition and a significant shortage of supply,\" Yun said. What they're saying: \"Lingering joblessness and languishing confidence could prevent the housing sector from pushing much past where it was before, let alone completely climbing back,\" Michael Gregory, deputy chief economist at BMO Capital Markets, wrote in a research note. Market reaction: The Dow Jones Industrial Average DJIA, +0.56%  and the S&P 500 SPX, +0.87%  were both up slightly in Wednesday morning trading, while the yield on the 10-year Treasury note TMUBMUSD10Y, 0.777%  was flat."}]}