{"article": [{"url": "https://www.marketwatch.com/story/snowflake-brings-in-nearly-4-billion-to-kick-off-big-week-for-ipos-11600224459", "published": 1600289120.0, "headline": "Red-hot IPO market sends Snowflake surging and JFrog leaping, with more software companies to come", "body": "New York Stock Exchange President Stacey Cunningham helps Snowflake Inc. executievs and employees ring the opening bell for trading Wednesday. NYSE Snowflake Inc. and JFrog Inc. produced a hot start Wednesday to the busiest week for initial public offerings in more than a year. Snowflake SNOW, -0.91% priced its IPO at $120 a share Tuesday night to raise at least $3.86 billion, and likely more than $4 billion, and shares jumped more than 100% in their debut. The company sold at least 28 million shares to raise $3.36 billion, and Berkshire Hathaway Inc. BRK.A, +0.06% BRK.B, +0.24% and Salesforce.com Inc. CRM, +2.21% agreed to concurrently purchase $250 million in shares at the IPO price. Underwriters, led by Goldman Sachs and Morgan Stanley, have access to an additional 4.2 million shares that could push the total raised to roughly $4.4 billion. The action in Snowflake shares leading up to and including their debut Wednesday showed extraordinary demand. After originally filing for an IPO less than a month ago, Snowflake declared an expected price range of $75 to $85 a share last week. On Monday, the San Mateo, Calif., software company dramatically increased that range to $100 to $110 a share, then it priced higher than that target Tuesday. When the shares debuted Wednesday on the New York Stock Exchange, they sold for more than double the IPO price and then moved even higher, closing with a 111.6% gain at $253.93. At the IPO price, Snowflake was valued at $33.3 billion just eight years after being incorporated, and Wednesday’s trading pushed that total higher than $70 billion. It is the biggest debut for a software company in history, according to Renaissance Capital. See also: Five things to know about the Snowflake IPO Snowflake produces database software that is used in the cloud, offering a necessary piece of technology infrastructure in a new way. The offering has generated enough excitement to attract investment from Berkshire, whose legendary Chief Executive Warren Buffett has famously avoided young tech companies and IPOs for decades. In addition to the $250 million investment, Berkshire is buying more than 4 million shares at the IPO price from former Snowflake CEO Robert Muglia. Snowflake was not the only software company to debut Wednesday on Wall Street with smashing success. JFrog Ltd. FROG, which makes software that developers use to make other pieces of software, followed a similar track of raising its price range, pricing above its range and seeing the shares pop healthily in their debut. JFrog fell back a bit from its opening price, but still gained 47.3% from the IPO price to close at $64.79, which values the company at more than $5.7 billion. “We will let the market define the prices, but it is a huge milestone in JFrog’s life and will help us to capitalize on those opportunities in front of us,” Jacob Shulman, JFrog’s chief financial officer, told MarketWatch in an interview. Snowflake and JFrog are just two of a dozen companies expected to go public this week, which would make it the busiest week for IPO activity since Uber Technologies Inc. UBER, -0.18% went public in May 2019, according to Renaissance. Also debuting Wednesday was biopharmaceutical company Metacrine Inc. MTCR, +2.10%, which raised at least $85 million and started 11% higher before falling back and ending the day below the $13 IPO price at $11.76. For more: IPO market gears up for busiest week since May 2019 Two other software companies, Unity Software Inc. U, +8.43% and Sumo Logic SUMO, +0.33%, are expected to price IPOs later this week. Other offerings among the dozen expected include packaging company Pactiv Evergreen PTVE, +4.74% and telehealth company American Well Corp. AMWL, -8.90%, known as AmWell. Despite the growing IPO supply, there is still strong demand from investors, as the Renaissance IPO ETF IPO, +1.98% has run up 25.2% over the past three months while the S&P 500 index SPX, +0.87% has gained 8.7%. MarketWatch staff writer Therese Poletti contributed to this story."}]}