{"article": [{"url": "https://www.marketwatch.com/story/historic-flooding-presents-biggest-ever-challenge-for-chinas-massive-three-gorges-dam-11597875385", "published": 1597861460.0, "headline": "Historic flooding presents biggest-ever challenge for Chinaâ\u0080\u0099s massive Three Gorges Dam", "body": "July 27 aerial image shows floodwater being discharged from the Three Gorges Dam in Hubei Province. Wang Gang/Zuma Press Historic flooding is pummeling one of Chinaâ\u0080\u0099s greatest walls â\u0080\u0094 the massive Three Gorges Dam. And the economic, not to mention humanitarian, consequences are growing. This week, the fifth major wave of flooding this summer will slam the largest peak flow into the dam in its history, officials said Wednesday. State media downplayed any chance the torrents could breach the structure, and officials concluded their annual summer resort powwow outside Beijing with President Xi Jinping appearing on camera in a flood-hit area. Yet the unprecedented amount of water the dam will have to handle this week comes after two months of devastating rains in China. More than 60 million people have â\u0080\u009csuffered disasters and direct economic losses of 179 billion yuan ($26 billion),â\u0080\u009d Deputy Minister of Emergency Management Zhou Xuewen said last week at a press conference. â\u0080\u009cSo far, more than 4 million people have been resettled across the country,â\u0080\u009d he added. The dam is a controversial marvel of engineering. Located on the Yangtze River just upstream from Wuhan, the city where the coronavirus originated, its construction decades ago forced the displacement of more than a million people, and the reservoir it created flooded archaeological sites and the towns around them. Yet it now stands as not merely the worldâ\u0080\u0099s largest hydroelectric dam but the worldâ\u0080\u0099s largest power station. Last year it produced roughly the same amount of electricity as the entire country of Vietnam, or the Netherlands. Thus, the damâ\u0080\u0099s hefty $30 billion price tag was recouped within a matter of years, and it now serves as an important energy source in a smoggy, coal-driven economy. Highlighting the seriousness among officials, President Xi appeared on camera Tuesday inspecting a flood-hit area in the eastern province of Anhui.Â Xi spoke atop a floodgate that was used last month to divert millions of cubic meters of water from inundating downstream cities â\u0080\u0094 though the diversion itself submerged numerous other villages, displaced residents, and destroyed crops and livestock, according to state-media reports. The president seemed well aware of the countryâ\u0080\u0099s history of floods that have haunted its population and rattled former leaders. â\u0080\u009cI have always been concerned about the people in flood-stricken areas,â\u0080\u009d he said. China has been at times cagey, at times dismissive of the possibility of the massive dam being breached. It mostly keeps the topic out of the domestic media.Â â\u0080\u009cThe monitoring records of the operation department of the Three Gorges show that the main parameters of the damâ\u0080\u0099s displacement, seepage, and deformation are all within the normal range, and the safety indicators of the water-retaining structures are stable,â\u0080\u009d official Xinhua News Agency said Tuesday in a rare response to the issue. The small chorus of outside experts concerned about the damâ\u0080\u0099s integrity is led by Chinese-born engineer Wang Weiluo, who was involved in planning for the Three Gorges project in the 1980s but now lives in Germany. In a long technical treatise published by Radio France Internationale, Wang lays out the structural problems with the dam but places ultimate blame on â\u0080\u009cthe dereliction of duty and lies of the experts in charge of quality inspection.â\u0080\u009d The flooding also comes as life had returned mostly to normal across the country in the wake of its public health crisis, with domestic tourism resuming, movie theaters reopening, and the government strongly hoping retail consumption would compensate for the lack of demand for its exports in much of the rest of the world. On Tuesday, the southwestern province of Sichuan issued for the first time the highest-level warning on its four-tier flood control system. Tour guide Wu Jianhua had just resumed leading groups across the province before the rains started. Now her numerous trips are canceled as the area faces mudslides and road closures. â\u0080\u009cAnd Iâ\u0080\u0099m one of the lucky ones,â\u0080\u009d she said. Tanner Brown covers China for MarketWatch and Barronâ\u0080\u0099s."}]}