{"article": [{"url": "https://www.marketwatch.com/story/after-big-tech-helped-earnings-look-better-here-comes-disney-and-uber-2020-08-02", "published": 1596385880.0, "headline": "After Big Tech helped earnings look better, here comes Disney and Uber", "body": "Big Tech made corporate finances during the COVID-19 pandemic look a bit better, but we are still headed for the worst earnings season in more than a decade as the Walt Disney Co. prepares to discuss its financial performance. Apple Inc. AAPL, +1.74% , Amazon.com Inc. AMZN, +3.01% , Alphabet Inc. GOOGL, +1.82% GOOG, +1.97% and Facebook Inc. FB, +0.26% all reported earnings Thursday afternoon and generated a combined $28.6 billion in profits in the calendar’s second quarter, squashing expectations of $19.1 billion for the quartet. Apple, Amazon and Facebook all shot to record highs yet again in response to their report. For more: Pandemic? Antitrust? No worries for Big Tech, which racked up $200 billion in sales anyway Earnings beats of that magnitude put the S&P 500 SPX, +0.87% on track for a somewhat more respectable profit performance. Corporate profits are now expected to have fallen 35.8% in the second quarter, taking into account already-reported numbers and estimates for the rest. That would mark the worst earnings performance since the second quarter of 2009, but just a week ago, analysts were projecting a 42.4% drop in profits, which would’ve been the worst showing since the fourth quarter of 2008. More than 70% of S&P 500 companies reported results through Thursday afternoon, and those companies delivered an earnings beat of 22.9% in aggregate, according to Credit Suisse Chief U.S. Equity Strategist Jonathan Golub. The beat rate was “only” 13.8% before the Thursday reports came in, showing the outsize impact of Big Tech on profits for the index. Though aggregate earnings have come in better than expected, the stock-market reaction has been fairly restrained. Companies that topped both earnings and revenue expectations this season saw their stocks outperform the market by 1.5%, compared with an historical average of 1.6%, Golub wrote. Companies missing on both metrics have seen their stocks lag by 1.8% versus a typical underperformance of 3.1%. See also: How Apple’s stock split will change the pecking order in the Dow The week ahead brings another packed slate of earnings, with 130 members of the S&P 500 set to report and one member of the Dow Jones Industrial Average DJIA, +0.56% : Disney DIS, +1.53% , which faces some of the toughest challenges of the pandemic. Other highlights include Beyond Meat Inc. BYND, +0.80%, Uber Technologies Inc. UBER, -0.18% and Roku Inc. ROKU, +0.04% .Living the stream Netflix Inc. NFLX, +1.43% proved that the pandemic has been a boon for online video, but for fellow streaming players Disney and Roku, the story is more complicated. Their reports this week will show whether a growing tilt toward streaming media as people stay at home can help outweigh some of the more negative economic impacts of the crisis. The Disney+ service promises to be one of the rare bright spots in Disney’s Tuesday afternoon report, given challenges across the business due to park closures, film delays, sports cancellations and a weak advertising market. From a revenue perspective, Disney+ is still a small piece of the sprawling media empire, but the service launched the filmed version of “Hamilton,” one of the summer’s biggest hits, and will look to leverage that momentum even after the “Hamilton” boom is over, given a weak outlook for its more traditional media businesses. For more: Disney+ may be the only plus for Disney during pandemic Roku, which sells streaming devices and other technologies that allow people to watch over-the-top content on their TV sets and offers its own free streaming service, will detail some of the best and worst trends in video Wednesday afternoon. On one hand, the company benefits when people sign up for new streaming services through its platform, but it also generates revenue from advertising, which has taken a hit during the pandemic. Wedbush analyst Michael Pachter said that investors could “expect a dip” in the near term, followed by an acceleration once the economy improves and Roku can better leverage a growing audience.Catch a ride Uber’s ride-hailing numbers won’t be pretty given stay-at-home trends, but that’s no surprise. Investors will be looking for signs of momentum as the quarter went on, especially in places that began reopening their economies, as well as any indications that trends began stalling once again as some states scaled back their reopening plans. Also of interest Thursday afternoon will be trends in the food-delivery business, a glimmer of hope as the traditional ride-hailing business stalled. Companies like Visa Inc. V, +1.80% and PayPal Holdings Inc. PYPL, +2.18% pointed to increased comfort with buying things like food online as the COVID-19 crisis worsened, and GrubHub Inc. GRUB, +0.83% pointed out large gains in demand last week. After failing to close a deal to buy GrubHub, Uber has agreed to acquire PostMates instead, but the key for Uber as it waits for that deal to close will be converting new Eats users into regular customers for the long haul.High flyer Square Inc. SQ, +2.06% shares have nearly doubled over the past three months on expectations that the company has hit a tipping point with its consumer-facing Cash App due to the pandemic. The company saw ballooning usage of the Cash App’s direct-deposit feature in the lead-up to Square’s May earnings call, as the company rolled out a way to get stimulus payments sent via direct deposit to the app, while the number of net new monthly transacting accounts of Cash hit a new record in April. See also: Here’s how PayPal hopes to turn Venmo into the next PayPal Whether Square can sustain that momentum will be a focus of the company’s Wednesday afternoon call, as will trends on the merchant side of the business. Square likely saw some recovery there as states relaxed in-person business restrictions toward the middle of the quarter. The company’s e-commerce initiatives will also be of note, given uncertainties about how the remainder of the public-health crisis will play out: Square has been getting its bricks-and-mortar merchants to adopt online-shopping tools as they adjust to the new ways of doing business amid the pandemic.Food for thought Beyond Meat has signed a number of new deals lately, but it can’t escape the COVID-19 crisis. “The biggest risk for Beyond in the short-term is its ~50% exposure to food-service channels,” wrote Bernstein analyst Alexia Howard, who added that a recovery in the food-service business could take some time to materialize due to restrictions on restaurants. She’ll also be looking for updates Tuesday morning about the company’s China partnerships with Alibaba Group Holding Ltd. BABA, -0.26% and Starbucks Corp. SBUX, +0.53% . While those recent deals drove a big rally in Beyond Meat’s stock, she questions how much impact they’ll have on overall sales. Taking flight Virgin Galactic Holding Inc.’s SPCE, -3.12% Monday afternoon report will be the first since new Chief Executive Michael Colglazier took over on July 20. Colglazier, a Disney parks veteran, “brings valuable experience in consumer experiences on the eve of Virgin Galactic’s commencement of commercial operations which it sees as just ‘months’ away,” and the earnings call promises a look at his priorities. Also on deck Following Electronic Arts Inc.’s EA, +1.15% better-than-expected earnings report that was boosted by people flocking to videogames during the pandemic, its rivals will have a chance to face investors. Take-Two Interactive Software Inc. TTWO, +0.76% reports Monday after the closing bell, followed by Activision Blizzard Inc. ATVI, +0.52% a day later. Other notable names include Match Group Inc. MTCH, -0.94%, which will show Tuesday afternoon how the COVID-19 crisis impacted online dating, and Etsy Inc. ETSY, +5.11%, which will show Wednesday afternoon whether consumers stuck around after the initial frenzy to buy homemade masks wore off."}]}