{"article": [{"url": "https://www.marketwatch.com/story/statues-toppled-throughout-us-in-protests-against-racism-2020-06-20", "published": 1592734640.0, "headline": "Statues toppled throughout U.S. in protests against racism", "body": "Protesters in San Francisco tore down a bust of Ulysses Grant and statues of Spanish missionary Junipero Serra and “Star Spangled Banner” writer Francis Scott Key in a scene that was repeated across the U.S. The San Francisco protesters arrived at Golden Gate Park Friday night, defacing the statues with red paint and writing “slave owner” on pedestals before using ropes to topple them and dragged them down grassy slopes amid cheers and applause. In Seattle, authorities were investigating what led to the shooting in the area known as CHOP, which stands for “Capitol Hill Occupied Protest” zone. It has been harshly criticized by President Donald Trump, who has tweeted about sending the military into Seattle to exert control, even as police in Seattle insisted they are protecting the area as needed, with the mayor saying the city would work with the community and achieve a resolution. See:Fox News removes digitally altered, misleading photos of Seattle protest zone Elsewhere around the U.S., protesters in Washington, D.C., toppled a statue of a Confederate general amid continuing anti-racism demonstrations following the May 25 police killing in Minneapolis of George Floyd, the African American man who died after a white police officer pressed his knee on his neck and whose death galvanized protesters around the globe to rally against police brutality and racism. The San Francisco protesters targeted Grant, who led the Union Army during the Civil War, and Key because they owned slaves. Serra, an 18th-century Roman Catholic priest founded nine of California’s 21 Spanish missions and is credited with bringing Roman Catholicism to the Western United States. Serra is also blamed by many Native Americans for the destruction of several tribes and their culture. He believed that American Indians needed to be baptized and taught to farm. Once converted, they were prohibited from leaving the missions, and those caught trying to escape faced brutal punishment. His statues have been defaced in California for years. San Francisco police spokesman Adam Lobsinger said Saturday officers responded to the park but didn’t intervene. He said that the crowd threw objects at the officers and that no injuries were reported. The protesters dispersed about an hour after arriving and no arrests were made, he said. The Washington, D.C., protesters took down the 11-foot-tall statue of Albert Pike, the only statue of a Confederate general. Then they set a bonfire and stood around it in a circle as the statue burned, chanting, “No justice, no peace!” and “No racist police!” President Donald Trump quickly tweeted about the toppling, calling out D.C. Mayor Muriel Bowser and writing: “The DC police are not doing their job as they watched a statue be ripped down and burn. These people should be immediately arrested. A disgrace to our Country!” On Saturday, at his rally in Tulsa, Okla., Trump sought to link Vice President Joe Biden, his Democratic rival for the presidency, and other Democrats to the statue defacements, characterizing them as destroying “our heritage.” Also Friday, anti-racism messages were sprayed on the sculpture of Revolutionary War figure and slave owner Nathaniel Rochester, the founder of Rochester, N.Y. The hands of the bronze statue of a seated Rochester were painted red, with “shame” written across the forehead. Other messages around the figure included “stole indigenous lands” and “abolish the police.” Protesters in North Carolina’s capital pulled down parts of a Confederate monument Friday night and hung one of the toppled statues from a light post. Demonstrators used a strap to pull down two statues of Confederate soldiers that were part of a larger obelisk near the state capitol in downtown Raleigh, news outlets reported. Police officers earlier in the evening had foiled the protesters’ previous attempt to use ropes to topple the statues. But after the officers cleared the area, protesters mounted the obelisk and were able to take down the statues. They then dragged the statues down a street and used a rope to hang one of the figures by its neck from a light post. The other statue was dragged to the Wake County courthouse, according to the News & Observer."}]}