{"article": [{"url": "https://www.marketwatch.com/story/us-tiktok-ceo-kevin-mayer-resigns-saying-the-political-environment-has-sharply-changed-2020-08-27", "published": 1598498060.0, "headline": "U.S. TikTok CEO Kevin Mayer resigns, saying â\u0080\u0098political environment has sharply changedâ\u0080\u0099", "body": "Just three months after taking the job, TikTok Chief Executive Officer Kevin Mayer announced his resignation in an internal memo to employees late Thursday, where he spoke of a changing political landscape. “ â\u0080\u009cIn recent weeks, as the political environment has sharply changed, I have done significant reflection on what the corporate structural changes will require, and what it means for the global role I signed up for. Against this backdrop, and as we expect to reach a resolution very soon, it is with a heavy heart that I wanted to let you all know that I have decided to leave the company.â\u0080\u009d ” â\u0080\u0094 Kevin Mayer, outgoing CEO of TikTok Mayerâ\u0080\u0099s announcement comes amid intense pressure for the wildly popular app, which President Donald Trump has vowed he will ban in the U.S. unless parent company Beijing-based ByteDance Inc. sells it within 90 days. Mayer said his decision had \"nothing to do with the company, what I see for our future, or the belief I have in what we are building.â\u0080\u009d He added that the chairman of ByteDance, Zhang Yiming, understood and support his decision. The outgoing CEO said he remains upbeat on the companyâ\u0080\u0099s future, which he described as â\u0080\u009dincredibly bright.â\u0080\u009d A spokesperson from the company said that Vanessa Pappas, general manager for TikTok U.S., will be the interim head. Mayer said any potential structural changes should not affect the experience of users â\u0080\u0094 100 million in the U.S. â\u0080\u0094 and the platform â\u0080\u009cwill continue to provide our global community an amazing and integrated experience as it does today.â\u0080\u009d He joined TikTok in May, after a stint in charge of Walt Disney Coâ\u0080\u0099s DIS, +1.53% Â streaming service. TikTok announced Monday that it would file a complaint in federal court over Trumpâ\u0080\u0099s attempt to ban the service in the U.S., arguing that it has â\u0080\u009ctaken extraordinary measures to protect the privacy and security of TikTokâ\u0080\u0099s U.S. user data.â\u0080\u009d The company claims U.S. data is stored outside of China, while â\u0080\u009csoftware barriersâ\u0080\u009d help ensure itâ\u0080\u0099s stored separately from that of other ByteDance products. Software giant Microsoft Corp. MSFT, +2.48% Â has indicated it may be interested in buying TikTokâ\u0080\u0099s U.S. operations, while Oracle ORCL, +0.42% Â and Twitter TWTR, -0.23% Â have also reportedly expressed interest."}]}