{"article": [{"url": "https://www.marketwatch.com/story/to-avoid-a-step-backwards-this-summer-congress-must-renew-enhanced-unemployment-benefits-2020-07-01", "published": 1593615260.0, "headline": "To avoid a step backwards this summer, Congress must renew enhanced unemployment benefits", "body": "The early indicators from the reopening of the U.S. economy are showing positive signs of recovery, but this momentum may be short-lived if the government doesn’t take measures to counter a potential economic dip this summer. If the goal is to facilitate a smoother transition back to work, the government will have to consider extending enhanced unemployment benefits past the current deadline on July 31, if the state of the labor market warrants it. Economic data from May has been greeted with optimism in the market and across the economy. Unemployment is down. Housing starts are up. Retail sales and consumer sentiment are improving. The aforementioned figures are good signs, but they belie the likelihood of a longer U-shaped recovery, rather than the brisk V-shaped recovery many had hoped for. Also read:The extra $600 Americans get in weekly unemployment benefits ends next month — how lawmakers are proposing to replace it This means there is still ample uncertainty in the short term. May and June will probably register some more positive numbers, but we must pay special attention to August when the current $600 a week in federal extended unemployment benefits is set to expire. There are presently about 30 million Americans on continued jobless claims, and if the majority of those have not found stable work before August, this could create a consumer spending shock, as many rely on the extended benefits to maintain current spending levels. As we near July 31, a close eye will be on how far the jobless claims fall, and if they do not fall fast enough that would put pressure on the federal government to intervene with extended benefits and corporate incentives. Related:After months of ‘heartbreaking’ demand, food banks say they’re bracing for August when unemployed Americans stop getting the extra $600 The most recent employment report from the U.S. Bureau of Labor Statistics exceeded expectations, with unemployment dropping to 13.3%, but this figure paints an incomplete picture. The pandemic caused a precipitous job loss, which begs the question, what portion of jobs lost were permanent losses? How many of them can be recovered? The truth is, no one knows precisely what the answer to that question is. Add to that the fact that the federal government issued a historic $2 trillion dollar stimulus for individuals and businesses, a financial injection so outsize that it could serve to obscure the current economic picture, delaying some consequences caused by the pandemic and its attendant economic shutdown. The trajectory of PPP loan disbursement has been extended, but the eventual cessation of those benefits, and the anticipation of such, could give some businesses pause to rehire. When those workers attempt to re-enter the workforce, what will the result be? Will they be rehired, and if so, will they be hired at equal or limited utilization? The pandemic has likely caused a disruption to the U.S. economy so large that a gap in the jobs market will remain for the foreseeable future. Follow the recovery from the coronavirus with MarketWatch’s data tracker, Consider how drastically businesses have pivoted, restructuring their operations to cope with the new pressures and cater to changing consumer behaviors. Many of these pivots will linger, and have a trickle-down effect on the configuration of the American workforce. There may be less demand for workers at movie theaters but more demand for grocery delivery drivers, for example. Also read:White House ‘very seriously considering’ another stimulus bill — here’s how the CARES Act has reduced poverty rates Pandemic aside, labor markets have historically taken years to recover from severe economic events such as this one. It’s fair to say that a persistent disruption to the labor market has been caused. How acute and prolonged that disruption will be remains to be seen. How, then, might the government respond if workers struggle to re-enter the labor market? The federal government must closely monitor the situation, but only extending unemployment benefits, of course, is not a long-term solution. Extending unemployment benefits might be necessary to stave off a sharp dip in the economy but the primary focus will need to be on how to create opportunities for citizens to reallocate their labor to different fields and industries that are better poised for growth in a post-pandemic economy. . It may be necessary for the federal government to incentivize companies to train workers who are ill-prepared for this new environment. It may take new ambitious approaches to contend with the unique pressures exerted by the coronavirus. Thoughtful public-private partnerships to promote skills training are likely to be better antidotes than simply extending unemployment benefits indefinitely. The U.S. economy has improved, but these initial figures could be misleading and should be taken with a grain of salt. A recovery could very well be underway, one whose momentum would surely gather steam in 2021, but even as we proceed with cautious optimism, parts of the economy hang perilously tied to temporary stimulus, and both the government and businesses need to stay keenly aware of these risks to the recovery over the next few months. Andrew Duguay is the chief economist at Prevedere, an industry insights and predictive analytics company, helping business leaders make better decisions by providing a real-time view of their company’s future."}]}