{"article": [{"url": "https://www.marketwatch.com/story/history-suggests-trump-is-heading-for-a-fall-in-november-2020-06-17", "published": 1592648780.0, "headline": "History suggests Trump is heading for a fall in November", "body": "When the year began, I thought President Donald Trump was in pretty good shape to win a second term. This obviously isn’t the case now. I don’t have to tell you what the pandemic, the economic collapse that followed, Trump’s own behavior—which seems to be getting worse—and more have done to weaken him electorally. Trump defied history four years ago, and he could certainly do so again in November. But history is not on his side in several critical ways. An unpopular president You’ll recall that Trump was elected president with 46% of the popular vote. According to two aggregators of polls — Real Clear Politics and FiveThirtyEight — he has never advanced more than a point or two beyond this, peaking back in February and March in the 45% to 47% range. His current approval ratings — 40.8% (FiveThirtyEight) and 42.5% (RCP) — are a decline of about five approval points in each. Given how bad things are right now — a possible second wave of the pandemic and the worst unemployment rate in 90 years — Trump should count his lucky stars that it’s not worse. It’s a reflection of just how much his base continues to stick to him like glue. This is the best thing — perhaps the only thing — that the president has going for him right now. Get the latest election news and analysis on MarketWatch. What does history tell us when a presidential incumbent has numbers this low? Trump’s Gallup approval is 39%. Going back to 1950 — nearly three-quarters of a century — only two presidents were weaker at this point in their re-election years: George H.W. Bush in 1992 (37%) and Jimmy Carter in 1980 (38%). Both of them lost their re-election bids. And both Carter and Bush lost with economies that were far better than what Trump is dealing with now. Unemployment in May 1980 was 7.5%; in May 1992 it was 6.1%. Trump’s jobless rate now is nearly those two rates combined: 13.3%, and even the Department of Labor says were it not for data that was “misclassified,” the real jobless rate today would be three full points higher: 16.3%. At 39%, Trump is barely within shouting distance of where Barack Obama stood this time in 2012: 46%. But Obama wasn’t dealing with a pandemic (in fact he had successfully faced a possible pandemic down), the stock market was surging and unemployment was plunging. He went on to win 51% of the popular vote and 332 electoral votes. Bill Clinton (1996), Ronald Reagan (1984), Richard Nixon (1972) and Dwight Eisenhower (1956) did better, in most cases spectacularly better. Stock market hopes Nor does the stock market offer any comparative advantage to Trump. In the full years before Carter and Bush’s re-election bids, the S&P 500 SPX, +0.87% rose 18.4% in 1979 and 32.5% in 1980—but again, Carter lost. It rose 30.5% in 1991 and 7.6% in 1992 — but again, Bush lost. Trump’s stock market? The index jumped 31.5% last year, but as of yesterday is off -3.3% year-to-date. In addition to unemployment and stocks, history is also against Trump in another big way: he’s the fifth president to lose the popular vote but win the Electoral College. So what happened to the other four popular vote losers when they sought re-election? John Quincy Adams was crushed by Andrew Jackson (1828); Rutherford B. Hayes declined to run again (1880), and Benjamin Harrison lost to Grover Cleveland (1892). That leaves just one popular vote loser who managed to win a second term: George W. Bush in 2004. And he barely did so. Had just 59,229 votes in Ohio gone the other way, John Kerry would have won the Buckeye state and with it, the presidency. Sidebar: for you Electoral College haters, consider that Kerry would have become president despite losing the popular vote by more than 3 million votes. Double whammy To recap: Trump faces a double historical whammy: He’s a weak incumbent and a popular-vote loser to boot. Other presidents have been shown the door with economies that were better than what we have today. There are fears of a second wave of the coronavirus; the president can barely acknowledge that this remains a problem, a problem that continues to kill thousands of Americans each week. I said that six months ago, Trump was in pretty good shape to win another term. Now, history suggests he’s headed for a quick exit."}]}