{"article": [{"url": "https://www.marketwatch.com/story/the-u-s-dollar-is-getting-punched-in-the-mouth-and-its-outlook-amid-coronavirus-doesnt-look-great-some-experts-say-11595364332", "published": 1595350400.0, "headline": "The U.S. dollar is getting punched in the mouth, and its outlook amid coronavirus doesnâ\u0080\u0099t look great, some experts say", "body": "The U.S. dollar is taking a beating on Wall Street, as measured by one popular index. Blame it partly on a resurgence in the euro EURUSD, +0.60% as European leaders forged a historic fiscal pact to dig the eurozone economy out of the coronavirus pandemic that has brought much of the world to its knees; but either way, the prospects for greenback have some experts questioning its long-term outlook. â\u0080\u009cThe dollar is very vulnerable now,â\u0080\u009d Boris Schlossberg, managing director of G-10 currency strategy at BK Asset Management told MarketWatch in a Tuesday afternoon interview. Schlossberg said that the â\u0080\u009cmassive spending and the general lack of allure of the U.S. dollar could beâ\u0080¦more of a threat to the dollar than people appreciate.â\u0080\u009dÂ On Tuesday, the buck was off 0.7% at 95.139, hanging around its lowest level since March, according to FactSet data, as gauged by the ICE U.S. Dollar index DXY, -0.58%, a measure of the dollar against a half-dozen currency peers, including the euro, which makes up 57.6% of the gauge. Over the past three months the greenback has been clobbered, falling 5.1%, and it has lost 2.3% just in July so far. Meanwhile, the euro, which was flirting with parity against the dollar near the onset of the pandemic earlier this year, has been on a tear against the buck, last changing hands at $1.1529, up 0.7% on Tuesday, and gaining 5.8% over the past three months, with much of its recent surge to its highest level against the dollar since January of 2019 playing out over the past 30 days. Some analysts make the case that the dollarâ\u0080\u0099s recent bout of weakness is understandable due to its rally during the apex of the coronavirus public-health crisis, underscoring the currencyâ\u0080\u0099s position in global financial markets as a haven asset in times of uncertainty. The European Unionâ\u0080\u0099s historic pact on Tuesday, however, ushered in a sense of greater cohesion around the sometimes fractious EU. The 27-member bloc agreed to a â\u0082¬1.8 trillion ($2.06 trillion) budget and rescue spending plan, which features the issuance of common bonds, highlighting the groupâ\u0080\u0099s willingness to coordinate economic effortsâ\u0080\u0094something that some market participants were skeptical of amid the pandemic. The BK Assset currency strategist said that the coronavirus recovery package forged by Europe created â\u0080\u009cpositive flows to the euro and negative flows into the dollar.â\u0080\u009d Analysts at UBS see cause for the dollarâ\u0080\u0099s stumbles to continue for the rest of the year at forecast the euro to hit $1.17 by year end. â\u0080\u009cWe donâ\u0080\u0099t expect the recent increase in COVID-19 infections to lead to the re-imposition of national lockdowns, and so we expect global economic growth to continue to recover,â\u0080\u009d the UBS analyst wrote in a Monday research note. â\u0080\u009cAs a result, we expect safe- haven demand for the US currency, which was apparent in the early stages of the pandemic, to decline,â\u0080\u009d UBS analysts added. The analysts also noted that appetite for dollars has diminished and the use of so-called swap lines by foreign central banks has continued to ease after helping sate an intense scramble for greenbacks as the pandemic initially roiled financial markets. UBS says that the Federal Reserveâ\u0080\u0099s historically aggressive and unprecedented tack in attempting to provide monetary stimulus to the swooning U.S. economy during the height of the pandemic has pinned benchmark bonds lower, also a factor that is hurting appetite for dollars because traders typically park their funds in currencies that offer high relative yields. The benchmark 10-year Treasury yield TMUBMUSD10Y, 0.777%, for example, was hovering around a superlow level at 0.61%. â\u0080\u009cThe interest rate advantage that supported the U.S. dollar in recent years has been eroded by the fact that the Fed has been more aggressive than other major central banks in monetary easing,â\u0080\u009d UBS wrote. Schlossberg said that he expected that dynamic to be amplified by the likelihood that yields for German bunds TMBMKDE-10Y, -0.521% would climb, undercutting the relative appeal of bunds against comparable government debt. 10-year German bonds, also known as bunds, were yielding negative -0.46%. As German rates rise from less negative levels, it could greater demand for euros, the thinking goes. UBS says that uncertainty around the outcome of the U.S. presidential election in November may also factor in weakening the buck, with former Vice President Joe Biden leading incumbent President Donald Trump in national polls by a relatively wide margin. The perception that Europe may have a greater handle on tamping down the coronavirus epidemic compared against the U.S., also was viewed as a negative for the dollar compared against rivals like the euro. The hegemony of the greenback as the worldâ\u0080\u0099s reserve currency, once viewed as unimpeachable, also has been brought into question more frequently by well-respected experts. Stephen Roach, a Yale University senior fellow and former Morgan Stanley Asia chairman, told MarketWatch last month that his forecast for a sharp deterioration of the U.S. dollar could be a very near-term phenomenon, not an event that looms off in the distance. â\u0080\u009cI do think itâ\u0080\u0099s something that happens sooner rather than later,â\u0080\u009d the economist told MarketWatch during a late-June interview. Schlossberg and Roach point to massive trillion-dollar deficits being amassed by the U.S. to address coronavirus as one factor that is weighing on greenback over the longer term. Tuesdayâ\u0080\u0099s slide in the dollar came as the market finished mixed, with the Dow Jones Industrial Average DJIA, +0.56% and the S&P 500 index SPX, +0.87% finishing with modest gains while the Nasdaq Composite Index COMP, +1.39% ended down 0.8%. The dollar also has lost ground against the British pound GBPUSD, +0.83%, with the currency changing hands at $1.2733 against the buck, up 0.6%. The Australian dollar also strengthened against the U.S. unit, changing hands at $0.7124, up 1.6% against on Tuesday, around its highest levels compared with the buck since December of 2018."}]}