{"article": [{"url": "https://www.marketwatch.com/story/consumer-prices-rise-sharply-for-third-month-in-a-row-but-inflation-still-low-and-expected-to-stay-that-way-2020-09-11", "published": 1599820220.0, "headline": "U.S. consumer prices surge for third month as cost of used cars soar, but inflation still low and expected to stay that way", "body": "The numbers: The cost of U.S. goods and services rose sharply in August for the third month in a row, but the increase mostly stemmed from a rebound in prices after a steep decline early in the coronavirus pandemic. Overall inflation is still quite low. The consumer price index, a measure of the cost of living, rose 0.4% last month, the government said Friday. The biggest spike in the cost of used cars and trucks in more than a half-century accounted for more than 40% of the increase in the index. Economists polled by MarketWatch had forecast a 0.3% advance in the CPI. The increase in August followed back-to-back 0.6% advances in July and June. Yet the cost of most goods and services had declined in the first three months of the pandemic aside from certain items such as toilet paper or meat that were in either high demand or short supply. Even after three straight monthly increases in the CPI, inflation remains low. The increase in consumer prices over the past 12 months moved up to 1.3% from 1%. By contrast, the yearly pace of inflation was much higher at 2.5% at the start of 2020. Another closely watched measure of inflation that strips out food and energy also rose 0.4% last month. The yearly increase in the so-called core rate edged up to 1.7% from 1.6%. What happened: A sharp increase in the cost of used cars and trucks was the biggest contributor to the rise in consumer prices last month. They jumped 5.4% to mark the largest gain in 51 years, an exaggerated increase that should fade soon. Over the past year used-vehicle prices have risen less than 1%. The cost of gasoline, meanwhile, rose a smaller 2% in August after bigger gains earlier in the summer. Gasoline is much cheaper now than it was a year earlier, however. Prices also rose last month for home furnishings, recreation, car insurance and airfare, but most of these goods and services cost less now than they did last year. The cost of rent and housing both rose slightly, but they are no longer rising rapidly due to record-low mortgage rates and higher vacancies during the pandemic, not to mention a moratorium on evictions. The cost of rent has climbed just 2.3% in the past 12 months, the smallest year-over-year increase since 2013. Notably, grocery prices fell. They surged in the first few months of the pandemic as Americans stocked up, but prices have since leveled off. Even after these recent increases, consumer prices are little changed from earlier in the year. Companies don’t have the ability to raise prices much with the economy still recovering from the shutdowns earlier in the year and millions of Americans still out of work. See: MarketWatch Economic Calendar Big picture: Inflation is still running well below the Federal Reserve’s 2% target and is not expected to pose a problem to the economy until the pandemic subsides. The Fed plans to keep interest rates extremely low for at least the next year or two, a strategy it can afford to pursue given the low rate of inflation. What they are saying? “Much of the increase reflects an unwinding of earlier aggressive discounts during the worst of the pandemic,” said senior economist Sal Guatieri of BMO Capital Markets. “Elevated joblessness and increased automation should keep inflation under wraps for some time.” Market reaction: The Dow Jones Industrial Average DJIA, +0.56% and S&P 500 SPX, +0.87% rose in early Friday trades."}]}