{"article": [{"url": "https://www.marketwatch.com/story/oil-buoyed-by-sliding-us-dollar-as-traders-watch-stimulus-talks-coronavirus-toll-2020-07-27", "published": 1595863100.0, "headline": "Oil gets a boost from a weaker dollar, but coronavirus worries limit the price rise", "body": "Oil futures gave up early losses Monday to finish higher, buoyed by a drop in the U.S. dollar index to its lowest in two years, but the continued spread of COVID-19 and its impact on the economy, as well as U.S.-China tensions limited the rise in prices. Recent weakness in the dollar has been “beneficial to dollar-denominated commodities in general and to oil in particular,” said Marshall Steeves, energy markets analyst at IHS Markit. Read:Gold marks highest settlement and intraday price on record The dollar was under pressure, with the ICE U.S. Dollar Index DXY, -0.58%, which tracks the currency against a basket of six major rivals, sliding to its lowest levels since 2018. A weaker dollar can be supportive for commodities as it makes them less expensive to users of other currencies. Read:Here’s what a falling U.S. dollar means for the stock market The possibility of a successful COVID-19 vaccine is “also bullish for crude oil, though it will likely be some time before it can be fully approved and distributed,” Steeves told MarketWatch. “The recent rise of the virus in many parts of the U.S. across the South and Southwest has again threatened the recovery in demand,” he said. “Hence, this has resulted in an uncertain outlook for oil demand growth.” Against that backdrop, West Texas Intermediate crude for September delivery CL.1, -1.62% US:CLU20 on the New York Mercantile Exchange tacked on 31 cents, or nearly 0.8%, to settle at $41.60 a barrel, after trading as low as $40.48. “The near-term outlook toward WTI crude is neutral to bullish,” Steeves said. “Upside momentum is stalling because of the uncertain path of the coronavirus and whether it can be contained.” Read:U.S. shale oil production may take years to recover from COVID-9 demand slump September Brent crude BRN.1, -0.07% BRN00, -0.07%, the global benchmark, also edged up by 7 cents, or 0.2%, to $43.41 a barrel on ICE Futures Europe. “On the one hand, the risks of a less robust recovery of demand due to coronavirus, and the political tensions between the U.S. and China, are weighing on prices,” said Eugen Weinberg, analyst at Commerzbank, in a note. “And on the other, prices are finding support from the weak U.S. dollar and hopes of further corona aid in the U.S.” The number of confirmed cases of COVID-19 world-wide climbed above 16.2 million on Monday, according to data aggregated by Johns Hopkins University, and the death toll rose to 648,966. The U.S. case tally climbed to 4.23 million and the death toll rose to 146,935. U.S.-China tensions were on the rise last week, with Beijing ordering the U.S. to close its consulate in the western Chinese city of Chengdu, days after Washington ordered the closure of China’s Houston consulate. Meanwhile, on the domestic front, Senate Republicans were expected later Monday to release their proposal for a second round of coronavirus spending, news reports said. “Some COVID-19 pessimism is still around and news of uncomfortably high new coronavirus cases in key U.S. states and new cases in China and Hong Kong…add fuel to the fire of sentiment woes,” Bjornar Tonhaugen, head of oil markets at Rystad Energy, said in emailed commentary. “A wild card is also how U.S.-China tensions will evolve, will the current spat end with the closure of the two consulates or will trade be affected,” he said. Meanwhile, traders watched for news on disruptions to crude and natural-gas production in the Gulf of Mexico after Hanna, which hit the South Texas coast as a hurricane over the weekend. The port of Corpus Christi “looks to have been largely spared extensive damage, but nevertheless we can expect some disruption of trade in the near term, although this appears to have had limited impact on crude and product prices,” wrote analysts at JBC Energy, a Vienna-based consulting firm. On Nymex, August natural gas US:NGQ20 fell by 4.1% to $1.734 per million British thermal units, ahead of the contract’s expiration Wednesday. August gasoline US:RBQ20 shed 0.8% to $1.2747 a gallon and August heating oil US:HOQ20 inched 0.2% lower to $1.2541 a gallon."}]}