{"article": [{"url": "https://www.marketwatch.com/story/no-indoor-dining-when-new-york-city-reaches-phase-3-next-monday-2020-07-01", "published": 1593628940.0, "headline": "No indoor dining when New York City reaches Phase 3 next Monday", "body": "Restaurants across New York City had already rehired more workers and scheduled training to go over new hygiene protocols when officials made a last-minute decision on Wednesday to postpone indoor dining. Indoor dining, which was expected to open at 50% capacity starting on Monday as part of Phase 3 of reopening, will be postponed in New York City until it poses less of a public health risk, said Mayor Bill de Blasio at his morning briefing Wednesday. The sentiment was later echoed by Gov. Andrew Cuomo. The decision comes as COVID-19 cases have resurged across other states, many of which have recorded clusters linked to bars and restaurants. Many California bars and indoor restaurants will close back down as part of new restrictions announced Wednesday; Texas closed bars and limited restaurant seating last week; and New Jersey also decided this week to postpone indoor dining. See: Florida coronavirus cases surge 46% over the last week — but Gov. DeSantis says he won’t delay state’s reopening plans “We cannot go ahead, at this point in time, with indoor dining in New York City,” de Blasio said. “Even a week ago, honestly, I was hopeful we could, but the news we have gotten from around the country gets worse and worse all the time.” It was a whiplash decision for some dining establishments, especially those that cannot take full advantage of outdoor dining, which has been allowed since Phase 2 began on June 22. Roughly 6,600 bars and restaurants have opened up outdoor seating so far, the mayor said on Wednesday—about 22% of the city’s 27,000 dining establishments. At the upscale Lebanese restaurant ilili, located near Manhattan’s Washington Square Park, owner and chef Philippe Massoud had spent the last three days rehiring staff and scheduled training sessions for Monday and Tuesday, he said. “We’ve had to announce to our staff that they are no longer hired and put everything on hold,” Massoud said. “Even allowing us to open at 50% capacity by no means would have saved us. But it would have given us a better pulse.” The restaurant has created new options for takeout customers and relaunched its catering, but outdoor seating hasn’t been a boon to all venues. A handful of tables along Fifth Avenue hardly compare to the 300-plus seats ilili’s cavernous, two-level space could fill pre-pandemic. Also see: How COVID-19 could spread on college campuses. Will students be safe? “Outdoor dining doesn’t treat everyone equally; some of it is the luck of geography,” said Randy Peers, president and CEO of the Brooklyn Chamber of Commerce. But Brooklyn’s restaurant owners are understanding of the public health concern, and are putting their focus on optimizing for delivery and outdoor expansion, he said. “It’s disappointing for sure because we did get our hopes up,” Peers said, adding that he wishes the city will be as flexible as possible with outdoor dining and that the state liquor authority will extend a special rule allowing restaurants with licenses to sell booze to go. That allowance is pegged to expire on July 26. The mayor said the city will double down on outdoor dining in the meantime, including an outreach effort to get more businesses to put tables outside and potentially opening up more streets to restaurants. For now, there’s no timeline for when the city’s restaurants will be allowed to welcome diners back inside. Some businesses have told staff in emails that the delay could be a matter of two to three weeks. Others, like Massoud, said his optimistic scenario is one month. See: Why is indoor dining so dangerous? Cuomo, who made the final decision, said three factors will determine how soon diners can eat indoors. One is how quickly the nation’s viral resurgence gets under control. But New Yorkers could help speed up the return to indoor dining by showing better compliance with social distancing and mask wearing, and if the city can show its doing a better job enforcing the rules, he said. “Go to the East Village, go to the West Side, go to Brooklyn, go to Queens, go to the Bronx. Citizen compliance is slipping,” Cuomo said. “If citizens comply, if businesses help us with it, if government helps us with enforcement, then we’ll be in good shape.”"}]}