{"article": [{"url": "https://www.marketwatch.com/story/kamala-harris-says-supreme-court-nominee-amy-coney-barrett-will-overturn-obamacare-2020-09-28", "published": 1601391560.0, "headline": "Kamala Harris says Supreme Court nominee Amy Coney Barrett â\u0080\u0098will overturnâ\u0080\u0099 Obamacare", "body": "“ â\u0080\u0098President Trump and his party and Judge Barrett will overturn the Affordable Care Act. And they wonâ\u0080\u0099t stop there. They have made clear that they want to overturn Roe vs. Wade and restrict reproductive rights and freedoms.â\u0080\u0099 ” â\u0080\u0094 Democratic vice-presidential nominee Kamala Harris The line above came Monday afternoon from Democratic vice-presidential nominee Kamala Harris, as she gave a speech in the swing state of North Carolina on President Donald Trumpâ\u0080\u0099s push to fill the current vacancy on the Supreme Court. Joe Bidenâ\u0080\u0099s running mate also criticized Trump and the Republican-led Senateâ\u0080\u0099s decision to ignore the late liberal Supreme Court Justice Ruth Bader Ginsburgâ\u0080\u0099s â\u0080\u009cfinal wish to hold off the nomination to replace her until after the next president is chosenâ\u0080\u009d â\u0080\u0094 and asked voters to make them pay on Nov. 3. â\u0080\u009cYou can make it very clear very soon how you feel about being cut out of this Supreme Court nomination process,â\u0080\u009d Harris said in her address at Shaw University in Raleigh, N.C. The Trump administration is waging a legal fight against the Affordable Care Act, also known as Obamacare, arguing that it must be scrapped a decade after its overhaul of U.S. health care XLV, +0.90%. The Supreme Court is slated to hear arguments on the matter on Nov. 10. Related:The Supreme Courtâ\u0080\u0099s Obamacare case was high stakes before Amy Coney Barrettâ\u0080\u0099s nomination. Hereâ\u0080\u0099s why itâ\u0080\u0099s even more important now And see:Hereâ\u0080\u0099s where Trump and Biden stand on health care But Nicholas Bagley, a University of Michigan law professor, is among the experts who have argued that itâ\u0080\u0099s not clear how Trumpâ\u0080\u0099s Supreme Court pick, Amy Coney Barrett, would rule in the suit, which he said is â\u0080\u009csignificantly weakerâ\u0080\u009d than a past challenge to the ACA. â\u0080\u009cI think ACA supporters should be concerned,â\u0080\u009d Bagley told NBC News. â\u0080\u009cNot panicked: The lawsuit is weak and the Supreme Court is unlikely to endorse it. But a small risk of a bad thing is worth worrying about.â\u0080\u009d On Roe vs. Wade, the landmark 1973 ruling on abortion, Barrett said in 2013 that the â\u0080\u009cpublic response to controversial cases like Roe reflects public rejection of the proposition that [precedent] can declare a permanent victor in a divisive constitutional struggle rather than desire that precedent remain forever unchanging. Court watchers embrace the possibility of overruling, even if they may want it to be the exception rather than the rule.â\u0080\u009d She also said in 2016 that she doesnâ\u0080\u0099t think the right to abortion is likely to change, but â\u0080\u009csome of the restrictions would change.â\u0080\u009d The Senate Judiciary Committee is expected to have Barrettâ\u0080\u0099s confirmation hearing begin Oct. 12 with opening statements from the panelâ\u0080\u0099s members and the judge, with questioning to start Oct. 13. Harris, Californiaâ\u0080\u0099s junior senator and a member of the committee, told reporters on Monday that she planned to take part in those proceedings. â\u0080\u009cI am definitely going to be involved in the hearings and performing my role and responsibility on the Senate Judiciary Committee,â\u0080\u009d Harris said. This is an updated version of a report first published on Sept. 28, 2020."}]}