{"article": [{"url": "https://www.marketwatch.com/story/how-in-person-college-reopenings-could-be-affecting-covid-19-spread-one-study-linked-3-000-cases-a-day-to-campuses-11600890869", "published": 1601012480.0, "headline": "New study estimates link between in-person college reopenings and COVID-19 cases", "body": "New research provides insight into how college reopening plans may have impacted the spread of COVID-19. Sean Rayford/Getty Images Colleges across the country have faced scrutiny after inviting students back to campus in the midst of a global pandemic. New research aims to estimate the impact those decisions have had on the spread of COVID-19. A paper by an economist at the University of North Carolina at Greensboro, an epidemiologist at Indiana University, and a higher education expert at Davidson College (among others), found that colleges reopening for in-person instruction was associated with 3,000 new cases of COVID-19 per day in the U.S. The researchers estimated a 95% confidence interval for the findings of between roughly 1,000 and 5,000 cases. “These colleges that chose to open for face-to-face instruction, they’re contributing to county case counts,” said Martin Andersen, an assistant professor of economics at UNC-Greensboro and one of the authors of the study. The findings, which are currently under review proceedings at the National Academy of Sciences (meaning they have yet to be peer reviewed), come amid months of controversy over colleges’ approach to this fall. When the pandemic first took hold in the spring, pretty much every college rushed to send students home. But this semester, colleges have employed a wide array of plans as many face both political and financial pressure to provide students with as close to the “college experience” as they had anticipated pre-pandemic. Many colleges brought students back for face-to-face instruction and to live in on-campus residence halls with a range in approaches to testing. In some cases, colleges invited students back only to send them to lock down in dorms as cases spiked, or even to return home. Other schools decided to keep their campuses largely closed and hold classes only online. Findings based on an analysis of cell phone and case data To come up with the findings, the team of researchers looked at cell phone data to track mobility in the weeks leading up to and following campus reopenings. The group compared what they learned from the cell phone movements to data on COVID-19 cases at the county level. What they found is that in counties with a campus that reopened in person, the incidence of COVID-19 cases increased by a statistically significant level after the influx of people to the region as indicated by the cell phone data. “We’re not able to make a causal connection in quite the way we want to,” Andersen said. Instead the movement to campuses is correlated with the increase in cases. The findings have a few other caveats, Andersen said. For one, the team’s method attributes all of the increase in county cases to the behavior of a college in a given county. In other words, there may be cases in the broader community that aren’t necessarily associated with the college’s behavior. In addition, in deciding whether to classify a campus as in-person or online, the researchers used “a pretty course measure,” Andersen said. Finally, the findings don’t capture colleges’ efforts to mitigate the spread of the virus. “We would love to be able to take this result and say ‘OK campuses, do this and you’ll be able to protect your community.’ We’re not in a position to do that yet,” Andersen said. “We are in a position to say ‘be thoughtful, be careful.’ We’ve shown you some of the costs of being a face-to-face institution.” As colleges consider their plans for the spring semester, for example, Andersen said, they can weigh these potential costs of in-person instruction against the benefits. There are some more precise insights that can be gleaned from the findings. Even at colleges that made the decision to offer only remote instruction, it appears some students still moved to the areas where their colleges are located; researchers found a 30% to 40% bump in the number of devices on campus even after colleges opened online. Even so, opening up online wasn’t correlated with an increase in positive COVID-19 cases. In addition, the researchers found that colleges drawing students from areas with high positivity rates were more likely to see increases in positive case counts in their counties. “Where a college draws its students from seems to have a fairly big effect on how the county weathers the college reopening,” Andersen said. ‘Difficult to attribute a precise numerical estimate’ Joshua Salomon, a professor of medicine at Stanford University and the director of the Prevention Policy Modeling Lab, a research consortium focused on modeling related to infectious disease, said the researchers did a “commendable job” with the data that they have available to them. Salomon, who was not involved in the study, said their findings are “consistent with what we had expected,” and “consistent with intuition and logic.” Still, he added, “it is difficult to attribute a precise numerical estimate,” like 3,000 new cases per day, “to this causal effect.” For one, it’s hard to untangle a college’s approach to reopening from the broader landscape of policies in that region that may have contributed to increasing case counts. In addition, Salomon said that colleges’ decision to test students as they arrived may have contributed to higher case counts during this period. Andersen said if the increase in cases were due to increased testing as students arrived to campus, they likely would have shown up between one day before the campus opened and one day after. Many of the observations of positive cases showed up in the second week of colleges reopening, he said. “They’re trying to do something that is quite hard, which is to reconstruct what would have happened if colleges that reopened in person had done something different,” Salomon said of the research. “We’re relying on what we can observe in the world as opposed to what we would do if we were running an experiment,” he said, noting that many policy impact analyses are done this way and that many are being conducted in this way right now because that’s the data we have available. Despite these caveats, the Salomon said he believes the findings are “directionally correct” and provide insight into the consequences of colleges’ behavior during this time. “It’s a reminder, as if we needed one, that the decisions that college administrators are making can have profound impact not only on their college communities, that include students and faculty and staff, but also on the surrounding communities.”"}]}