{"article": [{"url": "https://www.marketwatch.com/story/traditional-long-term-care-policies-can-still-work-2020-09-01", "published": 1598954960.0, "headline": "Traditional long-term care policies can still work", "body": "I recently wrote that the market for long-term care insurance, which was growing rapidly 20 years ago, has shrunk dramatically. When the market boomed, insurers bet that over time policyholders would let their policies lapse. 80% of older Americans can't afford to retire - COVID-19 isn't helping Instead, many more people who had long-term care insurance (which covers the cost of skilled care and assisted living or nursing home facilities) held on to their policies, and when they tapped into them to pay for care, insurers sometimes had to pay out benefits in the six-figure range. So, the companies jacked up prices and pushed regulators for aggressive rate increases for existing customers, while many insurers stopped writing new policies altogether. But there are still some good deals for people who want traditional long-term care policies. So, I contacted Brian Gordon, president of long-term care specialist MAGA Ltd. (Murray A. Gordon Associates, not Make America Great Again). The firm, which was started by his father Murray in 1975, is based in Bannockburn, Illinois. First of all, Gordon told me, there’s a myth that Medicare covers long-term care expenses; it covers only the limited costs of recovery from acute medical conditions, like a stroke. For the rest, you’re on your own. “We’ve always told our clients to anticipate Medicare doing nothing,” he said. Read: 5 things to know about health care in retirement Medicaid does pay for long-term care, but you’ll have to spend down your own assets before you qualify, and the quality of care can leave a lot to be desired. If you’re rich, on the other hand, you can pay out of pocket. “I’ve got clients today who can buy a nursing facility. They can live there by themselves and they would still have plenty of money left,” Gordon said. Long-term care insurance is best, he told me, for people with net assets of $500,000 and up. They can’t afford to pay the entire cost of an extended nursing home stay, and long-term care insurance could help them cover their care while preserving assets to leave to their heirs. How much coverage should you look for? “Most people we work with are looking to cover anywhere from about 50% to about 75% of the cost of care,” he told me. “So, if the cost of care is, say, $10,000 a month, my clients are usually looking at between about $5,000 and about $7,500 a month in benefits.” Gordon says his clients range in age from the 40s to the 70s, although it’s harder for older people to buy long-term care policies and the premiums are much higher. “I would say somewhere in our early, mid-50s is usually a good time to buy it,” he said. How much should you pay at that time? “Our average premium on a traditional long-term care plan is probably a little bit over $3,000 a year,” he said. Gordon prepared several hypothetical quotes from a major insurer for Retirement Weekly. The premium for a 55-year-old male who buys a policy that pays $170 a day ($5,000 a month) for three years with a 3% inflation adjustment would be around $2,000 a year. A woman of the same age with the same benefits would pay $1,200 a year more. (Women live on average about five years longer than men do.) Add another year to the benefit period and the premium would be about $300 higher for the man and $700 for the woman. A shared plan for a 55-year-old female/male couple costs just over $4,200 annually for a three-year benefit period and a bit more than $5,000 for four years. That couple discount amounts to $1,000 for three years of coverage and $1,200 for four years. Big age differences between spouses make it more complicated, but in this case, you’d pay just under 20% less for a joint policy than you would for coverage of two individuals. Since women tend to be in long-term care on average 1.5 years longer than men do, a four-year benefits term makes sense for them while three years should suffice for most men. You might look for more coverage in states like Hawaii and Connecticut, where semiprivate rooms in nursing homes cost around $12,000 a month, double what they cost in Texas or Oklahoma. And though some legacy plans include inflation riders of 5%, these days paying for 3% annual inflation protection is standard. (In the five years ending in 2018, costs of long-term care rose from 2% to 3.6% annually, according to Genworth Financial.) But the best reason to buy long-term care insurance may not be financial. “It signals to the family that when our minds were good and we were healthy, we made the decision to buy this insurance,” said Gordon. “It basically tells the family it’s OK to bring in home health care and it’s OK to put them in a nursing facility.” How much is it worth to know you won’t be a burden on your loved ones when you can no longer take care of yourself? That’s the real question to ask yourself as you consider all the options to cover long-term care."}]}