{"article": [{"url": "https://www.marketwatch.com/story/trump-bans-transactions-with-chinese-owners-of-tiktok-wechat-2020-08-06", "published": 1596758600.0, "headline": "Trump bans â\u0080\u0098transactionsâ\u0080\u0099 with Chinese owners of TikTok, WeChat", "body": "NEW YORK â\u0080\u0094 President Donald Trump on Thursday ordered a sweeping but unspecified ban on dealings with the Chinese owners of consumer apps TikTok and WeChat, although it remains unclear if he has the legal authority to actually ban the apps from the U.S. The twin executive orders â\u0080\u0094 one for each app â\u0080\u0094 take effect in 45 days. They call on the Commerce Secretary to define the banned dealings by that time. While the wording of the orders is vague, some experts said it appears intended to bar the popular apps from the Apple AAPL, +1.74% Â and Alphabetâ\u0080\u0099s GOOGL, +1.82% Â GOOG, +1.97% Â Google app stores, which could effectively remove them from distribution in the U.S. â\u0080\u009cThis is an unprecedented use of presidential authority,â\u0080\u009d Eurasia Group analyst Paul Triolo said in an email. At a minimum, he said, the orders appear to â\u0080\u009cconstitute a ban on the ability of U.S. app stores run by Apple and Google to include either mobile app after 45 days.â\u0080\u009d Triolo said the orders may face legal challenges and warned that Beijing is likely to â\u0080\u009creact harshly, at least rhetorically.â\u0080\u009d Trumpâ\u0080\u0099s orders cited legal authority from the International Emergency Economic Powers Act and the National Emergencies Act. The Trump administration has railed against the threat from China, and both Republican and Democratic lawmakers have also raised concerns about TikTok, including censorship, misinformation campaigns, the safety of user data and childrenâ\u0080\u0099s privacy. But the administration has provided no specific evidence that TikTok has made U.S. usersâ\u0080\u0099 data available to the Chinese government. Instead, officials point to the hypothetical threat that lies in the Chinese governmentâ\u0080\u0099s ability to demand cooperation from Chinese companies. Earlier in the week, Trump threatened a deadline of Sept. 15 to â\u0080\u009cclose downâ\u0080\u009d TikTok unless Microsoft or another company acquires it. On Wednesday, U.S. Secretary of State Mike Pompeo announced an expansion of the U.S. crackdown on Chinese technology to include barring Chinese apps from U.S. app stores, citing alleged security threats and calling out TikTok and WeChat by name. TikTok and Microsoft MSFT, +2.48% Â had no immediate replies to queries. Tencent 700, +0.84% Â declined to comment. Leading mobile security experts say TikTok is no more intrusive in its harvesting of user data and monitoring of user activity than U.S. apps owned by Facebook FB, +0.26% Â and Google. â\u0080\u009cI am the first to yell from the rooftops when there is a glaring privacy issue somewhere. But we just have not found anything we could call a smoking gun in TikTok,â\u0080\u009d mobile security expert Will Strafach told The Associated Press last month after examining the app. Strafach is CEO of Guardian, which provides a firewall for Apple devices. The order doesnâ\u0080\u0099t seem to ban Americans from using TikTok, said Kirsten Martin, a professor of technology ethics at the University of Notre Dame. She added that such an order would be nearly impossible to enforce in the first place. â\u0080\u009cIf goal is to get teenagers to stop using TikTok, Iâ\u0080\u0099m not sure an executive order will stop them,â\u0080\u009d she said. â\u0080\u009cEvery teenager knows how to use a VPN (a virtual private network). They will just pretend they are in Canada.â\u0080\u009d TikTok is a video-sharing app thatâ\u0080\u0099s widely popular among young people in the U.S. and elsewhere. It is owned by the Chinese company ByteDance, which operates a separate version for the Chinese market. TikTok insists it does not store U.S. user information in China and would not share it with the Chinese government. TikTok says it has 100 million U.S. users and hundreds of millions globally. According to research firm App Annie, TikTok saw 50 million weekly active users in the U.S. during the week of July 19, the latest available figure. Thatâ\u0080\u0099s up 75% from the first week of the year. WeChat and its sister app Weixin in China are hugely popular messaging apps; many Chinese expatriates use WeChat to stay in touch with friends and family back home. WeChat also says it doesnâ\u0080\u0099t share data with the Chinese government and never has, and does not store international user data in China. U.S. user data is stored in Canada. The order against Tencent could have ramifications for users beyond WeChat, which is crucial for personal communications and organizations that do business with China. Tencent also owns parts or all of major game companies like Epic Games, publisher of Fortnite, a major video game hit, and Riot Games, which is behind League of Legends."}]}