{"article": [{"url": "https://www.marketwatch.com/story/two-stock-market-risks-are-hiding-in-apple-amazon-facebook-and-alphabet-2020-07-31", "published": 1596454400.0, "headline": "Two stock market risks are hiding in Apple, Amazon, Facebook and Alphabet", "body": "Stock market bulls are giddy. What is there not to be happy about — the stock market mostly rises, and making money seems easy. While newly minted investors are focusing on running up small, speculative stocks, institutions are hiding in big-cap tech stocks. For prudent investors, the time to understand two big hidden stock market risks is now — when the market is high. Let’s review the Dow Jones Industrial Average ETF DIA, +0.57%, which tracks the Dow Jones Industrial Average DJIA, +0.56%, and see how it compares to the S&P 500 SPX, +0.87%, Amazon ( AMZN, +3.01%, Apple AAPL, +1.74%, Alphabet GOOG, +1.97% GOOGL, +1.82% and Facebook FB, +0.26%. • As popular as Apple stock is among investors, it has significantly underperformed shares of Amazon, Alphabet and Facebook. • Apple just reported blowout earnings in spite of the pandemic. The company also announced a four-for-one stock split. Apple’s stock is flying high. • Amazon was expected to report great earnings as it became a quintessential utility for consumers during the pandemic. Amazon outdid most estimates. • In spite of a boycott by advertisers — and an advertising slump in general — Facebook’s earnings were a blowout — just like Apple’s. • Alphabet earnings were excellent but not a blowout. However, by some measures, Alphabet is the cheapest of the four stocks. • Charts of Apple, Amazon, Alphabet and Facebook stocks are as bullish as they get. The companies’ earnings are accelerating. If they can produce excellent earnings during a pandemic, imagine what they can do when the economy starts booming and there is a vaccine. Their market dominance is increasing and so is the range of their offerings. Two hidden risks Before sending me hate mail for pointing out the risks, understand that The Arora Report is bullish on these stocks. Amazon, Facebook, Alphabet and Apple are in The Arora Report model portfolio. And my job is to help investors. While many investors focus on the rewards of the stock market, it is more important to focus on the risks in this environment, where excessive government borrowing and excessive money printing by the Federal Reserve are inflating the stock market bubble. Here are the two hidden risks: • A part of the strength in these four companies is that they have become quintessential utilities. Consumers have very little real choice to go elsewhere. Customarily, utilities in the United States have been regulated and there have been serious regulatory limits on the profits they can make. If you watched the recent congressional hearing, you may have already reached an unmistakable conclusion that regulation is coming. It is a question of “when,” not “if.” • These four stocks have become crowded trades. The best way to understand a crowded trade is to think of a fast-moving boat in which everybody is on one side. The boat may keep on going safely for a long time, but it takes only a small wave for the boat to capsize. Investors ought to properly restructure their stock market portfolios to account for these risks. Disclosure: Arora Report portfolios have positions in Apple, Amazon, Alphabet, and Facebook. Nigam Arora is the founder of The Arora Report, which publishes four newsletters. He can be reached at Nigam@TheAroraReport.com."}]}