{"article": [{"url": "https://www.marketwatch.com/story/treacherous-domestic-politics-constrain-us-ability-to-provide-needed-global-leadership-to-revive-growth-amid-covid-19-2020-06-23", "published": 1592989880.0, "headline": "U.S. political squabbling could doom the world to lower growth, wider inequality and dangerously distorted markets, says Mohamed El-Erian", "body": "LAGUNA BEACH, Calif. (Project Syndicate) — What does the future hold for the global economy? As it stands, the most likely answer, unfortunately, is lower growth, worsening inequality, distorted markets, and rising financial risks. But this outcome is not preordained. With timely changes to the policy paradigm, policy makers could lay the groundwork for a more dynamic, inclusive, and resilient economy. The economic damage wrought by the COVID-19 crisis in the second quarter of 2020 was even worse than expected: economic activity plummeted, inequality rose, and elevated financial markets decoupled even more from economic reality. And with a vaccine yet to be developed, the path out of the pandemic — and the associated economic crisis — remains deeply uncertain. The world’s leading international economic institutions — the International Monetary Fund, the OECD, and the World Bank — now warn that it may take at least two years for the global economy to regain what has been lost to COVID-19. If the major economies face additional waves of infections, recovery would take even longer.Financial market disconnect Timely and well-designed pro-growth policies could speed up this timeline, while making the recovery more broad-based and sustainable. This does not only mean more short-term relief, but also greater emphasis on forward-looking measures that promote productivity, reduce households’ economic insecurity, better align domestic and international growth impulses, and counter the increasingly dangerous disconnect between the financial system and the real economy. “ Instead of being part of the solution, the Fed is now at risk of creating more problems, including resource misallocation, debt overhangs, and financial instability — all of which would undermine growth. ” Here, the U.S., as the world’s largest economy, has an important leadership role. As the supplier of the main global reserve currency, the U.S. plays a major part in mobilizing and allocating the world’s investible funds, especially at a time when the Federal Reserve is intervening heavily in global financial markets. And as a dominant player in the IMF, the World Bank, the G-7, and the G-20, it can drive — or undermine — global policy coordination. While U.S. policy makers are generally more than willing to pursue growth-enhancing policies, their ability to do so is increasingly constrained by treacherous domestic politics. Yes, the $3 trillion coronavirus relief package was an impressive display of bipartisanship. But, as COVID-19 infections rise and social tensions surface — exemplified by widespread protests over racial injustice and police violence — America’s lawmakers have returned to their respective corners. As a result, progress on laying the foundations for long-term growth — including in areas where there appeared to be bipartisan agreement, such as infrastructure and (to a lesser extent) worker retraining and retooling — seems a more distant prospect.Fed distorting financial markets A similar disconnect between will and ability can be seen in America’s monetary-policy response. The Fed is willing to do whatever it can to limit the cyclical and structural damage to the labor market, which includes more than 46 million people who have filed for unemployment benefits. But it lacks both efficient tools and support from fiscal policy makers, who are better equipped to promote durable growth. With few options to promote genuine economic growth, the Fed has felt compelled to take previously unthinkable steps that are increasingly distorting the functioning of financial markets, thereby aggravating wealth inequality and encouraging excessive risk-taking by both debtors and investors. Instead of being part of the solution, the Fed is now at risk of creating more problems, including resource misallocation, debt overhangs, and financial instability — all of which would undermine growth. Intention and outcome are also misaligned in international economic relations. In its bid to make the global trading system fairer, President Donald Trump’s administration has pursued bilateral policies that have undermined trade flows. The U.S. is now the most protectionist of the advanced economies. More broadly, at a moment when multiplying global crises are demanding close coordination of individual and collective policy responses, the Trump administration has eschewed multilateralism. To some countries in Asia, in particular, its own policy has become increasingly unpredictable, fueling doubts about the robustness and reliability of a global system that has the U.S. at its core. China, for one, has hastened its efforts to deepen bilateral and regional linkages so that it can bypass the U.S., but at the cost of fragmenting the international system.Pro-growth policies U.S. policy makers are divided on many issues, but surely they can agree on the desirability of faster, more inclusive, and more durable growth. The only way to achieve this sustainably is to accompany short-term relief measures with forward-looking pro-growth (and pro-work) fiscal policies and structural reforms. Otherwise, potentially reversible short-term problems, such as high unemployment, could become deeply entrenched and much more difficult to address. For its part, the Fed must exercise more caution in how it intervenes in markets. By continuously expanding both the scale and reach of its asset-purchase programs, it is stripping markets of their ability to price and allocate resources appropriately. If it’s not careful, the Fed could end up inadvertently pulling the rug out from under America’s potent market-based system, propping up productivity-weakening zombie companies, and further reducing the likelihood that genuine economic growth would eventually validate elevated asset prices. Finally, U.S. policy makers should work together to restore their country’s global economic leadership, by reinvigorating multilateral policy discussions and improving the functioning of the rules-based global system. To this end, the U.S. should revive stalled efforts to reform IMF and World Bank governance, including by bringing representation into line with today’s economic realities and working to increase the Fund’s resources. Other countries should not underestimate the importance of such changes for their own economic performance. No matter how big an economy is, it is likely to be influenced by U.S. economic growth, international financial stability, and monetary policy spillovers. With the COVID-19 crisis, the evolution of the global economic-policy paradigm has become an urgent matter. The challenge for other countries now is to reduce America’s “execution risk,” by doing whatever they can at home to ensure self-reinforcing growth impulses and a fairer international system. This article was published with permission of Project Syndicate — Post-Pandemic Economic Leadership Begins in America. Mohamed A. El-Erian, chief economic adviser at Allianz, was chairman of President Barack Obama’s Global Development Council. He is the author, most recently, of “The Only Game in Town: Central Banks, Instability, and Avoiding the Next Collapse.”"}]}