{"article": [{"url": "https://www.marketwatch.com/story/inside-the-struggle-to-close-the-education-equality-gap-exacerbated-by-covid-19-11597072379", "published": 1597130660.0, "headline": "Inside the struggle to close the education equality gap exacerbated by COVID-19", "body": "Amy Gatlin (L) and her son Blake Gatlin are protesting against schools reopening Tampa, Florida. School districts may not have the funds to re-open safely, but parents and students are struggling with the possibility that schools will remain closed in many parts of the country this fall. Photo: Octavio Jones/Getty Images. A few weeks ago, Sara Messinger sat in her New York City apartment researching the tutoring market. Messinger, 21, isn’t a parent looking for a way to cope with the uncertainty surrounding a pandemic fall semester at grade and high schools. She’s a college student who decided that instead of taking classes full-time for her degree, which involves hands-on documentary photography and film courses online, she would cut back on courses and fill her extra time tutoring students. “I was reading all these articles wondering, ‘What can I charge people?’” she said. “I realized the extravagant prices people were charging parents.” Sara Messinger started Spread Tutoring a few weeks ago. David Orlando Indeed, a whole industry of firms — including tutoring companies, nanny agencies and teacher placement services — has popped up across the country in the past several weeks, offering to help parents hire an educator to teach a handful of students, siblings or a child one-on-one to compensate for or even replace remote classes. But these services are largely available only to those who can afford them. Some companies are charging five-figure placement fees, and even parents who find a tutor or nanny on their own could pay up to $100 per hour. “It made me very upset,” Messinger said of discovering this dynamic. So instead of cashing in, she decided to try to do something about it. At Spread Tutoring, the business she launched just a few weeks ago, families who can afford it buy an hour of tutoring at competitive rates — $50 per hour for one child or $30 per hour, per child for small groups — and an hour of tutoring is provided to a low-income family. Though she wanted to provide tutoring to families who might not ordinarily be able to afford it, paying the tutors themselves was also important to Messinger. She wanted her peers who may be struggling in the pandemic job market — college students and recent graduates — to have some paid work. Shortly after Messinger came up with the idea, she asked her aunt to let her in to New York City mom Facebook groups, where she began advertising. So far she’s had about 20 families apply to buy paid tutoring through the program and applications from about 40 people interested in becoming tutors. New York Gov. Andrew Cuomo has said the state can reopen schools, but there’s no guarantee schools will open this fall. “ ‘I never thought I could make a tutoring business — I never should have. I think the government agencies and school districts have failed to plan for children.’ ” — Sara Messinger, founder of Spread Tutoring “I never thought I could make a tutoring business — I never should have,” Messinger said. “I think the government agencies and school districts have failed to plan for children.”Companies move to fill the void The fact that companies like Messenger’s and others offering more expensive and exclusive services have had to step into the educational void created by the COVID-19 pandemic will likely have implications not only during this period, but for years to come. Without in-person schooling available, children whose parents have to show up to work — often overlapping with the most marginalized communities — have a dearth of safe options. When these children can learn from home safely, they may not have access to the necessary devices and a strong Wi-Fi connection. Even in relatively privileged families in which parents can work from home, pandemic-era schooling has created a burden. Balancing conference calls with Zoom ZM, +2.89% lessons can be nearly impossible, and women have been more likely to drop out of the labor force or pare back their hours to make it work. But without a large increase in funding, most school systems don’t have the money to reopen safely. Budgets for most districts were already squeezed by the Great Recession and slow recovery, a pattern that will likely continue during the pandemic-induced downturn. It may not be surprising that given all these pressures, those who can afford it will reach for solutions, particularly as remote schooling stretches out over the next several months. That push is one of the many dynamics exposing inequalities during this period. “Families and companies are stepping into this space because of a failure at the federal level to provide the resources that schools need to actually do something equitable right now,” said Jessica Calarco, an associate professor of sociology at Indiana University and the author of “Negotiating Opportunities: How the Middle Class Secures Advantages in Schools.” “For individual families, even if there are services that are providing low-cost or free access there will only be so many students who can take advantage of those options and those will be the more privileged among the less privileged,” she added. “These kinds of privatized solutions, there just aren’t enough slots to go around.” Of course, our nation’s kindergarten through 12th grade school system wasn’t serving students equitably before the pandemic. Public schools in wealthier and whiter neighborhoods typically have access to the kind of funding that can provide things like smaller class sizes and better lab equipment. The pre-COVID version of pods of students receiving private education in families’ backyards was access to advanced-placement course work, extracurricular activities and SAT tutoring, said Terra Wallin, the associate director for P-12 accountability and special projects at EdTrust, a think tank. “ ‘It’s really just a symptom of inequities that have already existed.’ ” — Terra Wallin, associate director for P-12 accountability and special projects at EdTrust “It’s really just a symptom of inequities that have already existed,” Wallin said of the current dynamic. Add to that a pandemic and accompanying recession that has disproportionately affected Black and Hispanic families, and the continued closure of schools this fall is likely to exacerbate these inequalities. It could also have long-lasting implications for the nation’s public school systems, Calarco said. “The more we privatize supplemental support for instruction, the more it will push those privileged parents to look outside of the public school system and to un-invest in the public school system,” she said. A summer program matching college students with younger learners Still, some organizations stepping into the void have already had success, or at least interest. In Tennessee, nearly 3,000 students in kindergarten through sixth grade this summer participated in the Tennessee Tutor Corps, a program that, like Spread, took advantage of a less-than-ideal summer for college students to help serve younger students who lost out on valuable schooling in the spring. Through the program, run by the Bill and Crissy Haslam Foundation, an organization founded by the state’s former governor and his wife, more than 600 college students like Emma Crownover tutored younger students from a masked social distance at Boys & Girls Clubs across the state. “It just felt like the best thing for me to do with my summer that was a little bit derailed because of COVID,” Crownover said. The 20-year-old aspiring teacher wasn’t sure of her plans for this summer before the pandemic hit, but she “wasn’t exactly planning to be in Nashville,” her hometown. “That all changed when college got cut off in the middle,” she said. For six weeks, the Scripps College student worked from 10 a.m. to noon, Monday through Friday with the same group of rising first graders for the first hour and sixth graders for the second hour. They worked through a binder of materials provided by the program, and Crownover could set the pace — if students had progressed beyond that week’s lesson, they could move ahead. Still, she could see the impact of the time away from school, particularly with some of the sixth graders who, during the first few weeks, struggled with reading comprehension. “When you’re that age, it’s a muscle,” she said. “Reading is something that you have to practice every single day.” Leslie Yossarian, the membership coordinator at the branch of the Boys & Girls Club in Sevierville, Tenn., enrolled her 7- and 8-year-old daughters in the program to help ease concerns she had about them being prepared to resume school in the fall, when they’re planning to attend in person. When her children were sent home in the spring, Yossarian worked with them on the learning packets provided by the school. But, as she puts it, “I’m not a teacher; I’m not a homeschooler. I did the best I could to try to do their assignments and turn them in and keep them on track.” The tutoring program, which wraps up this week, is designed only as a summer initiative — so at least for now, it won’t be available to families this fall. Organizers will assess how it worked and determine what the program might look like in the future. But the program filled in some of the gaps from what Yossarian described as an extended summer as a result of the pandemic, and “helped push them that little extra mile to make sure they were ready for the next school year,” she said. As for her 8-year-old’s review of the program: “It was fun,” she said in an interview."}]}