{"article": [{"url": "https://www.marketwatch.com/story/when-does-the-electric-ford-f-150-pickup-go-on-sale-and-how-much-will-it-cost-2020-10-09", "published": 1602220280.0, "headline": "When does the electric Ford F-150 pickup go on sale, and how much will it cost?", "body": "Anticipated best horsepower, torque, and acceleration of any F-150 Electric F-150 will be able to tow heavy trailers Production starts in mid-2022 Maintenance costs expected to be 40% lower, thanks to its electric powertrain A lot of companies are entering the all-electric truck market, but the most important one to mainstream truck buyers is Ford F, -1.36% . The Blue Oval’s F-series line of trucks has been at the top of the sales charts for decades. Ford confirmed that the all-electric Ford F-150 is coming, and it is designed to offer the capability that truck buyers expect from a full-size pickup. Ford has done considerable hard-core testing on the F-150 EV, some of which was with the prototype you see above, but the production version will look more like the all-new 2021 F-150 that goes on sale later this year. How much will the electric Ford F-150 cost? We expect the all-electric Ford F-150 to cost about $55,000, but Ford hasn’t released pricing. Ford is known for offering a range of body styles and cab lengths, which could make the electric F-150’s price range appealing to fleet buyers and luxury truck shoppers alike. Related: Automakers are gambling on electric pickup trucks—will consumers buy them? And: Ford is recalling over 700,000 vehicles with faulty backup camerasWhen does the Ford F-150 EV go on sale? Ford announced that production of the fully electric F-150 will start in mid-2022 at Ford’s Rouge plant in Dearborn, Michigan. It should go on sale soon after.What are the advantages of an electric Ford F-150? Aside from the tremendous savings on fuel, the electric F-150 is expected to have the most torque and horsepower of any F-150, as well as the quickest acceleration. It will also be capable of towing heavy trailers, and this F-150 will be set up for use as a mobile power generator. It should be fascinating to learn what the full-charge range of this new electric truck turns out to be. Read: Check out the Mustang Mach-E, Ford’s electric SUV Also unique to the electric F-150 is that there’s a storage area — a front trunk — where the engine would have been. Because of the lack of an internal combustion engine, maintenance should cost significantly less and take less time, meaning more time you can be on the job. This story originally ran on KBB.com."}]}