{"article": [{"url": "https://www.marketwatch.com/story/trump-must-turn-over-eight-years-worth-of-tax-records-to-manhattan-prosecutor-says-appeals-court-01602081929", "published": 1602068000.0, "headline": "Trump tax records sought by Manhattan prosecutor must be turned over, appeals court rules", "body": "Manhattan District Attorney Cy Vance speaks at a February press conference. Scott Heins/Getty Images NEW YORK (AP) — President Donald Trump’s accountant must turn over his tax records to a New York state prosecutor, an appeals court ruled Wednesday in a decision that likely sets up a second trip to the U.S. Supreme Court over the issue. The 2nd U.S. Circuit Court of Appeals in Manhattan said in a written decision that a stay of a lower-court decision will remain in effect so Trump’s lawyers can appeal the ruling to the high court. Don’t miss: Trump reportedly paid just $750 in federal taxes in 2016 and 2017 — and nothing in 10 of past 15 years A district court judge had rejected their renewed efforts to invalidate a subpoena that the office of Manhattan District Attorney Cyrus Vance Jr. issued to Trump’s accounting firm. Part of Vance’s probe pertains to an investigation related to payoffs to two women — porn actress Stormy Daniels and model Karen McDougal — to keep them quiet during the 2016 presidential campaign about alleged extramarital affairs with Trump. Trump has denied the affairs. See: Audit likely gave congressional staff glimpse of Trump taxes Vance is seeking eight years of the Republican president’s personal and corporate tax records, but has disclosed little about what prompted him to request the records. In one recent court filing, Vance’s lawyers have said he was justified in demanding them because of public reports of “extensive and protracted criminal conduct at the Trump Organization.” A Justice Department spokesperson said the department was reviewing the ruling. The Supreme Court in July ruled 7-2 against the president, rejecting Trump’s argument that he can’t even be investigated, let alone charged with any crime, while he is in office. But the court said Trump can challenge the subpoena on other grounds like anyone else who receives a subpoena. The likelihood that the taxes would be released was unlikely to be resolved before the November election, especially since the high court is down to eight justices after the death of Ruth Bader Ginsburg. Through his lawyers, Trump argued that the subpoena was issued in bad faith, might have been politically motivated and amounted to harassment of him, especially since the wording copied the language in congressional subpoenas. In its decision, the 2nd Circuit rejected all of those arguments. “We hold that none of the President’s allegations, taken together or separately, are sufficient to raise a plausible inference that the subpoena was issued ‘out of malice or an intent to harass,'” the appeals court said. Read on: Judge says Eric Trump must testify in New York probe prior to election"}]}