{"article": [{"url": "https://www.marketwatch.com/story/the-holiday-shopping-season-could-start-on-10-10-2020-with-retailers-hopeful-that-consumers-will-turn-out-early-11600197849", "published": 1600244420.0, "headline": "The holiday shopping season could start on 10/10/2020 with retailers hopeful that consumers will turn out early", "body": "Retailers will try to jump start holiday shopping early this year AFP via Getty Images Forget Thanksgiving Day. The start to the holiday shopping season could be October 10, or 10/10/2020, according to Keith Jelinek, managing director in the retail practice at global consultancy Berkeley Research Group. Jelinek highlights the marketing benefits of the date: like Alibaba Group Holding Ltd.’s BABA, -0.26% blockbuster Singles Day on 11/11, 10/10 has the repeating number and it’s on a Saturday. It could also be a good day for Amazon.com Inc.’s AMZN, +3.01% Prime Day, which has been delayed. “10/10/2020 has a nice ring to it, and we believe that will be a significant date to launch holiday shopping,” Jelinek told MarketWatch. With the calendar in disarray due to the coronavirus pandemic and concern that shoppers will pull back on their holiday shopping this year, retailers are eager to get consumers in the holiday spirit as early as possible. See: Amazon Prime Day delay, back-to-school uncertainty changing the shopping calendar “Halloween typically takes up a lot of space in the store,” Jelinek says. “You sell candy until Halloween, then the next day you close up Halloween and start selling holiday.” This year there are questions about whether families will participate in traditional Halloween celebrations like trick-or-treating or costume parties. And: Halloween sales forecast could be frightful to companies trying to create holiday season momentum Jelinek says retailers won’t wait long to get home décor items like trees and wreaths on the sales floor. And with customers eager to get their minds off stressful world events, from the pandemic to the election to the economy, a little “Christmas creep” could be welcome. Moreover, with so many shoppers using e-commerce to make purchases and shippers like United Parcel Service Inc. UPS, +0.27% forecasting a record holiday season, there are concerns about items getting to their destination on time. “If the consumer does what we think they’re going to do, which is be in the mood to start shopping around 10/10, it’s going to be good news for retailers,” Jelinek said. “The more volume that they can start to see being transacted earlier, the less pressure the closer they get to Christmas.” Read: Amazon hiring 100,000 workers in U.S. and Canada to meet surge in lockdown shopping Deloitte LLP expects a 1% to 1.5% rise in retail sales this holiday season, with e-commerce up as much as 35%. However, experts there say growth could be as much as 3.5% if consumer confidence gets a bump from a pandemic relief bill or other factors. Wells Fargo analysts were upbeat in a Tuesday note, saying retail traffic has improved after a slow summer. “Over the past week, however, we’ve seen improved store traffic trends, while also receiving stable-to-better commentary from retailers as we move out into fall,” analysts led by Ike Boruchow wrote. “Since retailers are highly cautious heading into 2H with the multiple headwinds to discretionary spending right now, this incrementally positive commentary is encouraging as we near the key holiday selling season (though we still have plenty of uncertainty ahead).” Placer.ai retail data suggests Black Friday will be a sales driver, especially since many retailers, including Walmart Inc. WMT, +1.00% and Target Corp. TGT, +1.14%, have announced store closures on Thanksgiving Day. While Thanksgiving is a big shopping day, there are others that retailers, including those two giants, can rely on for big numbers. “Both brands see more traffic in the three day period pre-Christmas than they do in the three day period on Black Friday weekend,” wrote Ethan Chernofsky, vice president of marketing for Placer.ai, in a blog post. “Additionally, both are already taking active steps to use the closure to drive traffic during other days.” Target gave a sneak peek of its holiday plans in July. Walmart and BJ’s Wholesale Club Holdings Inc. BJ, +1.19% have already released their “hot toys” lists. And Amazon’s Holiday Preview has already been unveiled to the media. While retailers are eager to ring up as many sales as possible, Jonathan Treiber, chief executive of offer-management platform RevTrax warns against massive discounts right away. Instead, retailers should focus on addressing the customer service issues that will arise this holiday season, particularly with the spike in online shopping. Improvements to e-commerce or mobile capabilities, curbside pickup and returns could do as much to attract shoppers as promotions. “For many customers, these things have a higher perceived value than an extra 20% discount coupon,” Treiber said. “Many customers want to know they’re getting a fair price, not necessarily the best price, and are willing to pay if they get all the other stuff that adds up to convenience and a positive experience… Nobody wins a price war.”"}]}