{"article": [{"url": "https://www.marketwatch.com/story/ant-group-ipo-five-things-to-know-about-the-alibaba-affiliate-aiming-for-the-largest-offering-in-history-11600988986", "published": 1601118200.0, "headline": "Ant Group IPO: Five things to know about the Alibaba affiliate aiming for the largest offering in history", "body": "Jack Ma \"has ultimate control over our Company,\" Ant Group said in a filing as it plans to go public. AFP via Getty Images Ant Group could be headed for the largest initial public offering in history, as the Chinese financial-technology juggernaut chases a valuation that would rival the biggest payments companies in the world. The Alibaba Group Holding Ltd.–affiliated company controlled by Jack Ma has filed paperwork to list its shares concurrently on the Hong Kong and Shanghai exchanges. Ant, which runs China’s immensely popular Alipay mobile wallet, is reportedly looking to rake in at least $35 billion through an offering that could value the company at $250 billion, according to Bloomberg. See: These are the Chinese fintech firms you should be aware of That would make Ant’s offering larger than that of Saudi Aramco, which brought in more than $25 billion in the biggest IPO to date. A valuation of $250 billion would mean Ant is worth more than Bank of America Corp. BAC, +0.47% ($207 billion) and PayPal Holdings Inc. PYPL, +2.18% ($213 billion) but less than JPMorgan Chase & Co. JPM, -0.57% ($287 billion), Mastercard Inc. MA, +2.09% ($336 billion) and Visa Inc. V, +1.80% ($427 billion). The company is best known for its mobile-payments offering, but it aims to be a one-stop financial hub that also provides access to wealth management, investing and insurance services. Analysts view the payments portion of the business as a gateway that brings users in to Ant’s more complex offerings. The Ratings Game: Square stock gets an upgrade as Cash App enthusiasm keeps growing Here are five things to know about Ant as it prepares for a public debut.A sprawling financial empire Unlike Western mobile wallets, Ant’s platform touches on nearly all aspects of one’s financial life. Ant goes beyond what PayPal and Apple Inc.’s AAPL, +1.74% Apple Pay do, offering services for everything from payments to credit to insurance to investments within Alipay, which the company calls a “ubiquitous super app.” Ant counts more than a billion annual active users for the Alipay app and 711 million monthly active users. The Alipay app is “synonymous with digital payments in China,” Ant said in its filing. Bernstein analyst Kevin Kwek sees the payments component as a “hook product” for the company that may have limited profit potential but helps the company bring in new users who can then try out more lucrative services. App-based payments are commonplace in China, even for in-person transactions, and this is perhaps the most well-known aspect of Ant’s business. But other areas of the business are more interesting, Bernstein’s Kwek argued in a note to clients, particularly the company’s credit business, in which Ant originates loans that are almost entirely underwritten by financial partners, giving the company useful loan insights without requiring it to take much balance-sheet risk. The credit business is “maybe the gem” of Ant’s business, Kwek wrote. By his math, with a “conservative” assumption that the company only made one loan to each of its 500 million loan customers over the past 12 months, Ant would have originated 16 loans per second. “Everyone has heard of the ‘fintech model,’ where data insights from online activities will be used for underwriting and everything will happen digitally (and quickly, even instantaneously),” he wrote. “But to witness the growth at this scale was indeed a surprise.” Ant also offers investment services through the distribution of money-market funds, as well as wealth-management and insurance options.Tightly linked Alibaba BABA, -0.26% BABAF, 9988, -1.17% previously had a profit-sharing arrangement with Ant in which Alibaba received 37.5% of the company’s pretax profits, but Alibaba announced in early 2018 that it would be switching to an equity structure. Now, Alibaba has a 33% stake in Ant through its subsidiaries, a move that analysts thought would help the Chinese e-commerce giant benefit from a potential Ant IPO down the line. “Equity ownership allows us to participate in the long-term value creation of Ant Financial as opposed to the quarter-to-quarter fluctuations of a profit share,” Executive Vice Chairman Joseph Tsai said on the company’s earnings call at the time. Beyond the equity interest, Ant and Alibaba collaborate on business-related issues. “We, together with Alibaba, are building the infrastructure for commerce and services,” Ant said in its filing. The companies work together by “sharing insights” derived from their platforms, expanding cross-border efforts, and “jointly serving” both consumers and merchants. Ant lists synergies with Alibaba among its business strengths in its filing. Money machine Ant generated RMB 120.6 billion ($17.7 billion) in revenue over the course of 2019, up from RMB 85.7 billion a year earlier. The company’s latest annual total consisted of RMB 51.9 billion in digital-payments revenue and RMB 41.9 billion in credit-technology revenue. Ant added RMB 8.9 billion in revenue from insurance technology and RMB 17 billion from investment technology. The company posted a non-IFRS profit of RMB 24.2 billion for 2019, after recording a loss of RMB 18.3 billion in the prior year. The non-IFRS profit represents profit before accounting for equity-based compensation, royalty and service payments, gains on the disposal of subsidiaries, and some other items. Competition Ant’s main competitive pressures come from Tencent Holdings Ltd. 700, +0.84% TCEHY, +1.98%, which operates the WePay platform, but, while the companies are close in terms of the amount of consumption spending they help facilitate, Ant, Bernstein’s Kwek said, is “well ahead” in the other areas of its business. “Ant is [about five times] bigger on loans under management, [about four times] bigger on assets under management on the wealth-management side, and [about three times] more on insurance partners,” he wrote in a note to clients. “The Tencent competitive threat exists, but isn’t that large today.” The real question for Kwek is what Alibaba will need to do to maintain its edge. This could mean “limited increase in take rates,” or the amount of money that Ant retains for helping to facilitate various financial interactions, as the company fends off competition. The biggest pain point for Alibaba might come from the Chinese government, which has put up roadblocks to Ant’s growth in the past. Ant mentions in its filing that China’s “laws, rules and regulations are highly complex, and continuously evolving” as it relates to obtaining and maintaining the proper approvals for doing business. “They could change or be reinterpreted to be burdensome or difficult for us, businesses on our platform or our partners to comply with,” the company cautioned. How to invest While Alibaba shares are listed in the U.S. and Hong Kong, Ant is aiming for a dual listing of its shares in Hong Kong and Shanghai amid tensions between the U.S. and China. The U.S. government is looking to impose stricter restrictions on Chinese companies listed on U.S. exchanges. Because Ant’s shares are expected to list in Hong Kong and Shanghai, the process of buying these stocks isn’t as straightforward for U.S. investors as it would be for stocks listed on U.S. exchanges. Investors should check with their brokerages for specific rules. A spokeswoman for Interactive Brokers Group Inc. IBKR, -1.49%, for example, told MarketWatch that its international investors could access stocks on both exchanges. A spokeswoman for Charles Schwab Corp. SCHW, +1.29% said that clients could access stocks listed in Hong Kong but not those listed in Shanghai. A spokesman for Robinhood said the company doesn’t currently support stocks trading on foreign exchanges."}]}