{"article": [{"url": "https://www.marketwatch.com/story/read-the-complete-text-of-obamas-speech-at-the-democratic-national-convention-2020-08-19", "published": 1597879640.0, "headline": "Read the complete text of Obamaâ\u0080\u0099s speech at the Democratic National Convention", "body": "Former President Barack Obama called President Donald Trump unfit for office Wednesday night, urging Americans to vote for Joe Biden in order to save democracy. Speaking at the virtual Democratic National Convention, Obama called out Trump by name. â\u0080\u009cI did hope, for the sake of our country, that Donald Trump might show some interest in taking the job seriously,â\u0080\u009d Obama said. â\u0080\u009cBut he never did.â\u0080\u009d Obama said Trump â\u0080\u009chas shown no interest in putting in the work,â\u0080\u009d and presented a stark choice between letting democracy wither away or voting for change with Biden and running mate Kamala Harris. Obama urged young people, especially, to vote. â\u0080\u009cYou can take it to a better place,â\u0080\u009d he said. â\u0080\u009cYouâ\u0080\u0099re the missing ingredient â\u0080\u0094 the ones who will decide whether or not America becomes the country that fully lives up to its creed.â\u0080\u009d Hereâ\u0080\u0099s a full text of Obamaâ\u0080\u0099s speech: â\u0080¢ â\u0080¢ â\u0080¢ Good evening, everybody. As youâ\u0080\u0099ve seen by now, this isnâ\u0080\u0099t a normal convention. Itâ\u0080\u0099s not a normal time. So tonight, I want to talk as plainly as I can about the stakes in this election. Because what we do these next 76 days will echo through generations to come. Iâ\u0080\u0099m in Philadelphia, where our Constitution was drafted and signed. It wasnâ\u0080\u0099t a perfect document. It allowed for the inhumanity of slavery and failed to guarantee women â\u0080\u0094 and even men who didnâ\u0080\u0099t own property â\u0080\u0094 the right to participate in the political process. But embedded in this document was a North Star that would guide future generations; a system of representative government â\u0080\u0094 a democracy â\u0080\u0094 through which we could better realize our highest ideals. Through civil war and bitter struggles, we improved this Constitution to include the voices of those whoâ\u0080\u0099d once been left out. And gradually, we made this country more just, more equal, and more free. The one Constitutional office elected by all of the people is the presidency. So at minimum, we should expect a president to feel a sense of responsibility for the safety and welfare of all 330 million of us â\u0080\u0094 regardless of what we look like, how we worship, who we love, how much money we have â\u0080\u0094 or who we voted for. But we should also expect a president to be the custodian of this democracy. We should expect that regardless of ego, ambition, or political beliefs, the president will preserve, protect, and defend the freedoms and ideals that so many Americans marched for and went to jail for; fought for and died for. I have sat in the Oval Office with both of the men who are running for president. I never expected that my successor would embrace my vision or continue my policies. I did hope, for the sake of our country, that Donald Trump might show some interest in taking the job seriously; that he might come to feel the weight of the office and discover some reverence for the democracy that had been placed in his care. But he never did. For close to four years now, heâ\u0080\u0099s shown no interest in putting in the work; no interest in finding common ground; no interest in using the awesome power of his office to help anyone but himself and his friends; no interest in treating the presidency as anything but one more reality show that he can use to get the attention he craves. Donald Trump hasnâ\u0080\u0099t grown into the job because he canâ\u0080\u0099t. And the consequences of that failure are severe. 170,000 Americans dead. Millions of jobs gone while those at the top take in more than ever. Our worst impulses unleashed, our proud reputation around the world badly diminished, and our democratic institutions threatened like never before. Now, I know that in times as polarized as these, most of you have already made up your mind. But maybe youâ\u0080\u0099re still not sure which candidate youâ\u0080\u0099ll vote for â\u0080\u0094 or whether youâ\u0080\u0099ll vote at all. Maybe youâ\u0080\u0099re tired of the direction weâ\u0080\u0099re headed, but you canâ\u0080\u0099t see a better path yet, or you just donâ\u0080\u0099t know enough about the person who wants to lead us there. So let me tell you about my friend Joe Biden. Twelve years ago, when I began my search for a vice president, I didnâ\u0080\u0099t know Iâ\u0080\u0099d end up finding a brother. Joe and I came from different places and different generations. But what I quickly came to admire about him is his resilience, born of too much struggle; his empathy, born of too much grief. Joeâ\u0080\u0099s a man who learned â\u0080\u0094 early on â\u0080\u0094 to treat every person he meets with respect and dignity, living by the words his parents taught him: â\u0080\u009cNo oneâ\u0080\u0099s better than you, Joe, but youâ\u0080\u0099re better than nobody.â\u0080\u009d That empathy, that decency, the belief that everybody counts â\u0080\u0094 thatâ\u0080\u0099s who Joe is. When he talks with someone whoâ\u0080\u0099s lost her job, Joe remembers the night his father sat him down to say that heâ\u0080\u0099d lost his. When Joe listens to a parent whoâ\u0080\u0099s trying to hold it all together right now, he does it as the single dad who took the train back to Wilmington each and every night so he could tuck his kids into bed. When he meets with military families whoâ\u0080\u0099ve lost their hero, he does it as a kindred spirit; the parent of an American soldier; somebody whose faith has endured the hardest loss there is. For eight years, Joe was the last one in the room whenever I faced a big decision. He made me a better president â\u0080\u0094 and heâ\u0080\u0099s got the character and the experience to make us a better country. And in my friend Kamala Harris, heâ\u0080\u0099s chosen an ideal partner whoâ\u0080\u0099s more than prepared for the job; someone who knows what itâ\u0080\u0099s like to overcome barriers and whoâ\u0080\u0099s made a career fighting to help others live out their own American dream. Along with the experience needed to get things done, Joe and Kamala have concrete policies that will turn their vision of a better, fairer, stronger country into reality. Theyâ\u0080\u0099ll get this pandemic under control, like Joe did when he helped me manage H1N1 and prevent an Ebola outbreak from reaching our shores. Theyâ\u0080\u0099ll expand health care to more Americans, like Joe and I did ten years ago when he helped craft the Affordable Care Act and nail down the votes to make it the law. Theyâ\u0080\u0099ll rescue the economy, like Joe helped me do after the Great Recession. I asked him to manage the Recovery Act, which jump-started the longest stretch of job growth in history. And he sees this moment now not as a chance to get back to where we were, but to make long-overdue changes so that our economy actually makes life a little easier for everybody â\u0080\u0094 whether itâ\u0080\u0099s the waitress trying to raise a kid on her own, or the shift worker always on the edge of getting laid off, or the student figuring out how to pay for next semesterâ\u0080\u0099s classes. Joe and Kamala will restore our standing in the world â\u0080\u0094 and as weâ\u0080\u0099ve learned from this pandemic, that matters. Joe knows the world, and the world knows him. He knows that our true strength comes from setting an example the world wants to follow. A nation that stands with democracy, not dictators. A nation that can inspire and mobilize others to overcome threats like climate change, terrorism, poverty, and disease. But more than anything, what I know about Joe and Kamala is that they actually care about every American. And they care deeply about this democracy. They believe that in a democracy, the right to vote is sacred, and we should be making it easier for people to cast their ballot, not harder. They believe that no one â\u0080\u0094 including the president â\u0080\u0094 is above the law, and that no public official â\u0080\u0094 including the president â\u0080\u0094 should use their office to enrich themselves or their supporters. They understand that in this democracy, the Commander-in-Chief doesnâ\u0080\u0099t use the men and women of our military, who are willing to risk everything to protect our nation, as political props to deploy against peaceful protesters on our own soil. They understand that political opponents arenâ\u0080\u0099t â\u0080\u009cun-Americanâ\u0080\u009d just because they disagree with you; that a free press isnâ\u0080\u0099t the â\u0080\u009cenemyâ\u0080\u009d but the way we hold officials accountable; that our ability to work together to solve big problems like a pandemic depends on a fidelity to facts and science and logic and not just making stuff up. None of this should be controversial. These shouldnâ\u0080\u0099t be Republican principles or Democratic principles. Theyâ\u0080\u0099re American principles. But at this moment, this president and those who enable him, have shown they donâ\u0080\u0099t believe in these things. Tonight, I am asking you to believe in Joe and Kamalaâ\u0080\u0099s ability to lead this country out of these dark times and build it back better. But hereâ\u0080\u0099s the thing: no single American can fix this country alone. Not even a president. Democracy was never meant to be transactional â\u0080\u0094 you give me your vote; I make everything better. It requires an active and informed citizenry. So I am also asking you to believe in your own ability â\u0080\u0094 to embrace your own responsibility as citizens â\u0080\u0094 to make sure that the basic tenets of our democracy endure. Because thatâ\u0080\u0099s what at stake right now. Our democracy. Look, I understand why many Americans are down on government. The way the rules have been set up and abused in Congress make it easy for special interests to stop progress. Believe me, I know. I understand why a white factory worker whoâ\u0080\u0099s seen his wages cut or his job shipped overseas might feel like the government no longer looks out for him, and why a Black mother might feel like it never looked out for her at all. I understand why a new immigrant might look around this country and wonder whether thereâ\u0080\u0099s still a place for him here; why a young person might look at politics right now, the circus of it all, the meanness and the lies and crazy conspiracy theories and think, whatâ\u0080\u0099s the point? Well, hereâ\u0080\u0099s the point: this president and those in power â\u0080\u0094 those who benefit from keeping things the way they are â\u0080\u0094 they are counting on your cynicism. They know they canâ\u0080\u0099t win you over with their policies. So theyâ\u0080\u0099re hoping to make it as hard as possible for you to vote, and to convince you that your vote doesnâ\u0080\u0099t matter. Thatâ\u0080\u0099s how they win. Thatâ\u0080\u0099s how they get to keep making decisions that affect your life, and the lives of the people you love. Thatâ\u0080\u0099s how the economy will keep getting skewed to the wealthy and well-connected, how our health systems will let more people fall through the cracks. Thatâ\u0080\u0099s how a democracy withers, until itâ\u0080\u0099s no democracy at all. We canâ\u0080\u0099t let that happen. Do not let them take away your power. Donâ\u0080\u0099t let them take away your democracy. Make a plan right now for how youâ\u0080\u0099re going to get involved and vote. Do it as early as you can and tell your family and friends how they can vote too. Do what Americans have done for over two centuries when faced with even tougher times than this â\u0080\u0094 all those quiet heroes who found the courage to keep marching, keep pushing in the face of hardship and injustice. Last month, we lost a giant of American democracy in John Lewis. Some years ago, I sat down with John and the few remaining leaders of the early Civil Rights Movement. One of them told me he never imagined heâ\u0080\u0099d walk into the White House and see a president who looked like his grandson. Then he told me that heâ\u0080\u0099d looked it up, and it turned out that on the very day that I was born, he was marching into a jail cell, trying to end Jim Crow segregation in the South. What we do echoes through the generations. Whatever our backgrounds, weâ\u0080\u0099re all the children of Americans who fought the good fight. Great grandparents working in firetraps and sweatshops without rights or representation. Farmers losing their dreams to dust. Irish and Italians and Asians and Latinos told to go back where they came from. Jews and Catholics, Muslims and Sikhs, made to feel suspect for the way they worshipped. Black Americans chained and whipped and hanged. Spit on for trying to sit at lunch counters. Beaten for trying to vote. If anyone had a right to believe that this democracy did not work, and could not work, it was those Americans. Our ancestors. They were on the receiving end of a democracy that had fallen short all their lives. They knew how far the daily reality of America strayed from the myth. And yet, instead of giving up, they joined together and said somehow, some way, we are going to make this work. We are going to bring those words, in our founding documents, to life. Iâ\u0080\u0099ve seen that same spirit rising these past few years. Folks of every age and background who packed city centers and airports and rural roads so that families wouldnâ\u0080\u0099t be separated. So that another classroom wouldnâ\u0080\u0099t get shot up. So that our kids wonâ\u0080\u0099t grow up on an uninhabitable planet. Americans of all races joining together to declare, in the face of injustice and brutality at the hands of the state, that Black Lives Matter, no more, but no less, so that no child in this country feels the continuing sting of racism. To the young people who led us this summer, telling us we need to be better â\u0080\u0094 in so many ways, you are this countryâ\u0080\u0099s dreams fulfilled. Earlier generations had to be persuaded that everyone has equal worth. For you, itâ\u0080\u0099s a given â\u0080\u0094 a conviction. And what I want you to know is that for all its messiness and frustrations, your system of self-government can be harnessed to help you realize those convictions. You can give our democracy new meaning. You can take it to a better place. Youâ\u0080\u0099re the missing ingredient â\u0080\u0094 the ones who will decide whether or not America becomes the country that fully lives up to its creed. That work will continue long after this election. But any chance of success depends entirely on the outcome of this election. This administration has shown it will tear our democracy down if thatâ\u0080\u0099s what it takes to win. So we have to get busy building it up â\u0080\u0094 by pouring all our effort into these 76 days, and by voting like never before â\u0080\u0094 for Joe and Kamala, and candidates up and down the ticket, so that we leave no doubt about what this country we love stands for â\u0080\u0094 today and for all our days to come. Stay safe. God bless."}]}