{"article": [{"url": "https://www.marketwatch.com/story/covid-19-has-commercial-real-estate-tied-in-knots-as-lockdowns-ease-in-new-york-city-and-other-major-cities-2020-06-22", "published": 1592911820.0, "headline": "Lockdowns ease in New York City and other major cities, but commercial real estate still tied in knots", "body": "The coronavirus pandemic’s toll on the estimated $16 trillion U.S. commercial real-estate market has only begun to show as buildings start reopening in major cities and properties emerge from months of mass shutdowns. New York City on Monday embarked on Phase 2 of its reopening, meaning restaurants and bars can begin offering outdoor seating only, some in-store retail can resume, as well as visits to salons, barber shops, car dealers and more. But underneath the semblance of the new normal are tenants battling landlords for rent relief, a deluge of property owners falling behind on their mortgages and property prices that are tumbling. Where it all ends up is anyone’s guess. Much will hinge on which parties get relief and if property prices keep tumbling. The trajectory of new infections and the reaction from consumers as more U.S. real estate reopens will be major factors too. Coronavirus update: U.S. death toll nears 120,000, with 24 states showing a rise in case tally trends “I think it’s going to be a hail storm out there,” said Jeffrey Citron, co-managing partner at law firm Davidoff Hutcher & Citron LLP. “And I think, in most instances, it’s probably in the best interest of landlords to sit down and work with their tenants.” Citron’s law firm is representing Victoria’s Secret Stores, a part of L Brands LB, -0.98% , that earlier this month filed a nearly $1 million monthly claim for rent relief against landlord SL Green on its Herald Square store in Manhattan. The tenant, arguing in a court filing, thinks its lease at the property should be rescinded, partly due to the unprecedented “pause” that descended over New York City as officials battled the global health crisis, but also because the “experience of shopping for consumer products in a retail store has been altered forever.” SL Green’s legal counsel Stephen Meister said in a statement that the landlord made several approaches to the tenant with “offers to defer a portion of its rent at 2 Herald Square,” but that the “large national, publicly traded conglomerate is exploiting the current health and economic crisis for its own financial gain rather than honor its contractual rent obligations.” SL Green is one of New York City’s largest office landlords. In June it reported an improvement in its April rent collections at 95.1% for office and 63.3% for retail, versus an initial tally for the month at 91.8%, 60.0%, respectively. The high-profile dispute is one example of the tumult in U.S. commercial real estate, specifically over who pays which bills, how much and when, on properties often designed to withstand earthquakes and other natural disasters, but not necessarily deadly viral outbreaks. “A lot of corporate tenants are parsing their leases and trying to renegotiate, either for less rent or less space, or even to terminate their lease,” said William O’Connor, a partner at Thompson & Knight LLC, who focuses on real estate workouts. “Some tenants are willing to make a lump-sum payment and move on,” O’Connor told MarketWatch, adding that several landlords have been offering free-rent to firms willing to sign up for 10-year leases. “That matches the type of debt they’d be taking out,” he said, pointing to the 10-year term of many U.S. commercial real-estate loans. The Dow Jones U.S. Real Estate Index DJUSRE, -0.42%, which tracks U.S. Real Estate Investment Trusts, was down 14.7% on the year to date Monday, while the broader Dow Jones Industrial Average DJIA, +0.56% was down about 9% during the same period. Struggling regional malls have been in a financial downward spiral for years, with J.C.Penney Co. Inc. JCP, -2.53% , Macy’s Inc. M, -0.95% and others retailers shuttering stores left and right to offset slumping sales. COVID-19 only deepened their woes, putting retail and hotel properties on top of the list of U.S. property types seeking debt relief. In June, the delinquency rate on all commercial property loans bundled into commercial mortgage backed securities reached 10%, matching its prior peak during the global financial crisis more than a decade ago, according to analysts at Goldman Sachs, who expect to see CMBS delinquencies hit a record 11.3% in July. Banks, insurance companies, private equity and other lenders finance commercial real estate too, although often without the same level of transparency as in the CMBS market, where loans are spun into bond deals, and investors see monthly property-level performance reports that flag potential problems. Many of the past decade’s biggest U.S. real estate financing transactions have taken place in the CMBS market, in part because large loans can be sliced and diced into several different bond deals. But when credit nearly dried up overnight in March, it left lenders and bond investors more cautious, and new CMBS volumes down 25% to $32 billion on the year to date, versus the same period last year, according to Deutsche Bank data. “It’s virtually impossible to underwrite a loan where you have no idea of what the future occupancy rates will be and what net-operating income is going to look like,” said Courtney Statfeld, a principal at McKool Smith, a trial law firm focused on real estate disputes. “We work with a number of distressed debt funds, and they definitely have an appetite, but are holding tight and watching,” she told MarketWatch. Another worry is that many borrowers with commercial properties, whether beachfront luxury hotels or glistening office towers, cashed out equity when they last mortgaged their properties, based on real-estate values going one direction: up. Borrowers are viewed as a higher default risk when they have little to no equity left in a property, particularly when prices fall and leave them underwater on their debts. Green Street’s latest Commercial Property Price Index shows that after hitting an all-time high in January, property prices have since plunged 11% year to date, as of May. “One of the hardest things to do right now is to ascertain value,” O’Connor said, adding that his clients expect there to be more clarity on COVID-19’s damage closer to the fourth quarter. But O’Connor also said his clients are bracing for a minimum 15% fall in property prices. Gina Szymanski, a portfolio manager in AEW Capital Management’s real-estate securities group, thinks the future looks less dire overall for commercial properties, particularly since industrial centers and other properties geared toward e-commerce have seen business boom in the past three months of shutdowns. She also views some tenants as “being opportunistic just because they can” and are withholding rent as a negotiating tool. That said, Szymanski remains cautious on heavily discounted property sectors, particularly where future cash flows look uncertain and buildings likely will be operating “below an ideal level” of capacity. “I think the key is to assess the balance sheet strength of these companies,” she told MarketWatch. “And make sure you’re not catching a falling knife.”"}]}