{"article": [{"url": "https://www.marketwatch.com/story/coronavirus-put-seniors-in-the-crosshairs-how-can-we-help-them-11591977437", "published": 1591963700.0, "headline": "Coronavirus put seniors in the crosshairs â\u0080\u0094 how can we help them?", "body": "Thereâ\u0080\u0099s never been a year quite like 2020. Yes, weâ\u0080\u0099ve had pandemics before. Weâ\u0080\u0099ve had economic crashes and double-digit unemployment before. Weâ\u0080\u0099ve had civil unrest before.Â But all at once? This is what makes 2020 such a horrible year. And just think: Itâ\u0080\u0099s not even halfway over.Â The turbulence and uncertainty of 2020 is affecting all Americans, of course. But the impact on seniorsâ\u0080\u0094at least when it comes to unemployment and the pandemicâ\u0080\u0094has been particularly acute. On the surface the news, in relative terms, isnâ\u0080\u0099t so dire. According to the Labor Department, the unemployment rate for people ages 55 and older fell to 11.8% in May from 13.6% the month before. Both figures are below the jobless rates for the nation at large.Â Read: These are the best new ideas in retirement But some context is needed. If and when the economy recoversâ\u0080\u0094andÂ the Federal Reserve forecast Wednesday that unemployment will remain high well into 2022â\u0080\u0094older workers will probably be the last to get hired and will have to take sizable pay cuts when they do find a job. I say this because this has been the pattern coming out of past downturns and thereâ\u0080\u0099s no reason to think that it will be different now. For some startling data, read the eighth paragraph in this prior column I wrote about this. Â On top of this, Richard Johnson , director of Retirement Policy at the Urban Institute, a Washington D.C. think tank, points out that the coronavirusâ\u0080\u0094which has been far deadlier for older Americansâ\u0080\u0094adds a negative twist to any senior job hunt. â\u0080\u009cNot only have many older workers lost their jobs,â\u0080\u009d he said at a recent webinar, â\u0080\u009cbut many are afraid to go back to work for health reasons.â\u0080\u009dÂ He says until a vaccine, or at a minimum, an effective treatment for COVID-19 is developed, many may be reluctant to take a position that requires working closely with others. He thinks unemployment benefits for seniors should be beefed up.Â You might think that working remotelyâ\u0080\u0094which has obviously boomed for all Americans because of he virusâ\u0080\u0094would be a natural for seniors, but another webinar participant says no.Â â\u0080\u009cOlder workers are less likely to have the kinds of jobs that allow telework in the first place,â\u0080\u009d says Monique Morrisey, an economist with the Economic Policy Institute, another D.C.think tank. â\u0080\u009cAnd theyâ\u0080\u0099re very steady and reliable; they tend to take less leave then younger workers.â\u0080\u009d For these reasons, she thinks employers should focus on bolstering workplace safety. She echoes Johnsonâ\u0080\u0099s call for stronger unemployment benefits for seniors until the virus plays itself out.Â But unemployment benefits, no matter how long they last, are short-term by design, to tide workers over until they can find a job. But the longer job searchers that older workers typically endure means those benefits can run out first, upping the possibility of seniors falling through the cracks and into poverty.Â Teresa Ghilarducci , a labor economist and director of the Schwartz Center for Economic Policy Analysis at the New School in New York, offers three remedies for this. First: increase Social Security benefits immediately, by an extra $200 in benefits per month (the average monthly benefit now is $1,503, according to the Social Security Administration). She says this would reduce stress, particularly for lower-income job seekers.Â â\u0080\u009cThat means that older workers who are afraid to go to work, who canâ\u0080\u0099t go to work, who have been pushed out of the labor force, will have a fallback position,â\u0080\u009d she says.Â Itâ\u0080\u0099s also time to consider a universal pension plan for all workers, Ghilarducci adds. â\u0080\u009cAlmost half of older workers donâ\u0080\u0099t have anything but Social Security, and having this would help them exit the labor force more comfortably if theyâ\u0080\u0099re forced to.â\u0080\u009d She also favors lowering the Medicare age to 50. â\u0080\u009cThis allows older workers who are pushed out or forced to be in unsafe jobs an option. They could go between jobs without losing health insurance,â\u0080\u009d she says.Â Of course none of these ideas come cheap. One way to pay for them, the panelists said, is hardly novel, and thatâ\u0080\u0099s to raise the cap on Social Security taxes. In 2020, earners donâ\u0080\u0099t pay Social Security tax on income beyond $137,700. Medicare taxesâ\u0080\u0094which also come from payroll taxes on employers and workersâ\u0080\u0094could also be hiked.Â Ideas like these would unlock a gusher of revenue, though whether even that would be enough is a matter of debate. Itâ\u0080\u0099s also worth asking what the opportunity cost of taking additional money out of worker pockets would be. It would mean less disposable income for younger workers, for example, thus making it harder to buy a home, start a family, pay for daycare and so forth. Â These are big challenges with solutions that may benefit some but hurt others. Governing is about choosing; our leaders must choose wisely as they navigate the difficult road that lies ahead.Â"}]}