{"article": [{"url": "https://www.marketwatch.com/story/why-dows-shake-up-is-bad-for-stocks-added-to-itand-less-bad-for-those-booted-11598379932", "published": 1598366000.0, "headline": "Why Dow's shake-up is bad for stocks added to it-and less bad for those booted", "body": "The committee that manages the Dow Jones Industrial Average is set to make the most significant changes to the composition of the venerable stock index in seven years: It's going to swap out three of the 30 components of the index for three new entrants, effective Monday August 31. Read: Shake-up of the Dow Jones Industrial Average Inclusion in the 124-year old, blue-chip equity benchmark is usually coveted by major companies but recent history suggests that the near-term performance of shares added to the stock-market gauge actually perform relatively worse, while those booted from the index have outperformed, based on data over the past 20 years, according to Dow Jones Market Data. In the last decade, components of the Dow that have been added have gained 0.3%, while those removed rose 10.37%. Over a longer stretch, since 1999, Dow additions have declined 10.1%, while those booted over that period lost a comparatively less-severe 2%. That may be bad news for software company Salesforce.com Inc. CRM, +2.21%, Amgen Inc AMGN, -1.41%. and Honeywell International Inc. HON, +0.34%, and relatively better news for the companies that are being replaced by that trio: Exxon Mobil Corp. XOM, -1.47%, Pfizer Inc. PFE, -0.27% and Raytheon Technologies Corp. RTX, -1.46%. The last time the Dow executed a similar overhaul was back in 2013, when Goldman Sachs Group Inc. GS, -0.21%, Visa Inc. V, +1.80%, and Nike Inc. NKE, +0.97% were added and Bank of America BAC, +0.47%, Hewlett-Packard HPQ, -0.15% and Alcoa AA, -1.65% were removed. Goldman's shares rose 9.2%, Visa gained 7.6% and Nike jumped 16.35%, in the following 12-months after their inclusion. However, B. of. A's shares soared 18%, HP's shares climbed 72% and Alcoa jumped 91, the year after their removal from the Dow, The changes for the Dow DJIA, +0.56% have been prompted by a planned 4-for-1 stock split by technology behemoth Apple Inc. AAPL, +1.74%, which has been the most influential member of the index by dint of its $500+ share price. The Dow is a price-weighted measure, meaning the higher the stock price, the larger the sway for a particular component, and vice versa. That is different from indexes such as the S&P 500 SPX, +0.87%, which are weighted by components' market capitalization. Therefore, the shrinking influence of Apple after its stock split means that the Dow needed more technology representation in its benchmark. \"The announced changes help offset that reduction,\" S&P Dow Jones Indices, the owners of the Dow said in a statement. \"They also help diversify the index by removing overlap between companies of similar scope and adding new types of businesses that better reflect the American economy.\" Overall, the change for the Dow industrials, represents a limited change to the overall market structure and the limited history of performance for those added and removed to the index isn't something to bank on. However, it is something that bears watching."}]}