{"article": [{"url": "https://www.marketwatch.com/story/a-first-of-its-kind-racial-empowerment-etf-is-flying-under-the-radar-maybe-it-shouldnt-2020-06-05", "published": 1592585000.0, "headline": "A first-of-its-kind racial empowerment ETF is 'flying under the radar.' Maybe it shouldn't.", "body": "Consider an exchange-traded fund that's small, with only $4 million in assets after nearly two years in existence, and charging a high management fee - 76 basis points - that enables investors to access a feel-good strategy that's very of-the-moment. If that sounds iffy, think again. The fund, the Impact Shares NAACP Minority Empowerment ETF NACP, +0.41%  , is the only financial product that explicitly addresses issues of racial inequality, doing so with the backing of one of America's oldest and most prestigious civil rights groups. It's also a blueprint for how mission-driven organizations can engage the corporate sector in making social change, especially around racism, an issue that often seems forgotten in a financial services landscape crowded with other \"socially responsible\" plays. And at a moment when America's attention is squarely on racial justice, it may check investors' boxes. \"As people lose confidence in Wall Street's ability to generate alpha, they're going to look for other ways to derive value from their capital,\" said Ethan Powell, founder of Impact Shares, a first-of-its-kind nonprofit ETF provider. Socially responsible investing, Powell thinks, is \"a natural extension of that, but the financial services industry doesn't have the acumen for it.\" That's where the National Association for the Advancement of Colored People, founded in 1909, comes in. The organization has a long history of corporate engagement, said Marvin Owens, its senior director for economic programs, but saw involvement with the ETF as a way to spin that work forward. The NAACP developed a list of 10 principles, called \"screens\" for the purpose of the ETF, ranging from the familiar, like board and executive team diversity, all the way to lesser-known ideas like how companies address the digital divide and support local community development programs. Index and research provider Morningstar developed an index around those screens, and Sustainalytics, a third-party vendor, does the due diligence on companies inside the index. In theory, the NAACP should share in a cut of the ETF's profits, but that won't be possible until it reaches $20 million in assets. But for Owens, the work put in to create actionable ways of assessing companies has been more than worth it. Corporations often support the NAACP in ways he called \"transactional,\" such as paying for ads or buying tables at events. \"The ETF has allowed us to engage corporations in discussions: what is your commitment to a diverse board, to supplier diversity, and so on,\" Owens told MarketWatch. \"With corporations that have funded us historically, the ETF has allowed us to step back and say, we thank you for your support, but the data shows this or that. It gives us credibility, takes away from the idea that the NAACP can be paid off.\" Read next:Do well by doing good with this fund that supports freedom and human rights The match between ImpactShares and the NAACP came courtesy of the Innovative Finance team at the Rockefeller Foundation, which has funded ImpactShares, as well. Lorenzo Bernasconi, that group's managing director, also applauds the advocacy that the index framework permits, but thinks the ETF can unlock even more opportunity. \"We face a whole set of large environmental and social challenges which government and philanthropy cannot address alone,\" Bernasconi said. \"The ETF builds on two major trends in capital markets: an interest in impact investing and a shift toward passive investments.\" Many smaller fund issuers face a vicious circle: they can't attract assets unless they have enough assets to convince would-be investors the fund is a safe bet. That's a real concern for Ethan Powell, who says that, as the manager of a nonprofit, he works \"pro bono\" and all his vendors offer concessions of some sort. For the deep-pocketed Rockefeller Foundation, however, Impact Shares isn't just a feel-good handout. \"We make bets on ideas we think have a $1 billion-plus opportunity,\" Bernasconi told MarketWatch. \"We take a patient view on these things and understand it's going to take time. If anything, what we see today in the U.S. is that the mission of the NAACP is more critical than ever. This is a volume game: once you get close to critical volume, the floodgates open. We have every confidence that as the market becomes aware of products like this, over time it will reach the scale it needs.\" Related:The eviction crisis is starting to look a lot like the subprime mortgage crisis Perhaps a bigger surprise is that the ETF can be more than a feel-good handout for the investing public, as well. While its index may serve as a document of which companies do the right thing - and which ones don't - it's also a list of some well-known strong performers, from Apple Inc. AAPL, +1.74%  to the Atlantica Sustainable Infrastructure YieldCo AY, -3.96%  , noted Todd Rosenbluth, head of mutual fund and ETF research at CFRA, which has a five-star rating on the fund. In the year to date, the fund is up 4%, while the S&P 500 SPX, +0.87%  is down 1.3%. Over the past 12 months, the fund has gained 19%, beating the 12.8% increase in the broader market. \"This is clearly flying below the radar for investors,\" Rosenbluth said. \"This fund exists for the right reasons and should get more attention.\" For all the tragedy of the past few weeks, as anger in America over the treatment over people of color has boiled over, everyone involved with the fund hopes it's an opportunity. Powell believes critical mass in investment dollars into socially responsible funds is proof of a real desire in America for change. \"On a daily basis people of color face structural obstacles that aren't as overt as putting a knee on someone's neck,\" he said. \"The fund itself represents a structural change in how we do capital allocation and hopefully is a call to action to corporate America. This is a way to create a virtuous circle of capital.\" For his part, the NAACP's Owens says social change, in contrast to environmental advocacy, is also a tool of investing strategy, \"is much more organic. You have to feel it and see it. That's why I think what's happening in the country right now is an inflection point that will cause more attention to come to this.\" Read:Four years, $13 million and dozens of hands: How 'affordable housing' gets made in America"}]}