{"article": [{"url": "https://www.marketwatch.com/story/late-director-joel-schumachers-greenwich-village-condo-just-hit-the-market-for-4-5-million-11602096928", "published": 1602083000.0, "headline": "Late director Joel Schumacherâ\u0080\u0099s Greenwich Village condo just hit the market for $4.5 million", "body": "realtor.com, George Pimentel/WireImage The New York City loft apartment belonging to the late film director Joel Schumacher has come back on the marketâ\u0080\u0094but the price hasnâ\u0080\u0099t changed. Located in the Greenwich Village neighborhood, the three-bedroom abode is again available for $4.5 million. The New York City native purchased the place in 2011 for $4.04 million, property records show. In a prewar condominium with a doorman, across from MacDougal Alley and Washington Square Park, the home first came on the market in July, the New York Post reported. The listing appeared about a month after the filmmakerâ\u0080\u0099s death after a year-long battle with cancer. He was 80. He left behind a beautiful apartment. The 2,266-square-foot space features soaring ceilings, oversized windows, wide-plank flooring, and a gas fireplace. The late director Joel Schumacher's condo in Greenwich Village realtor.com Open kitchen realtor.com Dining area realtor.com Bedroom realtor.com Bathroom realtor.com Enter into a large gallery, which leads into a mudroom with a washer-dryer. The foyer flows into an open-plan living area, with floor-to-ceiling windows that let in gorgeous natural light. Facing the living area is the modern kitchen, which features Sub-Zero, Wolf, and Miele appliances. Adjacent to the kitchen is a large windowed dining space that could also be used as a third bedroom or home office. The bedrooms include the master suite, with a walk-in closet and an oversized marble bath with dual vanity, steam shower, separate soaking tub, and radiant-heat floors. The layout also includes a second en suite bedroom. A powder room completes the floor plan. Built in 1890, the Romanesque Revival building was converted into condominiums in 2008. Itâ\u0080\u0099s in historic Greenwich Village, close to dining, culture, shopping, and public transit. Schumacher, who got his start as a costume designer, tried his hand at screenwriting with â\u0080\u009cThe Wizâ\u0080\u009d and â\u0080\u009cCar Wash.â\u0080\u009d He directed a range of movies, such as â\u0080\u009cThe Lost Boys,â\u0080\u009d â\u0080\u009cFlatliners,â\u0080\u009d and the iconic Brat Pack drama â\u0080\u009cSt. Elmoâ\u0080\u0099s Fire.â\u0080\u009d He was also the director behind the blockbuster â\u0080\u009cBatman Forever,â\u0080\u009d and the widely panned â\u0080\u009cBatman & Robin.â\u0080\u009d Jeremy Stein with Sothebyâ\u0080\u0099s International Realty holds the listing. This story was originally published on Realtor.com"}]}