{"article": [{"url": "https://www.marketwatch.com/story/stock-index-futures-point-higher-after-dow-sp-500-snap-7-day-winning-streak-2020-08-12", "published": 1597251440.0, "headline": "Dow closes up nearly 300 points and S&P 500 ends a stone's throw from record close as tech reaffirms dominance", "body": "Stocks finished higher Wednesday as appetite for technology shares, which had taken a pause from their rally in recent days, resumed amid some signs of a slowdown in the spread of the coronavirus pandemic and stronger-than-expected economic data. How did major indexes fare? The Dow Jones Industrial Average DJIA, +0.56% rose 289.93 points, or 1.1%, to end at 27,976.84. The S&P 500 SPX, +0.87% added 44.66 points, or 1.4%, finishing at 3,380.35, after briefly trading above its all-time closing high of 3,386.15 set Feb, 19. The Nasdaq Composite COMP, +1.39% climbed 229.42 points, or 2.1%, to end at 11,012.24. The Dow on Tuesday finished with a loss of 104.53 points or 0.4%, at 27,686.91. The blue-chip gauge was up more than 300 points at its session high. The S&P 500 ended 26.78 points lower, a loss of 0.8%, at 3,333.69. The tech-heavy Nasdaq Composite dropped 185.53 points, or 1.7%, closing at 10,782.82.What drove the market? Stocks resumed a rally that left the S&P 500 within a whisker of its Feb. 19 all-time closing high, while taking back nearly all the ground lost in late February and March in a pandemic-inspired selloff that saw the benchmark fall around 34%. A slowdown in the number of new COVID-19 cases in the U.S. and optimism over efforts to produce a vaccine have been cited as drivers for recent gains. High-frequency economic indicators also suggest the recent loss of momentum in the U.S. recovery was beginning to reverse. Read:Why the S&P 500 is knocking on the door of its first record close in 6 months \"Now we see those numbers turning over, it seems people are going back out some more. These indicators are worth looking at just to make sure we don't reverse the progress we've made since May,\" said Esty Dwek, head of global market strategy at Natixis Investment Managers, in an interview. House Speaker Nancy Pelosi and Senate Democratic leader Chuck Schumer said that Treasury Secretary Steven Mnuchin proposed a new meeting on coronavirus aid, but that the White House showed no willingness to budge on the \"size and scope\" of a spending package,\" in a statement, underscoring the legislative impasse. Analysts also expressed concerns around legal challenges to and the effectiveness of executive orders signed by President Donald Trump over the weekend aimed at extending some of the elements of spending measures that lapsed at the end of July. \"It is not clear that it is even legal, and it could be challenged in court,\" Brian Rose, senior economist Americas at UBS Financial Services, wrote about the executive actions on Wednesday, while also pointing to delays in further pandemic aid that could result in \"considerable harm to the economy, and employment could start to fall again.\" \"The uncertainty caused by the pandemic is already making it more difficult for business to hire workers. Adding more uncertainty over fiscal policy is particularly unhelpful at this moment,\" Rose said. Markets on Wednesday appeared to have little reaction to presumptive Democratic presidential nominee Joe Biden's pick of California Sen. Kamala Harris as his running mate, the first Black American woman and the first person of Indian decent to appear on the ticket of a major national party. See: Kamala Harris is Biden's running mate-here's what she means (and doesn't mean) for financial markets Investors also watched for signs of a rotation out of highflying tech and growth stocks toward left-behind cyclical and value stocks, as inflation-adjusted yields move off their record lows. \"Technology is really driving the market higher today, those stocks that have been the biggest beneficiaries of a COVID environment and stay-at-home mandates,\" said Michael Reynolds, investment strategy officer at Glenmede, in an interview, adding that while there has been a \"series of head fakes from value stocks,\" they have then gone \"right back down to lagging tech.\" Read: Here's how record negative 'real yields' are driving a crowded rally in stocks, gold and everything else On the economic front, the July consumer-price index came in at an 0.6% increase. Economists surveyed by MarketWatch had expected a 0.4% rise in the index. The core measure, which strips out volatile food and energy costs, also jumped 0.6%.Which companies were in focus? Shares of electric-car maker Tesla Inc. TSLA, +1.89% surged 13.1% after its board approved a five-for-one split of the company's stock. Uber Technologies Inc. UBER, -0.18%  shares fell 1.2% after CEO Dara Khosrowshahi warned Wednesday that the company's ride-hailing service could shut down in California until November if the company loses its appeal of a judge's ruling requiring drivers to be classified as employees instead of contractors. Moderna Inc. MRNA, +0.09%  shares rose 0.8% after analysts weighed in on what a U.S. government supply deal means after the drugmaker's late Tuesday announcement it had reached an agreement to sell 100 million doses of its investigational vaccine for COVID-19 to the U.S. government for more than $1.5 billion. Brinker International Inc. EAT, +1.00%, the parent of Chili's and Maggiano's restaurant chains, rose 14.5% after reporting a narrower-than-expected fiscal fourth-quarter loss and announcing an upbeat outlook for the following quarter. Shares of Royal Caribbean Group RCL, +2.59% fell 2.5% after the cruise operator said it has secured a $700 million term loan facility from Morgan Stanley. Phillips 66 PSX, -1.11% advanced 0.5% Wednesday, after the company said it would stop producing fuels from crude oil at its San Francisco Refinery in Rodeo, Calif., and that it will reconfigure the refinery to produce renewable fuels. It will start making fuels from used cooking oil, fats, greases and soybean oils. Casper Sleep Inc. CSPR, -0.27%  shares closed 1.5% lower after Wedbush analysts said the company is \"leaving sales on the table\" and underperforming competitors like Tempur Sealy International Inc. TPX, +1.16%  and Purple Innovation Inc. PRPL, +5.15% How did other markets trade? In Asia trade, China's CSI 300 index 000300, +2.04%  fell 0.7%, while Hong Kong's Hang Seng Index HSI, -0.30% closed 1.4% higher and Japan's Nikkei 225 Index NIK, -0.11%  edged up 0.4%. In Europe, the pan-European Stoxx 600 Europe Index SXXP, +0.55% rose 1.1% and the FTSE 100 UKX, +0.64%  extended a 1.7% rally from the previous session, ending 2% higher on Wednesday. The yield on the 10-year Treasury note TMUBMUSD10Y, 0.777%  rose 1.2 basis points to 0.669%, after rising 8.4 basis points on Tuesday as investors shunned safe-haven assets. Bond prices move inversely to yields. Gold GC00, +2.17%  prices settled slightly higher on Wednesday, with December futures ending up 0.1% at $1,949 an ounce. Crude-oil prices closed higher, with U.S. benchmark futures CL.1, -1.62%  advancing nearly 2.6% to $42.67 a barrel, the highest close for a front-month contract since March 5, according to FactSet Data. The greenback fell 0.2%, with the ICE U.S. Dollar Index DXY, -0.58%, a gauge of the buck against a half-dozen major rivals, at 93.43. William Watts contributed reporting"}]}