{"article": [{"url": "https://www.marketwatch.com/story/charting-a-bull-trend-whipsaw-sp-500-nails-next-resistance-2020-07-14-12103350", "published": 1594730600.0, "headline": "Charting a bull-trend whipsaw, S&P 500 nails next resistance", "body": "Editor’s Note: This is a free edition of The Technical Indicator, a daily MarketWatch subscriber newsletter. To get this column each market day, click here. Technically speaking, the U.S. benchmarks have registered a mid-July market whipsaw, pressured at least briefly amid the month’s first real selling pressure. Against this backdrop, the S&P 500 has tagged next resistance (3,233) — and pulled in to its range — while the Nasdaq Composite has reversed more aggressively from its latest record high. Before detailing the U.S. markets’ wider view, the S&P 500’s SPX, +0.87% hourly chart highlights the past two weeks. As illustrated, the S&P has tagged next resistance at the June peak (3,233). Monday’s session high (3,235) matched the inflection point, and the index reversed sharply, pulling in to the former range. Recall that the June gap — spanning from 3,123 to 3,182 — effectively defined last week’s range. Similarly, the Dow Jones Industrial Average DJIA, +0.56% has staged a false breakout. More directly, the index briefly cleared resistance, but failed to sustain the gains, pulling back to the former range. Tactically, the early-July peak (26,297) matched the bottom of the June gap (26,294). Separately, the Dow’s 200-day moving average, currently 26,222, has marked an overhead sticking point. An extended test remains underway. Against this backdrop, the Nasdaq Composite COMP, +1.39% remains the strongest benchmark. Still, the index has reversed sharply from the July peak. Consider that Monday’s brief 1.9% intraday gain morphed into a 2.1% single-day loss. The net result is a wide-range bearish reversal — spanning 4.0% across a single session — better illustrated below. Widening the view to six months adds perspective. On this wider view, the Nasdaq has reversed respectably from the July peak, forming a bearish engulfing pattern. As always, the pattern is characterized by a session open and close that encompass (or engulf) those of the prior session, and a close near the session low. The current pattern also marks a key reversal, potentially punctuating a major trend. (Key reversals conclude trends, bearish engulfing patterns do not necessarily terminate trends.) But also remember that the Nasdaq’s prevailing uptrend has been punctuated by bearish single-day reversal patterns that have repeatedly failed to materially follow-through. From current levels, gap support (10,310) is followed by the breakout point (10,131). Delving deeper, the former breakout point (9,838) marks a firmer floor. The Nasdaq’s intermediate-term bias remains bullish barring a violation. Looking elsewhere, the Dow Jones Industrial Average remains the weakest major benchmark. As illustrated, a pulling-teeth test of the 200-day moving average, currently 26,222, remains underway. The Dow has registered just one close nominally atop the 200-day since June 10. Also recall the early-July peak (26,297) matched gap resistance (26,294), an area also detailed on the hourly chart. Tactically, the Dow’s recovery attempt gets the benefit of the doubt baring a violation of the 50-day moving average and the June lows. Sustained follow-through atop the 200-day moving average would strengthen the bull case. Meanwhile, the S&P 500 has balked at next resistance, an area matching the 2019 close (3,230) and June peak (3,233). The index subsequently reversed to its tight range defined by the June gap. Also consider that Monday’s close (3,155) matched the mid-June range top and the November peak (3,154). Technical price action is generally bullish within an uptrend. (Though the single-day price action was admittedly not bullish.)The bigger picture As detailed above, respectable selling pressure surfaced to start this week. On a headline basis, the Nasdaq Composite staged a massive bearish reversal spanning 4.0% across a single session. Though the key reversal signals a potential trend shift, the Nasdaq’s uptrend has weathered several single-day reversals without lasting consequence. Meanwhile, the S&P 500 and Dow industrials concurrently registered false breakouts at key levels — the Dow’s 200-day moving average and S&P gap resistance (3,182). Combined, each benchmark’s intermediate-term bias remains bullish, based on today’s backdrop, though the downturns are worth tracking for potential acceleration. Moving to the small-caps, the iShares Russell 2000 ETF is compressing between two technical levels. Tactically, trendline support closely tracks the 50-day moving average, currently 138.05. Conversely, the July peak (145.70) has registered slightly under the 200-day moving average, currently 146.00. Similarly, the SPDR S&P MidCap 400 ETF has maintained a posture atop the 50-day moving average, currently 317.85. Delving deeper, a firmer floor holds in the 310 area, matching the June low (310.16) and May gap (309.86). Looking elsewhere, the SPDR Trust S&P 500 remains comparably stronger. As illustrated, the SPY has maintained a tight July range, notwithstanding this week’s early whipsaw. Though Monday’s reversal was fueled by a volume uptick, the underlying internals registered as conspicuously tame. For instance, NYSE declining volume surpassed advancing volume by a pedestrian 2-to-1 margin. In a textbook world, a downturn on the order of 7-to-1 negative breadth (or stronger) would raise a question mark. Placing a finer point on the S&P 500, the index has tagged next resistance (3,235), and pulled in to the range. Recall that the prevailing range is effectively defined by the June gap, spanning from 3,123 to 3,182. Conversely, familiar downside inflection points stand out: The S&P’s 50-day moving average, currently 3,045. The 200-day moving average, currently 3,028. The late-June low (2,999.7) matching the 3,000 mark. Delving deeper, likely last-ditch support continues to match the June low (2,965) and the late-2019 breakout point (2,954). As always, it’s not just what the benchmarks do, it’s how they do it. Monday’s false breakout is worth tracking for potential follow-through. But generally speaking, the S&P 500’s intermediate-term bias remains bullish to the extent it maintains a posture atop major support detailed above. Also see: Charting a bullish July start, Nasdaq extends break to record territory.Tuesday’s Watch List The charts below detail names that are technically well positioned. These are radar screen names — sectors or stocks poised to move in the near term. For the original comments on the stocks below, see The Technical Indicator Library. Drilling down further, the VanEck Vectors Gold Miners ETF GDX, +4.64% is acting well technically. As illustrated, the group has recently reached seven-year highs, clearing resistance matching the May peak. The prevailing upturn originates from support matching the May low (31.30) and the April gap (31.50). An intermediate-term target projects to the 43.70 area. Conversely, the breakout point (37.50) pivots to first support and is followed by the ascending 50-day moving average. A sustained posture higher signals a firmly-bullish bias. Air Products & Chemicals, Inc. is a well positioned large-cap name. (Yield = 2.0%.) Earlier this month, the shares knifed to record highs, rising after the company announced an agreement to develop a $5 billion hydrogen-based ammonia plant in Saudi Arabia. The breakout punctuates a bullish cup-and-handle defined by the March and June lows. Though near-term extended, and due to consolidate, the shares are attractive on a pullback. Tactically, the breakout point (257.00) is followed by the ascending 50-day moving average, a level closely tracking trendline support. Initially profiled June 22, First Solar, Inc. FSLR, +2.19% has returned 12.0% and remains well positioned. Technically, the shares have recently knifed to four-month highs, staging a strong-volume break from the 200-day moving average. The ensuing pullback has been comparably flat, fueled by decreased volume, positioning the shares to extend the uptrend. Tactically, trendline support is rising toward the breakout point (54.50). A posture higher signals a firmly-bullish bias. Also notice the pending golden cross — or bullish 50-day/200-day moving average crossover — signaling that the intermediate-term uptrend has overtaken the longer-term trend. MaxLinear, Inc. MXL, +4.02% is a mid-cap semiconductor name positioned to rise. As illustrated, the shares have recently knifed to 52-week highs, rising after the company’s revised second-quarter outlook. The subsequent flag pattern signals muted selling pressure, positioning the shares to build on the strong-volume spike. Tactically, trendline support is rising toward the top of the gap (23.00), and is followed by the deeper breakout point (21.90). Finally, Acadia Pharmaceuticals, Inc. ACAD, -1.04% is a well positioned mid-cap biotech name. The shares started July with a breakout, knifing to all-time highs from a well-defined range. The subsequent pullback places the shares at an attractive entry near the breakout point (52.70) and 12.2% under the July peak. Tactically, trendline support is rising toward the former range top. The prevailing rally attempt is intact barring a violation. More broadly, the shares are well positioned on the 10-year chart, placing distance atop the 2015 peak. Editor’s Note: This is a free edition of The Technical Indicator, a daily MarketWatch subscriber newsletter. To get this column each market day, click here.Still well positioned The table below includes names recently profiled in The Technical Indicator that remain well positioned. For the original comments, see The Technical Indicator Library. Company Symbol* (Click symbol for chart.) Date Profiled Consumer Discretionary Select Sector SPDR XLY July 13 Alphabet, Inc. GOOGL July 13 Sony Corp. SNE July 13 Eldorado Gold Corp. EGO July 13 SunPower Corp. SPWR July 13 Ceridian HCM Holding, Inc. CDAY July 10 Neurocrine Biosciences, Inc. NBIX July 10 Amgen, Inc. AMGN July 9 Zendesk, Inc. ZEN July 9 D.R.Horton, Inc. DHI July 9 Taylor Morrison Home Corp. TMHC July 9 LGI Homes, Inc. LGIH July 8 Walmart, Inc. WMT July 8 J.B. Hunt Transport Services, Inc. JBHT July 8 Analog Devices, Inc. ADI July 7 Akamai Technologies, Inc. AKAM July 6 Verisk Analytics, Inc. VRSK July 6 Big Lots, Inc. BIG July 1 Tandem Diabetes Care, Inc. TNDM July 1 Boeing Co. BA June 30 Dell Technologies, Inc. DELL June 30 Zebra Technologies Corp. ZBRA June 30 Box, Inc. BOX June 29 Yeti Holdings, Inc. YETI June 25 Arrowhead Pharmaceuticals, Inc. ARWR June 25 Danaher Corp. DHR June 24 RH RH June 24 Hologic, Inc. HOLX June 23 First Solar, Inc. FSLR June 22 Momenta Pharmaceuticals, Inc. MNTA June 22 SPDR S&P Biotech ETF XBI June 19 Lowe’s Companies LOW June 19 Fiverr International, Ltd. FVRR June 19 Chegg, Inc. CHGG June 18 Fastly, Inc. FSLY June 18 Arena Pharmaceuticals, Inc. ARNA June 18 Etsy, Inc. ETSY June 17 Skyworks Solutions, Inc. SWKS June 16 Lululemon Athletica, Inc. LULU June 16 Carvana Co. CVNA June 10 Williams-Sonoma, Inc. WSM June 9 HubSpot, Inc. HUBS June 8 Square, Inc. SQ June 8 United Parcel Service, Inc. UPS June 5 Micron Technology, Inc. MU June 5 Xilinx, Inc. XLNX June 4 KLA Corp. KLAC June 4 FedEx Corp. FDX June 3 SPDR S&P Retail ETF XRT June 3 ASML Holding N.V. ASML June 1 Datadog, Inc. DDOG June 1 iShares MSCI Japan ETF EWJ May 29 SolarEdge Technologies, Inc. SEDG May 29 Splunk, Inc. SPLK May 28 Microchip Technology, Inc. MCHP May 27 Synopsis, Inc. SNPS May 27 SSR Mining, Inc. SSRM May 27 Twilio, Inc. TWLO May 26 Take-Two Interactive Software, Inc. TTWO May 26 Lam Research Corp. LRCX May 26 Marvell Technology Group, Ltd. MRVL May 26 Cisco Systems, Inc. CSCO May 21 Agios Pharmaceuticals, Inc. AGIO May 20 Cree, Inc. CREE May 20 Applied Materials, Inc. AMAT May 19 Alteryx, Inc. AYX May 18 iShares Silver Trust SLV May 15 Agnico Eagle Mines, Ltd. AEM May 15 Agilent Technologies, Inc. A May 15 Halozyme Therapeutics, Inc. HALO May 15 Wix.com, Ltd. WIX May 13 Extreme Networks, Inc. EXTR May 13 Qualcomm, Inc. QCOM May 12 Zynga, Inc. ZNGA May 12 Kinross Gold Corp. KGC May 11 Avalara, Inc. AVLR May 8 Salesforce.com, Inc. CRM May 8 Facebook, Inc. FB May 7 Spotify Technology S.A. SPOT May 5 CrowdStrike Holdings, Inc. CRWD May 4 iRobot Corp. IRBT May 4 Inphi Corp. IPHI Apr. 29 Qorvo, Inc. QRVO Apr. 29 Old Dominion Freight Line, Inc. ODFL Apr. 29 Dollar General Corp. DG Apr. 28 AngloGold Ashanti Ltd. AU Apr. 28 Cadence Design Systems, Inc. CDNS Apr. 27 ServiceNow, Inc. NOW Apr. 27 Snap, Inc. SNAP Apr. 27 Five9, Inc. FIVN Apr. 24 Chewy, Inc. CHWY Apr. 24 Tesla, Inc. TSLA Apr. 23 Shopify, Inc. SHOP Apr. 23 iShares Nasdaq Biotechnology ETF IBB Apr. 21 Teradyne, Inc. TER Apr. 20 Electronic Arts, Inc. EA Apr. 20 VanEck Vectors Semiconductor ETF SMH Apr. 17 Coupa Software, Inc. COUP Apr. 17 Veeva Systems, Inc. VEEV Apr. 17 American Tower Corp. AMT Apr. 17 Okta, Inc. OKTA Apr. 16 Target Corp. TGT Apr. 16 Netflix, Inc. NFLX Apr. 14 VanEck Vectors Gold Miners ETF GDX Apr. 14 Invesco QQQ Trust QQQ Apr. 14 Ciena Corp. CIEN Apr. 6 Seattle Genetics, Inc. SGEN Apr. 6 DocuSign, Inc. DOCU Apr. 3 Zscaler, Inc. ZS Apr. 3 RingCentral, Inc. RNG Mar. 30 Activision Blizzard, Inc. ATVI Mar. 30 Regeneron Pharmaceuticals, Inc. REGN Mar. 30 Apple, Inc. AAPL Mar. 27 Nvidia Corp. NVDA Mar. 27 Dexcom, Inc. DXCM Mar. 27 Amazon.com, Inc. AMZN Mar. 26 Stamps.com, Inc. STMP Mar. 26 Quidel Corp. QDEL Mar. 26 Domino’s Pizza, Inc. DPZ Mar. 20 Kroger Co. KR Mar. 19 Zoom Video Communications, Inc. ZM Mar. 19 iShares MSCI Emerging Markets ETF EEM Mar. 19 Newmont Corp. NEM Jan. 13 Atlassian Corp. TEAM Jan. 7 SPDR Gold Shares ETF GLD Jan. 2 Teledoc Health, Inc. TDOC Nov. 1 Microsoft Corp. MSFT Feb. 22 * Click each symbol for current chart."}]}