{"article": [{"url": "https://www.marketwatch.com/story/world-leaders-react-to-president-donald-trump-testing-positive-for-coronavirus-11601632047", "published": 1601631140.0, "headline": "World leaders react to President Donald Trump saying he tested positive for COVID-19", "body": "Vice President Mike Pence has led the messages of support for President Trump. Tasos Katopodis/Getty Images Expressions of concern and good wishes for Donald Trump’s speedy recovery have poured in from leaders across the world, after the U.S. president said he and his wife Melania Trump tested positive for the coronavirus that causes COVID-19 and were entering quarantine. In the early hours of Friday morning, U.S. Vice President Mike Pence, who would be placed in charge if Trump becomes too ill to lead the country, said in a tweet that he and his wife, Karen, send “our love and prayers to our dear friends President Donald Trump and Melania Trump.” iframe.twitter-tweet { width: 100% !important; } U.K. Prime Minister Boris Johnson, who needed hospital treatment in April after he fell ill with the coronavirus, wished the first couple well. He tweeted: “My best wishes to President Trump and the first lady. Hope they both have a speedy recovery from coronavirus.” iframe.twitter-tweet { width: 100% !important; } Johnson, 56, spent three days in intensive care in a London hospital after his coronavirus symptoms “worsened,” according to a Downing Street statement at the time. Later, Johnson said that doctors had faced a “50-50” decision on whether to put him on a ventilator and that plans were drawn up on how to announce his death. Having been admitted to hospital on Apr.5, Johnson returned to work on Apr.27 – exactly a month after his positive test. He has since dismissed claims he will quit in six months due to ‘COVID fatigue’ as “absolute nonsense.” Dr. Tedros Adhanom Ghebreyesus, director-general of the World Health Organization, which Trump has attacked for its handling of the pandemic, sent his best wishes to the president and his wife. U.K. housing secretary Robert Jenrick sent his best wishes to the presidential couple and the Trump family. “We know what it’s like to have, in our case a prime minister who tested positive for COVID, and setting aside politics we all want to see him and his wife get better soon,” he told Sky News. He added: “In the U.S. they’ve got a very clear protocol, haven’t they, with the vice president, should that be necessary.” France’s government spokesman, Gabriel Attal, said: “This demonstrates that the virus spares no one, including those who have shown skepticism. I wish him a swift recovery.” European Council President Charles Michel tweeted: “Wishing @realDonaldTrump and @FLOTUS a speedy recovery.” He added: “COVID-19 is a battle we all continue to fight. Everyday. No matter where we live.” A key European Union summit was postponed on Sept. 22 after Michel went into quarantine when a security officer, with whom he was in close contact in the previous week, tested positive for COVID-19. iframe.twitter-tweet { width: 100% !important; } In a telegram to Trump, Russian leader Vladimir Putin said: “I am certain that your inherent vitality, good spirits and optimism will help you cope with this dangerous virus,” according to the Interfax news agency. India’s Prime Minister Narenda Modi also sent his support to Trump, saying in a tweet: “Wishing my friend @POTUS @realDonaldTrump and @FLOTUS a quick recovery and good health.” iframe.twitter-tweet { width: 100% !important; } In neighboring Pakistan, Prime Minister Imran Khan also posted a message online, wishing President Trump and first lady Melania Trump a “speedy recovery.” Israeli Prime Minister Benjamin Netanyahu, a close ally of Trump, tweeted: “Like millions of Israelis, Sara and I are thinking of President Donald Trump and first lady Melania Trump and wish our friends a full and speedy recovery.” iframe.twitter-tweet { width: 100% !important; } Poland’s President Andrzej Duda said that Poland and the “USA will get through the hardships and succeed in fighting #COVID19.” Meanwhile, the presidential office of self-ruled Taiwan, whose administration Trump has backed amid escalating tensions with mainland China, said in a statement: “President Tsai, upon receiving the news, sent her best wishes to the U.S. government via diplomatic channels, hoping that President Trump and his wife can recover at an early date under the professional care of the medical team.” Read: Coronavirus update: Global case tally above 34 million — with U.S. accounting for a fifth — as Dr. Fauci hits back at Trump’s mask claim Others pointed to the cavalier attitude Trump has had toward the virus, which has included ignoring coronavirus-related restrictions while holding campaign rallies across the country. Hu Xijin, the editor in chief of China’s state-backed Global Times, tweeted that “President Trump and the first lady have paid the price for his gamble to play down the COVID-19.” iframe.twitter-tweet { width: 100% !important; } Other world leaders that have tested positive for coronavirus include Brazilian President Jair Bolsonaro, who in July announced on live television that he had tested positive for coronavirus. Bolsonaro, 65, had repeatedly flouted social distancing, despite the country being second-worst-hit country after the U.S. Read: Brazilian doctors fume as President Bolsonaro hid COVID-19 data and now has tested positive himself The same month, Canadian Prime Minister Justin Trudeau went into isolation after his wife tested positive for the virus."}]}