{"article": [{"url": "https://www.marketwatch.com/story/focus-falls-to-trumps-rally-in-phoenix-tuesday-after-low-tulsa-turnout-2020-06-23", "published": 1592878520.0, "headline": "Focus falls to Trumpâ\u0080\u0099s rally in Phoenix Tuesday, after low Tulsa turnout", "body": "WASHINGTON (AP) â\u0080\u0094 Regrouping after a humbling weekend rally, President Donald Trump faces another test of his ability to draw a crowd during a pandemic Tuesday as he visits Arizona and tries to remind voters of one of his key 2016 campaign promises. Trumpâ\u0080\u0099s weekend rally in Tulsa, Oklahoma, had been meant to be a sign of the nationâ\u0080\u0099s reopening and a show of political force but instead generated thousands of empty seats and swirling questions about the presidentâ\u0080\u0099s campaign leadership and his case for another four years in office. The low turnout has sharpened the focus on Trumpâ\u0080\u0099s visit to Arizona, which doubles as both a 2020 battleground state and a surging coronavirus hotspot. First, the president will travel to Yuma to mark the construction of more than 200 miles of wall along the U.S.-Mexico border, an issue that he built his campaign on four years ago. Later, heâ\u0080\u0099ll address a group of young Republicans at a Phoenix megachurch, where event organizers have pledged thousands will attend. Throughout the trip, the COVID-19 pandemic will shadow Trump. The Democratic mayor of Phoenix made clear that she does not believe the speech can be safely held in her city â\u0080\u0094 and urged the president to wear a face mask. â\u0080\u009cEveryone attending tomorrowâ\u0080\u0099s event, particularly any elected official, should set an example to residents by wearing a mask,â\u0080\u009d said Mayor Kate Gallego. â\u0080\u009cThis includes the President.â\u0080\u009d Trump has refused to wear a mask in public, instead turning it into a red-vs.-blue cultural issue. Polling suggests that Republican are far less likely to wear a face covering than Democrats despite health expertsâ\u0080\u0099 warnings that it dramatically reduces the risk of transmitting the virus. The â\u0080\u009cStudents for Trumpâ\u0080\u009d event will be held at the Dream City Church and broadcast to groups across the nation. It is being hosted by Turning Point USA, a group founded by Trump ally Charlie Kirk. Organizers said health and safety measures still were being finalized and it was not clear if attendees would be asked to wear masks or keep socially distant. Since late May, Arizona has emerged as one of the nationâ\u0080\u0099s most active hotspots for the spread of COVID-19. Use of hospitals, intensive care units and ventilators has set daily records over the past week. Photos of restaurants and bars crowded with unmasked patrons ignited controversy. Republican Gov. Doug Ducey, a Trump supporter, reversed himself last week and allowed cities and counties to require people to wear masks in public places. Most have, including Phoenix and Yuma and the counties that surround them. Arizona is seeing disturbing trends in several benchmarks, including the percentage of tests that prove positive for the virus, which is the highest in the nation. The stateâ\u0080\u0099s positive test rate is at a seven-day average of 20.4%, well above the national average of 8.4% and the 10% level that public health officials say is a problem. Campaign officials are still assessing the fallout from low turnout in Tulsa amid concern about the virus. Campaign officials stressed that rallies would remain a staple of the presidentâ\u0080\u0099s reelection strategy but allowed that they may, in certain states, need to change slightly. Discussions were under way about having them in more modest venues or outdoors, perhaps in airplane hangers and amphitheaters, or in smaller cities away from likely protesters. But officials believe that Trumpâ\u0080\u0099s ability to draw thousands of supporters out during a pandemic sets up a favorable contrasting image with Democratic rival Joe Biden. Still, the campaign has struggled to find effective attack lines on Biden. Biden, like Trump, has had struggles with young voters but the former vice presidentâ\u0080\u0099s campaign has expressed hope that the national protests against racial injustice may change that. Trumpâ\u0080\u0099s visit to the Phoenix megachurch will come on the same day that Pence kicks off a faith-centered tour, highlighting the central position that religious conservatives -â\u0080\u0093 particularly white evangelicals, but also right-leaning Catholics -â\u0080\u0093 continue to occupy in the presidentâ\u0080\u0099s base. Yet even as Trumpâ\u0080\u0099s campaign overtly courts religious voters, there are signs of softening support among voting blocs the president canâ\u0080\u0099t afford to lose. A poll released earlier this month by the nonprofit Public Religion Research Institute found that the share of white Catholics viewing Trump favorably had fallen by double digits since last year, measuring 37% in the last week of May compared with 49% across 2019. The same poll found Trumpâ\u0080\u0099s favorability among white evangelicals at 62% in May, a level comparable to 2019â\u0080\u0099s â\u0080\u0094 but 15% less than it was in March. Trumpâ\u0080\u0099s focus on construction of his long-promised border wall also is meant to shore up support with his most loyal supporters. His administration has promised to build 450 miles by the end of the year, but thatâ\u0080\u0099s not very likely. The government has awarded more than $6.1 billion in construction contracts since April 2019 for various projects along the border. It has also waived procurement rules that critics say make the process of awarding multi-million dollar contracts secretive and opaque. The White House this month floated a theory that travel from Mexico may be contributing to a new wave of coronavirus infections, rather than statesâ\u0080\u0099 efforts to reopen their economies. It was not clear that the evidence supports the theory. Trumpâ\u0080\u0099s first visit to the border in more than a year comes a day after another hardline immigration move. The Trump administration said Monday that it was extending a ban on green cards issued outside the United States until the end of the year and adding many temporary work visas to the freeze, including those used heavily by technology companies and multinational corporations. The administration cast the effort as a way to free up jobs in an economy reeling from the coronavirus."}]}