{"article": [{"url": "https://www.marketwatch.com/story/look-out-below-warren-buffett-just-dropped-to-his-lowest-ranking-ever-on-the-bloomberg-billionaires-index-2020-07-09-121032313", "published": 1594462340.0, "headline": "Look out below! Warren Buffett just dropped to his lowest ranking ever on the Bloomberg Billionaires Index", "body": "Looks like he’ll have to scrape by on a mere $68.6 billion. Warren Buffett, after giving away a $2.9 billion gift, has seen his wealth drop below those of Google’s GOOG, +1.97% GOOGL, +1.82% Larry Page and Sergey Brin as well as former Microsoft MSFT, +2.48% CEO Steve Ballmer, who owns the NBA’s Los Angeles Clippers, according to the Bloomberg Billionaires Index. Read:Almost half of Buffett’s Berkshire Hathaway portfolio is composed of a single stock The Berkshire Hathaway BRK.A, +0.06% BRK.B, +0.24% boss, who was in the top five just last month, is now eighth on the list, his lowest position since the index first came out in 2012. Part of his fall from the top tier is that fact that he’s given away $37 billion to charity since 2006. Berkshire’s less-than-stellar stock performance this year has also weighed on his ranking: As you can see from the chart below, Amazon’s AMZN, +3.01% Jeff Bezos still owns the top spot, with his net worth soaring $68 billion this year alone. Ballmer’s has increased by $18 billion, as technology executives are well represented on the list. Bernard Arnault, the boss of luxury-goods giant LVMH LVMHF, +1.70%, is the only nontech billionaire placing ahead of Buffett. You can’t take it with you, of course, and Buffett has pledged to give away his fortune to charity. He recently told shareholders it will now take 12 to 15 years for his estate to unload all the shares he holds at the time of his death, Bloomberg reported. Berkshire shares were swept lower with the broader market on Thursday, down more than 1%, while the Dow Jones Industrial Average DJIA, +0.56% and S&P 500 SPX, +0.87% also finished lower. The Nasdaq Composite COMP, +1.39% bucked the trend, finishing the day, in fact, at an all-time high."}]}