{"article": [{"url": "https://www.marketwatch.com/story/netflix-launches-100-million-commitment-to-help-close-centuries-long-financial-gap-between-black-and-white-families-2020-06-30", "published": 1593519500.0, "headline": "Netflix launches $100 million commitment to help close â\u0080\u0098centuries-long financial gap between Black and white familiesâ\u0080\u0099", "body": "Netflix Inc. announced Tuesday an effort to grow economic opportunities for Black communities by allocating money to banks and other institutions that help provide financial support. The company plans to put 2 percent of its cash holdings, or up to $100 million initially, toward financial institutions and other groups â\u0080\u009cthat directly support Black communities in the U.S.â\u0080\u009d Netflix NFLX, +1.43% Â argues in a blog post that such efforts can help close the â\u0080\u009ccenturies-long financial gap between Black and white familiesâ\u0080\u009d in the U.S. â\u0080\u009cWe believe bringing more capital to these communities can make a meaningful difference for the people and businesses in them, helping more families buy their first home or save for college, and more small businesses get started or grow,â\u0080\u009d wrote Netflixâ\u0080\u0099s talent acquisition director Aaron Mitchell and treasury director Shannon Alwyn in the post. They cited statistics from the Federal Deposit Insurance Corporation indicating that Black-owned or Black-led banks represent just 1 percent of commercial banking assets in the U.S. Read: After years of talk, tech companies appear to be getting serious about diversity efforts The company is initially allocating $35 million of its $100 million commitment to two vehicles. Netflix will designate $10 million to the Hope Credit Union in an effort to boost economic opportunity in the Deep South. The company will hold $25 million in a newly established fund called the Black Economic Development Initiative that will be managed by the nonprofit Local Initiatives Support Corporation. Netflix joins Apple Inc. AAPL, +1.74%, PayPal Holdings Inc. PYPL, +2.18%, Alphabet Inc.â\u0080\u0099s GOOGL, +1.82% Â GOOG, +1.97% Â YouTube, and other tech stalwarts that have made financial commitments to helping Black and minority communities. Donâ\u0080\u0099t miss: PayPal CEO says corporate activism can help spur the â\u0080\u0098tipping pointâ\u0080\u0099 that brings social change Netflix shares have gained 22% over the past three months as the S&P 500 SPX, +0.87% Â has risen 17%."}]}