{"article": [{"url": "https://www.marketwatch.com/story/i-signed-my-home-over-to-my-daughter-temporarily-to-protect-it-during-my-divorce-now-im-69-and-living-in-an-rv-can-i-file-for-elder-abuse-2020-10-09", "published": 1602245720.0, "headline": "I signed my home over to my daughter temporarily to protect it during my divorce. Now Iâ\u0080\u0099m 69 and living in an RV. Can I file for elder abuse?", "body": "Dear Moneyist, In 2009, when the property market was crashing, I added both my daughters to the deed of my home so I would not lose the home to foreclosure during my divorce and, in case something happened to me, my daughters could keep the home. It was only to be a temporary fix until I could finally sell the home, and both daughters agreed to sign off on the deed. By adding my daughter it allowed me to use her income to qualify for a loan modification. I, not my daughters, made all the payments. Fast forward to 2019. My eldest daughter had received more than $760,000 for the sale of two homes that were given to her by her deceased former mother-in-law. This daughter has always spent her money foolishly and has terrible credit. Even with all this money, no one would rent to her because of her terrible credit. The Moneyist: Weâ\u0080\u0099ve been married 42 years. I cook, clean and take care of our finances. He paid for a trip to Paris, then asked for the money back This daughter talked me into renting my home to her for one year, with an option to buy the home after one year. I was able to purchase an RV to travel for a year, then return to sell my home to her. We agreed that I would repay the money she loaned me for the RV from the sale of my home. When one year had passed, my daughter informed me that she would prefer that I keep renting to her, and asked me to take out another loan so I could purchase a home for myself. But this is my home. I have lived there for years. I was not comfortable with her request, so I said no. My daughter has refused to move out of my home. Her sister quitclaimed her portion of the home back to me as agreed, but my eldest is refusing to do so, and because she is on the deed, I cannot force her out. I am 69 and living in the RV. Can I file a case for elder abuse? Mary Dear Mary, You are opening yourself up to a whole lot of trouble and extra legal costs if you file a case against your daughter for elder abuse. You quitclaimed your home to your daughters before your divorce to shield it from any claims by your then-husband. That would not be looked upon kindly by the court, and your strategy (however flawed) speaks volumes about your cognitive abilities and motivations â\u0080\u0094 if not your judgement â\u0080\u0094 in doing so. But divorce is stressful, and by going through a divorce in 2009, you effectively had two recessions: one economic recession and one romantic recession. Divorce can cut your net worth by half, and leave many couples faced with the prospect of building their wealth again. Unfortunately, you trusted your daughters to do the right thing, while doing something that was at best ethically questionable. Itâ\u0080\u0099s Shakespearean, in a Mrs. Lear kind of way. The Moneyist:â\u0080\u0098Iâ\u0080\u0099m beyond hurtâ\u0080\u0099: I took care of my mom for 12 years. She wants my sister to take over and wonâ\u0080\u0099t leave me her house If you bought your home before you were married, it was already beyond your husbandâ\u0080\u0099s reach. If you did not use marital funds for a renovation or mortgage payments, it would remain separate rather than community property. The rule of thumb, which is sometimes difficult to follow: Never make big financial decisions during a divorce or after a death or any other big life event, and/or always seek (sound) financial advice before doing so. Your daughter now owns half of your home. You could ask your other daughter to intervene and ask your daughter to honor your agreement. Failing that, you could attempt to take a â\u0080\u009cpartition lawsuitâ\u0080\u009d to remove your daughterâ\u0080\u0099s name from the deed, which would be costly, in order to access your half of the equity. Given the circumstances, you would still have to pay your eldest daughter for her share of the house as she is a legal owner. Your only other option: Move in. After all, itâ\u0080\u0099s your home too. You can email The Moneyist with any financial and ethical questions at qfottrell@marketwatch.com. Want to read more?Follow Quentin Fottrell on Twitterand read more of his columns here. Hello there, MarketWatchers. Check out the Moneyist private Facebook FB, +0.26% Â group where we look for answers to lifeâ\u0080\u0099s thorniest money issues. Readers write in to me with all sorts of dilemmas. Post your questions, tell me what you want to know more about, or weigh in on the latest Moneyist columns."}]}