{"article": [{"url": "https://www.marketwatch.com/story/this-long-forgotten-safe-portfolio-just-had-its-best-three-months-ever-2020-07-30", "published": 1596459680.0, "headline": "This long-forgotten â\u0080\u0098safeâ\u0080\u0099 portfolio just had its best three months ever", "body": "When the future is so uncertain, isnâ\u0080\u0099t the smart bet to be prepared for anything? Harry Browne thought so. And his healthy skepticism for the easy nostrums of Wall Street is suddenly having its moment. Browne was the Libertarian candidate for U.S. president in 1996 and 2000. As you may have noticed, he didnâ\u0080\u0099t win. He died in 2006. But his â\u0080\u009cfail safe investingâ\u0080\u009d idea lives on. And his extraordinary investment portfolio just had its best three months maybe ever. So says Bank of America, reporting that the Browne portfolio just shot up a stunning 18% in the last 90 days, or more than twice its annual 7% average. Itâ\u0080\u0099s cherry-picking, data-mining or return-chasing by recommending the portfolio now. But its sudden success tells a tale. Browne argued that when times are booming, stocks do well. In a prolonged slump, long-term Treasury bonds do well. During â\u0080\u009cstagflation,â\u0080\u009d that 1970s mixture of rising prices and low growth, gold does well. And when thereâ\u0080\u0099s a recession and a crisis, cash does well. (Toilet paper too, as we just learned, but thatâ\u0080\u0099s another story.) As you donâ\u0080\u0099t know what the future is going to hold next, he argued, throw one quarter of your money into each of these four assets and then just forget about it. Youâ\u0080\u0099ll underperform a bull market, of course. But youâ\u0080\u0099ll almost certainly avoid disaster if things go awry. Dylan Grice, formerly a strategist at SG Securities, back in 2012 called the same portfolio â\u0080\u009cthe cockroach,â\u0080\u009d and calculated that for long-term investors it had done as well or better since the early 1970s as the traditional stock and bond mixâ\u0080¦but, crucially, without the disasters. In other words, these investors made money during the terrible 70s, when stocks and bonds flopped. Why â\u0080\u009cthe cockroach?â\u0080\u009d Because, wrote Grice, cockroaches are one of planet Earthâ\u0080\u0099s most robust species. They are amazing survivors. Theyâ\u0080\u0099ve been around for 350 million years, or about 7,000 times as long as humans, and survived three of natureâ\u0080\u0099s mass extinctions. â\u0080\u009cBut what I like best about cockroaches,â\u0080\u009d wrote Grice, â\u0080\u009cisnâ\u0080\u0099t just their physical hardiness, itâ\u0080\u0099s the simple algorithm they use to survive. According to Richard Bookstaber, that algorithm is â\u0080\u0098singularly simple and seemingly suboptimal: it moves in the opposite direction of gusts of wind that might signal an approaching predator.â\u0080\u0099 And thatâ\u0080\u0099s it. Simple, suboptimal, but spectacularly robust.â\u0080\u009d And, Grice added, when it comes to long-term investing, your first job is surviving. Prospering is job number two. The idea of fail-safe or â\u0080\u009call weatherâ\u0080\u009d portfolios has plenty of pedigree. (Bridgewater hedge fund tycoon Ray Dalio has been talking about the concept for years.) Thereâ\u0080\u0099s a new version thatâ\u0080\u0099s recently become available in an ETF. The Advanced Research Investment Solutions Risk Parity ETF RPAR, +0.62% was launched last November and managing partner and co-chief investment officer Alex Shahidi says theyâ\u0080\u0099re up to $620 million in assets so far. Returns so far this year: 12%, versus 1% for the S&P 500 SPX, +0.87%. Oh, and by the depths of the crash in March it was down just 15% â\u0080\u0094 half the collapse in the S&P. The fund is 25% stocks, 15% industrial commodities, 17.5% gold GLD, +1.81%, 20% long-dated Treasury inflation-protected securities (such as you can buy on your own through the Pimco 15+ Year U.S. Tips Index ETF LTPZ, +0.04% ) and 42% long-term Treasury bonds (such as is available through the iShares 20+ Year Treasury Bond ETF TLT, -0.01% Â or, even more dramatic, the Pimco 25+ Year Zero Coupon U.S. Treasury Index ETF ZROZ, +0.02%. It adds up to 120%, because the fund is 20% leveraged (and the costs of that borrowing, at current interest rates, is â\u0080\u009cnear zero,â\u0080\u009d he says. Expense ratio is 0.5%.) The stock portfolio, incidentally, is half U.S. and half overseas stocks, with the latter tilted toward high volatility emerging markets. â\u0080\u009cYou want to be diversified to (different) economic environments,â\u0080\u009d as he puts it. He doesnâ\u0080\u0099t know what the future holds. (But he adds, purely as guesswork, â\u0080\u009cIf I had to pick an asset class for the next 10 years, it would be gold.â\u0080\u009d) The real message, though, isnâ\u0080\u0099t about gold or inflation forecasts. Itâ\u0080\u0099s about the arrogance and complacency of Wall Street, a place where â\u0080\u0094 as the great investment writer Fred Schwed once put it â\u0080\u0094 no one is ever wrong in retrospect. Few are still around who remember it, but there have been times, long times, when stocks and bonds both produced terrible returns. Stocks were dismal in the 2000s, while bonds were good. But both lost you money in the 1970s, and in the 1940s. Which is crazier? Going against the conventional â\u0080\u009cwisdomâ\u0080\u009d and gambling some of your retirement savings on alternatives, like goldâ\u0080\u0094or gambling all of them on a single asset class like U.S. stocks?"}]}