{"article": [{"url": "https://www.marketwatch.com/story/easyjet-pleads-for-government-help-as-it-reports-first-loss-in-its-25-year-history-11602149899", "published": 1602162920.0, "headline": "EasyJet pleads for government help as it reports first loss in its 25-year history", "body": "EasyJet warns its first ever annual loss could be as much as £845 million. justin tallis/Agence France-Presse/Getty Images Shares in easyJet fell almost 3% on Thursday morning, after the budget carrier slashed flights to 25% of its normal level and urged the government to help airlines survive the COVID-19 pandemic, which has crippled the industry. In a trading update, easyJet EZJ, -4.22% warned it was likely to make a pretax loss of between £815 million and £845 million for the 12 months to Sept. 30. “This year will be the first time in its history that easyJet has ever made a full year loss,” said Chief Executive Johan Lundgren. “The U.K. government urgently needs to step up with a bespoke package of measures to ensure airlines are able to support economic recovery when it comes,” Lundgren added. Shares in easyJet fell 2.98% in early morning London trading. His plea for help comes after President Donald Trump urged Congress to approve an extension of the Payroll Support Program for major U.S. airlines, which last week furloughed 32,000 employees following the expiration of relief provided by the Coronavirus Aid, Relief, and Economic Security Act. iframe.twitter-tweet { width: 100% !important; } His tweet triggered shares in American Airlines AAL, +0.34% and United Airlines UAL, +0.32% to rise more than 4% in premarket trading Wednesday. Read: Airline stocks surge as President Trump boosts hopes for new stimulus On Thursday, Lundgren said he expected to be operating at 25% of planned capacity during the current quarter, behind rival Irish carrier Ryanair RYAAY, -2.08%, which is aiming for 40% in October. But he said easyJet had retained the flexibility to “ramp up capacity quickly” if demand returns. Passenger numbers plunged 50% to 48 million over the past year, in line with a fall in capacity of 48%, to 55 million seats. Total group revenues in the fourth quarter were about £620 million, while costs were expected to be less than £700 million during the period, compared with the £774 million in the third quarter, thanks to the group’s restructuring and cost-cutting program, which included its reduced flying program and job losses. Read: EasyJet grounds entire fleet of planes as coronavirus pandemic devastates the airline industry Susannah Streeter, senior investment and markets commentator at Hargreaves Lansdown, said easyJet ESYJY, -1.36% has made the descent into its first ever loss, as COVID-19 turbulence has rocked the aviation industry. “Over the last three months, it’s only been able to fly 38% of planned capacity,” Streeter said, adding that the situation is expected to deteriorate over the winter as infections increase, customers remain fearful of flying, and tough quarantine rules are kept in place. “The gravity of the situation, with customer passenger numbers halved to 48 million, has forced it to appeal for urgent government help,” Streeter said. Read: Come back, Americans: Urgent calls for U.S.-U.K. air bridge with airlines hit by fresh lockdown fears Lundgren said that Luton-based EasyJet, which has raised over £2.4 billion in cash since the beginning of the pandemic, is well positioned to weather the continuing challenging environment and capitalize on a recovery, once government travel restrictions are eased. On Wednesday, the U.K. government said it was looking at ways to reduce the quarantine, with a report due in early November. iframe.twitter-tweet { width: 100% !important; } Transport Secretary Grant Shapps said the Global Travel Taskforce will look at how a testing regime for international arrivals could be implemented to boost safe travel to and from the U.K. “Plans for a testing system for arrivals into the U.K. to reduce the quarantine period would be a boost, but there are many factors that will weigh on demand, from unemployment to fears about the virus itself,” said Neil Wilson, chief markets analyst at Markets.com. Easyjet said that early booking levels for summer 2021 are in line with previous years. “At this stage, given the continued level of short-term uncertainty, it would not be appropriate to provide any financial guidance for the 2021 financial year.”"}]}