{"article": [{"url": "https://www.marketwatch.com/story/the-surge-in-coronavirus-cases-in-some-states-isnt-part-of-a-second-wave-2020-06-15", "published": 1592289140.0, "headline": "The surge in coronavirus cases in some states isnâ\u0080\u0099t part of a â\u0080\u0098second waveâ\u0080\u0099", "body": "The recent surge of COVID-19 cases in states like Arizona and Texas are not indicative of a â\u0080\u009csecond waveâ\u0080\u009d of infections; they are part of the initial rolling waves of cases that had previously impacted hard-hit places like Illinois, New Jersey, and New York. As COVID-19 case counts continue to rise in some states that had previously reported few infections, there has been confusion about whether these upticks are part of a predicted second wave of infections. They are not. â\u0080\u009cWhen you think about the wave in the ocean, it comes to shore and it recedes, then another wave comes in,â\u0080\u009d Dr. Leana Wen, an emergency physician and public health professor at George Washington University, said by email. â\u0080\u009cBy that way of thinking, we arenâ\u0080\u0099t in the second wave now because weâ\u0080\u0099re still in the first wave.â\u0080\u009d Read: U.S. death toll tops 115,000 amid growing worry about uptick in cases in Florida, Texas among others Since the earliest days of the COVID-19 pandemic, experts have warned that viruses similar to the coronavirus often return more than once. The Center for Infectious Disease Research and Policy (CIDPAP), a health preparedness organization that is part of the University of Minnesota, in early May predicted three scenarios for COVID-19, all of which would see the return of the virus in 2020 and potentially again in 2021 in communities that had previously reported outbreaks. There is no formal definition for a second wave. Some experts would describe an increase in cases separated by four to eight weeks of low numbers as a second wave; however, â\u0080\u009ccases that occur after a lockdown arenâ\u0080\u0099t typically considered a second wave, theyâ\u0080\u0099d be considered part of the first wave,â\u0080\u009d Michael Osterholm, CIDRAPâ\u0080\u0099s director, said in an email. Many of the predictions for a second wave have anticipated that it would hit in the fall, if it does occur, either due to a change in the season or people spending more time indoors, where the virus is thought to be more easily transmitted. To correctly characterize a second wave in the future, there would need to be a rise in cases, a peak, a plateau, and then a decline now before a resurgence, according to Wen, who previously served as the health commissioner of Baltimore. â\u0080\u009cWe are seeing a notable uptick in identified cases in several states,â\u0080\u009d Raymond James analysts wrote in a June 15 note to investors. â\u0080\u009cWe expected this uptick and anticipate other states will also see upticks as reopenings continue. This isnâ\u0080\u0099t a second wave, this is another swell that is part of the â\u0080\u0098first waveâ\u0080\u0099 of this virus.â\u0080\u009d As states and local governments have eased stay-at-home restrictions over the last month, that may have led to the first significant wave of cases in regions that may not have already experienced large increases in case counts. â\u0080\u009cWeâ\u0080\u0099re now recognizing that weâ\u0080\u0099re not going to see the summer break that we had hoped for,â\u0080\u009d Wen said. See also:The COVID-19 pandemic has three directions, and all point to new cases well into 2021 That may be due to the fact that U.S. states are reopening sooner than other countries that also went into lockdown to contain the virus, and some analysts had anticipated an increase in infections in the U.S. for that reason. In May, when lockdown orders began to be lifted, the national daily infection rate was around 2.5%, J.P. Morgan analysts said. Most countries in Asia and Europe waited until daily infection rates were below 1.0%. Daily infection rates are about 5.0% in Arizona and about 2.3% in Texas, â\u0080\u009cindicating that â\u0080\u009cstate-specific issues may be in play rather than a generalized problem of community spread,â\u0080\u009d according to the analysts. Arizona had 565 newly confirmed cases on May 15, according to the Arizona Department of Health Services. That figure had nearly tripled, to 1,456 new confirmed cases on June 8. Texas has also reported an upward trajectory, with 1,347 newly confirmed cases on May 15 and 1,843 newly confirmed cases on June 14, according to the Texas Department of State Health Services. â\u0080\u009cThe states which are seeing the increase in disease intensity now are still in their first wave,â\u0080\u009d Bernstein analysts told investors on June 12. â\u0080\u009cThey are states where the disease was modest when the country entered lockdown and have never driven their infection down during the closing period â\u0080\u0093 just flattened the curves somewhat and now see higher slope.â\u0080\u009d In comparison, New York state, the epicenter of the pandemic, had 2,419 new cases on May 15, down from a peak of 11,571 new cases on April 14, according to the New York State Department of Health. The number of new cases had dropped even further, to 620 on June 14."}]}