{"article": [{"url": "https://www.marketwatch.com/story/these-green-stocks-would-thrive-under-a-biden-administration-according-to-fund-managers-2020-07-29", "published": 1596038300.0, "headline": "These â\u0080\u0098greenâ\u0080\u0099 stocks would thrive under a Biden administration, according to fund managers", "body": "Itâ\u0080\u0099s increasingly likely that the Democrats will win the White House and the Senate. For investors, that means itâ\u0080\u0099s time to review the environmental, social and governance (ESG) sector, with an emphasis on â\u0080\u009cgreenâ\u0080\u009d stocks that might do well under a Joe Biden presidency. For key insights and stock ideas, I recently spoke with three ESG fund managers with outperforming records, according to Morningstar, and a policy analyst from one of the companies. Beating the market is tough, especially when there are limits on what you can buy â\u0080\u0094 such as an ESG mandate. Itâ\u0080\u0099s encouraging to see that investors can make excess returns while being environmentally aware. Before getting to the stocks, letâ\u0080\u0099s consider what these fund managers think about Bidenâ\u0080\u0099s $2 trillion green plan announced in mid-July.Highlights of the Biden plan First, Bidenâ\u0080\u0099s plan is ambitious. He wants a carbon-neutral power-generation sector by 2035, which is about five years sooner than the typical government deadline, says Chris Dodwell, a policy analyst at Impax Asset Management, which manages the Pax Global ESG fund, below. Who knows if that will actually happen. But as the saying goes, itâ\u0080\u0099s always best to aim high so even if you miss, you may still do well. Next, the plan is comprehensive, which environmental fund managers welcome. â\u0080\u009cEverything he is doing aligns with the strategy that we as ESG investors have been arguing for, for years,â\u0080\u009d says Cheryl Smith, who manages the John Hancock ESG Large Cap Core Fund JHJRX, +0.96%. The fund beats its Morningstar large-cap blend benchmark by three percentage points, annualized, over the past three years. By this, she means that Bidenâ\u0080\u0099s plan focuses on green infrastructure and green cars, carbon-neutral power, energy-efficient buildings, investment in green innovation, clean agriculture and job creation. Of course, we donâ\u0080\u0099t know that Biden will win, or that the Democrats will take the Senate. And even if they do, we donâ\u0080\u0099t know if the Biden plan will pass. â\u0080\u009cI think itâ\u0080\u0099s great to have all these plans. The difficulty is executing them,â\u0080\u009d says Hubert Aarts of the Pax Global Environmental Markets Fund PGINX, +0.62%. â\u0080\u009cThe second thing is, are they going to raise taxes to do this?â\u0080\u009d That might make it a tougher sell. Aarts is worth listening to because his fund outperforms its world large-cap stock category by 6.6 percentage points over the past year, says Morningstar. But in a sense, none of that matters, says Jonathan Waghorn of the Guinness Atkinson Alternative Energy Fund GAAEX, +0.60%. His fund beats its small- and mid-cap value sector benchmark by 34 percentage points over the past year, and 13.6 percentage points annualized over the past three years, according to Morningstar. â\u0080\u009cThe energy transformation is a transition which will happen with or without politicians,â\u0080\u009d he says. Why? â\u0080\u009cThe economics of renewable power and energy efficiency are such that it makes sense to make those changes.â\u0080\u009d Hereâ\u0080\u0099s what he means. There are five forces that make green energy almost inevitable regardless of the politicians. They include: Population growth, which means we need more long-lasting energy sources; climate change, which is forcing us to take steps to protect the planet; and pollution, which is pressuring China and India, among others, to transition to clean energy. The two other key factors pushing the world toward green energy with or without help from politicians are: energy independence, which makes countries want to generate power near where it is consumed, from local wind, solar or geothermal sources; and economics, because renewable energy is getting cheaper than conventional sources. Ultimately, Waghornâ\u0080\u0099s way of thinking about why to invest in green energy makes the most sense, because it takes notoriously unpredictable politicians out of the equation in ESG investing. A basic rule in investing is to avoid having politicians and government as your partner, whenever possible. Stocks It can be tricky to wrangle with investing in environmentally friendly stocks, because thereâ\u0080\u0099s no clear sector labeled â\u0080\u009calternativeâ\u0080\u009d or â\u0080\u009ccleanâ\u0080\u009d energy, says Waghorn. Relevant names can pop up in almost any industry, from utilities and auto companies, to chip makers, battery suppliers and capital-equipment companies. His team follows 230 companies in the space. Smith, at the John Hancock ESG Large Cap Core Fund, includes companies with good internal eco-friendly policies, to broaden the playing field. This extends her reach into even consumer staples like Procter & Gamble PG, +0.89%, which she says is taking significant steps to become carbon neutral and reduce greenhouse gas emissions. Below, I reduce the complexity for you and offer a quick tour of favorite stocks of these outperforming ESG fund managers, by highlighting four ESG subcategories, all of which were cited by Biden as pillars of his green energy plan. Hereâ\u0080\u0099s a look. 1. Green buildings Making buildings more energy efficient is the â\u0080\u009clow-hanging fruitâ\u0080\u009d of green initiatives because there is so much companies can do to reduce energy consumption in their buildings. This explains why energy efficiency is a key part of the Biden proposal. In this space, Smith, at the John Hancock ESG Large Cap Core Fund, likes Trane Technologies TT, -0.52%, which offers energy-efficient climate-control systems, and the real estate investment trust AvalonBay Communities AVB, -1.09%, which specializes in energy-efficient buildings. She cites Rockwell Automation ROK, +1.31%, which has a division that helps companies monitor energy usage and waste. â\u0080\u009cThey are also very focused on their own operational sustainability,â\u0080\u009d she says. Aarts, at the Pax Global Environmental Markets Fund, singles out Acuity Brands AYI, -1.89%, Osram Licht OSAGY, -11.58% and Hubbell HUBB, +0.68% in energy-efficient lighting, and Schneider Electric SBGSY, +1.50%, which sells products that help companies improve energy efficiency. Waghorn, at the Guinness Atkinson Alternative Energy fund, points us to Ameresco AMRC, +2.57%, which helps companies improve energy and lighting efficiency. 2. Green autos Tesla TSLA, +1.89% has already made its big move up from $275 where I suggested it here on MarketWatch and in my stock newsletter, Brush Up on Stocks, in early 2019. But it makes sense to still consider some of the â\u0080\u009carms dealersâ\u0080\u009d to the green car space. Here, Smith likes NXP Semiconductors NXPI, +4.96%, which sells semiconductors used in electric-powered vehicles. Waghorn likes Samsung SDI, a Korean pureplay on lithium-ion batteries that is building partnerships with European car manufacturers. Another play here that he likes: ON Semiconductor ON, +1.19%, which sells power-management chips used in the electric-vehicle space. 3. Renewable-energy companies Of course, weaning the world off fossil fuels is a core objective of eco-friendly advocates who link carbon emissions to global warming. This seems more doable now that producing energy with renewable sources like wind, solar and geothermal energy is often cost competitive with, or cheaper than, fossil fuels. In this area, Smith at John Hancock singles out Avangrid AGR, -0.71%, a major supplier of power generated from offshore wind sources. She also highlights Eaton ETN, +0.04%, which sells gear that helps improve efficiency of the power grid so it can better handle power from alternative-energy sources. Waghorn owns Ormat Technologies ORA, +2.75%, a geothermal power generator, NextEra Energy NEE, +0.62%, the largest generator of renewable energy, and TPI Composites TPIC, +4.31%, a materials-science company that sells lightweight materials used in wind turbine blades. Aarts highlights Orsted DNNGY, +1.45%, a green-energy provider based in Denmark. Green agriculture Agriculture can be a big source of waste and emissions that harm the atmosphere, which is why Biden cites sustainable farming as a core piece of his green energy plan. In this space, Aarts, at the Pax Global Environmental Markets Fund, likes Trimble TRMB, +0.54%, because it offers satellite images used by farmers to reduce waste of pesticides and water, by better targeting their use. He also cites Koninklijke DSM RDSMY, +1.35%, a Dutch company that sells â\u0080\u009cclean cowâ\u0080\u009d food that reduces the emission of methane from bovines. He also says Agilent Technologies A, +1.53% will play a role in green farming because it sells gear used in testing levels of pollution in water, air and soil â\u0080\u0094 which often comes from agriculture. After all, you canâ\u0080\u0099t reduce pollution from agriculture if you donâ\u0080\u0099t measure it in the first place. At the time of publication, Michael Brush had no positions in any stocks mentioned in this column. Brush has suggested PG and TSLA in his stock newsletter, Brush Up on Stocks. Brush is a Manhattan-based financial writer who has covered business for the New York Times and The Economist Group, and he attended Columbia Business School. Follow Brush on Twitter @mbrushstocks."}]}