{"article": [{"url": "https://www.marketwatch.com/story/apple-and-amazon-to-dominate-an-economy-without-mouths-or-noses-but-10-of-jobs-may-never-come-back-strategist-says-2020-07-31", "published": 1596188720.0, "headline": "Blowout earnings show big tech dominate an economy 'without mouths or noses' but 10% of jobs may never come back, strategist says", "body": "That was quite a performance for America's technology giants. Apple AAPL, +1.74% comfortably beat earnings and revenue estimates, as the iPhone maker announced a 4-for-1 stock split. Internet retailer Amazon.com AMZN, +3.01%  demolished earnings estimates - $10.30 a share versus estimates of $1.48 a share - after 40% revenue growth. Facebook FB, +0.26%  nearly doubled its profit and beat expectations on earnings, revenue and monthly active users. Google parent Alphabet GOOG, +1.97%  did beat earnings and revenue expectations, though the search giant's year-over-year revenue fell. What all four benefit from is that their products and services can be used from home, and increasingly so in the absence of real-world shopping and leisure competition. This is also an economy without \"mouths or noses,\" according to Dhaval Joshi, chief European investment strategist at BCA Research. That is to say, physical distancing and increasingly mandatory requirements to wear masks restrict any activity that requires the use of your mouth and nose in proximity to others. In the U.S., hospitality, retail, and transport account for 12% of economic activity, he notes. Assume that physical distancing and the use of face masks force them to operate at two-thirds capacity, then the economy will lose a tolerable 4% of activity. However, those labor-intensive sectors employ 25% of all workers - so at two-thirds capacity, more than 8% of all jobs get wiped out, or 10% in a less-favorable scenario. With governments tiring of providing lifelines to employers, permanent unemployment will continue to rise, which should keep depressing 30-year bond yields, Joshi says. Given the tight relationship between bond yields and bank share prices, bank stocks should fall. The winners, he points out, aren't European, which is why U.S. profits have held up better. Amazon, Apple, Microsoft MSFT, +2.48%  and Netflix NFLX, +1.43%  alone account for more than half the underperformance of the Stoxx Europe 600 SXXP, +0.55%  vs. the S&P 500 SPX, +0.87%  this year. Joshi dismisses the argument that Robinhood day traders are creating a speculative frenzy in growth defensives, saying all the recent price moves can be explained by both resilient profits and collapsing bond yields. While there is always the possibility of a sudden end to the pandemic, he's not expecting that, on the belief a credible vaccine won't be available until next year. \"This will depress ultralong bond TMUBMUSD30Y, 1.576%  yields even more, and keep supporting an overweight to growth defensives, at least relative to other parts of the stock market,\" he says. The buzz Besides the technology earnings, Thursday night also included well-received earnings from automobile maker Ford F, -1.36%  and videogame maker Electronic Arts EA, +1.15%, while travel service Expedia EXPE, +0.36%  disappointed after a worse-than-forecast loss. White House chief of staff Mark Meadows said the Trump administration would support a one-week extension of extra $600 a week unemployment benefits, which are set to expire on Friday. France, Italy and Spain reported double-digit declines in second-quarter gross domestic product. Chicago purchasing managers index and the University of Michigan consumer sentiment index are still to come. The market U.S. stocks SPX, +0.87%  opened higher, with the Nasdaq Composite COMP, +1.39%  advancing after the standout earnings. Gold GC00, +2.17%  and silver SI00, +5.96%  futures were both rallying on Friday. The pound GBPUSD, +0.83%  was trading over $1.31 and has advanced over 5% over the last month. The chart The permanent portfolio, which is an equal-weighting of stocks, bonds, gold, and cash, just had its best run in 40 years, points out Michael Batnick, the director of research at Ritholtz Wealth Management and author of the Irrelevant Investor blog. While this portfolio underperforms stocks over long periods, it is also more stable, suffering a monthly drawdown of just 5% in the most recent bear market, and less than 15% in the 2008-09 global financial crisis. \"With bonds giving you 1-2% and cash giving you 0, I wouldn't expect much upside from here. The good news is, if history is any guide, you shouldn't expect much downside either,\" says Batnick. Random reads The National Basketball Association season resumed with an ugly but closely fought win by the Los Angeles Lakers over the Los Angeles Clippers. Now that's a nap - sleeping microbes wake up after 100 million years buried under the seafloor. Need to Know starts early and is updated until the opening bell, but sign up here to get it delivered once to your email box. Be sure to check the Need to Know item. The emailed version will be sent out at about 7:30 a.m. Eastern."}]}