{"article": [{"url": "https://www.marketwatch.com/story/the-cdcs-eviction-moratorium-doesnt-automatically-protect-renters-how-to-get-help-11599206271", "published": 1599213080.0, "headline": "CDCâ\u0080\u0099s eviction moratorium doesnâ\u0080\u0099t automatically protect renters â\u0080\u0094 here are the strict criteria you must meet", "body": "A new CDC order will protect families nationwide from eviction, but renters need to proactively contact their landlord to be eligible. Getty Images The U.S. Centers for Disease Control has ordered an unprecedented national moratorium on evictions â\u0080\u0094 but that doesnâ\u0080\u0099t mean all renters are automatically protected from losing their homes. Renters wonâ\u0080\u0099t immediately reap the benefits of this new policy, and people who donâ\u0080\u0099t take the proper steps to protect themselves could still face eviction in the months to come. â\u0080\u009cThe most important thing for renters to know right now is they are not automatically covered under this moratorium,â\u0080\u009d said Diane Yentel, president and CEO of the National Low Income Housing Coalition. Read more: Renters in U.S. cannot be evicted through the end of the year due to coronavirus, CDC order states To be protected by the CDCâ\u0080\u0099s moratorium, which lasts until Dec. 31, renters must sign a form and deliver it to their landlord, declaring the following: They made their best effort to obtain government assistance for rent. That they expect to earn no more than $99,000 in annual income for 2020 (or $198,000 for couples filing jointly); or that they were not required to report income in 2019 to the Internal Revenue Service; or that they received a CARES Act stimulus check. They cannot make a full rent payment because of a loss of income, lay-off, loss of work hours or extraordinary medical expenses. That they are making a best effort to make timely partial payments as close to the full payment as possible. If evicted they would become homeless, need to live in a shelter or need to move into a shared residence where they would be living in close quarters. They understand they may be required by their landlord to provide full or all payments when the moratorium ends at the end of 2020. A copy of the form can be found on the CDCâ\u0080\u0099s website. A renter who signs this form does so under penalty of perjury. The form is considered sworn testimony â\u0080\u0094 so if a person is found to have lied about any of the above they could face prosecution, jail time and/or a fine. Legal experts and housing advocates said that tenants who need to take advantage of the national moratorium should send the form to their landlord in such a manner that there is proof it was sent â\u0080\u0094 such as by both email and a hard copy or by certified mail through the U.S. Postal Service. Renters should keep a copy of the forms for themselves. “ â\u0080\u0098Weâ\u0080\u0099re all hoping it is the lifeline it purports to be, but so much of it is really going to be dependent on how landlords and the judicial system react to this.â\u0080\u0099 ” â\u0080\u0094 Gerron Levi, senior director of government affairs at the National Community Reinvestment Coalition Landlords who knowingly violate the CDC order and try to evict tenants who provided them with such a declaration could face criminal penalties, including jail time if those tenants subsequently contract COVID-19. However, experts said the national moratorium is somewhat ambiguous as to whether it can functionally prevent landlords from filing for eviction. â\u0080\u009cWeâ\u0080\u0099re all hoping it is the lifeline it purports to be, but so much of it is really going to be dependent on how landlords and the judicial system react to this â\u0080\u0094 the force and authority they give to it,â\u0080\u009d said Gerron Levi, senior director of government affairs at the National Community Reinvestment Coalition. Eviction cases are not handled at the federal level and are, instead, decided in state and municipal courts. Consequently, different judges across the country could choose to interpret the moratorium differently in how they decide to proceed with eviction cases. â\u0080\u009cThe court isnâ\u0080\u0099t necessarily going to know that the tenant filed documentation per the CDC order,â\u0080\u009d said Eric Dunn, director of litigation for the National Housing Law Project. Read more: California eviction moratorium is â\u0080\u0098a real nightmareâ\u0080\u0099 for renters to understand â\u0080\u0094 hereâ\u0080\u0099s what you need to know Consequently, tenants should gather materials that can serve as proof that they meet the requirements laid out in the CDC form. These can include any written notices regarding unemployment, email correspondence with housing aid agencies, or copies of medical bills, for instance.Renters still should be making monthly payments, despite the national moratorium As the CDC form states, tenants should continue to make an effort to pay what they can toward their monthly rent obligations. Doing this will also help to reduce the amount of accrued payments a renter owes their landlord when the moratorium expires. The National Low Income Housing Coalition has tracked the emergency rental assistance programs that have been created since the coronavirus crisis began. So far, 325 of these programs have been created, Yentel said, but about 25% of the program have already run out of resources. In some cases, the programs ran out of funds within hours of going into operation, Yentel said. How renters can access emergency rental assistance varies from program to program. â\u0080\u009cMany of the emergency rental assistance programs do require some proof of income to show you meet the income eligibility requirements, and some require proof of loss of income related to COVID-19,â\u0080\u009d Yentel said. Rental industry officials and housing advocates alike, however, have raised concerns that more money is needed for emergency rental assistance nationwide, particularly now that there is a national eviction moratorium in effect. In cities or states where local eviction moratoria were already in effect, tenants may already be adequately protected by those orders. In those cases, the CDC process will not necessarily apply and tenants will need to follow the policies laid out by their local order. For instance, in California, residents are required to pay at least 25% of their monthly rental payments to be covered by the stateâ\u0080\u0099s eviction moratorium, which was signed into law this week."}]}