{"article": [{"url": "https://www.marketwatch.com/story/barbie-could-be-queen-of-the-holiday-season-with-analysts-upbeat-about-mattel-and-hasbro-11601488818", "published": 1601641040.0, "headline": "Barbie could be queen of the holiday season with analysts upbeat about Mattel and Hasbro", "body": "Barbie will be a top doll this holiday season, JPMorgan forecasts. Mattel One familiar face may show up at many holiday celebrations this year: Barbie. The iconic Mattel Inc. MAT, -0.87% doll is poised to be a “winner” among dolls, according to JPMorgan analysts, who recently went to a number of Walmart Inc. WMT, +1.00% and Target Corp. TGT, +1.14% locations in the Northeast. “We saw a big presence of Barbie in all locations we visited with separate pallet displays of Barbie Dream House ($179 price point at Walmart and slightly higher at Target),” JPMorgan said. Barbie is getting a boost from her Netflix Inc. NFLX, +1.43% movie “Barbie Princess Adventure,” which was the number eight most watched movie on the streaming platform for the week after its Sept. 1 launch, analysts note. See: Target to host Deal Days shopping event during Amazon Prime Day “We expect Barbie’s momentum to continue (if not accelerate) as Mattel expects to launch more newness around the holiday with higher price point play sets, Barbie family, and more,” the JPMorgan note said. The holiday season is getting a jump start even before we reach Halloween during this COVID-19-impacted year, with Target announcing deals that will start in October, coinciding with Amazon.com Inc.’s AMZN, +3.01% Prime Day event, and Black Friday deals throughout November. Walmart has started to announce its holiday plans, with 20,000 seasonal workers being brought on board. And Walmart and BJ’s Wholesale Corp. BJ, +1.19% have announced their hot toy lists. More broadly, JPMorgan thinks well-known names will be big this holiday season. Also: Walmart is hiring 20,000 seasonal workers — here’s how a seasonal job could affect your unemployment benefits “While touring Walmart and Target stores, we noticed expanded shelf presence of evergreen brands like Barbie and Lego while last year’s best sellers such as ‘Frozen,’ ‘Toy Story 4’ and Marvel have ceded space,” analysts said. “With Marvel’s ‘Black Widow’ release pushed to May 2021 (for now from November this year), we think it might not be until summer 2021 that we could see tent-pole movies released in theaters the traditional way (unless we have a vaccine).” D.A. Davidson also zeros in on the lack of movie releases this year due to the pandemic, and the impact it’s having on the toy category. “Mattel was relying on ‘Minions’ but will have to rely on Barbie, Fisher Price [and other brands],” Linda Bolton Weiser, senior research analyst at D.A. Davidson, told MarketWatch. “Minions 2: The Rise of Gru” has been delayed until July 2, 2021 due to the coronavirus. “Hasbro will have to fill the hole of traditional toys as well.” D.A. Davidson recently met with executives from Mattel, who said that Barbie “continues to show positive momentum,” Weiser wrote in a Sept. 10 note. “Because it is an impulse purchase item, Hot Wheels was impacted by COVID-related store closures in 2Q20, but management expects improvement in 2H20.” Weiser is upbeat about the second half of the year, with second-quarter point-of-sale (POS) retail toy sales up 15% to 20%. “Ending 2Q20 with lean retail inventory and strong POS trends also bodes well for 2H,” the note said. And: Holiday sales forecast to grow 1% to 2.6% during new October-to-December shopping season: AlixPartners Stifel is also optimistic about the second half, upgrading Hasbro Inc. HAS, +1.36% shares to buy from hold. Analysts raised Hasbro target price to $100 from $73. “[W]e see an event path to improving fundamentals (and sentiment), and hence higher share prices over the near/intermediate-term,” analysts led by Drew Crum wrote. “This entails growing optimism for upside to 2H20 results, fueled by solid demand during the seasonally important holiday selling season.” With parents and kids stuck at home more due to the pandemic, Weiser identifies activity toys, outdoor toys, games and puzzles as categories that benefitted. One entertainment tie-in that analysts say will help both Hasbro and Mattel is the second season of the Disney+ DIS, +1.53% series “The Mandalorian.” See: Disney launching ‘Mando Mondays’ for ‘Mandalorian’ products as second season airs D.A. Davidson says Mattel has “seen good results” from the launch of a plush product line tied to the show, and JPMorgan highlights the “Mando Monday” campaign that will drive the launch of toys from Hasbro, Lego and Funko Inc. FNKO, +0.81% “Despite the challenges of 2020, we’re seeing one of the strongest fall toy lineups in recent years. Retailers and toymakers are reacting to life in the COVID-19 era but being mindful of in-stock position and spreading out promotions and competitive pricing throughout the season rather than relying on single-day promotional events such as Black Friday,” said James Zahn, senior editor of the Toy Insider. Don’t miss: Amazon will host its delayed Prime Day shopping event on Oct. 13 and 14 Adding to the list of big names are Rubik’s Cube, Etch-A-Sketch, Slinky and Thomas & Friends, which are all celebrating milestone anniversaries. “Toys and games that families can enjoy together at home are also hugely popular this year and we’re also seeing a lot of new life from some classic brands,” Zahn said. Mattel is scheduled to report third-quarter earnings on Oct. 22, the company has announced. Hasbro is expected to report on its third-quarter on Oct. 26, according to FactSet. Mattel stock has fallen 11.7% for the year to date. Hasbro is down 21.5%. And the S&P 500 index SPX, +0.87% is up 3.5% for the period."}]}