{"article": [{"url": "https://www.marketwatch.com/story/nikola-shares-take-wild-ride-after-denial-of-short-sellers-allegations-report-of-sec-inquiry-2020-09-14", "published": 1600117160.0, "headline": "Nikola shares take wild ride after denial of short-sellerâ\u0080\u0099s allegations, report of SEC inquiry", "body": "Shares of electric-truck maker Nikola Corp. went on a wild ride Monday, as the Securities and Exchange Commission reportedly weighed a short-sellerâ\u0080\u0099s claims of fraud, which the company had vehemently denied earlier in the day. After sinking around 8% in early-morning trading, shares of Nikola NKLA, -1.36% Â surged after the company issued a rebuttal, closing up more than 11%. But much of those gains evaporated after hours, following a Bloomberg News report that the SEC was looking into short-seller Hindenburg Researchâ\u0080\u0099s claims. Nikola ended the extended session down 8%. Last week, Hindenburg called Nikola an â\u0080\u009cintricate fraud,â\u0080\u009d alleging the company made widespread false statements and false claims about its technology. On Monday morning, Nikola called that report â\u0080\u009cfalse and misleadingâ\u0080\u009d and offered a detailed rebuttal of Hindenburgâ\u0080\u0099s accusations, citing â\u0080\u009cdozensâ\u0080\u009d of inaccuracies. But Nikola did not dispute that a 2018 promotional video giving the impression of a self-driving truck in action actually just showed the truck rolling downhill. Nikola â\u0080\u009cnever stated its truck was driving under its own propulsion in the video,â\u0080\u009d the company said. Nikola also said it had â\u0080\u009cproactively contacted and briefedâ\u0080\u009d the SEC about Hindenburgâ\u0080\u0099s report, claiming it was designed to manipulate the market to benefit short sellers. In a statement, Nikola said it â\u0080\u009cwelcomes the SECâ\u0080\u0099s involvement in this matter.â\u0080\u009d But its stock tumbled in extended trading after a late-afternoon report by Bloomberg that said the SEC is also looking into Hindenburgâ\u0080\u0099s allegations that Nikola may have violated securities laws by deceiving investors. Bloomberg said the review is preliminary and may not result in an investigation. Wedbush analyst Dan Ives is taking a wait-and-see approach, saying Monday that Nikola is a â\u0080\u009cprove meâ\u0080\u009d stock, while keeping a neutral rating. Last week, Nikola shares shot higher after General Motors Co. took a $2 billion equity stake in the company and announced a â\u0080\u009cpotential game changingâ\u0080\u009d partnership to build an electric pickup. GM Chief Executive Mary Barra told CNBC on Monday that GM had conducted â\u0080\u009cappropriate diligenceâ\u0080\u009d ahead of the deal. Nikola shares have sunk 47% over the past three months, but are still up nearly 250% year to date."}]}