{"article": [{"url": "https://www.marketwatch.com/story/facebook-bans-an-extremist-anti-government-network-associated-with-the-boogaloo-movement-2020-06-30", "published": 1593535520.0, "headline": "Facebook bans an extremist anti-government network associated with the 'boogaloo' movement", "body": "OAKLAND, Calif. (AP) - Facebook FB, +0.26%  has banned an extremist anti-government network loosely associated with the broader \"boogaloo\" movement, a slang term supporters use to refer to a second Civil War or a collapse of civilization. But the platform didn't try to name the group, underscoring the difficulty of grappling with an amorphous network linked to a string of domestic terror plots that appears to obfuscate its existence. Among other complications, its internet-savvy members tend to keep their distance from one another, frequently change their symbols and catch phrases and mask their intentions with sarcasm. The move by Facebook designates this group as a dangerous organization similar to the Islamic State group and white supremacists, both of which are already banned from its service. The social network is not banning all references to \"boogaloo\" and said it is only removing groups, accounts and pages when they have a \"clear connection to violence or a credible threat to public safety.\" The loose movement is named after \"Breakin' 2: Electric Boogaloo,\" a 1984 sequel to a movie about breakdancing. \"Boogaloo\" supporters have shown up at protests over COVID-19 lockdown orders, carrying rifles and wearing tactical gear over Hawaiian shirts - themselves a reference to \"big luau,\" a homophone for \"boogaloo\" sometimes favored by group members. Facebook said the movement dates back to 2012 and that it has been tracking it closely since last year. Earlier in June, Steven Carrillo, an Air Force sergeant with ties to the boogaloo movement, fatally shot a federal security officer and wounded his partner outside a U.S. courthouse, ambushed and killed a California sheriff's deputy and injured four other officers in Oakland, California. According to the criminal complaint, Carrillo posted in a Facebook group, \"It's on our coast now, this needs to be nationwide. It's a great opportunity to target the specialty soup bois. Keep that energy going.\" The statement was followed by two fire emojis and a link to a YouTube video showing a large crowd attacking two California Highway Patrol vehicles. According to the FBI \"soup bois\" may be a term that followers of the boogaloo movement used to refer to federal law enforcement agents. While the \"boogaloo'\" term has been embraced by white supremacist groups and other far-right extremists, many supporters insist they aren't racist or truly advocating for violence. Violent and extremist groups are increasingly turning to encrypted communications networks and fringe social platforms with no content moderation to congregate, which makes them more difficult to track. As part of Tuesday's announcement, Facebook said it has removed 220 Facebook accounts, 95 Instagram accounts, 28 Pages and 106 groups that that comprise the violent Boogaloo-affiliated network. It also took down 400 other groups and 100 pages that hosted similar content as the violent network but were maintained by accounts outside of it. The company said it has so far found no evidence of foreign actors amplifying \"boogaloo\"-related material. Social media companies are facing a reckoning over hate speech on their platforms. , Reddit, an online comment forum that is one of the world's most popular websites, on Monday banned a forum that supported President-Donald Trump as part of a crackdown on hate speech. Live-streaming site Twitch, which is owned by Amazon, also temporarily suspended Trump's campaign account for violating its hateful conduct rules. YouTube, meanwhile, banned several prominent white nationalist figures from its platform, including Stefan Molyneux, David Duke and Richard Spencer. Civil rights groups have called on large advertisers to stop Facebook ad campaigns during July, saying the social network isn't doing enough to curtail racist and violent content on its platform and several major advertisers have signed on to the boycott. __ Associated Press Writer Michael Kunzelman contributed to this story from Silver Spring, Md."}]}