{"article": [{"url": "https://www.marketwatch.com/story/americans-household-debt-fell-for-the-first-time-since-2014-but-that-doesnt-mean-people-are-paying-off-their-loans-2020-08-06", "published": 1596908720.0, "headline": "Americans' household debt fell for the first time since 2014 - but that doesn't mean people are paying off their loans", "body": "Total household debt fell on a quarterly basis for the first time since 2014, as Americans tightened their belts amid the coronavirus pandemic. The Federal Reserve Bank of New York reported that total household debt fell by $34 billion, or 0.2%, in the second quarter. It was the largest decrease on record since the second quarter of 2013. The drop in household debt doesn't mean Americans are better off financially though. A separate survey from real-estate website Apartment List found that one in three people couldn't pay their rent or mortgage in full this month. Indeed, the downturn in debt is actually a reflection of people cutting their spending more than it is a sign that people are paying off loans. The main driver behind the decrease was a $76 billion decline in credit card balances, which represents the largest decline since at least 2000. \"As spending rebounds, so will outstanding debt figures,\" said Greg McBride, chief financial analyst at Bankrate. But some argued that growth in household debt may be stymied by lenders who are wary of taking on more risk amid a pandemic. \"Growth in consumer credit is likely to remain subdued because lenders are tightening standards on new lending and some are cutting back on credit limits and closing accounts,\" said Tendayi Kapfidze, chief economist at LendingTree TREE, -0.37%. Many mortgage lenders, for instance, are requiring applicants to have higher credit scores to qualify for loans compared with before COVID-19. Meanwhile, the wide-scale availability of forbearance on debts, ranging from mortgages to student loans, contributed to a decline in delinquency rates. Delinquencies for mortgages, auto loans and credit cards were all down. In the student loan sector, approximately 88% of borrowers had a scheduled payment of $0, the New York Fed found. “ 'Lenders are tightening standards on new lending and some are cutting back on credit limits and closing accounts.' ” - Tendayi Kapfidze, chief economist at LendingTree \"With forbearances having been rolled out nearly universally, not surprisingly, the repayment rates of student loans have declined sharply,\" New York Fed researchers wrote in a blog post about the quarterly debt report. It could be a long time before the economic downturn caused by the pandemic translates into upticks in loan defaults and foreclosures, experts say. In the case of mortgages, Americans can get up to 12 months' worth of payment relief if they have a federally-backed loan, including those backed by Fannie Mae FNMA, +0.73%  and Freddie Mac FMCC, +0.52%  . As a result, pandemic-related defaults on home loans may not appear in earnest until the second half of 2021. Americans who were laid off or furloughed may not be receiving boosted unemployment payments at the moment, which could make settling debts more challenging in the interim. \"If you've lost your income due to the pandemic, you may have to put other financial priorities first, like keeping a roof over your head and food on the table, said Sara Rathner, credit card expert at NerdWallet. \"It's OK to focus on that now and deal with debts later.\" Rathner's advice: First, build a rainy-day fund to cover emergencies. Then, pay off debt by meeting all minimum payments and putting any extra money toward the loans with the highest interest rates. \"This can help you stay organized and motivated while ultimately saving you on interest,\" she said."}]}