{"article": [{"url": "https://www.marketwatch.com/story/i-paid-tax-trump-says-but-doesnt-say-how-much-2020-09-27", "published": 1601241920.0, "headline": "'I paid tax,' Trump says, but doesn't say how much", "body": "President Trump declined to say how much he has paid in federal income taxes after a new report alleged that he paid $750 a year in 2016 and 2017, and no income taxes in 10 of the previous 15 years. \"I paid tax,\" Mr. Trump said at the White House on Sunday, without providing specifics. Mr. Trump disputed a report earlier in the day by the New York Times, which attributed its findings to more than two decades of his tax return data. Asked to give the American people an idea of how much he has paid, he said, \"I've paid a lot, and I've paid a lot of state income taxes, too.\" During the 2016 campaign, Mr. Trump repeatedly promised to release his tax returns but didn't, breaking a 40-year tradition of major-party presidential candidates and presidents doing so. Mr. Trump isn't required by law to release his tax returns publicly, though no law prevents him from releasing them. He has cited continuing Internal Revenue Service audits as a reason not to disclose his returns. During the campaign, his tax lawyers said he was still under audit for the tax years dating back to 2009. Mr. Trump has repeatedly declined to release specifics about his taxes. Democrats say the president's tax returns could shed light on conflicts of interest and the president's compliance with tax law, and have sued for access to the records. New York prosecutors are also seeking Mr. Trump's returns as part of a probe into possible bank or insurance fraud. Mr. Trump paid little to no taxes largely because he reported losing more money than he made in those years, the Times reported. Between 2010 and 2018, Mr. Trump wrote off some $26 million in consulting fees as a business expense across nearly all of his projects, according to the report, with no detail on the fees. Some of those fees matched payments that Ivanka Trump, the president's eldest daughter, reported on financial disclosures when she joined the White House staff. That suggests she may have been treated as a consultant on the same hotel deals that she helped manage as part of her job at her father's business. Alan Garten, a spokesperson for the Trump Organization, didn't respond to a request for comment. Mr. Garten said in a statement to the Times that Mr. Trump \"has paid tens of millions of dollars in personal taxes to the federal government, including paying millions in personal taxes since announcing his candidacy in 2015.\" Write to Michael C. Bender at Mike.Bender@wsj.com"}]}