{"article": [{"url": "https://www.marketwatch.com/story/hot-rookies-and-not-so-hot-pot-companies-hop-on-the-slowing-earnings-parade-2020-08-09", "published": 1596964100.0, "headline": "Hot rookies and not-so-hot pot companies hop on the slowing earnings parade", "body": "Corporate profits have overwhelmingly exceeded low expectations so far this earnings season, but there are still plenty of wild cards left in the deck. Consensus S&P 500 SPX, +0.87% earnings estimates have come up only 3% for the third quarter and they haven’t budged at all for the fourth quarter, according to Credit Suisse Chief U.S. Equity Strategist Jonathan Golub, even as S&P 500 components have so far beaten June-quarter estimates by 23% in aggregate. With about 90% of S&P 500 reports already in, more than 80% of companies topped diminished profit expectations, he said. The latest week of results helped slightly improve the S&P 500’s profit trajectory for the second quarter, though earnings are still on pace for their worst decline since the second quarter of 2009. Analysts surveyed by FactSet expect that profits for the index fell 33.8% in the period, taking into account already-reported results and estimates for the rest. That’s down from an estimated 35.8% drop as of the end of last week and a projected 42.4% plunge two weeks ago. Profits could be in for another steep fall in the third quarter, as the FactSet consensus calls for a 22.9% drop. Fourth-quarter profits are expected to fall 12.7%, and analysts are looking for an 18.8% decline for the full year. The pace of earnings season is winding down, with just 13 members of the S&P 500 scheduled to report in the week ahead and just one Dow Jones Industrial Average DJIA, +0.56% component, Cisco Systems Inc. CSCO, +0.15%, on the docket. In the place of large companies are some young stocks that have garnered a lot of attention — recent IPOs Lemonade LMND, +12.82% and Vroom Inc. VRM, -0.26% , as well as SPAC acquisition DraftKings Inc. DKNG, -4.51% — and some pot companies looking to bounce back from a tough patch. Here’s what to watch for in the week ahead.The rookies ready to roll Initial public offerings and SPAC acquisitions have found warm welcomes on Wall Street despite the COVID-19 pandemic in recent months, but those companies now have to face the gauntlet of quarterly earnings expectations. Lemonade, which enjoyed the most boisterous stock debut in a year with many first-day pops, will release earnings for the first time as a public company Wednesday morning. The online insurance company’s stock is still comfortably more than 100% higher than its IPO price, as is another stock that went public in the second quarter, online car-seller Vroom, which will report Wednesday afternoon. See also: Five things to know about the Lemonade IPO Companies that aren’t taking the traditional IPO route have many more options right now, amid a wave of special purpose acquisition companies, or SPACs. These “blank check” companies raise money and use it to acquire a private company, as in the case of daily-fantasy and sports-gambling site DraftKings. DraftKings went public through a merger with a SPAC in April, but just wrapped a quarter in which sports were barely played due to COVID-19; expect a lot of the talk to be about volume of activity amid the restart for the National Basketball Association and Major League Baseball in the current quarter.Pot companies look to rise from the ashes Pot companies will kick off the week on Monday, with Canopy Growth Corp. CGC, +2.49% reporting ahead of the bell and Tilray Inc. TLRY, -1.78% releasing results after the day’s trading session. They follow disappointing results from another Canadian cannabis company, Cronos Group Inc. CRON, -1.88% , which reported big losses thanks to some writedowns Thursday. Canadian pot stocks heated up amid the legalization of recreational marijuana sales in Canada, but have struggled since, and funding for pot companies has largely dried up. Canopy Growth retooled its acquisition deal with U.S. pot company Acreage Holdings Inc. US:ACRGF to ensure it had enough cash, while Tilray took on funding with some onerous terms toward the beginning of the pandemic. IT trends Worsening COVID-19 trends in July could weaken the corporate spending optimism that Wolfe Research analyst Jeff Kvaal saw in June, but he thinks Cisco could ultimately emerge from the crisis in a strong position as the pandemic is boosting demand for Cisco’s software offerings. The company’s security software and WebEx conferencing tools are in high demand during the pandemic, Kvaal said, which should help Cisco “easily” meet its goal of generating 30% of revenue from software by the end of the fiscal year. “Cisco’s sales are now >50% recurring, which should insulate it from a recession,” Kvaal wrote ahead of the company’s Wednesday afternoon report. Need a ride? Uber Technologies Inc. UBER, -0.18% saw its food-delivery business surpass its ride-hailing business in the second quarter, but rival Lyft Inc. LYFT, +2.16% doesn’t have that cushion. The company focuses almost entirely on rides in the U.S., making it more sensitive to pandemic-related developments. Ride-hailing revenue for Uber plunged 67% in the second quarter, and the company said that mobility trends in the U.S. are lagging other markets like Asia and Europe where demand for rides has recovered more quickly. Lyft stock fell 6.7% Friday, following Uber’s report. Uber’s U.S. commentary “is a negative read-across for Lyft, which of course doesn’t operate outside of North America or in verticals outside of rideshare,” Bernstein’s Mark Shmulik wrote ahead of Lyft’s Wednesday afternoon report. He said that ride-hailing doesn’t appear to be taking much share away from public transportation even during the pandemic, perhaps because “several higher income segments of the economy” are still able to work from home while more price-sensitive customers are more likely to be commuting to their jobs.Tourist traps Monday morning offers two views of the bleak state of the leisure industry with Royal Caribbean Cruises Ltd. RCL, +2.59% and Marriott International Inc. MAR, -0.96% due to report. Of interest with Royal Caribbean will be the company’s cash-burn trends and its expectations for when cruising can resume. An order from the Centers for Disease Control and Prevention bans cruises in U.S. waters until Oct. 1, but Truist analyst C. Patrick Scholes wrote that he expects “sailings will not resume in quantity in North America until at least 2Q21” given the potential for more government cautions. Marriott’s story isn’t quite as dismal and investors will be looking for the geographic differences in hotel rebound trends. Loose threads Coach-parent Tapestry is set to face investors Thursday morning for its first earnings call since Chief Executive Jide Zeitlin resigned from the company for personal reasons, which The Wall Street Journal reported were related to a board investigation into a prior romantic relationship. When the company announced his resignation in late July, it also disclosed that June-quarter results exceeded internal projections. “Overall, significant leadership changes just a few weeks ahead of unveiling an updated multi-year growth strategy is reason for caution,” wrote Telsey Advisory Group analyst Dana Telsey, referring to expectations that Tapestry would give a major strategic update along with its upcoming earnings report. She said that the interim leadership team is well known to Tapestry investors but that “the handbag category is in a relatively more difficult position in the new environment.”Chipping in Semiconductor equipment companies KLA Corp. KLA, +1.95% and Lam Research Corp. LRCX, +2.04% both offered what analysts considered encouraging signals for a memory recovery, and it will be Applied Materials’ AMAT, +1.10% turn to offer some perspective Thursday afternoon. Also of interest in the company’s commentary will be its recent announcement of a new conductor etch tool. Wells Fargo analyst Joe Quatrochi is focused on Applied Materials’ ability to gain share from Lam in this part of the market."}]}