{"article": [{"url": "https://www.marketwatch.com/story/u-s-treasury-yields-slide-in-wake-of-fed-dovish-update-11600347937", "published": 1600358840.0, "headline": "U.S. Treasury yields tick lower following Fed dovish update, humdrum data", "body": "AFP via Getty Images U.S. Treasury yields fell Thursday after the Federal Reserve underlined its commitment to keeping interest rates near zero for the next few years and after a round of lackluster economic data.What are Treasurys doing? The 10-year Treasury note yield TMUBMUSD10Y, 0.777% fell 0.4 basis point to 0.682%, while the 2-year note rate TMUBMUSD02Y, 0.156% edged 0.4 basis point down to 0.133%. The 30-year bond yield TMUBMUSD30Y, 1.576% slipped 1.9 basis points to 1.428%. Bond prices move inversely to yields. What’s driving Treasurys? On Wednesday, the Federal Reserve spelled out the conditions under which it would contemplate higher interest rates, saying it said it would tighten policy only after inflation saw a sustained overshoot of 2% and until the U.S. labor market reached full employment. Members of the Fed’s rate-setting group saw rates staying unchanged at a range between 0% to 0.25% through the end of 2023. In Europe, the Bank of England on Thursday unanimously decided to keep interest rates and its bond purchase program unchanged but policymakers were also briefed on how the central bank could implement negative interest rates. European bonds rallied after the BOE policy update. The 10-year U.K. government bond yield TMBMKGB-10Y, 0.283% slipped 3.1 basis points to 0.186%, while the equivalent German bond TMBMKDE-10Y, -0.521% fell 1.2 basis points to negative 0.490%. Investors also digested a round of humdrum U.S. economic data. New applications for jobless claims declined to 860,000 in the latest weekly period from 893,000 while continuing claims fell to 12.63 million, from 13.54 million, but the rate of improvement in the labor market has slowed significantly. The Philadelphia Fed manufacturing index for September fell to a reading of 15, from the previous month’s 17.2. August housing starts fell 5% to an annualized pace of 1.42 million. What did market participants’ say? The flattening of the yield curve “indicates that the market believes that the Fed has a tough road ahead of it, especially if it has to go it alone,” said Kevin Giddis, chief fixed-income strategist at Raymond James, referring to a narrowing spread between longer-term bond yields and their shorter-term peers."}]}