{"article": [{"url": "https://www.marketwatch.com/story/treasury-yields-tilt-higher-as-bond-market-shrugs-off-tariff-and-coronavirus-fears-2020-06-24", "published": 1593016760.0, "headline": "10-year Treasury yield ducks below 0.70% as coronavirus fears drives Dow, S&P 500 to more than 2% loss", "body": "U.S. Treasury yields slipped Wednesday as investors worried that rising coronavirus cases in many American states will set back economic recovery. What are Treasurys doing? The 10-year Treasury note yield TMUBMUSD10Y, 0.777% fell 2.5 basis points to 0.683%, while the 2-year note rate TMUBMUSD02Y, 0.156% edged 0.5 basis point lower to 0.188%. The 30-year bond yield TMUBMUSD30Y, 1.576% declined 4.4 basis points to 1.445%. What’s driving Treasurys? Equities were stung by reports that a handful of states were seeing a record increase in cases or hospitalizations due to the COVID-19 disease. The S&P 500, Dow and Nasdaq Composite closed more than 2% lower on Tuesday, bolstering demand for Treasurys. In addition, New York, New Jersey and Connecticut announced a two week quarantine on visitors from states with high coronavirus infection rates. Underlining the economic uncertainty this year, the International Monetary Fund also cut its economic forecast for 2020, saying that the coronavirus pandemic has caused an unprecedented decline in global activity. On international trade, the U.S. was considering placing tariffs on the EU over a trade spat involving Europe’s Airbus and its U.S. counterpart Boeing, according to a notice by the Office of the U.S. Trade Representative. The move is part of the U.S. response to the most recent ruling in the very long-running dispute at the World Trade Organization on aircraft subsidies. The steady buying of bonds throughout the session helped to drive demand for an auction of $47 billion of U.S. Treasury 5-year notes in the afternoon. So far, bond buyers have had little trouble taking down the larger debt auctions as the Federal Reserve signals its intentions to keep interest rates low for a prolonged period and continue its bond buying. What did market participants’ say? “There’s still questions how is the recovery going forward. We were dealing with the nastiest situation with the pandemic, then there was the social unrest. And we have issues with reopenings not being planned and regulated as closely as they should have been. We’re really trying to figure out how the economy gets back into a more normalized environment, and then go from there,” said Deborah Cunningham, chief investment officer of global liquidity markets for Federated Hermes, in an interview."}]}