{"article": [{"url": "https://www.marketwatch.com/story/gold-tumbles-over-4-set-for-sharpest-daily-slide-in-5-months-as-yields-pop-2020-08-11", "published": 1597156100.0, "headline": "Gold futures suffer biggest daily dollar decline in more than 7 years", "body": "Gold futures fell sharply Tuesday, prompting bullion to post its steepest daily dollar slide in more than seven years as global stocks and U.S. Treasury yields rose on optimism over prospects for a vaccine and signs of a slowdown in the number of new COVID-19 cases in the U.S. Russian President Vladimir Putin on Tuesday announced that Russia had become the first country to register a vaccine against the coronavirus responsible for the pandemic, though the announcement drew criticism from medical experts. Companies including AstraZeneca PLC AZN, +1.16% and Moderna Inc. MRNA, +0.09% are presently conducting final-stage trials of their vaccines in studies that are expected to soon yield results. Read:Russia’s accelerated COVID-19 vaccine greeted with alarm as experts say Phase 3 trial is essential Prices for the yellow metal have surged to records at least partly on the back of the economic damage wrought by the COVID-19 pandemic, and the potential for a vaccine has been considered a bearish factor for the precious metal that thrives on uncertainty. “Traders who were looking for an excuse to lock-in profits with their bullish gold bets jumped all over the Russia’s vaccine news,” said Edward Moya, senior market analyst at Oanda, in a note. “It didn’t matter that this was somewhat telegraphed or that the Russians have only begun the Phase 3 trials.” The vaccine news helped the S&P 500 SPX, +0.87% climbed toward a record close and yields for the 10-year Treasury note TMUBMUSD10Y, 0.777% were up by more than 7 basis points at 0.65%, reflecting diminished appetite for safe-haven assets like bonds and precious metals and into assets perceived as riskier like stocks. Yields rise as bond prices fall. Meanwhile, commodity investors also parsed inflation data on producer prices. U.S. producer prices jumped by an unexpected 0.6% in July, well above the 0.3% forecast from MarketWatch-polled economists. Core PPI, which strips out food and energy costs, rose 0.3%. December gold GCZ20, +2.17% GC00, +2.17% shed $93.40, or 4.58%, to settle at $1,946.30 an ounce, prompting the precious metal to log its steepest one-day dollar decline since April 15, 2013, and steepest percentage slide since March 13 of this year, based on the most-active contracts, according to Dow Jones Market Data. September silver US:SIU20 also declined sharply, by $3.21, or 11%, to end at $26.049 an ounce after rising by nearly 6.3% Monday. Silver’s decline represented the sharpest daily dollar fall since Sept. 23, 2011 and largest daily percentage drop since March 16 of this year. “ ‘Gold and silver’s run over the past couple of weeks was dizzying in its trajectory and just about everyone marveling at that rise was expecting, and even hoping for, a correction.’ ” — Brien Lundin, Gold Newsletter “Gold and silver’s run over the past couple of weeks was dizzying in its trajectory and just about everyone marveling at that rise was expecting, and even hoping for, a correction,” said Brien Lundin, editor of Gold Newsletter. “Well, it’s here, and the metals are simply releasing a bit of the air that had overinflated the market.” “There was tremendous anecdotal evidence that a great swath of investors had bought into the long-term story for gold and silver and were simply waiting for a pull-back to get in,” he told MarketWatch. “I would expect there’s some reality to this view, and that we’ll see a big influx of investment once it appears that gold has bottomed.” For now, Jeff Wright, executive vice president of GoldMining Inc., said he expects gold to consolidate between $1,900 to $1,950, before regaining the $2,000 level, “but could easily snap back.” Wright still sees a “long-term trend to upside.” Among other metals traded on Comex Tuesday, September copper US:HGU20 rose 0.5% to $2.8755 a pound. October platinum PLV20, +3.99% fell by 3.1% to $971.40 an ounce and September palladium US:PAU20 lost 4.2% to $2,175 an ounce."}]}