{"article": [{"url": "https://www.marketwatch.com/story/barr-tries-to-oust-manhattan-us-attorney-investigating-trump-allies-who-now-refuses-to-step-down-2020-06-20", "published": 1592657420.0, "headline": "DOJ tries to oust US attorney investigating Trump allies", "body": "The Justice Department moved abruptly Friday night to oust Geoffrey S. Berman, the U.S. attorney in Manhattan overseeing key prosecutions of President Donald Trump’s allies and an investigation of his personal lawyer Rudy Giuliani. But Berman said he was refusing to leave his post and his ongoing investigations would continue. “I have not resigned, and have no intention of resigning, my position,” Berman said. His statement came hours after Attorney General William Barr said Berman was stepping down from his position. The standoff set off an extraordinary clash between the Justice Department and one of the nation’s top districts, which has tried major mob and terror cases over the years. It is also likely to deepen tensions between the Justice Department and congressional Democrats who have pointedly accused Barr of politicizing the agency and acting more like Trump’s personal lawyer than the nation’s chief law enforcement officer. The move to oust Berman also comes days after allegations surfaced from former Trump national security adviser John Bolton that the president sought to interfere in an Southern District of New York investigation into the state-owned Turkish bank in an effort to cut deals with Turkish President Recep Tayyip Erdoğan. Barr offered no explanation for why he was pushing out Berman in the statement he issued late Friday. The White House quickly announced that Trump was nominating the chairman of the Securities and Exchange Commission to the job, a lawyer with virtually no experience as a federal prosecutor. Hours later, Berman issued his own statement saying he had learned that he was being pushed out through a press release. He vowed to stay on the job until a Trump nominee is confirmed by the Senate, challenging Barr’s power to remove him from office because he was appointed to the job by federal judges, not by the president. Under federal law, a U.S. attorney who is appointed by district court judges can serve “until the vacancy is filled.” The Justice Department’s Office of Legal Counsel argued in a 1979 opinion that the “power to remove a court-appointed U.S. Attorney rests with the President.” “The President is responsible for the conduct of a U.S. Attorney’s Office and therefore must have the power to remove one he believes is an unsuitable incumbent, regardless of who appointed him,” the opinion argues. A senior Justice Department official said the department was pressing forward with its plans and will have Craig Carpenito, the U.S. attorney in New Jersey, take over the office temporarily, starting on July 3. The official wasn’t authorized to speak publicly about the issue and spoke to AP on condition of anonymity. Democrats have repeatedly accused Trump’s Justice Department of political interference, and those concerns have also been pervasive among some rank and file officials in the agency. House Judiciary Committee Chairman Jerry Nadler said his committee was inviting Berman to testify next week. Federal prosecutors in New York have overseen numerous prosecutions and investigations with ties to Trump in recent years. That includes an ongoing investigation into Giuliani’s business dealings, including whether he failed to register as a foreign agent, according to people familiar with the probe. The people were not authorized to discuss the investigation publicly and spoke on the condition of anonymity. The office has also prosecuted a number of Trump associates, including Trump’s former personal lawyer and fixer Michael Cohen, who served a prison sentence for lying to Congress and campaign finance crimes. Berman has also overseen the prosecution of two Florida businessmen, Lev Parnas and Igor Fruman, who were associates of Giuliani and tied to the Ukraine impeachment investigation. The men were charged in October with federal campaign finance violations, including hiding the origin of a $325,000 donation to a group supporting Trump’s reelection. Attention refocused on the Southern District this week after news organizations, including The Associated Press, obtained copies of Bolton’s tell-all book. Bolton alleges in the book that Trump sought to cut a deal to stop federal prosecutors in New York from investigating whether Halkbank violated U.S. sanctions against Iran in order to free an American pastor imprisoned in Turkey. Six weeks after the pastor’s release, Bolton writes that on a call with the Turkish president,”Trump then told Erdoğan he would take care of things, explaining that the Southern District prosecutors were not his people, but were Obama people, a problem that would be fixed when they were replaced by his people.” The White House is seeking to block the public release of Bolton’s book, saying it is being published without formal authorization that the manuscript was free of classified information. The episode Bolton describes occurred months after Berman assumed the role of U.S. attorney. A Republican who contributed to the president’s election campaign, Berman worked for the same law firm as Giuliani and was put in his job by the Trump administration. But as U.S. attorney, he won over some skeptics after he went after Trump allies, and had a direct hand in other investigations that have angered the president. Berman was appointed by then-Attorney General Jeff Sessions in January 2018, after Preet Bharara, then US attorney in New York, was fired. Bharara had refused to resign along with dozens of other federal prosecutors appointed by President Barack Obama. Months later, FBI agents raided Cohen’s offices, an act the president decried as a politically motivated witch hunt. Berman recused himself from Cohen’s prosecution though it was never explained why. The following April, in the absence of a formal nomination by Trump, the judges in Manhattan federal court voted to appoint Berman to the position permanently. The White House never said why Trump didn’t formally nominate Berman. Yet the links between the White House and some of Berman’s investigations were clear. His office subpoenaed Trump’s inaugural committee for a wide range of documents as part of an investigation into various potential crimes, including possible illegal contributions from foreigners to inaugural events. And weeks before the 2018 midterm election, Berman announced insider trading charges against an ardent Trump supporter, Republican Rep. Chris Collins. Collins, who represented western New York, has since resigned. Under Berman’s tenure, his office also brought charges against Michael Avenatti, the combative lawyer who gained fame by representing porn actress Stormy Daniels in lawsuits involving Trump. Avenatti was convicted in February of trying to extort Nike after prosecutors said he threatened to use his media access to hurt Nike’s reputation and stock price unless the sportswear giant paid him up to $25 million. The White House said in a statement Friday that Trump is nominating SEC Chairman Jay Clayton to the post. Before taking the reins at the SEC, Clayton was a well-connected Wall Street lawyer who represented and advised a number of major companies, including Goldman Sachs, Barclays, Deutsche Bank and UBS. ___"}]}