{"article": [{"url": "https://www.marketwatch.com/story/evacuating-due-to-hurricane-florence-include-these-items-in-your-financial-go-bag-2018-09-13", "published": 1598349860.0, "headline": "Evacuating due to hurricanes or wildfires? Put these items in your 'financial go-bag", "body": "When fleeing a natural disaster, your instinct might be to grab a laptop or a treasured keepsake like a family photo album. But what about your car insurance policy or your tax returns? “ People need to assume they won't be back for a very long time. ” Around 250,000 people in California have been ordered to leave their homes as three wildfires in the San Francisco Bay Area have swelled to a size larger than the state of Rhode Island. The SCU Lightning Complex Fire alone was burning across more than 347,000 acres, and the LNU Lighting Complex Fire was burning more than 350,000 acres. The first complex was only 10% contained, while the other was 22% contained. The fires, many of which were caused by lightning strikes, are some of the largest in California's history. Read more:Major flooding in the South is a cautionary tale for all homeowners Across the country, residents of Texas and Louisiana were preparing for the rare one-two punch of back-to-back tropical storms making landfall on the Gulf Coast. Both states have declared states of emergency and have requested federal emergency declarations ahead of the storms. Multiple parishes in Louisiana have ordered residents to evacuate in anticipation of major storm surges, and some counties in Texas could soon follow with their own evacuation orders. Tropical Storm Marco was expected to make landfall Monday afternoon or evening, though forecasters predict it will weaken to a tropical depression while crossing over Louisiana. Tropical Storm Laura has developed into a hurricane and is expected to make landfall in Texas or Louisiana early Thursday. Whether escaping from a wildfire or a hurricane, people fleeing disasters need to assume they won't be back for a very long time, said Tiffany Ballard, a wealth manager with Bergland Wealth Management, based in Ridgeland, Miss. There is a temptation to take bare essentials in a waterproof bag, she said. \"The better alternative is storing critical files in a portable bin that stays ready to be packed in the car for travel,\" she said. MarketWatch asked personal-finance experts and financial advisers what people should include to secure their finances during and after a natural disaster:Pack IDs, medical documents and wills Bring IDs such as a driver's license, passport, Social Security card or birth certificate for all members of the household. Also pack health insurance cards and emergency contact information for friends or relatives. People should also bring along anything they would normally keep in their wallets, including credit cards. Medical information is critical, including copies of prescriptions, medicine lists and contact information for doctors. To prepare for the absolute worst, travel with estate documents, such as a will or power of attorney. “ With power outages, cash is king in a natural disaster. ” Cash is king in a natural disaster. With power outages likely, many businesses won't be able to accept credit cards. And leaving cash behind is a dicey proposition when one's home is at risk. \"Do you like to keep an abundance of cash available? If so, be sure to grab it to avoid losing it in a flood or fire,\" said Tad Herrington, a senior financial planner with private financial planning firm John E. Sestina and Co. in Columbus, Ohio. Given that banks may remain closed for an extended period of time and ATMs may be damaged depending on the severity of the disaster, consumers should plan to take a sizeable amount of cash. Ideally, they should split the money among responsible members of their household and carry it in a traveler's money belt for safe keeping, said Ken Robinson, senior adviser at Practical Financial Planning, an advisory firm located in Cleveland, Ohio. If any bills or regular monthly payments are not set up for auto-pay, consumers should also bring along their checkbook and addresses for where to send payments. Read more:How to find a contractor after a hurricaneBring along proof of assets It's a good idea to create a \"vital document locator,\" Ballard said. \"This is a simple document that details a summary of one's financial life in the event of a sudden loss,\" she said. Pack all insurance policies and deeds to any property or vehicle titles. “ Pack all insurance policies and deeds to any property or vehicle titles. ” Also bring bank and investment account statements, including contact information for the relevant financial institutions, information regarding any outstanding loans, tax returns from recent years and any paper stock certificates or bonds. A USB drive with photos or videos of any property to archive its conditions and contents prior to the disaster is also important to consider. This should be updated regularly, because it will serve as a vital resource when assessing any damages as a result of the natural disaster. The photos and videos also can be uploaded to a cloud service like Dropbox DBX, +3.66%  or Google Drive GOOG, +1.97%. Also see:Why trip insurance may not help if Hurricane Florence ruins your cruise vacationDon't rely on a safe - do rely on the cloud Empty your safe. While a water- and fire-proof safe is good to have, it's not foolproof. The safe and your home may both be destroyed, said Joshua Mungavin, a wealth manager at Evensky & Katz/Foldes Financial, a wealth management firm based in Coral Gables, Fla. “ The safe and home may both be destroyed. ” Safe deposit boxes at a bank are one option, but uploading those documents to the cloud is better, experts say. For $75 a year, Everplans provides an encrypted digital archive of financial and estate documents. It also allows users to designate a deputy who can gain access to the information if the account holder is somehow incapacitated. The digital note-taking service Evernote can also be used to upload and organize photos and documents, and Cryptee, an encrypted digital cloud service, also allows users to upload documents, photos and videos for safekeeping. A premium Evernote account costs $7.99 for each user per month, while Cryptee costs $3 a month for $10 gigabytes of storage. Free storage options include Google Drive and Dropbox.Consider carrying passwords with you If you're the type of person who saves their account passwords to their computer and then forgets about them, you need to have a back-up plan in place in case that computer is destroyed. But writing down a password on paper is an extremely risky proposition. One option is to save these passwords on an encrypted Microsoft Excel MSFT, +2.48%  spreadsheet on a password-protected USB drive. Alternatively, consumers should consider signing up for a password manager. Services like Dashlane or Lastpass only require users to know one password and can be accessed on the go using a mobile device. This story was updated on Aug. 24, 2020."}]}