{"article": [{"url": "https://www.marketwatch.com/story/dont-vote-for-a-killer-sharon-stone-endorses-biden-harris-as-coronavirus-ravages-her-family-2020-08-17", "published": 1597687880.0, "headline": "â\u0080\u0098Donâ\u0080\u0099t vote for a killer.â\u0080\u0099 Sharon Stone endorses Biden-Harris as coronavirus ravages her family", "body": "Sharon Stone sees the 2020 presidential election as a matter of life and death. The actress best known for â\u0080\u009cBasic Instinctâ\u0080\u009d revealed on Instagram FB, +0.26% Â over the weekend that her sister and brother-in-law are fighting for their lives in Montana after being diagnosed with COVID-19. Whatâ\u0080\u0099s more, her grandmother and godmother have both died from the coronavirus. So in a followup video posted to her Instagram page on Sunday, Stone, 62, called on her followers to vote for presumptive Democratic presidential nominee Joe Biden and his vice presidential pick, Kamala Harris, which is â\u0080\u009cthe only thing thatâ\u0080\u0099s gonna changeâ\u0080\u009d the coronavirus health crisis in the U.S. And while she didnâ\u0080\u0099t name President Donald Trump by name, she laid the more than 170,000 Americans whoâ\u0080\u0099ve died from COVID-19 since March (or more than 200,000 already, by the New York Timesâ\u0080\u0099 count) at his feet. “ â\u0080\u009cPlease vote. And please, whatever you do, donâ\u0080\u0099t vote for a killer.â\u0080\u009d ” Stoneâ\u0080\u0099s emotional 3Â½-minute video described how her sister Kelly had lupus before being diagnosed with COVID-19, meaning she was immunocompromised and vulnerable to the coronavirus. Kelly and her husband had quarantined at home, supposedly only venturing out to go to the pharmacy. But they still got sick, which Stone blamed on â\u0080\u009cone of you non-mask wearersâ\u0080\u009d in her previous Instagram post. She called out the people â\u0080\u009ccarrying gunsâ\u0080\u009d while protesting their â\u0080\u009cfreedomâ\u0080\u009d not to wear masks. She also blamed Montanaâ\u0080\u0099s testing policy, noting one must show symptoms of the virus in order to get tested, and test results can take five days to return â\u0080\u0094 which doesnâ\u0080\u0099t stop asymptomatic spread. Related:If every American started wearing a face mask today, this is how many lives could be saved â\u0080\u009cThis is the state of affairs in the middle of our country, where you, the people at the middle of our country, are at great risk of dying from COVID,â\u0080\u009d she said. â\u0080\u009cWhen they say there are tests for everyone, they are lying,â\u0080\u009d she continued. â\u0080\u009cWhen they say there are tests even for the nurses in the hospitals, they are lying. People are dying and fighting for their lives, because thereâ\u0080\u0099s nothing but lies.â\u0080\u009d Her post drew support from entertainers including Alyssa Milano, Katie Couric, Chelsea Handler and Janella Monae in the comments. It also drew plenty of flak from Trump supporters accusing her of using her familyâ\u0080\u0099s health to push a political agenda. It had racked up more than 1.17 million views as of Monday afternoon, ahead of the Democratic National Convention, and was being shared on Twitter TWTR, -0.23% Â as well. Stone wrapped her video by calling on viewers to vote for Biden and Harris. â\u0080\u009cWith women in power, we will fight for our families. We will fight for people to live. And we will fight for people to get tested,â\u0080\u009d she said. â\u0080\u009cBecause the only countries that are doing well with COVID are the ones that have women in leadership.â\u0080\u009d Stone is not the first to claim that the countries most affected by the coronavirus are run by men, and those with the best COVID-19 response are run by women. USA Today analyzed the Our World in Data database and found that the average number of deaths per million people by the end of July was, indeed, higher among male-led countries than women-led countries. And indeed, some female leaders have had success in flattening the curve in their countries, including New Zealand Prime Minister Jacinda Ardern, and Taiwan President Tsai Ing-wen. Related:â\u0080\u0098Weâ\u0080\u0099re all in this togetherâ\u0080\u0099: Dr. Fauci outlines how the U.S. can learn from other countries in the battle against COVID-19 Dr. Anthony Fauci also praised New Zealand and Singapore (run by its first female president, Halimah Yacob) and South Korea (which is run by a man) for having managed to control the coronavirus recently in an interview with actor Matthew McConaughey. But USA Today also noted that â\u0080\u009citâ\u0080\u0099s misleading and lacking context to say those successes and failures are solely due to gender,â\u0080\u009d and politics may have more to do with the success of a countryâ\u0080\u0099s response."}]}