{"article": [{"url": "https://www.marketwatch.com/story/diversify-almost-half-of-warren-buffetts-berkshire-hathaway-portfolio-is-comprised-of-a-single-stock-2020-07-07", "published": 1595075900.0, "headline": "Diversify? Almost half of Warren Buffettâ\u0080\u0099s Berkshire Hathaway portfolio is now composed of a single stock", "body": "Warren Buffett once said that â\u0080\u009cdiversification is protection against ignorance. It makes little sense if you know what you are doing.â\u0080\u009d The take-away: Load up on what you know. Even if itâ\u0080\u0099s a tech stock, apparently. A recent peek into Buffettâ\u0080\u0099s Berkshire Hathaway BRK.A, +0.06% BRK.B, +0.24% $214 billion portfolio underscores that the Oracle of Omaha is following his own advice, considering how much stock Berkshire has accumulated in Apple AAPL, +1.74%. Buffett, thanks to Appleâ\u0080\u0099s stellar run, now owns more than $91 billionâ\u0080\u0099s worth of the iPhone maker, which constitutes 43% of the total Berkshire pie, according to figures cited by the Motley Fool. As the report points out, there are 46 securities in the portfolio, and if you added them all together â\u0080\u0094 not including the No. 2 holding, Bank of America BAC, +0.47% â\u0080\u0094 they still donâ\u0080\u0099t equal the Apple stake, which proves just how much the big tech names have paced the stock market of late. Read:Heâ\u0080\u0099s 34 years old and owns $550 million worth of Apple Earlier this year, Buffett explained to CNBC how critical the Cupertino, Calif.â\u0080\u0093based technology behemoth is to Berkshireâ\u0080\u0099s overall performance. â\u0080\u009cI donâ\u0080\u0099t think of Apple as a stock. I think of it as our third business,â\u0080\u009d Buffett said, placing the iPhone maker alongside Berkshireâ\u0080\u0099s wholly owned subsidiaries Geico and BNSF. â\u0080\u009cItâ\u0080\u0099s probably the best business I know in the world.â\u0080\u009d Watch the interview: Buffettâ\u0080\u0099s Apple position was dinged a bit in Tuesdayâ\u0080\u0099s trading session, but it still outperformed the broader market, as the Dow Jones Industrial Average DJIA, +0.56%, S&P 500 SPX, +0.87% and tech-heavy Nasdaq Composite COMP, +1.39% all moved notably lower."}]}