{"article": [{"url": "https://www.marketwatch.com/story/housing-finance-regulator-to-require-multifamily-landlords-in-forbearance-to-notify-tenants-of-eviction-protections-2020-08-06", "published": 1596980120.0, "headline": "Landlords must notify tenants about eviction proceedings in multi-family buildings, housing regulator says", "body": "The Federal Housing Finance Agency is putting new rules in place to ensure that renters are aware of their rights during the pandemic. The regulator is now requiring any multifamily landlord who has entered a forbearance agreement on a loan backed by Fannie Mae FNMA, +0.73% or Freddie Mac FMCC, +0.52% to notify their renters about tenant protections. While in forbearance, multifamily property owners are not allowed to evict tenants or charge late fees solely for the nonpayment of rent. “Landlords in forbearance must notify their tenants that they cannot be evicted for nonpayment of rent due to the pandemic,” said FHFA director Mark Calabria said in the announcement, while noting that renters who can afford their monthly payments should continue to make them. In cases where rent isn’t paid, landlords are required by the FHFA to provide renters will flexible options for repayment rather than requiring a lump sum. When landlords do reach the point where they choose to evict a tenant, they must provide at least 30 days’ notice. Beyond now requiring tenant notifications, Fannie and Freddie are making changes to the online tools used to look up information on multifamily property loans. They are putting information about tenant protections on the tools’ landing pages and are making it easier for renters to find out if their building is backed by a Fannie or Freddie loan, which means they’re eligible for protections. Concerns have mounted in recent weeks that the U.S. could soon face a tidal wave of evictions. The federal eviction moratorium expired in July, and many local and state moratoriums are set to expire in the coming weeks. President Trump has said he may revive the federal moratorium with an executive order. The FHFA’s eviction moratorium was separate from the federal one."}]}