{"article": [{"url": "https://www.marketwatch.com/story/these-charts-show-one-possible-silver-lining-of-the-pandemic-2020-09-24", "published": 1601018120.0, "headline": "These charts show one possible silver lining of the pandemic", "body": "Maybe this winter won’t be so bad after all. While the U.S. and other countries in the Northern Hemisphere brace for a possible twindemic of COVID-19 and influenza toward the end of the year, south-of-the-Equator countries such as Australia, Argentina and South Africa offer a ray of hope: They just had one of their mildest flu seasons. These charts from the Economist show that the Southern Hemisphere, where the winter flu season runs from May to October, has seen a steep decline in the number of influenza infections and deaths so far this year compared with the previous five years. The World Health Organization processed 200,000 influenza tests in the first two weeks of August; just 46 were positive this year, compared with almost 3,500 during a typical year. And while about 86,000 Australians test positive for the flu on average between May and mid-August each year, with around 130 dying, the government only recorded 627 influenza cases and a single death during the same window this year. Check out some of the charts below. iframe.twitter-tweet { width: 100% !important; } iframe.twitter-tweet { width: 100% !important; } The Economist and some health experts, including Dr. Anthony Fauci, credit the social-distancing and personal hygiene measures taken to stop the spread of the coronavirus from also stemming the annual tide of flu outbreaks in the Southern Hemisphere. There is a concern, however, that as people grow lax in wearing face masks and avoiding crowds, and schools and businesses reopen, that the flu could spread. Indeed, the Economist notes that flu cases could also still spike in the Southern Hemisphere this year and next, since fewer people have developed immunities to this year’s strain. So health experts from the Centers for Disease Control and Prevention and the American Academy of Pediatrics are pushing for all Americans over 6 months old to get flu shots this year to further minimize their chances of getting sick. The U.S. flu season generally begins in October before peaking between December and February. CDC director Robert Redfield recently warned that America is bracing for “the worst fall, from a public health perspective, we’ve ever had” if both COVID-19 and flu cases overwhelm hospitals. The flu has sent between 140,000 and 810,000 Americans to the hospital each year since 2010 and is responsible for between 12,000 and 61,000 deaths a year. Related:Vaccinating children against the flu is ‘more important than ever’ this year: pediatricians Fauci, the director of the National Institute of Allergy and Infectious Diseases, also cited the Southern Hemisphere’s historically mild flu season during a congressional hearing on the nation’s coronavirus response on Wednesday. “If we continue to do what each of us have been saying — regarding the kinds of preventive measures of mask wearing, social distancing, avoiding crowds, washing hands, etc. — if we do that as we get into the fall and the winter, for the purpose of COVID-19, it is likely to have a positive impact on the infection rate of influenza,” he said. “Because our colleagues in the Southern Hemisphere, particularly in Australia, have found because of that, they’ve had a very, very low, mild influenza season.” So if Americans practice these public health measures and get their flu vaccines, he said, “hopefully we can have a very, very low level of flu that would not then complicate what will clearly be a challenge in the winter with COVID-19.” Fauci in that same hearing got into a heated exchange with Sen. Rand Paul, accusing the Kentucky Republican of repeatedly “misconstruing” COVID-19 research and “not listening” to the CDC. Follow MarketWatch’s coronavirus coverage here."}]}