{"article": [{"url": "https://www.marketwatch.com/story/stock-market-bulls-should-consider-owning-gold-as-an-insurance-policy-2020-08-05", "published": 1596646040.0, "headline": "Stock market bulls should consider owning gold as an insurance policy", "body": "This article is in response to questions after I predicted gold was on its way to $3,000 an ounce. Gold has risen above $2,000 for the first time since the prediction. Gold, in addition to being an investment by itself and a substitute for fiat currencies, should also be considered by stock market investors as insurance. Let’s explore the issue. If you review gold ETF GLD, +1.81% you’ll note the following: • From a technical perspective, gold has broken out after a long base, which is considered bullish. • RSI (relative strength index) has traced a very bullish pattern. • I have received quite a bit of hate mail from stock market investors who do not believe in gold and consider it a worthless yellow piece of metal. Many quote Warren Buffett’s dislike for gold. • In many ways, this call on gold is similar to the call I made on the stock market. When the Dow Jones Industrial Average DJIA, +0.56% was in the 16,000-point range, my call was for the Dow to reach 30,000. Please see “Here’s the case for Dow 30,000 in Trump’s first term.” • I do have a track record with gold. I made a call on gold when it was in the $600 range. • Gold is not going to go up to $3,000 in a straight line. Gold is very overbought in the short term. When a commodity gets overbought, it is vulnerable to a pullback. Insurance Even stock market bulls who normally do not invest in gold may consider buying it on a pullback as insurance for their stock market portfolios. Here are a few scenarios to consider: • The present policies of money printing by the Federal Reserve and massive borrowing by the government may debase the U.S. dollar. Gold is priced in U.S. dollars. As the dollar weakens, initially both the stock market and gold will benefit. In the longer term, gold will continue to benefit from a weaker dollar, but the U.S. stock market may be hurt. • If the economy worsens, real interest rates may go lower. This will benefit gold at a time when the stock market may go lower. • Gold works in both deflationary and inflationary environments. If the stock market goes lower because of deflation, gold may act as good insurance. • If inflation heats up, in the long run the stock market may fall but gold may benefit. • The stock market is in a bubble. The Arora Report’s call has been that the bubble will get bigger. If at some point the stock market bubble bursts, gold will benefit. • If the stock market falls due to a geopolitical event, a rush to safety will benefit gold.Caution There are some scenarios in which gold as an insurance for the stock market will not work and gold as an investment may also not work. Investors can easily experience large losses in gold. Here are five scenarios: • If interest rates rise, gold may fall. • If the dollar rises, gold may fall. • Gold is often sold at times of distress in the stock market as investors sell anything they can to meet margin calls. • Central banks hold large amounts of gold. It is conceivable that central banks may start selling their gold. • Gold is a very small market and it can be easily manipulated by the governments. For the foregoing reasons, it is important to properly do the following: • Portfolio structure. • Allocation to gold. • Changes to the portfolio with market conditions. • Scaling into gold. • Risk controls. Disclosure: Arora Report portfolios have positions in Apple, Amazon, Alphabet, Microsoft and Facebook. Nigam Arora is the founder of The Arora Report, which publishes four newsletters. He can be reached at Nigam@TheAroraReport.com."}]}