{"article": [{"url": "https://www.marketwatch.com/story/top-brexit-negotiator-says-uk-not-afraid-to-walk-away-without-deal-with-eu-2020-09-06", "published": 1599424880.0, "headline": "U.K. will quit Brexit talks if no deal agreed upon by Oct. 15, Boris Johnson says", "body": "LONDON — British Prime Minister Boris Johnson talked tough on Sunday ahead of a crucial round of post-Brexit trade talks with the European Union, saying Britain could walk away from the talks within weeks and insisting that a no-deal exit would be a “good outcome for the U.K.” With talks deadlocked, Johnson said an agreement would only be possible if EU negotiators are prepared to “rethink their current positions.” The EU, in turn, accused Britain of failing to negotiate seriously. Britain left the now 27-nation EU on Jan. 31, three-and-a-half years after the country narrowly voted to end more than four decades of membership. That political departure will be followed by an economic break when an 11-month transition period ends on Dec. 31 and the U.K. leaves the EU’s single market and customs union. Without a deal, the New Year will bring tariffs and other economic barriers between the U.K. and the bloc, its biggest trading partner. Johnson said the country would “prosper mightily” even if Britain had “a trading arrangement with the EU like Australia’s” — the U.K. government’s preferred description of a no-deal Brexit. British chief negotiator David Frost and his EU counterpart Michel Barnier are due to meet in London starting Tuesday for their eighth round of negotiations. Barnier said last week he was “worried and disappointed” by the lack of progress and said the U.K. had not “engaged constructively.” The key sticking points are European boats’ access to U.K. fishing waters and state aid to industries. The EU is determined to ensure a “level playing field” for competition so British firms can’t undercut the bloc’s environmental or workplace standards or pump public money into U.K. industries. Britain accuses the bloc of making demands that it has not imposed on other countries it has free trade deals with, such as Canada. Frost told the Mail on Sunday newspaper that Britain was “not going to compromise on the fundamentals of having control over our own laws.” “We are not going to accept level playing field provisions that lock us in to the way the EU do things,” he said. In another sign of potential trouble ahead, the Financial Times reported that Johnson’s government was planning domestic legislation that would water down commitments to maintaining an open border between the U.K.’s Northern Ireland and EU member Ireland that it has already signed up to. The border guarantee was a key part of the legally binding divorce agreement made between Britain and the bloc last year. British Brexit supporters hate the agreement because it means keeping Northern Ireland aligned to some EU rules and regulations. But any move to undermine it would infuriate the EU and threaten the trade talks. “This would be a very unwise way to proceed,” tweeted Irish Foreign Minister Simon Coveney. The British government said it was working “in good faith” to implement the agreed border provisions but was “considering fallback options in the event this is not achieved.” The EU says a deal has to be struck before November to allow time for parliamentary approval and legal vetting before the transition period expires. Johnson gave an even shorter deadline in remarks he’s due to deliver on Monday, saying an agreement needed to be sealed by an EU summit scheduled for Oct. 15. “If we can’t agree by then, then I do not see that there will be a free trade agreement between us, and we should both accept that and move on,” he said in the comments, which were released in advance by his office. Without a deal, British freight firms have warned there could be logjams at ports and supplies of key goods in Britain could be “severely disrupted” starting Jan. 1. French Foreign Minister Jean-Yves Le Drian said Sunday that talks were “not going well” and dismissed British attempts to drive a wedge between EU nations on issues such as fishing. Le Drian said the 27 nations remained united. “We would prefer a deal, but a deal on the basis of our mandate,” he told France Inter radio. “There is room for action, but the whole package, including the fishing package, needs to be taken up in order to avoid a ‘no deal.’”"}]}