{"article": [{"url": "https://www.marketwatch.com/story/the-great-return-how-to-get-the-wealthy-to-come-back-to-new-york-city-2020-08-07", "published": 1596801920.0, "headline": "The Great Return: How to get the wealthy to come back to New York City?", "body": "Gov. Andrew Cuomo and Mayor Bill de Blasio don’t agree on much these days, but they are singing one verse of harmony: It sure would be nice if some of New York’s wealthiest COVID-19 refugees would come back home. Leave their Hamptons hideaways. Exit their Hudson Valley quarantines. Depart their Connecticut weekend manses, return to New York City, and start paying their full share of taxes again. But that, right there, is where the sweet song ends. When it comes to making the Great Return actually happen or deciding what it even means, New York’s two top leaders are at each other’s throats again. Cuomo is sounding like a frustrated maître d’, not quite able to usher the big tippers back to what had been their usual tables. “I literally talk to people all day long who are now in their Hamptons house and also lived here,” the governor bemoaned to reporters in the city. “And I say, ‘You gotta come back. When are you coming back? We’ll go to dinner. I’ll buy you a drink. Come over. I’ll cook.” He must have a lot of rich friends! See: ‘I can’t believe this is America.’ Confronted with unprecedented need, New York food pantries try to fill in the gaps But even the promise of chicken cacciatore alla Andrew hasn’t been enough to drag these well ensconced refugees back to New York City. “They’re not coming back right now,” Cuomo insisted. “And you know what else they’re thinking? ‘If I stay there,’ they pay a lower income tax because they don’t pay the New York City surcharge.” So the last thing the city and the state should be thinking about right now is raising rich folks’ taxes. Or so Cuomo argues. That could convince some of the Richie Riches to stay away for good. But to the city’s progressive mayor, those are fighting words. “Fair-weather friends,” de Blasio grumbled about selfish city dwellers who are hiding out of town until a vaccine is found and the recent crime wave blows over. “This city is for New Yorkers who live here, who work here and fight to stay here,” the mayor sniffed. “We must build our policy around all New Yorkers…We don’t make decisions based on the wealthy few. I was troubled to hear that concept.” If people with money want a voice in the city’s future, de Blasio suggested, they should get their butts back to the boroughs right now. Also read: Mortgage applications for suburban homes are surging as buyers try to escape the coronavirus pandemic These are tough times, the mayor emphasized. The city budget is a disaster area. People rich enough to have two or three homes—should they really be ducking the city income-tax surcharge by temporarily shifting their residences? If they were spending money like they used to, at least the city would be getting its share of the sales taxes. “The rich are getting richer,” de Blasio said, summing up his argument. “Wealthy New Yorkers can afford to pay a little bit more so all of us can get through this crisis.” This is much more than a stylistic debate, Cuomo’s tough love versus de Blasio’s no love at all. It’s more than philosophical, a mainstream progressive versus an uber one. What’s at stake here really is the economic engine of New York. It’s a fact of urban living: Cities are expensive to operate. You have to pay the bills somehow. The money only comes from people who have it. But unless that money gets here soon, the state will face budget cuts in the 20% range, enough to devastate school aid, subway subsidies and all kinds of other vital services. The city cuts could be even sharper. Cuomo estimated that the health crisis — the extra cost and lower revenue — has blown a $30-billion hole in the next two state budgets. And every indication is the Great Return is still a good ways off. There is no other way to read the real estate sales data released late Thursday by the Manhattan broker Douglas Elliman and appraiser Miller Samuel. Signed contracts for co-ops and condos were down 57%, July to July, and the upper end of the market got especially slammed. In the $4 million to $10 million category, sales agreements were off 75%. Meanwhile, things were really humming in the ’burbs, the beaches and the country. Also see: Southampton concert featuring Chainsmokers, Goldman Sachs chief could result in fines, criminal penalties Contracts doubled in Westchester, doubled in the Hamptons, even more than that in nearby Connecticut. “Anything within a two-hour radius of the city is as busy as it’s ever been,” said Scott Durkin, president of Douglas Elliman. “There’s just this fear of density right now.” “They all tell the same story,” said Miller Samuel boss Jonathan Miller. “The outlying areas around the city are benefiting from outbound migration of Manhattan specifically.” So here’s the next sign to be looking for, though this being Manhattan it may never come. When do prices begin to tumble? The one thing the real estate people didn’t mention were any three-bedroom units on Park Avenue being offered at half price. No mention of that at all. Ellis Henican is an author based in New York City and a former newspaper columnist."}]}