{"article": [{"url": "https://www.marketwatch.com/story/analyst-sees-less-than-5-revenue-hit-for-facebook-as-diageo-and-starbucks-join-list-of-companies-halting-ads-2020-06-29", "published": 1593861320.0, "headline": "Hereâ\u0080\u0099s the revenue hit Facebook will take as Diageo and Starbucks join the list of companies pulling ads from platform", "body": "Diageo and Starbucks just became the latest companies to halt advertising on social-media platforms over ineffective policing of hate speech. Shares of Facebook Inc. FB, +0.26%, which operates Instagram and WhatsApp in addition to its namesake platform, erased early losses to rise 0.6% in midday trading, while Twitter Inc. shares TWTR, -0.23% Â rallied about 2%. Both stocks took big hits Friday after other advertisers paused spending. â\u0080\u009cDiageo DGE, -0.27% strives to promote inclusion and diversity, including through our marketing campaigns. From 1 July we will pause all paid advertising globally on major social-media platforms. We will continue to discuss with media partners how they will deal with unacceptable content,â\u0080\u009d the U.K.-based spirits and beers maker said in statement. On Sunday, coffee giant Starbucks SBUX, +0.53% Â said it was â\u0080\u009cpausingâ\u0080\u009d advertisements on all social-media platforms, and would â\u0080\u009ccontinue discussions internally, with our media partners and with civil-rights organizations in the effort to stop the spread of hate speech.â\u0080\u009d On Friday, Unilever UN, +2.49% ULVR, +0.70% Â said it would halt U.S. advertising on Facebook and Twitter through year-end. Its Ben & Jerryâ\u0080\u0099s ice-cream unit had previously announced a Facebook ad pullout. Coca-Cola KO, +0.69% Â said on Friday that it would â\u0080\u009cpause paid advertising on all social-media platforms globally for at least 30 days.â\u0080\u009d On Saturday, another iconic American brand, Levi Strauss & Co. LEVI, -2.24%, Â announced on Twitter that it, too, it would pause ads on Instagram and Facebook: iframe.twitter-tweet { width: 100% !important; } Late Friday, Facebook Chief Executive Mark Zuckerberg announced policy changes, during a â\u0080\u009cvirtual town hall,â\u0080\u009d to hide or block content considered hateful or that could harm voting, with no exception for politicians, an approach Twitter has previously applied to the high-profile account of President Donald Trump and others. Twitter hasnâ\u0080\u0099t been as consistently a target of the boycott call but has come under a new wave of scrutiny, and shares have fallen alongside those of Facebook. â\u0080\u009cWe invest billions of dollars each year to keep our community safe and continuously work with outside experts to review and update our policies,â\u0080\u009d a Facebook spokesman said Monday. â\u0080\u009cWe know we have more work to do.â\u0080\u009d The spokesman added that the company will continue to work with civil rights groups and other experts â\u0080\u009cto develop even more tools, technology and policies to continue this fight.â\u0080\u009d Twitterâ\u0080\u0099s vice president for global client solutions Sarah Personette said in a statement that the companyâ\u0080\u0099s mission â\u0080\u009cis to serve the public conversation and ensure Twitter is a place where people can make human connections, seek and receive authentic and credible information, and express themselves freely and safely.â\u0080\u009d She added that Twitter is â\u0080\u009crespectful of our partnersâ\u0080\u0099 decisions and will continue to work and communicate closely with them during this time.â\u0080\u009d Read:Facebookâ\u0080\u0099s Zuckerberg was reportedly talked out of making moves against Trump as far back as 2015 The boycotts stem from a #StopHateforProfits campaign announced by a coalition of civil-rights and other groups, including the Anti-Defamation League and the National Association for the Advancement of Colored People, which has asked Facebook advertisers to show that they wonâ\u0080\u0099t support companies that prioritize profits over safety. Since the launch of the campaign, the list of companies opting to pause advertising is growing, but Facebook is still looking at less than a 5% hit to revenue, said Rohit Kulkarni, executive director at MKM Partners, in a note to clients. Firstly, he said Facebook makes the bulk of its revenues from mobile direct ads and small-business marketing. â\u0080\u009cFB has more than 160 million registered businesses globally and 8 million paying advertisers,â\u0080\u009d said Kulkarni, who noted that Ad Ageâ\u0080\u0099s 100 biggest advertisers spend less on a proportionate basis with Facebook. â\u0080\u009cProcter & Gamble PG, +0.89% Â is the largest advertiser in the world, but we think it accounts for less than 0.50% of FBâ\u0080\u0099s revenues,â\u0080\u009d Kulkarni said. Due to COVID-19, he said MKM had already expected leading advertisers to scale back on spending in the second half of this year, â\u0080\u009cimplying a lower marginal headwindâ\u0080\u009d for Facebook. Wall Street is estimating 1% year-over-year growth in the second quarter and 7% in the third. â\u0080\u009cWe believe near-term Street estimates are reasonable and that there is upside potential given ad market recovery.â\u0080\u009d He said Snapchat parent Snap Inc. SNAP, -0.18% Â could benefit from â\u0080\u009cnear-term uncertainty with advertiser policies related to [Alphabet-owned GOOGL, +1.82% Â GOOG, +1.97% Â YouTube] and Instagram.â\u0080\u009d Tim Rostan contributed to this report."}]}