{"article": [{"url": "https://www.marketwatch.com/story/as-schools-reopen-amid-covid-19-pandemic-how-long-do-asymptomatic-children-remain-contagious-11599043219", "published": 1599732980.0, "headline": "Asymptomatic children who contract COVID-19 may 'shed' coronavirus for weeks", "body": "Children around the world are going back to school, raising a new set of challenges for teachers, families and public-health care authorities. (Photo: Owen Humphreys/Zuma Press) Should families double down on social distancing now that their kids are going back to school? A new study published in JAMA Pediatrics suggests that children can spread SARS-CoV-2, the virus that causes COVID-19, even if they never develop symptoms or even long after symptoms have cleared. It found a significant variation in how long children continued to \"shed\" the virus through their respiratory tract and, therefore, could potentially remain infectious. While the virus was detectable for an average of about 2.5 weeks in the entire group, a significant portion of the children -about a fifth of the asymptomatic patients and about half of the symptomatic ones - were still shedding virus at three weeks, meaning they were releasing it into the environment. The researchers also found that the duration of COVID-19 symptoms also varied widely, from three days to nearly three weeks. A recent systematic review estimated that 16% of children with a SARS-CoV-2 infection are asymptomatic, but evidence suggests that as many as 45% of pediatric infections are asymptomatic, according to the U. S. Centers for Disease Control and Prevention. The signs and symptoms of COVID-19 in children are similar to other infections and noninfectious processes, including influenza, according to the CDC. Such research comes at an important time for communities. Under pressure from the teachers union to delay the start of the school year. While children infected with SARS-CoV-2 are less likely than adults to develop severe illness or complications, they are still at risk of becoming ill. \"Recent COVID-19 hospitalization surveillance data shows that the rate of hospitalization among children is low (8 per 100,000 population) compared with that in adults (164.5 per 100,000 population),\" the CDC said. Such research comes at an important time for families and communities. Under pressure from the teachers union to delay the start of the school year, New York City Mayor Bill de Blasio announced Tuesday that in-person classes will be pushed back until Sept. 21, 11 days later than planned. Remote learning, also originally slated to start on Sept. 10, will now commence on Sept. 16. Other countries have not fared so well with school reopenings. Israel, which also reopened schools this week, had less success when it reopened schools on May 17 amid high temperatures that made it difficult for students to wear masks, full classrooms that made social distancing near-impossible and, perhaps, the illusion that the virus had been vanquished, creating a false sense of security. The risk, as Israel discovered, is providing an environment where children unwittingly spread the virus to each other, which can lead to community transmission. That's particularly worrying for those who have underlying conditions, and the elderly, who are more vulnerable to the most severe effects of the virus. Community transmission also makes contact tracing more difficult. A school outbreak can lead to community spread, hence the need for staggered school reopenings, social distancing and reduced class sizes. \"If we find a certain number of symptomatic people testing positive, we expect the same number of asymptomatic carriers that are much more difficult to identify and isolate,\" said Enrico Lavezzo, a professor in the University of Padua's department of molecular medicine, who coauthored a study released in June of a quarantined town in Italy.Children may shed virus for weeks The latest study in the peer-reviewed JAMA Pediatrics focused on 91 pediatric patients at 22 hospitals in South Korea. \"Unlike in the American health system, those who test positive for COVID-19 in South Korea stay at the hospital until they clear their infections even if they aren't symptomatic,\" said Roberta DeBiasi, chief of the Division of Infectious Disease at the Children's Hospital in Washington, D.C. The patients were identified for testing through contact tracing or after developing symptoms. About 22% never developed symptoms, 20% were initially asymptomatic but developed symptoms later, and 58% were symptomatic at their initial test. The hospital staff tested them every three days on average, providing a picture of how long viral shedding continues over many weeks. Among the important findings from the study: Children, a group widely thought to develop mostly mild disease that quickly passes, can shed virus for weeks, DeBiasi and Meghan Delaney, chief of the Division of Pathology and Lab Medicine at the Children's National Hospital in Washington, D.C., wrote in a commentary piece to accompany the study in JAMA Pediatrics. There were a large number of asymptomatic children: About one-fifth of the group of children studied across 22 South Korean hospitals. Other key points: Even asymptomatic children continued to shed coronavirus after testing positive, making them potential key vectors. In this study at least, there were a large number of asymptomatic patients: About one-fifth of the group in South Korean hospitals. Researchers said the study provides important insight on the role children might play in the spread of COVID-19. But the study also had obvious limitations. One of these relates to the link between testing and transmission. A \"positive\" or \"negative\" result may not necessarily mean that a child is infectious, \"with some positives reflecting bits of genetic material that may not be able to make someone sick,\" or, on the other hand, \"negatives reflecting low levels of virus that may still be infectious.\" Researchers may have tested different parts of the respiratory tract and different testers may yield different results. It's unclear whether symptomatic children shed different quantities of virus than symptomatic patients. They tested for the active virus - not antibodies - excluding those who may have had and cleared an asymptomatic or mild infection, an important factor for understanding herd immunity. However, DeBiasi said studies such as these can add to the knowledge of public-health efforts being developed and refined to bring COVID-19 under control. \"Each of these pieces of information that we, our collaborators and other scientists around the world are working to gather is critical for developing policies that will slow the rate of viral transmission in our community,\" she said.Coronavirus update As of Thursday, COVID-19 had infected 27,902,002 people worldwide, which mostly does not account for asymptomatic cases, and killed 904,485. The U.S. still has the world's highest number of COVID-19 cases (6,363,437), followed by India (4,465,863), Brazil (4,197,889) and Russia (1,042,836), according to data aggregated by Johns Hopkins University. The Dow Jones Industrial Index DJIA, +0.75%, the S&P 500 SPX, +0.75% and the Nasdaq Composite COMP, +1.39% opened higher Thursday. U.S. stocks, particularly in the technology sector, broke a losing run this week. But doubts about traction for further fiscal stimulus from Washington may be one persistent factor discouraging investors."}]}