{"article": [{"url": "https://www.marketwatch.com/story/european-stocks-reach-for-modest-gains-amid-virus-worries-2020-08-17", "published": 1597657880.0, "headline": "European stocks reach for modest gains amid virus worries", "body": "European stocks traded mixed at the start of a new week, as investors kept an eye on rising coronavirus cases on the continent and around the globe. The Stoxx Europe 600 Index SXXP, +0.55% was fractionally up 0.1% at 368. The index closed up 1.24% for last week as a whole, but on Friday dropped 1.2%. The German DAX 30 DAX, +0.06%, the French CAC 40 PX1, +0.71% and the FTSE 100 index UKX, +0.64% UKX, +0.64% rose 0.2% each. Friday’s losses stemmed from weakness across travel stocks, after the U.K. added France to its quarantine list, which triggered a rush of tourists returning from that country. Several European countries, including France and Spain, are battling rising cases as the summer wears on. Spain imposed new restrictions over the weekend, closing nightclubs and limiting public smoking in a bid to reverse spiking cases. After losing ground on Friday, shares of British Airways owner IAG IAG, -3.72%, Deutsche Lufthansa LHA, -1.71% and Ryanair Holdings RYA, -2.60% fell 3.08%, 1.62% and 0.69% respectively. In the same travel category, shares of Intercontinental Hotels IHG, +1.35% and travel operator TUI AG TUI, -0.92% were down 1.74% and 3.97%. Neil Wilson, chief market analyst for Markets.com, said the number of new COVID-19 cases across Europe is the number one thing to watch in the coming days, as it has the potential to send nascent economic recovery into reverse. “Germany has extended travel warnings to nearly all of Spain, which while making it easier to grab a sun lounger is taking the shine off travel and leisure stocks again this morning.” U.S. stock futures YM00, +0.82% were rising. On Friday, the Dow Jones Industrial Average DJIA, +0.56% booked a weekly gain of 1.8%, finishing about 5.5% from its Feb. 12 record close, and the S&P 500 SPX, +0.87% rose 0.6%. The Nasdaq Composite Index COMP, +1.39% finished barely positive for the week, up 0.1%, but has posted 32 records so far in 2020. Investors are struggling to find reasons to keep pushing stocks higher, as global coronavirus cases climb and economies flounder — the U.S. is one of the hardest-hit countries. Not helping has been a failure by U.S. politicians to reach agreement over much-needed coronavirus stimulus. Also, Reuters reported that the U.S. and China canceled a phase one trade deal review on Saturday, due to scheduling issues, and no date was set for talks. The economic calendar is light this week, but Friday will bring important flash purchasing managers index surveys for August from Europe. The Federal Reserve and European Central Bank will also release minutes from recent meetings."}]}