{"article": [{"url": "https://www.marketwatch.com/story/gold-prices-aim-for-fifth-record-in-a-row-as-bullion-enters-euphoric-phase-of-rally-silver-surges-over-5-too-2020-08-06", "published": 1596727100.0, "headline": "Gold prices log fifth record in a row as bullion enters â\u0080\u0098euphoric phaseâ\u0080\u0099 of rally", "body": "Gold futures on Thursday extended a record rally to a fifth straight day, with a muted U.S. dollar and lackluster moves in equities supporting bullionâ\u0080\u0099s ascent to near $2,100. Doubts about the complexion of the coming jobs report on Friday also underpinned bids for bullion. â\u0080\u009cGold price continues to skyrocket as demand for the precious metal surges,â\u0080\u009d wrote Carlo Alberto De Casa, chief analyst at ActivTrades, in a daily note. December gold GCZ20, +2.17% GC00, +2.17% rose $20.10, or 1%, to $2,069.40 an ounce, registering its fifth straight record close after a 1.4% gain for bullion. Appetite for precious metals, including silver, has been resurgent, with both gold and its sister white metal, as well as securities pegged to the commodities, on a tear in recent weeks as the COVID-19 pandemic has delivered a seismic blow to international economies. On Thursday, gold rose amid indecision by U.S. lawmakers over the path toward another coronavirus relief package, even as weekly jobless benefit claims improved somewhat. New applications for unemployment benefits, a rough gauge of layoffs, slipped for the first time in three weeks to 1.19 million from 1.44 million, the Labor Department said Thursday. It was the biggest one-week decline since early June and sets the stage for the nonfarm payrolls report in less than 24 hours. â\u0080\u009cGold is surging once again after better-than-expected jobless claims, real yields resume their freefall, and as lawmakers struggle to make further progress on stimulus talks,â\u0080\u009d wrote Edward Moya, senior market analyst at Oanda, in a daily research note. Central banks and governments have unfurled unprecedented stimulus measures to lessen the economic harm from the viral outbreakâ\u0080\u0094an environment that has thus far proven ideal for both gold and sliver to draw bids for investors seeking the perceived safety of those assets. Meanwhile, the Bank of England on Thursday said that it would take longer for the U.K. economy to recover its precrisis levels than had initially been predicted, warning it may now be the end of 2021 rather than the second half of next year. â\u0080\u009cWhile demand from the jewelry sector is muted by the Covid crisis, we are witnessing an euphoric phase, where investors are not considering technical indicators or fundamentals as they are simply focused on increasing their positions on gold,â\u0080\u009d De Casa wrote. â\u0080\u009cThe prevailing uncertainty along with growing expectations for further dovish actions by central banks is likely to fuel this phase,â\u0080\u009d he wrote. Meanwhile, VanEck, the firm that was one of the first to roll out gold-backed funds, is calling for gold to touch $3,400 an ounce. September silver US:SIU20, meanwhile, rose $1.51, or 5.6%, to reach $28.40 an ounce, following a 3.3% rally on Wednesday, which put goldâ\u0080\u0099s sister metal at its highest finish since 2013, according to Dow Jones Market Data. Gains for silver and gold come as the dollar was trading flat. The ICE U.S. Dollar Index DXY, -0.58% was less than 0.1% lower at 92.811, against a basket of a half-dozen currencies. Stock markets also were tilting higher with the Nasdaq Composite on track for its 32nd record close of 2020. Elsewhere on Comex, September copper US:HGU20 Â lost a little over half a cent, or 0.2%, lower at $2.9105 a pound. October platinum PLV20, +3.99% Â traded $24.80, or 2.5%, higher to settle at $1,013.90 an ounce, while September palladium US:PAU20 gained $43.90, or 2%, to end at $2,259.40 an ounce."}]}