{"article": [{"url": "https://www.marketwatch.com/story/coronavirus-contact-tracing-gets-off-to-a-bumpy-start-in-new-york-city-2020-06-21", "published": 1592774840.0, "headline": "Coronavirus contact tracing gets off to a bumpy start in New York City", "body": "NEW YORK — New York City’s effort to stop the spread of the coronavirus through contact tracing has been hampered by the reluctance of many people who are infected with the virus to provide information to tracers, according to a report in The New York Times. The Times report said just 35% of the 5,347 city residents who tested positive or were presumed positive for COVID-19 in the first two weeks of the contact tracing program gave information about their close contacts. Perry N. Halkitis, dean of the School of Public Health at Rutgers University, called the 35% rate for eliciting contacts “very bad.” “For each person, you should be in touch with 75 percent of their contacts within a day,” Halkitis told the Times. Dr. Ted Long, head of New York City’s new Test and Trace Corps, defended the program Sunday and said 69% of the people who complete an interview provide contacts. “We think that’s a strong start but we also do want to get that number up,” Long told The Associated Press. Long said the 35% figure cited by the Times represents a percentage everyone who the tracers reached, and some of those people, including some who have not had COVID-19 symptoms for weeks, don’t have relevant contacts to provide. Long said he believes the program, which started June 1, will be more successful when tracers start going to people’s homes in the next week or two rather than relying on the phone. New York City has made huge strides in containing the outbreak since the coronavirus shutdown started in March, with more than 320 new cases reported on Thursday, down from several thousand a day during the peak. But officials say the contact tracing effort is crucial to preventing a resurgence as the city enters the second phase of easing coronavirus restrictions on Monday, including outdoor dining at restaurants and in-store retail shopping. Mayor Bill de Blasio said he expects as many as 300,000 more people to return to their jobs during Phase 2. Gov. Andrew Cuomo confirmed that the city is on track to start Phase 2 of reopening on Monday and said in a news release that 15 deaths were attributed to COVID-19 across the state on Saturday. That is the state’s lowest death toll since the early days of the outbreak in March."}]}