{"article": [{"url": "https://www.marketwatch.com/story/apple-wins-eu-court-battle-over-unpaid-irish-tax-bill-of-15-billion-2020-07-15", "published": 1594875800.0, "headline": "Apple wins EU court battle over unpaid Irish tax bill of $15 billion", "body": "Technology giant Apple AAPL, +1.74% has won its court battle with the EU over a disputed €13 billion ($15 billion) tax bill. The European Union Commission didn’t show sufficient evidence to back up a 2016 ruling that Apple’s businesses in Ireland were granted unfair tax advantages, the court said. The General Court of the European Union, one of Europe’s highest courts, annulled the ruling, which had ordered Ireland to recover the money. It said Ireland would have to recover taxes from Apple covering the years 2003-2014 of €13 billion plus interest. The Commission launched a state aid investigation in 2014 that said the tax paid by two Irish incorporated arms of Apple, Apple Sales International, and Apple Operations Europe, “didn’t correspond to economic reality.” It said Apple Sales International had paid corporation tax in Ireland at a rate of 1% in 2003, declining to 0.005% by 2014. Read:Apple may face $14.5 billion tax bill after EU rules Irish deal is illegal But on Wednesday the General Court said the Commission didn’t show sufficient evidence that there was an unfair advantage in violation of the European Union’s state aid laws. “The Commission didn’t succeed in showing to the requisite legal standard that there was an advantage for the purposes of Article 107(1) TFEU (a law against anticompetitive government subsidies that undermine the competitiveness of the European Union internal market),” the court said. Apple welcomed the ruling. “We thank the General Court for their time and consideration of the facts. We are pleased they have annulled the Commission’s case,” it said. “We’re proud to be the largest taxpayer in the world as we know the important role tax payments play in society. Apple has paid more than $100 billion in corporate income taxes around the world in the last decade and tens of billions more in other taxes,” it added. Read:Apple hits back at EU’s tax order The European Commission can appeal the decision in the European Court of Justice, and Executive Vice President Margrethe Vestager said the Commission will be considering next steps. “Today’s judgment by the General Court annuls the Commission’s August 2016 decision that Ireland granted illegal state aid to Apple through selective tax breaks. We will carefully study the judgment and reflect on possible next steps,” said Vestager, who is the European Commissioner for Competition. “The Commission stands fully behind the objective that all companies should pay their fair share of tax,” she added. The money will remain in a holding account while the parties wait for certainty about whether there will be an appeal against the ruling. A commission spokeswoman told reporters on Wednesday it would evaluate whether to appeal but did not say how long that would take. The ruling is one of many that have come in front of the court as Vestager seeks to crack down on so-called sweetheart tax deals between companies and countries in the European single market. In 2019 the court annulled a decision by the Commission ordering the Netherlands to recover up to €30 million in back taxes from Starbucks SBUX, +0.53%. Meanwhile, it upheld a decision that Fiat FIAT, had received tax advantages that broke European state aid laws. Wednesday’s ruling could impact ongoing investigations into tax deals between the Netherlands and Nike NKE, +0.97% and IKEA."}]}