{"article": [{"url": "https://www.marketwatch.com/story/why-investors-should-sell-stocks-now-to-get-ready-for-the-big-rally-thats-coming-2020-08-18", "published": 1597756460.0, "headline": "Why investors should sell stocks now to get ready for the big rally thatâ\u0080\u0099s coming", "body": "Stocks are looking up on Tuesday, beating back a bevy of concerns â\u0080\u0094 Washington-Beijing tensions, the lack of a U.S. coronavirus stimulus package, and Europeâ\u0080\u0099s virus resurgence. The optimists helped push the Nasdaq Composite COMP, +1.39% Â to log another record on Monday, while some see a new S&P 500 SPX, +0.87% Â high coming by the end of August. (The first intraday high in six months for the S&P was tapped early Tuesday). Away from the bull camp is Miller Tabak + Co.â\u0080\u0099s lead strategist Matthew Maley, who sees equities ripe for a near-term fall of 10% to 15%. An overbought stock market, notably within megacap technology stocks, uncertainty over a new stimulus plan, U.S.-China relations, and fears over an autumn pandemic wave should make investors uneasy, he says. But he has a more â\u0080\u009cconstructiveâ\u0080\u009d view about how the market will perform in the fourth quarter. In our call of the day, Maley suggests repeating an earlier-year strategy â\u0080\u0094 â\u0080\u009craise cash nowâ\u0080\u009d to take advantage of the next fall, and maximize profits in the rally later this year. â\u0080\u009cThose who followed our suggestions in Jan/Feb were very happy when March and April came aroundâ\u0080¦and we think theyâ\u0080\u0099ll be very happy over the next two months as well if they follow the same strategy,â\u0080\u009d Maley says in a recent note to clients. The Federal Reserve is key here. â\u0080\u009cThe Fedâ\u0080\u0099s number one concern is the credit markets, not the stock market. Only a severe decline in stocks would destabilize the credit markets, not a 10%-15% correction,â\u0080\u009d he says. So, he expects the Fed will turn the spigots back open when that correction threatens to get more ugly, such as was seen in the first quarter. That could â\u0080\u009clead the S&P to rally toward 3,600, but we also believe that will be very tough for the stock market to rally THAT strongly without experiencing a normal/healthy correction beforehand,â\u0080\u009d says Maley. History is also a factor, with the U.S. presidential election looming. He notes the stock market has rallied from Election Day (or shortly thereafter) until the end of the year on 10 of 12 past such occasions since 1972, with an average gain of 7.2%. And that rally will come â\u0080\u009cno matter who wins the election in November,â\u0080\u009d he says.The chart Hereâ\u0080\u0099s how the first half of the year went for the worldâ\u0080\u0099s biggest sovereign-wealth fund, Norwayâ\u0080\u0099s Government Pension Fund Global, which lost $21.3 billion. Random reads Portuguese president becomes a hero of the Algarve. What we need: A new baby panda is en route at Washingtonâ\u0080\u0099s National Zoo. How the U.K. government earned an â\u0080\u009cFâ\u0080\u009d from students. Need to Know starts early and is updated until the opening bell, but sign up here to get it delivered once to your email box. Be sure to check the Need to Know item. The emailed version will be sent out at about 7:30 a.m. Eastern. Follow MarketWatch on Twitter, Instagram, Facebook."}]}