{"article": [{"url": "https://www.marketwatch.com/story/biden-says-4-more-years-of-trumps-climate-denial-could-mean-more-suburbs-burned-in-wildfires-2020-09-14", "published": 1600103960.0, "headline": "Biden says '4 more years of Trump's climate denial' could mean more suburbs 'burned in wildfires'", "body": "Joe Biden on Monday attacked President Donald Trump's responses to the wildfires in the West and climate change, saying the fires represent \"yet another crisis he won't take responsibility for.\" \"The West is literally on fire, and he blames the people whose homes and communities are burning,\" the Democratic presidential nominee said in a speech at the Delaware Museum of Natural History in Wilmington, Del. \"If we have four more years of Trump's climate denial, how many suburbs will be burned in wildfires? How many suburbs will have been flooded out? How many suburbs will have been blown away in superstorms?\" At least 35 people had been declared dead as of late Sunday as nearly 100 wildfires blazed in the West over the weekend. Biden's comments came as Trump on Monday got briefed on the wildfires as he visited the Sacramento, Calif., area. With 50 days to go before the Nov. 3 election, the Democratic challenger has an edge of 3.7 percentage points over the Republican incumbent in a RealClearPolitics moving average of polls focused on top swing states that are likely to decide the White House race. Betting markets are giving the former vice president a 52.7% chance of winning vs. Trump's 46.5% chance. See:Trump spars with California official on wildfires and climate change: 'It'll start getting cooler' Opinion:7 ways you're already paying for climate change Biden also said Trump thinks \"hoax\" when he thinks about climate change, while he thinks \"jobs.\" \"When Donald Trump thinks about LED light bulbs, he says he doesn't like them because the lights are no good. They always make him look orange,'\" the former vice president added. \"I see small businesses and master electricians designing and installing award-winning energy conservation measures.\" Biden on Tuesday is slated to visit the swing state of Florida. He said on Monday that while in Florida he \"will talk about how I am going to work like the devil to make sure I turn every Latino and Hispanic vote.\" Related:The West burns, coastlines are threatened, and Trump and Biden are too quiet on climate change, say analysts And see:VP nominee Kamala Harris has a particular climate-change agenda: environmental justice"}]}