{"article": [{"url": "https://www.marketwatch.com/story/dominos-pizza-could-snap-up-market-share-with-improved-chicken-wings-2020-07-17", "published": 1595233640.0, "headline": "Dominoâ\u0080\u0099s Pizza could snap up market share with â\u0080\u0098improvedâ\u0080\u0099 chicken wings", "body": "Dominoâ\u0080\u0099s Pizza Inc. has introduced a chicken wing menu option that BTIG analysts think could lure diners away from Wingstop Inc. The 10-piece wing item has new sauces and a price tag, $7.99, that analysts say will be enticing to value-conscious customers. Dominoâ\u0080\u0099s DPZ, -2.50% Â previously had wings on the menu, but, according to Richard Allison, the companyâ\u0080\u0099s chief executive who spoke about the new item on the Thursday earnings call, they were in need of improvement. â\u0080\u009cIn our view, the upgraded product quality coupled with the investment behind advertising to support the rollout could allow the brand to take share in this multibillion-dollar category,â\u0080\u009d wrote BTIG analysts led by Peter Saleh. Read:Red Robin Gourmet Burgers cut 55 menu items due to coronavirus and doesnâ\u0080\u0099t plan to bring them back â\u0080\u009cFurthermore, we note that the aggressive price point of 79 cents per wing compared with Wingstop which is typically north of $1 per wing could result in some pricing pressure across the category.â\u0080\u009d BTIG recently downgraded to neutral from buy at Wingstop WING, +0.70% Â on concerns that the company lacked the funds for expansion. BTIG rates Dominoâ\u0080\u0099s stock buy with a $440 price target. Dominoâ\u0080\u0099s is upping its game in the chicken wing category in time to meet heightened demand. â\u0080\u009cWhile the announced menu innovation isnâ\u0080\u0099t necessarily new, we would point to the strong performance of the chicken category both pre-COVID and since, and believe there may ultimately be greater opportunity for trial and check add-on from an improved wing product vs. other â\u0080\u0098newâ\u0080\u0099 items,â\u0080\u009d said RBC Capital Markets in a note. See:Skyrocketing COVID-19 cases around the U.S. slows dine-in restaurant recovery RBC rates Dominoâ\u0080\u0099s stock outperform with a price target of $458, up from $435. Dominoâ\u0080\u0099s reported earnings and revenue that blew past expectations, with U.S. same-store sales soaring 16.1%. Dominoâ\u0080\u0099s stock closed Friday down 4.3%. Shares have rallied 32.8% for the year to date while the S&P 500 index SPX, +0.87% Â has slipped 0.2% for the period. Analysts have been upbeat about Dominoâ\u0080\u0099s and its pizza delivery competitor Papa Johnâ\u0080\u0099s International Inc. during the pandemic due to their digital ordering, delivery and contactless capabilities. â\u0080\u009cFrom here, value will be a major focus, while menu innovation could help maintain outperformance,â\u0080\u009d wrote UBS in a note. UBS rates Dominoâ\u0080\u0099s stock neutral with a price target of $415, up from $385. Donâ\u0080\u0099t miss:Online food prices jump as food companies struggle to meet demand Stifel analysts think Dominoâ\u0080\u0099s can maintain its same-store sales momentum. Dominoâ\u0080\u0099s said it would be launching additional items in the coming months. â\u0080\u009cWe believe many investors will find the wing offering a bit underwhelming, but additional launches in the coming one to two months would represent the most product launches Dominoâ\u0080\u0099s has ever had in a single year,â\u0080\u009d wrote analysts led by Chris Oâ\u0080\u0099Cull. â\u0080\u009cWe are confident management will leverage the various launches to create new menu messaging and awareness, calling attention to Dominoâ\u0080\u0099s evergreen value platform.â\u0080\u009d Stifel rates Dominoâ\u0080\u0099s stock hold and raised its price target to $400 from $360."}]}