{"article": [{"url": "https://www.marketwatch.com/story/long-term-care-insurance-theres-no-good-alternative-2020-09-16", "published": 1600258520.0, "headline": "Long-term care insurance: Thereâ\u0080\u0099s no good alternative", "body": "As I wrote recently, many fewer carriers are selling traditional long-term care insurance policies and premiums are higher than they used to be. People who bought those policies years ago recently have been hit with huge premium increases because policyholders held on longer than carriers expected and have collected huge payouts insurers hadnâ\u0080\u0099t prepared for. Right now, if youâ\u0080\u0099re in your mid-50s and healthy, a typical individual long-term care policy would cost around $3,000 a year. Even without premium increases, that would be close to $100,000 over 30 years. 80% of older Americans can't afford to retire - COVID-19 isn't helping But because of the heavy costs of policies they wrote decades ago, insurers who are still in the market are getting much more selective. According to the American Association for Long-Term Care Insurance, 44% to 51.5% of people over 70 who apply for a long-term care policy are declined by insurers. Almost one-third of those between 65 and 60 are turned down, as are 24% of people between 60 and 64 and 21% â\u0080\u0094 about one in five â\u0080\u0094 of people in their 50s. â\u0080\u009cUnderwritingâ\u0080\u0099s gotten a lot tougher,â\u0080\u009d says Grace Gulden, founder of Life Resources Group LLC, a Golden Valley, Minn.-based adviser specializing in long-term care solutions. â\u0080\u009cAre you diabetic taking insulin? Thatâ\u0080\u0099s usually a knockout question. Youâ\u0080\u0099re not going to qualify for long-term care insurance if you have two chronic conditions,â\u0080\u009d such as AIDS, MS, or two or more strokes. â\u0080\u009cWhen theyâ\u0080\u0099re looking at your current health, weight has become a much bigger factor than it ever has before,â\u0080\u009d she notes. An underwriting guide for long-term care insurance prepared by Mutual of Omaha laid out explicit weight guidelines. Insurers also will look at applicantsâ\u0080\u0099 immediate family history of conditions like heart disease, stroke, or dementia that would put someone at higher risk of needing long-term care. So, what do you do if you want coverage but either canâ\u0080\u0099t afford it or were turned down for a policy? Retirement Weekly explored some options, but unfortunately there are not a lot of good choices. Why? These products tend to be hybrids, designed for another purpose, with long-term care almost as an afterthought. For example, you can buy a rider to a life insurance policy that lets policyholders use a portion of their death benefit to cover the cost of critical or chronic illnesses or long-term care. â\u0080\u009cWhen you add the long-term care rider to it, it does greatly increase the premium that youâ\u0080\u0099re paying,â\u0080\u009d says Gulden. The reason is obvious: Insurers need to cover the same costs a straight-up long-term care policy would cover. She ran a hypothetical quote for Retirement Weekly for a $500,000 term life policy for a 55-year-old woman who doesnâ\u0080\u0099t smoke and is in good health. Premiums would run $225-239 a month, or just shy of $3,000 a year, which sounds great on paper. After all, youâ\u0080\u0099re getting half a million dollarsâ\u0080\u0099 worth of life insurance with long-term care thrown in for the same price of a full long-term care policy, right? But thereâ\u0080\u0099s a catch â\u0080\u0094 or a couple of them. First of all, every dollar that goes to pay long-term care expenses is a dollar your heirs wonâ\u0080\u0099t see, because itâ\u0080\u0099s subtracted from the death benefit. â\u0080\u009cIfâ\u0080¦they take a portion of that death benefit while theyâ\u0080\u0099re still alive, thatâ\u0080\u0099s going to greatly reduce what their beneficiary is going to get,â\u0080\u009d says Gulden, though she adds that most policies stipulate at least 10% of the death benefit must be reserved for heirs. Second, this term life policy runs for 30 years, so it would run out when Jane Doe turns 85, maybe just the time sheâ\u0080\u0099ll need to pay for long-term care. â\u0080\u009cThe question to ask is, â\u0080\u0098Will I outlive the term before I need care?â\u0080\u0099â\u0080\u009d Gulden adds in a follow-up email to me. One alternative is whole life insurance with a long-term care rider, which doesnâ\u0080\u0099t have an expiration date but costs â\u0080\u0094 wait for it â\u0080\u0094 more than $1,000 a month for $500,000 worth of coverage for this same healthy 55-year-old woman. That simply doesnâ\u0080\u0099t make economic sense for most people. There are other choices, too, including deferred annuities with long-term care riders, which may work for people who have certain pre-existing conditions that cause them to be denied long-term care because underwriting standards are less stringent for annuities. But youâ\u0080\u0099ll have to shell out tens of thousands of dollars upfront to buy one. Also, older people who own their homes free and clear may consider getting a reverse mortgage and tapping it to pay long-term care expenses. Weâ\u0080\u0099ll take a deeper dive into reverse mortgages in a future column. But when you look at it, itâ\u0080\u0099s hard to avoid Guldenâ\u0080\u0099s conclusion: â\u0080\u009cIf you want a plan that is really designed for long-term care insurance, then you go with long- term care insurance, if you can afford it, and also if you qualify.â\u0080\u009d Itâ\u0080\u0099s still the best choice among a lot of not-so-great alternatives."}]}