{"article": [{"url": "https://www.marketwatch.com/story/coronavirus-update-us-cases-reach-29-million-and-death-toll-tops-130k-as-38-states-see-cases-on-the-climb-2020-07-06", "published": 1594048820.0, "headline": "Coronavirus update: U.S. cases reach 2.9 million and death toll tops 130K, as 38 states see cases on the climb", "body": "New coronavirus cases continue to surge Monday, with the U.S. re-emerging as a global hot spot, while Wall Street continues to defy the dangers after President Donald Trump over the weekend played down the threat of COVID-19. Trump’s signing of an extension of a federal program providing forgivable loans to small businesses hurt by the coronavirus helped to assuage some concerns over the increased case tally. New confirmed cases of the coronavirus that cases COVID-19 rose to 2.91 million in the U.S., after record daily increases were seen over the holiday weekend, with death tolls climbing to 130,090, according to data aggregated by Johns Hopkins University. That implies a death rate of about 4.5% Over the last 14 days, 38 states have seen COVID-19 cases increase, led by Idaho, Montana and Florida, while 11 states and Washington, D.C. have seen cases mostly the same and one state—New Hampshire—has seen cases decline, according to a New York Times tracker. Miami-Dade County Mayor Carlos Gimenez said Monday that a new emergency order will shut down dining-in services at restaurants as well as party venues, gyms, and short-term rentals starting July 8 because of a spike in cornavirus cases there. Gimenez is keeping open hotel pools, summer camps, daycare centers, retailers, and personal care services as long as people practice social distancing. “Beaches will be open on Tuesday,” he said in a news release. “But if we see crowding and people not following the public health rules, I will be forced to close the beaches again.” In a speech over the weekend commemorating the July 4th holiday, Trump claimed that 99% of cases were “totally harmless.” He also played down the rise in new cases, tweeting that it was the result of increased testing. iframe.twitter-tweet { width: 100% !important; } Food and Drug Administration Commissioner Stephen Hahn followed by speaking on a number of talks shows Sunday trying to emphasize the growing threat of COVID-19. When asked repeatedly on CNN for comment on Trump’s 99% claim, and whether it was “wrong,” Hahn responded by saying “we absolutely must take this seriously,” and that he wasn’t going to get into “who’s right and who’s wrong.” Don’t miss: ‘It’s dangerous NOT to be sending a clear message to Americans’: U.S. hits 156,000 new coronavirus cases over July 4th Holiday. See also: Fauci says that in his 40 years of dealing with viral outbreaks, he’s never seen anything like COVID-19. On Monday, New York Gov. Andrew Cuomo joined the growing chorus critical of Trump’s comments, saying he is “facilitating” and “enabling” the virus by statements he made. Also read: Fauci says Americans must do 3 things to win the battle against COVID-19. Meanwhile, Wall Street remained upbeat about the eventual recovery, with the Dow Jones Industrial Average DJIA, +0.56% surging more than 400 points, or 1.6%. The rally comes on the heels of better-than-expected June jobs data reported Thursday, and data out Monday showing the service sector of the U.S. economy has resumed expansion. See Market Snapshot. Despite the improving data, Goldman Sachs cut its outlook for U.S.growth in 2020, saying the reintroduction of COVID-19 restrictions as a result of the surge in cases will weigh on consumer spending, as MarketWatch’s Barbara Kollmeyer reported. “Over the last few weeks, the COVID situation in the U.S. has worsened significantly to the point where the U.S. is now a notable outlier among advanced economies,” wrote Jan Hatzius, Goldman’s chief economist, in a note to clients. What may also be supporting Wall Street’s bullish mood, Regeneron Pharmaceuticals Inc. REGN, +0.36% said it had begun a Phase 3 clinical trial testing an antibody cocktail to prevent COVID-19. The study will specifically focus on the cocktail’s efficacy preventing disease in 2,000 people who have been exposed to the virus by a close contact, such as a roommate. Elsewhere, Becton Dickinson & Co. BDX, +0.46% announced the launch of a point-of-care COVID-19 antigen test that can detect the coronavirus in 15 minutes, and Emergent BioSolutions Inc. EBS, -0.81% announced a five-year deal with Johnson & Johnson JNJ, +1.39% to manufacture the drug substance for the drugmaker’s still-investigational COVID-19 vaccine.Latest tallies The global COVID-19 case tally increased to 11.51 million on Monday, while the death toll rose to 535,453, the Johns Hopkins data show. About 6.2 million people have recovered. The U.S. is leading the way by far in cases and deaths. Brazil is second to the U.S. with 1.60 million cases and 64,867 deaths, but is first in recoveries with 1.04 million versus the U.S. with 906,763. India is third measured by cases at 697,413, followed by Russia with 686,777 and Peru with 302,718. The U.K. has 44,321 fatalities, the highest in Europe and third highest in the world. China, where the illness was first reported late last year, has 84,888 cases and 4,641 fatalities. California Limits July Fourth Celebrations to Combat Coronavirus Surge What companies are saying Churchill Downs Inc. CHDN, -3.00% has temporarily suspended operations at Calder Casino in Miami as of July 3, less than month after the casino was reopened, after an emergency order was issued by Miami Mayor Carlos Gimenez to close entertainment venues in an reaction to a rise in COVID-19 cases. The company had reopened Calder Casino on June 12, after temporarily suspending operations on March 16, as a result of the COVID-19 pandemic. The re-suspension comes as new coronavirus cases spiked up to a new daily record over the weekend. Freeport-McMoRan Inc. FCX, +2.56% said it expects copper sales to exceed previous guidance provided in April of 690 million pounds by approximately 8%, and gold sales are expected to exceed April guidance of 165,000 ounces by about 10%. In April, the company had cut its outlook for sales and production in an effort to mitigate the financial impact of the COVID-19 pandemic. On Monday, the company said its Lone Star project in North America is “substantially” complete, and is on track to produce 200 million pounds of copper a year, starting in the second half of 2020. The company also provided a liquidity update, saying it had not drawn on its $3.5 billion revolving credit facility, and had $9.9 billion in debt and $1.5 billion in cash as of June 30. Uber Technologies Inc. UBER, -0.18% confirmed a deal to buy food-delivery service Postmates Inc. for $2.65 billion in stock. Uber estimates that it will issue about 84 million shares of its common stock, representing about 4.8% of the shares outstanding, for 100% of Postmates’s equity. After the deal’s closing, which is expected in the first quarter of 2021, Uber plans to keep Postmates’s app running separately from its own food-delivery service app Uber Eats. “Uber and Postmates have long shared a belief that platforms like ours can power much more than just food delivery-they can be a hugely important part of local commerce and communities, all the more important during crises like COVID-19,” said Uber Chief Executive Dara Khosrowshahi. Bloomberg and the New York Times reported over the weekend that a deal was expected to be announced as early as Monday. Endologix Inc. US:ELGX filed for bankruptcy over the weekend, and announced a deal to be taken private by its largest creditor Deerfield Partners, as the medical device maker suffered financial challenges, compounded by the delay in procedures resulting from the COVID-19 pandemic. The company said the reorganization will reduce debt by about $180 million. Endologix also expects $30.8 million in debtor-in-possession financing from Deerfield, an additional $30 million in exit financing from Deerfield and $50 million in rolled over debt. Endologix said it fully intends to meet its financial obligations during the reorganization, including paying its suppliers"}]}