{"article": [{"url": "https://www.marketwatch.com/story/uh-oh-investors-predict-dow-50000-in-just-five-years-2020-08-17", "published": 1598102180.0, "headline": "Uh-oh: Investors predict â\u0080\u0098Dow 50,000â\u0080\u0099 â\u0080\u0094 in just five years", "body": "The average U.S. investor must be even higher than the stock market. What else can explain the results of a new survey, which found that, among a sample of 1,500 people here in the U.S. who manage their portfolios, the average person expected the stock market to generate sky-high returns of 15.4% a year over the next five years? After accounting for dividends, that would mean stock prices would nearly double by 2025, with the S&P 500 SPX, +0.87% topping 6,000 and the Dow Jones Industrial Average DJIA, +0.56% Â hitting about 52,000. Yikes. If that happens we can all achieve â\u0080\u009cFinancial Independenceâ\u0080\u009d and â\u0080\u009cRetire Earlyâ\u0080\u009d to the beach. Just in time for the robots, artificial intelligence and self-driving cars to do all the work. Oh, and this forecast was the average in the survey. Heaven knows what the optimists expect. The poll was conducted by global money-management firm Schroders, which surveyed 23,450 private investors in 32 countries around the world. About 10% were already retired, and the other 90% were presumably saving for retirement. Those in the U.S., by the way, came out as by far the most optimistic â\u0080\u0094 or possibly deluded â\u0080\u0094 in the world. The Japanese are expecting returns to be less than half as much as folks here. As the overwhelming bulk of U.S. investorsâ\u0080\u0099 stock investments are here at home, we have to assume they are expecting these heroic returns from U.S. stocks. Hmmm. For those of us saving for our retirement, this is precisely the sort of thing that affects us. After all, if we think the stock market might plausibly generate sky-high returns over the next five years, itâ\u0080\u0099s a good reason to take on plenty of â\u0080\u009crisk.â\u0080\u009d If I thought this was a realistic outcome Iâ\u0080\u0099d basically want to be almost entirely in stocks. So: How likely is it? Well, almost anything can happen on Wall Street, and generally does, so this is not a mathematical impossibility. Donâ\u0080\u0099t miss:Should I still use the 60/40 investing rule for retirement? But, well, good luck. That would mean that U.S. stocks, already valued at a wacko 43% of the entire planetâ\u0080\u0099s GDP, would rise to 60% or even 70%. Since reliable data began in the 1920s, U.S. stocks have produced average compound returns of about 6.5% a year on top of consumer price inflation. As there is no inflation at the moment, and the bond market is predicting little or none for the next five years, this means investors today are expecting stocks to produce twice their average returns for the next five years. Or maybe they are expecting inflation to come roaring back but stocks to carry on rising anyway. Read:Why life will never be the same for people over 60, even with a vaccine Never mind that the S&P 500â\u0080\u008e is now trading at 25 times 2021 per-share earnings, 33 times the average earnings of the last 10 years, and somewhere between 1.5 and 2 times the replacement cost of assets, known to economists as Tobinâ\u0080\u0099s q. All three historic measures have long-term track records of anticipating future returns. None is perfect, and each is up for debate. But by all three measures S&P 500 valuation today is up in the nosebleed section. Itâ\u0080\u0099s one thing to produce terrific stock-market returns from a low base. Itâ\u0080\u0099s another to produce them when stocks are already expensive. Yes, stocks have sometimes doubled your money over a period of five years, when adjusted for inflation. Going back to the 1920s thatâ\u0080\u0099s happened about one year in six. But most of those happened in the big boom just after the second world war, or the mania of the late 1990s. The average five-year gain is half as much. And the big gains typically come when the market is cheap. To expect the same returns when the market is expensive is to start assuming valuations donâ\u0080\u0099t matter. Actually, itâ\u0080\u0099s to start assuming valuations matter in reverse â\u0080\u0094 because the higher stocks go, the more ambitious investors become about future returns. â\u0080\u009cOur results show that 80% of people are still basing their predictions on the returns they have received in the past,â\u0080\u009d notes Schroders in the report. No kidding. Behavioral finance has a term for that. Itâ\u0080\u0099s called â\u0080\u009crecency bias.â\u0080\u009d Itâ\u0080\u0099s an established cognitive error that plagues us all. We humans have a tendency to extrapolate the future from the recent past. Itâ\u0080\u0099s a longstanding Wall Street phenomenon, and the historical record is not good. It is, ominously, generally near market peaks when investors are most bullish. Whether weâ\u0080\u0099ll have a crash or a bear market is another matter. Yes, 15% could technically happen. But I wouldnâ\u0080\u0099t bet on it."}]}