{"article": [{"url": "https://www.marketwatch.com/story/gold-prices-slide-as-bond-yields-and-the-dollar-firm-2020-08-26", "published": 1598450840.0, "headline": "Gold and silver futures finish at highest in a week", "body": "Gold and silver futures tallied their highest finish in a week on Wednesday, as traders looked to Federal Reserve Chairman Jerome Powell’s coming speech at the Jackson Hole, Wyo., economic summit for the precious metals’ next big catalyst. Prices for gold had spent time early Wednesday trading lower, pressured on the back of a rise in bond yields, with losses briefly accelerating after a reading on the sale of long-lasting goods came in better than expected. Durable goods orders for July jumped 11.2%, much higher than the consensus forecast of a 4.8% increase. “Historically, good economic data is negative for gold but in this case, real interest rates declined in the wake of the release, as rising inflation expectations outpaced an uptick in Treasury yields,” Tyler Richey, co-editor at Sevens Report Research, told MarketWatch. “That is a bullish dynamic for the gold market.” The price moves come ahead of a highly anticipated speech from Powell, who is expected to provide a more accommodative signal, signaling that the U.S. central bank is willing to embark upon on unconventional way of thinking about rising inflation. Powell is expected to advocate for a so-called asymmetric inflation target, one that allows policy makers to let inflation rise above their traditional annual target of 2%, which could be seen as bullish for gold and other precious metals. Read:Powell may be the headliner, but here are the other key central bankers set to speak at Jackson Hole The Fed Chairman is expected to conduct a webcast speech at around 9 a.m. Eastern time on Thursday at the Jackson Hole symposium, which is being held virtually due to the pandemic. Powell’s speech “could turn [the] gold market either way, but will need to confirm ‘dovish tone/sentiment’ for gold to recover further,” said Jeff Wright, executive vice president of GoldMining Inc. “If his speech is supportive of zero rates and other methods to re-stimulate growth, I would anticipate a return to a U.S. dollar decline and gold rebounding towards $2,000 in a short time period.” December gold GCZ20, +2.17% GC00, +2.17% rose $29.40, or 1.5%, to settle at $1,952.50 an ounce after touching a low of $1,908.40. The settlement was the highest for a most-active contract since Aug. 19, according to FactSet data. Prices fell 0.8% on Tuesday to market the lowest settlement for a most-active contract since July 24. September silver US:SIU20, meanwhile, added $1.18, or 4.4%, at $27.449 an ounce, following a 1.3% decline in the prior session. Prices for the metal ended at their highest since Aug. 18. Trading in the precious metals comes against the backdrop of government bond yields that were rising, as prices fall, with the 10-year Treasury note TMUBMUSD10Y, 0.777% rate up 1.6 basis points at 0.698%, according to FactSet data. A rise in yields can increase the relative cost of owning gold, which doesn’t offer a coupon, over so-called risk-free Treasurys. Meanwhile, a softening in the U.S. dollar has given way to gains for bullion because a weaker buck can make the precious commodity more attractive to overseas buyers. A measure of the buck against six currency peers, the ICE U.S. Dollar Index DXY, -0.58%, was off 0.1% but had been much firmer earlier on the session. Read:U.S. bond fund giant says gold still has plenty of luster “Gold’s natural trend right now is upward, due largely to the growing global appreciation of how monetary easing and stimulus spending will depreciate the value of currencies against the yellow metal,” said Brien Lundin, editor of Gold Newsletter. “I think we’ll continue to see gold consolidate its gains via time rather than a significant price correction, trading in a range for a couple of months before rallying once again.” In other metals, September copper US:HGU20 rose 0.9% to $2.9615 a pound. October platinum PLV20, +3.99% climbed 0.6% to $939.80 an ounce and September palladium US:PAU20 tacked on 0.9% to $2,190.60 an ounce."}]}