{"article": [{"url": "https://www.marketwatch.com/story/economists-predict-us-added-17-million-jobs-in-july-but-admit-its-largely-a-guess-heres-what-worries-them-2020-08-06", "published": 1596770660.0, "headline": "Economists predict U.S. added 1.7 million jobs in July, but admit itâ\u0080\u0099s largely a guess. Hereâ\u0080\u0099s what worries them", "body": "The U.S. economy probably suffered a steep decline in hiring and job creation in July, but rarely has Wall Street been so flummoxed about the state of the labor market. The resurgence of the coronavirus epidemic in many American states and a potentially big shift in school employment could throw the numbers out of whack. Hereâ\u0080\u0099s what to watch for in Fridayâ\u0080\u0099s monthly employment report from the U.S. Labor Department that is due for publication at 8:30 a.m. Eastern time. Coronavirus crisis The consensus of economists polled by MarketWatch points to an increase of 1.7 million jobs in Julyâ\u0080\u0094 just one-third of the 4.8 million gain in June. But thereâ\u0080\u0099s anything but a real consensus among forecasters. The range of estimates in the MarketWatch survey run from a decline of 280,000 to an increase as high as 4 million. Why such a big gap? For one thing, economists are unsure how much the spike in coronavirus cases last month caused companies to lay off workers again or delay plans to bring them back. Many economists say they have little confidence in their forecasts. â\u0080\u009cItâ\u0080\u0099s hard to know how to analyze or model something thatâ\u0080\u0099s never happened before,â\u0080\u009d acknowledged Dan North, the chief economist of North America a credit-insurer Euler Hermes. â\u0080\u009cBut I think the recent gains are going to taper off.â\u0080\u009d All the evidence points in that direction. Employment measures in a pair of closely followed ISM surveys of top business executives, for example, indicate the companies employed fewer workers last month. And new jobless claims â\u0080\u0094 people applying for unemployment benefits â\u0080\u0094 actually rose slightly in July overall. â\u0080\u009cThere is an overwhelming amount of evidence that the labor market stalled in July,â\u0080\u009d said economists Aneta Markowska and Thomas Simons of Jefferies LLC. Read: Economy suffers titanic 32.9% plunge in 2nd quarter, points to drawn-out recovery Also:â\u0080\u0098A massive welfare economyâ\u0080\u0099 - federal aid prevents even steeper GDP collapseSchools out If hiring is stronger in July than expected, a big reason could be a seemingly large increase in employment at schools and public colleges. Donâ\u0080\u0099t be fooled, economists say. Thereâ\u0080\u0099s a good chance the governmentâ\u0080\u0099s normal seasonal adjustments will vastly inflate educational employment. How come? Many school workers such as bus drivers and cafeteria workers were laid off before the end of the school year because of the viral outbreak. Employment in public education sank by a seasonally adjusted 886,000 in April and May. Normally most of those layoffs would have taken place in July. As such the seasonal adjustments could make it look like governments added 500,000 new jobs or more in July â\u0080\u0094 surely a phantom increase. â\u0080\u009cBecause many of those layoffs appear to have already taken place in the preceding months, seasonal factors should provide a significant lift to state and local government payrolls,â\u0080\u009d contended economists at Morgan Stanley. Focus on the private sector The big number to follow in July is private-sector payrolls. Some Wall Street DJIA, +0.56% Â economists predict private-sector jobs could increase by fewer than 1 million, which would mark an enormous drop from 4.77 million added back in the prior month. Lots of attention will be paid to retail and â\u0080\u009cleisure and hospitality,â\u0080\u009d a category used to encompass restaurants and hotels. They suffered the biggest declines in employment early in the pandemic, then bounced back in May and June. They added or rehired a combined 2.8 million workers in June alone. Read:Consumers hold the key to an economic recovery and right now theyâ\u0080\u0099re very anxious The latest viral outbreak spurred some states to reimpose restrictions on indoor dining and other large gatherings last month, dealing another blow to these businesses. Americans also stayed away from activities outside the home for fear of catching the virus. Unemployment rate The share of the population officially designated as unemployed is forecast to slide for the third straight month â\u0080\u0094 to 10.5% in July from 11.1% in June Is that an accurate estimate of how many are really out of work? Hardly. More than 30 million people were reported to be collecting unemployment benefits as of the middle of July, reflecting almost 20% of the labor force before the crisis began. Thatâ\u0080\u0099s a lot higher than the 17.8 million the government officially declared as unemployed in June. Another rate calculated by the government, known as the U6, probably gets closer to the real level of unemployment. That rate includes people who gave up looking recently because no jobs were available as well as people who can only find part-time work. The U6 rate stood at 18% in June, down from a pandemic peak of 22.8%. Itâ\u0080\u0099s likely to fall again in July, but will still show an extremely high level of unemployment."}]}