{"article": [{"url": "https://www.marketwatch.com/story/could-trump-delay-the-election-no-but-congress-could-2020-07-30", "published": 1596126680.0, "headline": "Could Trump delay the election? No â\u0080\u0094 but Congress could", "body": "President Donald Trump tweeted a suggestion on Thursday to delay the November election, repeating an allegation that more mail-in voting would result in fraud. Delay the election? Can he do that? The short answer is: No. Not by himself. Changing the dates of federal elections would be up to Congress. Itâ\u0080\u0099s in the Constitution, which gives lawmakers the power to â\u0080\u009cdetermine the time of choosing the electors, and the day on which they shall give their votes.â\u0080\u009d Opinion:Itâ\u0080\u0099s not too late to save Election Day from chaos. And as experts quickly pointed out after Trumpâ\u0080\u0099s tweet, the dates of federal elections are set in federal law, as the Tuesday after the first Monday in November. This year, thatâ\u0080\u0099s Nov. 3. iframe.twitter-tweet { width: 100% !important; } Trumpâ\u0080\u0099s tweet followed a grim report on the U.S. economy. As MarketWatch reported, the economy shrank at a record 32.9% annual pace in the second quarter, underscoring how big a hole the U.S. finds itself in as it labors to recover from the deepest recession in American history. The Dow Jones Industrial Average DJIA, +0.56% Â fell about 225 points Thursday, while the tech-heavy Nasdaq Composite COMP, +1.39% Â rose 45 points ahead of earnings after the bell from companies including Apple AAPL, +1.74% Â and Facebook FB, +0.26%. Now see:U.S. economy suffers titanic 32.9% plunge in 2nd quarter, GDP shows, and points to drawn-out recovery. There is no evidence of widespread voter fraud through mail-in voting. Still, Trump claimed, â\u0080\u009cWith Universal Mail-In Voting (not Absentee Voting, which is good), 2020 will be the most INACCURATE & FRAUDULENT Election in history.â\u0080\u009d iframe.twitter-tweet { width: 100% !important; } Opinion:Hereâ\u0080\u0099s the truth about mail-in voting: fair, safe and honest. There are a few other important election dates to remember, as law professor Derek Muller wrote this spring in the Wall Street Journal. Electors will gather on Dec. 14 (the first Monday after the second Wednesday in December) to formally cast votes for president and vice president. Congress will then count those electoral votes in a joint session on Jan. 6. â\u0080\u009cThere is no statutory authority for the president to postpone any of those dates,â\u0080\u009d Muller wrote. He noted any postponement would have to occur through a federal statute, passed by the Democratic-controlled House and the Republican-controlled Senate before Election Day. Muller thus calls it â\u0080\u009ctheoretically possibleâ\u0080\u009d to delay a presidential election by a few weeks. But as he notes, the Constitutionâ\u0080\u0099s 20th Amendment is clear that a presidentâ\u0080\u0099s term ends on Jan. 20. After Trumpâ\u0080\u0099s tweet, congressional Republicans including Senate Majority Leader Mitch McConnell dismissed the idea of a change of date for the election. iframe.twitter-tweet { width: 100% !important; } iframe.twitter-tweet { width: 100% !important; }"}]}