{"article": [{"url": "https://www.marketwatch.com/story/a-full-inquiry-is-launched-into-the-wirecard-scandal-why-this-could-prove-embarrassing-for-german-politicians-2020-09-02", "published": 1599048080.0, "headline": "German parliament launches inquiry into fraud scandal at Wirecard, with government in crosshairs", "body": "The German Bundestag decided on Tuesday to launch a full inquiry into the downfall of payment company Wirecard, which filed for insolvency in June after €1.9 billion in cash were found to be missing from its accounts. Lawmakers want to probe possible government failures to uncover the scandal even as evidence accumulated over the last year. - Wirecard’s former chief executive Markus Braun is in custody on accusations of running a criminal enterprise that defrauded creditors of €3.2 billion. Braun and other Wirecard executives deny any wrongdoing. The company’s former chief operating officer, Jan Marsalek, has fled Germany and his whereabouts is unknown. - Both finance minister Olaf Scholz and Germany’s top financial regulator, BaFin, have been accused of turning a blind eye to Wirecard’s problems, first reported by the Financial Times in January, 2019, because the company was seen as a German fintech success story. BaFin even originally filed criminal complaints against the journalists who first uncovered the fraud. Read: Wirecard Debacle Exposes Financial Flaw in German Economy - “A picture has emerged that those fraudsters had it pretty easy,” said Florian Toncar, an opposition MP from the centrist Free Democratic Party. Lawmakers notably want to establish why Chancellor Angela Merkel lobbied for Wirecard during a trip to China in September, 2019, even as allegations of dubious accounting had already surfaced. The outlook: The inquiry could prove embarrassing for the two ruling coalition parties, Merkel’s conservative CDU and Scholz’s social-democratic SPD, one year before the general election scheduled in the fall of 2021. But the impact on the political careers of both parties’ leaders won’t be the same: Merkel is retiring next year, whereas Scholz will be running as his party’s candidate for the chancellor job. Read:Coronavirus cases are rising again in Europe and governments try desperately to avoid a return to brutal lockdowns. They may succeed"}]}