{"article": [{"url": "https://www.marketwatch.com/story/beware-of-these-widely-held-stocks-when-the-market-crisis-gradually-then-suddenly-emerges-fund-manager-warns-2020-06-11", "published": 1592056640.0, "headline": "A fresh stock-market crisis will emerge from the â\u0080\u0098breathtaking disconnect between Main Street and Wall Street,â\u0080\u0099 fund manager warns", "body": "Long-suffering stock market bears have to be eating up Thursdayâ\u0080\u0099s nasty action, with the Fedâ\u0080\u0099s grim economic outlook and troubling coronavirus headlines sending the Dow DJIA, +0.56% down more than 1,800 points on its way to one of its worst showings in a long time. Leading up to the steep drop, John Hussman of Hussman Investment Trust HSTRX, +0.27% Â , who hasnâ\u0080\u0099t shied away from addressing his misfires in recent years, once again offered up his gloomy take on the marketâ\u0080\u0099s prospects in his latest note to clients. â\u0080\u009cIn the face of a breathtaking disconnect between Main Street and Wall Street, largely based on overconfidence in free money, my sense is that there remains a crisis ahead that will emerge â\u0080\u0098gradually, then suddenly,â\u0080\u0099â\u0080\u009d he wrote, referring to Ernest Hemingwayâ\u0080\u0099s famous quote from â\u0080\u009cThe Sun Also Risesâ\u0080\u009d about going bankrupt, â\u0080\u009cgradually, then suddenly.â\u0080\u009d Hussman singled out six widely held stocks, in particular, he believes are vulnerable when the mood turns to risk-off: Facebook FB, +0.26% Â , Apple AAPL, +1.74% Â , Amazon AMZN, +3.01% Â , Netflix NFLX, +1.43% Â , Google GOOG, +1.97% Â and Microsoft MSFT, +2.48% Â . Hussman used that chart to show how the two-year revenue growth of some of those massive companies has â\u0080\u009cslowed remarkablyâ\u0080\u009d compared with the â\u0080\u009cspectacularly highâ\u0080\u009d rates of prior years. â\u0080\u009cAll of these companies are headed toward growth rates that are likely to converge toward single-digit rates similar to the growth rate of the overall economy,â\u0080\u009d Hussman predicted. â\u0080\u009cThatâ\u0080\u0099s not how investors are pricing these large-cap glamour stocks.â\u0080\u009d This is reminiscent of the â\u0080\u009cNifty Fiftyâ\u0080\u009d stock boom of the 1970â\u0080\u0099s and the high-flyers of the tech bubble in 2000, he explained, adding that every indication is that the same process of unwinding is underway today which could have sweeping implications for the health of the market. â\u0080\u009cThe wide dispersion between richly-valued, mega-cap components of the S&P 500 and the broader market is likely to create an enormous headwind for passive index investors over the coming decade, but will simultaneously create enormous opportunities for investors with the flexibility to pursue broad, value-conscious stock selection,â\u0080\u009d Hussman said. In Thursdayâ\u0080\u0099s selloff, with the S&P 500 SPX, +0.87% closing off almost 6%, all the â\u0080\u009cglamourâ\u0080\u009d names were in the red, led by Microsoftâ\u0080\u0099s 5.4% drop."}]}