{"article": [{"url": "https://www.marketwatch.com/story/ceos-from-gm-conocophillips-and-others-defy-trumps-climate-change-stance-push-for-carbon-price-2020-09-16", "published": 1600266800.0, "headline": "CEOs from GM, ConocoPhillips and more defy Trump's climate-change stance, push for carbon price", "body": "A leading CEO group wants the federal government, including Congress, to enact market-based climate-change policies largely in line with those laid out in the voluntary Paris pact that President Trump has abandoned. That includes attaching a price to carbon. In a release Wednesday, Business Roundtable members are calling on the private and public sectors to work together to limit the global temperature rise this century to well below 2 degrees Celsius above pre-industrial levels, consistent with the goals of the multi-country Paris Agreement. In the U.S., this means reducing net-greenhouse gas emissions by at least 80% by 2050 as compared to 2005 levels. It's an attitude shift that has evolved in the decade or so since Congress tried to advance comprehensive climate-change legislation and the last time the Roundtable issued guiding principles on climate in 2007, although some individual corporations have pushed ahead with their own plans for promoting renewable energy use or limiting pollution. Trump pulled the U.S. from the Paris deal primarily citing non-compliance from big emitters China, India and Brazil. The Business Rountable is also in support of placing a federal price on carbon \"where feasible and effective.\" A unified carbon market has had trouble getting off the ground in the U.S. and was largely relegated to regional cap-and-trade markets that have had hot-and-cold participation. A carbon price, a tax by some accounts, was also promoted recently in a Commodity Futures Trading Commission-led bipartisan report on ways to counter the devastating risks from climate change to the U.S. financial system. \"Climate change is real, and we must act. Meeting the scope of this challenge will require collective global action - business and government,\" said Mary Barra, chairman and CEO of General Motors Co. GM, -0.15%  , who backed the effort. The Business Roundtable includes chief executives from more than 200 companies responsible for more than 15 million employees and generating more than $7.5 trillion in combined annual revenues. Victoria Mills, managing director at the Environmental Defense Fund, said the emphasis placed on action from Congress by the private-sector roundtable was a key feature. She likened the position in Wednesday's release to principles issued recently by a group called CEO Climate Dialogue, \"which include putting a fair and economy-wide price on carbon and promoting equity.\" As expected, the Roundtable emphasized climate-change measures that will keep U.S. corporations competitive globally, encourage spending on technology that will promote energy innovation and avoiding \"duplicative, inefficient or counterproductive federal and state regulations,\" among other priorities. \"We are committed to leading by example,\" said Ryan Lance, chairman and CEO of fossil-fuel giant ConocoPhillips, who emphasized regulatory simplification. Read:Trump signs plan to spend $3 billion a year on national parks and public land during a 2020 crammed with EPA rollbacks When the group last issued principles on climate, in 2007, it didn't endorse mandatory measures such as carbon prices, citing disagreement among members, and warned against policies with \"unacceptable\" economic costs, the Wall Street Journal reported. Andrew Steer, president and CEO of the World Resources Institute, was also receptive to the new push by the private sector, calling it \"consistent with recent research that finds enacting ambitious policies to decarbonize the economy is not only compatible with economic growth, but necessary for long-term growth and international competitiveness.\" \"In referencing the Paris Agreement, these CEOs are reinforcing the message that addressing climate change should follow a science-based and globally cooperative approach,\" he said. Read:'Science' itself is on the ballot, so this 175-year-old institution makes its first ever endorsement for president"}]}