{"article": [{"url": "https://www.marketwatch.com/story/manhattan-district-attorney-points-to-mountainous-record-of-alleged-misdeeds-in-justifying-request-for-trump-tax-records-2020-09-21", "published": 1600731740.0, "headline": "Manhattan district attorney points to â\u0080\u0098mountainous recordâ\u0080\u0099 of alleged misdeeds in justifying request for Trump tax records", "body": "NEW YORK (AP) â\u0080\u0094 The Manhattan district attorneyâ\u0080\u0099s office told a federal appeals court Monday that its quest to gain access to President Donald Trumpâ\u0080\u0099s tax returns is supported by â\u0080\u009ca mountainous recordâ\u0080\u009d of public allegations of misconduct. The president and Manhattan District Attorney Cyrus Vance Jr. have been battling for more than a year over a subpoena sent to Trumpâ\u0080\u0099s accounting firm, Mazars USA, seeking eight yearâ\u0080\u0099s worth of his tax documents. Attorneys for Trump have argued that Vance, a Democrat, is just trying to smear the president with an overly broad investigation that has no legal basis. In a filing with the 2nd U.S. Circuit Court of Appeals, lawyers for Vance again declined to reveal exactly why Trump is under investigation, citing grand-jury secrecy rules. See:Manhattan prosecutor cites â\u0080\u0098extensive and protracted criminal conduct at the Trump Organizationâ\u0080\u0099 in defending records demand But they cited multiple news reports in which Trump or his companies have been accused of overstating the value of his assets when dealing with potential business partners and lenders while minimizing the value of those same assets for tax purposes. â\u0080\u009cAny investigation into the types of potential financial improprieties described above would of necessity require a review, not only of tax returns, but source documents, working papers, and communications of the sort identified in the Mazars Subpoena, to evaluate the accuracy and good faith of the positions taken in the filings, as well as the roles of various employees and other potential witnesses,â\u0080\u009d they wrote. Trump has called Vanceâ\u0080\u0099s investigation â\u0080\u009ca fishing expeditionâ\u0080\u009d and â\u0080\u009ca continuation of the witch hunt â\u0080\u0094 the greatest witch hunt in history.â\u0080\u009d The U.S. Supreme Court has already ruled against Trump once in the case, dismissing his argument that presidents are immune from state criminal inquiries as long as they are in office. Trumpâ\u0080\u0099s legal team then tried a different approach, saying the subpoena seeking his returns was issued in bad faith. Manhattan District Attorney Cyrus Vance Jr. leaves court in February. Associated Press That argument was also rejected by a federal judge last month. Trump appealed. Even if the appeals court decides in Vanceâ\u0080\u0099s favor, it is unlikely that Trumpâ\u0080\u0099s returns will then become public before the election. Any material produced as a result of the subpoena will also be protected by grand jury secrecy rules."}]}