{"article": [{"url": "https://www.marketwatch.com/story/asian-markets-gain-on-vaccine-hopes-wall-streets-tech-rally-2020-07-21", "published": 1595290160.0, "headline": "Asian markets gain on vaccine hopes, Wall Streetâ\u0080\u0099s tech rally", "body": "Asian shares were mostly higher Tuesday on rising hopes for an effective vaccine to fight the coronavirus pandemic. Scientists at Oxford University reported that their experimental coronavirus vaccine prompted a protective immune response in hundreds of people who got the shot in an early trial. Other projects are under way. A vaccine under development by colleagues of Dr. Anthony Fauci, the nationâ\u0080\u0099s top infectious diseases expert at the National Institutes of Health, and Moderna Inc., will start its final testing around July 27. The 30,000-person study is intended to prove if the shots are strong enough to protect against the coronavirus. Japanâ\u0080\u0099s benchmark Nikkei 225 NIK, -0.11% Â gained 0.7% in morning trading. South Koreaâ\u0080\u0099s Kospi 180721, +0.21% Â jumped 1.5% and Australiaâ\u0080\u0099s S&P/ASX 200 XJO, +0.00% Â added 1.5%. Hong Kongâ\u0080\u0099s Hang Seng HSI, -0.30% Â rose 1.8%, while the Shanghai SHCOMP, +1.67% Â edged 0.1% higher. Shares also rose in Taiwan Y9999, +1.10% Â and most of Southeast Asia. Asian economies have been carrying out a â\u0080\u009cnew-normalâ\u0080\u009d balancing act of opening economies, with people going shopping and eating out, while doing social distancing and wearing masks. Thatâ\u0080\u0099s had mixed results, with cases shooting up recently in Tokyo to triple-digit figures for daily newly confirmed cases. Japan had so far avoided the massive cases and deaths seen in harder hit nations like the U.S., India, Brazil and parts of Europe. Overnight, U.S. technology and communication stocks and companies that rely on consumer spending led mixed gains on Wall Street, outweighing losses elsewhere in the market. The S&P 500 SPX, +0.87% Â gained 0.8% to 3,251.84. The Dow Jones Industrial Average DJIA, +0.56% Â , which was down for most of the day, inched just 0.1% higher, to 26,680.87. The Nasdaq COMP, +1.39% Â had its best day since the end of April, climbing 2.5% to 10,767.09. Wall Street is coming off its third straight weekly gain following improvements in hiring, retail sales and other parts of the economy, along with rising hopes for a COVID-19 vaccine. Still, worries remain that the rise of coronavirus counts will derail efforts to reopen businesses shut down due to the pandemic. This week will bring earnings reports from major U.S. companies such as Coca-Cola and Microsoft. Expectations are low for companiesâ\u0080\u0099 performance in the April-June quarter due to the pandemic, given the economic fallout from the broad business shutdowns and higher unemployment. The price of benchmark U.S oil US:CLQ20 Â added 6 cents to $40.87 a barrel in electronic trading on the New York Mercantile Exchange. It gained 22 cents to $40.81 a barrel Monday. Brent crude oil UK:BRNU20 Â , the international standard, rose 8 cents to $43.36 a barrel. The U.S. dollar USDJPY, -0.38% Â was unchanged at 107.20 Japanese yen."}]}