{"article": [{"url": "https://www.marketwatch.com/story/chinas-stock-market-just-jumped-6-this-is-a-good-thing-and-westerners-should-be-glad-no-really-2020-07-11", "published": 1594980680.0, "headline": "Chinaâ\u0080\u0099s stock market just jumped 6%. This is a good thing and Westerners should be glad. No, really.", "body": "After central banks flooded the world with money in the wake of the coronavirus crisis, retail investors rushed into the financial markets, sending stocks sharply higher, despite weak economic fundamentals. If that sounds familiar, think again. It describes not the U.S., but China. Whatâ\u0080\u0099s more, the market mania that gripped the worldâ\u0080\u0099s second-largest economy in the past few weeks may not be as disconnected from the real economy as skeptical Western observers may believe. Perhaps even more surprisingly, it suggests some positive changes have come to the often opaque Chinese system â\u0080\u0094 changes that may even work to the benefit of both countries. On Monday, Chinaâ\u0080\u0099s CSI 300 000300, +2.04% Â index surged nearly 6%, bringing it to a 5-year high, and boosting equity markets around the world in its wake. In the year to date, the index is up 16%, outpacing most U.S. benchmarks, except the tech-heavy Nasdaq Composite COMP, +1.39% Â . â\u0080\u009cI donâ\u0080\u0099t think that retail investors alone could drive the markets if it werenâ\u0080\u0099t for the fundamentally good setup right now,â\u0080\u009d said Jan van Eck, CEO of asset manager VanEck. â\u0080\u009cWhat I mean by â\u0080\u0098the fundamentalsâ\u0080\u0099 is central bank policy, fiscal policy, and corporate growth, generally speaking,â\u0080\u009d van Eck told MarketWatch. â\u0080\u009cBetween the recovering growth, reasonable valuations of the stock market, and then maybe a little bit of government support because of whatâ\u0080\u0099s been happening in Hong Kong, I think it can continue. This could be just the beginning of something. Weâ\u0080\u0099re far from what I would consider to be frothy levels.â\u0080\u009d Related: Forget earnings season. Whatâ\u0080\u0099s the rest of 2020 going to look like? While thereâ\u0080\u0099s been a lot of cynicism among Western observers about how rapidly China might be recovering, Bill Adams, senior economist for PNC Financial Services Group, points out that the country has been in a better position through the pandemic than many other countries have. Although China has been making an effort to transition its economy to a services orientation, itâ\u0080\u0099s still more manufacturing-dependent than the U.S. is, Adams noted. The pandemic didnâ\u0080\u0099t deal as big a blow to the production side of the economy, enabling China to bounce back a little more quickly. And within the services sector, Chinaâ\u0080\u0099s economy is more digital than most Western economies. â\u0080\u009cIn normal times, it is often a disadvantage for China to have a legacy of state intervention in the economy,â\u0080\u009d Adams told MarketWatch, â\u0080\u009cbut when thereâ\u0080\u0099s a crisis China has tools at the ready to prevent firms from going under, and to a lesser extent to support households. Thereâ\u0080\u0099s also no political resistance to intervention.â\u0080\u009d Finally, the country had a â\u0080\u009cmuch more aggressive public health response,â\u0080\u009d Adams said. The Chinese government is willing and able to track and trace citizens infected with COVID-19. â\u0080\u009cThe speed with which the economy went downhill and then recovered has been trending up rapidly. In broad strokes it fits the model of recovery from a natural disaster,â\u0080\u009d Adams said. Even with that as a backdrop, the sudden surge in Chinese stock markets, on the back of what seemed like signals from the government, was disconcerting. A China Securities Journal editorial on Monday said the foundations for a â\u0080\u009chealthy bull marketâ\u0080\u009d had strengthened, and a social media post from Shanghai Securities News said â\u0080\u009cHahahahaha! The characteristics of a new bull market are becoming obvious.â\u0080\u009d Many observers were reminded of the pain of the last state-sanctioned Chinese stock market bubble, in 2015, which ended with stocks down nearly 50% from their highs. â\u0080\u009cSo far, the overall level of cheerleading is less pervasive than what we saw in 2015,â\u0080\u009d said Nicholas Borst, China research director at San Francisco, Calif.-based Seafarer Capital Partners. â\u0080\u009cStill, itâ\u0080\u0099s not a best practice ever for official or even quasi-official sources to be talking the market up.â\u0080\u009d Chinese officials are clearly aware of the â\u0080\u009cpositive wealth effectâ\u0080\u009d a rising stock market can have on a jittery economy, Borst said in an interview. Still, like Van Eck, he believes â\u0080\u009cthat only works if itâ\u0080\u0099s driven by fundamentals.â\u0080\u009d For Borst, this weekâ\u0080\u0099s episode suggests the Chinese government may be taking to heart lessons learned from the 2015 market crash, a positive for markets and the economy. Perhaps more importantly, he thinks Chinese officials also learned their lesson from firing too big a policy response during the downturn in the 2008 global financial crisis. â\u0080\u009cThereâ\u0080\u0099s a real desire to avoid a repeat of that,â\u0080\u009d Borst said. â\u0080\u009cI think theyâ\u0080\u0099re going to continue to pursue something more targeted and focused.â\u0080\u009d To be sure, the Chinese spending spree in the aftermath of the 2008 financial crisis, mostly focused on infrastructure spending, launching a worldwide commodities boom that also helped boost other emerging market economies. Now, itâ\u0080\u0099s probably no longer safe to depend on China to be the worldâ\u0080\u0099s â\u0080\u009clocomotive,â\u0080\u009d Borst thinks. See:Do well by doing good with this fund that supports freedom and human rights Even if China is no longer pushing the world forward, one of the biggest questions for markets is to what extent global economies are intertwined. If China finds its footing, but the U.S. and much of the rest of the world havenâ\u0080\u0099t yet caught up, how robust can Chinaâ\u0080\u0099s recovery remain? In a May interview with MarketWatch, Jan van Eck likened the U.S.-China relationship to two people sitting in a life raft with knives. â\u0080\u009cWe can bring out the knives, but I think both of us, no matter how much weâ\u0080\u0099ve sharpened the knife and want to stab the other person, will just end up puncturing the life raft, and then weâ\u0080\u0099re going to be in the sea with the sharks,â\u0080\u009d he said at that time. Itâ\u0080\u0099s possible both countries find it hard to put down the knives, or at least to stop flexing their muscles. As soon as the stock market and economic freefall in the U.S. steadied after Marchâ\u0080\u0099s plunge, President Donald Trump went on the offensive against China once again. And China has drawn worldwide condemnation for imposing a tough new security law on Hong Kong. The analysts MarketWatch spoke with for this article preferred not to speculate on U.S.-China tensions. Van Eck called the issue of interdependence â\u0080\u009cthe open question, but the only open question.â\u0080\u009d For world financial markets, whether the two parties dance alone or together, itâ\u0080\u0099s all good news, he said. â\u0080\u009cYou want both major economies moving forward,â\u0080\u009d van Eck told Marketwatch. â\u0080\u009cI think itâ\u0080\u0099s definitely accentuated the â\u0080\u0094 I hate to say it but I have to say it â\u0080\u0094 the V-shaped recovery story.â\u0080\u009d The coming week will bring a raft of Chinese economic data, including imports, exports, and trade balance figures. Meanwhile, in the U.S., the second-quarter earnings reporting season will kick off, with JPMorgan Chase & Co. JPM, -0.57% Â releasing its numbers on Tuesday. The U.S. government will report on a series of June data points: consumer price inflation Tuesday, retail sales figures Thursday, and new residential construction on Friday. Read next: Wall Streetâ\u0080\u0099s road warriors have spent the past three months grounded. Howâ\u0080\u0099s that working out?"}]}