{"article": [{"url": "https://www.marketwatch.com/story/get-ready-for-another-round-of-stimulus-checks-11595355666", "published": 1595874860.0, "headline": "Get ready for a second round of stimulus checks", "body": "Senate Majority Leader Mitch McConnell said Monday the next round of stimulus would include another round of direct payments to help American families. Source: Getty Images Democrats and Republicans disagree on many points when it comes to what the next stimulus package should include — but a second round of checks to struggling Americans isn’t one of them. Senate Republicans’ new stimulus package, dubbed the Health, Economic Assistance, Liability Protection and Schools Act, or HEALS Act, includes “another round of direct checks for households at the same amount as before,” Senate Majority Leader Mitch McConnell, a Kentucky Republican, said Monday. Americans first began receiving stimulus checks amounting to $1,200 for individuals who earn up to $75,000 in mid-April as part of the $2.2 trillion CARES Act. Married couples earning under $150,000 received $2,400. The HEALS Act would maintain that framework for stimulus checks but include an “additional $500 for each dependent,” Senate Finance Committee Chair Chuck Grassley, a Republican from Iowa, said Monday. Taxpayers with dependents over the age of 17 did not receive any additional stimulus funds under the CARES Act, Grassley said, but they would under the HEALS Act. McConnell indicated three weeks ago that Republicans could want an annual income cutoff of $40,000 for the next round of stimulus checks. That would leave out some 20 million Americans who previously received stimulus checks under the CARES Act, according to calculations by Ernie Tedeschi, a former economic advisor to the Obama administration. But Senate Republicans did not indicate that cutoff would be implemented under the HEALS Act. iframe.twitter-tweet { width: 100% !important; } The $3 trillion stimulus package passed by House Democrats in mid-May, known as the HEROES Act, calls for another round of $1,200 stimulus checks and up to $6,000 per household. President Donald Trump also said he was on board with a second round of direct stimulus payments in a Scripps interview last month. Key members of his administration have indicated that as well, as Democratic and Republican leaders negotiate the terms of the next stimulus package. House Speaker Nancy Pelosi, a California Democrat, said earlier this month that she didn’t think a $40,000 cutoff for stimulus checks was appropriate. “I think there are many families depending on [the] size of family and so many different things, that the $40,000 would have to be explained, justified and the rest,” Pelosi said. “But I think families making over $40,000 probably need assistance.” Pelosi and Senate Minority Leader Chuck Schumer were set to meet with Treasury Secretary Steven Mnuchin and White House Chief of Staff Mark Meadows about the Republicans’ stimulus-package proposal Monday evening."}]}