{"article": [{"url": "https://www.marketwatch.com/story/square-stock-rockets-to-another-new-record-high-as-cash-app-enthusiasm-builds-2020-07-01", "published": 1593621380.0, "headline": "Square stock rockets to another new record high as Cash App enthusiasm builds", "body": "Square shares rallied more than 10% in Wednesday trading to close at another record high as enthusiasm builds for the company’s Cash App. Though Square’s SQ, +2.06% merchant business has been negatively impacted by temporary store closures and other restrictions brought on by COVID-19, the company has seen surging interest in its Cash App, a peer-to-peer platform that lets users transfer money, activate debit-card rewards and invest in bitcoin or equities. The company allows users to get their paychecks direct-deposited through the app and made this an option for people looking to receive their one-time pandemic stimulus payments digitally as well. MoffettNathanson analyst Lisa Ellis chimed in with an increasingly upbeat view of the Cash App’s potential Wednesday, raising her price target to $120 from $90. That implies an enterprise value of about $53 billion, she said, of which the Cash App contributes $27 billion to $30 billion, or more than half her total. Read: Venmo and Square’s Cash App were going gangbusters before the pandemic — now they’re doing even better “We believe Cash App has a value proposition as a digital alternative to a traditional retail bank that resonates with a segment of consumers that value Cash App’s digital-first, user-centric design, and financial services centered on the principles of immediate money movement (e.g., P2P payments, instant deposit), and accessibility (e.g., fractional investing),” she wrote in a note to clients. Ellis’s latest report comes after meetings with Square Chief Financial Officer Amrita Ahuja and Cash App Lead Brian Grassadonia. She now estimates that the Cash App could generate roughly $5 billion in annual revenue and about $2 billion in annual earnings before interest, taxes, depreciation, and amortization once the platform reaches scale, which she said could occur in five to seven years. At that point, Square could have 60 million users generating $85 to $90 a year in average revenue per user, per her calculations. Ellis expects the biggest Cash revenue driver will be the Cash Card, which lets users spend their funds in stores and online, while Square earns a transaction fee. She estimates that Square could have 30 million Cash Card users by the time the platform scales, which is “comparable to Chase’s current digital banking base.” Don’t miss: Square enables retailer customers to offer on-demand deliveries via courier Ellis said there are several sources of Cash App upside not currently reflected in her model. These include international expansion as Square recently bought Verse, a peer-to-peer platform in Spain, as well as new revenue streams like bill pay or “broader” remittance services. The company could also drive more value by connecting its Cash App and seller businesses through a linked rewards program. Also on Wednesday, Rosenblatt Securities analyst Kenneth Hill upgraded the stock to buy from neutral, arguing that the potential for Square’s Cash App “can’t be overlooked,” while “retail proxies have pointed to less Draconian expectations” for the seller business amid the pandemic. Like Ellis, Hill is upbeat on the prospects for the Cash Card, which he estimated may bring in $2.5 billion in annual revenue by 2025 and help compensate for what could be the fading relevance of Square’s instant-deposit feature that lets users pay a small fee to instantly transfer funds from the Cash App to their bank accounts. Hill boosted his price target to $121 from $69. Square’s stock has hit five new record highs in the past eight trading sessions. The shares have rallied about 150% over the past three months as the S&P 500 SPX, +0.87% has gained 26%."}]}