{"article": [{"url": "https://www.marketwatch.com/story/biden-proposes-700-billion-plus-buy-american-campaign-2020-07-09", "published": 1594273880.0, "headline": "Biden proposes $700 billion-plus 'Buy American' campaign", "body": "Launching an economic pitch expected to anchor his fall presidential campaign, Democratic candidate Joe Biden is proposing sweeping new uses of the federal government's regulatory and spending power to bolster U.S. manufacturing and technology firms. Biden calls for a $400 billion, four-year increase in government purchasing of U.S.-based goods and services plus $300 billion in new research and development in U.S. technology concerns. Among other policies expected to be announced Thursday, he proposes tightening current \"Buy American\" laws that are intended to benefit U.S. firms but can be easily circumvented by government agencies. An outline released by Biden's campaign also touts his long-standing promises to strengthen workers' collective bargaining rights and repeal Republican-backed tax breaks for U.S. corporations that move jobs overseas. \"This will be the largest mobilization of public investments in procurement, infrastructure and (research and development) since World War II,\" senior adviser Jake Sullivan told The Associated Press, with the campaign promising additionally that Biden would require that effort in domestic markets before negotiating any new international trade deals. The former vice president will discuss the proposals Thursday at a metal works concern in Dunmore, Pennsylvania. It's the first of a series of addresses Biden plans as he shifts his line of attack against President Donald Trump to the economy. It's political turf the Republican incumbent once considered a clear advantage before the coronavirus pandemic curbed consumer activity and drove unemployment to near-Depression levels. An opening emphasis on manufacturing and labor policy is no coincidence: Biden wants to capitalize on his union ties and deliver on oft-made claims he can win back working-class voters who fueled Trump's upset win four years ago. Biden will continue in coming weeks with an energy plan to combat the climate crisis and a third package on what the campaign has dubbed the \"caring economy,\" with a focus on making child care and elder care more affordable and less of an impediment to working-age Americans. Campaign aides told reporters that all of Biden's policies would target immediate recovery from the pandemic recession and address systemic inequalities Biden says are \"laid bare\" by the nation's ongoing reckoning with racism. \"What's going on here, we need to build back, not just to where we were but build back better than we've ever been,\" Biden told the International Brotherhood of Electrical Workers on Wednesday. \"We're going to take a monumental step forward for the prosperity, power, safety and dignity of all American workers.\" The Democrat's agenda carries at least some rhetorical echoes of Trump's \"America First\" philosophy, but the former vice president's aides describe his approach as more coherent. They cast Trump's imposition of tariffs and uneven trade negotiations with other nations as a slapdash isolationism compromised further by tax policies that enrich multinational corporations. The Biden campaign also pointed to an uptick in foreign procurement and continued outsourcing of jobs by U.S.-based corporations during Trump's presidency. Republicans nonetheless have made clear they will attack Biden on trade and the economy, framing the Democratic establishment figure as a tool of the far left on taxes and a willing participant in decades of trade policy that gutted American workers. Trump also has lampooned Biden as \"weak on China.\" On trade, at least, it's a similar line of attack Biden withstood from the Democratic primary runner-up, Sen. Bernie Sanders, and one that Trump used effectively against Democratic nominee Hillary Clinton in 2016. Biden voted for the North American Free Trade Agreement in the Senate in 1994, an anchor of Trump's criticism and Sanders' attacks before that. One of Trump's signature achievements is an overhaul of NAFTA, which he accomplished with backing from many Democrats on Capitol Hill. Since the 1990s, including during two presidential campaigns, Biden has advocated tighter controls in future trade deals, and he's promised to have organized labor and the environmental movement at the table. The campaign's outline ahead of Thursday emphasizes that Biden wants a resurgence in U.S. markets before engaging in new trade deals abroad. That includes joining the Trans-Pacific Partnership that Biden advocated when he served as President Barack Obama's vice president. Trump opposed TPP as a 2016 candidate. China is not a TPP member. Trump and Biden have called out China for unfair trade practices, but Biden accuses Trump of instigating a trade war with a commensurate economic power that the president \"has no plan\" to win. Biden's team insisted his approach falls within World Trade Organization rules, but aides also acknowledged that a Biden administration would try to modify an existing WTO deal, the Government Procurement Agreement, which effectively creates a shared open international market for participating governments to secure goods and services. For now, Biden has not identified how he'd pay for the proposed new spending. Aides said he has identified revenue sources for all ongoing spending proposals but not for the one-time or short-term investments like the $700 billion in procurement and research. That raises the possibility that Biden could declare that spending to be deliberate deficit spending to stimulate the struggling economy."}]}