{"article": [{"url": "https://www.marketwatch.com/story/oil-futures-slip-as-coronavirus-cases-rise-globally-on-monday-but-bofa-lifts-crude-price-outlook-2020-06-22", "published": 1592839640.0, "headline": "Oil ends higher as long-term demand outlook improves, but rise in global coronavirus cases limits gains", "body": "Oil prices finished higher Monday, marking the expiration of the July contract for U.S. benchmark crude futures, as the improvement in the longer-term outlook prompted one major investment bank to raise its price targets for the commodity. A rise in cases of COVID-19, however, dulled near-term prospects for energy demand, keeping a lid on price gains. In the U.S., infections of the virus increased over the weekend, while places outside of the U.S. also saw cases climb. South Korea on Monday declared itself in the midst of “second wave,” Germany also saw its rate of infection rise as the World Health Organization reported a record increase in global cases on Sunday. Experts still were suggesting that crude, after taking a beating in March and April, and even falling into negative territory, may be primed to show improved uptake as economies see some signs of recovery from the pandemic, even if infections have been rising. “Global oil market fundamentals have shifted significantly since we last adjusted out oil prices forecast on March 8. Given the improved outlook, we lift our 2020 Brent price forecast to $43.70/bbl from $37 prior in 2020. We also increase our 2020 average WTI crude oil price forecast from $32 to $39.70/bbl,” wrote BofA Global Research in a report dated June 19. “Thus we also increase our 2021 Brent crude oil price forecast to $50/bbl, or $7/bbl above the forward, and our 2022 forecast to $55 from $50/bbl,” the strategists wrote. Oil prices improved recently as the Organization of the Petroleum Exporting Countries and its allies, in a group known as OPEC+, agreed to extend a global cut of 9.7 million barrels a day to the end of July. “Our more constructive crude oil view reflects renewed confidence (1) in the ongoing global oil demand recovery, (2) in the damage to supply created by deep capex curtailments across the oil industry, and (3) in the solid OPEC+ agreement to curb output,” BofA wrote. West Texas Intermediate crude for July delivery CL.1, -1.62% US:CLN20, the U.S. benchmark, added 71 cents, or 1.8%, to settle at $40.46 a barrel on the New York Mercantile Exchange, after putting in a gain of 9.6% last week. The July contract, which expired at the end of the session, logged its highest finish since March 6, according to Dow Jones Market Data. The new front month August WTI contract US:CLQ20 settled at $40.73, up 90 cents, or 2.3%. Global benchmark Brent oil for August delivery UK:BRNQ20 rose 89 cents, or 2.1%, at $43.08 a barrel on ICE Futures Europe, following a weekly advance of 8.9%. It also ended Monday at the highest since March 6. It’s unclear, however, if OPEC and allies like Russia are willing to extend production cuts into August. OPEC+ said it would review its output reductions monthly, with the next technical committee meeting set for mid-July. Russia sees between $40 and $50 to the barrel as a fair and balanced oil price, Deputy Energy Minister Pavel Sorokin said, Reuters reported. “Moving forward, demand continues to offer plenty of uncertainty, with some regions still seeing a concerning rise of COVID-19 cases,” said Robbie Fraser, senior commodity analyst at Schneider Electric. “That could undermine consumer confidence, and ultimately challenge some of the demand gains that have supported the crude market over the past two months.” With that in mind, demand figures in this week’s Energy Information Administration report, due Wednesday, “should again be in focus, while production is likely to rebound in the near-term, despite indications of continued declines longer-term,” he said in a daily note. On Nymex, prices for petroleum products settled higher, with July gasoline US:RBN20 up 1.6% at $1.2913 a gallon and July heating oil US:RBN20 up 0.6% at $1.2186 a gallon. July natural gas US:NGN20 settled at $1.664 per million British thermal units, down 0.3%. Read:Why gasoline is set to lead a bumpy rebound in transportation fuels"}]}