{"article": [{"url": "https://www.marketwatch.com/story/dr-fauci-recommends-wearing-goggles-to-prevent-catching-the-coronavirus-2020-07-29", "published": 1596465560.0, "headline": "Dr. Fauci recommends wearing goggles to prevent catching the coronavirus", "body": "Are you ready to wear a pair of safety goggles with your face mask? Dr. Anthony Fauci says that eye protection may be recommended at some point to help prevent spreading COVID-19. The infectious disease expert sat down for a remote Q&A with ABC News via its Instagram account on Wednesday — and his eyewear comments raised a lot of eyebrows on social media. Dr. Jennifer Ashton, the Disney-owned DIS, +1.53% news network’s chief medical correspondent, asked Fauci whether he could see shielding the eyes being recommended at some point. “You know, it might,” he said. “ “If you have goggles or an eye shield, you should use it.” ” — Dr. Anthony Fauci Fauci explained that the novel coronavirus that causes COVID-19 infects mucosal surfaces — or parts of the body including the eyes, nose and mouth that secrete mucus to stop pathogens and dirt from getting into your body. So “perfect protection” of your mucosal surfaces would include covering every one of them up, he said. “Theoretically you should protect all of the mucosal surfaces, so if you have goggles or an eye shield, you should use it,” he said. iframe.twitter-tweet { width: 100% !important; } “It’s not universally recommended, but if you really want to be complete, you should probably use it if you can,” he continued. But one reason that this hasn’t been pushed for the general public yet, he suggested, is because, “it’s so easy for people to just make a cloth mask.” And getting Americans to agree to wear a face mask that fully covers their nose and mouth in public has been enough of a struggle, as it is. How would they react to being told to shield their eyes, too? Some initial responses on Twitter TWTR, -0.23% and the Facebook-owned FB, +0.26% Instagram suggest many people are against it. “How long until we’re told that hazmat suits are recommended?” tweeted one reader under the name Jeffrey Wozniak. “I can just see it now...everyone walking around with swimming goggles plus a mask. I wonder if ski goggles will catch on too,” mused another. iframe.twitter-tweet { width: 100% !important; } Others saw this as another concerning sign of how rapidly the pandemic has progressed. The U.S. death toll reached 150,000 on Wednesday, and the White House Task Force warned that 21 states had recorded more than 100 new cases per 100,000 people in the past seven days. iframe.twitter-tweet { width: 100% !important; } For now, the Centers for Disease Control and Prevention has not issued a formal guidance recommending that people don goggles or eye protection. It only suggests protective eyewear for health care professionals, noting on its site that “use of eye protection is recommended in areas with moderate to substantial community transmission.” So you might see doctors or nurses wearing goggles or face shields in the ICU or areas where they are coming into close contact with COVID-19 patients. But for areas with minimal to no community transmission, eye protection is considered optional, the CDC says, unless otherwise indicated as part of standard precautions. Qatar Airlines recently asked flight attendants to start wearing safety goggles, however, as well as full protective suits, masks and gloves. And some of the health experts who spoke with NPR recently suggested it might be wise to wear goggles or a face shield on a crowded airplane. But a recent report published in The Lancet that analyzed 172 observational studies on how physical distancing, face masks and eye protection affected the spread of COVID-19 suggested that people could be three times less likely to get infected if they wear eye protection. Face shields, goggles and glasses were associated with a lower risk of infection (6%) compared with no eye covering (16%). And there are some people, including virologist and epidemiologist Dr. Joseph Fair, who believe that they were infected with COVID-19 through their eyes. Dr. Fair told NBC’s CMCSA, -0.99% “Today” show in May that while he wore a mask and gloves and wiped down his seat on a crowded flight two weeks earlier, he still got sick — and he blames not having any protection over his eyes. “You can still get this virus through your eyes, and epidemiologically, it’s the best guess I have of probably how I got it,” he said. “ A recent report published in The Lancet suggests that people could be three times less likely to get infected if they wear eye protection. ” So why is eye protection being recommended for health care workers, and not the general public? Dr. John Brooks, chief medical officer for the Centers for Disease Control and Prevention (CDC) COVID-19 response, recently told the AARP.org that, “The virus could enter the body through mucous membranes that cover the white parts of our eyes — but it would be very hard to prove.” Researchers do know that COVID-19 spreads between people who are in close contact to each other through respiratory droplets produced when an infected person coughs, sneezes or talks. But pinpointing exactly where the coronavirus took root in someone’s body — through the nose, the eyes, the mouth or a combination of all three — is next to impossible. Preliminary research suggests that we’re probably most likely to get infected through the nose and mouth. In fact, a recent study from the University of North Carolina at Chapel Hill found that the SARS-CoV-2 — the coronavirus that causes COVID-19 — infects the cells in your nose much more easily than the cells in your throat or your lungs. And early research has found that only a small percentage of hospitalized COVID-19 patients whose eye fluid was tested came up positive for having the virus in their eyes — although it should be noted that swabbing eye fluid isn’t standard in coronavirus patient care, so there could certainly be more cases than have been recorded. Plus, Dr. Thomas Steinemann, a spokesperson for the American Academy of Ophthalmology, told NPR that the coronavirus would have to run “a more circuitous route” to travel from your peepers to your respiratory system. First, the virus would have to get through the eyes’ mucous membrane. Then it would need to be swept by tears behind your cheeks to reach your nasal cavity. And from there, it would need to flow from your nose to your throat. It’s certainly possible, but it’s less direct than inhaling the virus directly through your nose or mouth. And the CDC notes that while the nose and mouth are the main areas where the virus enters the body, “it may be possible that a person can get COVID-19 by touching a surface or object that has the virus on it and then touching their own mouth, nose, or possibly their eyes.” This could be subject to change as we learn more about the virus, however. Health officials including Fauci and the CDC initially discouraged the public from wearing face masks early in the pandemic, after all, before reversing course and calling for uniform mask wearing once they realized the extent of asymptomatic spread. Keep in mind that COVID-19 is a brand new disease that has infected almost 17 million people across the globe in just a little over six months. Public safety recommendations will continue to evolve. So should you pair goggles or a shield with your mask when going to the store or traveling through a crowded area? The bottom line is that it’s not recommended for the general public just yet, but it also couldn’t hurt if you want to take an extra step to protect yourself. You should definitely wear a mask in public, avoid crowded places and wash your hands before and after touching your face, however. And avoid touching your eyes. Follow more of MarketWatch’s coronavirus coverage here."}]}