{"article": [{"url": "https://www.marketwatch.com/story/the-feared-jumbo-mortgage-debacle-is-here-thanks-to-the-coronavirus-and-ready-to-pound-the-housing-market-2020-07-22", "published": 1595689160.0, "headline": "The feared jumbo mortgage debacle is here â\u0080\u0094 thanks to the coronavirus â\u0080\u0094 and ready to pound the housing market", "body": "Back in January, my column for Marketwatch detailed the massive danger that jumbo mortgages posed for U.S. mortgage and housing markets.Â After months of actions to counter the impact of COVID 19, the potential jumbo mortgage disaster is clearer than ever. Jumbo mortgages are loans that are larger than the limits set for Fannie Mae, Freddie Mac or the FHA to guarantee or insure.Â During the craziest years of the housing bubble, 2004 through 2007, close to $3.1 trillion in jumbos was originated.Â Most were offered with insanely easy terms, which helped precipitate the collapse that followed. As housing markets plunged over the next five years,Â jumbo loans for home purchases all but dried up.Â Jumbo mortgage lending returned only gradually during the early years of the so-called housing recovery.Â Â Â All that changed starting in 2016.Â Since then, jumbo mortgage lenders have tripped over each other to hand out huge loans to applicants.Â Between 2016 and 2019, roughly $1.5 trillion of these jumbos were originated.Â Cash-out refinancing also returned with a vengeance.Â Reversing the traditional approach, interest rates and underwriting standards for jumbos were actually lower than for conventional loans.Â For these lenders, mortgages offered to high-income borrowers who could afford the monthly payments seemed the least risky of all. Look at the table below showing jumbo originations in the 25 largest U.S. metros since the peak of the housing bubble.Â Roughly two-thirds of all jumbo loans have been originated in these 25 major housing markets. Wealthy homeowners in trouble Since the COVID-19 related lockdowns began in late March, most media attention has been focused on soaring unemployment rates for lower income workers in service industries.Â For good reason.Â According to data provider Black Knight Financial Services, 46% of borrowers who obtained a forbearance actually made a mortgage payment in April.Â However, that percentage has plunged over the past two months.Â According to Black Knight, 22% of borrowers had paid their mortgage in May and only 15% did so in June.Â Read: Home prices could fall in major cities as Americans sour on urban living, says Nobel Prize-winning economist Robert Shiller Also see:Â More than 20 million Americans may be evicted by September What has been largely overlooked are the mounting problems of wealthier homeowners with jumbo mortgages.Â They have also been slammed by the lockdowns.Â According to Black Knight, 11.8% of all jumbo loans were in forbearance as of June 16.Â That is more than double the rate as recently as April.Â In a mid-June MarketWatch article, the CEO of Caliber Home Loans stated that 42% of their customers who requested a forbearance were self-employed.Â Keep in mind that the CARES legislation did not say anything about jumbo mortgages.Â Lenders were under no obligation to offer forbearances to any jumbo mortgage borrower.Â Â Read: These homeowners are seeking mortgage forbearance and their reasons why say a lot about the economy Jumbo lenders have been quick to notice that the lockdowns of state economies due to the COVID-19 panic were negatively impacting homeowners with jumbos.Â Most lenders sharply cut back or even stopped offering cash-out refinancing.Â Interest rates quickly climbed above those for conventional loans.Â For example, Wells Fargo WFC, Â â\u0080\u0094 the largest provider of jumbos â\u0080\u0094 limited jumbo refinancing to customers who had at least $250,000 in liquid funds parked at the bank.Â Some non-bank lenders have ceased providing jumbo mortgages completely. Why are jumbo lenders so rattled by the impact of the lockdowns on wealthy homeowners?Â After all, the widely accepted view was that higher paid employees and freelancers shifted to working from home and have avoided massive firings or furloughs. This is simply untrue.Â Freelancers and highly paid contract workers in almost every industry have been hammered by the lockdown.Â For example, the Los Angeles metro area has one of the nation's highest concentrations of skilled freelance workers.Â Recent California figures put the area's unemployment rate at 21%.Â Â Even more important for lenders, many homeowners with jumbo mortgages are owners of small businesses, which have been devastated by the lockdowns.Â While unemployed workers have benefited by the $600 a week bonus that continues to be paid at least through the end of July, this supplement has made it extremely difficult for business owners to lure workers back to their jobs when they can earn more by staying home.Â Â Jumbo mortgage delinquency menace In an October 2019 column for MarketWatch, I focused on the growing problem of millions of modified mortgages that have re-defaulted.Â I explained that most of the residential mortgage loans held by large banks are jumbo mortgages.Â Unlike smaller loans that were securitized and sold off to investors, jumbo loans too big to be guaranteed by Fannie or Freddie were kept in their portfolios. In an October 2019 article, Mark Edelson, editor of The Journal of Structured Finance, estimated that 95% of jumbo loans remain on the balance sheet of the banks. My October 2019 column on mortgage re-defaults described the situation of two of the nation's largest commercial banks.Â In their mid-2019 FDIC call report, each showed a re-default rate of more than 40% for their modified loans, known as Troubled Debt Restructurings (TDRs). Moreover, under the revised standards promulgated by the Financial Accounting Standards Board (FASB) after the housing collapse, banks were required to report only those re-defaults which occurred within 12 months of the loan being modified and declared to be a TDR.Â Re-defaults after that 12-month period did not have to be reported by the bank.Â In my column last October, I cited a 2017 study by Fitch Ratings showing that 75% of Fannie Mae modifications that re-defaulted had done so within two years after the modification. Yet the actual re-default rates for commercial banks jumbo mortgage loans are much higher than what they have reported to the FDIC. Making matters worse for jumbo lenders is the unfolding disaster of the COVID-19 lockdowns.Â No one knows how many millions of jumbo borrowers are finding it increasingly difficult to make their monthly mortgage payment.Â As borrowers continue to skip paying their mortgage, the patience of lenders with forbearances will start to run out.Â Â Â Â Â Keith Jurow is a real estate analyst who covers the bubble-era home-lending debacle and its aftermath. Contact him atÂ www.keithjurow.com. More:Â Jumbo mortgages are haunting the housing market, and things could get really scary Plus: Look what happened to home prices when the coronavirus sent stocks into a bear market"}]}