{"article": [{"url": "https://www.marketwatch.com/story/is-it-safe-to-go-to-the-barber-can-i-play-bridge-or-hug-my-grandkids-2020-07-06", "published": 1594012040.0, "headline": "Is it safe to get a haircut? Can I play bridge, or hug my grandkids?", "body": "This article is reprinted by permission from NextAvenue.org. Stay-at-home orders were put in place throughout the country to stop the spread of the coronavirus and “flatten the curve” to prevent the health care system from becoming overwhelmed. In initially hard-hit areas of the country such as New York and New Jersey, these measures have worked and there has been a sharp decline in the number of new coronavirus cases. But as businesses start to re-open, it’s important to remember that COVID-19 is still a threat. According to the New York Times’ live map, more than half of the country has seen an increase in COVID-19 cases since states began to lift shelter-at-home restrictions. Dr. Romilla Batra, chief medical officer at SCAN Health Plan in Long Beach, Calif., says, “As friends, family and community members re-emerge into public life, please don’t let your guard down.” Next Avenue readers have been asking questions about what re-entry means for daily life, so we reached out to a group of experts for answers to 10 of them: 1. If I wear a mask, but others are not, am I at risk of contracting the virus? Dr. Elsa Thomas, of Atlantic Medical Group’s Internal Medicine Faculty Associates in New Jersey, explains, “When we wear a mask, we reduce the likelihood of transmitting the virus to people around us. The mask also creates a layer of protection to the wearer by reducing the likelihood of touching one’s nose and mouth.” If you are out and someone is not wearing a mask, you can either ask them to put one on (many stores will require it for entry), keep more than 6 feet away from the maskless person or leave the area altogether. Also, remember to use hand sanitizer before and after going anywhere and to thoroughly wash hands when you return home. 2. When can I start babysitting my grandchildren again? It’s been especially hard these past few months for grandparents not to visit with their grandchildren. It is OK and emotionally beneficial to spend time together if both you and your grandchildren are doing a good job social distancing from others. However, it is probably not a good idea to babysit, especially for young children. Dr. Faisel Syed, national director of primary care, ChenMed in Lakeland, Fla., says, “Older adults with a weakened immune system must be careful around children who understandably are likely to be less effective in coronavirus infection prevention behaviors (and can transmit the virus inadvertently).” Also read: We’re looking for a place that’s not too hot, not too cold, and accepting of different races — where should we retire? Babysitting usually requires a lot of hands-on care. Unless the children are highly independent, it is too risky right now. 3. Can I safely hug my adult children, grandchildren or friends? Unfortunately, hugging loved ones outside of your household is still considered risky. Mary Ann Hart, an associate professor within the Online Master of Health Administration Program Director at Regis College in Weston, Mass., explains: “As long as COVID-19 is still in your community and there is no vaccine available, avoid physically touching someone who is not an immediate household member, even if you are both wearing a mask. Throw kisses and give virtual hugs.” If you do choose to embrace a loved one, Batra says, “Use the utmost of caution. Wear masks, wash your hands carefully before and after, and avoid speaking or coughing while hugging to limit the likelihood of transmission.” 4. Do I need to quarantine if I travel between states? On June 24, the governors of New York, New Jersey and Connecticut issued a “joint travel advisory,” mandating a 14-day quarantine for anyone traveling to their states from many states, including Florida and Texas. If you are traveling from one state to another (especially one where COVID-19 is on the rise), see what rules, if any, have been put in place. 5. Can I safely bake for a friend or eat baked goods someone makes for me? Thomas says” “I think it is absolutely safe to bake for a neighbor and exchange baked goods. This is a great way to maintain social connections that we all need.” Just be sure to use general food safety rules, including washing your hands, keeping cooking surfaces clean and not preparing food if you are feeling unwell. 6. Hair salons and barbershops are open, but is it OK for me to go? Salons and barbershops should look very different when they re-open. Precautions should include everyone (staff and clients) wearing masks, limited occupancy, sanitizing surfaces and using barrier methods to keep patrons separated. Dr. William Dale, director of City of Hope’s Center for Cancer and Aging in Duarte, Calif., says, “Ask a lot of questions to see what steps they have taken. Personally, because of the close proximity of these spaces, it may be better to wait a while, especially if you have underlying health conditions.” Consider asking your stylist if he or she would make a house call and conduct your service in your backyard (with both of you still wearing masks). 7. Can I go on a vacation? This summer, a staycation may be a better idea than going away. Batra explains: “Travel increases your chances of getting and spreading COVID-19, regardless of the type of transportation you choose. Airplanes, buses, trains, airports, stations and rest stops are all places where travelers can be exposed to the virus in the air and on surfaces. These are also places where it can be challenging to keep 6 feet apart from other people.” If you do choose to travel, follow the Centers for Disease Control and Prevention (CDC) guidelines. When you return from your trip, monitor your health for signs of COVID-19 before visiting others. 8. Is it safe to go out to eat? Yes, with precautions. Thomas says, “Sitting outdoors and enjoying a nice dinner is something I consider safe. If you have dinner with another couple, make sure they have also been practicing social distancing and are symptom-free.” Servers should wear masks, the menus should be online or disposable and tables spaced out. If you are concerned, consider picking up takeout and eating with another couple in your backyard. This way, you can enjoy each other’s company without being exposed to restaurant patrons. 9. When can I get back to playing bridge and other games and going to group exercise classes? Dale says, “Better to avoid activities like playing bridge.” This also includes games like mahjong. “Players touching tiles will be exchanging droplets that sit on the surface and inadvertently spread the virus,” notes Dale. Instead, do individual brain-boosting activities such as jigsaw puzzles, crossword puzzles or playing card games on the computer. As for group exercise, choose outdoor activities such as golf, tennis or going for a walk (with masks) over indoor activities. Water aerobics classes seem like a good option since pools are relatively safe, although Dale suggests avoiding public pools and larger groups. See: Is it safe to go back to the gym if you’re over 50? And: Here’s a guide to staying fit at home 10. Should I go to the doctor? Emphatically, yes! Thomas says, “I can’t emphasize enough the importance of taking care of your health. Your doctor and local hospital are ready for you.” If you are sick or have had contact with a person with COVID-19, stay home until you are better and symptom-free (and if you need medical assistance, use the telehealth option health care providers offer.) See: How to get the most out of a telehealth appointment: 9 tips Otherwise, don’t put off seeing your doctor for routine exams and tests such as colonoscopies and mammograms. Dale says, “Many patients have avoided seeking treatment, ordering their medications or seeing their doctors due to COVID-19 fears. It is time for patients to re-engage with their providers. Cancer won’t stop for a pandemic and neither will heart disease, diabetes or other non-COVID 19 health issues.” There have also been new procedures put in place in hospitals and medical offices to ensure patient safety when people come in to seek treatment. Thomas explains, “Most practitioners have eliminated the waiting rooms, so you go directly from your vehicle to the physician exam room or the appropriate room to have your test/study. We have screened everyone who enters our buildings with questions and temperature checks. We have created safe, clean environments so that there is little to no risk of virus transmission.”Be proactive and minimize your risk Overall, it’s essential to be mindful. Dr. Eric Mizuno, internist and Medical Director of Admiral at the Lake, a senior living community in Chicago, says, “When it comes to minimizing your risk of COVID-19, you have to be proactive regardless of your age. You can’t rely on others to protect you, you have to protect yourself. Assume you have it and assume the people around you have it.” But being cautious does not mean avoiding socialization altogether. Social isolation itself is a major health concern, especially for older adults. Dale explains, “I have been trying to eliminate the phrasing ‘social distance’ because it gives the wrong message. We need to protect both physical health and emotional health and this means being physically distant but socially close to those we love.” It’s about accessing and minimizing your risk, while staying active, maintaining relationships and enjoying your life. Randi Mazzella is a freelance writer specializing in a range of topics from parenting to pop culture to life after 50. She is a mother of three and lives in New Jersey with her husband and teenage son. Read more of her work on randimazzella.com. This article is reprinted by permission from NextAvenue.org, © 2020 Twin Cities Public Television, Inc. All rights reserved."}]}