{"article": [{"url": "https://www.marketwatch.com/story/heres-what-the-ceos-of-apple-amazon-facebook-and-alphabet-will-say-at-wednesdays-antitrust-hearing-2020-07-28", "published": 1596011360.0, "headline": "Hereâ\u0080\u0099s what the CEOs of Apple, Amazon, Facebook and Alphabet will say at Wednesdayâ\u0080\u0099s antitrust hearing", "body": "The CEOs of four of the worldâ\u0080\u0099s largest and most influential tech companies are scheduled to testify Wednesday before a House antitrust panel, and they plan to emphasize how their products better American lives and jobs. Jeff Bezos of Amazon.com Inc. AMZN, +3.01% Â , Tim Cook of Apple Inc. AAPL, +1.74% Â , Mark Zuckerberg of Facebook Inc. FB, +0.26% Â and Sundar Pichai of Google parent Alphabet Inc. GOOGL, +1.82% Â GOOG, +1.97% Â will appear via videoconference starting at noon Eastern. The House Judiciary Antitrust Subcommittee is expected to grill the executives â\u0080\u0094 who have never appeared before lawmakers together â\u0080\u0094 over their business practices and influence over consumersâ\u0080\u0099 lives. Read: Congress has a million-plus documents from Big Tech antitrust investigation, and are ready to grill big-name CEOs According to prepared statements released Tuesday night, hereâ\u0080\u0099s what each will say:Jeff Bezos Bezosâ\u0080\u0099s opening statement is heavy on personal anecdotes, with stories about how his parents and grandparents influenced him. On his grandfather: â\u0080\u009cHe taught me that you can take on hard problems. When you have a setback, you get back up and try again. You can invent your way to a better place.â\u0080\u009d Bezos emphasizes Amazonâ\u0080\u0099s focus on customer service. â\u0080\u009cBy focusing obsessively on customers, we are internally driven to improve our services, add benefits and features, invent new products, lower prices, and speed up shipping times â\u0080\u0094 before we have to. ... Not every business takes this customer-first approach, but we do, and itâ\u0080\u0099s our greatest strength.â\u0080\u009d He cites positive poll numbers for the Amazon brand, and notes Amazonâ\u0080\u0099s billions of dollars of investment in the U.S. and its massive workforce, including stories about an Amazon worker and a third-party sellers. As for competition, he says â\u0080\u009cthereâ\u0080\u0099s room in retail for many winners,â\u0080\u009d noting competitors such as Walmart, Target and Costco, as well as startups such as Shopify and Instacart. â\u0080\u009cThe range of retail competitors and related services is constantly changing, and the only real constant in retail is customersâ\u0080\u0099 desire for lower prices, better selection, and convenience.â\u0080\u009d Left unsaid is Amazonâ\u0080\u0099s 49% market share of online retail spending, as of 2018. Bezos also says his company is not above scrutiny. â\u0080\u009cI believe Amazon should be scrutinized. We should scrutinize all large institutions, whether theyâ\u0080\u0099re companies, government agencies, or non-profits. Our responsibility is to make sure we pass such scrutiny with flying colors,â\u0080\u009d he writes. Bezos closes by praising the late Rep. John Lewis and saying that despite the challenges the country currently faces, from racial inequality to coronavirus to climate change, â\u0080\u009cI have never been more optimistic about our future.â\u0080\u009dTim Cook Cook starts his statement by also praising Lewis and his legacy. He skips any personal anecdotes, and jumps right to the point, saying â\u0080\u009cApple is a uniquely American company whose success is only possible in this country.â\u0080\u009d He says that Apple is focused on making the best products, not necessarily the most, and that its focus is always on the customer. Cook points to one saying by co-founder Steve Jobs: â\u0080\u009cWe only make things that we would recommend to our family and friends.â\u0080\u009d Cook notes Apple customersâ\u0080\u0099 high satisfaction with their products, saying that is â\u0080\u009cthe best measureâ\u0080\u009d that the company is on the right track. He says Apple does not have a dominant market share in any category, and notes the â\u0080\u009cfiercely competitiveâ\u0080\u009d smartphone market features rivals such as Samsung Electronics, LG Electronics, Huawai and Google. As for the App Store â\u0080\u0094 the focus of many of the antitrust complaints and the source of roughly $15 billion a year, taken from a 30% cut of sales â\u0080\u0094 Cook says app developers â\u0080\u009cset prices for their apps and never pay for â\u0080\u0098shelf space.â\u0080\u0099â\u0080\u009d â\u0080\u009cFor the vast majority of apps on the App Store, developers keep 100% of the money they make,â\u0080\u009d he says, claiming that for apps that are subject to commissions, Appleâ\u0080\u0099s fees are cheaper that software distribution before the development of the App Store. That may be a bit misleading, since Apple requires consumer apps to feature in-app sign-ups and payments, so Apple can take a cut â\u0080\u0094 a policy that email startup Hey recently got into a huff about. Cook boasts that Appleâ\u0080\u0099s ecosystem has helped create nearly 2 million jobs in the U.S., and contributed to half a trillion dollars in worldwide commerce in 2019 â\u0080\u0094 â\u0080\u009cnothing short of an economic miracle.â\u0080\u009d He also notes Appleâ\u0080\u0099s investments in education and its commitment to privacy. Cook calls scrutiny â\u0080\u009creasonable and appropriateâ\u0080\u009d and says the company is approaching the hearing â\u0080\u009cwith respect and humility,â\u0080\u009d though he says â\u0080\u009cwe make no concession on the facts.â\u0080\u009d â\u0080\u009cI share the subcommitteeâ\u0080\u0099s belief that competition is a great virtue,â\u0080\u009d he says, â\u0080\u009cthat it promotes innovation, that it makes space for the next great idea and that it gives consumers more choices.â\u0080\u009dMark Zuckerberg Zuckerberg lays out his statement like a grade-school essay, organized under eight sections. â\u0080\u009cFacebook is part of an industry that has changed the world,â\u0080\u009d he says in his introduction. â\u0080\u009cIâ\u0080\u0099m proud that we stand for American values like giving every person a voice and expanding access to opportunity.â\u0080\u009d He says that Facebook competes globally, and that â\u0080\u009cOur story would not have been possible without U.S. laws that encourage competition and innovation. I believe that strong and consistent competition policy is vital because it ensures that the playing field is level for all.â\u0080\u009d He also emphasizes that â\u0080\u009cFacebook is a proudly American company,â\u0080\u009d but warns that thereâ\u0080\u0099s â\u0080\u009cno guarantee our values will win out. For example, China is building its own version of the internet focused on very different ideas, and they are exporting their vision to other countries.â\u0080\u009d As for its acquisitions â\u0080\u0094 a main point of antitrust contention â\u0080\u0094 Zuckerberg says they have helped drive innovation. â\u0080\u009cAcquisitions bring together different companiesâ\u0080\u0099 complementary strengths,â\u0080\u009d he says. â\u0080\u009cThe end result is better services that provide more value to people and advertisers, which is a core goal of Facebookâ\u0080\u0099s acquisition strategy.â\u0080\u009d Zuckerberg also skews a bit off-topic. â\u0080\u009cI know our primary goal at this hearing is to talk about antitrust and competition issues, but with four major tech CEOs appearing before Congress, we also have an opportunity to talk about how technology can better serve society. ... I hope at least some of todayâ\u0080\u0099s hearing will touch on the future, and how our collective scale and resources could be harnessed to help people and businesses.â\u0080\u009d He concludes on a slightly defensive note: â\u0080\u009cAs I understand our laws, companies arenâ\u0080\u0099t bad just because they are big. Many large companies that fail to compete cease to exist. This is why weâ\u0080\u0099re focused on building and updating our products to give people the best possible experiences. ... . Iâ\u0080\u0099ve long believed that the nature of our industry is that someday a product will replace Facebook. I want us to be the ones that build it, because if we donâ\u0080\u0099t, someone else will.â\u0080\u009dSundar Pichai Pichai, an immigrant from India, starts off on the subject of opportunity, both personally and globally. â\u0080\u009cAt its heart, a discussion about competition is a discussion about opportunity,â\u0080\u009d he says. â\u0080\u009cOur work would not be possible without the long tradition of American innovation, and weâ\u0080\u0099re proud to contribute to its future,â\u0080\u009d he says, noting Googleâ\u0080\u0099s 75,000 U.S. employees and estimated $20 billion in U.S. investments in 2018, and that the tech giant has been among the top five U.S. investors over the past three years. Pichai uses personal stories of Google users, and how its products help individuals and Main Street businesses. He also touts Googleâ\u0080\u0099s technology investments in Americaâ\u0080\u0099s future, saying â\u0080\u009cour teams of engineers are helping America solidify its position as the global leader in emerging technologies like artificial intelligence, self-driving cars, and quantum computing.â\u0080\u009d As for competition, he says Googleâ\u0080\u0099s success is not guaranteed and notes highly competitive global markets. â\u0080\u009cTodayâ\u0080\u0099s competitive landscape looks nothing like it did 5 years ago, let alone 21 years ago, when Google launched its first product, Google Search,â\u0080\u009d he says. He also claims that consumers have benefited from lower ad prices. â\u0080\u009cFor example, competition in ads â\u0080\u0094 from Twitter, Instagram, Pinterest, Comcast and others â\u0080\u0094 has helped lower online advertising costs by 40% over the last 10 years, with these savings passed down to consumers through lower prices.â\u0080\u009d He closes by emphasizing Googleâ\u0080\u0099s commitments to user privacy â\u0080\u0094 though says â\u0080\u009cmore must be done to protect users across industriesâ\u0080\u009d â\u0080\u0094 and ensuring â\u0080\u009cAmericaâ\u0080\u0099s competitive technological edge in the world.â\u0080\u009d"}]}