{"article": [{"url": "https://www.marketwatch.com/story/why-china-is-rooting-for-trump-to-win-11596656684", "published": 1596704300.0, "headline": "Why China is rooting for Trump to win", "body": "President Donald Trump meets with China's President Xi Jinping in Beijing on Nov. 9, 2017. AFP via Getty Images “Four more years!” is what you’d expect to hear at one of President Donald Trump’s rallies—that is if he could hold them. The pandemic put an end to that. But beyond his base—mostly white, mostly male, mostly older voters living in mostly rural America—you know who else is hoping for another four years of Trump? Chinese President Xi Jinping and his authoritarian communist government. This may come as news to Trump, who claims that China is “desperate” to have former Vice President Joe Biden win the presidency. Why? Because a Biden win, the president tweeted recently, would mean that Beijing “can continue to rip-off the United States, as they have done for decades, until I came along!” Really? That’s funny, because the truth is quite different. China would love another four years of Trump. It is salivating for another four years of Trump. In Beijing, the choice is clear: Trump’s the man. “Zài sì nián!” Four more years! Follow the latest developments in Election 2020 How can this be? After all, the president claims no has been tougher on China than him. But the disconnect that Trump has never understood, is that for all of his efforts to make America great, he has inflicted tremendous damage not on China, but on the United States. America divided He inherited an America that was already divided among cultural, racial and economic lines and made things worse with nearly four years of an us-versus-them divisiveness that has further weakened our nation. Thanks to this president, Americans seem pitted against each other with an intensity and vitriol that hasn’t been seen since the Civil War. This is the greatest gift that Xi Jinping (and Russia’s Vladimir Putin, by the way) could ever ask for. However much Trump thinks he has hammered China, the damage he has done to American power and prestige, America’s reputation, America’s adherence to democratic values and global institutions, far outweighs whatever damage he has done to China. And what damage has he done to China? “Trade wars are easy to win, believe me,” Trump famously said (he now denies saying this), but the reality is quite different. He keeps saying that thanks to tariffs, China is paying us billions. He has never understood that tariff is just another word for a tax on American consumers, the end users who always bear the brunt of import duties. Don’t take my word for it, just ask most economists and even the Federal Reserve, which said that Trump’s strategy led to job losses and higher prices in the United States. “The tariffs, thus far, have not led to increased activity in the U.S. manufacturing sector,” the Fed says. Then there’s JPMorgan Chase, which has estimated that the cost to the average American household from Trump’s tariffs was about $1,000. Wouldn’t you like to have an extra thousand bucks right now? TPP failure Beijing also got a good laugh three days into Trump’s term when the new president yanked the U.S. out of the Trans-Pacific Partnership, a trade agreement between the United States and 11 Pacific Rim countries—but not China, which by design, was excluded. This was one of the main TPP goals: to maintain American trade dominance in Asia and ward off China’s growing economic clout. It also would have, according to research by the Peterson Institute, boosted U.S. exports by $123 billion. (In fairness it should be noted that Hillary Clinton, as a sop to the left, also came out against TPP and may have scrapped it had she won). In any case, Trump killed it. What has happened since? America’s void has been filled—you guessed it—by China. The trade pact, now rebranded as the Comprehensive and Progressive Agreement for Trans-Pacific Partnership, “would give China greater access to markets with more than half a billion people, which will be among the world’s most attractive in the years to come,” notes the Nikkei Asian Review, and also offer China “a free trade bridge to the Americas as it includes Canada, Chile, Mexico and Peru.”Extortionist in chief On a lesser but highly symbolic scale, Trump’s demands that the U.S. government get a slice of any potential sale of the U.S. operations of TikTok, the Chinese-born video app that’s wildly popular with young people around the world, shows him to be not a capitalist, but an extortionist. Forget the free market. We have a president who thinks its perfectly normal to parachute into a private-sector deal and demand some sort of payoff in return for greenlighting the deal. Shaking down the private sector? Why not? Foreign nations that are steeped In corruption themselves—like China—look at this and countless other actions and cheer the damage that Trump is doing to cherished American values like rule of law, and know that our global reputation is tarnished, and with it, our credibility. Last month Secretary of State Mike Pompeo gave a speech in which he blasted China’s human-rights record, its suppression of ethnic minorities, crackdowns on the press and more. Pompeo’s points were valid, but the fact that they were being expressed on behalf of an administration that itself dabbles in such things undermines what the administration presumes is some sort of American moral authority. This is the damage being done. China loves it. The Russians love it. Four more years? The answer in Beijing, Moscow and the capitals of other bad actors is: Yes, please."}]}