{"article": [{"url": "https://www.marketwatch.com/story/trump-is-openly-sabotaging-the-election-and-heres-how-you-can-stop-him-11597841132", "published": 1597833080.0, "headline": "Trump is openly sabotaging the election, and hereâ\u0080\u0099s how you can stop him", "body": "To get around any possible delays by the U.S. Postal Service, you can drop off your ballot at officially designated locations. Joe Raedle/Getty Images Â Thereâ\u0080\u0099s really no other way to say it: the president of the United States is trying to sabotage the U.S. election by denying the Postal ServiceÂ money it needsÂ to process voting by mail. Itâ\u0080\u0099s not subtle, and itâ\u0080\u0099s not seriously disputed that heâ\u0080\u0099s trying to do thisâ\u0080\u0094in fact, President Donald Trump came right out andÂ admitted what heâ\u0080\u0099s doing.Â It isÂ welcome newsÂ that Postmaster General and Trump megadonor Louis DeJoy has announced that the Post Office â\u0080\u009cwill deliver the nationâ\u0080\u0099s election mail on timeâ\u0080\u009d â\u0080\u0094 but it is astounding that it was necessary to issue this statement. DeJoyâ\u0080\u0099s statement is essentially the equivalent of a bank telling customers it has enough money to meet any demands from depositorsâ\u0080\u0094itâ\u0080\u0099s the kind of thing that, one would think, would normally go without saying. The reason DeJoy felt compelled to issue this â\u0080\u009cthe sky is still blueâ\u0080\u009d statement is becauseÂ voters have gotten concernedÂ that they couldnâ\u0080\u0099t trust the Postal Service to carry out its normal function. These concerns did not materialize out of thin air: USPS had recently told 46 states and DC thatÂ it couldnâ\u0080\u0099t guarantee deliveryÂ of last-minute ballot requests in time for the election, and there were reports ofÂ delays in mail delivery.Â Sadly, itâ\u0080\u0099s worthÂ updating andÂ applying Ronald Reaganâ\u0080\u0099s old â\u0080\u009ctrust, but verifyâ\u0080\u009d maxim to both DeJoy and Trumpâ\u0080\u0094although for this crew, we have to call it â\u0080\u009cdonâ\u0080\u0099t trust, but be absolutely sure to verify.â\u0080\u009dÂ Senators should hold DeJoyâ\u0080\u0099s feet to the fire if he testifies before the Homeland Security and Government Affairs committeeÂ this Friday. They should make sure they receive updates before the election in order to ensure that DeJoy fulfills his promise of on-time delivery in the context of the election.Â Senators should also gather information from rank-and-file postal employees in order to find out whether more changes are neededâ\u0080\u0094for example, a reversal of DeJoyâ\u0080\u0099s â\u0080\u009cbans on overtime and extra delivery trips.â\u0080\u009d They should also make sure USPS has the money it needs to carry out its mission. Treasury Secretary Steven Mnuchin echoes his boss in sayingÂ aid supported by Democrats isnâ\u0080\u0099t necessary: senators should determine for themselves whether this is indeed the case. But we should also recognize that, even if DeJoy keeps to his word and the Postal Service has all the funding it needs, at least two other problems remain.Â First, damage to voter confidenceÂ may already have been done. Second, there is no indication that Trump has given up on his efforts to sabotage the election. Itâ\u0080\u0099s clear that Trumpâ\u0080\u0099s strategy has at least three related goals: 1) suppress the mail-in vote, which he believes willÂ favor his opponent, Joe Biden; 2) allow Trump toÂ claim victory on Nov. 3Â if heâ\u0080\u0099s leading in the early returns while mail-in ballots remain to be counted; and 3) if none of that works and Biden wins anyway, baselesslyÂ plant enough doubtÂ in the minds of his supporters that they will incorrectlyÂ believe the election was illegitimate. This perfidious effort to manipulate the election is nothing new and will come as no surprise to anyone who has been following Trumpâ\u0080\u0099s twisted electoral strategy and, indeed, his political career.Â In 2016, TrumpÂ welcomed Russian assistanceÂ aimed at improving his chances in the election. When that episode was exposed, a number of Trumpâ\u0080\u0099s associatesÂ were convicted of crimes.Â Breaking news: Trump campaignâ\u0080\u0099s contacts with Russia posed â\u0080\u0098graveâ\u0080\u0099 risk in 2016, bipartisan Senate intelligence report concludes Last year, TrumpÂ tried to pressureÂ Ukraineâ\u0080\u0099s president into illicitly tilting the electoral scales in Trumpâ\u0080\u0099s favor by falsely smearing Joe Biden. When that plot was exposed, Trump was impeached.Â But Trump is resourceful when it comes to trying to stay in power, and impeachment didnâ\u0080\u0099t stop him from looking for ways to gain an underhanded advantage in the election (Sen. Susan Collinsâ\u0080\u0099s hopesÂ notwithstanding).Â People who have become attached to theÂ notion of constitutional democracyÂ can be forgiven if they are worried. But itâ\u0080\u0099s essential to take a deep breath, maintain perspective and not panic.Â Trumpâ\u0080\u0099s actions reflect his desperation. He isÂ trailing in the pollsÂ and knows he could use a boostâ\u0080\u0094even an ill-gotten one. The fact that Trump is relying on a deeply immoral,Â possibly illegalÂ scheme to shore up his chances at re-election does not guarantee he will succeedâ\u0080\u0094far from it. One thing we have in our favorâ\u0080\u0094those of us who feel strongly about free and fair electionsâ\u0080\u0094is that Trumpâ\u0080\u0099s plan has been exposed with nearly three months to go before the election takes place. That means we have time to take a deep breath and make a plan for preserving our democracy against Trumpâ\u0080\u0099s despicable efforts to take it away. Trump wants Biden voters toÂ lose faith in the processÂ and to incorrectly believe that thereâ\u0080\u0099s no point to voting by mail. DeJoyâ\u0080\u0099s statement may help shore up some of that voter confidenceâ\u0080\u0094but, no matter what Trump, DeJoy or anyone else does, there are steps we can all take to make sure our vote is countedâ\u0080\u0094no matter who we choose to vote for. Voting experts tell us there are concrete, specific actions all votersâ\u0080\u0094no matter who they vote forâ\u0080\u0094can take to make sure their vote counts (as Michelle Obama alluded to inÂ her powerful speech last night). Here are a few important points to keep in mind, depending on the rules in your state (and please be sure toÂ confirm informationÂ with your state and local election officials): If your state allows voting by mail and you need to request a mail ballot, donâ\u0080\u0099t waitâ\u0080\u0094request it now. When you receive your ballot, again, donâ\u0080\u0099t waitâ\u0080\u0094return it as soon as you can. One voting rights expert calls the strategy of moving promptly with mail-in ballots a good way to â\u0080\u009cflatten the absentee ballot curveâ\u0080\u009d. You canÂ track your ballot onlineÂ to receive confirmation that it was received and accepted. Alternatively, in some states youÂ may be ableÂ to use aÂ ballot drop boxÂ or you may be allowed to drop off your ballot atÂ an election office or polling location, all of which can allow you to skip the mail process when you cast your ballot. In theÂ 41 states that allow it, early voting can beÂ another wayÂ to make sure your cote is counted. Some states begin early in person votingÂ 45 days before the electionÂ and some have weekend voting options, meaning you donâ\u0080\u0099t have to wait until the last minute. AsÂ voting expert Michael McDonald says, â\u0080\u009cYou donâ\u0080\u0099t have to be afraid if your mail ballot does not arrive or [you decide you] donâ\u0080\u0099t want to vote [by mail]. You can always vote in-person. Election officials have safeguards to ensure no duplicate votes. You may need to bring your mail ballot (if you have it) or vote a provisional ballot.â\u0080\u009d Trump has tried to scare voters out of using the mail by falsely making them think they may have to worry about their vote getting in on time. He knows this is naked deceptionâ\u0080\u0094heâ\u0080\u0099sÂ apparently using the mail himself to vote in Floridaâ\u0080\u0099s primary, as he has in the past. Trumpâ\u0080\u0099s actions are an act of desperation, the acts of an amoral man who knows he is trailing in the polls and will do whatever he can to try to gain an edge.Â Whether you use the mail or another available option (depending on where you live) you have the power here, not Trump. Thatâ\u0080\u0099s what it means to have a democracyâ\u0080\u0094power resides in â\u0080\u009cWe the peopleâ\u0080\u009d.Â It will requireÂ a little planningÂ and now is certainly not a time to procrastinate when it comes to the most cherished right in a democracy. People in Belarus are risking and in some casesÂ enduring tortureÂ to stand up for a free and fair election. Thankfully, we donâ\u0080\u0099t need the same level of courage to make our democracy work.Â If his efforts to undermine confidence in the Postal Service donâ\u0080\u0099t work, Trump will surely try something elseâ\u0080\u0094but heâ\u0080\u0099s running out of time.Â If we are careful, if we are responsible, and if we donâ\u0080\u0099t give in to Trumpâ\u0080\u0099s scare tactics, we have all the tools we need to make sure our vote is countedâ\u0080\u0094which is the last thing Trump wants, as hisÂ cartoon villainÂ actions make clear. Chris Edelson is an assistant professor of government in American Universityâ\u0080\u0099s School of Public Affairs. He has written two books on presidential power. Follow him atÂ @ChrisEdelsonÂ on Twitter."}]}