{"article": [{"url": "https://www.marketwatch.com/story/tiktok-says-it-will-leave-hong-kong-after-recent-passage-of-security-law-2020-07-07", "published": 1594094360.0, "headline": "TikTok says it will leave Hong Kong after recent passage of security law", "body": "HONG KONG (AP) — TikTok said Tuesday it will stop operations in Hong Kong, joining other social media companies in warily eyeing ramifications of a sweeping national security law that took effect last week. The short-form video app’s planned departure from Hong Kong comes as various social media platforms and messaging apps including Facebook FB, +0.26% , WhatsApp, Telegram, Google GOOGL, +1.82% and TWTR, -0.23% balk at the possibility of providing user data to Hong Kong authorities. The social media companies say they are assessing the ramifications of the national security law. The social media companies say they are assessing implications of the security law, which prohibits what Beijing views as secessionist, subversive or terrorist activities or as foreign intervention in the city’s internal affairs. In the communist-ruled mainland, the foreign social media platforms are blocked by China’s “Great Firewall.” Critics see the law as Beijing’s boldest step yet to erase the legal divide between the former British colony and the mainland’s authoritarian Communist Party system. TikTok said in a statement that it had decided to halt operations “in light of recent events.” Facebook and its messaging app WhatsApp said in separate statements Monday that they would freeze the review of government requests for user data in Hong Kong, “pending further assessment of the National Security Law, including formal human rights due diligence and consultations with international human rights experts.” Hong Kong was convulsed with massive, sometimes violent anti-government protests for much of last year as the former British colony’s residents reacted to proposed extradition legislation, since withdrawn, that might have led to some suspects facing trial in mainland Chinese courts. The new law criminalizes some pro-democracy slogans like the widely used “Liberate Hong Kong, revolution of our time,” which the Hong Kong government says has separatist connotations. The fear is that it erodes the special freedoms of the semi-autonomous city, which has operated under a “one country, two systems” framework since China took control in 1997. That arrangement has allowed Hong Kong’s people freedoms not permitted in mainland China, such as public dissent and unrestricted internet access. Telegram’s platform has been used widely to spread pro-democracy messages and information about the protests. It understands “the importance of protecting the right to privacy of our Hong Kong users,” said Mike Ravdonikas, a spokesperson for the company. “Telegram has never shared any data with the Hong Kong authorities in the past and does not intend to process any data requests related to its Hong Kong users until an international consensus is reached in relation to the ongoing political changes in the city,” he said. Twitter also paused all data and information requests from Hong Kong authorities after the security law went into effect last week, the company said, emphasizing that it was “committed to protecting the people using our service and their freedom of expression.” “Like many public interest organisations, civil society leaders and entities, and industry peers, we have grave concerns regarding both the developing process and the full intention of this law,” the company said in a statement. Google likewise said it had “paused production on any new data requests from Hong Kong authorities.” Though social platforms have yet to be blocked in Hong Kong, users have begun scrubbing their accounts and deleting pro-democracy posts out of fear of retribution. That retreat has extended to the streets: Many shops and stores that publicly stood in solidarity with protesters have removed the pro-democracy sticky notes and artwork that had adorned their walls. Under implementation rules of Article 43 of the national security law, which give the city’s police force sweeping powers in enforcing the legislation, platforms, publishers and internet service providers may be ordered to take down any electronic message published that is “likely to constitute an offence endangering national security or is likely to cause the occurrence of an offence endangering national security.” Service providers who do not comply with such requests could face fines of up to 100,000 Hong Kong dollars ($12,903) and receive jail terms of up to six months. Individuals who post such messages may also be asked to remove the message, or face similar fines and a jail term of one year. Hong Kong authorities moved quickly to implement the law after it took effect on June 30, with police arresting about 370 people. The rules allow Hong Kong chief executive Carrie Lam to authorize police to intercept communications and conduct surveillance to “prevent and detect offences endangering national security.” Police can conduct searches for evidence without a warrant in “exceptional circumstances” and seek warrants requiring people suspected of violating the national security law to surrender their travel documents, preventing them from leaving Hong Kong. Written notices or restraining orders also may be issued to freeze or confiscate property if there are “reasonable grounds” to suspect that the property is related to an offense endangering national security. TikTok, operated by Chinese internet giant Bytedance, has sought to distance itself from its Chinese roots while striving for global appeal. It recently hired former Walt Disney executive Kevin Mayer to be its CEO. The company has said all its data is stored in servers in the U.S. and insisted it would not remove content even if asked to do so by the Chinese government. Even so, TikTok has still been regarded as a national security risk, with U.S. secretary of state Michael Pompeo saying Monday that it was looking at banning certain social media apps, including TikTok."}]}