{"article": [{"url": "https://www.marketwatch.com/story/this-wall-street-analyst-turned-his-twitter-feed-into-sell-side-stories-with-stacy-2020-07-19", "published": 1595170880.0, "headline": "This Wall Street analyst turned his Twitter feed into 'Sell-Side Stories with Stacy'", "body": "Stacy Rasgon has been on Twitter since 2011, but he recently came to the realization that his tweets were a bit boring. \"It's kids and airline-seat pictures,\" he thought, noting that his employer, the global asset-management firm Bernstein, does not allow him to tweet about semiconductor companies nor most things to do with the industry he covers as managing director and senior analyst there. Then, one of his followers asked him what a typical earnings night is like. He responded with a thread that explained the process that Wall Street sell-side analysts go through on a typical earnings afternoon, which typically stretches long into the night or early morning, sometimes as late - or early - as 4 a.m. iframe.twitter-tweet { width: 100% !important; } \"I thought maybe there is a way for me to be a little bit more interesting without running afoul of the [Bernstein] social-media policy,\" he said. That first Twitter thread received a positive reaction from clients and input from within his firm, where he recently led a session for junior analysts on \"How to Succeed on the Sell Side,\" which was based on one of his threads. He will also be conducting a session at Bernstein's \"summer school.\" Since last month, when he answered that initial question, Rasgon has written threads on other topics of interest to investors - and financial reporters - discussing everything from earnings conference calls, to how to interact with clients (the buy side/fund managers), to how to deal with the media, to the art of writing titles for research reports, to how he got his job on Wall Street. Rasgon's path to Wall Street was not a standard route. He said that most analysts start out at a firm, eventually become junior or associate analysts, and move up to the job of senior analyst. Rasgon, though, joined Bernstein Research from McKinsey & Co., where he had been a consultant focusing on semiconductor companies, his first job after earning a Ph.D. from the Massachusetts Institute of Technology in chemical engineering. During two graduate-school summers, Rasgon had worked at IBM Corp.'s IBM, -2.81% Watson Research Center, where he was a co-op engineer working on advanced lithography and processes used in the manufacturing of semiconductors. Rasgon joined Bernstein in April 2008, during the financial crisis and just after Bear Stearns failed. \"When I began, I had no experience on Wall Street, I did not know the difference between the buy side and the sell side,\" he said. \"I knew operationally what made a good semiconductor company, but I didn't know how to talk to clients or the sales force. No one understood anything I was talking about.\" There would be mistakes along the way. One amusing thread that journalists such as yours truly found fascinating featured a story about the so-called callbacks that companies make to individual sell-side analysts after their public earnings calls. The callback gives companies an opportunity to stress certain points to analysts, as well as \"engage in damage control\" if \"they put their foot in their mouth on the call,\" which, Rasgon noted parenthetically, \"happens.\" iframe.twitter-tweet { width: 100% !important; } In this particular case, Rasgon said that some companies try to get analysts to give them information about their financial models or their estimates, so they can properly guide them in the right direction. \"Suffice it to say, on my very first earnings season I was unfamiliar with the concept of 'the callback,' \" Rasgon wrote. \"I knew I had some sort of phone call with IR scheduled afterwards, but didn't really understand what it was for.\" Rasgon said the investor-relations executive called from one company, and, after going over a bunch of data, bluntly asked him, \"What's your number?\" Rasgon's financial models are rather complex, and when he said he had not even begun to work on his model yet the IR person went silent, then said thanks and hung up - Rasgon later recognized that the company had been trying to steer his model. \"This particular company was on the aggressive side,\" Rasgon added in his Twitter thread. \"That level of 'help' is not typical in my experience.\" He added that some companies will not say anything beyond their public conference call or earnings script. \"There has to be a happy medium,\" he said. Some of what Rasgon does is akin to financial journalism: trying to write a headline that grabs attention, and then telling a story that investors - who don't all understand the minutiae of the semiconductor industry - can understand. He said he spends a great deal of time trying to think of a title for his company reports, and, of course, on the content within them. \"About one out of every five of my titles [gets] rejected,\" he said. He also noted that any titles with a hint of a gambling reference get immediately rejected by Bernstein's compliance department. Some catchy Rasgon headlines that were published include \"Evel Knievel Lives?\" which described a forecast for 2019 by Advanced Micro Devices Inc. AMD, -3.94%  that called for a \"back-half ramp [in revenue] that would make Evel Knievel nervous.\" AMD actually did go on to report a huge quarter, but data-center sales came in below expectations. An amusing one during Qualcomm Inc.'s QCOM, +2.06% legal saga with Apple Inc. AAPL, +1.74%  compared the murky situation in its communications chips to the jibberish-speaking and famously hirsute Cousin Itt of Addams Family fame, in a note called, \"Qualcomm FQ1 2020 Recap - Cousin Itt?\" \"There is enough hair to keep us sidelined,\" he wrote. After Nvidia Corp. NVDA, -0.54%  CEO Jensen Huang, in a COVID-19-era product launch via video, opened the oven in his home kitchen to unveil a slew of new products, Rasgon's headline was simply, \"Cooking with Jensen.\" Rasgon's enthusiasm for his work and his enthusiasm for the wonky world of semiconductors are contagious, even in our brief conversation. And now he has found a way to meld that passion with a facility for writing to draw clients - and the press - into his complex research via Twitter TWTR, -0.23%. It seems to be working. \"It's a fun job,\" he said. \"I can write about whatever interests me.\" But the most important element of the work is clients, and he has learned to put them first, he said. \"If you don't like people and cannot succeed in building relationships you will fail on the sell side, no matter how good your stock picks are.\""}]}