{"article": [{"url": "https://www.marketwatch.com/story/this-1-big-change-in-the-market-means-higher-stock-prices-are-likely-over-the-next-few-weeks-2020-09-11", "published": 1599897500.0, "headline": "This 1 big change in the market means higher stock prices are likely over the next few weeks", "body": "The U.S. bull market is receiving a new lease on life from a surprising source: stock-market timers. In recent trading sessions, the timers have beaten one of their most rapid retreats I’ve seen in more than 40 years of tracking investment newsletters. The upshot is that the average market timer is now closer to the “extreme bearishness” end of the spectrum than to the “extreme bullishness” where he had been just a few days ago. That’s encouraging from a contrarian point of view. “ The average timer now has 70% of his equity trading portfolio out of the market. ” Consider the average recommended equity exposure level among a subset of short-term stock-market timers that I monitor on a daily basis. (This is what’s measured by my Hulbert Stock Newsletter Sentiment Index, or HSNSI.) This average currently stands at 30.1%, which means that the average timer now has 70% of his equity trading portfolio out of the market. Just three weeks, ago, in contrast, the HSNSI stood at 65.9%. As you can see from the chart below, the HSNSI’s recent plunge rivals what happened during the February-March waterfall decline. That’s amazing, since the market’s early September sell-off — scary as it was — is child’s play by comparison. In contrast to a 34% plunge in the earlier downturn, the S&P 500 SPX, +0.87% from Sep. 2 to Sep. 8 lost less than 7%. The market timers’ rapid retreat from the bullish bandwagon has been even more evident among those who focus on Nasdaq stocks. (As measured by my Hulbert Nasdaq Newsletter Sentiment Index, or HNNSI.) Their average exposure level is now precisely 11%, which means that the typical Nasdaq-focused timer is now almost completely out of the market. These sentiment changes are encouraging, according to contrarian analysis, since the hallmark of a major market top is bullishness that is stubbornly adhered to in the face of a decline. That’s definitely not what we’re experiencing now. For an example of what stubbornly-held bullishness does look like, consider sentiment at the top of the internet bubble in early 2000. The Nasdaq Composite Index COMP, +1.39% hit its all-time high on Mar. 10 of that year, and over the next six trading sessions dropped 13.2% on an intra-day basis. And yet the HNNSI over that week actually rose by more than 30 percentage points. The contrast with today is stark. Then the market timing community treated the decline as a huge buying opportunity. During the market’s decline earlier this month, the timers fell over themselves getting out of stocks. The usual qualifications apply, of course. Sentiment is not the only thing that makes the markets tick. Even when sentiment does provide an accurate forecast, it only provides insight into the market’s near-term direction — from a couple of weeks to a month or two at most. Also keep in mind that, as we saw earlier this month, sentiment conditions can change quickly. But, so long as the market timers on balance remain lukewarm about the stock market, sentiment for the next few weeks favors higher prices. Mark Hulbert is a regular contributor to MarketWatch. His Hulbert Ratings tracks investment newsletters that pay a flat fee to be audited. He can be reached at mark@hulbertratings.com Read:What’s happening now with M&A is going to make today’s stock investors wish they’d sold sooner More: Forget value vs. growth. Think ‘quarantine’ vs. ‘recovery’"}]}