{"article": [{"url": "https://www.marketwatch.com/story/insiders-are-now-unloading-stocks-heres-why-you-shouldnt-see-this-as-a-sell-signal-for-this-market-2020-08-25", "published": 1598717900.0, "headline": "Insiders are now unloading stocks â\u0080\u0094 hereâ\u0080\u0099s why you shouldnâ\u0080\u0099t see this as a sell signal", "body": "CHAPEL HILL, N.C. â\u0080\u0094 Corporate insiders apparently donâ\u0080\u0099t believe a bear market is imminent. Thatâ\u0080\u0099s the conclusion I draw from data compiled by Nejat Seyhun, a finance professor at the University of Michigan and one of academiaâ\u0080\u0099s leading experts on the behavior of corporate insiders. The last time I checked in with Seyhun, in mid-June, the data on all publicly traded stocks were saying something similar. I reported then that â\u0080\u009ccorporate insiders do not appear to be particularly worried about a bear market occurring anytime soonâ\u0080\u009d and were therefore â\u0080\u009cproviding powerful support for the bull market.â\u0080\u009d Since then, the S&P 500 SPX, +0.87% (with dividends) has gained 10%. By corporate insiders Iâ\u0080\u0099m referring to a companyâ\u0080\u0099s officers and directors as well as its largest shareholders. They are required to report more or less immediately to the Securities and Exchange Commission whenever they buy or sell shares of company stock, and many on Wall Street slice and dice that data for clues about the broad marketâ\u0080\u0099s likely direction. Unlike some on Wall Street, however, Seyhun does not weight each insider equally when slicing and dicing the data. He has found from his research that the third category of insidersâ\u0080\u0094companiesâ\u0080\u0099 largest shareholders â\u0080\u0094 do not have particular insight into their firmsâ\u0080\u0099 prospects. And itâ\u0080\u0099s crucial to strip out their transactions from the composite data because the dollar value of their purchases and sales typically will be far larger than those undertaken by officers and directors. Now is one of those times when the largest shareholders are skewing the data. They are selling stock at an aggressive clip, making it look as though insiders as a group are betting on a market decline. But a different picture emerges when we focus on just those insiders that Seyhunâ\u0080\u0099s research has found to be worth following. To come up with a single indicator, Seyhun focuses on just those firms for which there has been at least one transaction from an officer or director, and then calculates the proportion of them for which more shares were purchased than sold. This net insider buying percent for the first half of August was 21.9%. As you can see from the chart above, this is a lot lower than the 62.0% that prevailed in the month of March, when the bear market hit its bottom. Nevertheless, Seyhun told me in an email, because this latest reading is not significantly lower than the 10-year average, the best guess is that the market in coming months will not do appreciably better or worse than average. Thatâ\u0080\u0099s good news if you were worried about an imminent bear market. Itâ\u0080\u0099s not-as-good news if were expecting the stock market over the next few months to repeat its incredible run over the last five months. Which sectors do the insiders like the best? These conclusions are based on composite data for the entire market, and as you would expect, there is considerable variation from one sector to another. The sectors for which there is the greatest amount of net insider buying areâ\u0080\u0094as was the case two months agoâ\u0080\u0094energy and financials. In fact, insiders in these sectors are slightly more bullish today than they were then. Thatâ\u0080\u0099s very revealing, because both sectors have lost ground over the last two months. The Energy Select Sector SPDR ETF XLE, -1.59% Â has lost 11.2% since my mid-June insider column was published; the Financials Select Sector SPDR ETF XLF, +0.11% Â has lost 0.3%. Seyhun has found from his research that one of the most bearish things insiders can do is to sell into a decline, since that suggests they have no confidence that their companiesâ\u0080\u0099 shares will recover soon. Fortunately for these two sectors, thatâ\u0080\u0099s not how insiders as a group are behaving. At the opposite end of the spectrum, insiders in the health-care sector, and especially among small-cap stocks with this sector, are selling at a well-above-average pace. Mark Hulbert is a regular contributor to MarketWatch. His Hulbert Ratings tracks investment newsletters that pay a flat fee to be audited. He can be reached at mark@hulbertratings.com."}]}