{"article": [{"url": "https://www.marketwatch.com/story/what-the-harvard-endowments-below-average-grade-can-teach-you-about-index-funds-and-your-investments-2020-10-09", "published": 1602246980.0, "headline": "What the Harvard endowment's below-average grade can teach you about index funds and your investments", "body": "Harvard's University's endowment's return lagged the U.S. stock market - again. For the fiscal year ending June 30, Harvard's endowment produced a 7.3% return, versus a 7.5% total return for the S&P 500 SPX, +0.87%  . This marks the 12th year in a row in which the $42 billion portfolio fell behind the benchmark index. Also, as you can see from the accompanying chart, the endowment has lagged the S&P 500 over each of the 3-, 5-, 10- and 20-year horizons. It would be easy to smugly write off Harvard's performance as the comeuppance due to a bunch of elites who think they are smarter than the rest of us. But that would be a mistake, since by doing that we would miss important investment lessons that can be drawn from Harvard's experience: â\u0080¢â\u0080\u0089Performance persistence is rare: Harvard's endowment hasn't always lagged the market. In fact, it produced a remarkable string of successes in the late 1990s and early aughts. Cumulatively over the 15 years through mid-2008, for example, it beat the S&P 500 by more than five annualized percentage points, better than almost every actively managed mutual fund and Wall Street institutional investor. While the odds of producing that 15-year market-beating return were very low, they were even lower that the endowment's managers would be able to repeat that success. Rather than reacting smugly, we should take to heart that even the best and the brightest are unable to consistently beat the market. â\u0080¢ Overconfidence is an obstacle: One of the reasons that performance persistence is rare is that success breeds overconfidence. I have no inside knowledge about the managers running the Harvard endowment, but it would be difficult not to let a 15-year annualized alpha of over five percentages points go to their heads. According to a 2017 article in The Harvard Crimson, the university's student newspaper, employees of the Harvard Management Company (HMC) - which runs the endowment - \"privately criticized HMC's workplace culture as 'lazy, fat, and stupid' in a 2015 internal review conducted by McKinsey and Company, accusing their employer of setting artificially low benchmarks and overcompensating its executives.\" â\u0080¢â\u0080\u0089Reversion to the mean is a powerful force: One big contributor to Harvard's success in the 1990s and early aughts was a major bet on timber. In subsequent years the endowment continued to make a number of exotic bets in that space - on everything from teak forests in Central America to Romanian timberland. These more recent bets didn't work out, leading Harvard to suffer losses in excess of $1 billion. (Harvard has announced that it was spinning off the management of its natural resources portfolio to an outside firm.) â\u0080¢â\u0080\u0089It takes many years for skill to win out over luck: It is almost impossible, over not just the short term but also over the intermediate term, to know whether performance is due to luck or skill. Was Harvard's timber bet in the 1990s a stroke of genius or just luck? By the same token, might its losses in recent years be just bad luck, or should managers have known better? To answer these questions in a rigorous statistical way, we would need many more years, if not several decades, of returns. In the meantime, just as it's important for Harvard's managers to avoid becoming overconfident, it's important for us not to confidently attribute their recent mediocre returns to a lack of skill. â\u0080¢â\u0080\u0089Index funds are hard to beat: Because Harvard's endowment is not 100% allocated to equities, the S&P 500 is not the only benchmark against which it should be compared. But it's not clear that managers have beaten a blended benchmark either. Over the past 20 years, for example, Harvard's endowment has lagged a portfolio that invested 60% in an S&P 500 index fund and 40% in a U.S. bond market index fund (4.8% annualized versus 5.8%, according to my calculations). â\u0080¢ Index-fund pioneer John Bogle was right: Given that index funds are so difficult to beat, it's hard to justify paying the salaries of a large high-priced staff to run the endowment. Harvard at least partially took that lesson to heart in 2017, when they announced layoffs of about half their 230-person staff. While the Harvard endowment has lagged the S&P 500 in the three fiscal years since then, it did so by less than it had in the decade prior to the shift. So its decision to lay off staff not only has not cost them, it may have helped. The bottom line? Beating the stock market is incredibly difficult. Over the past 20 years you could have beaten Harvard's endowment by putting your money in index funds and doing nothing else. That's amazing to contemplate. What other pursuit in life is there in which you can do better than the best and the brightest by doing nothing? Mark Hulbert is a regular contributor to MarketWatch. His Hulbert Ratings tracks investment newsletters that pay a flat fee to be audited. He can be reached at mark@hulbertratings.com More: Think your nest egg is safe sitting in cash? Think again - billionaire investor explains where some of that money should go instead Plus: Here's the real cost of stock splits that Buffett knows and Apple and Tesla ignored"}]}