{"article": [{"url": "https://www.marketwatch.com/story/eric-trump-lawyers-say-he-cant-testify-in-ny-probe-into-family-business-practices-till-after-election-because-of-extreme-travel-schedule-2020-09-17", "published": 1600629860.0, "headline": "Eric Trump lawyers say he can't testify in N.Y. probe into family business practices till after election because of 'extreme travel schedule'", "body": "NEW YORK (AP) - President Donald Trump's son Eric is willing to comply with a subpoena to testify in a New York investigation into the family's business practice, but only after the Nov. 3 election, the Trumps' lawyers said in a court filing Thursday. The lawyers argued Eric Trump's \"extreme travel schedule\" related to his father's re-election campaign prevented him from testifying sooner in state Attorney General Letitia James's civil probe. They said they also wanted \"to avoid the use of his deposition attendance for political purposes.\" “ Letitia James launched her civil investigation of potential fraud in Trump business dealings in March 2019 after President Donald Trump's longtime personal lawyer Michael Cohen told Congress that Trump had repeatedly inflated the value of his assets to obtain more favorable terms for loans and insurance coverage. ” James, a Democrat, slammed the younger Trump's purported scheduling conflicts, responding in a statement: \"We won't allow any entity or individual to dictate how our investigation will proceed or allow anyone to evade a lawful subpoena. No one is above the law, period.\" James went to court last month to compel Trump's business associates, including Eric, to testify and turn over documents as part of an investigation into whether the family's company, the Trump Organization, lied about the value of its assets in order to get loans or tax benefits. Investigators have yet to determine whether any law was broken, James's office wrote in a court filing. James sought court intervention after Eric Trump's lawyers abruptly canceled an interview with investigators that had been planned for late July. A hearing on the matter is scheduled for next Wednesday in state court in Manhattan. Eric Trump, the third of Trump's five children, visited a Trump campaign field office in Portsmouth, N.H., on Thursday and also attended an event titled \"Fighting for Maine Lobster with Eric Trump.\" The Trumps' lawyers contend most law-enforcement agencies refrain from actions involving political figures within 60 days before an election, though that wasn't the case when then-FBI Director James Comey sent a letter to Congress a week before the 2016 presidential election regarding the reopening of a probe into Trump rival Hillary Clinton's emails. Eric Trump's lawyers have proposed four dates for him to testify, the earliest being Nov. 19, which they contend is just 30 days after others are scheduled to be deposed in the investigation. They are also seeking assurances that the attorney general's office won't share testimony and evidence it collects with other law-enforcement agencies or regulators. James launched her civil investigation of potential fraud in Trump's business dealings in March 2019 after Trump's longtime personal lawyer Michael Cohen told Congress that Trump had repeatedly inflated the value of his assets to obtain more favorable terms for loans and insurance coverage. James's investigators are looking into how the Trump Organization and its agents assessed the value of Seven Springs, a 212-acre estate north of New York City that Trump purchased in 1995 with the intent of turning it into a golf club. After that project failed to progress, he granted an easement over 158 acres to a conservation land trust in 2016 in order to qualify for an income-tax deduction. In its initial court filing, James's office said a professional appraisal done at the time determined that Seven Springs was worth $56.5 million prior to the donation. The land being conserved in exchange for the tax deduction was worth $21.1 million, it said. Cohen said during his congressional testimony that when Trump was trying to buy the Buffalo Bills in 2014, he provided financial statements to Deutsche Bank saying Seven Springs was worth $291 million in 2012. In his new memoir, \"Disloyal,\" Cohen writes that Trump's vanity also drove valuations. Trump \"would go into a frenzy\" when Forbes and Fortune were compiling their annual lists of the world's richest people and would have Cohen and longtime financial chief Allen Weisselberg inflate valuations to come up with an acceptable number, Cohen wrote. The attorney general's office is also attempting to collect information about the Trump National Golf Club near Los Angeles, where the Trump Organization donated a conservation easement over part of the property in 2014 and received a tax deduction. From the archives (2018):Trump Organization finance chief Weisselberg granted immunity in Cohen probe And investigators said they were also probing the circumstances of how the Trump Organization handled tax issues related to more than $100 million of debt related to the Trump International Hotel and Tower Chicago that was forgiven between 2010 and 2012. Investigators said they have not been able to confirm whether any of that forgiven debt was recognized as taxable income, according to the court filings. President Trump last year dismissed various probes into his pre-White House dealings, accusing James and New York's Democratic Gov. Andrew Cuomo of \"harassing all of my New York businesses in search of anything at all they can find to make me look as bad as possible.\" See:Michael Cohen casts himself as 'star witness' against Trump in new memoir Read on:Michael Cohen's lawyers sue, claiming he was jailed as retaliation for Trump revelations in book: report"}]}