{"article": [{"url": "https://www.marketwatch.com/story/baseball-is-back-mlb-sets-60-game-schedule-starting-july-23-or-24-2020-06-23", "published": 1592953040.0, "headline": "Baseball is back: MLB sets 60-game schedule starting July 23 or 24", "body": "NEW YORK — Major League Baseball issued a 60-game schedule Tuesday night that will start July 23 or 24 in empty ballparks as the sport tries to push ahead amid the coronavirus following months of acrimony. A dramatically altered season with games full of new rules was the final result of failed financial negotiations. But for fans eager to see any baseball this year, at least now they can look forward to opening day. The announcement by MLB came while more players continue to test positive for the virus — at least seven on the Philadelphia Phillies alone. And a stark realization remained, that if health situations deteriorated, all games could still be wiped out. One day after the players’ association rejected an economic agreement and left open the possibility of a grievance seeking hundreds of millions of dollars in damages, the bickering sides agreed on an operations manual. Baseball Commissioner Rob Manfred then unilaterally imposed the schedule, his right under a March agreement with the union. In a twist, the sides expanded the designated hitter to games involving National League teams for the first time and instituted the radical innovation of starting extra innings with a runner on second base. Playoff teams remain at 10 for now — there is still talk of a possible expansion. The rejected deal had called for 16 teams. Players will start reporting for the resumption of training on July 1. It remains to be seen which players will report back to work — high-risk individuals are allowed to opt out and still receive salary and service time, but others who sit out get neither money nor the service credit needed for eligibility for free agency and salary arbitration. Each team will play 10 games against each of its four division rivals and four games vs. each of the five clubs in the corresponding division in the other league, according to details obtained by The Associated Press. A team is scheduled to make only one trip to each city it visits in MLB’s shortest season since 1878. a schedule of such brevity that some fans may question the legitimacy of records. No matter what, the season will be among the most unusual ever for a sport that takes pride that the race for titles is a marathon and not a sprint: Washington started 19-31 and 27-33 last year but finished 93-69 to earn a wild card and won a seven-game World Series for its first title. “There’s a lot more pressure because in a 60-game schedule, I think that you have 25% more teams that can compete, that had no idea they were going to compete for 162 games,” said Hall of Fame pitcher John Smoltz, now a broadcaster. The trade deadline will be Aug. 31 and the deadline to be in an organization for postseason eligibility is Sept. 15. Teams can resume making trades Friday, when rosters will no longer be frozen. Active rosters will be 30 during the first two weeks of the season, 28 during the second two weeks and 26 after that. They will not expand to 28 on Sept. 1, as originally intended this year. With no minor leagues, teams would be allowed to retain 60 players each, including a taxi squad. Up to three players from the taxi squad can travel with a team to a game, and one of the three must be a catcher. MLB is keeping the planned innovation that pitchers must face three batters or finish a half inning —- players refused to agree a year ago but also waived their right to block. The injured list minimum for pitchers at 10 days rather than revert to 15, as initially intended. Public opinion shredded both sides as they locked in a ferocious financial battle during a pandemic that has led to more than 120,000 deaths and 2.3 million infections in the U.S. and led to a 14.7% unemployment rate, the highest since the Great Depression. MLB originally hoped to be the first U.S. major league to return, with an 82-game schedule starting around the Fourth of July, but public sniping broke out between management and players who distrust teams’ claims of economic losses following years of franchise appreciation. MLB claimed that without gate-related revenue it would lose $640,000 for each additional regular-season game, a figure the union disputed. MLB became exasperated with the union’s leadership team, headed by former All-Star first baseman Tony Clark and Bruce Meyer, a litigator hired in August 2018. Manfred and Deputy Commissioner Dan Halem were infuriated when Clark said he considered the result of a one-on-one meeting with Manfred last week a proposal rather than what MLB termed a framework for a deal. Rather than play 162 games over 186 days, the season will be 60 games over 66 or 67 days, depending on whether there is a nationally televised Thursday night opener. It is scheduled to end Sept. 27, which leaves little margin to make up September rainouts. Players are being given staggered reporting times over several days for intake screening. The time will be used for coronavirus testing ahead of the resumption of workouts, which were stopped March 12 due to the pandemic. Because of an uptick of infections in Florida and Arizona’s summer heat, 28 teams currently are leaning toward training in their regular-season ballparks. Detroit remained partial to Lakeland, Florida, and Toronto was hoping to gain government permission to work out at Rogers Centre. Under terms of the deal the sides reached on March 26, which was to have been opening day, players would receive prorated portions of their salaries if the 60-game schedule is not cut short by the virus. Salaries originally totaled $4 billion, and the prorated portion of about 37% reduces pay to $1.48 billion. Salaries were to have ranged from $563,500 at the minimum to $36 million for Mike Trout and Gerrit Cole at the top, but the spread would now be from $208,704 to $13,333,333. MLB initially had sought last month in its initial economic proposal to reduce pay to about $1 billion, and players vowed not to give up full prorated pay and proposed a 114-game schedule that amounted to $2.8 billion. The relationship deteriorated back to the level of the labor wars that led to eight work stoppages from 1972-95, and the union has threatened a grievance claiming MLB didn’t fulfill the provision in the March deal requiring the longest season economically feasible, conditioned by several other provisions. MLB would claim the union bargained in bad faith, and the case would be argued before arbitrator Mark Irvings. That would be a prelude to the expiration of the current labor contract on Dec. 1, 2021, which likely will be followed by a lockout."}]}