{"article": [{"url": "https://www.marketwatch.com/story/white-house-nixes-updated-fda-guidelines-on-vaccine-approval-01601981669", "published": 1601967740.0, "headline": "Trump White House blocks FDA's new guidelines for vaccine approval", "body": "Rep. Steve Scalise, a Republican from Louisiana, holds an FDA report during an Oct. 2 hearing of the House Select Subcommittee on the Coronavirus Crisis. Getty Images WASHINGTON (AP) - The White House has blocked new Food and Drug Administration guidelines on bringing potential vaccines for COVID-19 to market that would almost certainly have prevented their introduction before the Nov. 3 election. Key Words: Bill Gates questions FDA, says only one drug maker has a chance to deliver a coronavirus vaccine by next month Also read: FDA commissioner: It's up to drug makers developing vaccines to seek approval or EUA At issue was the FDA's planned instruction that vaccine developers follow patients enrolled in their trials for at least two months to rule out safety issues before seeking emergency approval from the agency. A senior administration confirmed the move Monday evening, saying the White House believed there was \"no clinical or medical reason\" for the additional requirement. Coronavirus update (Sept. 30, 2020): Group of ex-FDA commissioners slam political interference at FDA and CDC; U.S. death toll tops 206,000 The White House action was first reported by The New York Times. The intervention by Trump officials is the latest example of the administration undercutting its own medical experts working to combat the pandemic that has killed more than 210,000 Americans. FDA Commissioner Stephen Hahn has been attempting to shore up public confidence in the FDA's vaccine review for weeks, vowing that career scientists, not politicians, will decide if the shots are safe and effective for mass vaccination. But President Donald Trump has repeatedly insisted that a vaccine could be authorized before Election Day, even though top government scientists working on the administration's vaccine effort have stated that that timeline is very unlikely. See: As Trump continues to press for coronavirus vaccine by Election Day, public health officials vow 'no cutting corners' Last week seven former FDA commissioners blasted the administration for \"undermining the credibility\" of the FDA in a Washington Post op-ed and called for the release of the pending vaccine guidelines. The former FDA chiefs warned that public perceptions that a vaccine was rushed out for political reasons could derail efforts to vaccinate millions of Americans. Beyond the damaging optics of overruling its own FDA, the practical impact of the White House move to block the guidelines could be relatively small. See: FDA broadens U.S. safety inquiry into AstraZeneca COVID-19 vaccine, report says, raising prospect of further delays Plus: Moderna CEO tells FT that coronavirus vaccine won't be ready by Election Day Only one drug maker, Pfizer PFE, -0.27%, has suggested it could have data on the safety and effectiveness of its vaccine before Election Day. And a number of variables would still have to align for the company to submit, and the FDA to review and approve, a vaccine application before Nov. 3. Pfizer's competitors Moderna MRNA, +0.09%, AstraZeneca AZN, +1.16% and Johnson & Johnson JNJ, +1.39% are working on longer researcher timelines. Opinion: Everything you need to know about what it would take for the FDA to approve a COVID-19 vaccine"}]}