{"article": [{"url": "https://www.marketwatch.com/story/will-mortgage-rates-drop-below-3-11594845518", "published": 1594894820.0, "headline": "Mortgage rates drop below 3% for the first time - and economists say rates could stay that low through 2021", "body": "Falling mortgage rates have spurred home-buying activity nationwide, but that trend may not continue. Getty Images/iStockphoto At the beginning of the coronavirus pandemic, mortgage industry experts forecast that benchmark interest rates might fall, but wouldn't drop below 3%. But now, that's just what has happened. And many economists predict that mortgage rates will remain below that threshold into 2021. The 30-year fixed-rate mortgage averaged 2.98% for the week ending July 16, down five basis points from the previous week, according to Freddie Mac FMCC, +0.52%. This is the first time since Freddie Mac began tracking mortgage rates in 1971 that the rate on the 30-year mortgage dropped below 3%. And it is the seventh time so far this year that Freddie Mac's mortgage rate survey had reported a record low. Meanwhile, the 15-year fixed-rate mortgage dropped three basis points to an average of 2.51%. The 5-year Treasury-indexed hybrid adjustable-rate mortgage rose four basis points to an average of 3.06%. Concerns regarding the state of the economy amid the coronavirus pandemic have fueled the benchmark interest rate's steady decline since the start of the year. \"A lot of it has been driven by the broader pandemic impact to the economy,\" said Joel Kan, associate vice president of economic and industry forecasting for the Mortgage Bankers Association. \"For a while we looked like we might be in a better place. But right now markets have been reacting to the resurgence in cases.\" Sub-3% mortgage rates could be here to stay. A new economic forecast by Fannie Mae FNMA, +0.73% projects that the 30-year fixed-rate mortgage will average 2.8% next year. And economists at Realtor.com estimate that rates will average 3.2% throughout the year but hit 2.9% by the end of the year. Read more: Mortgage rates keep falling to record lows - so is now a good time to refinance? \"Yes, mortgage rates below 3% are possible,\" said Danielle Hale, chief economist at Realtor.com. The spread of rates available in the mortgage market right now is quite wide. And getting access to these record low rates isn't easy for all applicants. Mortgage lenders have tightened their credit and imposed stricter standards for qualification because of the coronavirus. At the start of the pandemic, lenders witnessed a massive wave of refinance applications just as companies were shifting to working remotely, which caused long delays to close the loans for some borrowers. And as the pandemic progressed, the mortgage industry faced a major uptick in requests for forbearance (skipping payments for a certain period) as homeowners grew worried about their finances amid rising unemployment. \"While rates are historically accommodative, only a portion of the market can take advantage,\" said Matthew Speakman, an economist at Zillow ZG, -0.42%. \"This will continue to be the case, due to uncertainties produced by the coronavirus.\" This hesitancy on the part of mortgage lenders though means that they have ample room to lower rates further. Historically, mortgage rates roughly track the yield on the 10-year Treasury TMUBMUSD10Y, 0.777%. But the spread between mortgage rates and the 10-year yield grew at the start of the pandemic, as lenders refrained from slashing rates by as much as the Treasury note had fallen. “ 'Current homeowners as well as home buyers that lock in low rates might be reluctant to trade up to another house in future years if doing so also means trading up to a meaningfully higher rate.' ” - Greg McBride, chief financial analyst at Bankrate The difference between mortgage rates and the 10-year Treasury has narrowed in recent weeks, but there's still room for lenders to cut interest rates further. The low-rate environment, meanwhile, has attracted homeowners and home buyers alike. Refinancing activity remains well elevated compared with a year ago, though lower than at the start of the pandemic. And home buyers have rushed back into the market eager to take advantage of the cheaper financing. In the long-term, however, today's record low rates could become something of a burden for the housing industry. The longer these rates stick around, the less likely they will provide an added appeal to buying a home, Hale said. In short, the novelty will wear off. Today's low interest rates may also serve as a deterrent to homeowners moving in the future, experts said. \"Current homeowners as well as home buyers that lock in low rates might be reluctant to trade up to another house in future years if doing so also means trading up to a meaningfully higher rate,\" said Greg McBride, chief financial analyst at Bankrate. \"The added buying power of today's low rates will prompt many first-time buyers to skip over the starter home.\""}]}