{"article": [{"url": "https://www.marketwatch.com/story/heres-what-history-tells-us-happens-after-the-sp-500s-best-quarters-of-all-time-as-strategist-says-its-set-to-repeat-2020-07-01", "published": 1593753140.0, "headline": "Hereâ\u0080\u0099s what history tells us happens after the S&P 500â\u0080\u0099s best quarters of all time, as strategist says itâ\u0080\u0099s set to repeat", "body": "The Dow DJIA, +0.56% Â booked its best quarter since 1987 in the second quarter, while the S&P 500 SPX, +0.87% Â posted its best performance since 1998 and the Nasdaq Composite COMP, +1.39% Â since 1999, as the economy began to reopen after the coronavirus lockdown. The first two quarters of the year couldn't have been more different and uncertainty is still heightened, with a number of U.S. states reversing their reopenings and reporting virus spikes. SunTrust Advisory chief market strategist Keith Lerner said that while history was â\u0080\u009conly a guide,â\u0080\u009d he expected it to be repeated with the onset of a bull market and the S&P 500 higher in a yearâ\u0080\u0099s time. He expected an uneven path for the index, as the economy reopens in â\u0080\u009cfits and starts,â\u0080\u009d but one with a positive trajectory. Read:Everything investors need to know about trading hours and closures for July 4 The S&P 500â\u0080\u0099s second-quarter gain of 20% makes it the fourth-best quarter since 1950, Lerner said in a note. Following the top 10 best quarters since 1950, the index has climbed every time in the next quarter with an average 8% jump. On three occasions â\u0080\u0094 in 1970, 1998 and 2009 â\u0080\u0094 the strong quarter was also preceded by a double-digit percentage fall, as it was this time around. The index was higher one year later following nine out of the 10 best quarters, with the exception of the 1987 stock market crash, SunTrustâ\u0080\u0099s study found. Lerner warned markets wouldnâ\u0080\u0099t track the past exactly, and stressed there was great uncertainty around the pandemic and â\u0080\u009cwider-than-normalâ\u0080\u009d potential outcomes. See Also:Investors get excited about Pfizer, BioNTechâ\u0080\u0099s coronavirus vaccine candidate â\u0080\u009cThat said, the weight of the evidence in our work still suggests that we are in a bull market â\u0080\u0094 a bull market that has further to go but became stretched to the upside on a short-term basis in early June,â\u0080\u009d he said. â\u0080\u009cWhile the fits and starts in the economy and other factors will likely lead to periodic market setbacks, our work suggests this bull market continues to earn the benefit of the doubt, and we retain a positive 12-month outlook,â\u0080\u009d he added. Lerner said the S&P 500â\u0080\u0099s path since the March lows was tracking the 1982 and 2009 bull markets â\u0080\u0094 with two pullbacks of more than 5% already."}]}