{"article": [{"url": "https://www.marketwatch.com/story/snowflake-ipo-five-things-to-know-about-the-berkshire-backed-company-as-it-heads-for-record-software-offering-11600182459", "published": 1600263500.0, "headline": "Snowflake IPO: 5 things to know about the Berkshire-backed company after its record software offering", "body": "Investors are hoping to catch some Snowflake shares amid IPO buzz. AFP/Getty Images Snowflake Inc. produced the biggest initial public offering for a U.S. software company in history this week, and that may not even be the most astounding feature of its first share sale. Snowflake SNOW, -0.91% has convinced one of the world’s most coveted investment partners, Berkshire Hathaway Inc. BRK.A, +0.06% BRK.B, +0.24%, to invest more than half a billion dollars in its IPO, despite founder Warren Buffett’s legendary aversion to young technology companies and IPOs. And Berkshire is not alone, with Salesforce.com Inc. CRM, +2.21% also committing hundreds of millions of dollars to a company that is expected to rake in nearly $4 billion at a valuation of roughly $33 billion just eight years after being established. Snowflake is generating excitement because the San Mateo, Calif., company offers an essential part of many businesses’ technology infrastructure in a new fashion. Snowflake produces database software that uses the same standard as Oracle Corp. ORCL, +0.42% but can be used in the cloud and scaled up or down as needed, with variable pricing to match. While large U.S. cloud providers like Amazon.com Inc. AMZN, +3.01%, Microsoft Corp. MSFT, +2.48% and Alphabet Inc.’s Google GOOGL, +1.82% GOOG, +1.97% offer similar services, Snowflake is the only standalone company offering such software to run on all of their cloud platforms though. “There’s not really a pure-play company on the market like Snowflake,” independent technology investment analyst Beth Kindig told MarketWatch. Snowflake’s singular nature has sent interest in the IPO soaring. After initially proposing a price range of $75 to $85 a share, the company dramatically increased its proposed price to $100 to $110 a share Monday morning, and finally priced shares at $120 apiece Tuesday night. The stock opened at more than double that price in Wednesday’s session. Snowflake intends to sell at least 28 million shares, in addition to issuing $250 million in stock apiece at the IPO price to Berkshire and Salesforce. Berkshire will also purchase more than 4 million shares at the IPO price from Snowflake’s former chief executive. Don’t miss: IPO market gears up for busiest week since Uber went public Snowflake began trading Wednesday on the New York Stock Exchange under the ticker symbol SNOW. Underwriters, led by Goldman Sachs and Morgan Stanley, will have access to an additional 4.2 million shares. Here are five things to know about the company as it goes public.A new kind of database software, with serious competition Software companies have long sought to break Oracle’s hold on the database market, including MongoDB Inc. MDB, +2.45%, which does not use the standard format of SQL. Snowflake allows customers to use SQL and offers diverse functionality with it, and offers pricing that scales with the workload, unlike legacy on-premises database offerings that required customers to pay for peak usage even when it was not required. “They’re bringing an Amazon-like approach to data warehousing,” Kindig said. Snowflake is taking that approach on cloud platforms that offer their own solutions, however. Google’s BigQuery, for instance, also offers a variable pricing structure, and Amazon’s Redshift is considered to be the biggest player around. “Based on the number of customers per company according to HG Insights, Redshift is about 4x bigger than Snowflake whereas Google’s Big Query is about 2x bigger than Snowflake,” MKM Partners Executive Director Rohit Kulkarni wrote in a pre-IPO note on Snowflake earlier this month. Google requires users to lock in to their cloud offering for its service, however, which is where Snowflake has a chance to battle its larger competitors. As customers move toward a multi-cloud set-up, in which they can purchase cloud-computing service from more than one of the large providers, Snowflake can be used no matter which cloud product is running. Big revenue growth and bigger losses Snowflake’s value proposition to corporate customers has helped it produce triple-digit revenue growth, though losses are also multiplying. Revenue grew nearly 175% in the fiscal year that ended at the end of January, to $264.7 million from $96.7 million. In the first six months of this fiscal year, ending July 31, sales again more than doubled easily, moving to $242 million from $104 million. Losses did not double in the most recently completed fiscal year, but they came close, moving to $348.5 million from $178 million, with both of those totals eclipsing the company’s revenue from that year. That trajectory eased some in the first six months of this year thanks to a slowdown in operating-expense spending growth, with losses declining to $171 million from $176.9 million in the same period last year. Kindig, who occasionally writes for MarketWatch, found in her analysis of the company that it had the third highest revenue growth in its sixth year after launching product among IPOs in recent years, behind only Zoom Video Communications Inc. ZM, +2.89% and Crowdstrike Holdings Inc. CRWD, +0.42% and just ahead of Shopify Inc. SHOP, +2.50% Other metrics could be new standards While big revenue growth and expanding losses are common for young software companies seeking to add customers to long-term contracts, other performance and valuation metrics show Snowflake’s unique nature. Kindig, in her detailed public analysis, pointed out that Snowflake has the largest net revenue retention rate of any IPO, 158%. Net revenue retention rate shows how much current customers are spending compared with previous spending, and a number that high shows that customers are increasing their spending on Snowflake’s product at rates not seen before. This trend is showing up in other ways as well: the percentage of customers spending more than $1 million in the past 12 months increased to 41% from 14% in the most recent fiscal year. Another potentially record-breaking performance by Snowflake may not be as well-received by investors, however. Kindig said that the IPO pricing is pushing Snowflake’s valuation to unseen heights when compared with forward revenue expectations. Kindig tracked it at more than 60x at the new potential pricing range, easily outpacing the highest fliers like Zoom. “I can’t find a higher forward price to sales,” she said. “It’s off the map.” The ServiceNow connection Snowflake was founded by two former Oracle engineers, but its current leaders owe more to a different Silicon Valley software company with a similar ticker symbol to Snowflake. In 2019, Snowflake shook up the top of its C-suite and welcomed in the former chief executive and chief financial officer from ServiceNow Inc. NOW, +2.43%, CEO Frank Slootman and CFO Michael Scarpelli. The two have worked together through four different companies since 2003, including taking on the CEO and CFO roles at ServiceNow roughly a year before it went public in 2012 at a valuation of about $3 billion. ServiceNow is worth nearly $90 billion and joined the S&P 500 index SPX, +0.87% last year. Don’t cry for the chief executive who moved out of the way for the ServiceNow team, though. Snowflake accelerated vesting on options for roughly 2 million shares for Robert Muglia in his severance agreement, and he still has a stake of more than 8 million shares. He plans to sell half of them to Berkshire Hathaway at the IPO price, netting him more than $400 million before taxes. Slootman and Scarpelli will look for a ServiceNow sequel with Snowflake and one of its cofounders, Benoit Dageville, who is still president of products after serving as chief technology officer for most of his time at the company. Snowflake’s other executive officer, Chief Revenue Officer Christopher Degnan, has been with Snowflake since 2013, but previously worked at EMC at the same time Slootman and Scarpelli were there.The VCs got in early and will have control While Snowflake’s IPO price range has shot up, the company is no late bloomer. It has been a hot investment for venture-capital firms for years, and raised money at a roughly $12 billion valuation earlier this year. That capital raise was a Series G, enough letters deep into the alphabet to show that plenty of VCs have caught a Snowflake share or two. The largest VC investors could have effective control over the company if they vote as a bloc, because Snowflake installed a two-tiered share structure that guarantees them 10 votes for every share of Class B stock. The largest stake belongs to Sutter Hill Ventures, which will hold more than 17% of the class B shares after the offering and has a seat on its board in the person of Michael Speiser, a Sutter Hill managing director who held down Snowflake’s CEO spot for two years before Muglia and serves as lead independent director. The other venture-capital firms with large stakes that include supervoting rights include Altimeter Partners (15.1% after the offering), Iconiq Strategic Partners (14%), Redpoint Ventures (9.1%) and Sequoia Capital (8.6%). Slootman is the only investor beyond the VC firms with a stake of more than 5% . He is expected to own 6% of the class B stock after the offering."}]}