{"article": [{"url": "https://www.marketwatch.com/story/oil-prices-edge-lower-as-iea-monthly-report-cuts-demand-forecast-2020-08-13", "published": 1597332080.0, "headline": "Oil futures finish lower as traders assess cut to demand outlook", "body": "Oil futures finished lower Thursday, pressured after the International Energy Agency applied a deeper cut to its forecast for global crude demand in 2020 and as news of diplomatic progress among two Arab nations eased risks to supply from the region. However, a third week of declines in U.S. crude supplies and signs of a recent uptick in consumption helped to limit price losses. The IEA, in its monthly oil market report released Thursday, deepened its forecast for a contraction in global demand for 2020. The agency expects global demand to contract by 8.1 million barrels a day year on year, 140,000 barrels more than in last month’s report. It’s 2020 oil demand forecast now stands at 91.9 million barrels a day. But analysts said the report might have only a fleeting impact, with prices underpinned by a continued fall in U.S. crude inventories reported by the Energy Information Administration on Wednesday. The EIA reported a decline of 4.5 million barrels in last week’s crude stockpiles, marking a third straight weekly drop. Phil Flynn, senior market analyst at The Price Futures Group, said the data underlined signs of improving domestic demand and the potential for a tightening of supplies globally, noting that the IEA report said global demand exceeded supply in June, implying a drawdown in global stocks over the remainder of the year. “So barring any major setbacks due to a second wave [COVID-19] shutdown or a major stock market meltdown, the prospects for a year-end run-up in oil prices is looking extremely likely,” Flynn said in a daily note. The IEA report, however, also said “ongoing uncertainty around demand caused by Covid-19 and the possibility of higher output means that the oil market’s re-balancing remains delicate.” West Texas Intermediate crude for September delivery CL.1, -1.62% US:CLU20 on the New York Mercantile Exchange lost 43 cents, or 1%, to settle at $42.24 a barrel after spending part of the session flipping between small gains and losses. The global benchmark, October Brent crude UK:BRNV20, shed 47 cents, or 1%, at $44.96 a barrel on the ICE Futures Europe. Cailin Birch, global economist at The Economist Intelligence Unit, said the “initial rebound in oil consumption that was seen in June, and to a lesser extent, July, is likely to plateau in August,” as there isn’t likely to be a sustained recovery in travel, and jet fuel, demand until a vaccine is available, most likely in late 2021. “Meanwhile, demand for other fuel sources will fluctuate in line with the coronavirus case load; when case numbers rise…this will depress demand for gasoline and other energy products, and economic activity dips,” she said in emailed commentary. “Overall, the coronavirus threat will continue to keep a lid on energy demand and prices, and it isn’t likely to dissipate until 2021.” The report from the IEA came a day after the Organization of the Petroleum Exporting Countries said it expects oil demand growth to fall by 9.1 million barrels a day, extending the fall by 100,000 barrels a day from its July forecast. It sees 2020 oil demand of 90.6 million barrels per day. Meanwhile, news of an agreement to establish full diplomatic ties between the United Arab Emirates and Israel “removed a little geopolitical risk off the oil table,” said Edward Moya, senior market analyst at Oanda, in a market update. President Donald Trump made the announcement of the agreement between the two Arab nations Thursday, which is part of a deal to halt the annexation of occupied land sought by the Palestinians for their future state, according to the Associated Press. “This will be Israel’s first diplomatic relations with a Gulf Arab country and will likely put a damper on Iran’s regional influence,” said Moya. In other energy trading, natural-gas futures ended the session higher after the EIA reported Thursday that domestic supplies of natural gas rose by 58 billion cubic feet for the week ended Aug. 7. That was slightly higher than the average increase of 51 billion forecast by analysts polled by S&P Global Platts. September natural gas US:NGU20 tacked on 1.4% to $2.182 million British thermal units. September gasoline US:RBU20 fell 0.7% at $1.2348 a gallon, while September heating oil US:HOU20 lost 1.5% at $1.2381 a gallon."}]}