{"article": [{"url": "https://www.marketwatch.com/story/make-no-mistakethe-pandemic-morphed-into-a-depression-like-crisis-says-ucla-economist-who-predicts-us-economy-wont-recover-from-coronavirus-until-2023-2020-06-25", "published": 1593158600.0, "headline": "â\u0080\u0098Make no mistakeâ\u0080¦the pandemic morphed into a Depression-like crisis,â\u0080\u0099 says UCLA economist, who predicts U.S. economy wonâ\u0080\u0099t recover from coronavirus until 2023", "body": "The road to recovery for the U.S. economy from the COVID-19 pandemic could be a very long one, predicts David Shulman, senior economist at UCLA Anderson School of Management in a recently published quarterly research report. “ â\u0080\u0098Make no mistake, the public health crisis of the pandemic morphed into a depression-like crisis in the economy.â\u0080\u0099 ” â\u0080\u0094 David Shulman Shulman said the current economic damage created by lockdowns and closures that have been put in place for months goes well beyond a garden-variety economic recession. â\u0080\u009cTo call this crisis a recession is a misnomer,â\u0080\u009d he warned. â\u0080\u009cMake no mistake, the public health crisis of the pandemic morphed into a depression-like crisis in the economy,â\u0080\u009d he wrote. Shulman is forecasting a 42% annual rate of decline in real gross domestic product for the current quarter, which he says will be followed by a so-called â\u0080\u009cNike swoosh,â\u0080\u009d or more gradual recovery â\u0080\u009cthat wonâ\u0080\u0099t return the level of output to prior fourth quarter of 2019 peak until early 2023.â\u0080\u009d â\u0080\u009cToo many small businesses will fail, and millions of jobs in restaurants and personal service firms will disappear,â\u0080\u009d Shulman wrote. â\u0080\u009cFor too many workers, the recession will linger on well past the official end date of the depression.â\u0080\u009d Check out: â\u0080\u0098Finance is, like, done. Everybodyâ\u0080\u0099s bought everybody else with low-cost debtâ\u0080\u0099 says ValueAct co-founder Jeff Ubben â\u0080\u0094 â\u0080\u0098Elizabeth Warren was rightâ\u0080\u0099 Shulmanâ\u0080\u0099s forecast comes as the U.S. counted 34,700 new confirmed cases on Wednesday, according to the Associated Press, the highest level since a late April peak number of 36,400. While New York and neighboring states have succeeded in flattening their infection curve, 29 states still see increasing cases over the last 14 days, according to a New York Times tracker. The resurgence of the viral outbreak, which has infected 9.5 million people world-wide, has delayed business reopenings in many parts of the U.S. and compelled Texas to pause its reopening plans. Texas Gov. Greg Abbott said he froze the reopening of the state in response to the spike in cases of COVID-19 and hospitalizations. Shulman told MarketWatch that when he prepared the economic forecast, the viral outbreak looked to be more contained and acknowledges that his grim prediction could be even worse if the virus gets out of control in many of the hotspot states. â\u0080\u009cWhen we did this report, we assumed the path was getting better,â\u0080\u009d he said. â\u0080\u009cThis big acceleration [in cases] happened in the past week,â\u0080\u009d he added. The economist said that the surge in infections and hospitalizations could lead individuals to impose their own lockdowns, notwithstanding any put in place by local and federal governments. Meanwhile, the stock market has been focused on bright spots in the economy and has been mostly disconnected from a labor market that continues to demonstrate softness, even if the worst of the acceleration in job losses has passed. Read:A by-the-numbers look at COVID-19â\u0080\u0099s toll on American lives and livelihoods The Dow Jones Industrial Average DJIA, +0.56% Â , the S&P 500 index SPX, +0.87% Â and the Nasdaq Composite Index COMP, +1.39% Â were all trading sharply higher on Thursday, as the stock market attempted to rebound from its worst one-day selloff since June 11, even as reports on business reclosings and re-implementation of lockdowns were being reported. For Shulmanâ\u0080\u0099s part, he finds the marketâ\u0080\u0099s moves befuddling. â\u0080\u009cI really donâ\u0080\u0099t understand the market. Iâ\u0080\u0099m not a day trader,â\u0080\u009d Shulman told MarketWatch, while also saying he is not an epidemiologist. That said, he thinks that if a vaccine arrives, which he predicts could hit in the first quarter of 2021, the rebound in the economy could take fuller shape. â\u0080\u009cIf the vaccine works quicker, it could be a better outcome for the economy,â\u0080\u009d he said. Read: The decline of the U.S. dollar could happen at â\u0080\u0098warp speedâ\u0080\u0099 in the era of coronavirus, warns prominent economist Stephen Roach Also read: Stock-market legend who called 3 financial bubbles says this one is the â\u0080\u0098Real McCoy,â\u0080\u0099 this is â\u0080\u0098crazy stuffâ\u0080\u0099"}]}