{"article": [{"url": "https://www.marketwatch.com/story/my-ppp-loan-allowed-me-to-reopen-but-it-is-not-going-to-allow-me-to-stay-open-restaurant-owner-lobbies-congress-for-120-billion-relief-fund-2020-07-15", "published": 1594825460.0, "headline": "â\u0080\u0098My PPP loan allowed me to reopen, but it is not going to allow me to stay openâ\u0080\u0099 â\u0080\u0094 restaurant owner lobbies Congress for $120 billion relief fund", "body": "“ â\u0080\u0098The PPP, with the significant changes that Congress made in late spring, is an eight-week solution to an 18-month problem for restaurants. My PPP loan allowed me to reopen, but it is not going to allow me to stay open, even if it is forgiven.â\u0080\u0099 ” That line above came Wednesday from Amanda Cohen, owner of a vegetarian restaurant in New York City called Dirt Candy, as she called on lawmakers to do more for her hard-hit industry while also expressing appreciation for the Paycheck Protection Program. About 8% of forgivable loans from that coronavirus aid program for small businesses so far have gone to the hotel and restaurant industry. â\u0080\u009cIf my fixed costs for running a business donâ\u0080\u0099t change, and demand for dining out remains low, there is absolutely no way that Dirt Candy can survive, because there is a larger issue â\u0080\u0094 going out to a restaurant is not considered to be safe,â\u0080\u009d Cohen also said. She was lobbying for her eatery and the Independent Restaurant Coalition, a trade group formed in March as the coronavirus pandemic spurred to business closures in the U.S. The Independent Restaurant Coalition has been pushing for a $120 billion relief fund for eateries, and the industry association has praised a bipartisan bill known as the RESTAURANTS Act that would establish exactly that type of fund. â\u0080\u009cAs many as 85% of independent restaurants say they will close without direct help. Passing this bill would help avoid this disaster,â\u0080\u009d Cohen said. Her remarks came during a virtual House Small Business Committee hearing that was intended in part to look at ways to help industries that have been disproportionately hurt by COVID-19. Lawmakers are on break and away from Washington, D.C., but set to return Monday and ramp up their negotiations over what will go in the federal governmentâ\u0080\u0099s next big coronavirus relief package, which is now expected to become reality around early August. Related:41% of businesses closed on Yelp have shut down for good during the coronavirus pandemic When a lawmaker asked Cohen what can be done to help people feel more safe at restaurants, she was downbeat. â\u0080\u009cUnfortunately, Iâ\u0080\u0099m not sure we can get anybody to feel safe until we have a vaccine. I mean that is the reality,â\u0080\u009d she said. Different versions of the RESTAURANTS Act were rolled out last month by Republican Sen. Roger Wicker of Mississippi and Democratic Rep. Earl Blumenauer of Oregon, with the Senate version providing aid for some chain restaurants while the House version targets a narrower range of eateries. The National Restaurant Association, whose membership includes big chains, supports the Senate version of the legislation. The group previously has called for a $240 billion relief fund for the food-services industry, and it sent a â\u0080\u009cBlueprint for Restaurant Revivalâ\u0080\u009d to Congress on Wednesday that highlights the proposed $120 billion fund. U.S. stocks have rallied from their March lows thanks in part to optimism around Washingtonâ\u0080\u0099s aid efforts. The main benchmarks SPX, +0.87% Â DJIA, +0.56% Â were trading higher on Wednesday, with analysts pinning some of the sessionâ\u0080\u0099s gains on vaccine hopes."}]}