{"article": [{"url": "https://www.marketwatch.com/story/what-facebook-apple-amazon-microsoft-and-alphabet-have-in-common-with-1970s-nifty-fifty-stocks-2020-10-06", "published": 1601982380.0, "headline": "What Facebook, Apple, Amazon, Microsoft and Alphabet have in common with 1970s â\u0080\u0098Nifty-Fiftyâ\u0080\u0099 stocks", "body": "Many stock-market bears are comparing todayâ\u0080\u0099s â\u0080\u009cFAAMGâ\u0080\u009d stocks to the â\u0080\u009cNifty Fiftyâ\u0080\u009d stocks that dominated the U.S. market in the early 1970s â\u0080\u0094 and which were decimated in the 1973-74 bear market. In fact, the Nifty Fifty story is not as scary as the bears make it out to be. Those stocks eventually overcame their bear-market losses and outperformed the S&P 500 SPX, +0.87% Â . The Nifty Fifty were 50 high-flying blue-chip growth stocks in the early 1970s. Considered â\u0080\u009cone-decisionâ\u0080\u009d stocks, investors believed they could simply buy and hold them for the long term. They became so popular that at the stock marketâ\u0080\u0099s late-1972 peak, their average P/E ratio was more than double that of the overall market. For years thereafter these stocks were Exhibit A in any illustration of investor foolishness, if not outright stupidity. At first blush, the FAAMG stocks â\u0080\u0094 Facebook FB, +0.26% Â , Apple AAPL, +1.74% Â , Amazon. AMZN, +3.01% Â Microsoft MSFT, +2.48% Â , and Alphabetâ\u0080\u0099s Google GOOGL, +1.82% Â â\u0080\u0094 appear similar to the Nifty Fifty. Even though these five companies represent just 1% of the firms in the S&P 500, they account for one quarter of the indexâ\u0080\u0099s total market cap. They also trade at sky-high P/Es â\u0080\u0094 their average, based on trailing 12-month earnings, is currently 51.0, according to FactSet, versus 41.9 for the average Nifty Fifty stock at the December 1972 market peak. Despite the Nifty Fifty stocks losing big during the 1973-74 bear market, they eventually came out ahead, according to Jeremy Siegel, a finance professor at the Wharton School of the University of Pennsylvania. He reached this conclusion upon tracking the performance of a Nifty Fifty list from Morgan Guaranty Trust â\u0080\u0094 a portfolio of all 50 stocks bought at their peak in December 1972 would have been ahead of the market by the mid-1990s. As a double-check on this conclusion, Siegel then calculated the P/E ratios at which each of the Nifty Fifty stocks â\u0080\u009cshouldâ\u0080\u009d have been trading at in December 1972, assuming an investor had perfect foreknowledge of how much their earnings would grow over the next several decades. He found that their P/E ratios on the whole were justified, and that many of the individual Nifty Fifty companies were actually undervalued. To be sure, realizing the Nifty-Fiftyâ\u0080\u0099s market-beating potential would have required heroic patience and discipline. During the 1973-74 bear market these stocks lost well more than the S&P 500, which fell 45%. Few shareholders had the fortitude to hold for the long term. Still, it is incumbent on the bears who use the Nifty Fifty analogy to acknowledge that these stocks eventually came out ahead. Thereâ\u0080\u0099s another way in which the FAAMG vs. Nifty Fifty analogy is not as scary as it first appears: Relative to the overall market, todayâ\u0080\u0099s FAAMG stocks are less overvalued than the Nifty Fifty were at the December 1972 market peak. This is illustrated in the accompanying chart. At the December 1972 peak, the average P/E of the Nifty Fifty stocks (based on trailing 12-month earnings) was 2.2 times that of the S&P 500. In contrast, the average FAAMG P/E ratio today is 1.4 times that of the S&P 500. What these data suggest is that investors should focus less on whether the FAAMG stocks are overvalued relative to the U.S. market and more on the overvaluation of the market as a whole. Even while acknowledging that the S&P 500â\u0080\u0099s current P/E ratio may be artificially inflated because of COVID-19, itâ\u0080\u0099s still concerning that it is double what it was at the December 1972 bull market peak. Just donâ\u0080\u0099t blame the FAAMG stocks for that. Mark Hulbert is a regular contributor to MarketWatch. His Hulbert Ratings tracks investment newsletters that pay a flat fee to be audited. He can be reached at mark@hulbertratings.com More: Hereâ\u0080\u0099s how stocks typically perform in October and why you may want to buckle up Plus: Why this frustrated value stock pro sees shades of 1999 in the market now â\u0080\u0094 and bargains in the future"}]}