{"article": [{"url": "https://www.marketwatch.com/story/does-your-target-date-investment-need-a-new-target-2020-06-17", "published": 1592456780.0, "headline": "Does your target-date investment need a new target?", "body": "This article is reprinted by permission from NerdWallet. Target-date investments are supposed to be an easier way to invest, and they’re a popular choice in 401(k) plans. But the recent market downturn showed that some target-date strategies suffered much bigger losses than others, especially for investors nearing retirement. Target-date investments did protect near-retirees from the full force of the selloff. While U.S. stocks overall lost 33% in the 30-day period ending March 20, the average target-date fund for people retiring in 2020 dropped 17%, says Leo Acheson, director of multi-asset ratings at Morningstar. But losses among some popular funds ranged from 13% to 23%, reflecting dramatic differences in how the investments are constructed. “Some of these 2020 funds, you might look at them and think they’re probably pretty similar to one another,” Acheson says. “But when you look beneath the hood, you find out that actually some 2020 funds are taking a lot more risks than other 2020 funds.” An outsize loss by itself isn’t a good reason to bail on an investment. The same strategy that’s giving you heartburn now could deliver above-average returns later. If you’re approaching retirement, however, you want to be sure the investment strategy you’re using still makes sense. You have less time to make up losses — and more risk of running out of money.How target date strategies work Target-date investments come in two forms: mutual funds, which are available at brokerages and in workplace retirement plans, and collective investment trusts, which are found only in workplace plans. Although people use target-date strategies in IRAs and taxable accounts, they’re particularly popular in 401(k)s. One Fidelity survey found about half of all assets in tax-exempt retirement funds are invested in target date options. The name comes from the fact that the mix of stocks and bonds gets more conservative as the target date — typically the year the investor plans to retire — gets closer. A Target Date 2020 option is designed for someone retiring soon while Target Date 2060 is meant for retirements that are 40 years away.How target-date strategies differ That’s where the similarities end, however. Investment companies offering these products choose different initial mixes of stocks and bonds as well as different “glide paths,” or rates at which the mix is adjusted. On average, target date strategies for 2020 had 43% of their portfolios invested in stocks, but one fund had 55% in stocks while another had just 8%, Acheson says. Read: ‘Health care will keep us from going back to the U.S.’: Texas couple who retired to Spain on about $2,000 a month The types of investments differ, as well. For example, some funds that are more conservative with their stock allocation take more risks with their bonds, choosing corporate bonds or even high-yield “junk” bonds over U.S. Treasurys and other government debt. Those riskier bonds offer better returns in good times but often get trounced in extreme downturns, when investors flee to the safety of government bonds. On top of all that, investment companies tinker with their formulas, so the strategy in place when you initially invested might change by the time you retire.So what’s an investor to do? Understanding how your target date works requires time and research. Your 401(k) provider or brokerage will be able to provide you with information, including how the investment’s glide path works, its expense ratios and how those compare to industry averages. Then you have to decide if you’re comfortable with its approach, given the expected risks and returns. If you decide you’re not happy with your current choice, you have options. If you’re in a workplace retirement plan, you might choose a different date (such as the 2015 fund if you think the 2020 option is too risky, or Target Date 2025 if you’re willing to take more risk), though you probably can’t switch target date providers since most 401(k)s only offer one. If your money is in an IRA or taxable account, you could switch providers as well as target dates. Another possibility is to craft your own portfolio. Consider consulting a fee-only, fiduciary adviser — one who’s committed to putting your best interests first — for help. Getting good advice is something you should do anyway before you retire, because many retirement decisions are irreversible and mistakes can make your life a lot less comfortable. Also, our ability to avoid financial errors tends to decline starting in our 50s, even though our confidence in those abilities remains high. Working with a trusted adviser can help us avoid blind spots that could be costly. See: Here’s proof that 401(k) plans are not working for most Americans — can you guess who they ARE working for? All of this work is the exact opposite of the hands-off-the-wheel approach you probably wanted when you chose a target-date investment. But staying hands-off — or making changes without professional advice — could mean losses that drive your retirement into a ditch.More from NerdWallet: Survey: How the Pandemic Alters Americans’ Financial Habits SmartMoney Podcast: Make Your Donations Go Further; Plan for New Baby Expenses Make Room on Credit Cards to Add Options in an Emergency Liz Weston is a writer at NerdWallet. Email: lweston@nerdwallet.com. Twitter: @lizweston."}]}