{"article": [{"url": "https://www.marketwatch.com/story/us-manufacturers-expand-for-fifth-month-in-a-row-ism-finds-but-at-slower-pace-2020-10-01", "published": 1601553440.0, "headline": "U.S. manufacturers expand for fifth month in a row, ISM finds, and maintain momentum", "body": "The numbers: American manufacturers grew in September for the fifth month in a row as they reconfigured their factories to cope with the coravirus pandemic and brought back more workers, a good sign for a U.S. economy still recovering from the worst pandemic in a century. The Institute for Supply Management said its manufacturing index slipped to 54.6% in September from a 21-month high of 56% in the prior month. Readings over 50% indicate growth. Although the index declined for the first time since April and fell short of the 56.5% MarketWatch forecast, the tenor of the September ISM report was quite positive. New orders and production were strong again and a contraction in employment since the start of the pandemic neared an end. “Manufacturing performed well in the month with demand, consumption and inputs registering growth indicative of a normal expansion cycle,” said Timothy Fiore, chairman of the survey. “While certain industry sectors are experiencing difficulties that will continue in the near term, the manufacturing community as a whole has learned to conduct business effectively and deal with the variables imposed by the COVID-19 pandemic,” he said. What happened: Fourteen of the 18 industries tracked by ISM expanded in September. The index for new orders slipped 7.4 points, but it was still quite robust at 60.2%. Ditto for production: The gauge fell 2.3 points to 61%, but any reading over 60 is very vigorous. “Business has continued to be strong, with September following August. October is also shaping up to be a good sales month as well,” said a senior executive at company that makes plastics and rubber products. Another executive at a maker of electrical equipment said, “Demand remains high, strong finish to 2020 projected, with an even stronger 2021 fiscal year.” Perhaps the best news was an increase in the employment index to 49.6% from 46.4% — a sign companies are ready to hire or bring back most of their workers. Read:U.S. jobless claims fall to six-month low of 837,000 — but there’s a California catch The ISM index is compiled from a survey of executives who order raw materials and other supplies for their companies. The gauge tends to rise or fall in tandem with the health of the economy. See: MarketWatch Economic Calendar Big picture: The sharp rebound in manufacturing shown by the ISM survey suggests the U.S. economy is recovering faster than expected, but business has by no means returned to normal. What the ISM survey is designed to reveal is simply whether business is getting better or worse each month, not how much better. Most manufacturers are still producing fewer goods with fewer workers than they were before the pandemic, and it’ll likely be some time before output and employment climb above pre-crisis levels given depressed demand at home and abroad. See:MarketWatch Coronavirus Recovery Tracker What they are saying? “Yes, the Institute for Supply Management’s overall index fell, but the level is pretty high,” said Joe Naroff of Naroff Economic Advisors. “Employment cut backs continued, but at a minimal pace.” Market reaction: The Dow Jones Industrial Average DJIA, +0.56% and S&P 500 SPX, +0.87% rose in Thursday trades."}]}