{"article": [{"url": "https://www.marketwatch.com/story/fauci-makes-dire-prediction-for-america-in-the-ongoing-fight-against-coronavirus-2020-06-30", "published": 1593597800.0, "headline": "Fauci gives dire warning to Americans: 100,000 new coronavirus cases a day", "body": "Anthony Fauci, director of the National Institute of Allergy and Infectious Diseases for three decades and one of the leading experts on pandemics in the U.S. for the last four decades, on Tuesday made a dire warning for the U.S. in the ongoing battle to control the spread of COVID-19. Fauci said SARS-CoV-2, the official name for the novel coronavirus that causes the disease known as COVID-19, new cases will continue to appear unless lawmakers and the U.S. public start to take social-distancing rules seriously. He said the recent surges were “disturbing.” “ ‘I would not be surprised if we go up to 100,000 a day, if this does not turn around.’ ” — Anthony Fauci, National Institute of Allergy and Infectious Diseases “I would not be surprised if we go up to 100,000 a day, if this does not turn around,” he said. The number of confirmed coronavirus cases hit a new daily high of 40,000 last week, the highest number of daily cases since they reached 36,400 in a 24-hour period in April. He was speaking Tuesday at the Senate Health, Education, Labor and Pensions Committee in Washington, D.C., alongside other government officials, including Robert Redfield, director of the U.S. Centers for Disease Control and Prevention. The COVID-19 pandemic, which was first identified in Wuhan, China in December, had infected 10,501,482 people globally and 2,636,538 in the U.S. as of Wednesday. It had claimed at least 512,071 lives worldwide, 127,427 of which were in the U.S., according to Johns Hopkins University. While COVID-19’s progress has slowed in major cities such as New York, where most cases in the U.S. are centered, confirmed coronavirus cases have risen in 35 U.S. states, with some of the most populace states a key cause of concern. New cases in Texas are up 27% over the last week; California, up 17%; and Florida, up 40%; Arizona, up 32%; South Carolina, up 30%; Nevada, up 29%; Montana, up 26%; and Oklahoma and Arkansas, up 20% respectively, according to this tally in the Washington Post. The Dow Jones Industrial Index DJIA, +0.56% and the S&P 500 SPX, +0.87% were slightly higher Wednesday, despite the surge in coronavirus cases in some of the most populous states in the U.S., including California, Florida and Texas. The coronavirus pandemic is “not even close to being over,” according to the head of the World Health Organization, and the worst is still to come, in what was a grim assessment of the state of affairs some six months after the first cases were reported in China. “ The EU left the U.S. off its list of countries whose residents will be able to travel there without travel restrictions. ” “Six months ago, none of us could have imagined how our world — and our lives — would be thrown into turmoil by this new virus,” Tedros Adhanom Ghebreyesus told reporters at a news briefing on Monday. “The pandemic has brought out the best and the worst of humanity.” Also Tuesday, the European Union left the U.S. off its list of countries whose residents will be able to travel into the 14-bloc nation without travel restrictions. The U.S. must ensure that new COVID-19 cases over the last 14 days and per 100,000 inhabitants are close to or below the EU average. Citizens of Australia, Canada, Japan, New Zealand, South Korea, Thailand, Uruguay and China, “subject to confirmation of reciprocity,” will all be able to travel to the EU as of July 1. While the virus’s spread has stabilized in Europe, cases have been rising in the last 14 days in 35 U.S. states. How COVID-19 is transmitted"}]}