{"article": [{"url": "https://www.marketwatch.com/story/dow-industrials-aim-to-get-off-the-week-to-a-solid-start-futures-jump-350-points-11601292955", "published": 1601311580.0, "headline": "Dow ends 410 points higher, stocks rally ahead of presidential debate and Friday's jobs report", "body": "U.S. stock indexes booked solid gains Monday, kicking off the week on a positive note as investors embraced hopes of additional fiscal stimulus, but looked for more clarity on the White House race and the state of the economy. How did stock indexes perform? The S&P 500 SPX rose 53.14 points, or 1.6%, to end at 3,351.60. The Nasdaq Composite COMP climbed 203.96 points, or 1.9%, to close at 11,117.53. The Dow Jones Industrial Average DJIA advanced 410.10 points, or 1.5%, finishing at 27,584.06, while booking its third session of gains in a row. The Russell 2000 Index RUT, +0.55% of small-capitalization companies outperformed, booking a 2.4% gain to close at 1,510.35. Last week, the Dow finished down 1.8% and the S&P 500 index recorded a 0.6% decline, both marking their longest losing streaks since August of 2019. The Nasdaq Composite Index gained 1.1% for the week, ending its three-week losing skid. What drove the market? Wall Street got off to a positive start on Monday and remained elevated as Washington took another stab at reviving talks on stalled coronavirus stimulus aid, a hoped-for development that has been viewed as a key driver of the market's next bullish phase. \"There's been concern that the momentum of the econonic recovery was slipping with Congress delaying fresh stimulus,\" Bruce Bittles, chief investment strategist at Baird, told MarketWatch. \"Now it looks like we're closer to getting a package sooner or later.\" House Speaker Nancy Pelosi over the weekend said there's a chance that a deal on new aid can be achieved. \"I trust Secretary [Steven] Mnuchin to represent something that can reach a solution, and I believe we come to an agreement,\" Pelosi said on CNN's \"State of the Union.\" Reports indicated that an aid package could be voted on at the beginning of next month, with Pelosi advocated for a $2.2 trillion deal to help out-of-work Americans and businesses hard hit by the COVID-19 pandemic. But bargain shopping might also have served as a potential catalyst for the push higher in stocks, after weeks of consecutive selling in U.S. equities. \"Markets are trying to regain their footing, but with so much election uncertainty looming, that may take time,\" said James Meyer, chief investment officer for Tower Bridge Advisors. The first televised presidential debate has been set for Tuesday between President Donald Trump and Democratic challenger Joe Biden, which could help to influence the trajectory of the 2020 race for the White House, with Biden leading by 7 percentage points, 49.8 to 42.8, in an average of national polls by RealClearPolitics. See: What stock-market investors will be watching for in first Trump-Biden debate Wall Street has viewed a Trump second term largely as a continuation of business-friendly policies, with a Biden win as likely to result in a higher tax regime for American corporations and tighter regulations. Another round of announced corporate mashups, including a so-called \"merger of equals\" between shale producers Devon Energy DVN, -2.42% and WPX Energy WPX, -1.88%, also provided some additional optimism for Wall Street on Monday. \"A lot of energy companies are suffering and mergers and acquistions make a lot of sense,\" Bittles said, in terms of making the companies viable in a tough environment with crude prices hovering near $40 a barrel. Palantir Technologies PLTR, -0.50% and Asana ASAN, -3.12% also have plans to go public on Wednesday, putting the U.S. initial public offering market near to booking its busiest third quarter since the dot.com era. On the economics front, Cleveland Federal Reserve Bank President Loretta Mester warned on Monday that the U.S. economy remained \"fragile\" and won't fully recover until actions are taken to promote a more inclusive economy, during a webinar sponsored by the African American Chamber of Commerce of Western Pennsylvania . But China's national statistics office said industrial profits surged in August, signaling the world's second-largest economy was moving past the effects of the coronavirus-induced downturn. Separately, rising tensions between China and the U.S. continued to simmer, with the fight over TikTok raging. The Trump administration's ban of the popular social-media platform was overturned by a federal judge over the weekend. The U.S. Commerce Department plans to implement a full ban of the China-based platform on Nov. 12 if a deal for at least the U.S. arm of the operation isn't consummated. The unusual deal, given it is being seemingly dictated by governments, has been viewed as a proxy for the state of Sino-American relations. In public health news, the U.S. reported nearly 37,000 new cases of the novel strain of coronavirus that causes COVID-19, with the world-wide tally approaching one million. Investors also will look to a key piece of economic data this week, the update on the monthly U.S. jobs report due on Friday. MarketWatch-polled analysts are penciling in a gain of 810,000 for September, down from 1.37 million in August. In other news, Wall Street and Capitol Hill were digesting a New York Times report that alleges, citing two decades of tax documents obtained by the paper, that Trump paid just $750 in federal taxes in 2016 and 2017, and nothing in 10 of the past 15 years. Which stocks were in focus? Devon Energy and WPX Energy said they reached an all-stock merger deal with an enterprise value of $12 billion. Devon Energy rose 11.1%, while shares of WPX Energy advanced 16.4%. Shares of Virgin Galactic SPCE, -3.12% rallied 24.8% Monday after two Wall Street analysts started covering the stock with a buy rating, with one calling its growth potential \"unparalleled.\" MobileIron, MOBL, +0.14% a mobile security platform serving the work-from-home market, said Monday it will be acquired by Ivanti Inc. in an all-cash deal valued at about $872 million. MobileIron's shares gained 6.2%. Amazon.com Inc. AMZN, +3.01% announced the dates for this year's Prime Day: Oct. 13 and 14. The e-commerce giant's stock rose 2.6%. Shares of Inovio Pharmaceuticals Inc. INO, -1.36%  were halted in premarket trading on Monday before the company said the Phase 2/3 clinical trial for its COVID-19 vaccine candidate was in a \"partial clinical hold\" while it answered additional questions from the Food and Drug Administration. The company's shares tumbled 28.4%. Cal-Maine Foods Inc. shares CALM, -0.75%  rose 0.7% Monday, after the egg producer posted a smaller-than-expected loss for its fiscal first quarter and sales that topped estimates. Shares of Uber UBER, -0.18% gained 3.2% after the ride-hailing app won an appeal allowing it to continue to operate in London, its biggest European market. How did other markets trade? The 10-year Treasury note yield TMUBMUSD10Y, 0.777% edged 0.2 basis point higher to 0.661%. Bond prices move inversely to yields. U.S. benchmark crude futures for November delivery CL.1, -1.62%  finished 35 cents, or 0.9%, higher at $40.60 a barrel on the New York Mercantile Exchange. Gold futures settled 0.9% higher at $1,882.30 an ounce. In global equities, the Stoxx Europe 600 index SXXP, +0.55% booked a 2.2% gain and the U.K.'s FTSE 100 UKX, +0.64% rose 1.5%. Meanwhile in Asia, Japan's Nikkei NIK, -0.11% gained 1.3% and Hong Kong's Hang Seng Index HSI, -0.30% rose 1%. The ICE U.S. Dollar index DXY, -0.58%, a gauge of the greenback's strength, made a sharp swing lower on Monday. The index fell 0.4%. Mark DeCambre contributed additional reporting"}]}