{"article": [{"url": "https://www.marketwatch.com/story/european-stocks-rise-after-trump-unilaterally-extends-jobless-benefits-11597044501", "published": 1597038020.0, "headline": "European stocks and Dow futures rise after Trump unilaterally extends jobless benefits", "body": "U.S. President Donald Trump signs executive orders extending coronavirus economic relief, during a news conference in Bedminster, New Jersey, on August 8, 2020. jim watson/Agence France-Presse/Getty Images European stocks rose on Monday, buoyed by a move from U.S. President Donald Trump to unilaterally extend jobless benefits in the world’s top economy. After a 2% gain last week, the Stoxx Europe 600 SXXP, +0.55% rose 0.2%. Oil giants BP BP, +0.56%, Royal Dutch Shell RDSA, +2.08% and Total FP, +1.54% were among the gainers. The U.K. FTSE 100 UKX, +0.64%, and French CAC 40 PX1, +0.71% each rose 0.3%, while the German DAX DAX, +0.06% was fractionally lower. U.S. stock futures ES00, +1.13% also rose. The moves came as President Trump signed four executive orders over the weekend, including one that extends federal unemployment benefits at a rate of $400 a week from the expired level of $600 a week, and another that temporarily cuts payroll taxes. It isn’t clear whether the executive orders will withstand legal challenges, and the benefits funding, achieved through tapping an emergency program, is set to last five weeks. “Risk assets are signaling a considerable drop in Congress’ ‘cliff-edge’ premium; nevertheless, if U.S. lawmakers underdeliver, it could pleat economic growth expectations into year-end,” said Stephen Innes, global chief markets strategist at AxiCorp. The latest report on U.S. job openings comes at 10 a.m. Eastern. Carnival CCL, +1.26% shares rose 1.6%, as its Aida division extended its pause of its cruise season until Sept. 30, except for early September trips from Kiel and Hamburg. The U.S. dollar USDTRY, -1.07% rose 0.5% to 7.33 Turkish lira. “If Turkey implodes again it will be more of an issue for the EUR than the USD since some big southern European banks hold large exposures in TRY, although less materially so than in 2018. We see this as a potential trigger for a setback in EUR/USD towards the 1.1530 zone,” said analysts at Nordea. The euro EURUSD, +0.60% edged lower to $1.7774."}]}