{"article": [{"url": "https://www.marketwatch.com/story/this-investor-just-inherited-7000-shares-of-apple-the-internet-has-advice-on-what-he-should-do-now-2020-08-19", "published": 1598163440.0, "headline": "This investor just inherited 7,000 shares of Apple â\u0080\u0094 and the internet has advice on what he should do now", "body": "To hold, or not to hold? Thatâ\u0080\u0099s the question from a guy who just learned that his recently deceased grandfather left him 7,000 shares of Apple AAPL, +1.74%. This personâ\u0080\u0099s grandfather put money earmarked for college into Apple in 2003 when the Reddit poster enlisted in the military, he stated in a thread on that forum. The person told Reddit users about his windfall on Tuesday, a day before Appleâ\u0080\u0099s market capitalization crossed the $2 trillion milestone on an intraday basis. Assuming the stock stayed at its midday trading levels around $467.50, the man with 7,000 shares is looking at a $3.27 million stake in the iPhone and Mac maker. In fact, if he doesnâ\u0080\u0099t do anything until at least the end of the month, heâ\u0080\u0099ll have 28,000 shares of the tech behemoth. Apple is undertaking a four-for-one stock split, but experts are quick to note such a split has no bearing on the companyâ\u0080\u0099s value. In other words, this guy will still have $3.27 million if Wednesdayâ\u0080\u0099s midday price sticks. â\u0080\u009cWhat I need to know is should I move it around or keep it rolling all in AAPL?â\u0080\u009d the poster, whose screen name is â\u0080\u009cBig-Weed,â\u0080\u009d said. Fellow Reddit users chimed in with three forms of advice: hold; diversify; and run far, far away from the online forum and find a professional to help out. One user said the man shouldnâ\u0080\u0099t do a thing, because that positions him alongside the likes of Warren Buffett. The Oracle of Omahaâ\u0080\u0099s Berkshire Hathaway Inc. BRK.B, +0.24% BRK.A, +0.06% held 245,155,566 shares of Apple as of late March, according to a Securities and Exchange Commission filing. â\u0080\u009cThat grandpa is world famous well known investor holding it strong, where is the risk? â\u0080¦ This is a hold for life stock,â\u0080\u009d said the user, â\u0080\u009cAlgoWinner.â\u0080\u009d Another user said the man should get ready to sell most of the holding after the stock splits and thereâ\u0080\u0099s a sugar rush of highs from even more Apple shares hitting the market. Donâ\u0080\u0099t miss:â\u0080\u0098A tale told by an idiotâ\u0080\u0099 â\u0080\u0094 CNBCâ\u0080\u0099s Jim Cramer urges investors not to be fooled by new highs in the stock market After those transactions, this user, â\u0080\u009cace425,â\u0080\u009d said the original poster should get â\u0080\u009ca paid off house and lock the rest of those in low risk diversified investments. â\u0080¦ Donâ\u0080\u0099t touch or risk your core capital and you will enjoy a lifetime of that sweet American pie so many of us can only dream of feasting on.â\u0080\u009d MarketWatch checked in with some pros for their take. The Reddit userâ\u0080\u0099s first mistake was even letting people know heâ\u0080\u0099s come into big-time money, according to Kashif Ahmed, president of American Private Wealth, a financial advisory firm in Bedford, Mass. â\u0080\u009cIf all of the sudden you become rich, you all of the sudden have 48 cousins,â\u0080\u009d Ahmed said. He tells clients and potential clients to clam up about windfalls, he said. Beyond those street smarts, thereâ\u0080\u0099s some tax know-how to consider. Because of the â\u0080\u009cstep-up in basisâ\u0080\u009d under current estate-tax rules, an assetâ\u0080\u0099s value resets for capital-gains-tax purposes upon inheritance. Suppose another grandpa bought a stock at $5 per share. Then his grandson inherited it at $10 per share and sold it at $12 per share. The rule means the tax kicks in on the profit from a sale at $10, not $5, per share. So if this man is going to unload Apple stock and diversify his investments, Ahmed said, he should act fast with a climbing stock price in order to minimize a tax bill. By the way, Ahmed added, this guy should be selling and diversifying. â\u0080\u009cIf I was him, Iâ\u0080\u0099d sell the whole thing, immediately go back and buy [exchange-traded funds] that are broad-market or tech-focused,â\u0080\u009d Ahmed said. That move diversifies the manâ\u0080\u0099s holdings, while retaining exposure to Apple, he said. â\u0080\u009cNothing is forever. â\u0080¦ The day of reckoning will come for all stocks,â\u0080\u009d he said. Apple shares are up 59% so far in 2020. In that same time frame, the Dow Jones Industrial Average DJIA, +0.56% Â is down nearly 2.5% and the S&P 500 SPX, +0.87% Â is up approximately 5%."}]}