{"article": [{"url": "https://www.marketwatch.com/story/coronavirus-aid-talks-entering-final-stages-as-pelosi-mnuchin-meet-in-washington-11601488633", "published": 1601497520.0, "headline": "Coronavirus-aid talks entering final stages as Pelosi, Mnuchin meet in Washington", "body": "Association of Flight Attendants International President Sara Nelson, left, Allied Pilots Association President Eric Ferguson (third from left) and American Airlines CEO Doug Parker join fellow airline executives, union heads and political leaders to call on Congress to pass an extension of the Payroll Support Program during a news conference outside the U.S. Capitol on Sept. 22. (Getty Images) House Speaker Nancy Pelosi and Treasury Secretary Steven Mnuchin took another swing at negotiating a deal for a second major coronavirus bill this year, but agreed only to talk again Thursday. The talks Wednesday, the first in-person discussions in weeks between the House’s top Democrat and the Trump administration’s highest-profile bargainer, came as lawmakers look to leave Washington soon. “If there’s a fair compromise, we’re prepared to do it,” Mnuchin said in an interview on Fox Business News late Wednesday. “I don’t think we’re going to make significant progress until tomorrow, at this point.” Mnuchin spent about 90 minutes in Pelosi’s office Wednesday, after spending about 50 minutes on the phone with her Tuesday. Pelosi issued a terse statement after the meeting with Mnuchin. “Today, Secretary Mnuchin and I had an extensive conversation and we found areas where we are seeking further clarification. Our conversations will continue,” she said. Still, Mnuchin’s offer came as House Democrats were setting up a vote on a slimmed-down version of their original, sweeping $3.4 trillion coronavirus bill that passed in May, which Republicans derided as too expensive. However, the passage of the new $2.2 trillion bill is seen widely as the likely informal end of talks because it would give Democrats another stimulus vote in Congress they could point out to voters as they hit the election campaign trail, even though the bill would die in the Senate. “We’re not going to do a $2.2 trillion deal,” Mnuchin said. He said President Donald Trump had instructed negotiators to raise their offer “significantly” and the administration was now looking to offer a package “in the neighborhood” between $1.5 trillion and House Democrats’ $2.2 trillion top line. After first saying they would vote on the new bill late Wednesday, House Democrats reversed course and put off the vote until Thursday, giving negotiators more time. This week is scheduled to be the last in Washington for House members until after the November election, and possibly the last one for members of the Senate, except for a return to vote on a Supreme Court nominee. House Majority Leader Steny Hoyer said he had told House members to keep their schedules flexible and he also told reporters a vote on what Democrats call the “Heroes 2” bill would not necessarily mean the end of negotiations. The talks come as extra money on top of state jobless benefits has begun to run out and businesses have exhausted the loans extended under the Paycheck Protection Program. Another program to help airlines retain workers expires Wednesday, leaving airlines to say they will have to furlough workers unless it is renewed. All three programs were part of the CARES Act passed in March. “Tomorrow, tens of thousands of airline workers will be furloughed if the program is not extended,” said Nicholas Calio, president and CEO of lobbying group Airlines for America. Read more: Democrats are pushing for another round of stimulus checks and $600 in weekly unemployment benefits But the clock is ticking, and even if Pelosi and Mnuchin reach an agreement, it is unclear how much appetite or time remains for it to clear the Senate. After meeting with his fellow Republicans, Senate Majority Leader Mitch McConnell said Wednesday the idea his colleagues would approve a $2.2 trillion deal was “outlandish.” McConnell’s top lieutenant, Sen. John Thune of South Dakota, said it was unclear a package bigger than the approximately $650 billion one Senate Republicans voted for at the beginning of September could pass there. “Could you pass it? Maybe. But you’re going to pass it with 47 democrats and 13 republicans and that’s — depending on what that number is, I don’t know where the 13 Republicans would come from,” he said. To overcome a filibuster threat, a package would need 60 votes in the Senate, and Democrats control only 47."}]}