{"article": [{"url": "https://www.marketwatch.com/story/fomc-statement-for-september-2020-09-16", "published": 1600266680.0, "headline": "FOMC statement for September", "body": "The Federal Reserve is committed to using its full range of tools to support the U.S. economy in this challenging time, thereby promoting its maximum employment and price stability goals. The COVID-19 pandemic is causing tremendous human and economic hardship across the United States and around the world. Economic activity and employment have picked up in recent months but remain well below their levels at the beginning of the year. Weaker demand and significantly lower oil prices are holding down consumer price inflation. Overall financial conditions have improved in recent months, in part reflecting policy measures to support the economy and the flow of credit to U.S. households and businesses. The path of the economy will depend significantly on the course of the virus. The ongoing public health crisis will continue to weigh on economic activity, employment, and inflation in the near term, and poses considerable risks to the economic outlook over the medium term. The Committee seeks to achieve maximum employment and inflation at the rate of 2 percent over the longer run. With inflation running persistently below this longerrun goal, the Committee will aim to achieve inflation moderately above 2 percent for some time so that inflation averages 2 percent over time and longer-term inflation expectations remain well anchored at 2 percent. The Committee expects to maintain an accommodative stance of monetary policy until these outcomes are achieved. The Committee decided to keep the target range for the federal funds rate at 0 to 1/4 percent and expects it will be appropriate to maintain this target range until labor market conditions have reached levels consistent with the Committee’s assessments of maximum employment and inflation has risen to 2 percent and is on track to moderately exceed 2 percent for some time. In addition, over coming months the Federal Reserve will increase its holdings of Treasury securities and agency mortgage-backed securities at least at the current pace to sustain smooth market functioning and help foster accommodative financial conditions, thereby supporting the flow of credit to households and businesses. In assessing the appropriate stance of monetary policy, the Committee will continue to monitor the implications of incoming information for the economic outlook. The Committee would be prepared to adjust the stance of monetary policy as appropriate if risks emerge that could impede the attainment of the Committee’s goals. The Committee’s assessments will take into account a wide range of information, including readings on public health, labor market conditions, inflation pressures and inflation expectations, and financial and international developments. Voting for the monetary policy action were Jerome H. Powell, Chair; John C. Williams, Vice Chair; Michelle W. Bowman; Lael Brainard; Richard H. Clarida; Patrick Harker; Loretta J. Mester; and Randal K. Quarles. Voting against the actions were Robert S. Kaplan, who expects that it will be appropriate to maintain the current target range until the Committee is confident that the economy has weathered recent events and is on track to achieve its maximum employment and price stability goals as articulated in its new policy strategy statement, but prefers that the Committee retain greater policy rate flexibility beyond that point; and Neel Kashkari, who prefers that the Committee to indicate that it expects to maintain the current target range until core inflation has reached 2 percent on a sustained basis. *** Decisions Regarding Monetary Policy Implementation The Federal Reserve has made the following decisions to implement the monetary policy stance announced by the Federal Open Market Committee in its statement on September 16, 2020: • The Board of Governors of the Federal Reserve System voted unanimously to maintain the interest rate paid on required and excess reserve balances at 0.10 percent, effective September 17, 2020. • As part of its policy decision, the Federal Open Market Committee voted to authorize and direct the Open Market Desk at the Federal Reserve Bank of New York, until instructed otherwise, to execute transactions in the System Open Market Account in accordance with the following domestic policy directive: “Effective September 17, 2020, the Federal Open Market Committee directs the Desk to: Undertake open market operations as necessary to maintain the federal funds rate in a target range of 0 to 1/4 percent. – Increase the System Open Market Account holdings of Treasury securities and agency mortgage-backed securities (MBS) at the current pace. Increase holdings of Treasury securities and agency MBS by additional amounts and purchase agency commercial mortgage-backed securities (CMBS) as needed to sustain smooth functioning of markets for these securities. – Conduct term and overnight repurchase agreement operations to support effective policy implementation and the smooth functioning of short-term U.S. dollar funding markets. – Conduct overnight reverse repurchase agreement operations at an offering rate of 0.00 percent and with a per-counterparty limit of $30 billion per day; the per-counterparty limit can be temporarily increased at the discretion of the Chair. – Roll over at auction all principal payments from the Federal Reserve’s holdings of Treasury securities and reinvest all principal payments from the Federal Reserve’s holdings of agency debt and agency MBS in agency MBS. – Allow modest deviations from stated amounts for purchases and reinvestments, if needed for operational reasons. – Engage in dollar roll and coupon swap transactions as necessary to facilitate settlement of the Federal Reserve’s agency MBS transactions.” In a related action, the Board of Governors of the Federal Reserve System voted unanimously to approve the establishment of the primary credit rate at the existing level of 0.25 percent. This information will be updated as appropriate to reflect decisions of the Federal Open Market Committee or the Board of Governors regarding details of the Federal Reserve’s operational tools and approach used to implement monetary policy. More information regarding open market operations and reinvestments may be found on the Federal Reserve Bank of New York’s website."}]}