{"article": [{"url": "https://www.marketwatch.com/story/the-police-officer-crying-in-that-viral-egg-mcmuffin-video-wants-you-to-know-shes-sick-of-people-being-mean-2020-06-19", "published": 1592641220.0, "headline": "The police officer crying in that viral Egg McMuffin video wants you to know she's 'sick of people being mean'", "body": "She's not \"Stacey\" or \"Officer Karen\" or \"Molly McMuffin\" - her name is Stacy Talbert. And the jokes and comments at her expense over the past week just reinforce the reason she recorded her viral video, she says. \"Everybody lost the whole point of the video,\" Talbert, a sheriff's deputy in McIntosh County, Ga., told NBC News. \"I'm just so sick of people being mean.\" Talbert's tearful 2½-minute clip accusing the staff at her local McDonald's MCD, -0.43% of withholding her breakfast order because she's a cop - and possibly even tampering with it - went viral on Twitter TWTR, -0.23%  on Wednesday. It racked up millions of views and tens of thousands of comments, and came on the heels of NYPD officers accusing Manhattan Shake Shack workers of spiking their milkshakes with bleach earlier this week. (The NYPD's Chief of Detectives later said there was \"no criminality\" involved.) Both fast food incidents have served to further highlight the growing tension between police officers and the communities they serve, as well as the backlash against police and the widespread protests against racial injustice and police brutality in the weeks since Breonna Taylor, George Floyd and Rayshard Brooks were killed during their encounters with law enforcement. Read more:This video of a tearful Georgia police officer accusing McDonald's of withholding her Egg McMuffin order on purpose has gone viral Talbert revealed that she recorded herself breaking down outside of the McDonald's restaurant in Richmond Hill, Ga. in a Facebook Live video FB, +0.26%  on Monday morning after she had finished an overnight shift. And she told the Comcast-owned CMCSA, -0.99%  news channel that she was frustrated, not afraid. \"It's not that people are waiting in the wings to hurt us. It's that people don't trust us,\" she said, adding that she's been to that McDonald's more than 100 times and has always been well-treated there. But she also noted that she has felt more suspicious in general. \"I just wanted to share that I hurt, too,\" she said. “ \"If [officers] don't feel compassion or emotion, if they don't cry over anything, I promise you that is not the officer that you want on the street.\" ” Talbert struck a different tone with BuzzFeed News, however, claiming that her McDonald's experience on Monday felt \"sketchy.\" \"I'm not going to accuse anyone, but it was sketchy,\" she said. Talbert's video, which went viral on Twitter when it was posted by a conservative, pro-Trump account that has since been deleted, was viewed more than 10 million times on Facebook before it jumped to Twitter. It features Talbert explaining that she placed a mobile order for an Egg McMuffin meal. But her order wasn't ready when she went to pick it up. \"And I'm waiting. And I'm waiting. And I'm waiting,\" she says. She was told to pull over to the side, and an employee eventually came over and gave her a coffee. But Talbert's order was supposed to include an Egg McMuffin and a hash brown, as well. \"That's all she hands me is the coffee,\" she says, breaking down into tears. \"I said, 'Don't bother with the food because right now I'm too nervous to take it!' It doesn't matter how many hours I've been up. It doesn't matter what I've done for anyone. Right now, I'm too nervous to take a meal from McDonald's because I can't see it being made!\" She didn't clarify her suggestion that the McDonald's staff was tampering with her food, telling BuzzFeed on Thursday that, \"I am telling you I have no idea of that, and I didn't take it to find out.\" Related:On Juneteenth, a look back at how America perfected the 'art of demonizing black men' The restaurant's franchisee owners, Gary and Jill Stanberry, told MarketWatch by email on Wednesday that they have apologized to Talbert. \"We are happy to report that the officer was never denied service and also shared positive feedback on the employee with whom she interacted,\" they said. Talbert told BuzzFeed that Jill Stanberry had asked her to take down her video on Facebook, but she refused because \"it's done so much good.\" It certainly sparked a heated online debate, with supporters sympathetic to the pressures and anxieties that many working in law enforcement are facing amid the backlash. But critics blasted what they deemed as an overreaction over a breakfast sandwich at a time when the nation is grappling with a pandemic and reckoning with racism and police brutality. Some questioned whether she was capable of serving as an officer. Her response: \"I was hired by my sheriff's office to do a job, and they knew when they hired me that I was stable enough to do the job without an issue and I've been doing the job for 15 years,\" she told BuzzFeed. As for her tears: \"It was exactly how every single officer feels, and if they don't feel compassion or emotion, if they don't cry over anything, I promise you that is not the officer that you want on the street.\" “ \"'Cop Karen' - whoever did that, that's funny.\" ” As for the jokes calling her \"Officer Karen\" and the like - \"Karen\" has become a slang term for the stereotype of an entitled, privilege white woman - she said she's laughed at them. \"It's actually kind of funny,\" she told NBC. She sounded even more amused while speaking with BuzzFeed. \"I'm not bitching. I think that s---'s funny,\" she said. \"'Cop Karen' - whoever did that, that's funny. 'Molly McMuffin,' someone called me. That's funny! I'd make money if I was that funny.\""}]}