{"article": [{"url": "https://www.marketwatch.com/story/trumps-positive-coronavirus-test-puts-spotlight-on-presidential-line-of-succession-2020-10-02", "published": 1601718020.0, "headline": "Trumpâ\u0080\u0099s positive coronavirus test puts spotlight on presidential line of succession â\u0080\u0094 hereâ\u0080\u0099s a primer", "body": "Markets appeared rattled early Friday after President Donald Trump said he had tested positive for the coronavirus causing the disease COVID-19 as traders wonder whatâ\u0080\u0099s next and put a spotlight on the presidential line of succession. Trump tweeted that he and first lady Melania Trump are starting their â\u0080\u009cquarantine and recovery process.â\u0080\u009d Here is a primer on the presidential line of succession and whether a presidential candidate could be replaced on the ballot when an Election Day lies just a month in the future. Related:Trump being taken to Walter Reed Medical Center for evaluation after diagnosis Also read:Trump â\u0080\u0098fatigued but in good spirits,â\u0080\u0099 White House doctor says If a president, Trump in this case, can no longer serve as president for health reasons, the vice president, with Trumpâ\u0080\u0099s No. 2 being Mike Pence, would take the reins and presumably quickly pick a fellow partisan to serve as his vice president, just as Gerald Ford succeeded Richard Nixon upon the Republican presidentâ\u0080\u0099s resignation and tapped Nelson Rockefeller. Pence tested negative for the disease caused by the coronavirus on Friday morning and â\u0080\u009cremains in good health and wishes the Trumps well in their recovery,â\u0080\u009d his press secretary said on Twitter. But if Pence, a former Indiana governor, ended up becoming somehow not available to act as commander-in-chief, the line of succession would get into the weeds a little. Next in line is House Speaker Nancy Pelosi, the California Democrat, followed by the Senateâ\u0080\u0099s most senior Republican, Sen. Chuck Grassley of Iowa, who is that chamberâ\u0080\u0099s president pro tempore. After that, members of the Cabinet are tapped, starting with the secretary of state (currently Mike Pompeo), followed by the Treasury secretary (Steven Mnuchin), defense secretary (Mark Esper), the attorney general (Bill Barr) and the interior secretary (David Bernhardt). Related:Mnuchin tested negative for coronavirus Friday morning, Treasury says And see:Trump tested positive for coronavirus â\u0080\u0094 hereâ\u0080\u0099s everything we know so far The line of succession then goes on down through the rest of the Cabinet, with the order based on how long ago their department was created, so the head of the Department of Homeland Security, founded in 2002, is last. Chad Wolf heads that department in an acting capacity as he has not been confirmed by the Senate, and the Government Accountability Office has determined that both Wolf and his acting deputy have been in place illegally. A further wrinkle is that Trumpâ\u0080\u0099s transportation secretary, Elaine Chao, who is married to Senate Majority Leader Mitch McConnell, isnâ\u0080\u0099t eligible to ascend to the presidency because she is not a natural-born U.S. citizen, having been born in Taiwan to Chinese parents. A temporary transfer of power to the vice president is also possible. That happened in 2007 for a couple of hours, when former President George W. Bush was anesthetized for a routine colonoscopy and former Vice President Dick Cheney was acting president. In terms of how the Nov. 3 election could change, election-law expert Rick Hasen said in a blog post overnight that â\u0080\u009cas a matter of national importance we need to ask what would happen if one of the presidential candidates died or became incapacitatedâ\u0080\u009d before Election Day. He said â\u0080\u009cballots are already out and millions of people have already voted,â\u0080\u009d so it â\u0080\u009cseems impossibleâ\u0080\u009d to put a new name on the ballot. â\u0080\u009cWhile things are not certain, whatâ\u0080\u0099s most likely [is] that the election would take place on time with the deceased or incapacitated candidateâ\u0080\u0099s name on the ballot, and then there would be a question [as to whether] legislatures would allow presidential electors of each state to vote for someone other than the deceased candidate,â\u0080\u009d wrote Hasen, a professor of law and political science at the University of California, Irvine. â\u0080\u009cThis could lead to a whole lot of mischief if, say, the Pennsylvania Republican legislature tried, over the Democratic governorâ\u0080\u0099s objection, to appoint electors to vote for Pence (if it were Trump who could no longer be a candidate) despite a vote [by] the people of Pennsylvania for Biden over Trump.â\u0080\u009d These new dimensions of uncertainty, as well as disappointment over the September nonfarm-payrolls report, put pressure on the U.S. stock market SPX, +0.87% Â DJIA, +0.56%, which closed with losses on Friday. Related:Dow sinks over 400 points as Trump contracts coronavirus and jobs report disappoints And see:Markets, and analysts, seem unsure how to react to jarring news Trump has COVID-19 â\u0080\u009cThere would be a ton of uncertainty if we faced such a tragedy as a presidential candidate dying during this period,â\u0080\u009d Hasen said."}]}