{"article": [{"url": "https://www.marketwatch.com/story/the-great-outdoors-nycs-urban-oases-reopen-providing-a-much-needed-escape-for-shut-in-residents-2020-08-05", "published": 1596633560.0, "headline": "The great outdoors: NYCâ\u0080\u0099s urban oases reopen, providing a much-needed escape for shut-in residents", "body": "New York City public gardens are savoring Phase 4 days in the sun now that they have gotten the go-ahead to reopen.Â On Aug. 7, the Brooklyn Botanic Garden will join other outdoor horticultural hot spots â\u0080\u0094 the New York Botanical Garden and Wave Hill in the Bronx and the High Line in Manhattan, among them â\u0080\u0094 that are already welcoming visitors whoâ\u0080\u0099ve spent spring and some of summer sheltering at home.Â The Brooklyn Botanic Garden â\u0080\u009cwas founded 110 years ago with the idea that beautiful, accessible outdoor space was essential to health and well-being for New York City residents,â\u0080\u009d interim co-director Leslie Findlen, said in a statement. â\u0080\u009cThat is as true today as it was then.â\u0080\u009d There are, of course, differences between the past and present. Capacity is reduced at gardens for social distancing during the ongoing COVID-19 pandemic. Advance timed-entry tickets are required, as are face coverings. Hours have been pruned at some gardens, and tours and public programs are temporarily suspended.Â After being closed for more than four months, garden staff are eager for nature-hungry New Yorkers to savor the cityâ\u0080\u0099s glorious flower power up close and in person. And people are yearning to return. Following a special complimentary week in July for Bronx frontline health care workers and residents that drew 10,000 guests, the New York Botanical Garden tickets are now available in two-week increments. More than 23,000 tickets have been booked for visits through Aug. 9. Wave Hill visitors can reserve tickets on Monday for the following Thursday to Sunday. The garden reports that the opening four days filled up â\u0080\u009cwithin hours.â\u0080\u009d And since reopening, despite reduced capacity for social distancing, the High Line has most days â\u0080\u009cwelcomed a few thousand people.â\u0080\u009dÂ Deep into summer, now itâ\u0080\u0099s about taking stock of whatâ\u0080\u0099s gone by and making up for lost time. â\u0080\u009cDuring the height of spring, the silence and lack of â\u0080\u0098Oohsâ\u0080\u0099 and â\u0080\u0098Ahhsâ\u0080\u0099 was deafening,â\u0080\u009d said Todd Forrest, vice president for the horticulture and living collections at the New York Botanical Garden in the Bronx, a 250-acre space where annual spectators typically sprout to more than one million.Â Forrest was among a fortunate few to see Daffodil Hill, home to hundreds of thousands of the bulbs, burst into a 4-acre blanket of yellow and white at the garden. He also got to inhale the intoxicating perfume of blooming lilac and cherry trees. â\u0080\u009cI was sniffing for everybody,â\u0080\u009d Forrest said. Also see: Taking the New York City streets back before the cars returnâ\u0080\u0094a post-pandemic vision for a gridlock-free city Similarly, at the Brooklyn Botanic Garden, natureâ\u0080\u0099s show went on as usual â\u0080\u0094 no matter that practically no one got to see it. â\u0080\u009cThe spring and early summer lushness took us aback,â\u0080\u009d said horticulture director Ronnit Bendavid-Val. â\u0080\u009cWe had the most astounding blooms. The entire rose garden was amazing.â\u0080\u009dÂ At the High Line â\u0080\u0094 the elevated plant-filled park that runs about 1.5 miles from Gansevoort Street to West 34th Street that partially reopened in July â\u0080\u0094 â\u0080\u009cthe bird population exploded, especially robins,â\u0080\u009d said horticulture director Eric Rodriguez. â\u0080\u009cThey were not scared of human interaction. You could walk right up to them.â\u0080\u009dÂ And at Wave Hill, a 28-acre Bronx estate with public gardens overlooking the Hudson River, lawns were mowed less frequently. Eastern cottontail rabbits and honeybees had a field day with the clover. The birds and the bees and the beasts have since settled into their typical behaviors. Horticulture staff, reduced in the early days of the coronavirus lockdown and now mostly back to normal, were the lone witnesses to all of these natural highs. Happily, there are more of those sense-stirring experiences for all to enjoy in the coming weeks and months. Gardens, after all, are deeply rooted reminders that life goes on. Summer floral showoffs at the Brooklyn Botanic Garden include crepe myrtle, echinacea, hydrangea, rudbeckia and Russian sage. â\u0080\u009cThe water garden and native flora garden are really going strong,â\u0080\u009d Bendavid-Val said. â\u0080\u009cDespite the heat, everything is green,â\u0080\u009d she said, adding that there are new sights, including a woodland garden.Â Meanwhile, the New York Botanical Gardenâ\u0080\u0099s summer scene-stealers have emerged. â\u0080\u009cBecause itâ\u0080\u0099s so hot and sunny, the stars of the show are the water lilies,â\u0080\u009d Forrest said. Separately, at the High Line, grassland and prairie areas around 20th Street offer splendid natural eye candy, according to Rodriguez. Because of the way the plants were pruned and cut back during pandemic pause, he said, â\u0080\u009cthese areas now look and feel a lot more wild.â\u0080\u009dÂ Also see: Mortgage applications for suburban homes are surging as buyers try to escape the coronavirus pandemic And at Wave Hill, the Wild Garden, the Herb and Dry Gardens and the Aquatic Garden â\u0080\u009care looking pretty great right now,â\u0080\u009d according to Louis Bauer, senior director of horticulture. â\u0080\u009cAlso, having no visitors during closing meant greatly reduced wear on the lawns, making them more lush than any other year.â\u0080\u009d Change is part of nature.Â â\u0080\u009cThe great thing about gardens is that every year is different,â\u0080\u009d said Forrest, who has worked at the New York Botanical Garden for 22 years. â\u0080\u009cIt feels new every year.â\u0080\u009d Unprecedented in so many ways, 2020 is no exception.Â"}]}