{"article": [{"url": "https://www.marketwatch.com/story/mixed-messages-from-mayor-bill-de-blasio-and-gov-andrew-cuomo-on-restarting-nyc-schools-2020-07-02", "published": 1593707240.0, "headline": "Mixed messages from Mayor Bill de Blasio and Gov. Andrew Cuomo on restarting NYC schools", "body": "New York City schools will reopen in a limited way in September, Mayor Bill de Blasio announced in his daily news conference on Thursday. But just a few hours later, Gov. Andrew Cuomo’s office sent out a statement calling the reopening announcement “premature.” Of the 450,000 families who responded to a citywide survey, 75% wanted to send their children back to school in September, said the mayor as part of an announcement that classes will resume with requirements for masks, regular deep cleanings, hand washing and hand sanitizing stations, and staggered schedules that allow for smaller class sizes and social distancing. “We’re full steam ahead for September,” de Blasio said. With the goal “to have the maximum number of kids in our schools as we begin.” Later in the day, however, the governor’s communications director Dani Lever sent out a statement, saying only the state had the power to reopen New York City schools and no decision had been made yet. Also see: Pandemics affect everyone: What’s this one doing to the kids? And: Almost 1.2 million babies could die during the pandemic — but not from the coronavirus School districts should have plans in place “for ‘the new normal’” if it is indeed deemed safe for schools to open in the fall, and the governor “hopes” schools will be able to reopen but won’t make a formal decision on the matter until “more current information” is available, Lever said. “We value the opinion of local politicians and the state’s 700 local school districts as to what should be done,” Lever said, “but the public should not be confused on this important decision that has practical consequences for many.” The back-and-forth between the mayor and governor’s offices on school closures was a source of both tension and confusion in March, when Cuomo and de Blasio issued conflicting statements on the immediate future of the city’s 1.1 million public school students. The city’s education department will send formal reopening plans to the state for approval over the summer, said Schools Chancellor Richard Carranza at de Blasio’s briefing on Thursday. Current reopening plans may also face pushback from working parents who are unable to home-school their children during the staggered weeks they’re not at school. The city’s teacher’s union could raise objections, as well. Also read: Even with reopening, New York still faces a future that looks very different “Schools will reopen in the fall — even on a limited basis — only when the safety of students, parents and staff is assured,” said United Federation of Teachers President Michael Mulgrew in an email to MarketWatch. Mulgrew has previously written that a large influx of federal funding would be required for New York City schools to open with adequate safety measures in place. As COVID-19 cases continue to spike across the U.S., numbers in New York remain low, according to an update sent out by the governor’s office on Thursday. Ten deaths from the virus were recorded statewide on Wednesday, and out of 69,945 tests conducted, just 1.25% came back positive. In New York City, the rate of positive tests was slightly higher, at 1.3%, a slight increase than the 1% and 1.1% positive cases registered on Monday and Tuesday, respectively, citywide. There were 875 new positive cases statewide Wednesday, the fourth straight day numbers rose. On Monday there were 524 cases, and 624 on Tuesday."}]}