{"article": [{"url": "https://www.marketwatch.com/story/amazon-prime-day-could-generate-nearly-10-billion-in-sales-experts-forecast-11602082676", "published": 1602068720.0, "headline": "Amazon Prime Day could generate nearly $10 billion in sales, experts forecast", "body": "Prime Day will serve as the start of the holiday shopping season, analysts say Amazon Amazon.com Inc.’s 2020 Prime Day could generate sales of nearly $10 billion, eMarketer forecasts, with the shopping event marking the start of the holiday shopping season. In its first Prime Day forecast, eMarketer expects sales of $9.91 billion, with U.S. sales coming in at $6.17 billion. Amazon AMZN, +3.01% Prime Day will take place on Oct. 13 and Oct. 14. It’s usually a summertime event, but was delayed by the coronavirus pandemic. “Despite an uncertain economy, consumers will continue to spend heavily on e-commerce and actively seek deals heading into the holiday season,” eMarketer wrote. Amazon typically doesn’t disclose sales numbers for the Prime Day event. Read: Online grocery sales will skyrocket but margins take a hit, analysts say JPMorgan analysts are projecting revenue of about $7.5 billion this year, up from its forecast of $5.3 billion last year. “Importantly, we believe Amazon stands to benefit from an earlier start to holiday shopping, with Prime Day representing ‘good’ pull-forward that helps smooth demand through 4Q,” JPMorgan said. “We expect the shift online to further accelerate this holiday season and Amazon enters its busiest quarter already seeing heavy demand and delivery times not yet normalized to pre-COVID-19 levels. But we believe Amazon is well positioned to handle the holiday surge, with the company increasing warehouse square footage 50%—including opening 100 new operations buildings in September—and Amazon Logistics (AMZL) set to deliver more than 50% of all packages from Amazon fulfillment centers, thereby reducing dependence on third-party shippers.” JPMorgan rates Amazon stock overweight with a price target of $4,050. One of the benefits to pushing back Prime Day to a period closer to the holiday season is that shoppers will be looking to purchase for themselves as well as for gifts. “Retail therapy during COVID has been real, and consumers will likely indulge in products they will use now: electronics, kitchen appliances, and desk/office products,” said Greg Portell, head of global consumer industries and retail at global management consulting firm Kearney. See: Barbie could be queen of the holiday season with analysts upbeat about Mattel and Hasbro “We anticipate a lift in at-home or cold weather activities, toys, and games, as consumers consider how they can stay entertained throughout the season, while apparel sales outside of athleisure will likely trail last year.” Amazon released a new lineup of its Echo smart speakers and other devices late last month, which should also give the e-commerce giant a boost. Amazon has said after past Prime Days that Echo speakers were bestsellers. The company could also ring up sales from a new demographic of shoppers who have turned to e-commerce during COVID-19. “Before the pandemic, the e-commerce story seemed clear: It was geared towards younger, tech savvy generations and focused on specific, delivery-friendly categories, like electronics and clothing,” said Pedro Palandrani, research analyst at ETF provider Global X EBIZ, +1.48%. “However, post-pandemic, older generations realized that online shopping was not only a viable option for many of their needs, but also convenient and safe. With seniors increasingly utilizing the technology at much higher than expected rates, the trajectory for e-commerce’s growth now looks quite different than it did just a few months ago. For Prime Day, this means a larger number of new customers.” Other retailers have also jumped on Prime Day to drive their own sales. This year, for example, Target Corp. TGT, +1.14% is hosting Deal Days on Oct. 13 and Oct. 14 as well. Also: Target to host Deal Days shopping event during Amazon Prime Day Bank of America expects holiday comparative sales growth of 2.2%, compared with 2.7% growth last year. “This holiday, the continued shift online could pressure margins, but most retailers plan to start the holiday season earlier and push store pick-up to mitigate surcharges and ease traffic pressure during peak times,” analysts wrote. “Amazon’s Prime Day is shifting to Oct 13-14 this year (vs. July prior) to kick off the holiday shopping season. Most stores will be closed on Thanksgiving, and Black Friday will not include the usual doorbusters due to safety and social distancing measures.” Bank of America calls Target, Coach parent Tapestry Inc. TPR, +0.80% and Bed Bath & Beyond Inc. BBBY, -1.37% its top choices for the holidays. Analysts think Target’s merchandise selection in “high-demand categories” will give it an edge. Tapestry will see earnings upside due to “stabilizing sales and margin improvement.” And Bed Bath & Beyond is benefitting from a quicker-than-expected turnaround, led by Target vet Mark Tritton, currently the home retailer’s chief executive, analysts say. Don’t miss: Bed Bath & Beyond turnaround under way, but analysts say outside forces are also giving the company a boost Bank of America rates all three retailers buy. Amazon’s price target was raised to $3,800 from $3,675 at Benchmark on Wednesday, which rates the company’s stock buy. Amazon shares were up 2% in early Wednesday trading, and have soared 71% for the year to date. The Amplify Online Retail ETF IBUY, +1.39% has gained 80.6% for 2020 so far. And the S&P 500 index SPX, +0.87% is up 5.1% for the year to date."}]}