{"article": [{"url": "https://www.marketwatch.com/story/trump-says-economy-is-roaring-back-as-us-regains-nearly-5-million-jobs-in-june-2020-07-02", "published": 1593707240.0, "headline": "Trump says economy is â\u0080\u0098roaring backâ\u0080\u0099 as U.S. regains nearly 5 million jobs in June", "body": "President Donald Trump hailed a stronger-than-forecast jobs report on Thursday, saying the U.S. economy is â\u0080\u009croaring backâ\u0080\u009d even as the recovery comes under threat from a renewed surge in coronavirus cases. Addressing reporters at the White House, Trump said the economy was coming back â\u0080\u009cextremely strong,â\u0080\u009d after the government reported the return of 4.8 million jobs in June and an unemployment rate falling for the second straight month to 11.1%. Read:U.S. regains 4.8 million jobs in June and unemployment falls to 11.1%, but rehiring poised to slow The monthly jobs figure easily exceeded the 3.7 million forecast of economists by MarketWatch. Still, the survey was taken before the latest wave of coronavirus cases erupted, and economists are urging caution. The labor-market data was released Thursday instead of the usual Friday because the Fourth of July holiday is being observed tomorrow. â\u0080\u009cWhile we currently still expect a positive print for Julyâ\u0080\u0099s payroll figures, it will be much smaller in size,â\u0080\u009d said Andrew Grantham of CIBC Economics. Now read:â\u0080\u0098Still far from mission accomplishedâ\u0080\u0099 â\u0080\u0094 economists react to June jobs report. The jobs data came as Trump is lagging behind presumptive Democratic presidential nominee Joe Biden in national polls and surveys of battleground-state voters. Though Biden tops Trump in most polls, the president has led Biden on the question of who would be better for the economy. U.S. stocks opened sharply higher after the June jobs report, with the Dow Jones Industrial Average DJIA, +0.56% Â gaining more than 400 points. But the Dow ended the session 92 points higher as investors digested the monthly employment report amid rising numbers of new coronavirus cases in Florida and elsewhere. Read: Dow up nearly 400 points after strong jobs report despite record rise in daily new coronavirus cases. In a shot at Biden, Trump claimed that â\u0080\u009cyour stock market will drop down to nothingâ\u0080\u009d if a president who wants to raise taxes is elected. The former vice president under President Barack Obama has pledged to reverse many of Trumpâ\u0080\u0099s tax cuts. In a video statement, Biden said he was pleased that the unemployment rate had come down â\u0080\u009ca bit more.â\u0080\u009d But, Biden added, the U.S. is still in a â\u0080\u009cdeep, deep job holeâ\u0080\u009d over what he called Trumpâ\u0080\u0099s bungled response to the coronavirus. Sign up for Trump Today and more MarketWatch newsletters."}]}