{"article": [{"url": "https://www.marketwatch.com/story/cdc-confirms-that-coronavirus-already-spreading-in-new-york-city-when-european-travel-ban-went-into-effect-in-march-2020-07-16", "published": 1594985180.0, "headline": "CDC confirms that coronavirus already spreading in New York City when European travel ban went into effect in March", "body": "A U.S. ban on travelers arriving from the EU on March 13 came too late to prevent widespread community transmission in New York City, according to a report Thursday from the federal Centers for Disease Control and Prevention. CDC researchers analyzed the genetic code of virus samples collected from three dozen infected New Yorkers in early March, and found that most of those early cases of the coronavirus could be traced back to Europe. It also confirms what many researchers have already said: That widespread community transmission was well under way in New York City by the time mitigation measures, such as the travel ban, school closures and stay-at-home orders went into effect. None of the New York City strains were directly connected to Wuhan, China, where the outbreak originated — an “unanticipated” finding, according to the CDC researchers. “Although travel restrictions are an important mitigation strategy, by the time the European restrictions were implemented, importation and community transmission of SARS-CoV-2 had already occurred,” reads the report. It’s not the first research to indicate travel from Europe triggered New York City’s severe outbreak, the worst in the U.S., in which more than 25,000 people have died. Gov. Andrew Cuomo has repeated for weeks that the virus came from Europe, and said the CDC report “definitively explains what happened in New York.” Also read: Rule change for how hospitals report coronavirus data to government comes under fire “The federal government just missed it,” he said, adding that the U.S. “spends billions of dollars on an alphabet soup of federal agencies charged with that specific responsibility.” He said the failure of the federal government to listen to its own health officials is “wreaking havoc” on the country and now threatens the state again, as residents from hot spots in the South and Southwest travel to New York. The White House did not immediately return requests for comment on the CDC study or the timing of the travel ban. Earlier on Thursday, Cuomo tempered hopes for the fourth and final stage of reopening in New York City, in part out of concern over the spike in U.S. cases. Museums, indoor cultural venues, malls and indoor dining will remain closed when New York City is cleared to enter Phase 4, which could begin as soon as Monday, Cuomo said. The state will make a final decision on Phase 4 in New York City by 4 p.m. Friday, but either way no new indoor activities will open as part of the phase, Cuomo said. Reopenings could be limited to botanical gardens, zoos and outdoor film and TV production, Mayor Bill de Blasio suggested at his own briefing on Thursday. Also see: Increased wait times for COVID-19 test results coincide with higher rates of infection among younger people “We are still seeing issues not just in the bars and restaurants, but all across the country,” Cuomo said, pointing to air-conditioned indoor spaces at risk of spreading the disease. “So, we’re going to take that precaution in New York City.” The state is also cracking down on bars and restaurants where standing crowds and poor mask enforcement risk spreading the virus. Only venues that serve food will be allowed to serve alcoholic beverages and only to seated patrons. Walk-up bar service is not permitted in the state, Cuomo said. Another new policy will shutter New York City businesses if they are cited for three or more violations, and could be closed before that for “egregious violations,” Cuomo said. Other New York City developments: • New York City will provide care for 100,000 public-school children on “remote learning” days, when the child is not expected to attend class in-person. The so-called learning labs will host children in kindergarten through eighth grade at libraries and other cultural institutions, giving some working parents child care five days a week. The school system, which supported 1.1 million students before the pandemic, is expected to expand the program to more students throughout the year."}]}