{"article": [{"url": "https://www.marketwatch.com/story/covid-19s-next-threat-to-your-401k-2020-08-07", "published": 1596798620.0, "headline": "COVID-19's next threat to your 401(k)", "body": "It is insane that our tax-deferred retirement plans depend on our employers, and we've got yet more reasons to prove it. Sixty billion of them. That's how many dollars that U.S. workers are likely to lose out of their retirement savings because companies are slashing their 401(k) matching contributions. No, really. And half those losses are falling on millennials. The calculations come from MagnifyMoney.com, and they aren't a stretch. Sixteen percent of U.S. employers told researchers they planned to suspend the company match for the next 12 months as a result of the lockdown. 80% of older Americans can't afford to retire - COVID-19 isn't helping Based on the typical matches paid, that works out at around $13 billion in missed contributions. The average match lost would be about $1,100, and about 11.4 million workers would be affected, they estimate. And when you look at the ages of workers, and apply a typical annual return of 6% on investments, that comes to a $59 billion hole in retirement savings. Millennials, the bulk of whom are in their 20s and 30s, are paid less on average than baby boomer and Generation X workers. But that money would have much longer to compound. Losing a $1,000 company match at age 25 is losing more than $10,000 from your pension at age 65. Actually, MagnifyMoney is understating the costs because they are looking at how much you lose by age 65. But we'll need those investments and savings until the day we die, which for growing numbers of people means into their 80s and even 90s. They're also not counting any cost to long-term economic growth from the pandemic, the lockdowns and the aftermath. Add all this to the growing costs, social and economic, of the lockdowns. It will be fascinating to see the final tally. We won't know for a long time how many lives we managed to extend, and for how long, and how much we lost doing so. It is depressingly predictable that many companies will use the pandemic as an excuse to cut matching contributions, just as many will use it as an excuse to fire older workers. The federal government has already pumped about $6 trillion in extra stimulus into the economy to keep it going during the crisis. (And the number is rising). That money is expected to find its way into company profits, which is why the stock market is shrugging off the economic collapse and flying high. The Federal Reserve is even buying company bonds. People in the C-suites have never had it so good. Stock and options are in the stratosphere. But if there's a chance to squeeze working people under the cover of the 'crisis,' why not take it? Blaming for-profit companies for being \"greedy\" makes no sense. Companies seek to maximize profits. You might just as well blame the dog for eating the hamburger you dropped on the floor. The real problem is that we depend on employers for our right to contribute to a 401(k). Why should that be? My taxes and my rights should be between me and the government. This is not a feudal society. I shouldn't have to depend on my employer for these things. In the days when we worked for one company for 40 or more years maybe it made some sense. But those days are long gone. Now we change jobs and careers, and often hold multiple jobs. Yet our retirement plans are stuck in the past. When I was self employed I had access to special tax deferred retirement vehicles, specifically self-employed 401(k)s and Self-Employed IRAs. They allowed me to save much more every year, tax deferred, than the plans available to salaried workers. Everybody should have access to the same plans. And there's a good argument for saying the government, not employers, should offer a match. Sure, it sounds crazy. But if the Fed can print money to help companies, why not working stiffs?"}]}