{"article": [{"url": "https://www.marketwatch.com/story/intel-rides-strong-server-pc-sales-to-earnings-beat-and-forecasts-more-but-stock-still-falls-2020-07-23", "published": 1595528540.0, "headline": "Intel stock falls as next generation of chips delayed, sending AMD shares higher", "body": "Intel Corp. shares dove and rival Advanced Micro Devices Inc. shares gained in after-hours trading Thursday, after Intel reported its next generation of semiconductor technology will be delayed and that it may actually use a third party to manufacture it as a contingency plan. Intel INTC, -1.03% reported along with second-quarter earnings that the introduction of its 7-nanometer chips would be delayed by at least six months. AMD AMD, -3.94% is already selling 7-nm semiconductors for servers and PCs; in chip parlance, nanometers, or nm, refers to the size of the transistors that go on a computer chip, with the general rule being that smaller transistors are faster and more efficient in using power. “We have identified a defect mode in our 7-nanometer process that resulted in yield degradation,” said Bob Swan, Intel’s chief executive, on a conference call late Thursday. “We’ve root-caused the issue and believe there are no fundamental roadblocks, but we have also invested in contingency plans to hedge against further schedule uncertainty.” Those contingency plans could include using “somebody else’s foundry,” Swan said on the call. For example, AMD uses Taiwan Semiconductor Manufacturing Co. TSM, +1.11% to manufacture its 7-nm chips. Intel shares sank more than 10% after hours, following a 1.1% decline in the regular session to close at $60.40. On the other hand, AMD shares rallied 8% and American depositary receipts for TSMC rose more than 4% after hours. Intel’s Swan said he expects Intel to ship its first 7-nm CPU products in late 2022 or early 2023, with data-center products coming out in the first half of 2023. “The 7-nm push isn’t a positive announcement as many products were dependent on it,” said Patrick Moorhead, principal analyst at Moor Insights & Strategy. “Knowing Intel, it always has backups for its backups and I am sure we will be hearing about enhancements to 10-nm to increase its competitiveness.” “We now expect to increase our 10-nanometer base product shipments for the year by more than 20% versus our January expectations,” Swan said on the call. The rest of Intel’s earnings report showed that the chip maker continued to find strong demand for server and computer chips in the throes of the COVID-19 pandemic. The company reported second-quarter net income of $5.1 billion, or $1.19 a share, compared with $4.18 billion, or 92 cents a share, in the year-ago period. After adjusting for restructuring and acquisition-related costs, Intel reported earnings of $1.23 a share, compared with $1.06 a share in the year-ago quarter. Revenue grew 20% to $19.7 billion from $16.51 billion in the year-ago quarter. Analysts surveyed by FactSet had forecast adjusted earnings of $1.11 a share on revenue of $18.54 billion. Intel‘s reinstated guidance beat Wall Street’s expectations. For the third quarter, Intel forecast adjusted earnings of $1.10 a share on revenue of approximately $18.2 billion; for the full year, Intel reinstated guidance of $75 billion in revenue and adjusted earnings of $4.85 a share. Analysts on average expected third-quarter adjusted earnings of $1.11 a share and revenue of $17.92 billion, while projecting full-year adjusted earnings of $4.81 a share and sales of $73.92 billion, according to FactSet. Intel finished Thursday with a market capitalization of $255.7 billion, and has been challenged recently for the market-cap lead in Silicon Valley’s semiconductor sector by corporate neighbor and videogame-chip specialist Nvidia Corp. NVDA, -0.54%, which ended the trading session with a market cap of $249.2 billion, according to FactSet. Intel’s financial performance withstood supply-chain problems when the pandemic caused shutdowns across China in the first quarter, and has largely thrived as COVID-19 spread due to cloud-computing needs and a surge in personal-computer sales. The company’s sales of server chips rose 43% in the quarter, while the traditional PC segment grew 7%. For more: Intel has weathered coronavirus because of data center and PC sales Data-center group, or DCG, revenue rose to $7.1 billion, while analysts expected it to rise $6.61 billion, despite growing competition from AMD. Intel’s largest segment — client-computing, the traditional PC group — rose to $9.5 billion, with analysts expecting a 2.9% rise to $9.1 billion amid strong sales of PCs in recent months. Memory chips have also been in demand for cloud-building “hyperscalers,” and Intel reported that its nonvolatile memory solutions revenue rose 76% to $1.7 billion, while Wall Street expected a 37% rise to $1.29 billion. On the other hand, “Internet of Things,” or IoT, revenue was a disappointment, falling 32% to $670 million, compared with an expected 12% decline to $865.6 million. Mobileye revenue also declined, falling 27% to $146 million, while the Street had expected $217.4 million. While Intel shares were up less than 1% for the year to date at Thursday’s close, AMD has gained 30% on the year and Nvidia’s stock has rallied 72%."}]}