{"article": [{"url": "https://www.marketwatch.com/story/trump-and-gop-fundraiser-broidy-charged-with-lobbying-to-have-investigation-of-malaysian-state-investment-fund-1mdb-abandoned-2020-10-08", "published": 1602230060.0, "headline": "Trump ally and GOP fundraiser Broidy charged with lobbying to have U.S. investigation of Malaysian state investment fund 1MDB abandoned", "body": "WASHINGTON (AP) — Elliott Broidy, a prominent fundraiser for President Donald Trump and the Republican Party, has been charged in an illicit lobbying campaign aimed at getting the Trump administration to drop an investigation into the multibillion-dollar looting of a Malaysian state investment fund. “ Broidy said to have failed to register his lobbying efforts under the Foreign Agents Registration Act. ” Broidy is the latest person accused by the Justice Department of participating in the covert lobbying effort, which also sought to arrange for the return of a Chinese dissident living in the U.S. A consultant, Nickie Lum Davis, pleaded guilty in August federal court in Hawaii for her role in the scheme. The case was filed this week in federal court in Washington, D.C., with Broidy facing a single conspiracy charge related to his failure to register his efforts under the Foreign Agents Registration Act, which requires people lobbying in the U.S. for a foreign entity to disclose that work to the Justice Department. Prosecutors allege that Broidy worked with Davis and others to get the Justice Department to abandon its pursuit of billions of dollars that officials say were pilfered from 1MDB, a Malaysian wealth fund that was established more than a decade ago to accelerate the country’s economic development. From the MarketWatch archives (July 2019):Federal grand jury investigating top GOP fundraiser Elliott Broidy The effort was done on behalf of a fugitive Malaysian financier, Jho Low, who has been charged in the U.S. with conspiring to launder billions of dollars from the fund. The attempt to wipe away legal troubles was ultimately unsuccessful: The Justice Department in 2018 charged Low, who remains at large, in connection with the alleged money laundering and last year reached a civil settlement to recover more than $700 million in assets that officials say are traceable to the looted funds. Low has denied wrongdoing and did not admit blame in that settlement. Broidy has been a top fundraiser for Trump but resigned in 2018 from his role as deputy chairman of the Republican National Committee after it was revealed that he paid $1.6 million to a Playboy Playmate with whom he had an extramarital affair. See: Michael Cohen’s shell company also paid off woman in Broidy affair: report A lawyer for Broidy declined to comment on Thursday. The allegations are contained in a charging document known as an information, which typically signals an intent to plead guilty."}]}