{"article": [{"url": "https://www.marketwatch.com/story/gold-prices-rise-near-two-week-high-to-start-september-as-dollar-slumps-to-around-two-year-nadir-2020-09-01", "published": 1598970020.0, "headline": "Gold inches higher to finish at highest in 2 weeks", "body": "Gold futures on Tuesday settled off the session’s highs after better than expected U.S. manufacturing data lifted the dollar back up from its lowest level in about two years, but prices for the precious metal still finished at their highest in two weeks. Data Tuesday showed that the ISM manufacturing survey rose to 56 in August, from 54.2. The dollar shook off earlier weakness following the report, with the ICE U.S. Dollar Index DXY, -0.58% up 0.2% at 92.306 as gold futures settled, after touching a low of 91.746, the lowest since spring 2018. Read:The dollar’s fall is likely to continue—here’s why you can thank the Fed December gold GCZ20, +2.17% GC00, +2.17% edged up by 30 cents, or 0.02%, to settle at $1,978.90 an ounce, which marked highest settlement since Aug. 18 for a most-active contract, according to FactSet data. Prices, however, had traded as high as $2,001.20 during the session. The Federal Reserve’s decision to alter its monetary-policy framework to allow for inflation to rise above, or below, its 2% annual target for longer periods, has weakened the dollar, with the dollar index down more than 1% last month, and provided more incentive for buyers of bullion who see gold as a inflation hedge, analysts say. “The Fed’s decisions and the new inflation target opened space for a new rally for gold,” wrote Carlo Alberto De Casa, chief analyst at ActivTrades, in a Tuesday report. Read:Brainard says Fed should shift to more aggressive strategy to boost the economy The gains for gold and other precious metals come even as the U.S. stock market traded mostly higher to start September, a month that has historically been a weaker performer than others. “Despite U.S. indices continuing to rally, investors feel the need to increase the proportion of gold in their portfolio in case of new turbulence on both stocks and currencies markets,” De Casa wrote. December silver contract SIZ20, +5.96% SI00, +5.96%, meanwhile, added 5 cents, or 0.2%, at $28.645 an ounce, following a 2.9% rise on Monday. “Once again, it seems to be silver which is leading gold higher and doing it in leveraged style, outperforming gold in London time roughly twofold in terms of the percent increase,” Ross Norman, chief executive officer of precious-metals news and information provider Metals Daily, told MarketWatch. “The market is looking to retake the $2,000 level in the near term” and will be eyeing recent all-time highs, he said. Most-active gold futures reached a record high settlement of $2,069.40 on Aug. 6. “The biggest vulnerability to gold is a correction in the equity market which could prompt short term selling in gold to fund margin calls,” said Norman. “Physical demand remains brisk with retail investors joining central banks and institutional investors in acquiring the yellow metal.” In other Comex action, prices for copper eased back, with the December contract HGZ20, +1.38% down 1.1% at $3.0285 a pound. Prices climbed by 1.4% Monday, buoyed by some upbeat Chinese economic data. October platinum PLV20, +3.99% added 1.6% to $952.70 an ounce and December PAZ20, +2.31% rose 1.4% to $2,311.10 an ounce."}]}