{"article": [{"url": "https://www.marketwatch.com/story/us-job-openings-rise-for-second-straight-month-in-june-2020-08-10", "published": 1597076300.0, "headline": "U.S. job openings slowly climbing out of deep hole", "body": "The numbers: Job openings rose 518,000 to 5.9 million in June, according to the Labor Department on Monday. That’s above the median forecast of 5.3 million jobs in an Econoday survey of economists. The increases follows a gain of 375,000 in May. The number of jobs available was running around 7 million before the pandemic. The number of layoffs and firings rose 522,000 to 4.8 million in June. Hiring eased to 6.7 million from a record 7.2 million in May. The JOLTS data lag behind the monthly employment report by a month. What happened: The largest gains in openings came from accommodation and food service, other service and arts. The biggest declines were in construction and state and local government education. The share of people who left jobs on their own, known as the quits race, rose to 1.9% from 1.8% in May. That’s down from a peak of 3.2% less than a year ago. Few people are willing to quit a job during a recession. Big picture: With job openings 16% below their pre-pandemic level in June, there were still three unemployed workers for every job opening. This shows the labor market has a long way to go to get back to the pre-pandemic strength. There are still 13 million workers who lost jobs in March and April who remain unemployed. Job growth slowed to 1.8 million in July from 4.8 million in June. The unemployment rate fell to 10.2%. What are they saying? “Importantly, the backward-looking data tell little about the current trajectory of the recovery. High-frequency indicators instead show that the labor market has lost some momentum amid an alarming resurgence of coronavirus cases. In the absence of a comprehensive fiscal package, recouping the remaining 13 million jobs lost since February will be a very long and slow slog,” said Lydia Boussour, senior U.S. economist at Oxford Economics Market reaction: Stocks mostly gained Monday as traders looked past the data, with the Dow Jones Industrial Average DJIA, +0.56% closing more than 350 points higher."}]}