{"article": [{"url": "https://www.marketwatch.com/story/biden-to-senators-extinguish-the-flames-engulfing-us-politics-by-not-jamming-through-a-supreme-court-justice-2020-09-20", "published": 1600639040.0, "headline": "Biden to senators: Extinguish the 'flames' engulfing U.S. politics by not 'jamming' through a Supreme Court justice", "body": "WASHINGTON (AP) - Joe Biden on Sunday criticized President Donald Trump and leading Senate Republicans for trying to jam through a replacement for Justice Ruth Bader Ginsburg, who died Friday in Washington, and urged more senators to stand with a pair of GOP colleagues who oppose the election-season rush. The extraordinary televised plea from the Democratic presidential candidate to Republican senators reflected the ferocious maneuvering that has followed Ginsburg's death at 87. Her passing upended a campaign that had, until then, focused on Trump's handling of the coronavirus pandemic, the nation's economic collapse and racial unrest that has stoked protests in U.S. cities. Trump has said he intends within days to name a woman to succeed the liberal icon, and Senate Majority Leader Mitch McConnell was moving toward the first hearings this week. “ With four Republican defections likely necessary to derail McConnell's bid to violate the standard under which he refused to allow the Senate to consider President Obama's nomination to the Supreme Court of Merrick Garland four years ago, attention quickly focused on Sen. Mitt Romney of Utah, who voted to convict Trump on one count of impeachment, and Sen. Chuck Grassley of Iowa, a former chairman of the Judiciary Committee. ” Just hours before Biden spoke, a second Republican senator, Lisa Murkowski of Alaska, joined Sen. Susan Collins of Maine in opposing efforts to fill Ginsburg's seat before the next president is elected. News Pulse:McConnell says a Trump pick to replace Ginsburg on Supreme Court would get Senate vote It takes four Republicans to break ranks to keep Trump's nominee off the court. Attention quickly focused on Sen. Mitt Romney of Utah, who voted to convict Trump on one count of impeachment, and Sen. Chuck Grassley of Iowa, a former chairman of the Judiciary Committee. Biden, who spend 3½ decades in the Senate before his two terms as vice president under President Barack Obama and has drawn criticism from some progressive Democrats for his continued belief in bipartisan outreach, acknowledged that those Republicans and others like them were his target audience when he warned that Trump's plan was an \"abuse of power.\" \"Uphold your constitutional duty, your conscience,\" said Biden, speaking in battleground Pennsylvania. \"Let the people speak. Cool the flames that have engulfed our country.\" There was little chance of calm overtaking the historic campaign as early voting progressed and the death toll from the virus reached 200,000 Americans. Just before Murkowski joined Collins, House Speaker Nancy Pelosi referred to the House having \"options\" she did not name to stall or prevent the Senate from confirming Ginsburg's successor to the lifetime job. \"We have arrows in our quiver that I'm not about to discuss right now,\" Pelosi said on ABC's \"This Week.\" The House has no formal role in the confirmation of Supreme Court justices. But Pelosi would not rule out a new round of impeachment proceedings that might divert the Senate's attention, though that route seemed unlikely. Meanwhile, Murkowski raised by one the number of Republicans opposing a rush to confirmation. \"For weeks, I have stated that I would not support taking up\" a potential nomination as the presidential election neared. \"Sadly,\" she said, \"what was then a hypothetical is now our reality, but my position has not changed.\" Collins, meanwhile, said the next president should name Ginsburg's replacement. Republicans hold a 53-47 edge in the Senate. If there were a 50-50 tie, it could be broken by Vice President Mike Pence. There is another potential wrinkle: Because Arizona's Senate race is a special election, that seat could be filled as early as Nov. 30, which would narrow the window for McConnell if Democrat Mark Kelly, who has a sizable lead in most polls, wins. Trump has said he is obligated to act as soon as possible and had at least two women in mind for the seat. Most Republicans concurred on the need for speed and one named a practical reason: The nine-member court, argued Sen. Ted Cruz of Texas, must be full if called upon to decide the outcome of a disputed presidential election. But Biden and other Democrats said voters should choose the next president, who should pick Ginsburg's successor. Health care, abortion rights and religious freedom are on the line, they said. See:Biden says death of Justice Ginsburg highlights threats to U.S. health care Biden, who has run on uniting the country after Trump's divisive tenure and imparting a sense of comfort to despairing Americans, warned against more upheaval. \"The last thing we need is a constitutional crisis that plunges us deeper into the abyss and deeper into the darkness,\" he said. He acknowledged that if Trump wins on Nov. 3, his pick should be approved. But he added, \"If I win this election, President Trump's nominee should be withdrawn and as the new president I should be the one to nominate Justice Ginsburg's successor.\" Nonetheless, the process for replacing her moved swiftly ahead. On a call with McConnell, R-Ky., late Saturday, Trump mentioned two federal appeals court judges: Amy Coney Barrett and Barbara Lagoa, according to a person familiar with the private conversation who was not authorized to publicly discuss the call and spoke on condition of anonymity. To the chants of \"Fill that seat,\" Trump told supporters at an event Saturday night in North Carolina that he would nominate a woman as soon as this week. \"We win an election and those are the consequences,\" said Trump, who then seemed to signal that he'd be willing to accept a vote on his nominee during the lame-duck period after the election. \"We have a lot of time. We have plenty of time. We're talking about January 20th\" - when the next president is inaugurated. Democrats have denounced McConnell's move to push ahead as hypocritical, pointing out that he refused to call hearings for President Barack Obama's nominee, Merrick Garland, 237 days before the 2016 election. If the court were to take cases with eight justices, 4-4 ties would revert the decision to a lower court; for instance, the Affordable Care Act could then be struck down by a lower Texas court."}]}