{"article": [{"url": "https://www.marketwatch.com/story/stock-index-futures-mostly-higher-after-trump-signs-orders-to-extend-coronavirus-relief-2020-08-10", "published": 1597078820.0, "headline": "Dow, S&P 500 book 7th straight day of gains, Nasdaq ends lower as high-flying tech stocks take a breather", "body": "The S&P 500 booked its longest stretch of gains in about 16 months Monday, as investors monitored signs that a long-awaited rotation on Wall Street into more economically sensitive cyclical stocks could be brewing, but at the expense of their high-flying counterparts. Investors also focused on the significance of President Donald Trump’s weekend signing of executive orders extending some elements of coronavirus relief. The measures face likely legal hurdles and questions about their effectiveness, but the act may spur further talks among lawmakers. Market participants also took stock of U.S.-China tensions.How did major benchmarks fare? The Dow Jones Industrial Average DJIA, +0.56% closed 357.96 points higher, or 1.3%, to 27,791.44, booking its seventh straight day of gains. The S&P 500 SPX, +0.87% added 9.19 points, or 0.3%, finishing at 3,360.47, within 1% of its Feb. 19 closing record of 3,386.15. It also clinched its seventh straight day of advances, its longest streak of gains since April 2019, according to Dow Jones Market Data. The Nasdaq Composite COMP, +1.39% retreated 42.63 points, or 0.4%, to end at 10,968.36. The Dow Jones Transportation Average DJT, +0.84% rose 288.56 points, or 2.7%, to finish at 10,864.90, extending its wins streak to nine sessions in a row, its longest string of gains since January 2018, according to Dow Jones Market Data. Stocks scored gains last week, with the Dow advancing 3.8% to 27,433.48, and the S&P 500 posting a weekly rise of 2.5% to 3,351.28, The Nasdaq gained 2.5% to finish at 11,010.98. The Nasdaq edged lower on Friday after hitting a series of record finishes that propelled it above the 11,000 milestone. Read: If there’s an ‘actionable bubble’ in the stock market, this might be it, says BTIG’s EmanuelWhat drove the market? Monday trading showed signs of a rotation away from high-growth stocks in the tech sector to more economically sensitive cyclical companies, a trend that has been subject to fits and starts over recent weeks. “As the summer COVID-19 spike wanes, investors are more inclined to view the economic recovery as real. That could mean the recent move toward cyclical stocks is real and sustainable for the first time since the pandemic began,” said James Meyer, chief investment officer at Tower Bridge Advisors. Still, investors say it is unclear how far any nascent rally in cyclical companies might run, with the coronavirus still an obstacle that is weighing on the U.S. economic recovery and the feasibility of new fiscal stimulus measures announced by the Trump administration in question. Read: A ‘sharper cyclical rally’ could be in the cards, this analyst says The U.S. reached another dire milestone on Monday as new COVID-19 cases topped 5 million, more than one-quarter of the global total of nearly 20 million cases. Uneven efforts within the U.S. to contain the coronavirus come as the White House and Democratic lawmakers failed last week to come to an agreement on a new round of pandemic aid. In response, Trump on Saturday signed executive orders that aim to pause the collection of payroll taxes, provide help on rent, assist with student-loan payments and extend a portion of additional unemployment benefits that had lapsed at the end of last month. The measures are almost certain to face legal challenges and logistical hurdles. Specifically, one order authorizes states to pay $400 a week in additional unemployment benefits, with 75% of the funding coming from the federal government, versus the $600 in additional benefits that had expired at the end of July, which has been credited with helping borrowers and lenders, thus far, avoid a wave of consumer defaults. See:States would be on the hook for billions under Trump’s jobless-benefits plan “Executive orders that spend money, or presumably cut taxes are fraught with peril,” said Steven Skancke, chief economic adviser at Keel Point, and a former White House National Security Council and U.S. Treasury Department staffer. “To be sure, there have been efforts to try to do that,” Skancke said, pointing to efforts by the Nixon administration to use line-item vetoes over spending he disagreed with from a policy standpoint. “All of that was overturned in the courts,” he said, adding that the precedent doesn’t bode well for Trump’s efforts to override powers of Congress to tax and spend. “They certainly will be challenged, and as a result they don’t provide certainty in terms of their impact,” he told MarketWatch. Meanwhile, U.S.-China tensions intensified, with Beijing on Monday announcing unspecified sanctions against 11 U.S. politicians and heads of organizations promoting democratic causes, including additional measures targeting Sens. Marco Rubio and Ted Cruz, who already were subject to a travel ban. Also, Chinese jet fighters briefly crossed the midline of the Taiwan Strait on Monday, news reports said, as U.S. Health and Human Services Secretary Alex Azar visited the island. Azar is the most senior U.S. official to visit Taiwan in around four decades. Earnings season also further winds down this week. Through Friday, companies representing 89% of the S&P 500’s market cap had reported second-quarter results, according to Jonathan Golub, chief U.S. equity strategist at Credit Suisse Securities. In aggregate, 81% of the companies that have reported beat lowered projections. Earnings Watch:Hot rookies and not-so-hot pot companies jump on the slowing earnings train this week Earnings have exceeded estimates by 23.2% in aggregate, with 81% of the reported companies beating their lowered projections during the pandemic. Golub also noted that while second-quarter earnings per share have surpassed projections by over 23%, consensus 3Q estimates have been raised by only 3%, and fourth-quarter estimates remain unchanged. In economic data, the number of job openings in the U.S. rose 518,000 to 5.8 million, climbing for a second month in a row. But the number of jobs available was running around 7 million before the pandemic.Which companies were in focus? FedEx Corp. FDX, +0.18% and United Parcel Service Inc. UPS, +0.27% shares gained 9% and 1.7%, respectively, Monday, amid bullish analyst comments on the package delivery giants given signs of increasing e-commerce volumes and improved pricing. Shares of MGM Resorts International MGM, -2.59% led the S&P 500’s gains Monday, with the stock adding 13.8% after Barry Diller, chairman of IAC/InterActiveCorp IAC, +0.79% unveiled a 12% stake in the company. Pinterest Inc. PINS, -0.50% shares rose 2.5% in Monday trading after Morgan Stanley analyst Brian Nowak upgraded the stock to overweight from equal weight and raised his price target to $44 from $34. Shares of Beyond Meat BYND, +0.80% fell 4.1%, despite a big upgrade from Goldman Sachs analyst Adam Samuelson who raised his price target for the alternative-protein pioneer from $44 to $112, an 155% increase. McDonald’s Corp MCD, -0.43% fell 0.2% Monday after the fast-food chain said it was suing its former chief executive to recoup severance and benefits worth up to $42 million. The company is alleging that its now ex-CEO Steve Easterbrook lied to its board about sexual relationships he had with employees before he was fired last year. Shares of social media platform Twitter Inc. TWTR, -0.23% gained 0.8% after The Wall Street Journal reported it had held preliminary talks about a potential combination with TikTok, the video-sharing app that the Trump administration has declared a national-security threat due to its Chinese ownership. Microsoft Corp. MSFT, +2.48%, however, is still seen as the front-runner in any deal with TikTok after weeks of talks between it and TikTok’s owner, Beijing-based ByteDance Ltd., the report said. Shares of Berkshire Hathaway Inc. BRK.A, +0.06% BRK.B, +0.24% rose 1.5% after the conglomerate run by billionaire investor Warren Buffett on Saturday reported an 87% jump in second-quarter profit thanks to the rising value of its investment portfolio, though it also took a write-down of around $10 billion on the value of its aircraft parts manufacturing business. Marriott International Inc. MAR, -0.96% shares gained 3.6% despite the hotel operator reporting a wider-than-expected second-quarter loss and revenues that came in below Wall Street estimates. Shares of Royal Caribbean Cruises Ltd. RCL, +2.59% climbed 10% Monday even after the cruise operator announced a bigger-than-expected second-quarter loss. But revenue fell less than forecast as cruises were suspended due to the pandemic. Eastman Kodak Co. KODK, +12.98% Shares of plummeted 27.9% after reports the U.S. International Development Finance Corp. is withholding its planned $765 million loan after the deal came under regulatory scrutiny. How did other markets trade? The 10-year Treasury note yield TMUBMUSD10Y, 0.777% rose 1.1 basis point to 0.573%. Bond prices move inversely to yields. The greenback was up 0.2%, with the ICE U.S. Dollar Index DXY, -0.58%, a gauge of the buck against a half-dozen currencies, at 93.60 Monday. In Europe, the Stoxx Europe 600 index SXXP, +0.55% finished 0.3% higher, after advancing 2% last week, and the FTSE 100 UKX, +0.64% also added 0.3%, following its 2.3% weekly advance. In Asia, China’s CSI 300 index 000300, +2.04% ended trade up 0.4%, while Hong Kong’s Hang Seng Index HSI, -0.30% closed 0.6% lower. U.S. benchmark oil CL.1, -1.62% tacked on 72 cents, or 1.8%, to end at $41.94 a barrel on the New York Mercantile Exchange. Gold futures for December GCZ20, +2.17% settled $11.70 higher, or 0.6%, to end at $2,039.70 an ounce. William Watts contributed reporting"}]}