{"article": [{"url": "https://www.marketwatch.com/story/dont-fear-a-trump-loss-a-biden-win-could-be-positive-for-stocks-jpmorgan-says-heres-what-will-outperform-2020-07-06", "published": 1594118600.0, "headline": "Trump claims only he can keep your portfolio afloat, but JPMorgan says a Biden win could be positive for these stocks", "body": "President Donald Trump said Monday that if Americans wanted their 401(k) and stocks to “disintegrate and disappear” they should vote for Joe Biden. Recent national polls show presumptive Democratic presidential nominee Joe Biden pulling ahead of President Donald Trump, a Republican. Analysts and investors have viewed some of Biden’s policies as being potential negatives for stocks, while Trump argued last week that “the stock market will drop down to nothing” if he is not re-elected Nov. 3. However, JPMorgan strategists say that, contrary to that view, a Biden win in November would be “neutral to slight positive” for equities. The Democrat’s major economic policies include lifting the corporate tax rate from 21% to 28% — partially reversing the Republican corporate tax cut of 2017 — and increasing the federal minimum wage. The investment bank’s U.S. equity strategy team also says it expects the former vice president to ease tariffs on China and increase infrastructure spending. Read: How to position your portfolio for a Joe Biden presidency Many presidential challengers tend to campaign at an extreme, particularly during their parties’ primaries, later converging toward the political center. Biden positioned himself as one of the two or three most moderate candidates in what was an uncommonly large Democratic field. JPMorgan’s strategists note that Biden’s policy priorities were initially set out pre–COVID-19 and would surely shift. “Given the current economic weakness, business recovery and job growth are likely to be prioritized over policies that could dampen economic growth and perhaps even jeopardize the desired 2022 midterm election outcome,” the investment bank’s U.S. equity strategy team said in a note. The higher corporate tax rate would bring an earnings headwind of around $9 for S&P 500 SPX, +0.87% earnings per share, the strategists, led by Dubravko Lakos-Bujas, warned. However, they said the corporate tax hike could end up with the rate being lower than 28% and would also be offset by the softening of tariffs, infrastructure spending and higher wages. “Further, a more diplomatic approach to domestic/foreign policy will likely result in lower equity volatility and risk premia,” they added. The team’s Democratic agenda outperformers — though it stressed the agenda remains fluid — include Tesla TSLA, +1.89% and Nikola NKLA, -1.36%, both benefiting from spending on alternative energy and green technologies. Biden’s health-care agenda puts Johnson & Johnson JNJ, +1.39%, CVS CVS, -1.76% and others in the outperforming basket, while tariff de-escalation sees Procter & Gamble PG, +0.89%, Nike NKE, +0.97%, Boeing BA, -0.39%, 3M MMM, +0.94% and DuPont DD, +0.06% feature. A minimum-wage hike would have a positive impact on consumer spending and would be a net positive for S&P 500 companies despite higher costs and some employment losses, according to JPMorgan. “Distinguishing winners and losers will depend on businesses who will see incremental demand due to rising disposable income, lower labor intensity (revenue/employees) and higher margins.” As a result, Apple AAPL, +1.74%, Facebook FB, +0.26%, Google parent Alphabet GOOG, +1.97% GOOGL, +1.82%, Twitter TWTR, -0.23% and Visa VISA, +0.90% all appear on the list of outperformers. The Dow Jones Industrial Average DJIA, +0.56% has fallen 8% year-to-date but has climbed 44% since lows in March. The S&P 500 has risen 42% from the depths of March and the Nasdaq Composite COMP, +1.39% reached all-time highs on Monday."}]}