{"article": [{"url": "https://www.marketwatch.com/story/heres-whats-next-in-the-battle-over-trumps-tax-returns-after-the-supreme-courts-decisions-2020-07-09", "published": 1594301120.0, "headline": "Here's what's next in the battle over Trump's tax returns after the Supreme Court's decisions", "body": "Now that the Supreme Court has ruled that New York prosecutors may see President Donald Trump's financial and tax records, will they soon be released to the public as well? It's unlikely. The decisions in both the New York case and a separate case involving House Democrats' demands mean that the issue will again be in lower courts' hands, with the November election on the horizon. At least one court watcher says that the New York case could be decided before then, but there doesn't appear to be consensus on a speedy decision. iframe.twitter-tweet { width: 100% !important; } Read: Supreme Court rules Trump tax, financial records can be turned over to New York prosecutor, but rejects House Democrats' bid The ruling in the case involving Manhattan District Attorney Cyrus Vance was a blow to Trump, who has long sought to keep his financial and tax records private. But since the records are being demanded as part of a confidential grand-jury investigation, they'll stay under wraps unless exceptions are made. \"In most jurisdictions, including New York, information collected for use in grand jury must by law be kept secret from the public and the press,\" wrote Richard Lempert, an emeritus law professor at the University of Michigan. Lempert noted, however, that there are ways in which grand-jury information may be legally revealed, such as if a judge believes it is in the public interest. In sending the congressional case back to lower courts, Chief Justice John Roberts wrote that they had not taken \"adequate account of the significant separation of powers concerns implicated by congressional subpoenas for the President's information.\" Trump's lawyer, Jay Sekulow, said in a tweet that he would raise \"additional Constitutional and legal issues in the lower courts\": iframe.twitter-tweet { width: 100% !important; } Vance in his own statement put no time frame on the New York investigation, saying only that it would resume. \"This is a tremendous victory for our nation's system of justice and its founding principle that no one - not even a president - is above the law. Our investigation, which was delayed for almost a year by this lawsuit, will resume, guided as always by the grand jury's solemn obligation to follow the law and the facts, wherever they may lead,\" he said. House Speaker Nancy Pelosi said Democrats \"will continue to press our case in the lower courts.\" Also see:Chief Justice Roberts recently fell and hit his head, spent a night in a hospital"}]}