{"article": [{"url": "https://www.marketwatch.com/story/walking-into-a-gym-salon-or-a-campaign-rally-read-this-before-you-sign-any-coronavirus-liability-waivers-2020-06-18", "published": 1592560160.0, "headline": "Going to the gym, salon or a political rally? Be warned: You may be asked to sign a coronavirus liability waiver", "body": "Where’s my mask and hand sanitizer? Can I get curbside assistance? These are some of the questions people face before performing even basic tasks and activities in the new version of normalcy during a global pandemic. Increasingly, they also have to ask themselves, ‘Should I sign this liability waiver?’ As more states ease social distancing rules in reopening, these liability releases are popping up in some salons, restaurants, gyms and other establishments trying to guard themselves against a lawsuit blaming them for a coronavirus infection. The releases are also being used at political rallies. Above the link to register for tickets to President Donald Trump’s Tulsa, Okla. campaign event on Saturday, potential attendees find language saying they are taking on “all risks related to exposure to COVID-19” and won’t hold the campaign legally responsible for any illness or injury. It’s always been a serious step to potentially sign away a right to sue. Waivers have been around for years, covering everything from a gym membership to a child’s trampoline party. But the decision has more weight than ever, as people decide how much risk they want to take on during the outbreak. Generally, liability waivers “are part of our lives and part of mainstream,” said Chas Rampenthal, attorney assist segment leader at LegalZoom. But these COVID-19 liability waivers are “unique in that we are not really sure it can be enforceable.” Republican federal lawmakers have been pushing to give businesses liability protection from lawsuits over coronavirus exposure and the issue could become a part of another relief bill. But rather than wait for court decisions or legislation on coronavirus waivers, here’s what to consider the next time one is handed to you. What should I look out for with these waivers? There’s no set formula on the wording for a COVID-19 liability waiver, experts say — but it should be specific and in clear language, they add. A waiver might touch on three points, said Rampenthal, who signed one when recently attending an open house. One point may specify the customer is forgoing a chance to sue the business for a future coronavirus infection. Another point will make it clear they are assuming risk and a third point may ask the customer to affirm they’re in good health. Don’t miss:Asymptomatic coronavirus transmission appears worse than SARS or influenza — a runner can leave a ‘slipstream’ of 30 feet “The hallmarks of a great [waiver] are you actually understand the words,” said Rampenthal. LegalZoom offers templates on some documents, but not for a COVID-19 waiver, he noted. A waiver should also be specific about the government health standards the company is trying to follow, said Gary Martin Hays, an Atlanta-based lawyer representing plaintiffs in personal injury cases. That way, a consumer can know the standards a business is held to, he said. The waiver also shouldn’t stop a health insurer from paying for medical coverage if someone contracts COVID-19, Hays added. A waiver isn’t a free pass for a business A signed waiver doesn’t shield businesses from intentionally wrong or reckless conduct, or gross negligence, said Hays. In fact, a business still has a responsibility to take “reasonable steps” to protect customers and employees, said Elizabeth Milito, senior executive counsel at the National Federation of Independent Business. The trade association for small businesses isn’t suggesting all businesses use a waiver and it isn’t offering boiler-plate language, she said. It’s a case-by-case decision for every business, said Milito, noting that salon owners and a marina owner have recently asked her about the waiver. It’s also a state-by-state issue, because some state courts say a liability waiver signed before an injury is null and void from the start. Louisiana, Virginia and Montana are three such states, according to Rampenthal. The most important judge is the customer making the gut check, he said. Apart from any legal consequences, Rampenthal said people still have to ask themselves, “Do I want this service enough, now that I understand the risk is? Is it still worth it to me to sign this waiver?”"}]}