{"article": [{"url": "https://www.marketwatch.com/story/zoom-videos-stock-sinks-below-50-day-moving-average-after-salesforce-unloads-stake-2020-08-11", "published": 1597217600.0, "headline": "Zoom Videoâ\u0080\u0099s stock sinks below 50-day moving average after Salesforce unloads stake", "body": "Shares of Zoom Video Communications Inc. sank for a fourth-straight day Tuesday, falling below some key chart levels in the process, after Salesforce.com Inc. disclosed that it recently sold off its entire stake in the video-conferencing company. Zoomâ\u0080\u0099s stock ZM, +2.89% Â dropped 7.6% to close at $231.04, and has tumbled 15.3% since it last gained ground five sessions ago. The stock, which was once the darling of the work-from-home trend resulting from the COVID-19 pandemic, has now shed 16.4% since closing at a record $275.87 on July 10. It has still more than tripled (up 239.6%) this year, however. Many chart watchers define a decline of at least 10% to up to 20% from a significant peak as a correction of the previous uptrend. If the stock falls at least 20% or more from its record, by closing below $220.70, it would enter a new bear market. The selloff came as the broader market pulled back, with investors rotating out of COVID-19-related growth stocks into more economically sensitive ones amid increasing hopes that the worst of the pandemic may have already passed. The Dow Jones Industrial Average DJIA, +0.56% Â fell about 105 points, or 0.4%, while the S&P 500 index SPX, +0.87% Â shed 0.8% and the Nasdaq Composite Index COMP, +1.39% Â dropped 1.7%. Read Market Snapshot. Late Monday, Salesforce disclosed that as of June 30, it no longer owned any Zoom Video shares. That means at some time during the second quarter, Salesforce sold the 2.78 million shares, or about 1% of the shares outstanding, it had owned since the second quarter of 2019. Zoom Video went public on April 18, 2019, at an initial public offering price of $36. Salesforce didnâ\u0080\u0099t disclose the prices it sold its Zoom Video shares. But based on the difference between the IPO price and the volume-weighted average closing price of the shares during the second quarter, Salesforce could have made $398.3 million on its investment. Zoom Videoâ\u0080\u0099s stock is headed for the first close below the widely followed 50-day moving average since Jan. 3. FactSet, MarketWatch Since many technical analysts view the 50-day moving average, which extended to $248.04 on Tuesday according to FactSet, as a guide to the short-term trend, they would see the break below the line as a warning that the previous short-term uptrend has ended. But perhaps more damaging to the stockâ\u0080\u0099s technical outlook is that it has fallen below the lows in between the July 10 record close of $275.87 and the recovery peak of $272.90 on Aug. 5. That breakdown confirms a short-term bearish â\u0080\u009cdouble-topâ\u0080\u009d reversal pattern, suggesting a new short-term downtrend has begun. FactSet, MarketWatch One way chart watchers calculate potential downside levels to watch is by determining retracement targets of the previous longer-term uptrend using the Fibonacci ratio of 0.618. That ratio, which was made famous by a 13th-century Italian mathematician known as Leonardo â\u0080\u009cFibonacciâ\u0080\u009d of Pisa, is often referred to as the golden, or divine ratio, because it has been found to be prevalent throughout nature. Read more about the Fibonacci ratio, and its technical uses. FactSet, MarketWatch The first retracement target of 38.2% (1 minus 0.618), of the rally off the Oct. 22, 2019 record closing low of $62.00 to the July 10 record high of $275.87, comes in at $194.17. The next Fibonacci retracement is 50%, which comes in at $168.94, and the key retracement of 61.8% comes in at $143.70. Just below the 61.8% Fibo is the 200-day moving average, which many view as a dividing line between long-term uptrends and downtrends. That line extended to about $140.43 on Tuesday. Meanwhile, the first level of resistance is the 50-day moving average, which comes in at $248.50 on Wednesday. A potential coming catalyst for Zoom Videoâ\u0080\u0099s stock, in either direction is the companyâ\u0080\u0099s second-quarter earnings report, which is scheduled to be release on Aug. 31, after the closing bell. The company has beaten both profit and sales expectations every quarter since it went public."}]}