{"article": [{"url": "https://www.marketwatch.com/story/no-income-no-student-loan-payment-gop-proposal-draws-skepticism-11595959043", "published": 1595945120.0, "headline": "No income, no student loan payment? GOP proposal draws skepticism", "body": "A view of Harvard Yard on the campus of Harvard University on July 08, 2020 in Cambridge, Massachusetts. Senate Republicans included a permanent change aimed at easing the burden of student loan repayments in their initial stab at another big coronavirus aid bill currently being negotiated in Congress. But student-borrower advocates gave the idea a thumbs down. Pushed by Sen. Lamar Alexander, the Tennessee Republican who heads the Health, Education, Labor, and Pensions Committee, the proposal would consolidate the current nine different student loan repayment programs down to only two. “In March, Congress agreed that 43 million Americans who have student loans would not have to pay a monthly payment until October 1,” Alexander said. “October 1 is just around the corner, so what we propose is if you have no income, you have no monthly payments. If you do have income, then we change the student loan payment system, so that you never have to pay more than 10% of your income after you’ve deducted the necessities of life, like mortgage and food.” The 10% would only apply to income above 150% of the federal poverty level, now $19,140 annually for an individual. Borrowers making less than that would have no monthly payments. In addition to the income-based plan, Alexander’s proposal would allow a standard, mortgage-style 10-year repayment plan as well. Overhauling the student loan system has long been a priority for lawmakers, particularly as they have looked at rewriting the Higher Education Act that underpins most federal law about colleges and universities. But consensus has been hard to reach between Democrats and Republicans and the proposal by Alexander, who is retiring from Congress, is notable in that it, unlike other parts of Senate Republicans’ package of bills, it would be a permanent change and not a temporary change tied to virus epidemic. Student-borrower advocates, though, remained unimpressed. For one, it wouldn’t extend the March CARES Act pause on student-loan payments, collections and interest accrual. Advocates have worried for months that student-loan borrowers aren’t ready to resume payments on their debt given the economic devastation wrought by the pandemic that is still ongoing. That payments and collections will resume will have particularly devastating consequences for borrowers who have defaulted on their student loans, a demographic Alexander’s proposal leaves out, said Persis Yu, the director of the Student Loan Borrower Assistance Project at the National Consumer Law Center. “Borrowers are going to start getting collection calls from debt collectors on October 1,” Yu said. In addition, under the proposal, the Department of Education can presumably resume using its extraordinary collection powers to recover defaulted student loans, including through wage garnishment and offsetting of Social Security benefits and tax refunds, Yu said. “Which is nuts, there’s still a pandemic raging around,” she said. Many of these borrowers experienced a delay in receiving the benefits of the CARES Act, with the Department still garnishing wages and tax refunds even weeks into the collections pause period. For borrowers who are current on their loans, Alexander’s proposal offers less flexibility than what’s already available, Yu said. The current system includes a suite of repayment plans with several that allow borrowers to pay back their loans as a percentage of their income with the option of forgiveness after a certain number of years of repayment. The complexity of the system has been a source of concern for borrower advocates for years and addressing it has been a goal of Alexander’s for some time, but his proposal eliminates some of the choices borrowers have in the current system, Yu said. For example, right now married student-loan borrowers who file their taxes separately from their spouse can opt for a repayment plan that evaluates only their own income instead of including their spouses as well. Under Alexander’s proposal that option is eliminated. Under the current system, some borrowers with debt from graduate school can use a repayment plan that allows their debt to be canceled after 20 years of payments tied to income. Under Alexander’s plan, borrowers with graduate school debt need to make payments for 25 years to receive forgiveness. Current student loan borrowers who like their repayment plan can keep it under Alexander’s proposal, but borrowers who enter repayment after October 1 would have to choose from the new options. Current student loan borrowers who are working towards Public Service Loan Forgiveness — a program that allows public servants to have their federal student debt forgiven after 120 payments — would face a penalty under Alexander’s proposal if they switch repayment plans. “It’s a worse version of what we already have,” Yu said of Alexander’s proposal. There also may be challenges in implementing Alexander’s plan. Borrower advocates have complained for years that student-loan companies don’t do enough to make sure borrowers end up in the most affordable repayment plan to which they’re entitled. They were already concerned that student-loan companies would be slammed with calls to switch repayment plans once the CARES Act payment pause ended. Under typical circumstances, switching repayment plans can take several weeks for borrowers. “There is no way you can create a new repayment plan in two months,” Yu said."}]}