{"article": [{"url": "https://www.marketwatch.com/story/undetected-community-transmission-in-ny-drove-nursing-home-deaths-report-says-2020-07-06", "published": 1594064540.0, "headline": "Undetected community transmission in N.Y. drove nursing home deaths, report says", "body": "Asymptomatic staff, and possibly visitors in February and early March, unknowingly brought COVID-19 into New York nursing homes, leading to deaths among elderly residents, according to a report by the state’s health department released Monday. The report is a direct response to criticism of a state policy Gov. Andrew Cuomo enacted in late March that said nursing homes could not refuse to admit a resident because of confirmed or suspected COVID-19 infection. Critics argued that policy enabled infected patients to return to care facilities from hospitals and spread the disease among vulnerable residents. The report, based on data submitted from the state’s nursing homes, refutes that assumption, saying community transmission made its way into care facilities weeks before the admission policy went into effect on March 25 and was the primary driver of nursing home deaths. Read: Crowding and the coronavirus: Why different parts of NYC have been hit harder The data in the report paint a timeline in which the admission policy could not have been the driving force behind nursing home fatalities, said Dr. Howard Zucker, New York’s health commissioner at a briefing on Monday. The greatest number of nursing home staff reported symptoms of COVID-19 in mid-March, before the admission policy went into effect, followed by peak nursing home deaths several weeks later in early April. By contrast, the greatest number of readmissions to nursing homes from hospitals didn’t occur until mid-April, about a week after nursing home deaths peaked, according to the report. Of the facilities that readmitted residents from the hospital, 81% already had a COVID-19 diagnosis at the nursing home, Zucker added. “If you want to place the blame,” Zucker said, “blame COVID.” New York state health commissioner Howard Zucker, who released the report on nursing homes Monday, at a June news conference. Don Pollard New York updated its nursing home admission policy in mid-May to say hospital patients had to test negative before returning to a nursing home. The change came after growing criticism from state lawmakers, some care facilities and the Society for Post-Acute and Long-Term Care Medicine, a professional trade group of long-term care providers. In response to the report, state Sen. Rob Ortt, a Republican whose district covers Niagara and Orleans counties, said in a statement that independent state and federal investigations into the policy are still needed. New York state has reported more than 6,400 nursing home deaths, the most of any state in the U.S., though they make up about 25% of the near-25,000 deaths recorded as of Monday. By contrast, nursing home deaths account for 43% of all deaths in the U.S. Michael Dowling, CEO of Northwell Health, which along with experts at Mount Sinai peer-reviewed the report, said it confirmed what the hospital network also witnessed. “When the virus hit our local communities, it quickly spread through asymptomatic carriers into our nursing homes, hospitals, places of worship and other congregate settings,” Dowling said at the Monday briefing. Cuomo, speaking at a separate briefing on Monday, said New York had gone from the worst outbreak in the country to having it the most under control because of its data-first approach. Of the 54,000 people tested for the disease on Sunday, less than 1% were positive, according to the state. Nine people died on Sunday, down from a daily peak of nearly 800 in early April. There were a little more than 800 hospitalized with the virus on Sunday, the lowest that number’s been since mid-March, Cuomo said. New York’s stable infection rate now contrasts sharply with the U.S., where daily cases climbed past 50,000 over the weekend. New York City, once the worst-hit area in the world, entered Phase 3 of reopening on Monday, but with indoor dining still closed. Two more regions of New York state will enter the fourth and final phase of reopening this week, the mid-Hudson Valley on Tuesday and Long Island on Wednesday, Cuomo said. Phase 4 allows professional sports to resume without fans, college and university campuses to reopen with new health protocols, and low-risk arts and entertainment at reduced capacity. Also read: Why some nursing homes did better in protecting residents from coronavirus Despite the state’s progress, Cuomo announced Monday that the New York State Fair, held annually each summer in Syracuse, would be canceled this year. The event is a boon to the Central New York economy and attracted over one million fairgoers last year. “That makes me personally very unhappy,” Cuomo said. “But that is where we are.”"}]}