{"article": [{"url": "https://www.marketwatch.com/story/bp-slashes-dividend-in-half-after-16-8-billion-loss-11596521840", "published": 1596519140.0, "headline": "BP sets new low-carbon goals as it slashes dividend in half and reports $16.8 billion loss", "body": "A BP petrol and diesel filling station southeast of London on June 15, 2020, following the announcement that the oil giant will take a hit of up to $17.5 billion (€11.4 billion and €15.3 billion), due to the continuing COVID-19 pandemic. ben stansall/Agence France-Presse/Getty Images Oil giant BP on Tuesday cut its dividend in half after reporting a $16.8 billion loss for the second quarter, as it outlined its effort to become less environmentally harmful. BP BP, +0.56% BP, -0.74% said it lost $16.8 billion after taking a charge of $10.9 billion, mostly for writing down the value of various projects after the steep fall in oil prices. Analysts polled by FactSet expected an $11.6 billion loss. BP had earned $1.8 billion in the year-earlier quarter. Its underlying replacement cost loss was $6.7 billion, compared with profit of $2.8 billion in the year-ago quarter. BP set a new distribution policy after cutting its dividend to 5.25 cents per share. BP said it would keep the dividend at that level, and then return at least 60% of surplus cash to shareholders through share buybacks, once its balance sheet has been deleveraged and subject to maintaining a strong investment grade credit rating. BP also announced a new green strategy, saying it won’t explore in any new countries, as it said there will be a 10-fold increase in low carbon investment by 2030. It said oil and gas production is expected to reduce by at least one million barrels of oil equivalent a day, or 40%, from 2019 levels, which BP said it would accomplish via “active portfolio management.” “On paper the promise is more aggressive than being seen at other European [integrated oil companies], although at the same time key peers have targets that look a little more tangible around the near-term (to 2025),” said Alastair Syme, an analyst at Citi. “With energy now occupying an almost pariah status in the mind-set of many investors, BP’s attempts to shift should at least attract some interest and analysis.” BP shares rose nearly 7% in London trade. The stock has dropped 40% this year, compared with the 20% drop for the broader FTSE 100 UKX, +0.64%."}]}