{"article": [{"url": "https://www.marketwatch.com/story/union-representing-nyc-public-school-principals-urges-mayor-to-push-back-start-of-in-person-teaching-2020-08-12", "published": 1597257380.0, "headline": "Union representing NYC public school principals urges mayor to push back start of in-person teaching", "body": "New York City’s public schools will not be ready to reopen for in-person learning by the first day of school on Sept. 10, a union representing principals and administrators told Mayor Bill de Blasio in a letter on Wednesday. The letter, sent from Mark F. Cannizzaro, president of the Council of School Supervisors and Administrators, urged the mayor and schools Chancellor Richard Carranza to begin the school year fully remote and delay in-person instruction until the end of September to allow for more time to train teachers on new safety measures, hire more school nurses and procure enough personal protection equipment (PPE). “The slow rollout of guidance has forced us to once again address an unfortunate truth: Schools will not be ready to open for in-person instruction,” Cannizzaro said in his letter. He said that despite messaging from the mayor that reopening school was a collaborative effort, City Hall and the city’s Department of Education have failed to address many of their concerns and “ignored repeated appeals from school leaders to allow enough time to implement highly complicated protocols.” Coronavirus update: Global cases top 20.3 million, U.S. tally tops 5.15 million as Florida and Georgia see record one-day deaths While the city and state have mandated certain safety measures, it will be up to principals to implement them on a practical level in their individual schools. And yet, many still do not know when they’ll receive necessary equipment, including thermometers, signage, hand sanitizer and other cleaning materials. They don’t know the status of ventilation system updates, when nurses will be hired and if there will even be enough teachers to accommodate the proposed hybrid model, in which students learn a few days a week in class and the other days remotely, Cannizzaro said. He emphasized that the union fully supports bringing children back to the classroom this fall. “School leaders speak with these families every day and will continue to stand with those parents asking for schools to return to in-person learning as soon as possible,” he said, but the plan allows “frighteningly little time for the preparation and training necessary for these unprecedented times.” The letter stopped short of saying principals or their staff would refuse to return unless certain concerns were met. Also see: Inside the struggle to close the education equality gap exacerbated by COVID-19 The mayor did not publicly comment on the letter at his Wednesday briefing, though he dismissed concerns that schools wouldn’t have enough teachers willing to return in September when asked by a reporter. The city expects about 85% of its 66,000 educators to return to the classroom this year. “I can say in New York City, we have teachers coming back and we’re going to have the resources to serve our kids,” de Blasio said. He also expressed confidence on Monday that four weeks was enough time to prepare the city’s roughly 1,700 schools, and that nothing would open that wasn’t safe. “There may be some classrooms or some specific parts within a building that still needs some work, but overall, I think we’re going to be ready,” he said. The city is preparing for about 700,000 public school students, or about three-fourths of the student body, to attend in-person classes in September. Parents of more than a quarter of a million students have enrolled in remote-only instruction. Growing concern that New York City is rushing into reopening schools comes amid similar criticism in New Jersey, which on Wednesday backed off plans for all districts to offer some form of in-person learning in the fall. In a reversal, Gov. Phil Murphy said that districts would be allowed to go all-remote in September if they chose, so long as they provide a plan and target date for returning to classrooms. Be sure to read: Vaping makes teens up to 7 times more likely to catch COVID-19: study Michael Mulgrew, president of a separate union representing New York City educators, the United Federation of Teachers, threw support behind Cannizzaro’s letter. “We need both safety and sanity in this crisis,” Mulgrew said in comments on Wednesday. “Will any parents be willing to put their children in a school whose principal believes the building is not ready to open because it is not safe?”"}]}