{"article": [{"url": "https://www.marketwatch.com/story/herman-cain-hospitalized-for-coronavirus-after-attending-trump-rally-2020-07-02", "published": 1593712040.0, "headline": "Herman Cain hospitalized for coronavirus after attending Trump rally", "body": "WASHINGTON — 2012 GOP presidential candidate Herman Cain is being treated for the coronavirus at an Atlanta-area hospital, according to a statement posted on his Twitter account Thursday. It’s not clear when or where Cain was infected, but he was hospitalized less than two weeks after attending President Donald Trump’s campaign rally in Tulsa, Oklahoma. He did not meet with Trump there, according to the campaign. Cain, 74, was hospitalized after developing “serious” symptoms but is “awake and alert,” according to the statement. The former pizza company executive has been an outspoken backer of the president and was named by the campaign as a co-chair of Black Voices for Trump. “I realize people will speculate about the Tulsa rally, but Herman did a lot of traveling the past week, including to Arizona where cases are spiking,” Dan Calabrese, who has been editor of HermanCain.com, wrote on the website. “I don’t think there’s any way to trace this to the one specific contact that caused him to be infected. We’ll never know.” Cain took part in a Trump campaign livestream before the rally with campaign senior adviser Katrina Pierson and Texas state Rep. James White. Asked whether Cain met at the rally with other senior campaign or administration officials, Trump campaign spokesperson Tim Murtaugh responded that “contact tracing was conducted after the Tulsa rally but we do not comment regarding the medical information of individuals.” “Regardless, Mr. Cain did not meet with the President,” Murtaugh added. At least six campaign staffers and two members of the Secret Service working in advance of the Tulsa rally tested positive for COVID-19. An Oklahoma-based journalist has also confirmed testing positive soon after attending the rally. Trump faced criticism for holding the big-arena event despite warnings from public health experts that it is not yet safe to hold mass gatherings. More than 6,000 people attended the rally at the BOK Center, an arena that can seat more than 19,000. Cain’s official Twitter account on Wednesday included a posting of an article about South Dakota Gov. Kristi Noem declining to impose mask-wearing or social distancing rules at Friday’s fireworks display at Mount Rushmore, an Independence Day weekend event that Trump is scheduled to attend. The Twitter posting included the addendum, “Masks will not be mandatory for the event, which will be attended by President Trump. PEOPLE ARE FED UP!” For most people, the coronavirus causes mild or moderate symptoms, such as fever and cough, that clear up in two to three weeks. For some, especially older adults and people with existing health problems, it can cause more severe illness, including pneumonia, and death. Cain briefly rose to the top of polls during the 2012 race for the Republican presidential nomination by highlighting a plan to simplify the tax code with what he called the 9-9-9 plan. More recently, he has kept involved in conservative politics as a commentator on Newsmax."}]}