{"article": [{"url": "https://www.marketwatch.com/story/rio-tinto-blew-up-ancient-caves-heres-why-its-chief-executive-is-being-docked-millions-11598272427", "published": 1598268980.0, "headline": "Rio Tinto blew up two 46,000-year-old caves in Australia, and now its CEO is being docked millions", "body": "Rio Tinto Chief Executive Jean-Sébastien Jacques attends an annual general meeting in Perth, Australia, May 9, 2019. Jacques will lose around $3.5 million in bonuses due to the destruction in May of Australian indigenous sacred sites, the mining company said on August 24, 2020. Will Russell/Associated Press Rio Tinto on May 24 did what mining companies do — blast land to make it easier to access minerals. In doing so, however, Rio Tinto destroyed two 46,000-year-old caves in Western Australia, despite being warned that the area was “one of the most archaeologically significant sites in Australia,” and having its own heritage team request a delay. A report released by the company on Monday said it had legal authority for the project but conceded it was wrong to proceed as it did. The company apologized to the local Puutu Kunti Kurrama and Pinikura people, known as PKKP, earmarked funds to recruit more indigenous executives, and slashed bonuses, including that of Chief Executive Jean-Sébastien Jacques, who loses £2.7 million ($3.5 million). The report said Rio Tinto RIO, +0.92% RIO, +1.28% RIO, -0.47% produced three options to reach the iron ore without blasting the caves — and never shared these options with the PKKP. Jacques has previously testified picking one of the three other options would have cost the company $135 million, as it would not have been able to access 8 million metric tons of iron ore. The outlook: The Australian government may tighten laws to protect Aboriginal cultural sites. More broadly, the episode typifies the way extraction companies are having to adopt to a more politically engaged public. BP BP, -0.74% is aiming to reduce oil and gas exploration by 40%, and BHP Group BHP, +0.66% bowed to shareholder pressure by saying it will exit its thermal coal activities."}]}