{"article": [{"url": "https://www.marketwatch.com/story/my-ex-husband-filed-a-joint-tax-return-without-my-knowledge-he-received-my-familys-stimulus-payment-what-can-i-do-2020-06-05", "published": 1592745500.0, "headline": "My estranged husband filed a joint tax return without my knowledge. He got my family's stimulus payment - what can I do?", "body": "Dear Moneyist, I have an estranged husband, and we have been living separately for years. He has been filing taxes jointly without my knowledge AND now he has received my stimulus money AND my kids' stimulus money. I can't hire an attorney because I'm poor, and I live in a rural area where there are no attorneys who will take my case without a fee. I've asked a legal center how to bring this issue of financial abuse to the divorce judge and, so far, I have received no answers. I have no idea how the Internal Revenue Service will react, given that we are still legally married. I do know the money was deposited into his account. We never had joint bank accounts. My ex-partner doesn't communicate with me. His phone has been off for weeks. He has used the pandemic to commit emotional and economic abuse. What can I do? Claudia Dear Claudia, You may have to wait longer for your money, but you will get it. What your husband did is fraud, it's against the law and, in addition to facing possible criminal charges, he may also face a hefty fine for filing these taxes in your name. He forged your name on this tax return. That's another crime. As for keeping the money your family is owed, that is the poisoned cherry on top. That's theft. This will all come back to haunt him, and he could end up going to jail. With so many people losing out on their income during the pandemic, I'm only sorry that money you need now will take longer to reach you. “ With so many people losing out on their income during the pandemic, I'm only sorry that money you need now will take longer to reach you. ” - The Moneyist You can verify your identity with the IRS here. The phone lines are open, but customer-service support is extremely limited at this time. \"Each state has at least one Local Taxpayer Advocate who is independent of the local IRS office and reports directly to the National Taxpayer Advocate,\" according to the agency. You can select your state here to find the phone number and address of the Taxpayer Advocate Service office nearest you. You can also write to the office in your state. Read more on how to report fraud here. Hundreds of people have written to me wondering why they have not received their stimulus payment. One husband actually refused to give the payment to his wife. That was a textbook case of financial abuse. \"Financial abuse happens when an abuser takes control of finances to prevent the other person from leaving and to maintain power in a relationship,\" according to the Office on Women's Health at the U.S. Department of Health and Human Services. \"An abuser may take control of all the money, withhold it, and conceal financial information from the victim.\" I'm sorry this has continued in tandem with your divorce. Legal aid is a good first step. Sooner or later, tax shenanigans will catch up with the person trying to work the system. It's now your husband's turn. You have one advantage: You know why your economic impact payment did not arrive. That may seem like a small consolation at this time, but now at least you can do something about it. Given how overwhelmed the agency is at the present time, it will take some time, but you should eventually be compensated, and your former husband will learn of the severity of his crimes. Also see: I received my ex-husband's $1,200 stimulus check because we filed joint taxes in 2018. Should I give him the money or return it to the IRS You can email The Moneyist with any financial and ethical questions related to coronavirus at qfottrell@marketwatch. Want to read more?Follow Quentin Fottrell on Twitterand read more of his columns here Would you like to sign up to an email alert when a new Moneyist column has been published? If so, click on this link. Hello there, MarketWatchers. Check out the Moneyist private Facebook FB, +0.26%  group where we look for answers to life's thorniest money issues. Readers write in to me with all sorts of dilemmas. Post your questions, tell me what you want to know more about, or weigh in on the latest Moneyist columns."}]}