{"article": [{"url": "https://www.marketwatch.com/story/microsoft-says-apples-threat-against-fortnite-maker-would-hurt-entire-videogame-industry-2020-08-23", "published": 1598215940.0, "headline": "Microsoft says Apple's threat against 'Fortnite' maker would hurt entire videogame industry", "body": "Apple Inc.'s threat to revoke Epic Games Inc.'s developer account would have far-reaching effects harmful to the videogame industry, Microsoft Corp. said in a court filing Sunday. The new filing by Epic comes amid a tense showdown with Apple AAPL, +1.74%  , which has removed Epic videogames, such as the mega-popular \"Fortnite,\" from its App Store over a violation of its payment rules. Epic argued that Apple's threat to also block its developer account would prevent other game developers from using its widely used Unreal Engine, which is used in the creation of 3-D graphics, harming \"numerous third-party developers.\" Kevin Gammill, Microsoft's MSFT, +2.48%  general manager for Gaming Developer Experiences, agreed in a statement of support, saying the ban by Apple would put developers who use the Unreal Engine \"at a substantial disadvantage,\" since \"there are very few other options available.\" Read: Will videogames be the Achilles heel for Apple, Google in antitrust investigations? \"If Unreal Engine cannot support games for iOS or macOS, Microsoft would be required to choose between abandoning its customers and potential customers on the iOS and macOS platforms or choosing a different game engine when preparing to develop new games,\" Gammill said. \"Apple's discontinuation of Epic's ability to develop and support Unreal Engine for iOS or macOS will harm game creators and gamers.\" Apple has said it will restore \"Fortnite\" and leave Epic's developer account alone if the company reverses course and follows the App Store's payment rules. In a filing Friday, Apple called the impact on Epic a \"self-inflicted\" wound, and accused it of deliberately breaching its contract after years of taking \"advantage of everything Apple's App Store has to offer.\""}]}