{"article": [{"url": "https://www.marketwatch.com/story/gold-slips-friday-and-heads-for-worst-weekly-slump-since-march-2020-09-25", "published": 1601043560.0, "headline": "Gold ends lower to suffer worst weekly slump since March", "body": "Gold futures ended with a loss on Friday, with bullion booking its fourth decline in five sessions, prompting the asset to suffer its worst weekly slide in about six months. “Most of the sell-off in the gold price is primarily down to the strength in the dollar index that we have seen this week,” said Naeem Aslam, chief market analyst, at AvaTrade, in a note. The recent resurgence of the buck has made dollar-backed gold relatively more expensive to overseas buyers using other monetary units. The dollar on Friday was climbing 0.3%, bringing its weekly rise to about 1.8% and on track for the sharpest such gain since April, as measured by the ICE U.S. Dollar Index DXY, -0.58%, FactSet data show. The Federal Reserve’s “monetary policy confusion has boosted the dollar index, and this increase in the dollar index has brought more weakness for the gold price,” said Aslam. “Investors aren’t fully satisfied with the notion that the Fed is going to keep the interest rate lower for three years, as some of the Fed’s committee members believe that the interest rate can go higher” before the Fed reaches its inflation target, he said. Against that backdrop, December gold GCZ20, +2.17% GC00, +2.17% fell $10.60, or 0.6%, to settle at $1,866.30 an ounce, sending the metal to its lowest finish in two months. It saw a 4.9% weekly drop—the steepest for a most-active contract since the period ended March 13, according to FactSet data. “There may well be another bull run heading towards the gold price,” Aslam. “There is little to no chance that the Fed will become hawkish in the short to medium term when it comes to their monetary policy. This should be positive for the gold price.” The coronavirus spread also has worsened in Europe, and if there’s a similar scenario in the U.S., that would “adversely impact the U.S. stock market” and may “increase the odds further of the gold price moving higher,” he said. Meanwhile, the everyday economic numbers that we see for the U.S. economy have started to show a lot more weakness, said Aslam. Gold prices had briefly pared losses to trade off the session’s lows in the wake of data Friday on August U.S. durable goods orders, which showed a rise of 0.4%. That was the fourth straight gain, but a more modest rise following three straight strong gains. Next, the chance for a second Congressional stimulus package, which the stock market has been craving, remains slim. This should also support the gold price. See: House Democrats prep new bill as gambit to get stimulus efforts unstuck Concerns about the 2020 presidential election in the U.S. between former Vice President Joe Biden and President Donald Trump also have climbed, potentially setting a floor for gold prices, wrote analysts at UBS, in a research note. Read:Trump says Supreme Court will need 9th justice to decide election outcome “Further gold price weakness is possible, but U.S. election uncertainties will likely intensify and the Fed will ultimately need to expand policy. Hence, we maintain our positive view on gold,” the UBS analysts wrote. Meanwhile, December silver SIZ20, +5.96% SI00, +5.96% settled 10 cents, or 0.4%, lower at $23.093 an ounce, pushing it to its lowest settlement since late July. Gold’s sister metal marked weekly decline of a 14.9%, its sharpest weekly drop since the week ended March 13. Among other metals traded on Comex, December copper HGZ20, +1.38% edged up by 0.1% to $2.971 a pound, with prices nearly 4.7% lower on the week. October platinum PLV20, +3.99% added 0.5% to $942 an ounce, losing over 10% for the week, while December palladium PAZ20, +2.31% fell 0.2% to $2,222.20 an ounce, for a weekly loss of around 6.7%."}]}