{"article": [{"url": "https://www.marketwatch.com/story/siberian-heat-wave-alarms-scientists-the-arctic-is-figuratively-and-literally-on-fire-2020-06-24", "published": 1592993720.0, "headline": "Siberian heat wave alarms scientists: â\u0080\u0098the Arctic is figuratively and literally on fireâ\u0080\u0099", "body": "MOSCOW (AP) â\u0080\u0094 The Arctic is feverish and on fire â\u0080\u0094 at least parts of it are. And thatâ\u0080\u0099s got scientists worried about what it means for the rest of the world. The thermometer hit a likely record of 38 degrees Celsius (100.4 degrees Fahrenheit) in the Russian Arctic town of Verkhoyansk on Saturday, a temperature that would be a fever for a person â\u0080\u0094 but this is Siberia, known for being frozen. The World Meteorological Organization said Tuesday that itâ\u0080\u0099s looking to verify the temperature reading, which would be unprecedented for the region north of the Arctic Circle. â\u0080\u009cThe Arctic is figuratively and literally on fire â\u0080\u0094 itâ\u0080\u0099s warming much faster than we thought it would in response to rising levels of carbon dioxide and other greenhouse gases in the atmosphere, and this warming is leading to a rapid meltdown and increase in wildfires,â\u0080\u009d University of Michigan environmental school dean Jonathan Overpeck, a climate scientist, said in an email. â\u0080\u009cThe record warming in Siberia is a warning sign of major proportions,â\u0080\u009d Overpeck wrote. Much of Siberia had high temperatures this year that were beyond unseasonably warm. From January through May, the average temperature in north-central Siberia has been about 8 degrees Celsius (14 degrees Fahrenheit) above average, according to the climate science non-profit Berkeley Earth. â\u0080\u009cThatâ\u0080\u0099s much, much warmer than itâ\u0080\u0099s ever been over that region in that period of time,â\u0080\u009d Berkeley Earth climate scientist Zeke Hausfather said. Siberia is in the Guinness Book of World Records for its extreme temperatures. Itâ\u0080\u0099s a place where the thermometer has swung 106 degrees Celsius (190 degrees Fahrenheit), from a low of minus 68 degrees Celsius (minus 90 Fahrenheit) to now 38 degrees Celsius (100.4 Fahrenheit). For residents of the Sakha Republic in the Russian Arctic, a heat wave is not necessarily a bad thing. Vasilisa Ivanova spent every day this week with her family swimming and sunbathing. â\u0080\u009cWe spend the entire day on the shore of the Lena River,â\u0080\u009d said Ivanova, who lives in the village of Zhigansk, 270 miles (430 kilometers) from where the heat record was set. â\u0080\u009cWeâ\u0080\u0099ve been coming every day since Monday.â\u0080\u009d But for scientists, â\u0080\u009calarm bells should be ringing,â\u0080\u009d Overpeck wrote. Such prolonged Siberian warmth hasnâ\u0080\u0099t been seen for thousands of years â\u0080\u009cand it is another sign that the Arctic amplifies global warming even more than we thought,â\u0080\u009d Overpeck said. Russiaâ\u0080\u0099s Arctic regions are among the fastest warming areas in the world. The temperature on Earth over the past few decades has been growing, on average, by 0.18 degrees Celsius (nearly one-third of a degree Fahrenheit) every 10 years. But in Russia it increases by 0.47 degrees Celsius (0.85 degrees Fahrenheit) â\u0080\u0094 and in the Russian Arctic, by 0.69 degrees Celsius (1.24 degrees Fahrenheit) every decade, said Andrei Kiselyov, the lead scientist at the Moscow-based Voeikov Main Geophysical Observatory. â\u0080\u009cIn that respect, weâ\u0080\u0099re ahead of the whole planet,â\u0080\u009d Kiselyov said. The increasing temperatures in Siberia have been linked to prolonged wildfires that grow more severe every year and the thawing of the permafrost â\u0080\u0094 a huge problem because buildings and pipelines are built on them. Thawing permafrost also releases more heat-trapping gas and dries out the soil, which increases wildfires, said Vladimir Romanovsky, who studies permafrost at the University of Alaska Fairbanks. â\u0080\u009cIn this case itâ\u0080\u0099s even more serious, because the previous winter was unusually warm,â\u0080\u009d Romanovsky said. The permafrost thaws, ice melts, the soil subsides and then it can trigger a feedback loop that worsens permafrost thawing and â\u0080\u009ccold winters canâ\u0080\u0099t stop it,â\u0080\u009d Romanovsky said. A catastrophic oil spill from a collapsed storage tank last month near the Arctic city of Norilsk was partly blamed on melting permafrost. In 2011, part of a residential building in Yakutsk, the biggest city in the Sakha Republic, collapsed due to thawing and subsidence of the ground. Last August, more than 4 million hectares of forests in Siberia were on fire, according to Greenpeace. This year the fires have already started raging much earlier than the usual start in July, said Vladimir Chuprov, director of the project department at Greenpeace Russia. Persistently warm weather, especially if coupled with wildfires, causes permafrost to thaw faster, which in turn exacerbates global warming by releasing large amounts of methane, a potent greenhouse gas thatâ\u0080\u0099s 28 times stronger than carbon dioxide, said Katey Walter Anthony, a University of Alaska Fairbanks expert on methane release from frozen Arctic soil. â\u0080\u009cMethane escaping from permafrost thaw sites enters the atmosphere and circulates around the globe,â\u0080\u009d she said. â\u0080\u009cMethane that originates in the Arctic does not stay in the Arctic. It has global ramifications.â\u0080\u009d And what happens in the Arctic can even warp the weather in the United States and Europe. In the summer, the unusual warming lessens the temperature and pressure difference between the Arctic and lower latitudes where more people live, said Judah Cohen, a winter weather expert at Atmospheric Environmental Research, a commercial firm outside Boston. That seems to weaken and sometimes even stall the jet stream, meaning weather systems such as those bringing extreme heat or rain can stay parked over places for days on end, Cohen said. According to meteorologists at the Russian weather agency Rosgidrome t, a combination of factors â\u0080\u0094 such as a high pressure system with a clear sky and the sun being very high, extremely long daylight hours and short warm nights â\u0080\u0094 have contributed to the Siberian temperature spike. â\u0080\u009cThe ground surface heats up intensively. .â\u0080¦ The nights are very warm, the air doesnâ\u0080\u0099t have time to cool and continues to heat up for several days,â\u0080\u009d said Marina Makarova, chief meteorologist at Rosgidromet. Makarova added that the temperature in Verkhoyansk remained unusually high from Friday through Monday. Scientists agree that the spike is indicative of a much bigger global warming trend. â\u0080\u009cThe key point is that the climate is changing and global temperatures are warming,â\u0080\u009d said Freja Vamborg, senior scientist at the Copernicus Climate Change Service in the U.K. â\u0080\u009cWe will be breaking more and more records as we go.â\u0080\u009d â\u0080\u009cWhat is clear is that the warming Arctic adds fuel to the warming of the whole planet,â\u0080\u009d said Waleed Abdalati, a former NASA chief scientist who is now at the University of Colorado."}]}