{"article": [{"url": "https://www.marketwatch.com/story/oil-prices-climb-head-for-roughly-10-weekly-gain-on-optimism-over-global-demand-2020-06-19", "published": 1592580080.0, "headline": "Oil tallies a nearly 10% weekly gain as OPEC+ tightens reins on output cuts, global demand outlook improves", "body": "Oil futures on Friday settled higher for the session, with U.S. prices up nearly 10% for the week as OPEC members and allies tightened the reins on output cuts and some signs of improvement in the global economy brightened the outlook for energy demand. The Joint Ministerial Monitoring Committee, or JMMC, which monitors compliance with OPEC output quotas, held a gathering Thursday via videoconference, saying Iraq and Kazakhstan have already submitted “compensations schedules,” to make up for falling short of their pledges to reduce output. Other “underperforming participants” will have until June 22 to submit their plans to compensate for production above their targeted levels. The OPEC+ decision “helped renew confidence that members will further cut production to comply with the 9.7 million [barrel per day] agreement,” said Paola Rodriguez Masiu, senior oil markets analyst at Rystad Energy. The cuts officially kicked in at the start of May and were extended to run through July. “The compliance level has already been higher than most of the market participants expected and it seems that a better level is achievable,” she said in emailed commentary. OPEC+ pegged compliance with the cuts at 87% in May. Complying with the full 9.7 million barrels per day in cuts “means shutting another million barrels of daily production,” said Masiu. “That’s not negligible and it is definitely a boost factor for prices.” West Texas Intermediate crude for July delivery CL.1, -1.62% US:CLN20, the U.S. benchmark, climbed 91 cents, or 2.3%, to settle at $39.75 a barrel on the New York Mercantile Exchange after tapping a high of $40.50. Front-month contract prices logged their highest finish since March 6, according to Dow Jones Market Data. For the week, they rose 9.6%. Global benchmark Brent oil for August delivery UK:BRNQ20 added 68 cents, or 1.6%, at $42.19 a barrel on ICE Futures Europe, for a weekly advance of 8.9%. Read:Why gasoline is set to lead a bumpy rebound in transportation fuels Commodity analysts also said that renewed talks about a recovery fund to help Europe’s troubled economies and easing Sino-American relations were helping to lift the outlook for crude demand. European Union leaders relaunched negotiations on Friday over a €750 billion ($840 billion) recovery fund to revive the eurozone but divisions remain. “The EU 750-billion-euro recovery fund will support the economic recovery in Europe and help the prospects for stronger crude demand later this summer,” wrote Edward Moya, senior market analyst at Oanda, in a daily research note. A report that China-U.S. trade tensions might be easing also helped to boost crude prices. Bloomberg News reported that China will increase buying of U.S. soybeans, corn and ethanol in line with a phase one trade deal struck at the start of this year. “Globalization is also important for crude demand and if the U.S. and China can continue a healthy trade relationship that should also be positive for oil prices,” Moya wrote. Still, there were concerns about a possible resurgence of COVID-19 cases and the effect that would have on global energy demand. “Demand conditions remain the real risk factor in the current market, highlighted most recently by a sharp fall in driving activity in Beijing as China works to curtail a wider outbreak of COVID-19 in the capital city,” said Robbie Fraser, senior commodity analyst at Schneider Electric, in a daily note. “That comes as a number of U.S. states are seeing their number of new cases peak, adding risks to an economy attempting to rebound.” Pandemic-related declines in energy demand pushed U.S. production down from record levels. The Energy Information Administration on Wednesday reported that domestic crude output fell by 600,000 barrels per day to 10.5 million barrels per day for the week ended June 12. On Friday, data from Baker Hughes BKR, -1.34% showed that the number of active U.S. rigs drilling for oil edged down by 10 to 189 this week. They’ve posted declines each week since mid-March. Back on Nymex, petroleum product futures moved up along with oil, with July gasoline US:RBN20 added 1.1% to $1.2716 a gallon, settling up 13% for the week. July heating oil US:HON20 tacked on 1.1% to $1.2114 a gallon, for a weekly rise of 10%. July natural gas US:NGN20 rose 1.9% to $1.669 per million British thermal units, but suffered a weekly loss of 3.6%."}]}