{"article": [{"url": "https://www.marketwatch.com/story/delta-american-join-united-in-dropping-most-change-fees-for-us-travelers-2020-08-31", "published": 1598892320.0, "headline": "Delta, American join United in dropping most change fees for U.S. travelers", "body": "This could be the final boarding call for the $200 ticket-change fee that has enraged so many U.S. airline travelers over the past decade. Delta Air Lines DAL, +0.39% and American Airlines AAL, +0.34% said Monday that they are dropping the fee on most tickets for domestic flights, copying United Airlines’ move one day earlier. Southwest Airlines LUV, +1.89% didn’t levy change fees to start with, so Monday’s announcements mean that the four biggest U.S. carriers will have roughly similar policies. Airlines are being battered by the coronavirus pandemic, as travel restrictions and fear of contracting the virus are keeping travelers at home. Normally in summer, 2 million or more people pass through security checkpoints at U.S. airports each day, but that number hasn’t been above 900,000 since mid-March, the early days of the pandemic. To woo passengers, airlines have required face masks and stepped up cleaning of planes. A few, including Delta, Southwest and JetBlue JBLU, -0.07% , limit seating, although American and United UAL, +0.32% try to sell every seat. Delta and American said they have permanently eliminated change fees for all domestic flights for premium and most economy fares except the lowest fare, called basic economy. American said it will let all passengers fly standby for earlier same-day flights without charge beginning Oct. 1. United is making that change on Jan. 1. Both carriers also extended temporary waivers on change fees for domestic and international flights, so ditching the fees permanently won’t make much difference to passengers right away. But by doing so, United, Delta and American are abandoning a fee that has drawn particular scorn from customers, consumer advocates and members of Congress. Airline shares fell on Monday after United’s decision and the expectation that other big airlines would be forced to ditch their change fees too. Delta and United both ended down 3.6%, American shed 4% and Southwest retreated 3.2%. Even without change fees, plenty of other fees will survive. Charges for checking a bag were greatly expanded more than a decade ago. Many airlines also charge extra for seat assignments, more legroom, priority boarding and other perks, and they provided a growing source of revenue for airlines until the pandemic hit."}]}