{"article": [{"url": "https://www.marketwatch.com/story/coronavirus-update-us-death-toll-nears-211000-as-doctors-caution-that-trump-is-entering-a-key-phase-in-his-diagnosis-2020-10-07", "published": 1602083840.0, "headline": "Coronavirus update: U.S. death toll tops 211,000 as doctors caution that Trump is entering a key phase in his diagnosis", "body": "The U.S. death toll from the coronavirus illness COVID-19 edged above 211,000 on Wednesday, as doctors and medical experts said President Donald Trump is entering a key phase in the illness which can take a turn for the worse seven to 10 days into the onset of symptoms. Doctors watching Trump as he stood on the White House balcony and removed his face mask on Monday evening said he was using his neck muscles to help himself breathe, an indication that his lungs were not taking in enough oxygen, the New York Times reported. Trump showed no symptoms on Tuesday, according to his physician Sean Conley. But members of his administration continued to test positive for the virus, including Stephen Miller, a senior adviser and speechwriter, as the Associated Press reported. A senior administration official said Miller had previously tested negative as White House officials have tried to contain an outbreak on the complex that has infected Trump, the first lady and more than a dozen other aides and associates. Read also:Press corps laboring under intensifying coronavirus risk at White House Miller is an architect of the president’s “America First” foreign policy and restrictive immigration measures. His wife, Katie Miller, who serves as communications director to Vice President Mike Pence, previously had the virus and tested negative after the last time she saw him. Katie Miller had been in Salt Lake City with Pence, where he is preparing to debate Democratic vice presidential nominee Kamala Harris, but she left as soon as she found out about her husband’s diagnosis. Washington D.C. counted 105 new COVID-19 cases on Tuesday, the highest one-day count since June 3, when cases were falling, the Washington Post reported. City officials said they are monitoring the trend, and said it’s unclear if the spike if related to the White House outbreak. Trump tweeted that he is planning to attend next week’s debate in Miami against presidential opponent, Democrat Joe Biden, but Biden said they should not debate if Trump still has the virus. Biden has taken a 16-point lead over Trump in a new national poll of likely voters. Biden’s lead in the CNN poll was 57% to 41%, in a survey taken after the first presidential debate and mostly after Trump’s COVID-19 infection was made public. Taken together with other polls, including an NBC News/Wall Street Journal poll showing a 14-percentage-point Biden lead after the debate but before Trump’s diagnosis was known, Biden’s lead is a smaller — though still significant — 9.2 percentage points in the latest RealClearPolitics average. In an average of top battleground states, Biden’s lead is just over 4 points. Trump also tweeted that he was ending talks on a coronavirus relief bill until after the November election, sending markets lower in late trade Tuesday. ‘It’s just so disruptive,” said Tom Block, Washington policy strategist at Fundstrat Global Advisors. “There’s no going around the president. My view is that this is negative for the market.” Read now: Amid ruins of stimulus talks, Trump, Pelosi and McConnell trade blame Trump later tweeted that he would consider passing several independent coronavirus relief measures — including a new round of stimulus checks, and called for further support for the airline industry. Federal Reserve Chairman Jerome Powell said the U.S. economy needs more fiscal support, even though the recovery from the pandemic has been strong. In a speech to the National Association for Business Economics, Powell argued it was better for Congress to provide too much fiscal support than the reverse. “Too little support would lead to a weak recovery, creating unnecessary hardship for households and businesses,” Powell said. This would lead more businesses to declare bankruptcy and for households to run into severe economic distress. On the other hand, even if policy actions are more than is needed, “it will not go to waste,” Powell said. The U.S. counted 42,449 new cases on Tuesday, according to a New York Times tracker, and at least 720 deaths. In the past week, new cases have averaged 44,101 a day, up 6% from the average two weeks earlier. The U.S. has the most cases in the world at 7.5 million and the most deaths at 211,343, according to data aggregated by Johns Hopkins University. In other news: • The Orthodox Jewish community in Brooklyn and Queens in New York staged protests overnight that injured at least one person at restrictions imposed on them by Gov. Andrew Cuomo after a spike in new COVID-19 infections, according to media reports. From Friday, schools, nonessential businesses and synagogues will be closed to avoid people gathering and infecting each other. Video shared on social media showed Hasidic men protesting and setting fires in the Borough Park neighborhood, most of them not wearing face masks. Four Orthodox Jewish lawmakers representing the areas affected by the shutdown said in a letter that Cuomo “has chosen to pursue a scientifically and constitutionally questionable shutdown of our communities.” iframe.twitter-tweet { width: 100% !important; } • Brussels will shut all bars, cafes and event halls for at least a month as of Thursday, in the latest effort to combat the coronavirus, the Guardian reported. Rudi Vervoort, minister-president of the Belgian capital region said drinking alcohol in a public place will be banned and food consumption in markets will be forbidden. “One in seven people tested in Brussels returns a positive result, the virus is everywhere in the region. There is not a single municipality in Brussels which is below the national average,” Vervoort said. Belgium has the second highest mortality rate in the world on a per-capita basis after Peru, according to Agence France-Presse. Belgium has 134,291 confirmed cases of COVID-19 and at least 10,092 people have died. That is equal to 88.36 people per 100,000 population. Peru’s death rate is 102.65 per 100,000 people. • Infection rates are rising faster in the Czech Republic than anywhere else in Europe after the country’s health ministry reported a daily record of 4,457 new infections Wednesday, The Wall Street Journal reported. In the last two weeks, the country has recorded 326.8 cases per 100,000 people, according to the European Center for Disease Prevention and Control. • Dr. William Foege, an epidemiologist who played a key role in eradicating smallpox, sent a letter to Dr. Robert Redfied, head of the Centers for Disease Control and Prevention, urging him to expose the White House’s mismanagement of the pandemic, USA Today reported. “You and I both know that despite the White House spin attempts, this will go down as a colossal failure of the public health system of this country.” The Trump administration’s handling of the pandemic will be taught in textbooks as “a lesson on how not to handle an infectious diseases pandemic,” Foege wrote in a letter dated Sept. 23, after reports that White House officials had directly tampered with coronavirus guidelines on the CDC’s website. Read: Expert calls for ‘radical transparency’ on Trump’s coronavirus treatment and progress as more in president’s circle test positiveLatest tallies There are now more than 35.9 million confirmed cases of COVID-19 worldwide, the Johns Hopkins data show, and at least 1.05 million people have died. So far, 25 million people have recovered. Brazil has the second-highest death toll after the U.S. at 147,494, but third-highest case tally at 4.9 million. India is second to the U.S. by case tally at 6.8 million, and has the third-highest death toll at 104,555. See also: Prepare for a ‘marathon’ and two years of wearing masks to battle COVID-19, says prominent Spanish virologist Mexico is fourth with 82,348 deaths and ninth with 794,608 cases. The U.K. has 42,605 deaths and 546,949 cases, the highest death toll in Europe and fifth-highest in the world. See now: Second coronavirus wave could delay Europe’s recovery: ECB President Lagarde China, where the illness was first reported late last year, has 90,678 cases and 4,739 fatalities, according to its official numbers. What’s the latest medical news? Eli Lilly & Co. LLY, +2.20% said it submitted its experimental COVID-19 monoclonal antibody treatment to the Food and Drug Administration for an emergency use authorization, as MarketWatch’s Jaimy Lee reported. An EUA is not a full approval but a type of regulatory authorization used during the pandemic to speed up the process of bringing new therapies to market. The company in September shared clinical trial data for LY-CoV555, finding that the stand-alone therapy could reduce the rate of hospitalization and viral load in some mild to moderately ill COVID-19 patients. Lilly said it has the capacity to manufacture one million doses of the monotherapy in the fourth quarter of this year. The company also released interim data from a randomized, double-blind, placebo-controlled Phase 2 study testing a combination of LY-CoV555 and LY-CoV016, another antibody-based therapy, in 268 patients. The combination therapy can reduce viral load, symptoms, emergency room visits, and hospitalizations, according to Lilly, which said it plans to submit the combination therapy for an EUA in November. Antibody-based treatments for COVID-19 have recently come into sharp focus since President Donald Trump last week was prescribed an experimental antibody treatment developed by Regeneron Pharmaceuticals Inc. REGN, +0.36% Read also:Abbott exec: Why better COVID-19 tests may help the U.S. get back to normalWhat are companies saying? • Fantasy sports and online betting site DraftKings Inc. DKNG, -4.51% priced a previously announced offering of 32 million shares at $52 a share. The company is selling 16 million shares, while selling shareholders are selling another 16 million, for a total offering size of $1.664 billion. DraftKings will not receive any of the proceeds from the shares being offered by selling shareholders. Underwriters Credit Suisse and Goldman Sachs have a 30-day option to acquire up to 4.8 million additional shares. DraftKings joins the many companies issuing record levels of debt and equity during the pandemic. Best New Ideas in Money:How to protect America from the next economic calamity • Fiverr International Ltd. FVRR, +4.06% is planning to offer $400 million in convertible bonds that mature in 2025. The company, which connects skilled freelancers with employers, plans to use some of the proceeds to cover the costs of capped call transactions that aim to limit dilution on conversion, and the rest for general corporate purposes. Companies have issued debt, convertible debt and equity at record levels during the pandemic. Companies have issued 91.5 billion of convertible debt in the year to date, according to Dealogic data, compared with the previous record of $71.1 million set in the same period in 2007. •Levi Strauss & Co. LEVI, -2.24% swung to a surprise quarterly profit and reported quarterly sales well above expectations despite the effects of the pandemic, buoyed by strong online sales. Levi Strauss said its finances continued to improve into the current quarter. The company said it earned $27 million, or 7 cents a share, in the third quarter, compared with $124 million, or 30 cents a share, in the year-ago period. Adjusted for one-time items, the company earned $31 million, or 8 cents a share. Sales fell to $1.1 billion from $1.5 billion a year ago. Analysts polled by FactSet had expected a GAAP loss of 30 cents a share on sales of $822 million in the quarter. The company said it was cash-flow positive in the quarter, “reflecting the company’s focus on financial discipline, cost controls, cash and working capital.” • Lowe’s Cos. LOW, +1.38% will spend $100 million to provide its workers with another bonus, bringing the total cost of additional worker compensation so far during the pandemic to $775 million. All active U.S. hourly associates will be eligible for the bonus, which will be paid out on Oct. 16. Full-time workers will receive $300; part-time workers will get $150. The bonus amount matches previous bonuses in March, May, July and August. The home improvement retailer also raised pay for full- and part-time workers by $2 per hour for the month of April. Lowe’s and its related businesses employ about 300,000 workers. The company has also offered $55 million in grants to rural communities, small businesses and minority-owned businesses. Lowe’s fiscal year 2019 sales totaled $72.1 billion. • Casual dining restaurant chain Ruby Tuesday filed for bankruptcy Wednesday, citing the “unprecedented impact” of the COVID-19 pandemic. The company has reached an understanding with its lenders to support its financial restructuring, which it plans to use strengthen its business by reducing debt. The restaurants will continue to operate “business as usual” through the bankruptcy process. “This announcement does not mean ‘Goodbye, Ruby Tuesday,’” said Chief Executive Shawn Lederman. “Today’s actions will allow us an opportunity to reposition the company for long-term stability as we recover from the unprecedented impact of COVID-19.” Ruby Tuesday joins a list of companies that went bankrupt amid the pandemic, including fellow restaurant chain California Pizza Kitchen, Hertz Global Holdings Inc. HTZ, -1.78%, Chesapeake Energy Corp CHKAQ, +5.72% and J.C. Penney Co. Inc. JCPNQ, -3.42%"}]}