{"article": [{"url": "https://www.marketwatch.com/story/gold-prices-extend-gains-aim-for-highest-level-since-2012-as-dollar-softens-2020-06-23", "published": 1592921960.0, "headline": "Gold prices climb to highest finish since 2012 on softer dollar, trade jitters", "body": "Gold futures climbed toward their highest settlement in more than seven years Tuesday as low interest rates, U.S.-China tension, and a weakening U.S. dollar provided a runway higher for bullion. The conflicting statements on the status of the U.S.-China trade deal from White House trade adviser Peter Navarro, along with increasing tensions between the two nations, has led to more safe haven buying in gold, said Jeff Wright, executive vice president of GoldMining Inc. Navarro suggested to Fox News in a late-Monday interview that the trade agreement with China, signed in January, had been terminated. He later said his comments were “wildly” taken out of context and the phase-one pact remained in force. President Donald Trump also tweeted that the agreement was intact. The U.S. stock market recovered from an overnight shock from Navarro’s comments to move higher in Tuesday trade as gold futures settled. The dollar, however, was down 0.5% and has declined 1.1% so far this week to 96.58, as measured by the ICE U.S. Dollar Index DXY, -0.58%, which gauges the buck against a half-dozen currencies. Because most commodities are priced in dollars, a softening buck can make those assets more attractive to buyers using alternate monetary units. On Comex, August gold US:GCQ20 added $15.60, or 0.8%, to settle at $1,782 an ounce, after rising 0.8% on Monday. Prices marked the highest settlement for a most-active contract since Oct. 4, 2012, according to FactSet data. July silver US:SIN20 rose 16 cents, or 0.9%, at $18.063 an ounce, following a 0.3% rise on Monday. Global PMI readings on Tuesday, meanwhile, pointed to a quicker economic recovery from the coronavirus pandemic, contributing to the stock gains, said Edward Moya, senior market analyst at Oanda, in a market update. The flash U.S. service sector purchasing managers index rose to a 4-month high of 46.7 in June from 37.5 in the previous month, IHS Markit said. The flash manufacturing sector purchasing managers index rose to a 4-month high of 49.6 from 39.8 in May. Though an improvement, the readings remain slightly below 50, which indicates worsening conditions. Gold climbed on the U.S. PMI readings, which showed “a strong rebound that did not top expectations, supporting the idea that fiscal and monetary officials need to keep the stimulus coming,” said Moya. Gains for the yellow metal have come despite a rebound in equities amid the gradual restart of business activity in the wake of the coronavirus pandemic, but investors have expressed worry that the rebound for riskier assets has come too far too fast, with cautious investors viewing gold as a hedge against a reset of equity bullishness. “Investors’ appetite for bullion remains huge: despite the large recovery seen in stocks from April onwards, the scenario remains highly uncertain, with potential new corrections just around the corner and traders are still buying gold as a hedging asset,” wrote Carlo Alberto De Casa, chief analyst at ActivTrades in a daily research note on Tuesday. Monetary stimulus from global central banks, including the Federal Reserve, and extremely low or negative interest rates for the foreseeable future, also helped to raise the appeal of precious metals that don’t offer a coupon. “Trade tensions, second wave concerns, the 10-year real yields (TIPS) decline deeper into negative territory, and taper tantrum risks will continue to support bullish calls to reach $1,800 in the short-term and eventually record high territory later this year,” said Moya. Rounding out action on Comex, July copper US:HGN20 rose 0.2% to $2.6585 a pound. July platinum US:PLN20 added 0.3% to $846.40 an ounce and September palladium US:PAU20 rose 0.5% to $1,951.10 an ounce."}]}