{"article": [{"url": "https://www.marketwatch.com/story/google-oracle-meet-in-copyright-clash-at-supreme-court-01602055090", "published": 1602041180.0, "headline": "Google, Oracle meet in copyright clash at Supreme Court", "body": "A decade-old legal battle between Silicon Valley giants Oracle and Google over software rights moves to the Supreme Court Wednesday, in a case with enormous implications for copyright in the digital era. kimihiro hoshino/Agence France-Presse/Getty Images WASHINGTON (AP) — Tech giants Google and Oracle are clashing at the Supreme Court in a copyright dispute that’s worth billions and important to the future of software development. The case before the justices Wednesday has to do with Google’s GOOGL, +1.82% GOOG, +1.97% creation of the Android operating system now used on the vast majority of smartphones worldwide. Google says that to create Android, which was released in 2007, it wrote millions of lines of new computer code. But it also used 11,330 lines of code and an organization that’s part of Oracle’s ORCL, +0.42% Java platform. Google has defended its actions, saying what it did is long-settled, common practice in the industry, a practice that has been good for technical progress. But Oracle says Google “committed an egregious act of plagiarism” and sued, seeking more than $8 billion. The case has been going on for a decade. Google won the first round when a trial court rejected Oracle’s copyright claim, but that ruling was overturned on appeal. A jury then sided with Google, calling its copying “fair use,” but an appeals court disagreed. Because of the death of Justice Ruth Bader Ginsburg, only eight justices are hearing the case, and they’re doing so by phone because of the coronavirus pandemic. The questions for the court are whether the 1976 Copyright Act protects what Google copied, and, even if it does, whether what Google did is still permitted. Oracle, for its part, says the case is simple. “This case is about theft,” Oracle’s chief Washington lobbyist, Ken Glueck, said in a telephone interview ahead of argument. He compared what Google did to plagiarizing from someone else’s speech. When you plagiarize one line from a speech, he said: “That’s a plagiarized speech. Nobody says, ‘Oh, well, it was just one line.’” But Google’s Kent Walker, the company’s chief legal officer, said in an interview that Google wrote “every line of code we possibly could ourselves.” “No one’s ever claimed copyright over software interfaces, but that’s what Oracle is claiming now,” Walker said. Microsoft MSFT, +2.48%, IBM IBM, -2.81% and major internet and tech industry lobbying groups have weighed in — in favor of Google. The Trump administration, the Motion Picture Association and the Recording Industry Association of America are among those supporting Oracle. The case is Google LLC v. Oracle America Inc., 18-956."}]}