{"article": [{"url": "https://www.marketwatch.com/story/gold-prices-head-south-as-u-s-dollar-perks-up-11601467248", "published": 1601476340.0, "headline": "Gold prices fall for the month, but tally an 8th quarterly gain in a row", "body": "Gold futures finished lower for Wednesday’s session, contributing a loss for the month as prices responded to a strengthening U.S. dollar that was been weighing on commodity prices. The bullion, however, tallied an eighth straight quarterly gain, buoyed by haven demand for the precious metal. “The stats show that it was a great quarter for the metals, but September was a lousy month,” said Brien Lundin, editor of Gold Newsletter, adding that a “small uptick in real interest rates” was the primary reason for the month’s loss for gold. “Considering the blistering move gold had made earlier in the quarter to over $2,000 an ounce, and the fact that it had failed to build upon that rally, the minor rise in real rates was all that was needed to shake the weak hands out of the gold market and start a sell off,” he told MarketWatch. On Wednesday, December gold GCZ20, +2.17% retreated $7.70, or 0.4%, to settle at $1,895.50 an ounce. December silver SIZ20, +5.96% lost 95 cents, or 3.9%, to end at $23.494 an ounce. For the month, gold lost 4.2%, but advanced 5.2% over the three-month period ended in September, according to Dow Jones Market Data, tracking the most-active contract. Meanwhile, silver shed nearly 18% in September, but rallied by 26% for the quarter. More recently, gold’s value has waxed and waned in lockstep with the dollar. A resurgence in the greenback is viewed by commodity investors as making purchasing the yellow metal less compelling for overseas buyers and undercutting demand. The dollar was up 1.8% month to date, as measured by the ICE U.S. Dollar Index DXY. The move for the dollar comes after an acrimonious presidential debate between President Donald Trump and former Vice President Joe Biden, as the race for the White House heats up in the U.S., leading up the Nov. 3 election. For gold, it was a “‘buy the rumour sell the fact’ over the Presidential debate and the market is more interested in the development of the stimulus talks,” said Rhona O’Connell, head of market analysis, EMEA and Asia regions at StoneX. In a daily note, analysts at Zaner Metals said “the gold and silver markets badly ‘need’ a stimulus package to ‘save’ them from a resumption of the type of selling seen at the beginning of the month.” “On the other hand, the odds of getting a stimulus package have improved with a barrage of layoffs expected in the coming 24 hours as that is likely to move Congress,” including an announcement by Disney DIS, +1.53% of 28,000 jobs cuts at its parks, they said. That’s “compounded by the reality of another wave of layoffs at several U.S. airlines.” Gold futures had earlier briefly risen to trade back above $1,900 shortly after data showed the pace of U.S. private sector job growth in September was the strongest in three months. Private-sector employment rose by 749,000 jobs, Automatic Data Processing Inc reported Wednesday. The government will release its September jobs report on Friday. Meanwhile, the record decline in the U.S. economy in the second quarter was lowered slightly to a 31.4% annual pace, from a previous reading of 31.7%. Among other metals traded on Comex, December copper HGZ20, +1.38% settled at $3.0325 a pound, up 1.4% for the session. Prices, based on the most-active contracts, logged a monthly loss of about 1%. The most-active January platinum PLF21, +3.84% contract rose 1.3% to $909.20 an ounce, trading around 5% lower for the month. December palladium PAZ20, +2.31% edged down by 0.05% to $2,330.50 an ounce, up nearly 2.3% for the month."}]}