{"article": [{"url": "https://www.marketwatch.com/story/u-s-treasury-yields-rise-after-strong-china-economic-data-11600172618", "published": 1600186700.0, "headline": "Treasury yields inch higher after healthy U.S., China economic data, ahead of Fed meeting", "body": "U.S. Treasury yields rose Tuesday in line with the positive tone in risky asset markets, following a raft of economic data that showed the recovery in the two world’s largest economies was continuing apace. What are Treasurys doing? The 10-year Treasury note yield TMUBMUSD10Y, 0.777% rose 0.9 basis point to 0.678%, while the 2-year note rate TMUBMUSD02Y, 0.156% edged 0.4 basis point up to 0.139%. The 30-year bond yield TMUBMUSD30Y, 1.576% added 2.2 basis points to 1.431%. What’s driving Treasurys? The U.S. S&P 500 index SPX and finished higher Tuesday as equities remained on pace to claw back last week’s loses, easing demand for government bonds. This came amid a broad-based improvement in U.S. and Chinese data, which has helped to alleviate concerns about the world economy’s trajectory in the face of the COVID-19 pandemic. A September snapshot of manufacturing activity in New York state jumped to a reading of 17, from the previous month’s 3.7. An index of August import prices rose 0.9%, while last month U.S. industrial production expanded by 0.4%. In China, retail sales grew for the first time in 2020, rising 0.5% in August from a year earlier, according to the National Bureau of Statistics. Industrial production in China also rose 5.6%, up from July’s 4.8% increase. See: China’s economic recovery gained speed in August The Federal Reserve’s two-day meeting kicked off on Tuesday, where investors are hoping to glean clues on how senior central bankers see the path for growth and inflation ahead. In addition, Fed Chairman Jerome Powell is expected to answer questions on the central bank’s new average inflation target framework at the news conference. A sale of $22 billion of 20-year bonds drew a solid reception from debt buyers. Going into the auction, the sale weighed slightly on trading slightly for longer-dated debt throughout the session as broker-dealers make room for the incoming bond supply.What did market participants’ say? ” Given what Fed governors and bank presidents have said since Jackson Hole, maybe they might wait a bit longer to flesh out the details on what monetary policy looks like under the new framework,” said Gary Pzegeo, head of fixed income at CIBC Private Wealth Management, in an interview. “The results suggest that there was solid demand ahead of tomorrow’s FOMC meeting,” said Thomas Simons, senior money market economist at Jefferies, referring to the reception for the 20-year bond auction."}]}