{"article": [{"url": "https://www.marketwatch.com/story/flu-vaccine-expected-to-be-in-high-demand-as-us-and-europe-aim-to-ward-off-twindemic-2020-10-01", "published": 1601570540.0, "headline": "Flu vaccine expected to be in high demand as U.S. and Europe aim to ward off â\u0080\u0098twindemicâ\u0080\u0099", "body": "October is prime time for flu vaccinations, and the U.S. and Europe are gearing up for what experts hope is high demand as countries seek to avoid a â\u0080\u009ctwindemicâ\u0080\u009d with COVID-19. â\u0080\u009cThereâ\u0080\u0099s considerable concern as we enter the fall and winter months and into the flu season that weâ\u0080\u0099ll have that dreaded overlapâ\u0080\u009d of flu and the coronavirus, Dr. Anthony Fauci of the U.S. National Institutes of Health said Thursday. He got his own flu shot earlier this week. A record number of flu vaccine doses are on the way, between 194 million and 198 million for the U.S. alone â\u0080\u0094 seemingly plenty considering last year just under half of adults got vaccinated and there usually are leftovers. Opinion:Get your flu shot in September â\u0080\u0094 before cases start to climb Also see:1 in 3 parents wonâ\u0080\u0099t vaccinate their children against the flu, even though pediatricians say itâ\u0080\u0099s â\u0080\u0098more important than everâ\u0080\u0099 Still, thereâ\u0080\u0099s no way to know how many will seek shots this year and some people occasionally are finding drugstores or clinics temporarily out of stock. This is how much it costs to develop a vaccine Be patient: Flu vaccine ships gradually. Less than half has been distributed so far, and the CDC and manufacturers say more is in transit. â\u0080\u009cThis year I think everyone is wanting to get their vaccine and maybe wanting it earlier than usual,â\u0080\u009d Dr. Daniel Jernigan of the Centers for Disease Control and Prevention told The Associated Press. â\u0080\u009cIf youâ\u0080\u0099re not able to get your vaccination now, donâ\u0080\u0099t get frustratedâ\u0080\u009d but keep trying. Pharmaceutical giant Sanofi Pasteur, which is supplying nearly 250 million doses worldwide including 80 million for the U.S., says it has shipments staggered into November. Vaccine maker Seqirus is exploring if it could squeeze out â\u0080\u009ca limited number of additional dosesâ\u0080\u009d to meet high demand, said spokeswoman Polina Miklush. Brewing flu vaccine is time-consuming. Once production ends for the year, countries canâ\u0080\u0099t simply order more â\u0080\u0094 making for a stressful balancing act as they guess how many people will roll up their sleeves. Germany usually buys 18 million to 19 million doses, and this year ordered more. As German Health Minister Jens Spahn put it: â\u0080\u009cIf we manage, together, to get the flu vaccination rate so high that all 26 million doses are actually used, then Iâ\u0080\u0099d be a very happy health minister.â\u0080\u009d Spain purchased extra doses in hopes of vaccinating far more older adults and pregnant women than usual, along with key workers in health facilities and nursing homes. In contrast, Poland, which last year had 100,000 doses go unused, didnâ\u0080\u0099t anticipate this fallâ\u0080\u0099s high demand and is seeking more. The good news: The same precautions that help stop spread of the coronavirus -- wearing masks, avoiding crowds, washing your hands and keeping your distance -- can help block influenza, too. Winter just ended in the Southern Hemisphere and countries like South Africa, Australia, Argentina and Chile diagnosed hardly any flu thanks to COVID-19 restrictions combined with a big push for influenza vaccinations. With the coronavirus still circulating and cold weather coming just as more schools and businesses reopen, thereâ\u0080\u0099s no guarantee that countries in the Northern Hemisphere will be as lucky with flu. â\u0080\u009cHow much flu, we donâ\u0080\u0099t know â\u0080\u0094 but there will be flu,â\u0080\u009d predicted Dr. William Schaffner of Vanderbilt University and the National Foundation for Infectious Diseases. A flu vaccine only protects against influenza, not the coronavirus. And while its effectiveness varies from year to year, people vaccinated against flu donâ\u0080\u0099t get as sick, avoiding pneumonia, hospitalization and death, Schaffner said. The CDC estimated that last year the flu hospitalized 400,000 Americans and killed 22,000. Adding flu to the toll of COVID-19 â\u0080\u0094 which has killed more than 1 million people worldwide including more than 206,000 Americans â\u0080\u0094 would further strain hospitals. Both flu and the coronavirus have similar symptoms and even if theyâ\u0080\u0099re mild, Schaffner warned of confusion as people seek testing to learn which illness they have and if anyone theyâ\u0080\u0099ve been around needs to quarantine. â\u0080\u009cTake flu out of the equation this fall,â\u0080\u009d Jernigan advised. Who needs flu vaccine? The U.S. recommends it for everyone starting at 6 months of age. But flu is most dangerous for people over age 65, young children, pregnant women and people with certain health conditions such as heart disease, asthma, even diabetes. Most Americans with insurance can get it without a co-pay, and there are different kinds to choose from: Regular shots, two types of shots that aim to give older adults a little extra protection, and a nasal spray. The CDC doesnâ\u0080\u0099t recommend one over another. If you canâ\u0080\u0099t find your preferred type, â\u0080\u009cwe ask people not to shop around and wait forever,â\u0080\u009d Jernigan said. â\u0080\u009cThe best vaccine to get is the vaccine thatâ\u0080\u0099s available to you.â\u0080\u009d The CDC this year wants states to increase flu vaccinations among Blacks and Hispanics, who are less likely to get a shot than whites and also are at extra risk from COVID-19. Some states also are holding drive-thru flu vaccinations and outdoor clinics to avoid crowds. And at the same time they get immunized against flu, older adults and people with chronic illnesses also should ask about getting a vaccine against a type of pneumonia that is a frequent complication, U.S. officials urged. In much of Europe, those at high risk get prioritized. France has ordered 30% more flu vaccine than last year, with first shots given to the high risk as inoculations begin later this month. In Italy, doctors and pharmacists have expressed concern about the supply, as the health ministry conducts negotiations with vaccine producers to ensure everyone who wants the vaccine can get it. Italy also lowered the threshold â\u0080\u0094 from age 65 to 60 â\u0080\u0094 for receiving the flu vaccine free of charge. Britainâ\u0080\u0099s health department expects enough doses for nearly half the population but cautions that phased deliveries might mean some doctors and pharmacies wonâ\u0080\u0099t receive shots until later in the fall. Britain typically offers free flu vaccines to older adults, pregnant women and certain other at-risk groups, and are discussing whether others should qualify for a free shot this year. The World Health Organization said last week that some countries are scrambling to make sure theyâ\u0080\u0099ve got enough flu vaccine. WHO encouraged any countries worried about a shortfall to give priority to health workers and older adults. Read on:Moderna CEO tells FT that coronavirus vaccine wonâ\u0080\u0099t be ready by Election Day"}]}