{"article": [{"url": "https://www.marketwatch.com/story/two-ways-washington-changing-its-redskins-nickname-could-make-the-team-money-2020-07-15", "published": 1595517740.0, "headline": "Two ways Washington changing its 'Redskins' nickname could make the team money", "body": "\"NEVER. You can use caps.\" That was Washington Redskins owner Daniel Snyder shutting down the idea of changing his football team's name in a 2013 interview with USA Today. Snyder has since backpedaled. After immense public pressure from both fans and sponsors, the professional football team in Washington, D.C. will be renamed be called \"The Washington Football Team\" for the 2020 season. For years, Snyder resisted changing the name of the team, which many have criticized for having racial overtones. But while Snyder has endured intense backlash for taking so long to drop the name Redskins, he is likely to profit from the change. \"This will be a big event,\" Matt Powell, Senior Industry Advisor at research firm NPD, told MarketWatch. \"Not every Washington fan will go out and get a new jersey, but many will.\" Jersey sales are among the most popular team gear for fans and are a major driver of merchandise sales. Washington hasn't had a player rank inside the top 10 in NFL jersey sales in the past seven years, according to NFL licensing partner Fanatics. This could allow Washington to jockey for the \"top spot\" in merchandise sales, according to Powell. The Washington football team ranked 20th in eBay's most searched NFL teams in 2018, according to the e-commerce giant - a low ranking as the team is the seventh most valuable NFL team in the NFL at $3.4 billion. But the team's revenue from increased merchandise sales may only increase modestly due to revenue sharing rules. Revenue sharing among merchandise sales and national TV contracts is collectively bargained by team owners and the players union. An increase in merchandise sales is only one way Snyder could cash in on his team's name change. Another is ticket sales. Powell sees the name change having a \"positive impact on ticket sales.\" There is some debate on whether an increase in ticket interest will matter for this season due to the uncertainty of the presence of fans at NFL games in 2020 amid the coronavirus pandemic. The NFL has not made a blanket rule regarding fans at games in 2020. It may seem odd that fans would be more likely to buy tickets to attend a game simply because of a name change, but it has happened before with other professional sports teams. In 2013, the Michael Jordan-owned Charlotte Bobcats announced a name change to the Charlotte Hornets. That Summer, ticket sales spiked 59%, according to Pete Guelli, the Bobcats' executive vice president and chief sales and marketing officer. An increase like that could be very profitable for Snyder, considering the team ranked 30th in home attendance by percentage last season. In the past decade, team attendance has dipped 19%. A recent poll conducted by the Washington Post showed that D.C. residents say the Washington Nationals, the city's baseball team, is their favorite local team - only 13% of D.C. residents say the football team is their favorite local team, down from 21% in 2010. There is evidence of increased ticket sales after a name change among other sports franchises too, though many of those examples also included a franchise relocation. For example, when Major League Baseball's Montreal Expos moved to Washington, D.C. in 2005, changing its name to the Washington Nationals. The Nationals saw an understandable increase in local ticket sales, because the previous year there was no team in the city. The season prior to their name change, the Charlotte Bobcats had the second-worst record in the NBA - similarly, last season the Washington Redskins had the second-worst record in the NFL. The name change comes amid a scandal at the Washington football team's front office faces sexual assault allegations, according to a report from the Washington Post. iframe.twitter-tweet { width: 100% !important; } Team owner Daniel Snyder says the alleged behavior has \"no place\" in his franchise, or in society at large."}]}