{"article": [{"url": "https://www.marketwatch.com/story/starbucks-pumpkin-spice-latte-still-drives-traffic-and-could-be-a-source-of-holiday-season-inspiration-for-retailers-2020-09-09", "published": 1599906560.0, "headline": "Starbucks' Pumpkin Spice Latte still drives traffic and could be a source of holiday season inspiration for retailers", "body": "The Pumpkin Spice Latte might be \"basic\" to some, but for fans, it's a reason to head to a local Starbucks Corp. even in a pandemic. Placer.ai data shows that there was a jump in traffic the weekend that the Pumpkin Spice Latte made its 2020 debut. Starbucks SBUX, +0.53%  brought back the drink on Aug. 25, the earliest launch ever, the retail data company said. \"Since the start of the recovery, Starbucks visits saw its visit peak when traffic to stores came within 20.1% of 2019 levels - something that happened the week beginning August 17,\" wrote Ethan Chernofsky, Placer.ai's vice president of marketing, in a blog post. \"Yet, the Saturday and Sunday following the launch were within 7.7% and 6.2% of 2019 levels of the equivalent Saturday and Sunday in 2020.\" Read:Instant Pot has launched a coffee/espresso maker, the Instant Pod, available exclusively at Walmart Starbucks stock has soared nearly 11% over the past month, though shares have slipped 2.3% for the year to date. The S&P 500 index SPX, +0.87%  is up 5.2% for 2020 so far. Starbucks uses its menu to combat any slowdowns that take place during the course of the year, Placer said. The superstar PSL is a way to end the warm-weather doldrums and jump start the fall. \"Making the PSL launch ever-earlier has been part of a wider strategy to welcome the fall earlier and say goodbye to summer months less oriented to a coffee chain,\" Placer said. Starbucks has reportedly sold 424 million Pumpkin Spice Lattes since it was launched in 2003. It can be made with non-dairy milk, like oat milk, and other customizations. It's joined this year by new food items, like Hearty Blueberry Oatmeal, and other pumpkin items, like Pumpkin Cream Cold Brew. See:Amazon Prime Day delay, back-to-school uncertainty is changing the shopping calendar Starbucks has faced coffee category challenges during COVID-19, as morning routines were eliminated by the work-from-home shift, urban areas were evacuated by people looking for outdoor space and travel nearly came to a halt. Still Stifel analysts upgraded Starbucks in a note published on Aug. 24. Analysts rate Starbucks shares buy with a $90 price target. \"Under the leadership of CEO Kevin Johnson, we have been impressed with the company's willingness and ability to adapt quickly to the changing environment,\" Stifel said. Starbucks has made changes to its popular rewards program so members could earn points through various payment methods, and made adjustments as stores closed or reopened with new coronavirus-related rules. \"In our view, investors should look for companies willing and able to innovate quickly to address the challenges of the current environment,\" Stifel said. \"Despite its size, Starbucks has been able to accomplish this feat better than almost anyone in the restaurant industry.\" Starbucks' PSL strategy could also provide the rest of retail with a few ideas on how to handle the coming holiday season, which is going to be unlike any other. Watch:How the increase of remote work could help unlock value in the economy \"If Thanksgiving is removed as a retail holiday, it could drive more buzz to Black Friday or give brands an opportunity to create their own 'days' throughout the season,\" Placer said. \"There is an obvious benefit to a wider sense of retail urgency that brings visitors into malls and shopping centers. However, even if it just mitigates losses the results could be significant.\""}]}