{"article": [{"url": "https://www.marketwatch.com/story/heres-why-markets-arent-worried-over-the-u-s-governments-mountain-of-debt-11599849361", "published": 1599835460.0, "headline": "Hereâ\u0080\u0099s why markets arenâ\u0080\u0099t worried over the U.S. governmentâ\u0080\u0099s mountain of debt", "body": "Photo by Mark Wilson/Getty Images The immense fiscal cost needed to limit the damage wrought by the COVID-19 pandemic isnâ\u0080\u0099t frightening bond investors. Even as the mountain of government debt has continue to pile up, the cost of borrowing for Washington is projected to fall to its lowest level in around 75 years and is likely to stay that way thanks to the Federal Reserveâ\u0080\u0099s pledge to keep interest rates near zero. The Congressional Budget Office forecasts U.S. public debt levels will eclipse the countryâ\u0080\u0099s annual economic output for the first time next year, but few are worried about this watershed moment. See: U.S. budget deficit to hit record $3.3 trillion this year, CBO says â\u0080\u009cThe cost of the debt for the Treasury will remain extremely low for the next decade. We are entering a new phase for public debt, in general,â\u0080\u009d said Bastien Drut, a senior strategist at CPR Asset Management, in an interview. He noted the same report from the CBO estimated the U.S. federal governmentâ\u0080\u0099s cost to service its debts would amount to 1.1% by 2025, which would represent the lowest level since World War II. This comes as Washington continues to squabble over the capacity of the federal government to run additional deficits amid discussions in Congress for another significant fiscal stimulus package. Read: Fiscal stimulus prospects at dead end after Senate vote, a top Republican says Some market participants have called for the government to take advantage of depressed interest rates to loosen the fiscal spigots, especially as Wall Street grapples with the limits of monetary policy in a low interest-rate world. â\u0080\u009cItâ\u0080\u0099sÂ less costly for Treasuries to run huge deficits. In my view, governments have to use this opportunity to fight against the new threats we are facing,â\u0080\u009d said Drut, citing the cost to insure against the risk of rapid climate change. One overlooked point, Drut said, was the Fed would transfer the income earned from its $6.35 billion holdings of agency mortgage-backed bonds and government paper to the U.S. Treasury Department. This would help to offset the hefty bills incurred by Washington. Investors have also been more than willing to absorb the increased issuance. With fewer avenues for earning income, a large chunk of global savings was flowing into the U.S.â\u0080\u0099s highly liquid debt markets. â\u0080\u009cThere is a lot of demand for safe assets from the U.S. Treasury and from major sovereigns,â\u0080\u009d said Nathan Sheets, chief economist for PGIM Fixed Income, in an interview. â\u0080\u009cIt does feel more sustainable to have higher debt levels.â\u0080\u009d Sheets noted the 10-year yieldâ\u0080\u0099s depressed levels were a sign that investors were not suffering much indigestion as they absorb the federal governmentâ\u0080\u0099s ballooning debt issuance. The 10-year Treasury note yield BX:TMUBMUSD10Y has swung around 0.70% for the past week. That has marked a long journey from its peak of more than 15% when fears of uncontrolled inflation held sway a generation ago. Sheets says the current fiscal backdrop was a far cry from the days of the Clinton administration during the ascendancy of the bond vigilantes, market participants who would punish any perceived fiscal profligacy and demanding higher interest rates to compensate against the potential risk of inflation. â\u0080\u009cThereâ\u0080\u0099s no sign that we are having trouble clearing auctions at this point,â\u0080\u009d said Marvin Loh, senior global macro strategist, told MarketWatch. Yet even if the U.S. remains far away from the threshold where public debt levels start to pose a risk, Sheets suggested it may be better to err on the side of caution. â\u0080\u009cWith every percentage point increase in public debt to GDP, there is a small risk that the market chokes on it,â\u0080\u009d he said. Higher interest rates could complicate the Treasury Departmentâ\u0080\u0099s task of funding large budget deficits as the marketâ\u0080\u0099s compliance would be necessary to roll over any coming maturities every year. But investors say the Fed has made it clear it will stay accommodative for a long time. And in the distant future when the Fed chooses to normalize monetary policy, interest rates would still remain low as natural long-term interest rate, or the neutral rate, is much lower than before as Americans get older and productivity growth slows. That would limit the amount of room that the central bank could tighten monetary policy when the economy recovered from the pandemic-caused downturn. In other markets, the S&P 500 SPX, +0.87% and the Dow Jones Industrial Average DJIA, +0.56% were trading slightly higher on Friday, but U.S. equity benchmarks were still on pace to end lower this week. Read: U.S. Treasuryâ\u0080\u0099s record debt auctions may swamp market appetite without more support from Federal Reserve"}]}