{"article": [{"url": "https://www.marketwatch.com/story/treasury-yields-inch-higher-to-kick-off-new-quarter-ahead-of-data-deluge-2020-07-01", "published": 1593622100.0, "headline": "10-year Treasury yield books biggest daily rise in two weeks after Fed minutes", "body": "U.S. Treasury yields rose Wednesday as minutes from the Federal Reserve’s meeting in June showed the central bank discussing the merits of yield curve control, a monetary policy tried by some other central banks.What are Treasurys doing? The 10-year note yield TMUBMUSD10Y, 0.777% rose 2.9 basis points to 0.682%, its highest since June 24, while the two-year yield TMUBMUSD02Y, 0.156% rose 1.2 basis points to 0.164%. The 30-year bond yield TMUBMUSD30Y, 1.576% gained 2.3 basis points to 1.433%. For the second quarter, the two-year note fell 3.8 basis points, the 10-year note picked up 3.8 basis points, and the 30-year bond yield added 6.4 basis points. What’s driving Treasurys? As expected, the minutes from the Federal Open Market Committee, the U.S. central bank’s rate-setting body, showed Fed officials holding further discussions on the potential for capping yields for certain maturities, otherwise known as yield-curve control. Even as expectations for the policy’s adoption have gained ground, some like Dallas Fed President Robert Kaplan and St. Louis Fed President James Bullard have pushed back against yield-curve control. Most Fed officials agreed that the central bank should provide more clarity to financial markets about when the central bank might raise benchmark interest rates, otherwise known as “forward guidance.” Analysts say the Fed is likely to wait until September to take this step. See: Most Fed officials at June meeting agreed on need to clarify what could cause them to move interest rates off zero In U.S. economic data, Automatic Data Processing Inc.’s private-sector employment report for June showed the U.S. added 2.37 million jobs in June. ADP also raised May’s numbers to reflect that 3.06 million jobs were, in fact, added that month, instead of a loss of 2.76 million jobs as previously reported. The ADP data will be followed by the more widely-watched U.S. Labor Department jobs data on Thursday. MarketWatch-polled economists forecast the U.S. economy will have added 3.9 million jobs last month, after gaining 2.51 million jobs in May. Read: U.S. seen adding almost 4 million jobs in June — but is the momentum already fading? The Institute of Supply Management’s manufacturing index for June jumped to 52.6%, from 43.1% in the previous month. Any number above the 50 mark indicates an expansion in economic activity.What did market participants’ say? “My read of the discussion around yield caps is that it was too vague to be useful and that the Fed remains too conservative to commit to a new strategy at this stage,” said Ed Al-Hussainy, senior interest rate and currency analyst at Columbia Threadneedle. “It’s a resounding dovish theme is all in these various outlets the Fed uses to communicate the public,” said Kevin Flanagan, head of fixed income strategy for WisdomTree, in an interview."}]}