{"article": [{"url": "https://www.marketwatch.com/story/chuck-reed-warned-of-city-services-insolvency-after-the-great-recession-he-thinks-the-corona-crisis-may-be-worse-11598540258", "published": 1598692520.0, "headline": "Chuck Reed warned of city services 'insolvency' after the Great Recession. He thinks the corona-crisis may be worse.", "body": "In this April 3, 2014 file photo, San Jose Mayor Chuck Reed speaks about public employee pensions at the Sacramento, Calif., Press Club. Rich Pedroncelli/Associated Press Chuck Reed is a study in contrasts. He spent eight years as mayor of San Jose, California, one of the richest cities in the country, yet which he believed was teetering on the brink of bankruptcy. That was in large part because of the entrenched legacy costs - mostly the public pensions, which in 2013 accounted for nearly one-quarter of the city's general fund budget. Reed is a Democrat, but spent much of those eight years taking on public employee unions, arguing that pension benefits should be trimmed not just for new hires, but also for existing workers. Most San Jose employees were part of a local pension plan, but Reed also tried to negotiate an exit for the few workers enrolled in the massive California Public Employees' Retirement System (CalPERS), perhaps in part to press his point that the statewide system had become an entrenched interest. For states and locals, the coronavirus crisis will be a slow burn. Local governments were still feeling the pinch of the Great Recession years after it ended, and as Reed notes, many hadn't really recovered. MarketWatch talked with him about what to expect from this unprecedented moment in history. The interview below has been edited for clarity. MarketWatch: Nearly a decade ago, in the wake of the Great Recession, you became known for talking about what you called \"service-level insolvency.\" Can you explain what that is and why it's a concern?Chuck Reed: It's a term that came out of the Detroit bankruptcy when the judge was looking at the sorry condition of the services being provided to the people. Maybe you have money, maybe you're paying your bills, but you're not providing services that taxpayers expect and residents need. Falling below the basic level of services that a city ought to provide. It's a loosely defined concept but you know it when you see it. When I described it to my constituents, I said, it's the sad and sorry condition you'll be in the day before you file bankruptcy. And we don't want to go there. We needed to do something to avoid getting into that condition where bankruptcy seemed an appealing alternative. In San Jose, we had been cutting services to balance the budget for ten years. We cut positions and laid people off. You know you've reached the end of the line when you're laying off police and firefighters. MarketWatch: We're a couple of months past the first shock of the coronavirus crisis, but the fiscal challenges that states and cities and municipal entities face usually have a pretty long tail. How are you thinking about the new challenges this downturn will bring? Reed: There is a very long tail because local finance is usually a lagging indicator. There are cities heavily dependent on sales taxes and other things that are cyclical, but generally local governments are pretty stable because of the property tax and some other things that don't fluctuate with the economy much. But eventually it does catch up with you. This year is what you'd call an easy year for local governments because the COVID crisis started toward the end of the year. [MarketWatch note: most cities and states have fiscal years that start on July 1.] Going into this fiscal year, you usually had some kind of reserves, some open positions, things you can do as part of the standard toolkit in dealing with the downturn. This will all get absorbed. In January, as cities start to make adjustments for the new reality, we'll see more services cut. Next fiscal year, when it's clear that the revenues have taken a hit and even property taxes are softening, well, you've done the easy stuff, the interfund transfers, the layoffs. Next year is the hard one: you're going to be cutting services. MarketWatch: What should the federal government be doing to support states and cities? Reed: Get us out of a recession (laughs). We learned in the Great Recession when we had TARP and the stimulus package that the federal government did give us some money but it had strings attached so we were not allowed to spend it on some things. Basic services was not something you could spend money on. There's never enough money and during a recession, whatever money the feds can flow down would be helpful. I think there's a limit to federal borrowing so there are limits to what the federal government can do. What it is, I don't know, but I think we're about to find out. I'm not an advocate for the feds funding local governments but if they're going to do something, it would be helpful if it flowed directly and didn't go through the states because the states always take a cut. So we can pay police officers, firefighters, teachers, people who provide services for our taxpayers. MarketWatch: Let's talk a little bit about the lingering issues from previous cycles - the legacy costs that crowd out the service-level stuff. How would you characterize that issue now - is it about the same as before? Better? Worse because of this new fiscal crisis? Reed: Some progress has been made on that in selected cities. In San Jose we did some things, we went to voters with ballot measures, raised taxes, changed pension benefits, and the pension reform measures were all approved by two-thirds majorities or higher. The problem facing mayors now is that even though there was progress in some cities, if you look at every part of the cities' operations, many cities are weaker now than they were going into the Great Recession.Probably the most difficult thing to understand is the infrastructure. The easiest thing to do when you go into a recession is cut back on maintenance, street repair, park maintenance, and I don't think most cities have recovered from what they did after the Great Recession in terms of letting infrastructure go. You don't have as much room to cut because it's already been cut. Letting it go further down the tubes is less desirable. The other big one is pensions. I don't know if there are any cities that have caught up to where they were in 2000 when we had the dot-com bust. The pension funding is, on a percentage basis, lower now than it was then, despite nine years of growth - and now we're going back into another recession. Pension funding will take another hit, I think, because that's one of the easiest places to borrow from, because we don't consider it borrowing to just not pay. This year, just a few years after doing pension reform, Colorado decided not to do a payment. It's hard times. New Jersey, I just read, they're probably going to pay 80% of the actuarially defined contribution. Well, that's probably higher than some places but it's less than what you should be paying. Pensions will be underfunded and that pushes the crisis into the future. MarketWatch: Back in 2013, you told me, quote, \"What we need is for governments at all levels to be able to control the costs of retirement benefits by changing future accruals. Smaller cities don't have the capacity to do the reforms necessary, because you have bullies like CalPERS and the unions that are going to litigate and litigate.\" Does that sentiment still ring true?Reed: I think that's still true. With a few exceptions around the country, it's still the case nearly everywhere. And it's still the case that very few local governments have the capacity to control the future costs. That is the key. It's not a problem with benefits. It's a problem with overpromising and underfunding. Yes, I think the sentiment is the same. Local governments are at the mercy of state governments. MarketWatch: What are the answers now? Reed: In most cases (working with the state government) is the most important thing. We just finished litigation over the reforms Jerry Brown championed in 2012. It took 8 years. I think the circumstances for some kind of changes will probably be the same as when Brown put it together: when the state public employee unions want a ballot tax measure, we'll maybe get another pension reform measure in California. But localities in the CalPERS and CalSTRS (California State Teachers' Retirement System) plans have almost nothing they can do except beg the state legislature to make changes. MarketWatch: I covered pension funding and pension reforms extensively, and I understand everything you're saying about the finances, but I also observed it being a very political issue, one that in many cases was used to cut benefits or even try to break unions. What do you think about that? Reed: I don't know of any places that had success breaking unions. But it is certainly a political thing, in part because the government employee unions are dead set against any kind of reform. You start out knowing there's going to be a fight over the very concept of reform. It's hard to get past that to talk about the details because it is a standing political position of the employee unions that everything is just say no. The most interesting question for me is, what will it take for the employee unions to decide underfunding their pension benefits is bad for their members? How can it be good for people to have underfunded pensions? I think employees believe there's always going to be money, someone can always come up with money. I tell people, the part of your pension that's underfunded, say 30% or whatever, is on the bargaining table in bankruptcy. Where you want to be as an employee is 100% funded, so that if the jurisdiction files bankruptcy, that 100% is off the table. The 30% you've been promised that hasn't been funded, that's subject to cuts. When the public employee unions decide that underfunding pensions is cheating their members, maybe they'll decide some kind of reform is appropriate. The institutional problems of overpromising and underfunding are overwhelming the system in lots and lots of places. MarketWatch: I spoke with a muni analyst who thinks that states will have to deficit borrow now because there aren't any other options. They can't cut spending enough or raise taxes enough to balance their budgets because the problems are so enormous. And for now, for perhaps the first time ever, the municipal market is generally signaling it will tolerate way more deficit borrowing than ever before. In his words, \"People recognize we're outside the normal business cycle here.\" Would you agree with that, and if so, are there good ways and bad ways to do deficit borrowing? Innovative things you've heard about, red lines that should never be crossed? Reed: Deficit borrowing has been going on for decades because jurisdictions that have cash budgets have been borrowing by hiding it, using things like underfunding your pension plan or selling assets or monetizing income streams. That's a form of borrowing, we just don't call it that. Deficit borrowing is not new. The fact that they're thinking about being honest and calling it borrowing would be novel. Be honest with the voters, be upfront about it. There's a lot of different ways to do it. But I think the muni market will lend money to anybody, maybe just a quarter point or a half point higher. You know, a decade ago, the Bond Buyer deal of the year went to the Detroit deal, you know the one I meanâ\u0080¦ [MarketWatch note: a prestigious award from the municipal bond industry newspaper was given to Detroit in 2005 for a byzantine funding scheme that was meant to plug the gaps in its pension funding, but instead helped drive the city toward insolvency] â\u0080¦the mayor went to jail! That's a problem in the muni market. Puerto Rico was still issuing investment grade bonds one or two years before they cratered. I was at a muni bond conference and I asked, who was lending money to PR a year before they cratered? And the answer was \"those other guys.\" The muni market is not a stop on bad decisions, bad borrowing. I don't think it's going to slow down governments. If you can get the money borrowed, you will do it. I think we're going to find many mayors and governors in desperate conditions. In aggregate we're weaker than we were going into the Great Recession. Desperation is going to be widespread unless we really do get a V-shaped recovery. If we do, then borrowing to fill the gap will work. MarketWatch: Do you miss public office? Reed: No, not for a minute. I'm very happy not to be a mayor. These are tough times. But we had some tough times too. I know the agony that can go with trying to provide services. I do miss getting to work with some talented people but I don't miss the politics and the problems. I don't miss having to get up and read the news and make a to-do list. I just get up and read the news! I can enjoy it without having to do anything about it. Eight years is a long time to be mayor of a big city. It's a 24/7 job. Read next: As the Fed steps into the municipal bond market, will it be enough?"}]}