{"article": [{"url": "https://www.marketwatch.com/story/students-at-unc-notre-dame-and-michigan-state-on-how-the-pandemic-has-already-disrupted-their-fall-semester-11597873211", "published": 1598014880.0, "headline": "â\u0080\u0098Itâ\u0080\u0099s unlikely we can prevent widespread transmission of COVID-19 between students if our undergraduates return to campusâ\u0080\u0099: College students on an unusual fall semester", "body": "University of Notre Dame is pivoting to remote classes for at least two weeks, following an outbreak of positive COVID cases. (Photo: Robert Franklin/South Bend Tribune via AP) When the coronavirus pandemic first became a reality in March, colleges and universities across the country rushed to send students home.Â Now students are once again suddenly packing their bags and preparing to take courses remotely, as the first few weeks of classes at many schools ushered in COVID outbreaks â\u0080\u0094 except this time, colleges had months to prepare for a semester amid a global health emergency.Â MarketWatch spoke to students at colleges that have already been impacted by COVID this semester. Two of these schools, the University of North Carolina Chapel Hill and the University of Notre Dame, have already experienced COVID outbreaks. After watching this scenario play out, Michigan State University officials announced Tuesday that they would hold classes remotely, just a few weeks before the start of the fall semester.Â The decisions have disrupted studentsâ\u0080\u0099 lives and plans. Hereâ\u0080\u0099s what they had to say about it.Â Sarah Wietecha , senior at Michigan State University Sarah Wietecha had already bought furniture for her off-campus apartment, begun packing up her room at her parentsâ\u0080\u0099 house and secured a job at a coffee shop in East Lansing, Mich., when she learned that her senior year classes at Michigan State University would be remote.Â After initially planning to bring students back to campus, MSUâ\u0080\u0099s president, Samuel Stanley, told families Tuesday that classes for undergraduates will be held online and that the bulk of students who were supposed to live in the residence halls will instead learn from home. The school is also encouraging students who were planning to live off-campus, like Wietecha, to consider staying where theyâ\u0080\u0099re currently living.Â â\u0080\u009cGiven the current status of the virus in our country â\u0080\u0094 particularly what we are seeing at other institutions as they re-populate their campus communities â\u0080\u0094 it has become evident to me that, despite our best efforts and strong planning, it is unlikely we can prevent widespread transmission of COVID-19 between students if our undergraduates return to campus,â\u0080\u009d Stanley wrote in his message.Â Sarah Wietecha said she wished Michigan State University had made its decision to hold classes remotely earlier. Wietecha agrees that the decision to hold classes remotely is the safest, but she wishes it would have been made with more time to mentally and practically prepare. â\u0080\u009cI could have told you in June that we were going to go online, we should have,â\u0080\u009d said Wietecha , 21.Â Still, recent communications sent to students talking about testing and quarantining had made Wietecha hopeful that she would retain at least a small aspect of the in-person college experience. â\u0080\u009cAs a theater major that was a big win for me,â\u0080\u009d given that performing arts courses are difficult to conduct online. â\u0080\u009cIt would have been nicer to rip the Band-Aid off earlier, rather than a week before we all moved in,â\u0080\u009d she said.Â Tuesdayâ\u0080\u0099s announcement, just a few weeks before classes were to start and a few days after tuition was due for many, â\u0080\u009cleft a bad taste in my mouth,â\u0080\u009d she said. Ideally, Wietecha would like to see some kind of discount on tuition, particularly since under typical circumstances she would need to participate in performances to earn credit towards her major â\u0080\u0094 something thatâ\u0080\u0099s impossible at the moment.Â â\u0080\u009cEveryone is OK with that decision,â\u0080\u009d Wietecha said of MSUâ\u0080\u0099s choice to move to remote instruction. But. she added, â\u0080\u009cI canâ\u0080\u0099t afford to be paying or taking out thousands of dollars in loans to literally not be able to complete the classes weâ\u0080\u0099re paying for.â\u0080\u009d In addition to tuition, Wietecha will still be paying the lease for her off-campus apartment, which she signed months ago. â\u0080\u009cItâ\u0080\u0099s a lot of money to break, if not impossible for a lot of other students,â\u0080\u009d Wietecha said. â\u0080\u009cThey really put us in a rock and a hard place with this one.â\u0080\u009d Students who were planning on living on campus but will now be living at home will receive refunds or credits for their on-campus room and board, Dan Olsen, an MSU spokesman, wrote in an email. While the school is encouraging students planning to live off campus to stay home, â\u0080\u009cwe recognize that may not be an option for some,â\u0080\u009d Olsen wrote.Â â\u0080\u009cWe encourage them to work with their landlords to discuss their options,â\u0080\u009d he wrote. Â Wietecha, her sister and their other roommate are planning on moving to East Lansing on Sunday when the lease on their apartment begins.Â Â Mary Polking, junior at the University of Notre Dame The roughly five minutes that Mary Polking spent watching Notre Dameâ\u0080\u0099s president Rev. John Jenkins address students via video Tuesday evening was a roller coaster of emotions.Â â\u0080\u009cThere was this immediate sense of, I donâ\u0080\u0099t want to say terror, but dread and then relief that we werenâ\u0080\u0099t sent home,â\u0080\u009d Polking said. â\u0080\u009cWe have this two week space where we have a chance to get things back on track.â\u0080\u009d Jenkins announced that the school would be holding all undergraduate classes remotely for at least the next two weeks after what he described as a â\u0080\u009cdramatic increaseâ\u0080\u009d in positive COVID cases associated with the school. As of Wednesday, officials reported 222 positive cases out of 1,287 tests conducted since Aug. 3. Since the address, in which Jenkins also said that only residents would be allowed in the dorms and that students living off-campus should stay off campus for the next two weeks, morale has been â\u0080\u009cdepressingly low,â\u0080\u009d Polking said.Â Some students are blaming each other for not abiding by public health guidelines â\u0080\u0094 officials have said that many of the positive cases came from gatherings off-campus â\u0080\u0094Â while others are upset with the schoolâ\u0080\u0099s administration, Polking said.Â â\u0080\u009cItâ\u0080\u0099s really just a lot of finger pointing,â\u0080\u009d she said. â\u0080\u009cI want to say itâ\u0080\u0099s not productive, but thereâ\u0080\u0099s not really much productive stuff we can do right now.â\u0080\u009dÂ As of early afternoon on Wednesday, Polking said she hadnâ\u0080\u0099t left her dorm room. In addition to pivoting to remote instruction, Jenkins announced that the school would close public spaces on campus. Clubs have cancelled in-person gatherings, Polking said.Â She doesnâ\u0080\u0099t expect to be leaving her dorm much at all except to pick up grab-and-go meals from the dining hall, she said.Â Though she was able to attend her Wednesday morning classes in her pajamas, Polking, a neuroscience major, said sheâ\u0080\u0099s disappointed that sheâ\u0080\u0099s now forced to study remotely. â\u0080\u009cBeing in class is a better way to learn,â\u0080\u009d she said.Â Last week, Polking said sheâ\u0080\u0099d been attending classes in person, wearing a mask and sitting several feet away from her fellow classmates while professors continued to broadcast the courses on Zoom ZM, +2.89% for those who didnâ\u0080\u0099t feel comfortable coming in. Polking said she felt safe on campus and that classes seemed to be going pretty well.Â But when she walked off campus a few days ago, Polking said she didnâ\u0080\u0099t feel as comfortable. She saw fewer people wearing masks and they were Notre Dame students, Polking said. â\u0080\u009cItâ\u0080\u0099s pretty clear that the administration could have done more,â\u0080\u009d to prevent an outbreak, such as devoting more resources to testing and isolating students, Polking said. In a message on Tuesday following Jenkinsâ\u0080\u0099 announcement, officials said that the number of positive cases in the first week of classes â\u0080\u009cfar exceeded our estimates,â\u0080\u009d and added thatÂ â\u0080\u009cwe were not able to respond to all student calls in the personal way we pride ourselves on at Notre Dame.â\u0080\u009dÂ At the same time, itâ\u0080\u0099s difficult to blame officials for the behavior of students who have acted selfishly by going out and partying, even if the administration should have anticipated that behavior, Polking said.Â â\u0080\u009cThereâ\u0080\u0099s been a lot of student reaction on social media where so many people are just posting â\u0080\u0098wear a mask, stay home.â\u0080\u0099 Students are saying this is our one chance,â\u0080\u009d Polking said of activity following Jenkinsâ\u0080\u0099 address. â\u0080\u009cPeople are going to be more motivated not to go out and party, thatâ\u0080\u0099s my hope.â\u0080\u009dÂ If the school does decide to send students home as universities across the country did in March, Polking isnâ\u0080\u0099t sure what she would do. Sheâ\u0080\u0099d try to find a place to go other than back home to Charlotte, North Carolina.Â â\u0080\u009cI love my family, theyâ\u0080\u0099re great, but Iâ\u0080\u0099d be sharing a room with at least one of my sisters,â\u0080\u009d she said.Â â\u0080\u009cMy three-year-old sister really doesnâ\u0080\u0099t understand what taking an exam means. If she decides to freak out or be a three-year-old, sheâ\u0080\u0099s going to do that and thatâ\u0080\u0099s really terrible for my concentration.â\u0080\u009d Greear Webb, sophomore at University of North Carolina Chapel Hill Though his college was planning to hold classes in person, Greear Webb decided in early August that he would be taking his fall semester courses online.Â â\u0080\u009cMy initial decisions were really just based on safety â\u0080\u0094 my personal safety, the safety of my family and my peers,â\u0080\u009d said Webb, 19. â\u0080\u009cI just did not feel that UNC Chapel Hill had the necessary precautions to keep us safe.â\u0080\u009d The school announced Monday that it would hold all undergraduate courses remotely after reporting multiple clusters of positive COVID cases in on and off-campus housing. When officials made the announcement Monday, 177 students were in isolation and 349 were in quarantine.Â Greear Webb is a sophomore at UNC Chapel Hill, which decided to hold classes remotely after reporting multiple clusters of positive COVID cases. Webb is co-chair of the political action committee of the schoolâ\u0080\u0099s Black Student Movement and also serves on the Commission on Campus Equality and Student Equity, a group formed this summer to address concerns of racial, economic and educational equity at UNC. Webb said he and other student leaders have expressed concerns for months about the idea of returning to campus.Â Employees were worried too. UNC Chapel Hill faculty wrote to students in early August asking them to stay home and a group of workers filed a lawsuit against the University of North Carolina system over its decision to hold classes in person, including at Chapel Hill, its flagship campus.Â In a statement announcing the shift to remote learning, UNC Chapel Hillâ\u0080\u0099s Chancellor Kevin M. Guskiewicz wrote that officials â\u0080\u009cunderstand the concern and frustrations these changes will raise with many students and parents.â\u0080\u009d â\u0080\u009cAs much as we believe we have worked diligently to help create a healthy and safe campus living and learning environment, the current data presents an untenable situation,â\u0080\u009d he wrote. Webb said heâ\u0080\u0099d expected that returning to Chapel Hill for in-person instruction and keeping students, faculty and staff safe would be difficult because â\u0080\u009ccollege is a place of congregating â\u0080\u0094 thatâ\u0080\u0099s the whole purpose, to learn together.â\u0080\u009d Thatâ\u0080\u0099s in part why he decided to start his sophomore year from home in Raleigh, North Carolina and why he and other student leaders warned about an in-person fall semester.Â â\u0080\u009cI believed that the short-term sacrifice would be worth it,â\u0080\u009d Webb said because it would mean the community could move more quickly to seeing each other in person, safely. â\u0080\u009cThe fact that weâ\u0080\u0099re basically delaying that by waiting so late to make this decision to go online is really troubling and upsetting.â\u0080\u009dÂ Webbâ\u0080\u0099s fellow students still in Chapel Hill are â\u0080\u009cscramblingâ\u0080\u009d he said. The school has asked students living on campus to â\u0080\u009cmake plans over the next week to return to their permanent home for the fall semester unless they are unable to do so,â\u0080\u009d even as class remained in session. University officials announced that theyâ\u0080\u0099d be pausing undergraduate courses on Monday and Tuesday to help students during the transition to remote classes. Â â\u0080\u009cI have many friends calling and texting and saying theyâ\u0080\u0099re anxious,â\u0080\u009d Webb said.Â Â"}]}