{"article": [{"url": "https://www.marketwatch.com/story/dont-count-trump-out-yet-heres-how-he-can-still-win-in-november-2020-06-30", "published": 1593857360.0, "headline": "Don't count Trump out yet - here's how he can still win in November", "body": "This election is over. Trump is so far behind, he's such a buffoon, he doesn't have a chance. Sound familiar? It should, because that's what most people were saying back in the summer of 2016. How'd that work out? Now the New York/Washington/Left Coast elites are at it again. Stick a fork in the Donald, they cackle - he's done! Is it different this time? Or can Trump shock the world again? There are tons of reasons why Trump should not win. He's failed on most of his big promises. There's no wall. The national debt, which he vowed to eliminate (through trade deals) has exploded. Meantime, Iran and North Korea are more dangerous than ever. He's the Mount Everest of dishonesty. Not only has he not drained Washington's swamp as promised, he's made it swampier than ever. Numerous associates have been indicted, convicted, pled guilty, tossed in the can, abused the public trust, and more. Trump said he only hires \"the very best,\" and this is what we get? 'I really don't care do U?' But guess what? Millions of Americans don't seem to care. They've always known that Trump was a stooge. Here are three takeaways from 2016 exit polls conducted by CNN: â\u0080¢ Just 1 in 3 thought Trump was honest and trustworthy â\u0080¢ Less than 2 in 5 had a favorable opinion of him â\u0080¢ Barely a third - 35% - said he had the right temperament for the job And he still got 63 million votes! This says as much about the American electorate as it does about Trump. Lots of Trumpers know the president's a jerk. They know he's rude, crude, and embarrasses himself on Twitter. And yet they say he gets stuff done. He got tax cuts, two Supreme Court justices, and (through June 1) nearly 200 of his appointees have been put on the federal bench. Trump could lose in November but his mark on American society will endure well into mid-century through these judges. Trump's base loves him for these things, and most of them-but not all-will vote for him again. Narrow path to re-election As Trump and four other presidents have shown, you don't have to win the popular vote to win the presidency. He won't win it this year, either. The question: Can he win the Electoral College? The president's path has narrowed considerably. According to the well-regarded Crystal Ball-put out by the University of Virginia's Center for Politics-Joe Biden, soon to be coronated as the Democratic nominee, has 268 \"safe, likely, or leaning\" electoral votes, while Trump has 204. There are only four states, the Crystal Ball says, that remain true toss ups: Florida, North Carolina, Arizona and Wisconsin. Together, they have 65 electoral votes. The current prediction for the 2020 presidential election from Larry Sabato's Crystal Ball shows Democrat Joe Biden with a big but not insurmountable lead over President Donald Trump. Center for Politics Biden only needs one of these, and leads in all four by an average of 3.8 points (median 5.1) But Trump needs them all, the poker equivalent of drawing an inside straight. Not impossible, but highly improbable. That would get him to 269, enough to win. There is also the oddity of two states-Maine and Nebraska-which do not allocate their electoral votes in winner-take-all fashion. It's too complicated to explain here, other than to say a single electoral vote in say, Maine, could tip the entire election. Why can a candidate win with 269 and not 270? Because an Electoral College tie (extremely unlikely) would be decided by the incoming House of Representatives, with each state delegation getting one vote. Right now, this favors Republicans. Even though they have fewer House seats overall, the GOP controls 26 state delegations to the Democrats' 23 (Pennsylvania is evenly divided). So if it came down to a House vote, whichever party controlled the most state delegations in the new Congress would pick the president. The Democrats would have to wrest control of at least three more state delegations, and they could do just that. Making all this even more bizarre: the Senate would pick the vice president. Right now the GOP controls the Senate. What if one party picked the president and another the vice president? It simply doesn't get any stranger than this. But again, this is all quite unlikely. Biden appears to be in the driver's seat as we approach the four-month mark. So what can Trump do to get there? The economy, the virus, or? To state the obvious: A coronavirus cure would help (not that he would have anything to do with it), as would clear evidence that the economy is on the mend. But first-quarter gross domestic product was -5.0%. That's bad, but the second quarter-which (so far) saw the worst of the coronavirus-looks downright apocalyptic: perhaps -39.5%, according to an estimate issued last week by the Atlanta Federal Reserve. The third quarter, which begins Wednesday, could be great-and the first reading on that could mean good news for Trump just days before the election. On the other hand, with the virus now ravaging big states like Texas and Florida, this is far from certain. Trump can hope that voters don't blame him for the economic shutdown. He's blames the governors, which is largely true, but if that's the case, then the president is throwing two swing-state Republicans under the bus: Florida's Ron DeSantis and Arizona's Doug Ducey. The president could also try to convince voters that his tariffs and trade wars have been a good thing. But tariff is just another word for taxes on the end user, and there's plenty of data that adds to the president's vulnerability. Go dirty Trump also has another, often ignored disadvantage. Many of his 2016 voters weren't so much voting for him as they were voting against Hillary Clinton. The percentage of Americans who have a \"very negative\" view of Biden is about 25%, whereas Clinton's at this point in 2016 was about 42%. Trump has failed to paint \"Sleepy Joe\" as a monster the way he did \"Crooked Hillary,\" and I suspect he won't be able to. I think the best path for Trump, sadly, may be to do what he does best: go dirty. He has admitted that he can't win with mail-in balloting, so what does Trump (who votes by mail himself) do? He claims it's rife with fraud. This is a huge lie. There have also been state-level efforts to purge voter rolls and reduce the number of polling places, measures that disproportionately hurt minority voters. Trump squawked that 2016 was rigged (until he won), and we're beginning to hear similar talk again. And even though Trump seems to think that the coronavirus has gone away, the fact is it could cause problems like understaffed polling places, leading to long lines and chaos."}]}