{"article": [{"url": "https://www.marketwatch.com/story/consumer-spending-climbs-in-august-for-fourth-month-in-a-row-but-at-a-slower-pace-2020-10-01", "published": 1601569460.0, "headline": "Consumer spending climbs in August for fourth month in a row, but at a slower pace", "body": "The numbers: Americans ratcheted up their spending in August for the fourth month in a row in a good sign for the economy, but the increase was the smallest since the U.S. reopened and pointed to a slower recovery. Consumer spending rose 1% in August, the government said Thursday, matching the forecast of economists polled by MarketWatch. Slower spending stemmed largely from the end of a massive infusion of federal aid for the unemployed. Incomes declined by 2.7% — the biggest drop since early in the pandemic — after an extra $600 jobless stipend expired. Wages and salaries rose, however. What’s more, many households boosted savings early in the pandemic, giving them more cushion to spend. The savings rate fell again to 14.1%, but it’s still almost twice as high as it was before the pandemic. The return of millions of people to the workforce and the reopening of more businesses has also kept spending on the up and up. Read:U.S. jobless claims fall to six-month low of 837,000 — but there’s a California catch What happened: Consumers spent more in August at restaurants and hotels, the government said. These are the sort of discretionary purchases that tend to reflect greater confidence in the economy. Consumers go out to eat and travel less when they are anxious. Read: Consumer confidence surges to highest level since start of coronavirus pandemic Households also spent more on medical care. Spending is still about 4% lower compared to the last month before the pandemic, however. A closely watched measure of inflation, meanwhile, rose sharply for the third straight month as prices recovered from a big drop early in the pandemic. The PCE index, the Federal Reserve’s preferred inflation barometer, rose 0.3%. The yearly rate of inflation was still quite tame, however, at 1.4%. It was running close to 2% just a few months before the disease spread to the United States. A separate measure of inflation that strips out food and energy, known as the core rate, also rose 0.3% in August. It’s risen just 1.6% in the past year, however. See: MarketWatch Economic Calendar Big picture: Many economists worry spending will slow further unless the government provides more support for the unemployed. A $600 federal stipend ran out at the end of July after Democrats and Republicans deadlocked on a new financial rescue package. Yet the economy has also shown a lot of resilience, other analysts say, and it’s likely to keep expanding even if Washington doesn’t come through with another big financial-aid package. Business restrictions across the country are gradually being lifted and the economy is adding more jobs than it’s losing. Read:U.S. manufacturers expand for fifth month in a row, ISM finds, and maintain momentum What they are saying? “Despite slowing momentum, the reduction in unemployment benefits, U.S. consumers are still in decent financial shape,” said senior economist Jennifer Lee of BMO Capital Markets. “This suggests that [the third quarter] is going to be stronger than many expected.” Market reaction: The Dow Jones Industrial Average DJIA, +0.56% and S&P 500 SPX, +0.87% rose in Thursday trades."}]}