{"article": [{"url": "https://www.marketwatch.com/story/still-far-from-mission-accomplished-economists-react-to-june-jobs-report-2020-07-02", "published": 1593684500.0, "headline": "'Still far from mission accomplished' - economists react to June jobs report", "body": "The June jobs report on Thursday showed the U.S. economy added 4.8 million jobs last month, with the unemployment rate falling to 11.1% from 13.3%. Economists polled by MarketWatch had expected a gain of 3.7 million jobs and an unemployment rate of 12.5% See:U.S. regains 4.8 million jobs in June and unemployment falls to 11.1% Below are some initial reactions from analysts and economists, as U.S. stocks SPX, +0.87%  DJIA, +0.56%  traded sharply higher following the data. â\u0080¢ \"Today's jobs report reflects the continued bounce-back of the economy from the depths of the crisis. But the paradox of these times means that the 4.8m in job growth, which is the fastest in history, is still far from mission accomplished.\" - Adam Ozimek, chief economist at freelancing platform Upwork â\u0080¢ \"It is terrific news that the economy is reopening and people are headed back to work but no one thought that all those temporary layoffs would be permanent. The real slog will be getting those who need to find new jobs back to work and we haven't even really begun that process.\" -Betsey Stevenson, professor of public policy and economics at the University of Michigan and former chief economist at the Labor Department â\u0080¢ \"The job gains in June were highly concentrated in the leisure and hospitality sectors, especially in food services and drinking places, with almost a third of the gains happening in those industries. While it's great to see job growth in the sector that was directly in the line of the coronavirus, leisure and hospitality employment is still 29% below pre-pandemic levels. With virus cases spiking and businesses potentially closing once again, these gains in employment may not be sustainable moving forward.\" -Nick Bunker, economic research director at jobs website Indeed â\u0080¢ \"Even with the gain in June, payrolls have only recouped about a third of the jobs lost over March and April. And given that COVID-19 cases have been rising again in some parts of the country, resulting in the delaying/reversal of reopening plans, even the partial rebound in jobs during May and June could be viewed as too much, too soon, relative to the virus spread.\" -Andrew Grantham, senior economist at CIBC â\u0080¢ \"An encouraging and better than expected gain of 4.8M jobs in June continued to eat away at the virus-related hole of 22M jobs. Still another 14.7M left to go. Let's see how much of a stall unfolds in July as many states pause re-openings.\" -Steven Rattner, who ran the Obama administration's auto task force â\u0080¢ \"Payrolls came in very strong, smashing consensus by ~1.6 mln. The majority of the payroll gain was concentrated in leisure & hospitality (+2.1 mln) which was the hardest hit sector in the COVID lockdowns. Retail was also big (740K) as shops started to reopen.\" -Thomas Simons and Aneta Markowska, economists at Jefferies"}]}