{"article": [{"url": "https://www.marketwatch.com/story/okta-stock-wobbles-after-earnings-beat-11598559253", "published": 1598605040.0, "headline": "Okta stock wobbles after earnings beat", "body": "Okta Inc. OKTA, -0.47% shares shifted between gains and losses in the extended session Thursday after the identity-management services company topped Wall Street estimates on its quarter and outlook. Okta shares, which had been up 6% at one point in Thursday’s after-hours session, were recently down about 4% premarket Friday. This follows a 2.6% decline in Thursday’s regular session to close at $218.44. The company, which makes software that helps workers to sign into network applications, reported a second-quarter loss of $60.1 million, or 48 cents a share, compared with a loss of $43 million, or 37 cents a share, in the year-ago period. Adjusted earnings, which excludes stock-based compensation expenses and other items, were 7 cents a share, versus a loss of 5 cents a share in the year ago period. “The three mega-trends that have been driving our business for the past several years — the adoption of cloud and hybrid IT, digital transformation, and zero-trust security — are all being accelerated globally by the current environment,” said Todd McKinnon, chief executive and Okta co-founder, in a statement. Revenue rose to $200.4 million from $140.5 million in the year-ago quarter. Analysts surveyed by FactSet had forecast an adjusted loss of 2 cents a share on revenue of $186.3 million. Okta expects an adjusted third-quarter loss of 2 cents to 1 cent a share on revenue between $202 million and $203 million, while analysts had forecast a loss of 5 cents a share on revenue of $195.7 million. Okta’s big COVID-19 bump came in the first quarter, ending April 30, with just a little bit of that coming in the second quarter, Chief Operating Officer Frederic Kerrest told MarketWatch in an interview. “The bigger thing is that this is going to accelerate digital transformation and how people are going to do e-commerce and all kinds of things much more so than anything else,” Kerrest said. Kerrest said usage of one of Okta’s products, Multi-Factor Authentication, or MFA, has tripled from a year ago, and that the company saw a daily peak of 150 million logins a few months ago, and expects to continue to see those type of numbers going forward. Okta’s earnings follows those of Salesforce.com Inc. CRM, +2.21%, as the cloud-based customer relationship-management software company posted record revenue as more businesses picked up the pace of their digital transformations because of COVID-19."}]}