{"article": [{"url": "https://www.marketwatch.com/story/michelle-obama-blames-trump-for-contributing-to-her-low-grade-depression-2020-08-05", "published": 1596648980.0, "headline": "Michelle Obama blames Trump for contributing to her depression", "body": "Former first lady Michelle Obama opened up about her struggles with a “form of low-grade depression” in a new episode of her podcast posted on Wednesday. She pinned some of the blame on President Donald Trump, but said it runs deeper than that. “ ‘I’d be remiss to say that part of this depression is also a result of what we’re seeing in terms of the protests, the continued racial unrest, that has plagued this country since its birth. I have to say that waking up to the news, waking up to how this administration has or has not responded, waking up to yet another story of a Black man or a Black person somehow being dehumanized, or hurt or killed, or falsely accused of something, it is exhausting. And it has led to a weight that I haven’t felt in my life, in a while.’ ” That’s Obama explaining her current funk to Michelle Norris, a former NPR host. “The hypocrisy of it, day in and day out, is dispiriting,” Obama added. She said she deals with the negativity by sticking to a routine, a tool she picked up during her many years navigating the White House spotlight. Still, it’s not easy. “I’m waking up in the middle of the night, ’cause I’m worrying about something, or there’s a heaviness,” she said. “I try to make sure I get a workout in, although there have been periods throughout this quarantine, where I just have felt too low... I’ve gone through those emotional highs and lows that I think everybody feels, where you just don’t feel yourself.” Obama, of course, isn’t alone. A recent study by the National Center for Health Statistics found that a third of Americans are showing signs of clinical anxiety and depression during the pandemic. Obama said that family time helps, though her husband and children usually spend the day apart before coming together each evening for dinner and other activities. “Puzzles have become big,” she said. “The girls are into them. We’re all sitting on the floor around the table where the puzzle is now permanently set up and then we sit down for dinner.”"}]}