{"article": [{"url": "https://www.marketwatch.com/story/snowflake-ipo-surge-makes-it-the-priciest-tech-stock-by-a-mile-11600294394", "published": 1600280480.0, "headline": "Snowflake IPO surge makes it the priciest tech stock by a mile", "body": "Snowflake stock began trading Wednesday on the New York Stock Exchange. NYSE Snowflake Inc.’s record initial public offering gives the company an eye-popping valuation that makes other frothy technology names look cheap by comparison. Shares of Snowflake SNOW, -0.91% surged 111.6% in Wednesday’s session after the company produced the largest software IPO on record. The stock’s big rally, which came after Snowflake priced its offering above an already-raised range, left the company with a market value of roughly $70 billion, more than five times the private-market valuation of $12.4 billion that it fetched in February. The company has become the largest by market value to ever double on its first day of trading, according to Dealogic data that goes back to 1995. Snowflake IPO: 5 things to know about the Berkshire-backed company after its record software offering Investors poured into Snowflake’s stock in a hot period for initial public offerings, giving the company a rich valuation even by the standards of high-flying tech names. Snowflake generated $403 million in revenue over the past four quarters by offering database software for the cloud, leaving it with a market capitalization-to-sales ratio of about 175x. Snowflake’s first-day pop makes it the priciest technology name by that metric, based on an analysis of data from FactSet that looked at companies with more than $400 million in annual revenue. Zoom Video Communications Inc. ZM, +2.89% held the crown for the most expensive tech stock by many metrics, but its ratio of market value to sales for the past four quarters is just half of Snowflake’s, at roughly 87x. Zscaler Inc. ZS, +2.91%, another hot cloud-software name, has a valuation of about 39 times its sales. Snowflake opened at 98 times its enterprise value to estimated revenue for the next 12 months, according to independent technology investment analyst Beth Kindig. FactSet doesn’t yet provide forward-looking revenue estimates for Snowflake. That compares with 31 times for Zoom on its opening day of trading and 23 times for CrowdStrike Inc. CRWD, +0.42% when the cybersecurity company made its market debut, Kindig said. Both of those companies peaked at just over 40 times in their first months of trading. iframe.twitter-tweet { width: 100% !important; } Snowflake sold 28 million shares to raise $3.36 billion through its offering, and Berkshire Hathaway Inc. BRK.A, +0.06% BRK.B, +0.24% and Salesforce.com Inc. CRM, +2.21% each agreed to purchase $250 million in shares at the IPO price concurrently, pushing the total to $3.86 billion. Underwriters have the option to purchase 4.2 million more shares, which could bring the amount that Snowflake ultimately raises up to $4.4 billion. “The attention around Snowflake’s IPO is great example of how accelerated cloud-computing adoption is making companies involved in the space more valuable, particularly those that make navigating virtualization easier,” wrote Andrew Little, a thematic research analyst at Global X who covers the cloud. In what’s shaping up to be the busiest week for initial public offerings since Uber Technologies Inc. made its debut in May 2019, Israeli software company JFrog Ltd. FROG, +0.85% joined Snowflake with its Wednesday trading debut. U.S.-listed shares of JFrog, which makes software for developers, finished the session up 47%. Read: Red-hot IPO market sends Snowflake surging and JFrog leaping, with more software companies to come Snowflake’s IPO came as the Renaissance IPO ETF IPO, +1.98% has risen 59% on the year and as the S&P 500 SPX, +0.87% has gained about 5%."}]}