{"article": [{"url": "https://www.marketwatch.com/story/why-stock-market-investors-are-starting-to-freak-out-about-the-2020-election-11600964863", "published": 1601117300.0, "headline": "Why stock-market investors are starting to freak out about the 2020 election", "body": "Less than a month and a half from the 2020 presidential elections and investors are starting to get panicky about the race for the White House and what that presidential contest means for already rocky markets in the coming weeks. However, it isn’t the outcome that appears to be causing trepidation on Wall Street: Investors can position for a win by Democratic challenger Joe Biden or a second term for President Donald Trump. It is the growing sense that results of the election won’t be decided on Nov. 3; and on top of that that, it is the possibility that even if a winner can be identified in the race between former Vice President Joe Biden and incumbent President Donald Trump, a transition won’t be a smooth one. “It’s a real fear—and one that, in many respects, I share,” wrote Brad McMillan, chief investment officer for Commonwealth Financial Network in a Wednesday note. “The fear is that if we get a disputed election, it could lead to disruption and possibly even violence. If so, we could well see markets take a significant hit,” McMillan wrote. Art Hogan, National Securities chief market strategist, told MarketWatch on Thursday that he was primarily fielding questions around election volatility from clients. “That’s the No. 1 question we get right now,” the strategist said. “How will the election affect the market and the economy?” “It is natural to have a great deal of trepidation heading into November,” Hogan said. “This is a unique situation insomuch as the pandemic is likely to produce a lot more mail-in votes and it is more difficult to get your arms around what will happen.” Late Wednesday, Trump may amplified anxieties on Wall Street by implying that he may not peacefully relinquish power to Biden, should the Democrat prevail in the coming election. “Well, we’re going to have to see what happens,” he told reporters at news briefing at the White House on Wednesday when asked if he would commit to a peaceful transition of power. Read: Historian who has accurately called every election since 1984 says Biden will beat Trump in 2020 race Trump has claimed that mail-in ballots, which will become a central feature of this election due to the efforts to reduce the spread of the COVID-19 pandemic by limiting in-person voting, could undermine the election outcome. The 45th president appeared to urge states to dispense with mail-in votes in favor of Americans physically going to polling stations. Get rid of “the ballots and you’ll have a very…there won’t be a transfer, frankly. There’ll be a continuation,” Trump said. “The mail-in ballots are out of control.” “Investors continue to ask me if they should get out of the market to ‘sit out this election,’ wrote Brian Levitt, Invesco’s global market strategist, in a Wednesday research note. Levitt tells investors to resist the impulse to cash in their chips ahead of this election. However, the fear of seismic swings in the market is palpable. That’s particularly, after September has delivered on its promise as the worst month for stocks and October, the second-worst month, looms large. A lack of additional stimulus for those out-of-work Americans, hit hardest by the coronavirus outbreak, a lack of clarity on what more the Federal Reserve will do to help calm investor jitters and a feeling that the market enjoyed too brisk a run-up in the aftermath of the worst of the pandemic-induced selling is part of the cocktail contributing to the current unease, experts say. The S&P 500 index SPX, +0.87% has climbed nearly 45% since hitting a bear-market low in late March, but the broad-market index is currently attempting to avoid a jaunt into correction territory, commonly defined as a drop of at least 10% from a recent peak. The Nasdaq Composite COMP, +1.39%, which already stumbled into correction earlier this month, has climbed 55% since its March lows and the Dow Jones Industrial Average DJIA, +0.56% has advanced by about 44% since that time. Concerns about outsize volatility related to the election prompted Interactive Brokers to demand that its clients put up more money in making leveraged bets on financial securities heading into November. “Elevated option implied volatilities indicate that the markets will be confronting elevated volatility both before and after the November 2020 election,” the brokerage wrote in a note to clients. Related: Contrarians bet against election volatility, arguing market swings likely to be less extreme than feared Charlie McElligott, a popular equity derivative strategist at Nomura, who has called a number of recent volatility shocks in the market, said that some traders see the election as a “generational” opportunity, setting up the derivatives market for some make-or-break trades. “This also likely means that some brave [volatility] traders will try to take advantage as a perceived ‘generational’ opportunity to sell this POST- NOV election ‘richness’ (Dec / Jan) — could be a career ‘maker or breaker,'” he wrote in a recent report. He said trading around the election holds the potential for some to see “monster returns if the event were to pass and all that crash is puked back into the ether…or conversely be turned to dust into a God-forbid realization of chaos, with civil disorder, dual claims to the throne etc.,” DJ Peterson, the president of Longview Global Advisors, an Los Angeles-based geopolitical consulting firm, outlined for MarketWatch a number of potential risk scenarios that he’s looking at tied to the election. Voting results delayed past 48 hours (72 max) Trump claims the vote counting process and/or certified results are rigged, fraudulent Left-and right groups converge on election offices, police caught in between Left and right groups clash in the streets of Washington Trump calls out the military to restore order or protect the White House Use of military is viewed as defending Trump, military is politicized Peterson described the above as “primary risk factors.” and he sees these as the highest risk scenarios in which the election is too close to call and is bogged down in recounts a la 2000. Indeed, the 2000 presidential election wasn’t decided until mid-December as lawyers and surrogates for Democrat Al Gore and Republican George W. Bush engaged in a battle over Florida recounts that made everyone an expert on butterfly ballots and the varieties of chad produced when voters punch ballots. MarketWatch’s William Watts reports that the S&P 500 tumbled more than 8% between the Nov. 7 election in 2000 and the Dec. 15, when the winner was finally decided (see attached chart): Twenty years later, Hogan says that this time it will be “impossible to know what the final results will be and what combination of Congress and White House will look like.” Hogan agrees with the notion that investors should say invested in this market but advocates rebalancing as a good method, in which investors sell some their biggest winners, like megacap technology shares, and reposition in some of the more beaten up categories like banks or other cyclicals. “I’m not going to tackle you at the door” if you want to sell some but “I favor rebalancing,” Hogan said. He also notes that the election itself takes a back seat to the overall economic recovery from the pandemic and treatments and remedies for the pandemic are still going to be a key driver."}]}