{"article": [{"url": "https://www.marketwatch.com/story/the-stretch-ira-estate-planning-strategy-is-gone-here-are-4-other-options-11599145076", "published": 1599131120.0, "headline": "The 'stretch IRA' estate planning strategy is gone. Here are 4 other options", "body": "Here are some tax-smart estate planning alternatives for well-off folks who would have loved to use the Stretch IRA strategy, but no longer can. Getty Images/iStock The COVID-19 era is a mess, and we're still in the middle of it. But life goes on. So, let's be more open to doing what we would do in more normal times. What I normally do is give tax advice. Here's some updated estate planning advice for well-off folks to consider.  Evaluate \"stretch IRA\" alternatives   The Setting Every Community Up for Retirement Enhancement Act (SECURE Act) became law last December. The legislation was mainly intended to expand opportunities for people to increase their retirement savings. Good idea. But the SECURE Act also included one big anti-taxpayer change that severely curtailed the so-called \"stretch IRA\" estate planning strategy. That strategy was employed by many well-off IRA owners. For details on how the Stretch IRA deal worked and how the SECURE Act impaired it, see my earlier column . In this column, I'll cover some tax-smart estate planning alternatives for well-off folks who would have loved to use the Stretch IRA strategy but no longer can. Here goes, starting with some necessary background information.  The estate planning lay of the land For 2020, the unified federal gift and estate tax exemption is a whopping $11.58 million or effectively $23.16 million for married couples. Under current laws, cumulative lifetime gifts and estate values in excess of the exemption are taxed at a flat 40% rate, which is a low rate by historical standards. As long as the current federal gift and estate tax regime remains in place, relatively few individuals will be affected by the federal gift or estate tax. Therefore, it's appropriate to look at strategies that reduce income taxes, which affect almost everybody of means. So, let's focus on wealth-transfer strategies that: (1) can reduce or postpone federal income taxes (and often state income taxes too, depending on where you live) and (2) will generally not do any harm under the current federal gift and estate tax regime. The semi-stretch Roth IRA strategy As I explained here the SECURE Act established a new 10-year account liquidation rule for most non-spouse beneficiaries who inherit IRAs in 2020 and beyond. While this was not a taxpayer-friendly development, let's maintain some perspective. Even after the SECURE Act, Roth IRAs left to non-spouse beneficiaries can earn federal-income-tax-free income and gains for as long as the account owner lives and for at least 10 years thereafter. That can work out pretty well. See the example later in this column.Refresher on Roth IRA tax advantages Remember that Roth IRAs have two big advantages over traditional IRAs as a tax-favored wealth transfer vehicle.Roth advantage No. 1 The first and biggest advantage is that qualified withdrawals from a Roth IRA are completely free of any federal income tax. As long as all withdrawals are qualified withdrawals, the original account owner will never owe Uncle Sam a dime of federal income tax, regardless of the amount of income and gains that accumulate in the Roth account -assuming our beloved Congress doesn't change the rules.  If you leave your Roth IRA to your spouse, he or she can treat the inherited account as his or her own Roth IRA and continue the federal-income-tax-free wealth accumulation program. If you leave your Roth IRA to someone other than your spouse, that person (the account beneficiary) can continue accumulating tax-free earnings for at least 10 years and can take federal-income-tax-free withdrawals too. In a nutshell, qualified Roth IRA withdrawals are those that are taken after: (1) the original account owner has reached age 59½, died, or become disabled and (2) the original account owner has had at least one Roth IRA established in his or her name open for more than five years. Withdrawals from an inherited Roth IRA that meet these two requirements will be federal-income-tax-free qualified withdrawals.  Roth advantage No. 2 During your life as the original Roth IRA owner, your Roth IRA is exempt from the required minimum distribution (RMD) rules that make you take annual withdrawals from other tax-favored retirement accounts, such as traditional IRAs, and pay the resulting tax hit.  Spousal Roth IRA beneficiaries still occupy tax-favored position If you leave your Roth IRA to your surviving spouse, he or she can retitle the account and treat it as his or her own Roth IRA. Your spouse need not take any RMDs from the inherited Roth account for as long as he or she lives. Non-spouse Roth IRA beneficiaries still in pretty good shape When a non-spouse beneficiary inherits your Roth IRA, he or she generally must liquidate the account within 10 years, subject to some exceptions explained here. While the 10-year account liquidation rule is unfavorable compared to what was allowed before the SECURE Act, many non-spouse beneficiaries will want to liquidate their inherited Roth IRA balances within 10 years anyway. For them, the 10-year rule is a non-issue.        Roth IRA conversion can still be tax-smart estate planning move OK, you now understand that the SECURE Act's 10-year account liquidation rule is not damaging enough to disqualify the Roth IRA as a tax-smart wealth transfer vehicle. So, onward. Usually, the only way to quickly get a substantial amount of money into a Roth account is by converting an existing traditional IRA into a Roth. Of course, you must pay a tax price to jump-start your Roth IRA savings program. Even so, a conversion will often be worth the price. Here's the deal. A Roth conversion is treated as a taxable distribution from your traditional IRA. You are deemed to receive a taxable cash payout from the converted traditional IRA, with the money going into the new Roth account. Therefore, the conversion triggers income taxes. In most cases, however, this negative factor can be offset by the following.Lower conversion cost (maybe)  Depending on the investments held in your about-to-be-converted traditional IRA, this year's stock market gyrations may mean that the tax cost of converting the account will be lower (maybe much lower) than a few months ago. Lemonade out of lemons.      Multi-year conversion strategy You may be able to significantly reduce the tax cost of converting a large traditional IRA (say one worth several hundred thousand dollars or more) by spreading the conversion process over several years. The tax law allows this, and now is the best time to get started if you believe current tax rates are probably lower than future tax rates. Prepay income taxes for your heir By paying the conversion tax bill, you are effectively prepaying future income taxes for the Roth account beneficiary. The beneficiary can reap federal-income-tax-free earnings in the future, as illustrated in the following example.    Example 1 Paul is 65 when he converts his traditional IRA into a Roth account. He lives 10 more years and never takes any withdrawals. Wife Quito is 70 when Paul dies. Quito inherits Paul's Roth IRA as the designated account beneficiary. According to the current IRS life expectancy table, she can expect to live another 17 years. She treats the inherited Roth IRA as her own account, which means she need not take any RMDs during her lifetime. Assume she doesn't take out a dime. At age 87, Quito passes on and leaves the Roth IRA to daughter Roxy, who was designated as the new account beneficiary when Quito took over the account. Roxy is 50 years old. She must liquidate the account within 10 years after Quito's death, but Roxy is not required to take any withdrawals before that deadline. Any withdrawals taken by Roxy will be free of any federal income tax. Since Roxy is tax-savvy, she withdraws nothing until she hits the 10-year deadline. In this example, following the Roth IRA strategy allowed the family to accumulate federal-income-tax-free earnings for 37 years: 10 years with Paul, 17 years with Quito, and 10 years with Roxy. Not bad!  Key point: In effect, Paul and Quito took advantage of the Roth IRA strategy to establish a federal-income-tax-free source of wealth for Roxy, a member of the next generation. Good idea.Other tax-smart wealth transfer strategies Beyond the strategy of using a Roth IRA as an intergenerational wealth transfer vehicle, there are other tax-smart wealth transfer strategies. Here are some simple-and-easy moves. Use life insurance to transfer wealth tax-free There is generally no federal income tax hit on life insurance death benefits. In other words, the beneficiaries of a policy on your life are allowed to receive death benefit payments totally free of any federal income tax. Make generous gifts to fund Section 529 college savings accounts Under a special tax-law exception, you can make a lump-sum 2020 gift of up to $75,000 to fund a Section 529 college savings account set up for a child or grandchild (or any other college-bound individual) and claim a federal gift tax exclusion for the full amount. This is five years' worth of the standard $15,000 annual exclusion that normally applies to 2020 gifts. Taking advantage of this favorable gift tax rule allows you to quickly fund a Section 529 college account without using up any of your unified federal gift and estate tax exemption. For 2020, the exemption is $11.58 million, or effectively $23.16 million for a married couple. If you are married, your spouse can also use the favorable gift tax rule to make a separate 2020 gift of up to $75,000 to fund a Section 529 account for a child or grandchild (or anyone else) without any federal gift or estate tax consequences. Key point: Like Roth IRAs, Section 529 accounts have a big income tax advantage. Account income and gains are allowed to accumulate federal-income-tax-free and can then be withdrawn federal-income-tax-free to cover qualified college costs. So, a 529 account can function as a tax-smart inter-generational wealth transfer device. Pay college tuition expenses (not room and board) and/or medical bills for loved ones You can give away unlimited amounts for these purposes without any federal tax consequences - as long as this is done by making payments directly to the college or medical service provider. Ditto for your spouse if you are married. Make generous outright gifts to loved ones Under the aforementioned annual federal gift tax exclusion privilege, you can give away up to $15,000 during each and every year to as many individuals as you wish without any adverse federal tax effects. Over time, making these so-called annual exclusion gifts every year can substantially reduce your taxable estate - especially if you give away appreciating assets such as stocks, shares of equity mutual funds, and real estate. You can also make gifts that exceed the $15,000 annual exclusion amount. You will not owe any gift tax on these \"excess gifts\" until they surpass the lifetime gift tax exemption. For 2020, the exemption is a whopping $11.58 million. If you're married, your spouse is entitled to a separate $11.58 million exemption."}]}