{"article": [{"url": "https://www.marketwatch.com/story/coronavirus-update-us-case-tally-edges-closer-to-6-million-and-fda-head-says-he-wont-be-pressured-to-rush-out-a-vaccine-2020-08-31", "published": 1598885300.0, "headline": "Coronavirus update: U.S. case tally climbs above 6 million and FDA head says he won't be pressured to rush out a vaccine", "body": "The number of confirmed U.S. cases of the coronavirus that causes COVID-19 climbed above 6 million on Monday, and the head of the U.S. Food and Drug Administration said he would not be pressured to rush out a vaccine by President Donald Trump before the November presidential election. Dr. Stephen Hahn, FDA Commissioner, told the Financial Times that his agency may make a vaccine available before Phase 3 trials have been completed, but only if it is convinced that the benefits outweigh the risks. Hahn suggested it could do so using its emergency use authorization (EUA), which is not a full approval, but could be put into effect for certain groups, such as health care workers. \"We have a convergence of the Covid-19 pandemic with the political season, and we're just going to have to get through that and stick to our core principles,\" Hahn told the newspaper. \"This is going to be a science, medicine, data decision. This is not going to be a political decision.\" His comments come after a difficult week for the FDA and the Centers for Disease Control and Prevention, with both public agencies facing criticism that they have become increasingly politicized during the Trump administration. Hahn had to admit he misspoke at a press conference accompanied by Trump to announce an EUA for convalescent plasma in treating hospitalized COVID-19 patients, when he described its expected benefits. Trump had criticized the FDA for working slowly on treatments for COVID-19 to stop him being re-elected. Then CDC head Robert Redfield had to walk back a change in guidelines on testing to exclude asymptomatic patients, even if they had been exposed to the virus, after an outcry from doctors and scientists. Ana Santos Rutschman, assistant law professor at Saint Louis University, Lisa Vertinsky, law professor at Emory University in Atlanta, and Yaniv Heled, associate professor of law at Georgia State University in Atlanta, said last week they are worried by the incidents and fear they are not isolated. \"We believe that this episode is symptomatic of a larger problem, and we worry that FDA's repeated departure from evidence-based standards and long-tested and proved procedures will soon translate into a poorly considered authorization of COVID-19 vaccines,\" they wrote in commentary. There was more controversy on Monday, when the Washington Post reported that Scott Atlas, a neuroradiologist from Stanford's Hoover Institution who joined the White House earlier this month as a pandemic adviser, is pushing for the U.S. to adopt the Swedish approach to the crisis of seeking herd immunity. Herd immunity is the notion that once a high proportion of a population has contracted or been vaccinated against an infectious disease, the likelihood of others in the population being infected is drastically reduced. That same approach has left Sweden, which did not lock down or even introduce many restrictions for its citizens, preferring to ask them to voluntarily comply with safety measures, with a far higher case tally and death toll than its neighbors and has been widely criticized by infectious disease experts. Sweden has 57.16 deaths from COVID-19 per 100,000 people, just ahead of the U.S. with 55.95 per 100,000 people, according to data aggregated by Johns Hopkins University. By comparison, neighbor Finland has just 6.07 deaths per 100,000 people, the data show. A Journal of the Royal Society of Medicine report recently concluded that Sweden is nowhere close to achieving herd immunity more than four months into the pandemic. iframe.twitter-tweet { width: 100% !important; } Meanwhile, President Trump over the weekend added to the misinformation that is spreading across the internet on COVID-19, when he retweeted a conspiracy theory that claims the U.S. death toll of more than 183,000 is exaggerated because many of the people who died had underlying health issues and were elderly, as the New York Times reported. The conservative website that originally sent the tweet has criticized key members of the White House Task Force created to manage the pandemic, including Dr. Anthony Fauci, head of the National Institute for Allergies and Infectious Diseases, and Dr. Deborah Birx, coordinator of the task force. Fauci said over the weekend that the pace of enrollment in trials and level of infections in the U.S. mean it is \"conceivable\" that we get an answer to the question of when a vaccine will be available by year-end. In other news: â\u0080¢ German Chancellor Angela Merkel sharply criticized an attempt by protesters angry at coronavirus restrictions to storm the German parliament, saying the \"shameful\" effort was abuse of the right to demonstrate peacefully. Several hundred people tried to gain entrance to the Berlin Reichstag building during a rally in Berlin on Saturday. â\u0080¢ Hundreds of people demonstrated on Sunday in Boston to protest a new state rule mandating flu shots for students. The measure is part of public safety efforts to limit the spread of COVID-19, as well as flu. Massachusetts became the first U.S. state on August 19 to add seasonal flu shots to a list of mandatory vaccines for students. â\u0080¢ Louisiana's COVID-19 data is expected to suffer for several days as the state moves to clean up after Hurricane Laura, causing many testing sites to be closed. Gov. John Bel Edwards said the coronavirus has killed 400 times as many residents of the state as the major storm. In the absence of data, officials are looking to other metrics to gauge the spread, including hospitalizations, which were rising on Friday and Saturday, he said. Louisiana is expected to see an uptick in case numbers, as many residents fled the storm in crowded buses and were photographed not wearing face masks. Louisiana has 148,030 cases and 4,931 deaths, according to a New York Times tracker. â\u0080¢ New Jersey restaurants will be allowed to open at 25% of capacity from Friday, Gov. Philip Murphy said in a tweet. That means they will be able to resume limited service during the coming Labor Day holiday weekend, he said. \"Reopening responsibly will help us restore one of our state's key industries while continuing to make progress against Covid-19,\" iframe.twitter-tweet { width: 100% !important; } Latest tallies There are now 25.3 million confirmed cases of COVID-19, according to the Johns Hopkins data, and at least 847,400 people have died. At least 16.6 million people have recovered. The U.S. has the highest tallies in the world with 6 million cases and 183,258 deaths. Brazil is second to the U.S. with 3.9 million cases and 120,828 deaths. India has 3.6 million cases, and moved ahead of Mexico by number of fatalities at 64,469. Russia has 992,402 cases, Peru has 639,435 and South Africa has 625,056. Mexico has 595,841 cases and 64,158 deaths, or fourth highest in the world. The U.K. has 338,079 cases and 41,588 deaths, the highest in Europe and fifth highest in the world. China, where the illness was first reported late last year, has 89,907 cases and 4,723 deaths. What's the latest medical news? Vir Biotechnology Inc. [ VIR, -1.94%  and GlaxoSmithKline PLC GSK, +1.10% GSK, +1.52%  said they had begun dosing patients in the Phase 2/3 clinical study for their experimental COVID-19 antibody treatment. This double-blind, placebo-controlled trial is testing whether their investigational treatment can prevent hospitalization; it will enroll around 1,300 COVID-19 patients. The companies said they expect to have interim results by the end of the year and complete findings from the trial in the first quarter of next year.What are companies saying? â\u0080¢ AMC Entertainment Holdings Inc. AMC, -2.17% has agreed to sell its Baltic Region theaters to UP Invest, owner of a Baltics cinema group, for about $77 million. The acquisition includes all nine AMC theater locations in Latvia, Lithuania and Estonia, the company said in a statement. \"This transaction marks yet another bold and decisive action taken, on the heels of our capital raising in April and debt restructuring and capital raising in July, to bolster our liquidity and strengthen our balance sheet at a transaction multiple that underscores the inherent value of our theater portfolio and resilience of our business,\" Chief Executive Adam Aron said in the statement. The company is \"encouraged\" by attendance levels at the theaters that have reopened in Europe after being closed during the pandemic, and the roughly 300 that are open in the U.S., where AMC is the biggest operator of cinemas. â\u0080¢ Host Hotels & Resorts Inc. HST, -2.27%  , a real-estate investment trust (REIT) that manages luxury hotels, expects the pandemic to have a \"material negative impact\" on financial results \"well after\" restrictive measures to contain the outbreak have been lifted. The company suspended operations at 35 hotels during the first quarter, and as of Aug. 30, operations at 10 of those hotels are still suspended. During the second quarter and through July, demand was primarily leisure demand at drive-to and resort destinations. For the month ended July 31, the company said the average occupancy at its hotels was 12.9%, the average revenue per available room (RevPAR) was $22.94, the average daily rate was $177.76 and total revenue was $52 million. For reference, the FactSet consensus for third-quarter revenue is $305 million. â\u0080¢ MGM Resorts International MGM, -2.59% is laying off about 18,000 furloughed employees, according to news reports citing a memo from Chief Executive Bill Hornbuckle. The CEO pinned the layoffs on the continued impact of the coronavirus pandemic on travel and leisure. MGM had to send notices to furloughed employees not recalled in six months by law, but plans to rehire them depending on demand. â\u0080¢ Spirit Airlines Inc. SAVE, +1.35% is planning to issue $600 million in five-year bonds via two Cayman Islands-based subsidiaries in a private deal. The notes will be guaranteed by Spirit and certain units, and will be secured by a first priority lien on the discount airline's loyalty program, and other intellectual property. Proceeds will be lent to Spirit after depositing a portion in a reserve account. Airlines have been crushed during the coronavirus pandemic as travelers have stayed away and flights have been grounded. â\u0080¢ United Airlines Holdings Inc. UAL, +0.32%  is permanently getting rid of scheduling change fees on all standard economy and premium seats for all U.S. flights, effective immediately. In addition starting Jan. 1, 2021, standby flights for customers departing the day of their travel, regardless of the type of ticket or class of service, will be free. Members of United's MileagePlus program can confirm seats on a different flight on the same day with the same departure and arrival cities as their original ticket if a seat in the same ticket fare class is available. \"When we hear from customers about where we can improve, getting rid of this fee is often the top request,\" said Chief Executive Scott Kirby. Airlines have been crushed during the pandemic, which has grounded flights and discouraged travelers. See now: Cruise operators took a deep bruising from COVID-19, but history says they will recover"}]}