{"article": [{"url": "https://www.marketwatch.com/story/democrats-score-ginsburg-related-surge-in-donations-after-biden-topped-trump-last-month-in-cash-on-hand-2020-09-21", "published": 1600689980.0, "headline": "Democrats score Ginsburg-related surge in donations, after Biden topped Trump last month in cash on hand", "body": "Democratic fundraising platform ActBlue has reported getting at least $100 million from small-dollar donors in the wake of iconic liberal Justice Ruth Bader Ginsburg’s death on Friday, and that surge in giving coincides with news that the party’s presidential nominee, Joe Biden, started this month with more cash on hand than President Donald Trump. ActBlue tweeted on Sunday morning that people had given $100 million to “candidates up and down the ballot and orgs on the front lines of the impending judicial confirmation fight.” More money likely has come in through Monday morning, with Democratic voters inspired to open their wallets as Trump urges the Republican-run Senate to consider his upcoming nomination “without delay.” Related: Trump says he’ll name Supreme Court pick on Friday or Saturday Opinion:Here’s what has to happen for Trump and McConnell to seat a new Supreme Court justice before Election Day At the same time, Republicans also see political opportunities in another battle over a Supreme Court vacancy, describing it as an “important galvanizing force” for their voters ahead of the Nov. 3 elections. Trump has “an opportunity to change the subject” in a White House race that so far has been a “referendum on him and his handling of the COVID pandemic,” said Capital Alpha Partners analyst James Lucier in a note. Separately, Biden’s campaign and its affiliates have reported $466 million in cash on hand as of Aug. 31. That tops by $141 million the $325 million in cash on hand that the Trump campaign and its affiliates have disclosed. The disclosures of cash on hand come after the two sides announced their fundraising hauls for August in early September, with Biden revealing $364.5 million raised vs. Trump’s more than $210 million. Trump had reported a bigger fundraising haul than Biden in July, and the GOP incumbent previously had enjoyed an advantage in cash on hand."}]}