{"article": [{"url": "https://www.marketwatch.com/story/how-much-more-will-you-get-if-you-delay-social-security-until-age-70-2020-08-06", "published": 1596898280.0, "headline": "How much more will you get if you delay Social Security until age 70?", "body": "I’m devoting this column to a Q&A about waiting until age 70 to begin receiving your Social Security benefits. The almost universal advice from financial planners, of course, is to wait, since your monthly benefit at age 70 will be 32% higher in inflation-adjusted terms than if you claimed at age of 66. But, as some of you have recently written to me to ask, this general advice leaves a number of specific questions unanswered. For example, is this larger benefit at age 70 dependent on continuing to work and pay Social Security payroll taxes for the four years after age 66? If it is not, then what is the point of continuing to work and paying those taxes? 80% of older Americans can't afford to retire - COVID-19 isn't helping For insight I turn to my resident guru about all things Social Security: Andy Landis, the former Social Security Administrator and author of “Social Security: The Inside Story.” In an email, Landis emphasized two separate points: • The increased benefits you receive by waiting until age 70 are not dependent on continuing to work. • However, if you nevertheless continue to work and pay Social Security payroll taxes between age 66 and 70, your monthly benefit at age 70 will be even greater than 32% more. So it’s not the whole truth to simply say, as many do, that your benefits will be 32% higher if you wait until age 70 to claim your benefits. That’s just the minimum. Your monthly benefit could very well be even greater than that. (In the rest of this column, when I refer to the 32% greater benefits you will receive by waiting until age 70, I am referring to inflation-adjusted dollars.) Read: I tested two Social Security calculators — here’s what I found To understand how and why this is, it’s helpful to step back and review how the Social Security Administration calculates your monthly benefit. The formula it uses is based on the 35 years in which you earned the most. If you continue to work after age 66, chances are good that your annual compensation will be higher than in some of the previous years that otherwise were part of your 35 highest-earning years. This is not only because, during the 35 years beginning in our early 30s, most of us will have “low- or zero-earnings past years because of school, family, or layoffs,” according to Landis. It’s also because the Social Security Administration adjusts our past earnings by a low inflation factor, increasing the likelihood that our post-age-66 earnings will be among our 35 highest-earning years. If that is the case, your monthly benefit at age 70 will be higher both because of the 32% step up due to your four-year delay but also because the benefit formula will be keying off a larger base. So you definitely are getting a return on your investment by continuing to work and paying Social Security payroll taxes for the four years after turning 66. (And that return on investment is most likely a very good one, as I’ve described before. Social Security is best viewed as an inflation-indexed annuity, and you’d have to pay a lot more to purchase a comparable product in the private market.) One exception To be sure, Landis pointed out, there is one scenario in which even if you continue to work and pay Social Security payroll taxes you won’t be any better off at age 70 than if you had stopped working at age 66: If none of those four years qualifies as one of the your 35 highest-earning years. But, as I mentioned above, this is a rare scenario. According to Landis, however, even in this rare scenario it still makes sense for the soon-to-be-retiree to continue working after age 66. “She’s preserved her savings by working, and increased her SS by delaying it, making her later retirement years more comfortable. And maybe she loved the work!” Devil in the details As should be abundantly clear by now, if it wasn’t already, the devil is in the details when it comes to calculating what your Social Security benefit will be under different scenarios. And it becomes even more complicated when considering the net impact of various combinations of those details. Landis, who is one of the country’s foremost experts on Social Security, put it this way in an email: “I like to say I’m a ‘student’ of Social Security, rather than an expert, because I, too, keep learning more.” This in turn suggests that you should consult with others when making your decision about when to begin receiving Social Security. Such consultations increase the chances that you won’t overlook some crucial detail that has an outsize impact on the benefits you will receive. Mark Hulbert is a regular contributor to MarketWatch. His Hulbert Ratings tracks investment newsletters that pay a flat fee to be audited. He can be reached at mark@hulbertratings.com."}]}