{"article": [{"url": "https://www.marketwatch.com/story/new-york-gov-cuomo-says-president-trump-has-put-politics-above-public-health-throughout-pandemic-2020-07-13", "published": 1595071580.0, "headline": "New York Gov. Cuomo says President Trump has put politics above public health throughout pandemic", "body": "New York Gov. Andrew Cuomo issued a scathing critique of President Donald Trump’s handling of the coronavirus pandemic on Monday, saying he has denied the reality of the situation from Day 1: “ ‘He said it doesn’t exist, it’s going to go away, by Easter we’ll be reopened, it’s going to go away like a miracle. It didn’t go away, there was no miracle — he denied reality.’ ” — Andrew Cuomo “The federal government,” Cuomo said at a press briefing, “is committing gross negligence.” A key factor, according to Cuomo, is that Trump is putting a political agenda over public health policy. “It’s politically inconvenient in an election year, so he denies it,” he said. “Except you are jeopardizing public health and losing lives by your denial and political agenda.” Cuomo reminded reporters that Trump made a federal emergency declaration concerning COVID-19 back in March but has since left it to individual states to manage the crisis. “If you issue a federal emergency, that means it’s a federal emergency, and who is control of a federal emergency? The federal government. That’s why you have the word ‘federal’ in all those expressions,” he said. Now Trump is “attacking science,” and his own health-care experts, said the governor, referring to Trump’s retweeting on Sunday of two tweets by a former game-show host, Chuck Woolery, who now hosts a conservative podcast. Woolery, best known for his stints on the shows “Wheel of Fortune” and “Love Connection,” accused the Centers for Disease Control and Prevention, the media, Democrats, doctors and others of telling “outrageous lies” about the pandemic to damage Trump’s re-election chances. Cuomo, as he spoke, flashed a picture of Dr. Anthony Fauci, the widely respected longtime head of the National Institute of Allergy and Infectious Diseases, on whom the White House appears to be seeking to pin blame. Key Words:With resurgence of COVID-19 cases in the U.S., Trump signals rift with Fauci: ‘He’s made a lot of mistakes’ Don’t miss:Coronavirus update: Global case tally edges toward 13 million, and Florida trounces one-day case record set by California last week “Now he says his own CDC officials are lying about the virus — his own CDC health officials!” said Cuomo. “Trump’s COVID-19 scandal makes [President Richard] Nixon’s Watergate scandal look innocent.” Nobody died in the Watergate scandal, Cuomo observed. Cuomo issued an emergency health order Monday that will require travelers from states that are seeing spikes in COVID-19 cases to complete a location form before leaving the airport, or face a summons and $2,000 fine. The order will be enforced in every airport in the state, and travelers will have to say where they have come from and where they are going. The move comes after New York ordered travelers from states with high numbers of cases to self-quarantine for 14 days, an order he conceded has not been met with full compliance. Travelers from Georgia have infected New Yorkers in at least one county. “We can’t be in a situation where we have people coming from other states in the country bringing the virus again,” the governor said. “It is that simple.”"}]}