{"article": [{"url": "https://www.marketwatch.com/story/first-test-of-feds-new-inflation-friendly-policy-could-come-in-the-spring-11601909698", "published": 1601895800.0, "headline": "First test of Fedâ\u0080\u0099s new inflation-friendly policy could come in the spring", "body": "CHICAGO, IL - APRIL 06: Federal Reserve Chairman Jerome Powell (R) tours mHUB with Federal Reserve Bank of Chicago President Charles Evans in 2018. Getty Images The first test of the Federal Reserveâ\u0080\u0099s new found tolerance for inflation could come as soon as next spring. That was a suggestion contained in a speech by Chicago Fed President Charles Evans on Monday. In remarks to the National Association for Business Economics, Evans said that annual inflation readings might â\u0080\u009ctemporarilyâ\u0080\u009d be above 2% next spring â\u0080\u009cas the large drops in prices this year fall out of the annual calculations.â\u0080\u009d The Fed has promised to maintain its policy rate at the current zero to 0.25% range until inflation has reached 2% and is on track to moderately exceed 2% for some time. â\u0080\u009cI want to emphasize â\u0080\u0098for some time,'â\u0080\u009d Evans said. This suggests he did not think the short-term spike would be enough to push the Fed to raise interest rates. How much above 2% inflation would the Fed tolerate, and for how long? Evans said the Fed wouldnâ\u0080\u0099t follow a strict numerical formula. The Chicago Fed president said he would argue to his colleagues that the central bank â\u0080\u009ccanâ\u0080\u0099t be timid.â\u0080\u009d â\u0080\u009cTo reduce employment shortfalls and average 2% inflation over time, the FOMC needs to have an â\u0080\u0098in it to win itâ\u0080\u0099 attitude toward our inflation objective, he said. He noted that tolerating a 2.5% inflation rate could get the Fed to its policy goals quicker, even if some would think this was an excessive overshoot. Last month, newswires reported that Evans said the Fed plan allows for a rate hike before inflation averages 2%. Evans defended himself, saying this was just a plain reading of the Fedâ\u0080\u0099s new policy. Read: Fedâ\u0080\u0099s Evans says my comment was reading of Fed statement In his speech Monday, Evans repeated that â\u0080\u009cour work on inflation might not be complete at the time of liftoff.â\u0080\u009d But Fed policy would remain relatively easy or â\u0080\u009caccommodative,â\u0080\u009d he added. This has been a hard sell in the past. â\u0080\u009cHistorically, communicating to the public that an upward march in policy rates is still accommodative has been met with substaintial skepticism and disbelief,â\u0080\u009d he said. â\u0080\u009cAll in all, I envision substantial communications work ahead. But it can be done,â\u0080\u009d he said. Stocks opened higher on Monday with the Dow Jones Industrial Average DJIA, +0.56% up over 300 points."}]}