{"article": [{"url": "https://www.marketwatch.com/story/u-s-treasury-yields-inch-lower-before-debt-auction-11602161443", "published": 1602172700.0, "headline": "U.S. Treasury yields inch lower as bond traders watch fiscal stimulus talks", "body": "Yuri Cortez/Agence France-Presse/Getty Images U.S. Treasury yields slipped Thursday, but remain near the highest levels since late August, as investors watched talks between the White House and Democratic lawmakers, assessing the likelihood of future fiscal stimulus measures that could be passed before the presidential election in November. What are Treasurys doing? The 10-year Treasury note yield TMUBMUSD10Y, 0.777% fell 2.1 basis points to 0.764%, while the 2-year note rate TMUBMUSD02Y, 0.156% declined a single basis point to 0.145%. The 30-year bond yield TMUBMUSD30Y, 1.576% slipped 2.2 basis points to 1.565%. Bond prices move inversely to yields. What’s driving Treasurys? Investors eyed any signs of progress towards piecemeal fiscal stimulus measures, endorsed by President Donald Trump, but House Speaker Nancy Pelosi insisted that any aid to airlines could only come as part of a larger deal. Earlier this week, Treasury prices came under pressure amid signs that the uncertainty around the November presidential election may be easing, if Democratic candidate Joe Biden wins by a large margin, leaving the way open for expansionary government spending next year. The U.S. Treasury Department sold $23 billion of 30-year bonds Thursday afternoon. The recent rise in yields has prevented indigestion associated with new issuance, but investors say Treasurys may need to cheapen further to whet the appetite of bond buyers ahead of rising federal budget deficits. Indeed, the U.S. budget deficit hit a record $3.1 trillion in the recently concluded 2020 budget year, the nonpartisan Congressional Budget Office projected Thursday. In U.S. economic data, initial jobless claims filed through state programs slid to 840,000 in the week ended Oct. 3 from a revised 849,000 in the prior week, the Labor Department reported. Economists polled by MarketWatch had forecast new claims to fall to 820,000. The slowing decline of the number of Americans who applied for jobless benefits could be a sign the labor market is experiencing a setback amid another wave of corporate layoffs.What did market participants’ say? “The initial jobless claims data remains quite high, especially at this stage of the hopeful recovery. That likely means that the attention now shifts back to the additional stimulus conversations, where the terms of a deal seem to be changing every day,” said Kevin Giddis, chief fixed-income strategist at Raymond James."}]}