{"article": [{"url": "https://www.marketwatch.com/story/were-on-the-brink-of-one-of-the-biggest-crises-this-country-has-ever-seen-ocasio-cortez-warns-11602084587", "published": 1602080300.0, "headline": "We're on the brink of one of the biggest crises this country has ever seen, Ocasio-Cortez warns", "body": "Representative Alexandria Ocasio-Cortez (D-NY) Getty Images “ 'If the president and the GOP follow through with walking away from COVID relief, we are staring down the barrel at one of the largest mass eviction crises in the history of this country since the Great Depression.' ” That's New York Democrat Alexandria Ocasio-Cortez sounding alarm bells as she railed against President Trump follow this tweetstorm Tuesday: iframe.twitter-tweet { width: 100% !important; } iframe.twitter-tweet { width: 100% !important; } Ocasio-Cortez, in an interview on MSNBC, said that the U.S. is already starting to see warning signs of the \"severe\" fallout that is to come from the failure by Congress to pass another financial aid package in the wake of the coronavirus pandemic. \"We are on the brink of an eviction crisis, a mass eviction crisis, here in our district, but also across the country, 30 to 40 million people are at risk of being evicted because the president has decided to walk away from every working person in this country,\" she said. Her statistic echoes figures from a previous report by the Aspen Institute estimating up to 40 million people could get kicked out of their homes. \"We're looking at a potential second wave that could be catastrophic,\" Ocasio-Cortez continued. \"We are looking at the potential of hunger in the United States exploding on a level that we have never seen since the Great Depression.\" Watch this clip from the show: iframe.twitter-tweet { width: 100% !important; } Trump's initial threat of halting talks sent stocks reeling Tuesday, but he followed up with another flurry of tweets saying he'd immediately sign individual stimulus measures, if sent to him. iframe.twitter-tweet { width: 100% !important; } The stock market responded with a strong rebound. The Dow Jones Industrial Average DJIA, +0.56%, the tech-heavy Nasdaq Composite COMP, +1.39% and the S&P 500 SPX, +0.87% were all trading nicely higher in Wednesday's session."}]}