{"article": [{"url": "https://www.marketwatch.com/story/jobless-claims-fall-slightly-to-151-million-in-mid-june-but-us-layoffs-still-elevated-2020-06-18", "published": 1592476460.0, "headline": "Jobless claims dip to 1.51 million in mid-June, but layoffs remain stubbornly high", "body": "The numbers: About 1.5 million people applied for traditional jobless benefits in mid-June, but the high number of people still seeking or receiving financial aid suggests a fresh wave of layoffs may be crashing over the economy and stunting an embryonic recovery. Initial jobless claims filed the traditional way through state unemployment offices fell slightly in the seven days ended June 13 from 1.57 million in the prior week, the Labor Department said Thursday. It was the 10th decline in a row. Economists polled by MarketWatch had forecast a seasonally adjusted 1.35 million new claims Unemployed workers line up in their cars to file applications for jobless benefits in the age of the coronavirus. Getty Images If people who applied for unemployment benefits through a temporary federal program are included, new claims totaled an unadjusted 2.19 million in mid-June. Read:U.S. entered recession in February after end of longest expansion in history Yet the number of people who are actually receiving traditional jobless benefits barely fell to 20.54 million in the week ended May 30. These so-called continuing claims, reported with a one-week lag, had peaked in the middle of May at nearly 23 million, but are declining at an agonizingly slow pace. What happened: New jobless claims have fallen steadily from a peak of almost 7 million in late March, but the dropoff has been much slower than economists had expected. They worry a second wave of layoffs is keeping the numbers elevated, posing a potential threat to an economic recovery that’s now in the early stages. See: Marketwatch’s Coronavirus Economic Recovery Tracker The grudging decline in continuing jobless claims appears to offer proof. They give a better idea of how many people are still out of work, whereas new claims only reveal how many people may have lost their jobs at some point during the crisis. At least several million people have since returned to their jobs as the economy has reopened. Digging into the details of the latest claims report, 760,526 applications were submitted in the week of June 13 under a temporary federal relief program put in place after the pandemic began. Forty-six states reported figures for federal claims under the Pandemic Unemployment Assistance program. If all eight state and federal assistance programs are included, continuing claims totaled an unadjusted 29.1 million in the seven days ended May 30, the most recent data available. That marks a small drop from 29.5 million in the prior week. MarketWatch is also reporting select jobless claims data using actual, or unadjusted, figures to give a clearer picture of unemployment. The seasonally adjusted estimates typically expected by Wall Street have inflated jobless claims during the pandemic and become less accurate. Read: Consumer prices drop again as pandemic cuts rate of inflation to near zero Big picture: Some 49 million new jobless claims have been filed since the pandemic began, but, shocking as those numbers are, they don’t reveal much about how quickly the labor market is recovering. The more important figure to watch is continuing claims, and while they’ve begun to subside, they are not declining at a pace that points to a rapid recovery in lost jobs. Unless they fall more quickly, and soon, the nascent recovery could be stunted. The latest claims report took place during the same week in which the government surveyed businesses and households in preparation for the employment report for June. The small decline in new claims suggests that net employment gains this month might not be as strong as expected. The government said the economy regained 2.7 million jobs in May. What they are saying? “Claims are slowly, stubbornly falling back toward a ‘normal’ level, but it is taking a frustratingly long time and seemingly, momentum is stalling out,” wrote Thomas Simons, money market economist at Jefferies LLC, in a note to clients. “Continuing claims have been little changed since mid-May, suggesting a more modest gain in nonfarm payrolls than was reported for May,” said chief economist Scott Brown of Raymond James. Read: Revisiting that funky drop in unemployment to 13.3%: Nobody really believes it Market reaction:The Dow Jones Industrial Average DJIA, +0.56% and S&P 500 SPX, +0.87% opened lower on Thursday. The lower-than-expected decline in new claims could deepen the initial losses."}]}