{"article": [{"url": "https://www.marketwatch.com/story/dark-day-for-workers-as-thousands-lose-jobs-including-15000-at-boeing-rival-airbus-2020-07-01", "published": 1593798500.0, "headline": "Dark day for workers as thousands lose jobs including 15,000 at Boeing rival Airbus", "body": "Boeing BA, -0.39% rival Airbus AIR, +0.16% announced on Tuesday it would cut 15,000 jobs globally while travel location food specialist SSP SSPG, +3.67% said it would cut up to 5,000 staff as coronavirus continues to wreak havoc on the travel industry. Retailer Harrods and a host of other stores groups added to the jobs woes. Large U.S. employers have also struggled during the coronavirus crisis, retailers J Crew, J.C. Penney JCPNQ, -3.42% and Neiman Marcus Group have filed for bankruptcies and M, -0.95% Macy’s announced in June it would cut about 3,900 employees. Airbus, the world’s largest plane manufacturer, said the commercial aircraft business had seen a 40% drop in activity and that it expected a recovery could take until 2025. Read:Macy’s to cut 3,900 corporate and management jobs due to Covid-19 impact Cuts at Airbus will be concentrated in Europe, with the bulk in France, but 1,300 positions at world-wide sites which could include the U.S. will be at risk as well. The measures will be implemented by summer 2021, it said. The news came amid a raft of companies announcing job cuts across Europe as economies reopen and government support schemes begin to taper off. SSP, which operates food stores in 180 airports world-wide, said Covid-19 has had an unprecedented impact on the travel sector, with June sales around 90% down from a year earlier. It announced the cuts on Wednesday and, warning of the prolonged impact of coronavirus, said it expects to have opened just one in five of its units by autumn. Read:U.K. airline easyJet to close three of its airport hubs as coronavirus wreaks further havoc Meanwhile on Tuesday unions representing pilots and crew staff at easyJet said it was cutting more than 2,000 of its own staff because of the virus. The U.K. government’s job support package has paid the wages of 9.3 million workers since April, but in August it will be relaxed and there are fears this could cause a wave of unemployment. “The furlough scheme continues to hold off the bulk of job losses, but unemployment is likely to surge in the months ahead,” Tej Parikh, Chief Economist at the, the Institute of Directors, an organization that represents company directors and business leaders, said in June. Despite the scheme, media reports suggest at least 60,000 job cuts have been announced by U.K. companies since March. Luxury department store Harrods was among retailers warning of significant job cuts on Wednesday as it sent a note to employees saying it had to cut up 672 roles to protect the business. Meanwhile Topshop owner Arcadia, which said it would cut 500 jobs in its head office and shirtmaker TM Lewin is reportedly cutting 600 jobs and closing all of its stores."}]}