{"article": [{"url": "https://www.marketwatch.com/story/gold-looks-to-post-largest-quarterly-gain-in-4-years-talk-of-record-prices-by-year-end-grows-2020-06-30", "published": 1593527600.0, "headline": "Gold posts largest quarterly gain in 4 years; talk of record prices by year end grows", "body": "Gold futures posted a gain of nearly 13% for the three-month period ended Tuesday, the largest quarterly percentage climb since 2016, with analysts renewing talk of record prices by year end. Gold’s performance so far this year is “not attributed to the pandemic,” said Alex Ebkarian, chief operating officer at Allegiance Gold. “COVID-19 simply exasperated the underlying weaknesses as evident by the negative real interest rates and further weakening of the dollar.” On Tuesday, the August gold contract US:GCQ20 settled at $1,800.50 an ounce, the highest finish since Sept. 2011, according to Dow Jones Market Data. Based on the most-active futures contracts, prices ended the second quarter with a gain of 12.8%. That was the largest quarter percentage rise since the quarter ended March 2016. Year to date, prices were up 18.2%. Gold accelerated its move towards record highs in the second quarter of this year, as it was “already set on this trajectory” before the seriousness of the coronavirus was even realized, said Peter Spina, president and chief executive officer at GoldSeek.com. The reaction to COVID-19 over the last quarter was of “historic proportions,” with global debt now soaring and governments injecting trillions of dollars into their economies. Under those conditions, gold is a “lower risk shelter to seek refuge,” said Spina. A weaker U.S. dollar also contributed to dollar-denominated gold’s hefty gain for the quarter. The benchmark ICE U.S. Dollar Index DXY, -0.58% trades more than 1% higher year to date, but was down around 1.7% for the second quarter. Still, there were times so far this year where the usual inverse relationship between gold and the dollar didn’t apply because of a significant shortage in gold supply following the shutdown of the miners, refineries, and mints, and the selloff in gold for liquidity needs to cover short positions, said Ebkarian. The direction of real interest rates matters the most, he said. Since those are near zero in the U.S., “gold’s position is far more compelling than bonds.” Looking ahead, he said he’s paying close attention to any further weakening of real interest rates, as well as an increase inflation. Gold can be used as a hedge against inflation. Ebkarian also said there could be a second wave of COVID-19 infections, which “could yet again halt parts of our economy.” “Considering the trifecta global, financial and health crisis, uptick in inflation, market uncertainties, [and] weakening dollar, investors can best position themselves by moderately, proactively diversifying a portion of their portfolio in physical commodities and taking a mid- to long-term approach,” he said. “History tells us that post government and Fed interventions and bail outs, gold could double and silver quadruple, as it did between 2008 and 2011.” “ ‘With everything going on, gold could take a step back, but only to take a few more steps forward. Gold has only one way to go, and that is up.’ ” — Alex Ebkarian, Allegiance Gold For the second half of the year, before the outcome of the U.S. presidential elections, Allegiance Gold anticipates prices for the yellow metal to be between $1,800 and $2,000 an ounce, said Ebkarian. Gold may top $2,000 with Joe Biden in office as president “as investors will be concerned about the uncertainty of U.S. policies moving forward,” he said. If President Donald Trump gets a second term as president, the gold market “could trade momentarily either at the current prices or slightly below,” though he also points out that since Trump took office, gold has gone up by roughly 50%. Either way, Allegiance Gold’s 24-month outlook shows gold surpassing $3,000, “as uncertainties with the pandemic, unemployment rate, weakening dollar and debt burden remain,” he said. Spina, meanwhile, expects gold to break to all-time record highs “within the next couple of quarters,” and said $2,000 and higher gold is “coming.” Gold futures saw a record settlement of $1,891.90 on Aug. 22, 2011, according to Dow Jones Market Data, based on records dating back to November 1984. Read:Gold may reach a record by year end as investor need creates ‘more demand than the market can handle’ “With everything going on, gold could take a step back, but only to take a few more steps forward,” said Ebkarian. “Gold has only one way to go, and that is up.”"}]}