{"article": [{"url": "https://www.marketwatch.com/story/governments-cure-for-the-coronavirus-recession-is-worse-for-the-global-economy-than-the-disease-2020-06-12", "published": 1592037980.0, "headline": "Government's cure for the coronavirus recession is worse for the global economy than the disease", "body": "A major legacy of the COVID-19 pandemic will be a significant increase in already high global debt levels. In the U.S., government debt is expected to rise to $27 trillion by September 2020 from $23 trillion a year ago - a debt-to-GDP ratio of 135%. In OECD countries, debt levels are expected to increase by $17 trillion, rising from 109% to more than 137% of GDP. Public sector debt increases reflect higher healthcare spending, actions to alleviate the economic effects of the COVID-19 crisis, emergency loans and the loss of tax revenues. Households and businesses have also substantially increased borrowings to cover income shortfalls. If the recovery is slower than expected, then the rise in borrowings will be greater. Reducing debt is in order now, and this can be done in five ways: First, debt can be self-liquidating. Where invested in productive activities, the income generated can pay back interest and principal. The problem is that much of the debt incurred has financed consumption or is otherwise unproductive. Much of the current increase in debt is designed to supplement lost cash flow or facilitate business survival. Moreover, governments are reluctant to raise revenues through higher taxes to decrease debt levels, fearing a drop in economic activity as well as for ideological reasons. Second, strong economic growth can help reduce debt. In aggregate, it boosts GDP, decreasing debt as a percentage of the economy or business leverage. Strong growth augments government tax revenues and business income, which helps to pay off borrowings. Unfortunately, growth has been lackluster since 2008, being sustained artificially by low interest rates, liquidity infusions and fiscal deficits. Growth and debt are now inextricably linked. Increasing amounts of debt are needed to generate growth. Globally, around $2-$3 of new debt are needed to produce each dollar of growth. This means debt is increasing at a faster rate than growth. Third, high rates of inflation, especially if above the nominal interest rate, can help deleveraging. It increases revenues and reduces the economic purchasing power of the debt. In recent times, inflation levels have remained low due to a mixture of weak demand, overcapacity and changes in industrial structure. Central bank efforts to increase inflation through loose monetary policies have not been successful. Fourth, nations can engineer currency devaluations to decrease the purchasing power of debt issued in its own currency. In a world where every nation is seeking to devalue to increase export competitiveness as well as reduce debt burdens, this option is difficult. Fifth, debt can be decreased by default or restructuring, either by bankruptcy or negotiations between debtor and creditor. As debt and savings are two sides of the same coin, this would result in loss of wealth. If debts are written off, then savers are left without resources to meet future commitments. The result is lower consumption, which reduces economic activity. Read: Private equity is on shaky ground and stock investors should watch their step Also read: How much more hand-holding from the Fed does the market really need?Debt, then and now In an environment of low growth and disinflation or deflation, high-debt levels are difficult to manage. The historical precedents are not encouraging. Between 1914 and 1939, for example, World War I, post-war rebuilding and the Great Depression damaged public finances. Immediately after World War I, U.K. debt rose to 140% of GDP. Attempts to reduce debt through austerity failed. Debt rose to 170% of GDP as economic growth fell, with 1928 output below that of 1918. Germany, bearing its war losses and reparations, experienced hyperinflation and the destruction of its currency, which reduced its debt burden by 129% of GDP. In the 1930s, countries making up nearly half of global GDP defaulted or entered debt restructuring. The social and economic costs were severe. After World War II, some countries defaulted or experienced hyperinflation. Others used financial repression, such as negative real rates, controlled lending and deposit rates, capital controls and forcing institutions and households to finance the government at below-market rates, in order to manage debt. Real interest rates in advanced economies were negative roughly half the time between 1945 and 1980. These actions, along with strong growth driven by post-war reconstruction, helped reduce debt levels. Nowadays, given the limited options, the current debt burden will be managed in the short run through financial repression. Zero- or negative interest rates will make borrowing bearable. Debt will be consolidated onto the government balance sheet. In the current crisis, governments globally have acted as lenders to businesses and individuals. Some loans will be of necessity converted into grants. Student loans or some delinquent mortgages may be assumed by government. In the absence of growth or inflation, default, either explicit or in the form of debasement of the currency to wipe out obligations, may be unavoidable. Debt is analogous to the effect that ice has on an aircraft. Planes are designed to cope with modest icing on the wings. But large build-ups cause a loss of lift, resulting in erratic flight, loss of altitude - and ultimately a crash. Global debt levels resemble a large buildup of ice on the wings of the global economy and threaten a catastrophic final chapter. Satyajit Das is a former banker. His latest book is \"A Banquet of Consequences\" (published in North America as \"The Age of Stagnation\"). He is also the author of \"Extreme Money\" and \"Traders, Guns & Money.\" Read: These are just some of the ways ETFs and index funds are making financial markets more unstable More: We're now seeing the sharp edge of volatility's sword and it cuts deep "}]}