{"article": [{"url": "https://www.marketwatch.com/story/pressley-rips-devoss-push-to-reopen-schools-i-wouldnt-trust-you-to-care-for-a-house-plant-let-alone-my-child-2020-07-12", "published": 1594630340.0, "headline": "Pressley rips DeVosâ\u0080\u0099s push to reopen schools: â\u0080\u0098I wouldnâ\u0080\u0099t trust you to care for a house plant, let alone my childâ\u0080\u0099", "body": "“ â\u0080\u0098I wouldnâ\u0080\u0099t trust you to care for a house plant, let alone my child.â\u0080\u0099 ” Thatâ\u0080\u0099s Rep. Ayanna Pressley, ripping U.S. Education Secretary Betsy DeVos on Sunday over the Trump administrationâ\u0080\u0099s aggressive push to restart in-person schooling this fall. DeVos appeared on CNNâ\u0080\u0099s â\u0080\u009cState of the Unionâ\u0080\u009d on Sunday morning calling for schools to reopen, despite surging coronavirus cases around the nation. â\u0080\u009cThereâ\u0080\u0099s going to be the exception to the rule, but the rule should be that kids go back to school this fall,â\u0080\u009d DeVos told CNN. â\u0080\u009cAnd where there are little flare-ups or hot spots, that can be dealt with on a school-by-school or a case-by-case basis.â\u0080\u009d CNN host Dana Bash pressed DeVos to clarify the federal governmentâ\u0080\u0099s plan to reopen schools safely, and what it plans to do if there are outbreaks at schools. DeVos dodged the question, saying â\u0080\u009cevery school should have plans for that situation,â\u0080\u009d while avoiding saying what, if anything, the government recommends those plans to be. To another Bash question â\u0080\u0094 â\u0080\u009cCan you assure students, teachers, parents that they will not get coronavirus because theyâ\u0080\u0099re going back to school?â\u0080\u009d â\u0080\u0094 DeVos replied, â\u0080\u009cWell, the key is that kids need to be back to school.â\u0080\u009d Bash observed that it sounded as if the Trump Education Department were compelling schools to reopen and students to attend regardless of the public health situation in August and September. DeVosâ\u0080\u0099s response: â\u0080\u009cNo, what weâ\u0080\u0099re saying is that kids need to be back in school.â\u0080\u009d In a tweet shortly after the interview aired, Pressley, a Massachusetts Democrat, tore into DeVos. â\u0080\u009c[Y]ou have no plan,â\u0080\u009d Pressley said, referring to DeVos. â\u0080\u009cTeachers, kids and parents are fearing for their lives. You point to a private sector that has put profits over people and claimed the lives of thousands of essential workers. I wouldnâ\u0080\u0099t trust you to care for a house plant let alone my child.â\u0080\u009d Last week, Sen. Kamala Harris and Rep. Katie Porter, both California Democrats, sent a letter to DeVos and the heads of the CDC and Health and Human Services Department saying they were â\u0080\u009cdeeply disappointedâ\u0080\u009d by the lack of federal reopening guidelines for school districts. â\u0080\u009cYou have wasted months, without apparently joining forces to conduct science-based research on the best ways to re-open schools or continue educating students,â\u0080\u009d they said, calling for specific plans for the upcoming school year. On Sunday, a number of public health officials urged a cautious approach to reopening schools, saying decisions to open should be based on health data, not politics. While some argue that children appear to be less at risk of catching and spreading COVID-19, Israel recently saw a nationwide spike in cases after reopening its schools."}]}