{"article": [{"url": "https://www.marketwatch.com/story/treasury-yields-slide-ahead-of-fed-minutes-bond-auction-2020-08-19", "published": 1597855460.0, "headline": "Treasury yields bounce off lows after Fed pushes back on capping rates in minutes", "body": "U.S. Treasury yields pared their decline to end mostly higher on Wednesday after the Federal Reserve’s minutes showed senior officials were against the idea of capping yields for certain maturities in a strategy referred to as yield-curve control.What are Treasurys doing? The 10-year Treasury note yield TMUBMUSD10Y, 0.777% was up 0.6 basis point to 0.674%, while the 2-year note rate TMUBMUSD02Y, 0.156% was at 0.141%. The 30-year bond TMUBMUSD30Y, 1.576% rose 1.6 basis points to 1.414%. Bond prices move inversely to yields.What’s driving Treasurys? Minutes from the Federal Open Market Committee’s July meeting showed the central bank’s rate-setting group didn’t see the benefit of implementing so-called yield-curve control, capping yield. The Fed’s staff also told central bank officials in late July that they were lowering their estimate for economic growth over the second half of the year. The pushback against the yield-curve control gave a lift to longer-term bond yields on Wednesday as investors see the Fed’s bond-buying as instrumental for anchoring rates. Still, yields have remained within a tight trading range between 0.90% and 0.50% since March. The uncertainty around the COVID-19 pandemic's path in the U.S. and the expectation for interest rates to remain near 0% for the foreseeable future have prevented a major bond-market selloff. In the afternoon, an auction of $25 billion of new government bonds that wasn’t as well received as anticipated contributed to a bout of modest weakness in Treasurys, pushing yields higher. New debt supply can push prices for bonds lower, and yields higher.What did market participants’ say? “The reality is that the described lack of urgency to deploy [yield-curve control] is better characterized as ‘not-as-uber-dovish-as-hoped.’ Indeed, it’s hard to characterize any move by the Fed right now as not highly accommodative,” said Jon Hill, an interest-rate strategist at BMO Capital Markets, in e-mailed comments."}]}