{"article": [{"url": "https://www.marketwatch.com/story/hurricane-delta-back-at-category-3-looks-set-to-hit-louisiana-friday-night-2020-10-08", "published": 1602186620.0, "headline": "Hurricane Delta, back at Category 3, looks set to hit Louisiana Friday night", "body": "Louisiana residents confronting the menace of a new hurricane weeks after one battered parts of the state got stark warnings Thursday to brace for winds that could turn still-uncollected debris into dangerous missiles and again knock out power to thousands. Forecasts showed Delta had strengthened back into a Category 3 hurricane as it bore down on the state carrying winds of up to 115 mph (185 kph) and the potential to deliver a storm surge of up to 11 feet (3.4 meters) when it arrives on Friday evening. The projected path included the southwest area of Louisiana where Category 4 Hurricane Laura made landfall less than two months ago. Laura has been blamed for more than 30 deaths. The mayor of Lake Charles, where thousands of residents remain without shelter following the earlier hurricane, told residents that even if their homes survived Laura, they shouldn’t assume that would be the case with Delta. “This is not a bad dream. It’s not a test run. These are the cards that we have been dealt,” Nic Hunter said in a Facebook video. He added, “I know that we’ve been through a lot, and I know that we’re tired. But we have a job to do right now, and that job is to keep ourselves safe.” Read:Oil ends higher as hurricane cuts over 90% of Gulf crude output Residents in coastal towns appeared to be taking the latest threat seriously. Boarded windows and largely empty streets made New Iberia in south-central Louisiana look like a ghost town Thursday evening. The few signs of life included cars lined up at a drive-thru daquiri shop and people grabbing food at take-out restaurants. “The last two storms, we didn’t even board up, but this one’s supposed to be worse,” Charles Fuller said as he covered the windows of the fried chicken restaurant he manages. At least five southwest Louisiana parishes that were hit hard by Laura in August were under mandatory evacuations as of midday Thursday. Parish and local governments all along the coast issued a patchwork of mandatory or voluntary evacuation orders, most focused on low-lying areas subject to flooding or on residents with special medical needs who might suffer in prolonged power outages. Frankie Randazzo, 47, the partner of two restaurants in Lake Charles, said people in the city were extremely anxious ahead of the hurricane. Randazzo watched pieces of one of his restaurants, Panorama Music House, fly past a meteorologist’s car on a Facebook Live video during Hurricane Laura. “There’s a lot of nervous people and a lot of stress going around,” Randazzo said. Louisiana Gov. John Bel Edwards said President Donald Trump approved his request to declare a federal emergency, which frees up federal resources. The most recent forecast for Hurricane Delta has the storm making landfall “almost precisely” where Hurricane Laura struck — a region where homes and electrical infrastructure are still damaged, Edwards said in a radio interview. “And we’ve got people who are very tired,” the governor said. This is the sixth time this year that people in Louisiana have had to get ready for an approaching hurricane or tropical storm, while also coping with the coronavirus pandemic. “People of Lake Charles and in Cameron Parish have already suffered enough, and then here comes this one,” said Desi Milligan, who owns an RV park in Cameron that was heavily damaged during Hurricane Laura. Delta is the 25th named storm of this year’s unprecedented Atlantic hurricane season, the latest in a series of intensifying storms that scientists have attributed to global warming. It hit Mexico as a Category 2 hurricane just south of the resort city of Cancun early Wednesday with high winds and heavy rain. No deaths or injuries were reported. As the storm churned northwest at 12 mph (21 kph) late Thursday afternoon, the National Hurricane Center had a hurricane warning in place for a section of the Gulf Coast extending from High Island, Texas to Morgan City, Louisiana. New Orleans, well to the east of the projected landfall area, was expected to escape the worst of Hurricane Delta. But tropical storm force winds were still likely in the city Friday, and local officials said they were preparing for the possibility of tornadoes. In Mississippi, Gov. Tate Reeves also declared a state of emergency. The southern part of Mississippi could see heavy rain and flash flooding."}]}