{"article": [{"url": "https://www.marketwatch.com/story/with-resurgence-of-covid-19-cases-in-the-us-trump-signals-rift-with-fauci-hes-made-a-lot-of-mistakes-2020-07-10", "published": 1594565300.0, "headline": "With resurgence of COVID-19 cases in the U.S., Trump signals rift with Fauci: â\u0080\u0098Heâ\u0080\u0099s made a lot of mistakesâ\u0080\u0099", "body": "With a resurgence of coronavirus cases in the U.S. and states pausing their reopening plans, President Trump pointed a finger at Anthony Fauci, the director of the National Institute of Allergy and Infectious Diseases for three decades and one of the leading experts on pandemics in the U.S. for four decades. â\u0080\u009cDr. Fauci's a nice man, but heâ\u0080\u0099s made a lot of mistakes,â\u0080\u009d Trump said on Sean Hannityâ\u0080\u0099s Fox News show. â\u0080\u009cLike you donâ\u0080\u0099t have to ban them coming in from very infected China. I did it anyway and we saved hundreds of thousands of lives. I banned Europe from coming in when Italy and France and Spain were having all the problems.â\u0080\u009d “ â\u0080\u0098Theyâ\u0080\u0099ve been wrong about a lot things, including face masks.â\u0080\u0099 ” â\u0080\u0094 President Donald Trump speaking to Sean Hannity on Fox News Thursday evening â\u0080\u009cTheyâ\u0080\u0099ve been wrong about a lot things, including face masks,â\u0080\u009d Trump added. â\u0080\u009cMaybe theyâ\u0080\u0099re wrong, maybe not, but a lot of them said donâ\u0080\u0099t wear a mask, donâ\u0080\u0099t wear a mask. Now they are saying wear a mask. So a lot of mistakes were made â\u0080\u0094 a lot of mistakes.â\u0080\u009d The president has rarely worn a mask in public and has not said Americans should wear masks. On April 13, Fauci said he made recommendations to Trump to restrict travel. â\u0080\u009cThe travel was another recommendation, when we went in and said, â\u0080\u0098We probably should be doing that.â\u0080\u0099 And the answer was yes. And then another time was, â\u0080\u0098We should do it with Europe,â\u0080\u0099 and the answer was yes. And the next time, â\u0080\u0098We should do it with the U.K.,â\u0080\u0099 and the answer was yes.â\u0080\u009d Trump has previously been circumspect on masks. On April 3, the administration and the Centers for Disease Control and Prevention reversed their policies on masks, and said everyone â\u0080\u0094 not just medical workers, as they previously said â\u0080\u0094 should wear face coverings. Trump cited â\u0080\u009crecent studiesâ\u0080\u009d of asymptomatic transmission for the U-turn, while the CDC cited â\u0080\u009cnew evidence.â\u0080\u009d That same day, Trump said his administration recommended wearing cloth face coverings. However, he said he wouldnâ\u0080\u0099t wear a mask himself. â\u0080\u009cFrom recent studies, we know that the transmission from individuals without symptoms is playing a more significant role in the spread of the virus than previously understood,â\u0080\u009d he said. â\u0080\u009cYou donâ\u0080\u0099t have to do it. Iâ\u0080\u0099m choosing not to do it.â\u0080\u009d Fauci told the Financial Times that he has not briefed the president since June 2. “ â\u0080\u0098You donâ\u0080\u0099t have to do it. Iâ\u0080\u0099m choosing not to do it.â\u0080\u0099 ” â\u0080\u0094 President Trump speaking about wearing face masks on April 3 On April 15, New York Gov. Cuomo issued an executive order requiring New Yorkers to wear masks in public. â\u0080\u009cPut the mask on when you are not in socially distant places,â\u0080\u009d he said. â\u0080\u009cIt is your right to go out for a walk in the park, go out for a walk because you need to get out of the house. Fine, donâ\u0080\u0099t infect me. You donâ\u0080\u0099t have a right to infect me.â\u0080\u009d Fauci said last week that the U.S. government had not been doing well with contact tracing, the process of tracing people who have been in contact with someone identified to have the virus, instructing them to stay home, and connecting them with the resources they need to do so. â\u0080\u009cI donâ\u0080\u0099t think weâ\u0080\u0099re doing very well, for a number of reasons, and not all of which is the fault of the system,â\u0080\u009d he said in an interview last month with CNNâ\u0080\u0099s T, -1.01% Â Elizabeth Cohen. Studies have concluded that face masks have helped reduce contagion by reducing droplets being sprayed into the air during flu season; another Japanese-based study says this works when paired with vaccination. It may be that they work in a small amount of cases and/or just wearing them helps to promote healthy behaviors. Scientists writing in The New England Journal of Medicine found that the novel coronavirus was detectable in the air for up to three hours, up to four hours on copper, up to 24 hours on cardboard, and up to two to three days on plastic and stainless steel. Above all else, health professionals recommend washing hands, cleaning surfaces and social distancing in public spaces. The rift between Fauci and Trump widened against a backdrop of rising cases. Last Tuesday, in an interview livestreamed on Twitter TWTR, -0.23% and Facebook FB, +0.26% Â with the head of the National Institutes of Health, Francis Collins, Fauci said that unlike Europe, U.S. communities â\u0080\u009cnever came down to baseline and now are surging back upâ\u0080\u009d and â\u0080\u009cweâ\u0080\u0099re still knee-deep in the first wave.â\u0080\u009d Fauci previously said the virus may be mutating to become more transmissible, and focused on three main failings by both the public and authorities: Many states have reopened too quickly, people are not abiding by rules of social distancing, and the authorities could do a better job at contact tracing to track people whoâ\u0080\u0099ve been in contact with those who test positive. COVID-19, the disease caused by the virus SARS-CoV-2, has already proven extremely infectious. It had infected 12.8 million people globally and over 3.3 million in the U.S. as of Sunday, according to official figures collated by Johns Hopkins Universityâ\u0080\u0099s Center for Systems Science and Engineering. The disease had claimed at least 566,055 lives worldwide and 134,904 in the U.S. Confirmed coronavirus cases have recently risen in nearly 40 U.S. states. Fauci said this month that America needs to balance the needs of the nationâ\u0080\u0099s economic and public health; he said people need to practice social distancing and wear face masks. â\u0080\u009cWe do need to open up again, no doubt about it, we want to get the economy back,â\u0080\u009d he said. â\u0080\u009cBut youâ\u0080\u0099ve got to do it in a measured way, and now weâ\u0080\u0099re seeing the consequence of community spread.â\u0080\u009d How COVID-19 is transmitted"}]}