{"article": [{"url": "https://www.marketwatch.com/story/oil-futures-climb-on-shrinking-us-crude-inventories-2020-07-02", "published": 1593703820.0, "headline": "Oil climbs for a second session, settles at highest since March", "body": "Oil futures rose for a second session on Thursday to mark their highest finish since March, buoyed by better-than-expected U.S. job growth in June, after data a day earlier showed the biggest weekly domestic crude supply decline since 2019. The U.S. added 4.8 million jobs in June and the unemployment rate fell for the second straight month to 11.1%, according to government data released Thursday. “A strong U.S. nonfarm payroll report suggests the U.S. economic rebound continues and that crude demand should follow suit,” said Edward Moya, senior market analyst at Oanda, in a market update. On Thursday, West Texas Intermediate crude for August US:CLQ20 rose 83 cents, or 2.1%, to settle at $40.65 a barrel on the New York Mercantile Exchange, after gaining 1.4% on Wednesday. For the holiday-shortened week, oil saw a weekly gain of 5%, based on the most-active contract close last Friday, according to FactSet data. Read:Is the stock market closed Friday? For July 4th, here’s everything investors need to know about trading hours and closures Global benchmark Brent oil for September UK:BRNU20 picked up $1.11, or 2.6%, at $43.14 a barrel on ICE Futures Europe, which will hold an abbreviated trading session Friday. Brent oil traded 5.2% higher week to date. Both WTI and Brent futures on Thursday marked their highest settlements since March 6, according to Dow Jones Market Data. The Energy Information Administration reported Wednesday that U.S. crude inventories fell by 7.2 million barrels for the week ended June 26, coming after three consecutive weeks of increases. Analysts polled by S&P Global Platts had forecast an average crude supply decline of 2.7 million barrels. “Yesterday’s crude stockpile relief news in the U.S. was not a one-off event that traders forgot. A huge drop in inventories, much higher than most of the market expected, is clearly a booster factor,” wrote Louise Dickson, oil markets analyst at Rystad Energy, in a Thursday report. Energy markets have also been keying in on increases in cases of COVID-19, however, with the U.S. hitting a single-day record of infections of more than 52,000, injecting some concern into crude markets about the impact of protocols to limit the spread on the economy and oil uptake. Read:This commodity escaped the first half of 2020 drop in the energy sector Oil “pretty much remains influenced by coronavirus related developments and factors influencing fuel demand,” Lukman Otunuga, senior research analyst at FXTM, told MarketWatch. Any gains for oil are “likely to be capped by risks around a new round of lockdowns due to rising coronavirus cases.” In other news Thursday, Baker Hughes BKR, -1.34% reported that the number of active U.S. rigs drilling for oil edged down by 3 to 185 this week. Data were released a day earlier than usual because of Friday’s holiday. Back on Nymex, petroleum product prices also climbed, with August gasoline US:RBQ20 up 3.5% at $1.2592 a gallon and August heating oil US:HOQ20 up 2.6% at $1.2311 a gallon. Both contracts saw gains of more than 5% from last Friday’s settlement. August natural gas US:NGQ20 settled at $1.734 per million British thermal units, up 3.8%. For the week, it traded roughly 12% higher. On Thursday, the EIA reported an increase of 65 billion cubic feet in natural-gas supplies for the week ended June 26. On average, analysts polled by S&P Global Platts forecast a rise of 77 billion."}]}