{"article": [{"url": "https://www.marketwatch.com/story/supreme-court-rules-trump-tax-financial-records-can-be-turned-over-to-new-york-prosecutor-but-rejects-house-democrats-bid-2020-07-09", "published": 1594293860.0, "headline": "Supreme Court rules Trump tax, financial records can be turned over to New York prosecutor, but rejects House Democratsâ\u0080\u0099 bid", "body": "The Supreme Court on Thursday ruled that the Manhattan district attorney may access President Donald Trumpâ\u0080\u0099s financial and tax records, but the court turned back a similar effort by House Democrats. The ruling in the case involving Manhattan District Attorney Cyrus Vance was a blow to Trump, who has long sought to keep his records private, but it does not mean that those records will be released soon, since they are being demanded as part of a confidential grand-jury investigation. The Supreme Court considered two sets of cases: a subpoena from Vance and subpoenas from three House of Representatives committees to Trumpâ\u0080\u0099s banks and his accounting firm. Vanceâ\u0080\u0099s subpoena sought eight yearsâ\u0080\u0099 worth of Trumpâ\u0080\u0099s business and personal tax records. In the Vance case, Trumpâ\u0080\u0099s lawyers have said he is immune from criminal investigation while in office. His lawyers have called the subpoenas from House Democrats â\u0080\u009cunprecedented,â\u0080\u009d though justices have disputed that, invoking prior Supreme Court losses by Presidents Richard Nixon and Bill Clinton when they sought to withhold information. Chief Justice John Roberts wrote the opinions in both cases, which were each 7-2. â\u0080\u009cIn our judicial system, â\u0080\u0098the public has a right to every manâ\u0080\u0099s evidence.â\u0080\u0099 Since the earliest days of the Republic, â\u0080\u0098every manâ\u0080\u0099 has included the President of the United States,â\u0080\u009d wrote Roberts in the Vance case. In sending the congressional case back to the lower courts, Roberts wrote, â\u0080\u009cthe courts below did not take adequate account of the significant separation of powers concerns implicated by congressional subpoenas for the Presidentâ\u0080\u0099s information.â\u0080\u009d Trumpâ\u0080\u0099s two high court appointees, Justices Neil Gorsuch and Brett Kavanaugh, joined the majority in both cases along with Roberts and the four liberal justices. Trump has refused to release his tax returns ever since he was a presidential candidate. Presumptive Democratic presidential nominee Joe Biden, meanwhile, has released his. See:Biden lowered his taxes in a way that Obama tried to prevent Reacting to the decisions on Twitter, Trump said, â\u0080\u009cthis is all a political prosecution.â\u0080\u009d iframe.twitter-tweet { width: 100% !important; } House committees have sought records from Deutsche Bank DB, -0.85% Â and Capital One COF, -0.49%, as well as the Mazars USA accounting firm. Mazars also is the recipient of a subpoena from Vance. The committees subpoenaed the bank documents as part of their investigations into Trump and his businesses. Vance and the House Oversight and Reform Committee sought records from Mazars concerning Trump and his businesses based on payments that Trumpâ\u0080\u0099s thenâ\u0080\u0093personal lawyer, Michael Cohen, arranged during the 2016 presidential race to keep two women from airing their claims of extramarital affairs with Trump. The Associated Press contributed to this story."}]}