{"article": [{"url": "https://www.marketwatch.com/story/think-your-nest-egg-is-safe-sitting-in-cash-think-again-billionaire-investor-explains-where-some-of-that-money-should-go-instead-11602081310", "published": 1602074780.0, "headline": "Think your nest egg is safe sitting in cash? Think again - billionaire investor explains where some of that money should go instead", "body": "Bridgewater Associates Founder & Co-Chairman/Co-CIO Ray Dalio Getty Images Ray Dalio, founder of the massive Bridgewater Associates investment firm, has been railing against cash all year long, and he doubled down on his stance on Wednesday, telling CNBC that, even amid all the stock market turmoil, it's \"not a safe investment\" at this point. Dalio explained in the interview that \"there's an instinct to think that cash is the lowest risk asset, because it has less volatility, and also because we look at everything through the lens of cash - what is everything in dollars worth.\" But he doesn't see it that way. Back in late January, Dalio made a similar call, saying \"cash is trash,\" which led to plenty of backlash amid reports that his flagship Pure Alpha Fund II was down double-digits as the broader market took a tumble. He stuck to his guns a few months later in a question-and-answer session on Reddit in April, even as the coronavirus pandemic cast dark clouds over the fate of the stock market. \"I believe that increasingly there will be questions by bondholders who are receiving negative real and nominal interest rates, while there is a lot of printing of money, about whether the debt assets they are holding are good storeholds of wealth,\" he said at the time. \"I believe that cash, which is non-interest-bearing money, will not be the safest asset to hold.\" Read: Investors could be looking at a 'lost decade,' the world's biggest hedge fund warns So what's an investor to do? Dalio said that China, where \"almost everybody\" is underweight, has fallen out of favor, but deserves more exposure, beginning with a diversified approach to investments in the region. \"That means to achieve the right kind of balance of assets in China,\" he told CNBC. \"Our approach is, we call it all-weather approach, it's a certain balance in which you achieve balance without lowering the expected return. From that, you want to make the tactical moves.\" Read: Dalio says the world's going to change 'in shocking ways' The Chinese yuan CNHUSD, +0.72%, he explained, could see greater usage outside the country as weaker global economies weigh on the the U.S. dollar DXY, -0.58% and other major reserve currencies. Dalio said that China's interest rates are attractive, and the development of capital markets in the region has strengthened the yuan. \"You'll see more of the internalization of the [yuan], and it's a natural consequence because as the dollar and the major reserve currencies are having the challenges that we are talking about, some element of void will be there,\" he said. \"But firstâ\u0080¦ get the exposure.\" Watch this clip from the interview: div.youtube { height:0; position:relative; padding-bottom:56.25%; } div.youtube > iframe { position: absolute; left: 0; top: 0; width: 100%; height: 100%; } China's stock markets have performed relatively well, of late, as the economy continues to make progress in beating back the coronavirus. The Shanghai Composite SHCOMP, +1.67% is up almost 6% since the beginning of the year to outpace the S&P 500 SPX, +0.87% by a thin margin. On Wednesday in the U.S., the Dow Jones Industrial Average DJIA, +0.56%, tech-heavy Nasdaq Composite COMP, +1.39% and S&P were all bouncing back nicely from the prior session's declines, while Shanghai was mostly in the red."}]}