{"article": [{"url": "https://www.marketwatch.com/story/nvidia-and-softbank-are-each-winners-in-40-billion-deal-for-arm-holdings-2020-09-13", "published": 1600034900.0, "headline": "Nvidia and SoftBank are each winners in $40 billion deal for Arm Holdings", "body": "The impending sale of Arm Holdings to Nvidia Corp. for $40 billion could have wide-ranging implications for the global semiconductor industry, further elevating one of its highest fliers and unwinding another big bet by SoftBank Group Corp. The Japanese technology conglomerate said late Sunday that it has reached a deal to sell Arm to Nvidia for a mix of cash and stock, confirming a report Saturday by The Wall Street Journal. Nvidia NVDA, -0.54% will pay $21.5 billion in stock and $12 billion in cash. SoftBank 9984, -1.24% may also receive up to $5 billion in cash or stock subject to Arm hitting financial-performance targets. Nvidia will also issue $1.5 billion in stock to Arm employees. Nvidia, which makes graphics processors, and Arm, which designs microprocessors that power most of the world’s smartphones, may not be household names, but they are some of the biggest players in the chip industry. A union would instantly lift Nvidia, whose stock has been one of the market’s best performers this year, into a dominant force in the market for smartphones and a big supplier of technology for a range of other devices from smart speakers to fitness trackers. The deal, one of the largest semiconductor takeovers ever, marks a win for SoftBank and its chief executive, Masayoshi Son, which bought Arm four years ago for $32 billion and had struggled to jump-start growth in the business. For Nvidia Chief Executive Jensen Huang, it is the biggest gamble since he helped co-found the chip maker in 1993. Nvidia is a fast-growing industry player best known for making the graphics chips that power videogames like on the wildly popular Nintendo Switch. The chips have been in hot demand during the pandemic as lockdowns keep people at home. An expanded version of this report appears on WSJ.com. Also popular on WSJ.com: How travel will change post-pandemic: 10 expert predictions. Whole Foods CEO says many people are done with grocery stores."}]}