{"article": [{"url": "https://www.marketwatch.com/story/ex-ceo-of-wirecard-arrested-in-case-over-missing-billions-2020-06-23", "published": 1592891960.0, "headline": "Ex-CEO of Wirecard arrested in case over missing billions", "body": "BERLIN (AP) — The former CEO of German payment service provider Wirecard has been arrested, accused of inflating the company’s balance sheet in an accounting scandal that centers on a missing sum of 1.9 billion euros ($2.1 billion), prosecutors in Munich said Tuesday. Markus Braun resigned on Friday after the company disclosed that auditors couldn’t find accounts containing the money. On Monday, Wirecard said it has concluded that the money probably doesn’t exist. Prosecutors said a court issued an arrest warrant shortly afterward and Braun turned himself in on Monday evening. He is accused of inflating the company’s balance sheet and revenue using sham income from business with third-party acquirers, “possibly in collaboration with further perpetrators,” in order to “portray the company as financially stronger and more attractive for investors and clients,” they said in a statement. Braun was arrested on suspicion of incorrect statements of data and market manipulation. Wirecard AG was once regarded as a star of the growing financial technology sector, but its shares have fallen sharply after the company became the subject of multiple Financial Times reports about accounting irregularities in its Asian operations. Wirecard disputed the reports, which started in February 2019, and said it was the victim of speculators. On Monday the company announced the firing of its chief operating officer, Jan Marsalek, who had been suspended from the management board last week. German news agency dpa reported that Marsalek had been in charge of overseeing daily operations including in Southeast Asia, where the possible fraud occurred. Two Philippine banks that were said to hold the money in escrow accounts said in recent days that they had no dealings with Wirecard, and the country’s central bank chief said none of the missing money entered the Philippines’ financial system. In the early hours of Monday, Wirecard WDI, +0.14% said its management board “assesses on the basis of further examination that there is a prevailing likelihood that the bank trust account balances in the amount of 1.9 billion euros do not exist.” Wirecard said it is in “constructive discussions” with banks on continuing credit lines, and is “assessing options for a sustainable financing strategy for the company.” It said it is examining other possible measures to keep the business going, including restructuring and disposing of business units. After huge declines last week and on Monday, Wirecard shares rallied somewhat on Tuesday. They were up 14.2% in Frankfurt trading at 16.49 euros. Also read:Short sellers made $2.6 billion off Wirecard plunge"}]}