{"article": [{"url": "https://www.marketwatch.com/story/kamala-harris-warns-voter-suppression-foreign-interference-could-affect-election-2020-09-06", "published": 1599410600.0, "headline": "Kamala Harris warns voter suppression, foreign interference could affect election", "body": "WASHINGTON — Democratic vice presidential nominee Kamala Harris says foreign interference, doubt cast about the election by President Donald Trump and voter suppression could potentially cost her and Joe Biden the White House in November. “I am a realist about it. Joe is a realist about it,” the California senator said during an interview with CNN’s “State of the Union” that aired Sunday. The 2020 election will be held under challenging circumstances. It will be the first U.S. election in over a century to be conducted during a pandemic, which is expected to lead to a massive surge in mail voting. Trump has repeatedly railed against mail balloting, which he says without offering proof will lead to widespread voter fraud. And for the first time in decades, both parties will be able to closely scrutinize who casts ballots due to a recent court ruling that wiped out tighter restrictions on poll monitoring. Meanwhile, U.S. intelligence agencies have concluded Russia is once again attempting to interfere in the election by amplifying discord in the country. That all adds up to a volatile environment that Harris says could alter the outcome. “We have classic voter suppression, we have what happened in 2016, which is foreign interference. We have a president who is trying to convince the American people not to believe in the integrity of our election system and compromise their belief that their vote might actually count,” Harris said. “These things are all at play.” When asked directly if foreign interference could cost her and Biden, the Democratic presidential nominee, the White House, she said: “Theoretically, of course, yes.” “I do believe that there will be foreign interference in the 2020 election and that Russia will be at the front of the line,” she said. Harris also singled out a 2013 Supreme Court ruling that invalidated parts of the Voting Rights Act. She said that’s led some states to pass laws that are intended to limit access to the ballot for racial minorities. She said if she and Biden win, they will make it a priority to try and restore those provisions. “There will be many obstacles that people are intentionally placing in front of Americans’ ability to vote,” Harris said. Harris was also asked about whether it was a mistake to call for charges in the shooting of Jacob Blake, a Black man who was shot in the back seven times by a white police officer in Kenosha, Wisconsin, which led to days of protest and property destruction. Harris initially called for the officer to be charged, while making clear she wasn’t aware of all the facts in the case. In the interview that aired Sunday, she reiterated her call for charges against the officer. But Harris, a former San Francisco district attorney and California attorney general, also softened her remarks and emphasized that the decision was up to the local prosecutor. “Everyone is entitled to due process, everyone, including police officers. And I encourage that. I support that,” Harris said. “I’m clearly not the prosecutor in the case. And the prosecutor in the case must make a decision based on all of the evidence and all of the laws that include giving everyone, and in particular those who might be charged, due process in the process.” Another issue Harris touched on was Trump’s handling of the coronavirus and whether she would trust a vaccine that Trump hopes will soon be available, even though medical experts have cautioned that more testing is needed. “I would not trust his word,” Harris said. “I would trust the word of public health experts and scientists, but not Donald Trump.”"}]}