{"article": [{"url": "https://www.marketwatch.com/story/the-all-new-ford-bronco-still-has-its-off-road-chops-but-with-plenty-of-creature-comforts-2020-07-24", "published": 1595308340.0, "headline": "The all-new Ford Bronco still has its off-road chops, but with plenty of creature comforts", "body": "The 2021 Ford Bronco is an all-new SUV that’s built to be an off-road specialist. The Bronco was one of Ford’s F, -1.36% classic models, starting in 1966, and eventually replaced by the Ford Expedition. There’s a lot of nostalgia for the name, and with those fond feelings comes a lot of pressure. How will Ford design a new vehicle that lives up to more than 50 years of history? The answer: For 2021, Ford has built a new SUV, offered with two or four doors, that has the 4-wheel-drive systems and equipment off-roaders want. Like the classic Bronco, you can remove the doors and the top for open-air adventure. While the Bronco’s styling pays tribute to the original, it is a more modern take and uses aluminum body panels to reduce weight without losing strength or durability. But there’s a lot more to the Bronco than retro appeal. This SUV also has modern technology, fuel-efficient engines and creature comforts that will appeal to buyers above and beyond die-hard Bronco fans. In addition to its off-road chops, the truck-based Bronco can tow up to 3,500 pounds. The Bronco should be a strong competitor for the Jeep Wrangler, and shoppers looking at a Toyota 4Runner or Land Rover Defender may also consider the Bronco. The Ford Bronco 2-door. Ford What’s new? The Ford Bronco is all-new for 2021. This is the return of a legendary nameplate from Ford’s past. This is also the first time Ford has built a 4-door Bronco. See the 2021 Ford Bronco models for sale near youWhat we like Styling and capability are true to the classic 1966-77 Bronco Two- and four-door body styles appeal to a wide spectrum of buyers Best-in-class ground clearance, suspension travel, crawl ratio Quick-release removable doors and roof on all models Advanced 4WD tech helps off-roaders of all abilities The Ford Bronco 2-door. Ford What we don’t Only turbo engines, no diesel option Higher trim levels may get pricey Soft top is only available on 4-door models How much? Bronco 2-Door: $29,995 plus $1,495 destination charge Bronco 4-Door: $34,995 plus $1,495 destination charge Fuel economy The 2021 Ford Bronco will come standard with 4WD and is available with two engines. The standard engine, a 2.3-liter turbocharged EcoBoost 4-cylinder, is expected to put out 270 horsepower and 310 lb-ft of torque. It comes standard with a 7-speed manual (six speeds + crawl), but you can also get a 10-speed automatic transmission. The optional engine, a 2.7-liter EcoBoost twin-turbo V6, is anticipated to offer 310 horsepower and 400 lb-ft of torque. It comes standard with a 10-speed automatic. Also see: The 10 best new car models of 2020 While Ford hasn’t announced fuel economy for the Bronco with either engine, we anticipate fuel economy will be the same or better than the Jeep Wrangler, its direct competitor. Fuel economy for the Wrangler ranges from 17 mpg city/23 mpg hwy/19 mpg combined to 22 mpg city/24 mpg hwy/23 mpg combined. (These numbers don’t include mpg for the Wrangler’s available diesel, because there isn’t expected to be a diesel option for the Bronco.)Standard features and options The 2021 Ford Bronco comes standard with a 2.3-liter turbocharged EcoBoost 4-cylinder engine, a version of the same engine that’s in the Ford Ranger. (Also shared with the Ranger: the Bronco rides on a newer version of the Ranger’s fully boxed truck frame.) Ford anticipates this engine will net 270 horsepower. Behind that engine is a 7-speed manual – six speeds plus a crawler gear. Even though Ford hasn’t announced pricing, we expect the 2-door Bronco to be the less expensive model. The base 2-door comes standard with a modular hardtop, where you can remove some or all of the pieces. Four-wheel drive comes standard on the Bronco, with a 2-speed electronic shift-on-the-fly system. The base Bronco has 16-inch steel wheels with 30-inch all-season tires. The Bronco has at least 8.3 inches of ground clearance, which goes up to 11.6 with 35-inch tires. When the Ford Bronco goes on sale in early 2021, there will be six trim levels, based around what you want your vehicle to be capable of. The 2-door base model comes with a modular hard top, and you can only get the soft top on 4-door models. Ford also anticipates there will be more than 200 accessories that can be installed by the dealer. Also see: 8 affordable new cars priced well below $20k The base model is seen as a starting-off point, for no-frills off-road pursuits or for people who plan to modify their vehicle. Big Bend has more creature comforts, is available with 17-inch wheels and 32-inch tires, and Co-Pilot360 is available. Black Diamond adds a heavy-duty modular front bumper, a steel rear bumper, skid plates, and a rubberized floor. The Outer Banks is the model where you will find the most tech and creature comforts, including a 12-inch navigation screen and a Bang & Olufsen audio system. We expect the Outer Banks will offer the 2.7-liter EcoBoost as an option. If that’s the case, this may be a highly popular Bronco model. The Wildtrak has more of a high-speed desert off-roader feel to it. It comes with the 2.7-liter twin-turbocharged EcoBoost V6, which is related to the excellent engine in the Ford F-150. This engine is expected to have 310 horsepower and 400 lb-ft of torque, which should be plenty of power for high-speed desert adventures. This engine uses a 10-speed automatic. You can get the Wildtrak with 17-inch beadlock-capable wheels. There will also be a First Edition, limited to 3,500 units, that’s said to be a mix of Badlands features, the Outer Banks interior, and the Wildtrak exterior. The ultimate Bronco off-roader is the Badlands model. This is the one with a choice of two types of 17-inch beadlock-capable wheels and 35-inch tires. There’s a front stabilizer bar disconnect and locking differentials. See: How to choose trim levels and options when buying a new car All Bronco models will be available with an advanced 4WD system with auto mode and a 2-speed electromechanical transfer case. Another option, the Sasquatch package, is optional with any model. It comes with 17-inch beadlock wheels, electronic front and rear axles, the topline 4-wheel-drive system, high-clearance suspension, and High-performance Off-road Stability Suspension with Bilstein position-sensitive shocks.Safety Ford hasn’t released many details about the safety features of the 2021 Ford Bronco, but they have confirmed that this SUV will come with Trailer Sway Control, which helps manage the brakes and engine to reduce sway while you’re towing a trailer behind the Bronco. This is particularly helpful on curving mountain roads or high-wind areas. Also see: 8 new luxury SUVs for under $50,000 The other safety feature Ford highlighted is the company’s Co-Pilot360 suite of driver assists. While the company didn’t specify which features the Bronco would have, other Fords receive blind-spot warning and rear cross-traffic alert, lane-keep assist, and auto high beams.Behind the wheel The new Bronco is based on the new Ford Ranger. We expect the Bronco to feel less refined than a car-based SUV such as the Ford Escape, with a firmer ride. We believe the Bronco will feel similar to the Jeep Wrangler – comfortable enough for daily driving but biased more toward off-road capability. Its large windows and short overhangs also suggest good visibility.Other cars to consider 2020 Jeep Wrangler — The Wrangler is also a legendary off-roader. Like the Bronco, the Wrangler is sold with two or four doors, has a removable top and doors, and comes with a choice of engines. Its Rubicon model is the most off-road capable, which would compare to the Bronco’s Badlands model. 2020 Toyota 4Runner — If you’re shopping for a 4-door SUV that excels in dirt and on rocks, you can also consider the Toyota 4Runner. It’s truck-based and capable and has a roomy interior that makes this a good vehicle for daily life. 2020 Land Rover Defender — Another name closely associated with excellent off-road capability, the Land Rover Defender has returned to America this year after a 23-year absence. Like the Bronco, this versatile SUV will also be offered in 2- or 4-door models. It might seem odd to compare a Land Rover and a Ford but the Defender’s base price of $50,000 is not far off a fully-optioned Bronco. Used Toyota FJ Cruiser — The FJ Cruiser, based on the same platform as the Toyota Tacoma pickup, was also off-road biased. While it didn’t sell in volume when it was new, it has become a highly sought after SUV on the used market. A used Toyota TM, -0.65% FJ Cruiser will cost around $30,000 or more. The combination of Toyota’s well-known reliability and the passionate following surrounding the FJ Cruiser makes it a somewhat costly alternative. Used Nissan Xterra — Like the Toyota 4Runner, this 5-passenger SUV from Nissan was built on a truck platform, and was designed to balance off-road prowess with day-to-day life. It was comfortable on road and capable on trails, but its fuel economy was disappointing at best. A used Nissan NSANY, -1.50% Xterra with about 40,000 miles can be had for about $16,000, depending on which version you get. This Nissan is a more affordable choice, but odds are the vehicles you’ll find will have a lot of miles on them.Questions you may ask How much will the 2021 Ford Bronco cost? Ford hasn’t announced complete pricing, but says that the Bronco 2-door will start at $29,995 (not including destination charges). When can I order a Ford Bronco? You can currently reserve a 2- or 4-door 2021 Bronco with a $100 deposit. When does the Ford Bronco go on sale? We expect it to arrive at dealerships in spring of 2021. Will the new Bronco have a removable top? Yes. Two-door Broncos will come standard with a modular hard top. Four-door Broncos will come standard with a soft top, and the removable hard top will be optional. And all Broncos come standard with removable doors. Where will the 2021 Ford Bronco be built? The Bronco will be built at the Ford Michigan Truck Plant, in Wayne, Michigan. This is the same plant where the Bronco was built from 1965 until it was discontinued in 1996.Autotrader’s advice The all-new Ford Bronco may have some retro styling, but the vehicle itself appears to be equipped with the right gear to take on the Jeep Wrangler. The Ford Bronco could be a great option for people who seek out hard-core off-road adventure, and it uses well-established and proven engines, technology, and hardware from Ford. We recommend skipping the base model Bronco, because even Ford says this is the model for those who want no-frills off-roading, or already have plans to modify their vehicle. Don’t miss: What it’s like to drive a Tesla Model Y This story originally ran on Autotrader.com."}]}