{"article": [{"url": "https://www.marketwatch.com/story/amd-stock-heads-toward-record-high-after-beating-on-earnings-raising-annual-forecast-2020-07-28", "published": 1595958800.0, "headline": "AMD stock heads toward record high after beating on earnings, raising annual forecast", "body": "Advanced Micro Devices Inc. shares headed toward record highs in after-hours trading Tuesday after the chip company reported second-quarter earnings that beat expectations and increased its full-year forecast despite the COVID-19 pandemic. AMD AMD, -3.94% announced that it now expects 2020 revenue to grow about 32% from 2019, which would equal annual sales of roughly $8.88 billion, up from previous guidance of $8.08 billion to $8.75 billion, according to FactSet. Analysts on average had expected 2020 revenue of about $8.4 billion, FactSet reported. When asked on the call why the outlook was raised, AMD president and CEO Lisa Su said “demand has gone up from our initial expectations” and that the company sees better-than-expected PC sales in the second half of the year, along with continued data-center growth, and a ramp in gaming console sales. For the third quarter, AMD predicted sales of $2.45 billion to $2.65 billion, while analysts on average had forecast revenue of $2.31 billion. The company and analysts expect AMD’s embedded and semi-custom business to accelerate in the second half of the year as new videogame consoles from Sony Corp. SNE, +0.56% and Microsoft Corp. MSFT, +2.48% that feature AMD chips roll out. “We do believe that the market is a little bit better than we thought 90 days ago, but we also believe that our product traction is strong, and we’re seeing that with our customer demand, so those are the reasons for the guidance,” Su said on a conference call. Patrick Moorhead, principal analyst at Moor Insights & Strategy, who thought AMD was being conservative earlier in the year, thinks sales have even more room to run. “I believe this new forecast is conservative, as I think Epyc revenue will kick in even higher,” Moorhead said. AMD reported second-quarter net income of $157 million, or 13 cents a share, compared with $35 million, or 3 cents a share, in the year-ago period. After adjusting for stock-based compensation and other factors, the chip company reported earnings of 18 cents a share, compared with 8 cents a share in the year-ago period. Revenue rose to $1.93 billion from $1.53 billion in the year-ago quarter. Analysts surveyed by FactSet had forecast adjusted earnings of 16 cents a share on revenue of $1.85 billion. Shares surged more than 10% after hours, following a 2% decline in the regular session to close at $67.61, and were ahead of AMD’s intraday record of $71.63, set late last week. After leading the S&P 500 index SPX, +0.87% in annual percentage gains in both 2018 and 2019, AMD stock has increased more than 47% so far in 2020 as the S&P has slipped 0.4%. AMD’s results follow last week’s surprise announcement that Intel Corp. INTC, -1.03% was delaying the release of its 7-nanometer chips until at least late 2022 because of manufacturing issues. AMD has already rolled out 7nm chips for servers and personal computers, and has found larger market share and increasing sales and profit with those products. Late Tuesday, Intel shares closed down 0.7% at $49.24, and slipped another 0.8% after hours. Read:AMD is weathering coronavirus while biggest rival struggles AMD reported second-quarter sales of $1.37 billion for computing and graphics chips, up 45% from $940 million last year, in line with analysts’ expectations of a 45% surge to $1.36 billion. Sales from enterprise embedded and semi-custom chips — the unit that includes data-center and gaming-console revenue — were $565 million, down 4% from $591 million a year ago but well ahead of analysts’ average forecasts of an 18% decline to $485.5 million."}]}