{"article": [{"url": "https://www.marketwatch.com/story/new-home-sales-surged-to-highest-level-since-2006-in-july-but-builders-could-soon-face-headwinds-2020-08-25", "published": 1598352560.0, "headline": "New home sales surged to highest level since 2006 in July, but builders could soon face headwinds", "body": "The numbers: Sales of new single-family homes increased markedly for the third month in a row, rising to their highest level since 2006. Sales of new single-family houses rose 14% between June and July to a seasonally-adjusted annual rate of 901,000, the U.S. Census Bureau reported Tuesday. Compared with a year ago, new home sales were up 36%. Economists polled by MarketWatch had expected a median pace of new home sales of 790,000. The government also revised June’s new home sales figure to a rate of 791,000, up from 776,000. The report’s small sample size has historically led to significant revisions. What happened: The surge in sales was driven by a nearly 59% increase in the Midwest month-over-month. Sales also increased on a monthly basis in the South and the West, but fell by 23% in the Northeast. The median sales price in July was $330,600, up 7% from a year ago. The inventory of new homes fell to just 299,000, representing a 4-month supply. That’s down from a 4.6-month supply in June. A 6-month supply is considered the benchmark for a balanced market. The big picture: Americans have flooded into the pricier market for new homes in recent months as they’ve faced a very short supply of existing homes for sale. Demand among home buyers that was pent-up at the height of the coronavirus lockdowns this spring has been unleashed this summer — and record-low mortgage rates have pushed even more buyers into the market. But the nation’s housing market faces some headwinds. Millions of Americans are delinquent on their mortgages right now. While most of those homeowners are in forbearance plans that allow them to put off payments for as long as a year because of the COVID-19 pandemic, it does pose a risk for the industry. “The danger is that rocketing delinquencies force lenders to pull back in order to preserve capital, thereby tightening the supply of mortgage credit,” Ian Shepherdson, chief economist at Pantheon Macroeconomics, wrote in a research note. If those delinquencies turn into foreclosures eventually, home prices will fall and mortgage rates would likely rise, resetting the overall sales market. Plus, the price of new homes is expected to continue to rise in part because of increasing lumber costs. That price appreciation could push some buyers out of the market, when coupled with the price growth that’s also occurring in the market for existing homes. What they’re saying: “Builders are already having trouble keeping pace with demand, and materials costs are rising rapidly, which will add to upward pressure on new home prices, meaning affordability will be more sensitive to any given increase in mortgage interest rates. And, with the labor market still in a state of ill repair, it is reasonable to question how long the strength in demand seen over the past few months can be sustained, even absent a meaningful increase in mortgage interest rates,” Richard Moody, chief economist at Regions Financial Corp., wrote in a research note. Market reaction: The Dow Jones Industrial Average DJIA, +0.56% and the S&P 500 SPX, +0.87% both fell in Tuesday morning trading, as did shares of home-building firms PulteGroup PHM, +0.02% , LGI Homes LGIH, +1.59% , and Lennar Corp. LEN, +0.07% ."}]}