{"article": [{"url": "https://www.marketwatch.com/story/gops-kennedy-says-hell-vote-for-fed-nominee-judy-shelton-expects-swift-action-11595289037", "published": 1595275100.0, "headline": "GOPâ\u0080\u0099s Kennedy says heâ\u0080\u0099ll vote for Fed nominee Judy Shelton, expects swift action", "body": "Judy Shelton testifies before a Senate committee on Feb. 13. Getty Images A Republican senator who had publicly held off endorsing Federal Reserve Board nominee Judy Shelton said Monday he would support her, likely clearing the way to a floor vote soon. â\u0080\u009cIâ\u0080\u0099m going to vote yes,â\u0080\u009d Sen. John Kennedy, a Louisiana Republican, told reporters after a late afternoon Senate vote at the U.S. Capitol. Kennedy is on the the Senate Banking Committee, which is set to consider her nomination Tuesday. Shelton, who was an informal Trump adviser during his presidential campaign, has been a longtime advocate for some form of tying the dollarâ\u0080\u0099s value to gold. She likely faces unanimous opposition from panel Democrats, and Kennedy had been publicly noncommittal about her before senators left for a two-week July 4 break. The committee will also vote on a second Trump Fed nominee, Christopher Waller, the director of research at the St. Louis Fed. Waller is expected to be confirmed easily. Kennedy said he read Sheltonâ\u0080\u0099s writings and weighed if she had the â\u0080\u009cintellectual heftâ\u0080\u009d and independence to be on the central bank board. â\u0080\u009cAnd she satisfied both of those criteria.â\u0080\u009d he said. The nomination could come to the floor quickly, he said. The Senate has three weeks remaining until the scheduled August break. â\u0080\u009cI think she will pass, sheâ\u0080\u0099ll be confirmed in the committee and, I donâ\u0080\u0099t know this for a fact, but my guess is that Sen. McConnell will move her nomination pretty quickly,â\u0080\u009d Kennedy said."}]}