{"article": [{"url": "https://www.marketwatch.com/story/nvidia-launches-new-generation-of-gaming-chips-announces-fortnite-will-introduce-ray-tracing-11598978708", "published": 1598977160.0, "headline": "Nvidia launches new generation of gaming chips, announces â\u0080\u0098Fortniteâ\u0080\u0099 will introduce ray tracing", "body": "Nvidia Nvidia Corp.â\u0080\u0099s stock closed at a record Tuesday as the chip company launched its new line of gaming cards and detailed more videogames that are taking advantage of the ray-tracing technology that was introduced in the previous line of graphics-processing units. Based on its Ampere architecture, released in May to replace its Turing and Volta chips with a single platform, Nvidia NVDA, -0.54% unveiled a series of gaming cards called the GeForce RTX 3070, the RTX 3080, and the top-of-the-line RTX 3090, which Chief Executive Jensen Huang referred to as â\u0080\u009ca beast.â\u0080\u009d Nvidia is keeping prices steady on its basic and mid-tier cards while slashing the price of its high-end card by $1,000. Huang announced the new chips in a YouTube video Tuesday morning, similar to his announcement of new Ampere-based server chips in May. The new cards build upon Turing architecture, which brought real-time ray tracing â\u0080\u0094 the rendering of realistic-looking lighting and shading â\u0080\u0094 to the fore. But when RTX ray tracing made its appearance two years ago, critics argued that developers were slow in putting out enough games that took advantage of the technology. Opinion:Â Nvidia hits a sweet spot, with both gaming and data center on the rise Nvidia addressed the games issue by noting that Epic Gamesâ\u0080\u0099 popular title â\u0080\u009cFortniteâ\u0080\u009d was now taking advantage of RTX, along with Microsoft Corp.â\u0080\u0099s MSFT, +2.48% â\u0080\u009cMinecraft,â\u0080\u009d Activision Blizzard Inc.â\u0080\u0099s ATVI, +0.52% â\u0080\u009cCall of Duty: Black Ops Cold Warâ\u0080\u009d and CD Projektâ\u0080\u0099s â\u0080\u009cCyberpunk 2077.â\u0080\u009d The company also said that for a limited time the purchase of a 30-series card would come with a version of Ubisoft Torontoâ\u0080\u0099s â\u0080\u009cWatch Dogs: Legionâ\u0080\u009d and a free one-year subscription to its GeForce Now cloud-gaming service. Nvidia said the RTX 3080 will be available Sept. 17, with the RTX 3090 available Sept. 24, and the RTX 3070 â\u0080\u009csometimeâ\u0080\u009d in October. That will give the company about six weeks of sales of the new cards before Nvidiaâ\u0080\u0099s fiscal third quarter finishes up at the end of October. Nvidia said the $499 RTX 3070 runs faster than its $1,199 RTX 2080 Ti, which is currently listed as out of stock, and up to 60% faster than its original RTX 2070, which was $499 when Nvidia launched its 20-series of Turing-architecture gaming cards two years ago. The upgrade to the RTX 2070, or the â\u0080\u009cSuperâ\u0080\u009d version that came out in July 2019, last listed at $499. Similarly, the mid-tier $699 RTX 3080 is up to two times faster than the RTX 2080, Nvidia said. The â\u0080\u009cSuperâ\u0080\u009d version of the 2080 card last listed at $699. At the high end, however, Nvidia appears to be offering a deep discount on improved performance. The company said its $1,499 RTX 3090 runs up to 50% faster and 10 times quieter than its flagship Titan RTX, which last listed at $2,499. Huang said demand for the limited-run Titan â\u0080\u009csurprised usâ\u0080\u009d as filmmakers were using the Titan to make 4K movies, bloggers used it to build broadcast workstations, and others used the card for applications that required its power. â\u0080\u009cThere is clearly a need for a giant GPU that is available all over the world, so we made a giant Ampere,â\u0080\u009d Huang said in his presentation. See also: Will videogames be the Achilles heel for Apple, Google in antitrust investigations? Nvidia would not comment on whether it would lower prices on its 20-series Turing cards. As of market close on Tuesday, the company had yet to change 20-series card pricing on its website, and was still offering its RTX 2060 Super card at $399. Rival Advanced Micro Devices Inc.â\u0080\u0099s AMD, -3.94% line of GPU cards ranges from the Radeon 5500 XT, which can go for less than $200, up to the $1,899 Radeon Pro VII, which is geared toward broadcasting and engineering professionals and was released in June. Less than two weeks ago, Nvidia execs talked a lot about gaming on the companyâ\u0080\u0099s earnings conference call even though data-center sales had surpassed gaming for the first time ever, with Huang forecasting â\u0080\u009cthis may very well be one of the best gaming seasons ever.â\u0080\u009d Earlier in the year, Nvidia topped Intel Corp. INTC, -1.03% as the largest U.S. chip company by market cap in July and went on to clear a $300 billion valuation for the first time in August. Nvidia shares closed at a record high for a third day in a row, rising 3.4% to finish at $552.84. For the year, Nvidia shares have soared 135%, while the PHLX Semiconductor Index SOX, +1.77% has gained 25%, the S&P 500 indexÂ SPX, +0.87% has advanced 9.2%, and the Nasdaq Composite Index COMP, +1.39% has grown 33%."}]}