{"article": [{"url": "https://www.marketwatch.com/story/patrick-mahomes-signs-10-year-contract-that-will-reportedly-be-the-richest-in-nfl-history-2020-07-06", "published": 1594115240.0, "headline": "Patrick Mahomes signs the largest contract in the history of U.S. sports â\u0080\u0094 worth $503 million", "body": "Patrick Mahomes, a 24-year-old quarterback who led the Kansas City Chiefs to a Super Bowl win on Feb. 2, 2020, was rewarded with a 10-year contract extension thatâ\u0080\u0099s worth over half a billion dollars. Mahomesâ\u0080\u0099s agency, Steinberg Sports, shared the dealâ\u0080\u0099s details on Twitter: The 10-year extension is worth $503 Million. â\u0080\u009cHe gets $477M in guarantee mechanisms and ability to have outs if guarantee mechanisms arenâ\u0080\u0099t exercised. No trade clause. First half billion dollar player in sports history. History made.â\u0080\u009d iframe.twitter-tweet { width: 100% !important; } ESPNâ\u0080\u0099s NFL insider Adam Schefter was the first to report on the deal, on July 6. Mahomesâ\u0080\u0099s contract is now the biggest in U.S. sports history. Until now, the largest U.S. sports contract belonged to baseball player Mike Trout, at $426.5 million. Mahomes will now have the highest average salary for the 2020 NFL season, at $45 million, according to Spotrac, which is $10 million more than the next player. iframe.twitter-tweet { width: 100% !important; } On Feb. 2, 2020, Mahomes was the youngest quarterback to ever be named a Super Bowl MVP, and he was named the NFLâ\u0080\u0099s MVP for the 2018 season. â\u0080\u009cSince he joined the Chiefs just a few years ago, Patrick has developed into one of the most prolific athletes in all of sports,â\u0080\u009d Chiefs chairman Clark Hunt said in a statement about the quarterback who led them to their first championship in 50 years. â\u0080\u009cWith his dynamic play and infectious personality, he is one of the most recognized and beloved figures to put on the Chiefs uniform. Heâ\u0080\u0099s an extraordinary leader and a credit to the Kansas City community, and Iâ\u0080\u0099m delighted that he will be a member of the Chiefs for many years to come.â\u0080\u009d iframe.twitter-tweet { width: 100% !important; } Speaking of community, Mahomes has been active off the field in recent months, using his fame to promote social causes that are important to him. In June 2020 he helped lead a voter-registration drive ahead of the November election. Also see:â\u0080\u0098I thought they were scamming meâ\u0080\u0099: Kansas City Chiefs superfan gets the surprise of a lifetime And he was one of a dozen NFL stars to make a video demanding the NFL condemn racism and â\u0080\u0098admit wrong in silencing players from peacefully protesting.â\u0080\u0099 The video came after a white police officer was caught on video killing a Black man named George Floyd. iframe.twitter-tweet { width: 100% !important; } â\u0080\u009cI believe in both my statement and the video we made. That stuff needed to be said,â\u0080\u009d explained Mahomes, who comes from a mixed-race family with a black father and white mother, giving him a unique perspective on the issue. â\u0080\u009cWe need to come together and show that black lives do matter. Itâ\u0080\u0099s great to feel the support we got from the Chiefs, from Coach Reid, and Iâ\u0080\u0099ve talked to (NFL commissioner) Roger Goodell and heâ\u0080\u0099s shown his support for us.â\u0080\u009d Mahomes said he discussed the social unrest with his father, former major league pitcher Pat Mahomes, and his godfather, former reliever LaTroy Hawkins. He also spoke with a number of current and former NFL players. This article includes reporting from The Associated Press."}]}