{"article": [{"url": "https://www.marketwatch.com/story/gold-prices-try-for-back-to-back-gains-as-metals-investors-bet-on-dovish-central-banks-2020-09-15", "published": 1600178960.0, "headline": "Gold notches back-to-back gains for highest finish in 2 weeks", "body": "Gold futures notched back-to-back gains on Tuesday to mark their highest finish in two weeks, ahead of what are expected to be dovish statements from global central banks this week that may provide renewed support for the precious metal. A rise in U.S. Treasury note yields and the stock market had pressured prices for the precious metal for part of the day's session. “There is a lot of clutter in the market impacting gold,” Jeff Wright, executive vice president of GoldMining Inc., told MarketWatch. U.S. industrial production numbers were lower than expected for August but still positive, and Empire State manufacturing data was well past estimates for September, so economic data were mixed, he said, adding that there are also central bank policy meetings to consider this week. The Federal Reserve will conclude its two-day meeting on Wednesday with a statement on monetary policy, while other policy decisions from Bank of England and the Bank of Japan will follow on Thursday. “We need a definitive FOMC statement with clear guidance on inflation. This will propel gold higher if dovish,” said Wright. Investors expect global policy makers to promote a regime of low interest rates for a prolonged period to combat COVID-19, which could lift both gold and stocks further, commodity analysts forecast. “Against this backdrop, these central banks will very likely convey a dovish message to the markets, which should mean higher stock and gold prices, everything else being equal,” wrote Fawad Razaqzada, market analyst at ThinkMarkets, in a daily note. For now, December gold GCZ20, +2.17% GC00, +2.17% rose $2.50, or 0.1%, to settle at $1,966.20 an ounce, marking the highest most-active contract settlement since Sept. 1, according to FactSet data. Meanwhile, December silver SIZ20, +5.96% SI00, +5.96% rose 11 cents, or 0.4%, at $27.464 an ounce, following a nearly 1.9% gain on Monday. “The Fed is in focus and may help break the gold price out of this consolidation-phase price range” it’s been stuck in for the last several weeks, Peter Spina, president and chief executive officer at GoldSeek.com, told MarketWatch. Among other metals, December copper HGZ20, +1.38% settled at $3.063 a pound, down 0.2%. October platinum PLV20, +3.99% tacked on nearly 2.5% to $982.20 an ounce and December PAZ20, +2.31% ended at $2,414.50 an ounce, up 3.9%. Analysts said that upbeat data from China, one of the largest importers of precious and industrial metals, may offer further momentum for the industry metals complex. Total retail sales of consumer goods grew 0.5% year-over-year last month, according to China’s National Bureau of Statistics."}]}