{"article": [{"url": "https://www.marketwatch.com/story/heres-a-pandemic-stock-tip-buy-on-the-rumor-of-a-covid-19-vaccine-sell-on-the-news-2020-08-14", "published": 1597479860.0, "headline": "Hereâ\u0080\u0099s a pandemic stock tip: Buy on the rumor of a COVID-19 vaccine, sell on the news", "body": "The stock market may fall when a COVID-19 vaccine formally receives approval from the Food and Drug Administration. I know Iâ\u0080\u0099m getting ahead of myself, since itâ\u0080\u0099s not guaranteed that an effective vaccine will ever be produced. But with eight vaccines now in Phase III trials, and with Russia claiming bragging rights by being the first to register a vaccine, itâ\u0080\u0099s not too early to begin thinking about how you should react when formal FDA approval for a vaccine is forthcoming. To be sure, I am reminded of the old proverb that it is difficult to make predictions, especially about the future. I nevertheless began my speculation by searching through U.S. history to measure how the stock market in the past reacted to long-awaited good news. I found only four in the 20th Century that I deemed to be as fateful and significant as a COVID-19 vaccine could be: The end of World War I (Armistice Day), V-E and V-J days at the end of World War II, and Jonas Salkâ\u0080\u0099s announcement of a successful polio vaccine. Be my guest to suggest other events for my subset. But the four I picked were unquestionably momentous. Following the formal ends of both world wars, for example, millions across the Allied nations poured into the streets in celebration. Life magazine wrote that Americans, after hearing of Japanâ\u0080\u0099s surrender, began celebrating â\u0080\u009cas if joy had been rationed and saved up for the three years, eight months and seven days since Sunday, Dec. 7, 1941 [the day of the attack on Pearl Harbor].â\u0080\u009d I also focused on the announcement of the successful polio vaccine because it is arguably the closest analog to an eventual COVID-19 vaccine. Polio epidemics were common during the first half of the 20th century. However wonderful each of these events was, the Dow Jones Industrial Average DJIA, +0.56% Â fell on the news â\u0080\u0094 as you can see from the chart below. There are several explanations for this surprising result. 1. Discounting the future: The stock market discounts the future. Though each of these four events was unambiguously good news, none was entirely unexpected. We can easily overlook that from our decades-later perspective. In both world wars, for example, the military tide had been turning in the Alliesâ\u0080\u0099 favor for some time prior to the formal surrender declarations. And work on a polio vaccine had been progressing for many years. As a result, the stock market prior to these four announcements had already reflected the good news. This process of the market discounting the increasing probability will probably be even truer in the weeks leading up to an eventual FDA approval of a COVID-19 vaccine. The news media today obsessively reports every medical development and the results of each trial, and biotech companies are willing co-conspirators in this. FDA approval of a vaccine, when it comes, could be more of a non-event than we think. One possible scenario is that the market rallies as it becomes increasingly clear that vaccine approval is close. When that approval finally arrives, retail investors could very well jump into the market with both feet. In contrast, institutional money managers and professional traders â\u0080\u0094 the smarter money â\u0080\u0094 will likely use that occasion to start selling. This isnâ\u0080\u0099t a new phenomenon. It is common enough, in fact, that Wall Street has an aphorism to describe it: â\u0080\u009cBuy on the rumor, sell on the news.â\u0080\u009d 2. Political considerations: Another reason an FDA approval announcement might not be met with a Wall Street rally is the widespread distrust of the process by which vaccines are being hurriedly developed. The FDA has already set a relatively low bar â\u0080\u0094 just 50% effectiveness â\u0080\u0094 and many already are voicing concern that whatever vaccine gets approved will not have received the same degree of rigorous safety testing that previous vaccines have received. Regardless of whether these concerns have merit, they have economic consequences. The slow adoption of a marginally effective vaccine will not lead to a quick end to the pandemic or to a particularly strong and quick economic recovery. As one institutional money manager told me on background, FDA approval of a vaccine might â\u0080\u009cbe the last bit of good news possible, and selling would be a correct decision.â\u0080\u009d Itâ\u0080\u0099s worth mentioning in this regard the stock marketâ\u0080\u0099s reaction to Russian President Vladimir Putinâ\u0080\u0099s announcement that Russia has registered the first COVID-19 vaccine: The S&P 500 SPX, +0.87% Â fell 0.8% on the day. The bottom line? While we can only make an educated guess what the market will do if and when the FDA finally approves a COVID-19 vaccine, donâ\u0080\u0099t be surprised if the market falls rather than rises. Mark Hulbert is a regular contributor to MarketWatch. His Hulbert Ratings tracks investment newsletters that pay a flat fee to be audited. He can be reached at mark@hulbertratings.com More:CDC director warns America is in for the â\u0080\u0098worst fallâ\u0080¦weâ\u0080\u0099ve ever hadâ\u0080\u0099 Plus: Stocks could be melting up like they did in the Roaring â\u0080\u009920s, strategist says â\u0080\u0094 we all know what happened next"}]}