{"article": [{"url": "https://www.marketwatch.com/story/jobless-claims-rise-154-million-in-early-june-but-fewer-people-are-collecting-benefits-2020-06-11", "published": 1591870100.0, "headline": "U.S. jobless claims rise slower 1.54 million in early June, but layoffs still extremely high", "body": "The numbers: Some 1.54 million Americans applied for traditional jobless benefits in early June and more than 700,000 sought compensation though an emergency federal program, reflecting both a steady decline in job losses from the coronavirus but a still-worrisome number of layoffs. Initial jobless claims slowed to 1.54 million in the seven days ended June 6 from a revised 1.9 million at the end of May, the Labor Department said Thursday. The figures are seasonally adjusted. Economists polled by MarketWatch had forecast 1.6 million new claims filed the usual way through state unemployment offices. Read:U.S. entered recession in February after end of longest expansion in history New applications for benefits have dwindled since peaking at almost 7 million in late March, but they are still extremely high. Before the pandemic paralyzed the U.S. economy in March, new claims were running in the low 200,000s and sat near a 50-year low. In a good sign that shows more workers are returning to their jobs, the number of people actually collecting traditional jobless benefits fell slightly in the week of May 30. These so-called continuing claims are reported with a one-week lag. What happened: Along with jobless claims filed the usual way, 705,676 applications were submitted under a temporary federal-relief program put in place after the pandemic began. Forty-two states reported figures for federal claims under the Pandemic Unemployment Assistance program. The federal law provides benefits for workers who were never eligible in the past, such as the self-employed, because they did not contribute to the joint state-federal unemployment fund like most companies do. That put the total number of new claims at an unadjusted 2.24 million in the first week of June, compared to 2.42 million in the prior week. To give a clearer picture of unemployment, MarketWatch is also reporting select jobless claims data using actual, or unadjusted, figures. The seasonally adjusted estimates typically expected by Wall Street have inflated jobless claims during the pandemic and become less accurate. Continuing claims filed through the states, meanwhile, slipped to an unadjusted 18.9 million in the week of May 30 from 19.1 million. That’s down from a pandemic peak of nearly 23 million. See:Marketwatch’s Coronavirus Economic Recovery Tracker. If all eight state and federal assistance programs are included, continuing claims totaled an unadjusted 29.5 million in the seven days ended May 23, the most recent data available. That marks a small drop from 30.2 million in the prior week. Read: Consumer prices drop again as pandemic cuts rate of inflation to near zero Big picture: More than 47 million new jobless claims have been filed since the crisis took root three months ago, an unfathomable number that shows just how much devastation COVID-19 has caused to million of Americans and the U.S. economy. The huge number of new claims, however, also overstates the damage. Millions of people have been returning to work as the economy reopens and there’s likely been a lot of duplicative claims during the crisis owing to massive technology snafus at overwhelmed state employment offices. Still, the unemployment rate sits at a modern record high and many people are likely to find they don’t have a job to return to, especially in businesses that rely on dense clusters of customers such as travel, entertainment and dining out. Read: Revisiting that funky drop in unemployment to 13.3%: Nobody really believes it The unprecedented blow to the labor market is widely expected to result in a prolonged recovery that leaves lasting damage to the economy. What they are saying? “Continuing claims have fallen in two of the past three weeks, and are down 16% from their peak in early May, as laid-off workers are recalled to their jobs,” said chief economist Gus Faucher of PNC Financial Services. “The worst in the labor market appears to be over, but it is still in terrible condition from the viral recession.” Market reaction:The Dow Jones Industrial Average DJIA, +0.56% and S&P 500 SPX, +0.87% fell sharply in Thursday trades. Stocks have been rising lately amid a raft of signals indicating the economy is starting to grow again, but a pessimistic outlook by Federal Reserve Chairman Jerome Powell dampened the optimism on Wall Street."}]}