{"article": [{"url": "https://www.marketwatch.com/story/the-problems-with-aging-in-place-2020-10-06", "published": 1601978300.0, "headline": "The problems with â\u0080\u0098aging in placeâ\u0080\u0099", "body": "This article is reprinted by permission from NextAvenue.org. It is an excerpt from the new book, â\u0080\u009cThe Senior Years Master Planâ\u0080\u009d by Ralph Mroz. Surveys show that most people would prefer to grow older, and even die, in their own home. This desire isnâ\u0080\u0099t hard to understand. While you may have already downsized to a more manageable home or condo, you wonâ\u0080\u0099t have to move again, which is emotionally straining, physically taxing and can be financially cumbersome.Â Aging in placeÂ also lets you remain in your familiar surroundings, close to friends and possibly family. And there are other advantages. But thereâ\u0080\u0099s a flip side to aging in place that needs to be weighed: You may have to move again if you canâ\u0080\u0099t be adequately cared for in your home, and itâ\u0080\u0099ll be much harder when you are older and in worse health. You can become isolated, especially if you can no longer drive. Caregiving help can get expensive and hard to find if you need it. If you have mobility problems, itâ\u0080\u0099s easy to be mostly confined to your home. Your home may become a burden, with its continual needs for maintenance and upkeep. Itâ\u0080\u0099s easy to think that aging in place will be less costly than moving to a retirement community or assisted living. But this reasoning overlooks that your stay-in-home costs will increase, because you will need more care as you age. You may also need to hire trusted advisers to help you find competent, responsible and honest caregivers and home contractors.6 potential disadvantages of aging in place Let me go into a little detail about some of the disadvantages of aging in place. 1. Handling sudden health declines.Â Your aging in place plan may be going swimmingly: youâ\u0080\u0099ve made the appropriate home modifications, youâ\u0080\u0099re getting the help that you need and youâ\u0080\u0099re doing fine. Then something happens. Maybe you have a stroke, maybe you have a debilitating fall, maybe an accident, maybe a sudden onset illness â\u0080\u0094 something occurs suddenly that means you need a significantly higher level of care. Now â\u0080\u0094 right now â\u0080\u0094 you need a different living arrangementâ\u0080¦ and because of the event you havenâ\u0080\u0099t the time, energy or perhaps competence to manage the transition yourself. Also read: Is it safe to retire in a college town in the pandemic? Now youâ\u0080\u0099re at the mercy of whatever help family members may be able to provide. That help may not be much given your distance from them or your relationship with them; some may be too old or infirm themselves to help. 2. Youâ\u0080\u0099ll miss needed repairs or wonâ\u0080\u0099t have the money for them. Weâ\u0080\u0099ve all been in older peopleâ\u0080\u0099s homes that were in disrepair, even if they could afford to keep them up. Maybe they didnâ\u0080\u0099t notice the mold under the sink, smell the sewer backing up in the cellar, hear the mice in the walls eating the wiring, see the dirty toilet or note the roof deteriorating. Some are unable to pay for these repairs or worry about tapping their savings to do so. Thereâ\u0080\u0099s a tendency for your home to decline as you age in it. If you plan to age in your home, youâ\u0080\u0099ll likely need modifications to accommodate or compensate for the inevitable physical limitations youâ\u0080\u0099ll accumulate. Everyone knows about installing showerÂ grab barsÂ and entrance ramps and eliminating slip and fall hazards. But less obvious things include installing lever-style doorknobs and more and brighter lighting. The National Association of Home Builders has an Aging-in-Place certification, and there are other national organizations that certify and train people to advise you on these modifications, usually with comprehensive checklists of possible improvements. An experienced adviser will suggest useful â\u0080\u0094 often necessary â\u0080\u0094 modifications. 3. Youâ\u0080\u0099re dependent on your spouse or partner.Â If you are aging in place as a couple, you may depend on one of you to be more competent in a given area. One person may be good with repairs and cooking, the other with financial and medical issues. But when one half of an aging couple dies or declines significantly, the affairs they handled must be able to be picked up by the remaining partner. Since that might not be possible, you need a plan in place to backfill for the missing personâ\u0080\u0099s competence. 4. If you have spouse or partner, they mayÂ need basic nursing skills.Â Medical issues tend to increase as we age. So, at some point, you might need to assist with changing dressings, giving medications (perhaps shots), inserting suppositories, helping your partner with bathroom tasks and so on. A lot of people are squeamish about, or unwilling, to do these things. You can get instruction and coaching on how to perform tasks from your medical providers, but you have to be willing to do them. 5. You may decline mentally.Â Mental and cognitive decline as we age is inevitable, although it will affect some severely and some not as much. See: â\u0080\u0098A criminal sociopath:â\u0080\u0099 Judge-appointed conservator drained my momâ\u0080\u0099s estate and kept us from her If you live alone, this kind of decline could become dangerous or unhealthy. You might not remember to take your meds or eat well. You might ignore problems with wiring or the gas line. 6. Fire hazards can increase. Older people are more likely than younger ones to forget to maintain (or replace) their fire, smoke and CO2 detectors. Because older people get colder more easily, they are big users of portable heaters, which have well-known fire hazards. Hoarding is perhaps the biggest fire hazard older people face. As you age, you can lose the physical, mental and emotional energy necessary to get rid of stuff you donâ\u0080\u0099t need.Advice for people in their 60s My advice: in your 60s, assess the probability of needing to make a residence change in the next five years. If your situation, including your health and family health history, indicates you have a decent chance of needing assistance in that period, you might want to explore housing options in the area where youâ\u0080\u0099d like to live. Or you could either make aging in place modifications to your home or research the kinds of in-home assistance available in your area. See: Half of Americans over 55 may retire poor If you believe the odds that you (and a spouse or partner if you have one) will be healthy and able in five years, then revisit the probabilities then. But from age 65 or so, have a plan! This article is an excerpt from the new book, â\u0080\u009cThe Senior Years Master Planâ\u0080\u009d by Ralph Mroz. As a boomer, Ralph Mroz found he had to research many of the aspects of aging in order to plan effectively for the upcoming decades. Because there was no single resource that summed up the many aspects of aging that require planning and action, he wrote â\u0080\u009cThe Senior Years Master Plan.â\u0080\u009d Now retired, he volunteers at his local dog shelter and is involved with a police reform organization in his home commonwealth of Massachusetts. This article is reprinted by permission from NextAvenue.org, Â© 2020 Twin Cities Public Television, Inc. All rights reserved."}]}