{"article": [{"url": "https://www.marketwatch.com/story/most-fed-officials-at-june-meeting-agreed-on-need-to-clarify-what-could-cause-them-to-move-interest-rates-off-zero-2020-07-01", "published": 1593617420.0, "headline": "Most Fed officials at June meeting agreed on need to clarify what could cause them to move interest rates off zero", "body": "Most Federal Reserve officials at their meeting last month agreed that the central bank should provide more clarity to financial markets about the path of the central bank’s benchmark interest rates, according to minutes of the meeting released on Wednesday. Officials were in agreement with a need to give markets more information about what would cause the central bank to keep rates close to zero or move them higher. This is called “forward guidance” among monetary policy experts. “Most [Fed officials] commented that the FOMC should communicate a more explicit form of forward guidance for the path of the federal funds rate and provide more clarity regarding purchases of Treasury securities and agency MBS as more information about the trajectory of the economy becomes available,” the Federal Open Market Committee minutes said. Many Fed watchers think the Fed will wait until September at least to take this step. The Fed has some experience with forward guidance. In late 2012, the Fed said it would keep rates at zero until the unemployment rate fell to 6.5% or inflation hit 2.5%. In their discussion about this year, a “number” of Fed officials wanted to tie any rate hike to a modest overshoot of the Fed’s 2% inflation target. A “couple” of others favored tieing it to the unemployment rate. A “few” suggested setting a specific date. A couple of other Fed officials warned that committing to very low interest rates for a long time would pose significant risks to financial stability. Most Fed officials also agreed that asset purchases can help the economy recover from the pandemic, primarily as a tool to keep the long-end of the yield curve flat. Officials said more work was needed on another possible tool — yield curve control — that could put a cap on longer-term rates. At their June meeting, Fed officials kept the benchmark federal funds rate in a range of 0% to 0.25% and put out a projection showing officials expect the rate to remain steady until 2023. Officials also agreed to keep asset purchase, which have included Treasurys and agency mortgage-backed securities, at least at the current pace of $120 billion per month. U.S. stocks DJIA, +0.56% were little changed after the publication of the minutes on Wednesday. At their meeting, “a number” of Fed officials judged that there was a substantial chance of additional “waves of outbreaks” of the coronavirus. Another source of risk was that fiscal help for households, businesses, and state and local governments might prove insufficient. At the June meeting, the Fed staff downgraded their projection for the economy from their prior forecast in April based on how the pandemic was evolving. The staff said their pessimistic forecast of a second wave of coronavirus outbreak later this year and subsequent economic damage was just as plausible as the more benign baseline forecast. Fed officials said there were signs that consumer spending was stabilizing or rebounding modestly right before their June 9-10 meeting. Spending was expected to improve starting in July but “was not expected to be particularly rapid” beyond this year. Voluntary social distancing, precautionary saving and lower levels of employment and income would restrain the pace of expansion over the next 18 months or two years, the Fed said. Fiscal policy would have to play important roles to ensure a strong recovery, officials said. Officials were wary of the stronger-than-expected May job report, saying that it was too soon to draw firm conclusions about whether April was the trough of the recession. “Overall Fed officials expected that a full recovery in employment would take some time,” the minutes said. Even though some economists worry about rising inflation will be the ultimate result of the pandemic, Fed officials said the lockdown will be disinflationary. Fed officials noted that the central bank will have to keep monetary policy highly easy for some time to achieve their 2% inflation target."}]}