{"article": [{"url": "https://www.marketwatch.com/story/astrazeneca-vaccine-most-likely-to-roll-out-in-the-uk-early-next-year-2020-09-07", "published": 1599565160.0, "headline": "AstraZeneca vaccine 'most likely' to roll out in the U.K. early next year", "body": "U.K. health secretary Matt Hancock on Monday said a COVID-19 vaccine would \"most likely\" be available in the first few months of 2021, as the country recorded a sharp rise in daily coronavirus cases. Speaking on national news radio station LBC, Hancock said the government has already started production of the U.K. government's initial order of 30 million doses of its coronavirus vaccine, which is being developed by pharmaceutical giant AstraZeneca AZN, +1.16%  in collaboration with the University of Oxford. \"We have got 30 million doses already contracted with AstraZeneca, in fact they are starting to manufacture those doses already, ahead of approval, so that should approval come through - and it's still not certain but it is looking up - should that approval come through, then we are ready to roll out,\" Hancock told LBC. \"The best-case scenario is that happens this year. I think more likely is the early part of next year - in the first few months of next year is the most likely,\" he added. U.S. President Donald Trump is reportedly considering plans to fast-track approval of AstraZeneca's vaccine in a bid to make it available to Americans before November's election. The vaccine hasn't been approved for use and is still undergoing late-stage clinical trials in the U.K., Brazil and South Africa. Read:AstraZeneca coronavirus vaccine heads to late-stage study Hancock's comments come after the U.K. recorded a surge in the number of people testing positive for coronavirus. On Sunday, a further 2,988 cases of coronavirus were reported in the country, the highest number reported on a single day since May 22, and a rise of 1,175 on Saturday, according to the U.K. government's coronavirus dashboard. Two deaths were recorded within 28 days of a positive COVID-19 test in the previous 24 hours, taking the total to 41,551, the government said. The rise in cases prompted Professor Gabriel Scally, a former National Health Service regional director of public health for the south west, to tell the Guardian that the government had \"lost control of the virus.\" Hancock on Monday denied the government was losing control, but said that this weekend's rise in cases was \"concerning.\" He urged younger people to adhere to social distancing measures, saying that under-25s, particularly those aged 17 to 21, accounted for a large number of positive cases. The spike in cases comes as people are returning to work and school, and as universities prepare to reopen. \"It is concerning because we have seen a rise in cases in France, in Spain, in some other countries across Europe - nobody wants to see a second wave here,\" Hancock told LBC. \"It just reinforces the point that people must follow the social distancing rules, they are so important,\" he said, adding, \"But we've also bought vaccine ahead of it getting approved from a whole different series of international vaccines as well.\" Read:U.K. strikes two COVID-19 vaccine deals for 90 million doses In August, the U.K. announced that it will buy 90 million doses of potential COVID-19 vaccines from Johnson & Johnson JNJ, +1.39%  and U.S. drug developer Novavax NVAX, +0.18%. Some people with coronavirus are being asked to travel hundreds of miles to get tested, according to the BBC. Labour's shadow health secretary, Jonathan Ashworth, on Sunday tweeted that the increase in COVID cases is \"deeply worrying\" and demanded Hancock give a statement to the House of Commons to explain the increase in cases and why some people are still being told to drive hundreds of miles to have a test."}]}