{"article": [{"url": "https://www.marketwatch.com/story/uber-and-lyfts-day-of-reckoning-is-finally-here-2020-08-11", "published": 1597301300.0, "headline": "Uber and Lyftâ\u0080\u0099s â\u0080\u0098day of reckoningâ\u0080\u0099 is finally here", "body": "Investors in the two big publicly traded ride-hailing giants, Uber and Lyft, have been warned that this day may eventually come. Uber Technologies Inc. UBER, -0.18% Â and Lyft Inc. LYFT, +2.16% have been fighting all legal attempts to change the status of their drivers from independent contractors to employees, avoiding the additional costs of providing benefits and protections. They have based their businesses on this structure and spent millions fighting for it in courts and statehouses across the U.S., and beyond. The facade finally fell Monday afternoon. A judge in San Francisco Superior Court issued an injunction in a lawsuit filed by three cities in California against the ride-hailing companies over the status of their drivers. The lawsuit, filed in May, contends that the companies are violating a new California law that passed in January, called AB-5, that seeks to classify their drivers as employees. More from Therese: Uber and Lyft IPOs mean the cheap rides are coming to an end â\u0080\u009cDefendants are not entitled to an indefinite postponement of their day of reckoning,â\u0080\u009d wrote San Francisco Superior Court Judge Ethan Schulman, in his ruling that ordered the companies to begin treating drivers as employees but gave them 10 days before his injunction goes into effect. Both companies said they plan to appeal the ruling. California has been making moves against the tech companies that largely spring from Silicon Valley while Washington talks about the issues but does nothing. Beyond seeking to protect gig-economy workers, the state passed a landmark data-privacy bill this year, and is confronting gender-equity issues such as corporate boards packed with white men. For more: How tech companies are fighting back against Californiaâ\u0080\u0099s new laws The ride-hailing companies and other â\u0080\u009cgig economyâ\u0080\u009d companies heavily dependent on contract workers have been under fire for several years for the employment status of their drivers, with court battles raging since 2013. Shannon Liss-Riordan, a Boston lawyer who earlier this year dropped out of the race for a seat in the U.S. Senate, filed class-action lawsuits against Uber, Lyft and several other on-demand services companies, in an effort to rewrite the rules of gig economy and get full benefits for contract workers. While Liss-Riordan drew attention to the plight of ride-hailing drivers, some of those cases ended in settlements that did nothing to change the business models of these companies, a similar fate for many other battles as the companies have argued that the drivers want to remain independent contractors. Read about Uberâ\u0080\u0099s $20 million settlement of class-action suit before its IPO Uber still feels it can win this fight as well, continuing with a constitutional challenge to the new law, though Schulman said Monday that the state has an â\u0080\u009coverwhelmingâ\u0080\u009d lead in that case. â\u0080\u009cNone of the pending lawsuits and arbitrations can replace the legislatureâ\u0080\u0099s express statutory grant of authority to the Attorney General and City Attorneys to seek injunctive relief to prevent the continued misclassification of employees as independent contractors,â\u0080\u009d he wrote in a strongly-worded opinion. The judge noted that the defendants, which have both argued that they would be â\u0080\u009cwhipsawedâ\u0080\u009d and suffer grave and irreparable harm from such an injunction, should have begun incurring the costs required to restructure their business more than two years ago, when the California Supreme Court made a unanimous decision in the Dynamex case that was the genesis of the new California law, a case in which the court held that most workers are employees and ought to be classified as such. Full news story: Uber and Lyft must make drivers employees, judge says Investors should have been prepared for this eventuality as well. Both companies warned of legislative and legal battles regarding their business models and practices in their filings for 2019 initial public offerings. If you know the history of Uber growing worldwide by breaking the law on a massive scale, you should know that it cannot escape recriminations for those actions forever. Uber and Lyft will not give up the fight to keep their drivers as independent contractors. They have joined on a statewide proposition to be voted on in November seeking to exempt both companies from the new law. They will continue to dump litigation money down the drain in California and anywhere else that attempts to fight back against their employment practices. And some on Wall Street will continue to insist they will win in the end. One analyst said Tuesday that he is actually more concerned about the coming November ballot measure, Proposition 22, and called the news about the judgeâ\u0080\u0099s injunction â\u0080\u009cnot much more than a headline.â\u0080\u009d â\u0080\u009cThe ruling will likely have no near-term operational impact, nor will it increase or decrease the risk of contagion to other states,â\u0080\u009d wrote Evercore ISI analyst Benjamin Black, in a note. â\u0080\u009cOn the other hand, the outcome of the November ballot measure (Proposition 22) could present disruptive operational challenges, and also likely dictates non-California state regulatorsâ\u0080\u0099 appetite to pursue similar legislation aimed at reclassifying driversâ\u0080\u0099 employment status.â\u0080\u009d Eventually, as this column has said since before the companies went public, the costs of their rides and deliveries will have to increase, and with new costs, that will get in the way of their plans to eventually become profitable. Facing that truth amid a pandemic that is slaughtering the ride-hailing business, Uber and Lyft are finally receiving a long-gestating comeuppance."}]}