{"article": [{"url": "https://www.marketwatch.com/story/vaccine-hopes-drive-gains-for-european-stocks-and-u-s-equity-futures-11594799990", "published": 1594786040.0, "headline": "Vaccine hopes drive gains for European stocks", "body": "Tourists stroll in downtown Rovinj, on the Istrian peninsula in the Adriatic Sea, on July 4, 2020. Denis Lovrovic/Agence France-Presse/Getty Images European stocks rallied Wednesday, as investors embraced positive news surrounding a coronavirus vaccine candidate. The Stoxx Europe 600 index FXXP00, +0.10% rose 1.9% on the heels of a 0.8% loss on Tuesday. The index is now up 2% for the week so far. Elsewhere, the German DAX DAX, +0.06% gained 2% and the French CAC PX1, +0.71% rose 2.5%. The FTSE 100 UKX, +0.64% was up 2%. After the close of U.S. markets on Tuesday, biotech group Moderna MRNA, +0.09% said its coronavirus vaccine candidate produced a “robust” immune-system response in a larger group of people and the study will move to a decisive clinical trial in July. Separately, a U.K. television broadcaster said positive news on the University of Oxford vaccine backed by AstraZeneca AZN, +5.61% may be released. AstraZeneca shares jumped 5%. “Although a mismatch between financial markets and the real economy remains in full effect, the removal of a single recessionary input (the virus) via a vaccine can pave the way for fast economic recovery,” said Stephen Innes, chief global markets strategist at AxiCorp. “So, the positive news on the virus vaccine can go a long way to explain the dissonance between the shift in the stock market sentiment relative to the angst on Main street,” Innes added, in a note to clients. U.S. stocks traded higher, with the Dow industrials DJIA, +0.56% up 1.3%. U.S. stocks closed near session highs on Tuesday, boosted by a call from Federal Reserve Gov. Lael Brainard for the bank to carry out sustained large-scale asset purchases to help the economy rebound amid a “thick fog of uncertainty” caused by COVID-19. Stocks in Asia fell, with the CSI 300 000300, +2.04% down 1.2% amid concerns over U.S.-China tension. President Donald Trump on Tuesday said he signed a China sanctions bill targeting Beijing’s crackdown in Hong Kong, Shares of heavily weighted ASML Holding NV ASML, +1.83% fell 2.8% after the maker of microchip equipment reported a sharp gain in second-quarter profit, driven by higher sales, but the latter fell short of analyst expectations. The company said its growth outlook for 2020 remains unchanged relative to the start of the year despite the coronavirus pandemic. Burberry Group PLC BRBY, +0.97% was the biggest decliner on the Stoxx 600, down 8% after the British fashion label reported a 45% drop in first-quarter sales, with sales in the second quarter expected to fall by 15% to 20% . Shares of Atlantia ATL, +3.56% surged 25% after the Italian holding company’s motorway operator Autostrade per l’Italia reportedly made an last-attempt offer to save its license, under threat of being stripped by the government after the 2018 collapse of a bridge in Genoa. Citing sources, Reuters reported that Autostrade’s offer would consist of state lender Depositi e Prestiti (CDP) taking a stake of 51% in Autostrade via a capital increase. Atlantia would eventually surrender ownership of Autostrade. Travel stocks took off on hopes that a vaccine could be near, with shares of Carnival PLC CUK, -0.44% and International Consolidated Airlines Group PLC IAG, -3.72% up 10% and Ryanair Holdings PLC RYA, -2.60% up 9%."}]}