{"article": [{"url": "https://www.marketwatch.com/story/professional-investors-have-their-eye-on-these-eight-stocks-as-the-used-car-market-in-the-us-moves-online-2020-10-02", "published": 1601881220.0, "headline": "Professional investors have their eye on these eight stocks as the used-car market in the U.S. moves online", "body": "The big talk in the auto industry has been around electric cars and their eventual role in autonomous driving. But the used-vehicle market in the U.S. is more than twice as large as the new-car market on a unit-sales basis. So it’s worth taking a close look at how the used market is evolving and how you might profit from it. The media is fixated on the other big change in the U.S. auto market — the acceleration of the electric-vehicle industry led by Telsa Inc. TSLA, +1.89%, whose stock rose 245% during the third quarter. You may have missed out on Tesla’s gain, unless it is held by an index fund you own, but there are other ways to invest in the electric-car revolution. According to Statista.com, 40.8 million used cars and trucks were sold in the U.S. in 2019, compared with 17 million new vehicles sold. You can see market comparisons for the past 10 full years here.Moving online Shares of Carvana Co. CVNA, -0.25% have been on a tear, rising 147% this year. The company buys and sells cars online and uses its own national transportation network to move cars from its nine reconditioning centers to buyers, with cars delivered to their homes, or to one of the company’s “vending machines.” (One is shown above.) During the second quarter, Carvana sold 55,098 vehicles, an increase of 25% form a year earlier. That’s remarkable when you consider the chilling effect of COVID-19 on the market. At an annualized pace of 220,392 units sold, Carvana would still have captured only 0.5% of total 2019 used-car sales market in the U.S. So there’s a runway for growth. Gabelli Funds analyst Shawn Kim called the U.S. car market “highly fragmented,” with 43,000 used dealers, including nearly 16,700 franchised dealers (according to NADA) that sell new and used vehicles. “From an investor’s point of view, that is incredibly attractive,” Kim said. He believes that because the market is so large and nowhere near to consolidating, Carvana isn’t the only company that will benefit from the online trend. He sees plenty of room for newer, smaller players, such as Vroom Inc. VRM, -0.26% and Shift Technologies, which plans to go public by merging with Insurance Acquisition Corp. INSU, +3.47%, a special purpose acquisition company, known as a SPAC. He also believes the large publicly traded traditional used-car dealers can participate in the online trend. Kim emphasized the opportunity offered by the public’s negative perception of traditional car dealers. “Historically, it has been a terrible process,” he said, adding that small local dealers who cannot adopt online technology “are going to be smoked.” Rebecca Lindland, an auto-industry consultant who has worked for Cox Automotive’s Kelley Blue Book and now operates her own rebeccadrives consultancy, said the transition of the U.S. consumer market from baby boomers to younger generations means “technology is moving at measures of months and years of adoption rather than decades of adoption.” The ease of online interaction and movement away from the traditional dealer experience, including haggling, places pressure on the industry, she said, especially for “smaller mom-and-pop operations.” “Companies like Carvana and Vroom appeal to younger buyers,” she said. “They want tech as a convenience and to trust the process.” More about “trust” in a moment.Carvana’s head start Clifford Sosin, the founder and portfolio manager of CAS Investment Partners in New York, says Carvana is the only smart way to invest in the online used-auto trend, because its business model is so “difficult to replicate.” “One of the things about this business is that it is characterized by enormous economies of scale, scope, skill and trust,” he said during an interview. Sosin manages a $1.4 billion portfolio, with shares of Carvana making up 54.7% of the total, according to the latest data available from FactSet. CAS Investment Partners holds 4.86% of Carvana’s outstanding Class A shares, according to FactSet. Sosin first bought shares of Carvana early in 2018. Carvana went public in April 2017. He described in detail the efficiency of Carvana’s hub-and-spoke transportation network, which enables it to move cars very long distances at relatively low cost, because it is continually shipping cars between reconditioning centers on set schedules. “You have to do a number of parallel businesses right to succeed” online, he said, including the efficient transportation and refurbishment, but also many details investors may overlook, such as the software needed to allocate transportation resources efficiently. These skills are “accumulated over time,” giving Carvana the advantage. When discussing “trust,” Sosin agreed with Kim and Lindland that the traditional car-buying experience is grating. But he also pointed to the online advantages of Carvana’s business model, which isn’t only selling cars, but also “facilitating a change in cars.” It is easy to get a quick quote on Carvana’s website if all you want to do is sell your car. Or you can do a trade-in. Carvana also offers financing, and the entire process can be done through a smartphone app. It’s up to Carvana to win repeat customers by delighting them with the process, and it seems they are well on their way, considering how rapidly sales are increasing. Carvana cuts out a middleman who takes a cut. Unless you are trading in a car that is only a few years old or returning a car you leased new, the dealer who takes your old car is likely to sell it to an auction house, who will then sell it to a used-car dealer. “So there are two dealers and an auction house between owners. Plus shipping,” Sosin said. Not only does this mean that the traditional process is far more expensive than Carvana’s process, it means that if the consumer who wants the car is far away, he or she won’t be able to get that car. Carvana ships them across the country. Sosin said Vroom is “on the right path,” but that “it will be very difficult for them to catch up” to Carvana.Older, cheaper Since Carvana and Vroom are focused on growth, and not on reporting profits, an investor cannot simply look at price-to-earnings ratios for comparison. Sosin also cautioned against looking at any single metric. “I think about how many cars they should be able to sell per year when they are big and grown up and how much they should make car selling those cars, how long it will take for them to grow up and how much they will earn between now and then,” he said. Getting back to the fragmented used-car market, Kim believes large, traditional dealers still have a chance to compete. Here are six of them, sorted by market capitalization: Company Ticker Market cap. ($ millions) Total return - 2020 Forward P/E ratio CarMax Inc. KMX, -1.02% $15,088 4.8% 17.1 AutoNation Inc. AN, -1.70% $4,616 8.8% 8.9 Penske Automotive Group Inc. PAG, -0.37% $3,829 -4.3% 8.1 Asbury Automotive Group Inc. ABG, -0.39% $1,880 -12.8% 8.1 Group 1 Automotive Inc. GPI, -2.12% $1,614 -11.3% 6.5 Sonic Automotive Inc. Class A SAH, -1.02% $1,228 31.1% 9.2 Source: FactSet You can click on the tickers for more about each company, including corporate profiles, analysts’ ratings and news coverage. You may have to scroll the table at the bottom to see all the data. CarMax Inc. KMX, -1.02% is not only the largest, it also has the highest forward price-to-earnings ratio among the group, at 17.1. But that compares to a forward P/E of 25.1 for the S&P 500 Index SPX, +0.87%, according to FactSet. CarMax reported retail used-vehicle sales of 217,330 units for its fiscal second quarter ended Aug. 31. An annual pace of 869,320 would make for a market share of more than 2.1%, based on the 40.8 million total for U.S. used sales in 2019. (That figure was a peak for the market.) The company didn’t break out its online sales. However, CEO Bill Nash touted CarMax’s new online platform, which he said allows customers “to seamlessly do as much, or as little, online and in-person as they want.” “Everyone is trying to chase the Carvana wave,” Kim said, adding that all the traditional dealers listed here are making efforts to compete online. “They have to have omni-channel capability,” he said, meaning most of the process is online and that the customer can pick up the car at the dealer, or even have it delivered by the dealer. “If they continue to invest, operate and execute, there’s no reason to think the market won’t put a premium on more of these companies,” Kim said. Sosin says the traditional player will not compete very well with Carvana because “there are myriad differences in the ways Carvana operates that incumbents would find very hard to replicate without doing a lot of damage to their existing store-based businesses.” Lindland says the traditional dealers still have an advantage with older and luxury buyers who “are not as willing to trust the entire process to their smartphones.” “Luxury buyers still want the attention of a one-on-one experience, some studies have shown,” she said. So there you have two approaches to the budding online used-car buying and selling trend: Growth, represented by Carvana and Vroom, and value with traditional dealerships if you feel confident that one or more can make new omni-channel business models work."}]}