{"article": [{"url": "https://www.marketwatch.com/story/investors-are-making-big-betz-on-online-sports-and-gaming-2020-06-09", "published": 1593096380.0, "headline": "Investors are making big â\u0080\u0098BETZâ\u0080\u0099 on this online sports and gaming ETF", "body": "Investors have plowed money into a new exchange-traded fund that tracks the sports betting and online gambling industries, even as professional competition remains closed. Itâ\u0080\u0099s a sign, industry-watchers say, of confidence in the longer-term outlook for the sector, as well as a reminder that many people are substituting play in the financial markets for real sports and gaming during the global coronavirus lockdown. The fund, the Roundhill Sports Betting & iGaming ETF BETZ, +1.50%, launched June 4, had attracted $68 million in investor dollars as of Monday, according to Roundhill CEO Will Hershey. Thatâ\u0080\u0099s a â\u0080\u009cremarkable vote of confidence for a fund thatâ\u0080\u0099s only a few days old,â\u0080\u009d said Dave Nadig, a longtime industry veteran now at ETF Database. â\u0080\u009cI am a fan of this fund. If you believe online sports betting is the next big thing, this fund will capture everything from back-office infrastructure to front-facing retail plays.â\u0080\u009d While thereâ\u0080\u0099s a small irony in the fundâ\u0080\u0099s launch amid the COVID-19 sports hiatus, Hershey maintains that the launch has been serendipitous. Roundhill had been developing the idea for a few months, even as online-gambling and fantasy-sports company DraftKings Inc. DKNG, -4.51% Â completed a complicated initial offering. DraftKings shares have more than doubled since trading began in mid-April. That performance â\u0080\u009cspeaks both to the demand and to the use case for an ETF, if youâ\u0080\u0099re an investor who believes in the thesis but missed the DraftKings run-up,â\u0080\u009d Hershey told MarketWatch. The company accounts for a little more than 6% of BETZâ\u0080\u0099 portfolio. Another recent IPO, GAN GAN, +0.82%, which offers the back-end technology Nadig referred to, including the GameSTACK software, makes up more than 5%. The fund holds such big positions in part because the space is still relatively new, but Hershey says itâ\u0080\u0099s also intentional: â\u0080\u009cOur goal is to try to always provide the most pure-play exposure possible, while taking into consideration liquidity and market cap.â\u0080\u009d BETZ hasnâ\u0080\u0099t just seen strong inflows. Itâ\u0080\u0099s also trading so heavily â\u0080\u0094 an average of 2 million shares a day since inception, according to Nadig â\u0080\u0094 that it ranks in the top 20% of all ETFs, putting it at a par with funds that have hundreds of billions of dollars under management and have been around for decades. Read: A first-of-its-kind racial empowerment ETF is â\u0080\u0098flying under the radar.â\u0080\u0099 Maybe it shouldnâ\u0080\u0099t. And while itâ\u0080\u0099s attracting strong interest from retail investors, with a position in nearly 18,000 accounts on Robinhood, the online brokerage that caters to millennials, both men think itâ\u0080\u0099s a healthier situation than the market hiccups that ensnared investors in a cratering oil market in April. After years of thematic funds grabbing media attention but just nibbling around the edges of overall market share, their time may have come, Nadig said. â\u0080\u009cIâ\u0080\u0099m not sure itâ\u0080\u0099s true that everyoneâ\u0080\u0099s sitting around in their pajamas day-trading, but there is certainly a new generation thatâ\u0080\u0099s thinking about investing, and this is designed for retail use.â\u0080\u009d Hershey acknowledges that some interest in the fund may fade as sports competition returns, but says he believes in the longer-term sector investing case, as well as the utility of ETFs for individuals. â\u0080\u009cI have always believed in the Peter Lynch idea: invest in what you know, invest in what you believe in,â\u0080\u009d he said. â\u0080\u009cAnd since most individuals should not be investing in single securities, thatâ\u0080\u0099s our job in putting out ETFs.â\u0080\u009d Related:Are ETFs safe... for retail investors?"}]}