{"article": [{"url": "https://www.marketwatch.com/story/urban-outfitters-shares-soar-after-full-price-sales-drive-better-than-expected-earnings-2020-08-26", "published": 1598519780.0, "headline": "Urban Outfitters shares soar after full-price sales drive better-than-expected earnings", "body": "Urban Outfitters Inc. stock soared 21.4% in Wednesday trading after the retailer reported second-quarter earnings that got a bump from the reduced number of markdowns the company offered during a quarter that was greatly impacted by COVID-19. Urban Outfitters URBN, +0.53%, whose brands include Free People, the namesake Urban Outfitters chain, and Anthropologie, reported sales that blew past expectations. The company also reported a profit of 61 cents per share. The FactSet consensus was for a loss of 40 cents per share. “All brands were profitable and together they delivered one of the lowest markdown rates and best full-price selling in Urban Outfitters history,” said Richard Hayne, Urban Outfitters chief executive, on the earnings call, according to a FactSet transcript. Hayne also credited the company’s digital sales, which were up by a double digit percentage even as comparable retail segment sales were down 13% due to coronavirus-related store closures during the quarter. Stores were shut for about one-third of the days in the quarter, Hayne said, and even when they were open, the number of customers was down by about half. See:COVID-19-related consumer needs are turning Best Buy into an essential retailer, analysts say “Fortunately, the customers that did enter were shoppers, not lookers,” he said. “We experienced the highest quarterly conversion in memory and fewer promotions were needed to drive sales.” MKM Partners’ Roxanne Meyer highlights merchandise improvements in her note. “In our view, Urban Outfitters’ results defied the odds in the midst of a pandemic and reflected solid merchandising and operational execution,” she said. “Unlike most others, Urban Outfitters is experiencing improved trends in August, benefiting from its home assortment and evolving apparel exposure (which increasingly is skewing more casual), which, coupled with lean inventory and ongoing cost-cuts provides an initially favorable 3Q set up.” MKM Partners rates Urban Outfitters shares neutral with a $23 price target, up from $17. Inventory was reduced by $21.7 million, the company reported. Also:Estee Lauder has a plan to grow, but analysts are mixed about whether it will help the next few months Urban Outfitters was also helped by its launch in the athletic space, FP Movement, which executives called the company’s “largest strategic growth initiative.” The brand’s customer base grew 175% during the quarter, and a standalone store is slated to open in Los Angeles this fall followed by one in Boulder, Colo. “Free People’s activewear line outpaced the brand growth and delivered unprecedented triple-digit growth in the digital channel,” Wedbush analysts note. Wedbush rates Urban Outfitters stock neutral with a price target of $24, up from $20. BMO Capital Markets also called out Urban Outfitters for giving a look ahead. “One of the few companies to give any real guidance, Urban Outfitters believes that revenues could be down only mid-single digits, with comps improving for both retail and wholesale value chains,” wrote analysts led by Simeon Siegel. BMO Capital Markets rates Urban Outfitters stock market perform with a $19 price target, up from $15. Urban Outfitters stock is down 9.1% for the year to date while the S&P 500 index SPX, +0.87% has rallied 7.8% for the period. Watch:Work from home is here to stay. Here’s what it means for retail “For holiday, we are planning for an extended holiday shopping period with sales beginning earlier, reaching a plateau sooner, but missing the peaks characteristic of prior years as consumers seek to avoid crowds,” Urban Outfitters’ Hayne said. “If our COVID prediction is correct, we believe holiday sales could be positive, but still heavily promotional.”"}]}