{"article": [{"url": "https://www.marketwatch.com/story/democrats-reject-white-houses-band-aid-fix-for-600-jobless-benefit-2020-07-30", "published": 1596151940.0, "headline": "Democrats reject White Houseâ\u0080\u0099s band-aid fix for $600 jobless benefit", "body": "WASHINGTON â\u0080\u0094 With aid expiring, the White House offered a short-term extension Thursday of a $600 weekly unemployment benefit that has helped keep families and the economy afloat during the COVID-19 pandemic, but Democrats rejected it, saying President Donald Trumpâ\u0080\u0099s team failed to grasp the severity of the crisis. Democratic leaders panned the idea in late-night talks at the Capitol, opting to keep the pressure on for a more sweeping bill that would deliver aid to state and local governments, help for the poor and funding for schools and colleges to address the pandemic. Without action, the benefit runs out Friday. â\u0080\u009cThey want to do one small thing that wonâ\u0080\u0099t solve the problem,â\u0080\u009d said top Senate Democrat Chuck Schumer after meeting with Treasury Secretary Steven Mnuchin and White House chief of staff Mark Meadows. â\u0080\u009cWe have to have a bill, but they just donâ\u0080\u0099t realize how big it has to be,â\u0080\u009d said House Speaker Nancy Pelosi, D-Calif. Republicans have been fighting to trim back the $600 jobless benefit in the next coronavirus package, but their resolve weakened with the looming expiration of the popular benefit â\u0080\u0094 and as Trump indicated that he supports keeping the full $600 benefit for now. â\u0080\u009cWe want a temporary extension of enhanced unemployment benefits,â\u0080\u009d Trump said at the White House. â\u0080\u009cThis will provide a critical bridge for Americans who lost their jobs to the pandemic through no fault of their own.â\u0080\u009d He added: â\u0080\u009cIt has to be substantial.â\u0080\u009d During the two-hour meeting at the Capitol, Trumpâ\u0080\u0099s team offered a weeklong extension. But Democrats have so far rejected a piecemeal approach, saying the next relief bill needs to move as a complete package. The sides agreed to talk again Friday and into the weekend. Before Trump spoke, top Senate Republican Mitch McConnell adjourned the chamber for the weekend while taking a procedural step that could allow voting on a potential compromise next week. Negotiators for the first time this week reported at least some progress. â\u0080\u009cOn certain issues we made progress. On certain issues weâ\u0080\u0099re still very far apart,â\u0080\u009d Mnuchin said after a two-hour meeting in Pelosiâ\u0080\u0099s office. â\u0080\u009cThe speaker and Sen. Schumer said â\u0080\u0094 and we feel the same way â\u0080\u0094 that it is our objective to try to reach an agreement thatâ\u0080\u0099s good for the American people.â\u0080\u009d There continues to be agreement among Washingtonâ\u0080\u0099s top power players that Congress must pass further relief in the coming days and weeks. Trump is eager for another round of relief, and itâ\u0080\u0099s also a priority for GOP allies like McConnell, as well as Pelosi and Schumer, D-N.Y. Democrats hold a strong negotiating hand â\u0080\u0094 exploiting GOP divisions over whether more aid is even needed â\u0080\u0094 and they are expected to deliver a necessary trove of votes. Raising the stakes, a bleak government report released Thursday said the economy shrank at a 33% annualized rate in the second quarter of the year, a stark reminder of the economic damage afflicting the country as lawmakers debate the size and scope of new relief. â\u0080\u009cThis jarring news should compel Congress to move swiftly to provide targeted and temporary assistance to unemployed Americans, employers, and state and local governments, and liability protections for businesses who follow public health guidelines,â\u0080\u009d said Neal Bradley of the U.S. Chamber of Commerce, the powerful business group. But bipartisan talks have yet to reach a serious, productive phase. Democrats are playing hardball, insisting on a package thatâ\u0080\u0099s far larger than the $1 trillion-plus measure unveiled by McConnell on Monday. Thursday brought more tit-for-tat. â\u0080\u009cThey wonâ\u0080\u0099t engage. Period,â\u0080\u009d McConnell said as he opened the Senate. â\u0080\u009cThe Democrats are saying, my way or the highway.â\u0080\u009d Pelosi and McConnell have an extensive history, however. They often find ways to reach deals, though the process involves intense maneuvering and plenty of cross words. In an interview late Wednesday, McConnell showed a willingness to consider some Democratic priorities, like additional food aid. He and Trump have made plain they are intent on getting a bill. â\u0080\u009cThe economy does need more help. We have divided government. We have to talk to each other,â\u0080\u009d McConnell said on â\u0080\u009cPBS NewsHour.â\u0080\u009d â\u0080\u009cAnd we have to try to get an outcome.â\u0080\u009d Schumer continued his daily fusillade against McConnell and Republicans controlling the Senate, noting that McConnell â\u0080\u009crefuses to go in the roomâ\u0080\u009d and join the talks in person, instead transferring ownership of the talks to Meadows, along with Mnuchin, who has been a key architect of previous accords. â\u0080\u009cWeâ\u0080\u0099re trying to negotiate,â\u0080\u009d Schumer said. â\u0080\u009cWhoâ\u0080\u0099s holding things up?â\u0080\u009d In another signal that Republicans are willing to yield on the $600 jobless benefit, Arizona Republican Martha McSally, who is facing a tough reelection race this fall, offered a one-week extension of the benefit on the Senate floor. Schumer blocked the move. Other stark differences remain between the $3 trillion proposal from Democrats and $1 trillion counter from Republicans. Money for states and cities is a crucial dividing line as local governments plead for help to shore up budgets and prevent deeper layoffs as they incur COVID-19 costs and lost tax revenue in shutdown economies. Democrats proposed nearly $1 trillion for the local governments, but Trump and Republicans are resisting sending the states and cities more cash. Instead, the GOP offers states flexibility to use $150 billion previously allotted for the virus on other needs. Itâ\u0080\u0099s clear that Democrats are trying to push an advantage in the negotiations because Republicans are so split over the prospect of additional government spending and jobless benefits. Among the issues sure to gather momentum is a Democratic demand for a 15% increase in food stamp benefits. Trump has dismissed the GOP bill as â\u0080\u009csemi-irrelevantâ\u0080\u009d since it leaves out so many Democratic items. Trump appears worried about the expiration of the $600 unemployment benefit boost as well as an expiring federal eviction moratorium on millions of rental units, potentially sending households into devastating turmoil. Trump has bristled at one provision of the GOP bill â\u0080\u0094 he said his Republican allies should â\u0080\u009cgo back to school and learnâ\u0080\u009d after they balked at $1.7 billion for FBI headquarters. Trump wants the FBIâ\u0080\u0099s central building to remain in Washington, across the street from his Trump International Hotel. If the FBI moved its headquarters, the site would become prime real estate for a competing hotel. McConnell has rejected the FBI funding request â\u0080\u0094 added to a $300 billion-plus appropriations package in private talks between Meadows and Senate Appropriations Committee Chair Richard Shelby, R-Ala. â\u0080\u0094 since it is unrelated to virus relief."}]}