{"article": [{"url": "https://www.marketwatch.com/story/gold-prices-rise-as-dollar-weakness-buttresses-bullion-2020-09-14", "published": 1600094060.0, "headline": "Gold prices tally best one-day gain since August as dollar weakness buttresses bullion", "body": "Gold futures climbed on Monday to tally their largest one-day gain of the month so far, as weakness in the dollar and low government bond yields helped to keep the precious metal trading in a range that some market experts see as forming a bullish pattern. Jim Wyckoff, senior analyst at Kitco.com, said that gold may be set to “break” higher despite gains in equities that have suggested that risk appetite on Wall Street is improving, a scenario that would usually deflate appetite for haven metals like gold. “Importantly, recent sideways and choppy price action in gold has produced a bullish coiling pattern on the daily bar chart, suggesting the market is storing up energy for a bigger price move coming soon (possibly this week), and odds favor that price move being on the upside,” Wyckoff wrote. Equity markets have drawn some optimism from hope of a vaccine for COVID-19, a bearish factor for bullion, but anticipation about coming volatility from U.S. presidential election in November also has buttressed gold buying. December gold GCZ20, +2.17% GC00, +2.17% rose $15.80, or 0.8%, to settle at $1,963.70 an ounce, following a 0.7% weekly gain for the yellow metal. Prices based on the most actively traded contracts saw their strongest single-session percentage and dollar gain so far this month, according to FactSet data. Meanwhile, December silver SIZ20, +5.96% SI00, +5.96% added 50 cents, or nearly 1.9%, to close at $27.355 an ounce after gold’s sister asset climbed by 0.5% last week. The gains for the precious metal also follow weakness in the U.S. dollar, which was off 0.3% in Monday dealings, as gauged by the ICE U.S. Dollar Index DXY, -0.58%, a measure of the buck against a half-dozen currencies. The 10-year Treasury note yield TMUBMUSD10Y, 0.777% also was hanging below 0.70%. Lower yields for government debt make gold a more compelling option for investors comparing investing in metals against Treasurys and a weaker dollar can make buck-pegged assets more attractive to overseas buyers. On a more cautious note, Craig Erlam, senior market analyst at Oanda, said in a Monday note that although the long-term bullish case for gold remains intact, there is a possibility of a corrective move. “This temporary setback for the dollar — and reprieve for gold — may not last though with a corrective move in both cases still looking plausible in the near future,” Erlam said. Looking ahead, investors will be watching for a fresh policy update from the Federal Reserve at the conclusion of its two-day policy meeting on Wednesday. Further signals that the central bank will keep rates lower for longer will add fuel to the bullish thesis for gold and silver, experts say. “The Fed is almost certain to maintain its dovish stance on monetary policy on Wednesday, as will no doubt be the case for the Bank of Japan and the Bank of England on Thursday,” said Fawad Razaqzada, market analyst at ThinkMarkets. “Given the fact coronavirus is still going strong and there are no effective vaccines approved yet, these central banks will likely signal to the market that they will be ready to provide more stimulus if needed.” “This should be music to the ears of gold investors, for the precious metal is a noninterest-bearing asset and its appeal tends to rise when expectations over interest rate hikes fall,” he said in a note Monday. This “remains the perfect environment for gold and silver to thrive” as debasement of currencies continue. Among other metals traded on Comex, December copper HGZ20, +1.38% settled at $3.068 a pound, up 0.9%. October platinum PLV20, +3.99% tacked on 2% to $958.70 an ounce and December palladium PAZ20, +2.31% lost 0.3% to $2,324.40 an ounce."}]}