{"article": [{"url": "https://www.marketwatch.com/story/heres-where-trump-and-biden-stand-on-climate-change-2020-09-29", "published": 1602166220.0, "headline": "Fracking and the 'Green New Deal': Here's where Trump and Biden stand on climate change", "body": "Vice President Mike Pence pushed his Democratic opponent Sen. Kamala Harris on fracking, fossil fuels and the Green New Deal in Wednesday's debate, a move that some observers said stole the ball from a Biden/Harris ticket that should always play offense on climate change. Instead, Harris, who debated solidly Wednesday by most accounts, found herself again defending Biden's stance in holding up the controversial practice of fracking, which has boosted the U.S. role in global energy markets. Biden hasn't always been clear on fracking, which is linked to jobs in key election states. Google search results around the VP debate also showed confusion and curiosity from viewers, who queried, just what is \"fracking\" again? Searchers also sought a refresher on the \"Green New Deal,\" which has become shorthand for any climate-change stance from Democrats, whether or not a policy tracks with the 2019 framework advanced by Rep. Alexandria Ocasio-Cortez and others. The topic of \"climate change\" also crept in during the last 10 minutes of the first raucous presidential debate held earlier this month, the issue raised for the first time in eight years for this type of campaign setting. Read:Trump, Biden blast each other on economy, coronavirus in fiery first debate Several analysts have emphasized the wide differences in a head-to-head comparison of the candidates as the Nov. 3 election nears and as other major economies, including China, have advanced a climate-change blueprint that may leave the U.S., without its own proposal, flat-footed on trade, security and more in the years to come. Here's a deeper look at the candidates' records on climate change. Presidential check-in on climate change. The topic had been expected to be missing from the lineup of questions planned for the first debate between Trump and Democratic challenger Joe Biden even as California wildfires again kicked up, their severity pinned by most experts on droughts and other weather extremes. And as the private sector advances its own net-zero carbon plans absent federal leadership. Moderator Chris Wallace pushed Trump on pulling the U.S. from the voluntary international Paris climate accord and his rollback of Obama-era environmental moves (some of the dropped regulations pre-date Obama). \"I want crystal clean water and air, we now have the lowest carbon â\u0080¦ if you look at our numbers now we are doing phenomenally,\" Trump replied. He called the Paris agreement a \"disaster\" and repeated yet again that the historic wildfires in the West in recent years are due to poor forest management. \"The forest floor is loaded up with dead trees. You drop a cigarette in there the whole forest burns down,\" he said. Just more than half of California forests are federally managed land. \"But sir, if you believe in the science of climate change, why have you rolled back the Obama Clean Power Plan, which limited carbon emissions in power plants?\" Wallace pressed. \"Because it was driving energy prices through the sky,\" Trump answered. \"Why have you relaxed fuel economy standards?\" Wallace asked. \"You're talking about a tiny difference,\" Trump said. Most analysts said it was the longest public exchange on climate change they could remember Trump engaging in. \"For the first time, President Trump acknowledged that human activity has, at least in part, caused climate change,\" the American Conservation Coalition, a conservative environment group, said in a statement. Biden, for his part, used the debate time to push his $2 trillion green stimulus plan. \"Nobody's gonna build another coal-fired plant in America. They're gonna move to renewable energy,\" the former vice president said. Read:Presidential debate antics leave many viewers disgusted As was the tactic throughout the debate, the president jumped in as Biden spoke, challenging that the price of the climate-change proposal advanced by the Democrat was much higher and the plan more aligned to the Green New Deal advanced by the progressive arm of the party. \"Not true,\" Biden replied. Accepting the science: Describing the difference between the two candidates often starts with acceptance of the factors behind rising emissions, extreme temperatures and droughts, as well as swelling sea levels that threaten coastlines. While it's true that the science is evolving, Trump had repeatedly called man-made climate change a \"hoax\" before the debate. He has said \"science doesn't know\" what lies ahead. He and supporters have stressed the importance of keeping fossil fuels in the energy mix to hold down operational and transportation costs for businesses and households and to help the U.S. cling to a newly fortified position as an oil and natural-gas exporter, which they claim earns a valuable position against geopolitical heavyweights Saudi Arabia and Russia. Additionally, the administration and its supporters are concerned that the U.S. effort to curb its own polluting is not matched in the developing world; this was cited as a factor when Trump moved to pull the U.S. from the Paris Climate accord. Related: Facebook gives in to pressure on climate-change myths - including that antifa started deadly wildfires in western states - with new 'science-based' hub Trump's position on climate change may not matter as much as the makeup of Congress after the election. Some Republican lawmakers have tried to separate themselves from outright denial of climate change as they push for a \"clean-energy mix\" that pulls from several sources, so it's unclear what a Trump re-election might mean for energy policy, including clean-energy initiatives, in the next Congress. Rep. Dan Newhouse, a Republican from Washington, wrote for the Wenatchee World Empire Press that \"we still have work to do to secure our nation's energy independence and clean energy future, but there is a bright future ahead.\" And the just-completed National Clean Energy Week was a rallying point for the authors of the American Energy Innovation Act, a package of more than 50 energy-related bills considered by the Senate Energy and Natural Resources Committee and compiled by the committee's Republican chairwoman, Sen. Lisa Murkowski of Alaska, and ranking member Joe Manchin, a moderate Democrat from West Virginia, they said in a release. Biden, who calls climate change an \"existential threat,\" has said the scientific community has a big role to play in shaping policies. He would push the U.S. to rejoin its global peers in trying to turn back the climate-change clock. Read: 'The world has a high fever': UN chief suggests there's consensus on taxing carbon and slashing emissions in just 10 years Comprehensive plan: Biden has announced a $2 trillion plan to, he claims, create millions of jobs and achieve 100% clean electricity by 2035, a target that has seemed more realistic as solar and wind pricing became competitive with traditional energy sources in just the past decade. Biden has embraced portions of the Green New Deal framework put forth by the Democratic Party's most progressive arm, but not all of it. Read: 'Science' itself is on the ballot, so this 175-year-old institution makes its first ever endorsement for president Biden has called for achieving net-zero emissions by 2050 and supports the Clean Cars for America plan, a pledge he made earlier this year but one given fresh emphasis after California Gov. Gavin Newsom announced a proposal to halt sales of new gasoline-powered passenger cars and trucks in that influential state by 2035. Don't miss: Trump's EPA chief mocks California's 2035 ban on gas-powered cars: 'You can't even keep the lights on today' The Trump administration has not put forward a specific plan to address the climate crisis, and environmentalists have cried foul at the reversal of roughly 100 environmental rules, some decades-old regulations carried across administrations from both political parties. For example, Trump will open the 19 million-acre Arctic Refuge to drilling for the first time, after more than 30 years of oil-industry lobbying for such access. Read: Trump signs plan to spend $3 billion a year on national parks and public land during a 2020 crammed with EPA rollbacks Trump did expand the rules that limit offshore drilling in Florida. The fracking fracas: One of the stickier policy points for Biden has been his stance on allowing new or even maintaining existing oil drilling, including fracking, with particular emphasis on swing state Pennsylvania and its resource-reliant economy. Critical ads have claimed Biden, a Pennsylvania native, would ban fracking; the candidate says that's not true, that he would only bar new fracking on public lands and water. Most fracking takes place on private property but can impact nearby land. The Pittsburgh Post-Gazette editorial board says the state's voters remain confused about where the candidate stands on fracking. As part of the coronavirus response, Trump pushed a tax law that gave a $25 billion break to the fossil-fuel industry. He has voiced no plans to curb fossil-fuel subsidies. Biden says he has a plan to end the estimated $20 billion the U.S. spends on fossil-fuel subsidies annually. \"They want to bury our economy under a $2 trillion Green New Deal. [They] want to abolish fossil fuels, and ban fracking, which would cost hundreds of thousands of American jobs all across the heartland,\" Pence said in his debate while answering a debate question not on climate change but on the post-COVID-19 recovery. \"I will repeat, and the American people know, that Joe Biden will not ban fracking,\" Harris answered. \"That is a fact.\" Opinion:After underperforming the stock market for years, alternative energy is red hot Carbon tax revisited: Another of the more controversial environmental-policy points lies with assigning a federal price, or a \"tax\" depending on who has control of the language, on carbon. The influential CEO group Business Roundtable has just released a series of market-driven climate-change positions that include pricing carbon. Attempts to create a national cap-and-trade market to introduce buyers and sellers in order to share the carbon burden have largely fizzled over the past few decades. Early in the Trump administration, it was reported that Vice President Mike Pence had met with business leaders about a carbon tax, but more recently the president has been quiet about the topic altogether. As part of a party platform, Democrats have been generally in favor of such a tax, but most reports show Biden is less likely to make it a priority. From Barron's: Carbon pricing is hot again, and here's how investors can play it Read: Trump now backs higher-ethanol gas at pumps in move to court farm-state votes before November Environmental justice: This year, Trump weakened the National Environmental Protection Act, a law that gives communities of color the ability to provide input on major polluting projects and pipelines being built in their neighborhoods, the left-leaning advocacy group Climate Power 2020 says. Trump has tried to defund environmental justice enforcement at the EPA. His administration says these regulations are expensive and difficult to enforce equally. The Biden ticket, say political analysts, earned improved marks for environmental justice when Sen. Kamala Harris of California was named as the vice presidential candidate. She has spoken out on the importance of always including social justice within environmental policy-setting. Read: Kamala Harris has a particular climate-change agenda: environmental justice Don't miss: Here's where Trump and Biden stand on health care"}]}