{"article": [{"url": "https://www.marketwatch.com/story/treasury-yields-come-off-lows-after-jobless-claims-comes-in-below-1-million-2020-08-13", "published": 1597337780.0, "headline": "10-year Treasury yield pops above 0.7% to hit eight-week high as investors struggle to take down debt auction", "body": "Longer-term Treasury yields rose sharply on Thursday after investors, for the first time in a while, struggled to absorb the largest 30-year bond auction on record. The Treasury Department increased its debt sales to finance the response to the COVID-19 pandemic.What are Treasurys doing? The 10-year Treasury note yield TMUBMUSD10Y, 0.777% rose 3.1 basis points to 0.714%, around its highest in eight weeks, after trading as low as 0.651% overnight, while the 2-year note TMUBMUSD02Y, 0.156% stood at 0.163%. The 30-year bond yield TMUBMUSD30Y, 1.576% climbed 6 basis points to a five-week high of 1.425%. Bond prices move inversely to yields. What’s driving Treasurys? The U.S. Treasury Department concluded this week’s round of auctions with a sale of $26 billion of 30-year bonds that drew tepid demand. The sloppy sale weighed on trading for government bonds as investors, for the first time in recent memory, struggled to take down the supply of longer-term debt. The sale “tailed” by 2.6 basis points, meaning that the highest yield fetched at the auction was 2.6 basis points above the yield when the auction first began. Apple Inc.’s AAPL, +1.74% four-part bond offering also weighed on trading in government bonds, as underwriters will often sell Treasury futures to hedge against a rise in interest rates during the time they’re looking to find buyers for newly minted corporate bonds. The number of Americans filling for jobless benefits fell to 963,000, falling for two weeks in a row, despite ongoing struggles in the U.S. to contain the coronavirus as it reopens businesses. Meanwhile, continuing claims fell to 15.5 million. Still, analysts say the elevated number shows the long road ahead for the U.S. labor market recovery. In other data, import prices rose 0.7% in July, but were still down 3.3% year-over-year.What did market participants’ say? “For a change, the statistics showed some signs that the additional supply is [weighing] on the market. Long-end investment-grade corporate supply hitting the market today was certainly no help either,” said Thomas Simons, senior money market economist at Jefferies."}]}