{"article": [{"url": "https://www.marketwatch.com/story/we-are-now-100-days-into-the-pandemic-a-by-the-numbers-look-at-covid-19s-toll-on-american-lives-and-livelihoods-2020-06-18", "published": 1592473100.0, "headline": "We are now 100 days into the pandemic: A by-the-numbers look at COVID-19â\u0080\u0099s toll on American lives and livelihoods", "body": "The U.S. economy has endured extraordinary upheaval in the past 100 days. The World Health Organization declared the coronavirus a pandemic 100 days ago on March 11. Since then, over 2.1 million people have been diagnosed with COVID-19 and more than 117,000 people have died from the coronavirus in the U.S., according to Johns Hopkins University. Stay-at-home orders in March and April and the closing of businesses deemed non-essential sent the U.S. crashing into deep recession. Record increases in layoffs and the unemployment rate soon followed, as did record drops in household spending and manufacturing. Almost no business was left untouched. Auto production virtually came to a halt, for instance, and reservations at airlines, hotels and restaurants dried up as the economy came to a standstill. About the only companies to benefit were grocers, online retailers and companies that made critical and sought after consumer goods such as toilet paper. As the economic calamity spread, the Federal Reserve acted boldly to cut a key U.S. interest rate to near zero and make credit widely available to thwart a Wall Street meltdown. Also see: Here are the best and worst stocks during the first 100 days of the coronavirus How the pandemic has changed tech in its first 100 days Itâ\u0080\u0099s been 100 days since the WHO declared a pandemic. Have Americans learned new spending and saving habits yet? MarketWatchâ\u0080\u0099s coronavirus recovery tracker Washington then stepped in with trillions of dollars of emergency spending, a lifeline to the economy that also included critical small-business loans and extra unemployment benefits to millions of people who lost their jobs. An astonishing 49.5 million applications for jobless benefits were filed during the 13 full weeks of the pandemic. The swift response by Washington helped stabilize the economy and lay the groundwork for a recovery that began in May, when states started to reopen. Retail sales rose a record 17.7% in May, the U.S. regained 2.7 million jobs and the unemployment rate unexpectedly declined. Even mass protests about police brutality that convulsed many major cities in late May did little to slow the momentum. The rapid deterioration and revival in the economy has been mirrored by the stock market, but even more so. After falling into the first bear market in a decade, the Dow Jones Industrial Average has recouped most of its losses. And the technology-heavy Nasdaq index even set a new all-time high only one week ago. As with the broader economy, thereâ\u0080\u0099s been some big winners and losers in the stock market. Overall, the S&P 500 SPX, +0.87% gained $2.1 trillion in market capitalization with the index up over 8% for the 99-day period but down 3.6% for the year. Some companies like Amazon AMZN, +3.01% Â , Netflix NFLX, +1.43% Â and Facebook FB, +0.26% Â saw an increase in users as more people stayed home. Amazonâ\u0080\u0099s stock rose 39.6% since March 11. Airlines remain among the worst performing companies with Delta DAL, +0.39%, United UAL, +0.32% and Southwest LUV, +1.89% down more than 20% as of June 17 from their closing price on March 10. The number of air travel passengers had fallen as much as 96% according to data from the TSA. While the next 100 days might not be as topsy-turvy, the economy and stock market are likely to remain on a roller-coaster ride with big ups and downs. Stay tuned ..."}]}