{"article": [{"url": "https://www.marketwatch.com/story/heres-how-the-federal-government-could-help-millions-of-students-better-afford-college-11602081987", "published": 1602068060.0, "headline": "An affordable way to make college free", "body": "Illustration by Kevin Whipple When the coronavirus pandemic sent students home in March, colleges scrambled to move courses online. Administrators, professors and students griped that the hastily developed remote classes were inferior to what was offered in-person, and often a worse experience than classes developed to be taught online. Jokes about Zoom University bounced around social media, and some families sued colleges, arguing they shouldn’t have to pay full tuition for what they viewed as a lesser education. But what if every college in the country didn’t have to invest time and money into transitioning their Econ 101 or English 101 courses to the web? What if students could continue to progress toward their degree affordably from home? These were some of the questions that popped into Suzanne Kahn’s head as she watched the rapid move to remote education and colleges — whose already shaky business model was pushed to the brink by the pandemic — vie for funds in Congress’ coronavirus relief package. “If ever there was a moment, it is now for the federal government to play a role in creating a more centralized set of online courses,” said Kahn, director of education, jobs and worker power at the Roosevelt Institute, a progressive think tank. She began mulling over the idea of a federal online education system. Kahn envisioned the government providing funding to colleges and universities to develop online general education courses that would become part of a national database. By tapping professors who are skilled and experienced at designing remote courses, as well as diverse, this system would provide a high-quality alternative to the thousands of English composition and American history survey courses of varying caliber that are currently available. A key component of the system for Kahn, who has advocated for a progressive free college program, is that it would lower the cost of a degree. The government would offer the courses for free, and colleges would be required to accept the credits if they wanted to receive federal financial aid — an important source of revenue for most schools. So far, Kahn’s idea is just that; policy makers aren’t taking any steps toward a federal online education system. She’s also not the first one to propose it; the notion has been batted around in at least one book and in magazine articles for a few years. But it could gain traction amid a pandemic that’s forced a reckoning on college business models, the value of a degree and the role of remote instruction in the future of higher education. “The idea is that it would help really expand access at an affordable price to a wide variety of people to higher education,” said Ganesh Sitaraman, a professor at Vanderbilt University’s School of Law, who proposed a version of a federal online education system in the “The Public Option: How to Expand Freedom, Increase Opportunity, and Promote Equality,” a book he co-wrote with Anne Alstott, a professor at Yale Law School. “Part of what COVID has shown is that online education is possible and can reach a lot of people,” Sitaraman said. “That gives this idea a little bit more purchase.” In addition to introducing more students to some version of remote instruction, the pandemic has put a spotlight on challenges already plaguing our higher education and college finance systems that could make any efforts to reduce the cost of college — for both students and schools — more appealing. In 2018, analysts at Moody’s Investors Service wrote in a report that they expected the rate of college closures to triple over the next few years. COVID may have accelerated the demise for some; sending students home in the spring, and in some cases not inviting them back to campus in the fall, cost schools housing and dining revenue many rely on to survive. In some cases, fundraising efforts and schools’ endowments may have been dinged by the economic downturn. That downturn means that once students get out of school, they may struggle to secure jobs that pay well enough to make progress toward repaying their debt — a challenge many young people already faced in the wake of the Great Recession. Borrowers currently repaying student loans have had payments paused until December 31 as part of coronavirus relief efforts, but it’s unclear how long those will last. Kevin Carey, the vice president for education policy and knowledge management at New America, a think tank, outlined how a federal online education system might work in articles for Washington Monthly magazine. Pre-pandemic, he envisioned the initiative as an alternative to the free college programs being proposed by Sens. Elizabeth Warren and Bernie Sanders as part of their campaigns for the Democratic nomination for president. Now, it serves as an alternative to the modified free college proposal that Joe Biden has said he’d support if elected president. “ “If the federal government is making this available as a public good, there are still probably people who will go to colleges that cost money, but by setting a floor that is quality free public higher education, you’re both making that available and also helping to regulate the market,” Kahn said. ” — Suzanne Kahn, director of education, jobs and worker power at the Roosevelt Institute, a progressive think tank Under Carey’s plan, the federal government would provide colleges and universities interested in becoming part of a national network with a per student subsidy. “In exchange for this lifeline that colleges desperately need,” Carey said, the schools would do two things: Set their prices at a uniform, affordable level and accept students’ credits from any of the colleges in the consortium. Colleges would still be able to decide whether they accepted credits for courses that are part of majors or core curricula. Though some students would attend these schools in person, Carey’s proposal would aim to create a national repository of affordable online courses by providing colleges with the subsidy even if a student enrolls in their courses online. That would incentivize colleges to create high-quality online classes to attract as many students as possible, he said. The college would get paid by the government for each student taking one of its online classes and students would pay for the courses based on the uniform fee schedule, which would mean they would be free to many and affordable for all students. Ideally, his plan would help online education deliver on its promise to make college more affordable, Carey said. “You can learn cheaply from lots of colleges now” online, Carey said. “What there aren’t are free and really inexpensive degrees.” By requiring that the credits transfer, a national online education system would cut down on costs for students. For the idea to work, though, it would need to be paired with some kind of public option for high speed internet, Sitaraman said. The past several months have exposed the digital divide and in particular its impact on educational outcomes. In Brazil, which offers a national online university that’s geared toward training teachers particularly in the country’s rural areas, the education system offers centers where students can access computers and the internet to complete their courses. Both Kahn and Carey agree that a federal online education system would also put pressure on the online higher education industry, which could bring down the cost of remote courses broadly. “If the federal government is making this available as a public good, there are still probably people who will go to colleges that cost money, but by setting a floor that is quality free public higher education, you’re both making that available and also helping to regulate the market,” Kahn said. Today, for-profit companies are typically involved in most major online degree offerings. Either they’re offered by for-profit colleges, or nonprofit and public schools, which in many cases are relying on online degree programs as a source of revenue. Typically these schools partner with companies called online program managers (OPMs) who recruit and enroll students in the programs and also help administrators and instructors design them. These firms, at least in North America, account for about $6 billion in revenue, according to Howard Lurie, principal analyst at Eduventures Research, which offers research and analysis to the higher education sector. Carey has written critically about these companies, which often charge universities a share of the revenue the programs bring in, arguing that this practice drives up the price of online degrees. “The whole online education industry is focused around making money in a way that the terrestrial industry isn’t,” he said. OPMs haven’t played a huge role in the pandemic shift to remote education so far, Lurie said. At the beginning of the pandemic, these companies did see an uptick in interest in their services, but that activity has died down as colleges have focused on developing and improving their remote course offerings for the fall. “A lot of these schools, particularly around undergraduate education, their stock-in-trade is to offer an innovative, powerful, engaging learning experience, and if they can do that on their own without paying a fee or giving up a revenue share, then I think they’ll do that,” he said. Still, there are signs that these companies aren’t going away any time soon, including an agreement earlier this year between Zovio, one of these companies, and the University of Arizona to acquire Ashford University, a for-profit college that Zovio owned. These companies could play a larger role once the rush to cope with the pandemic learning environment calms down and colleges have space to think about their plans for remote learning long term, Lurie said. The value that colleges and professors place on their autonomy when it comes to designing courses, curricula and degree programs is one of the reasons why Kevin Stange, an associate professor of public policy at the University of Michigan, is skeptical that a federal system of affordable online courses could work. In addition, he’s not sure it would do much to increase access to affordable, quality online education. The factors that contribute to high-quality in-person instruction — a course where you get some interaction and attention from an instructor — are also necessary for high-quality remote learning, he said, and that is still costly. “When you’re enrolling in college, you are buying some of my time,” Stange said. “If you put 1,000 people into a classroom and you buy a thousandth of my time, you’re going to get a lot less of that.” Many colleges’ business models are also built around the idea that larger lecture courses, which are less costly to teach, subsidize upper-division seminars. If students were to rely on a national university system for those cheaper classes, it’s possible that colleges would raise the price of those higher-level courses to compensate, Stange said. Perhaps most crucially, he isn’t sure this kind of system would offer much more than what is already available, at least in some states. For example, students in California’s community college system can take courses online that count as progress toward their degrees in any of the state’s community colleges and beyond. The state’s community college system has an agreement with the California State University system that guarantees that as long as students complete 60 credits at a community college and meet certain requirements, they can transfer to a CSU, take 60 credits and earn a bachelor’s degree. The online initiative was developed as a way to ease a bottleneck that meant students couldn’t get the courses they needed in the semester they needed them to progress toward their degree, said Paul Feist, the vice chancellor for communications for the system. They began developing the effort as the country was coming out of the Great Recession, a time when, due to pressure on state budgets and public higher education systems across the country, “California Community Colleges had to ration education,” Feist said. Now, if a student can’t get into a course at their home institution, they can enroll online. Like courses at the rest of the community college system, these classes are affordable at $46 per credit hour. A system like this can work in California in part because of the state’s tight transfer network and the legislative funding — two investments that aren’t necessarily available to public higher education institutions across the country."}]}