{"article": [{"url": "https://www.marketwatch.com/story/trumps-election-year-gamble-messing-with-social-security-and-medicare-2020-08-10", "published": 1598700620.0, "headline": "Trumpâ\u0080\u0099s election year gamble: Messing with Social Security and Medicare", "body": "Wow. With less than three months to go in an election year, President Trump, clearly trailing in the polls, has touched the so-called â\u0080\u009cthird railâ\u0080\u009d of American politics: Entitlements. Reviving an idea that he backed away from only a few weeks ago, he said recently that he wanted to eliminate the payroll tax for the rest of 2020, and perhaps even beyond that. 80% of older Americans can't afford to retire - COVID-19 isn't helping â\u0080\u009cIf victorious on November 3rd, I plan to forgive these taxes and make permanent cuts to the payroll tax,â\u0080\u009d he vowed, adding â\u0080\u009cIâ\u0080\u0099m going to make them all permanent.â\u0080\u009d Read: Why suspending the Social Security payroll tax is a terrible idea Since the payroll tax is generally split between companies and their employees, the president thinks that eliminating it will save firms big bucks, while increasing the take home pay of American workers. It all sounds so simple. Except for a few things. One, there are tens of millions of Americans who arenâ\u0080\u0099t working, thanks to the economic collapse brought on by the pandemic. Bigger take home pay? They donâ\u0080\u0099t even have jobs. Then there is thisâ\u0080\u0094and this is the big one: Trump (and many of his supporters who cheer his every utterance) doesnâ\u0080\u0099t seem to get that Social Security and Medicareâ\u0080\u0094critical safety nets for tens of millions of Americansâ\u0080\u0094are financed by payroll taxes. Heâ\u0080\u0099s proposing â\u0080\u0094to use his wordâ\u0080\u0094â\u0080\u009cterminateâ\u0080\u009d financing for these programs? Does he know that by eliminating the payroll tax it could drain the Social Security trust fund by 2023 if there isnâ\u0080\u0099t any other source of revenue? Thatâ\u0080\u0099s according to the Social Security Administrationâ\u0080\u0099s chief actuary. Or perhaps Trump does know. After all, one of his longtime economic advisers, Stephen Moore, has been arguing against Social Security for yearsâ\u0080\u0094and has the presidentâ\u0080\u0099s ear. Thereâ\u0080\u0099s much more at stake here than trying to monkey with the payroll tax. It could â\u0080\u009cset the stage for destabilizing vital pillars of our nationâ\u0080\u0099s longstanding social insurance infrastructure by depriving Social Security and Medicare of funding,â\u0080\u009d says William Arnone, chief executive officer of the Washington-based National Academy of Social Insurance. â\u0080\u009cIt may be used to erode the economic security of millions of Americans, without bringing meaningful relief for unemployed workers or employers,â\u0080\u009d he says. Itâ\u0080\u0099s worth reminding you just how vast these programs are. This year, the Social Security Administration (SSA) will pay over $1 trillion to about 65 million Americans. The average monthly benefit is $1,503, while disabled workers and their dependents get an average monthly benefit of $1,258. Fifteen or twelve hundred bucks a month isnâ\u0080\u0099t exactly big money, but is literally a lifeline for millions. The SSA emphasizes that among elderly beneficiaries, 50% of married couples and 70% of singles receive 50% or more of their income from Social Security. And get this: among elderly Social Security beneficiaries, 21% of married couples and about 45% of unmarried persons rely on Social Security for 90% or more of their income. Read: Paul Krugman says Trumpâ\u0080\u0099s payroll tax is â\u0080\u0098the hydroxychloroquine of economic policyâ\u0080\u0099 Throwing a wrench into all this is none other than the head Social Security Trustee, Treasury Secretary Steven Mnuchin, who said on Fox News Sunday that, in a second Trump term, the administration would work to finance entitlements by moving money â\u0080\u009cfrom the general fund to those trusts funds.â\u0080\u009d â\u0080\u009cMoving moneyâ\u0080\u009d from the general fund? Whereâ\u0080\u0099s that going to come from? The federal deficit was $984 billion in the fiscal year that ended last Sept. 30. This year thanks to trillions in emergency spending because of the pandemic, the Congressional Budget Office projected in April that this yearâ\u0080\u0099s deficit will nearly quadruple to at least $3.7 trillion. That figure will certainly skyrocket even further if another round of pandemic aid gets passed. These vast sums get tacked onto the national debt, currently $26.5 trillion, up nearly $7 trillion since President Trump took office. Weâ\u0080\u0099re drowning in red ink, and now weâ\u0080\u0099re supposed to come up with an extra $2 trillion+ a year more for Social Security, Medicare and Medicaid? Nancy Altman, president of Social Security Works, a Washington-based advocacy group, pulls no punches when she says flatly that the president is making a â\u0080\u009cdeath threatâ\u0080\u009d against not only current Social Security recipients but future ones as well. â\u0080\u009cI do think this is a very serious threat to Social Security if (Trump) is re-elected,â\u0080\u009d Altman says. â\u0080\u009cItâ\u0080\u0099s a declaration of war against everyoneâ\u0080\u0099s economic security. The ones who would first feel the brunt are current beneficiaries, which includes people with disabilities, children whoâ\u0080\u0099ve lost parents and so forth.â\u0080\u009d With no money coming in, the Social Security trust fund, currently about $2.9 trillion, could be completely drained in less than three years. Benefits would then grind to a halt for tens of millions of needy Americans. Of course, our ultra-hyperpartisan Congress could do something, and we know how easy it is for Democrats and Republicans to work together and solve problems, right?"}]}