{"article": [{"url": "https://www.marketwatch.com/story/apple-says-more-with-its-quiet-actions-than-on-the-wwdc-keynote-stage-2020-06-22", "published": 1592926220.0, "headline": "Apple says more with its quiet actions than on the WWDC keynote stage", "body": "While under scrutiny by European regulators for its practices around the App Store and Apple Pay, Apple Inc. made a slight change Monday that could be a signal it is prepared to soften some of its longstanding stringent rules. At its virtual Worldwide Developers Conference on Monday, Apple AAPL, +1.74% quietly snuck a small tile into a screengrab documenting the coming iPadOS 14, offering users an option to select their default internet browser and email application, a big change from the past. Apple has long resisted allowing users to make third-party applications their default software for those two services on Apple devices, keeping Safari and the company’s own email app in those positions. Both an iOS 14 preview of new features and a preview of the iPadOS 14 on the company’s website, posted after the event ended, confirmed the move: “Set a default web browser and email app that launch when you click a link or want to compose a new mail message,” both said. An Apple spokeswoman pointed to that list of new features when asked by MarketWatch about the change. Bundling of apps with a company’s own operating system has been fraught for tech companies in the past. Microsoft MSFT, +2.48% fought — and lost — a costly multiyear battle with the U.S. Justice Department after it was accused in 1998 of abusing its monopoly power in the PC industry for bundling its Internet Explorer web browser and its Windows operating system together and refusing to allow other browsers as the default. Alphabet Inc.’s GOOGL, +1.82% GOOG, +1.97% Google has also run into huge antitrust issues — and was fined $5.07 billion in 2018 by the European Union — for forcing mobile phone makers to pre-install its search engine, Chrome browser and other apps, in exchange for the use of the Android operating system. While facing potential antitrust scrutiny, Apple’s tightly controlled ecosystem has also recently been a focus of ire from a group much more important to Apple than international regulators — the independent developers that keep the App Store stocked. Just before the WWDC began, Apple resolved an issue with high-profile developer Basecamp, the maker of Hey, a new email productivity app that costs $99 a year. Basecamp asked its customers to pay for a subscription through a separate web browser instead of within Apple’s App store, which would avoid the 30% that Apple takes from initial purchases in the App Store. Apple threatened to remove the Hey app from its store if it did not offer in-app purchasing as an option, but a truce was reached by Basecamp offering a free version for 14 days in the iOS app. Apple issued a press release later Monday afternoon and at the very end, noted two new policy changes for the app review process, that will be implemented this summer. One change is that developers will be able to appeal decisions about whether an app violates a given guideline of the App Store review guidelines, but will also have a mechanism to challenge the guideline itself. A second change is for apps that are already on the App Store, bug fixes will no longer be delayed over guideline violations, except for those related to legal issues. These recent solutions that Apple has found — for the Hey app, its new appeal policy, and bug fixes change — don’t necessarily mean that the company has solved all the issues software developers have with the App Store. In addition, the default switch on the iOS 14 likely won’t end antitrust investigations. But on a day when Apple executives said nothing about either issue while talking for nearly two hours on stage, these quiet moves spoke volumes. (This column has been updated with information in an Apple press release issued late Monday afternoon)."}]}