{"article": [{"url": "https://www.marketwatch.com/story/white-house-says-boltons-book-contains-classified-information-but-its-still-on-track-to-be-published-june-23-2020-06-10", "published": 1591969220.0, "headline": "White House says Boltonâ\u0080\u0099s book contains classified information, but itâ\u0080\u0099s still on track to be published June 23", "body": "WASHINGTON â\u0080\u0094 The White House has told former national-security adviser John Bolton that the manuscript of his forthcoming memoir still contains classified material and could present a national-security threat. But Boltonâ\u0080\u0099s lawyer said Wednesday that publication will go ahead as planned on June 23 and accused the White House of unfairly trying to keep it on ice. John Eisenberg, a deputy White House counsel, wrote Bolton attorney Charles Cooper this week raising concerns that the manuscript for â\u0080\u009cThe Room Where It Happenedâ\u0080\u009d still â\u0080\u009ccontains classified information.â\u0080\u009d â\u0080\u009cAs we advised your client when he signed the nondisclosure agreements, and as he should be well as aware as Assistant to the President for the National Security Affairs in this administration, the unauthorized disclosure of classified information could be exploited by a foreign power, thereby causing significant harm to the national security of the United States,â\u0080\u009d Eisenberg wrote in a letter obtained by The Associated Press. Eisenberg added that Bolton would be provided with necessary redactions from the White House no later than June 19. Cooper, writing in the Wall Street Journal, said White House lawyers have slow-walked the process because â\u0080\u009cPresident Trump simply doesnâ\u0080\u0099t want John Bolton to publish his book.â\u0080\u009d â\u0080\u009cThis is a transparent attempt to use national security as a pretext to censor Mr. Bolton, in violation of his constitutional right to speak on matters of the utmost public import,â\u0080\u009d Cooper wrote. â\u0080\u009cThis attempt will not succeed, and Mr. Boltonâ\u0080\u0099s book will be published June 23.â\u0080\u009d Leaked passages from the manuscript roiled Washington in the midst of Trumpâ\u0080\u0099s impeachment trial. Included was the revelation that Bolton said Trump told him he was conditioning the release of military aid to Ukraine on whether Ukraineâ\u0080\u0099s government would help investigate former Vice President Joe Biden and his son Hunter. The younger Biden was paid by a gas company in Ukraine called Burisma to serve as a board member. Reports on Friday indicated the book would see Bolton accusing Trump of taking no position or action not aimed at improving his re-election odds â\u0080\u0094 even at risk of endangering or weakening the U.S. â\u0080\u0094 and alleging that misconduct occurred in Trumpâ\u0080\u0099s dealings with countries besides Ukraine: iframe.twitter-tweet { width: 100% !important; } iframe.twitter-tweet { width: 100% !important; } iframe.twitter-tweet { width: 100% !important; } iframe.twitter-tweet { width: 100% !important; } iframe.twitter-tweet { width: 100% !important; } Bolton initially submitted the transcript as required to Ellen Knight, the National Security Councilâ\u0080\u0099s senior director for prepublication review of materials written by NSC personnel, on Dec. 30, according to Cooper. â\u0080\u009cWhat followed was perhaps the most extensive and intensive prepublication review in NSC history,â\u0080\u009d Cooper wrote. â\u0080\u009cMr. Bolton and Ms. Knight spent almost four months going through the nearly 500-page manuscript four times, often line by line.â\u0080\u009d Cooper said that at the end of the ordeal, Knight told Bolton on April 27 â\u0080\u009cthatâ\u0080\u0099s the last edit I really have to provide for you.â\u0080\u009d â\u0080\u009cYet when Mr. Bolton asked when he would receive the letter confirming the book was cleared, Ms. Knight cryptically replied that her â\u0080\u0098interactionâ\u0080\u0099 with unnamed others in the White House about the book had â\u0080\u0098been very delicateâ\u0080\u0099 and that there were â\u0080\u0098some internal process considerations to work through,â\u0080\u0099 â\u0080\u0099â\u0080\u0099 Cooper wrote. Then Bolton received the letter on Monday that White House concerns about classified material in the book remain. The White House declined to comment Wednesday."}]}