{"article": [{"url": "https://www.marketwatch.com/story/stock-markets-have-now-seen-the-peak-of-fed-stimulus-unless-these-2-things-happen-11600341012", "published": 1600429760.0, "headline": "Stock markets have now seen the 'peak of Fed stimulus' unless these two things happen", "body": "US Federal Reserve Chairman Jerome Powell said more fiscal stimulus from Congress was expected. Eric Baradat/Agence France-Presse/Getty Images Investors were left disappointed by the Federal Reserve's action - or lack of - late Wednesday as the central bank failed to indicate any new stimulus. The Fed said it planned to hold interest rates at nearly zero until the end of 2023 at the earliest, as chairman Jerome Powell gave a cautious outlook. Lena Komileva, chief economist at G-Plus Economics, said markets have now seen the \"peak of Fed stimulus,\" barring a government error or market shock. \"The Fed's new inflation framework has not led to a new policy regime, or fresh action, but to a flatter policy cycle that still provides greater reflationary stimulus against the economy's adjustment to a new with-Covid normal,\" she said. \"This reinforces our view that, barring a new exogenous shock to the economy, or a fiscal policy error failing to bring fresh support to the recovery beyond the November elections, markets have seen the peak of Fed stimulus,\" Komileva added. With no signs of further measures from the Fed, AxiCorp market analyst Milan Cutkovic said the spotlight would now be on Congress over a new stimulus package, with further delays potentially impacting markets. \"The focus will now shift back to the U.S. Congress, where Democrats and Republicans are still struggling to agree on a stimulus package. Investors are becoming increasingly impatient with the lack of progress, and market sentiment could turn sour if there is no deal soon.\" Goldman Sachs GS, -0.21% economist David Mericle noted that while Powell said more fiscal stimulus from Congress was expected, there were risks in both directions. Mericle added that a Democratic sweep in the election would likely mean \"substantial further stimulus,\" while a failure in negotiations over a new stimulus bill this month and a divided government after the election would \"raise the risk of a slower recovery.\""}]}