{"article": [{"url": "https://www.marketwatch.com/story/how-to-buy-10-years-of-retirement-for-3650-2020-09-09", "published": 1601745260.0, "headline": "How to buy 10 years of retirement for $3,650", "body": "Some of the most popular articles I’ve written are about very-long-term investments for young investors, and today I offer you a new approach that’s relatively inexpensive and doesn’t require much work. Over a long lifetime, it’s likely to be very effective. Your cost as a parent or grandparent: $1 per day for as long as you wish to contribute. I’ll focus on 10 years, because that will let you create what I think is the very best long-term portfolio. Three years ago, I wrote an article offering a plan to “make your your kid rich for $1 a day.” I imagined the parents of a baby girl investing $365 for her every year until she was 18, and I calculated that the money could grow to a huge sum at a presumed retirement age of 66. Those calculations were based on the assumption that all the money would be invested in small-cap value stocks, arguably the U.S. asset class with the highest very-long-term growth record. Today, I’ll describe a different scenario, one that’s less risky and provides more diversification. This is based on my long-standing belief that the “ultimate” equity portfolio is a mix of equal parts of 10 asset classes, of which small-cap value stocks is only one. (Read about this “ultimate” strategy here.) The upside of this ultimate equity portfolio is massive worldwide diversification resulting from keeping 80% of the portfolio in asset classes with long histories of outperforming the Standard & Poor’s 500 Index SPX, +0.87%. Since 1970, the combination of these 10 asset classes added about 1.9 percentage points annually to the return of the S&P 500. The downside: You have to own and rebalance 10 mutual funds or exchange traded funds (ETFs). That’s something most investors won’t do on their own. What I propose today is a way to accomplish a similar result with no more than about an hour of attention every year. Here’s how I think it could work, assuming for the sake of this discussion that you are a grandparent. The day your grandbaby is born, open a brokerage account in your name, or in the child’s name with you as custodian, and deposit $365. Invest this money in a mutual fund that owns small-cap value stocks. If your granddaughter (I assume that gender, but either will work) retires at age 70, you have just provided the money she may need for her first year of retirement. If your tiny investment compounds at 12% for those 70 years (lower than the long-term average of small-cap value stocks over the past 92 years) it would grow to $1,017,546. That sounds like a lot of money from just $365, but inflation will likely knock it down a lot. If we assume 3% annual inflation for 70 years, that sum would be worth $120,663 in 2020 dollars. That won’t let your granddaughter live high on the hog, but in today’s dollars it’s sufficient to meet most people’s basic cost-of-living needs. If the money is moved into a Roth IRA starting as soon as she has income to qualify (probably in her teen years), then that $1 million-plus payoff will be tax-free to her. And remember: This cost you only $365, and it does not require her to add even a dime of her own money, ever. On her first birthday, invest another $365 either in the same brokerage account or in a separate one, whichever is more convenient for you. This second one-time investment should go into any of the other nine asset classes I recommend: U.S. large-cap blend (the S&P 500), U.S. large-cap value, U.S. small-cap blend, U.S. REITs, international large-cap blend, international large-cap value, international small-cap blend, international small-cap value, and emerging markets stocks. In each case, invest your tiny initial sum and leave it alone so it can grow for 70 years. There’s no way to know just what the ultimate returns will be, but each of these 10 asset classes has a long-term record of double-digit compounding. If you follow this regimen for 10 years, you’ve invested $3,650 (plus a few hours of time) and bought your granddaughter a basic retirement income for 10 years, from her 70th birthday to her 80th. You’ll probably find that $365 isn’t a heavy burden, and you may decide do the same thing again on her 11th through 20th birthdays. That would either extend this base retirement for another 10 years or (this will of course be entirely her choice) boost what she has to spend in those first 10 years. When your granddaughter is old enough to understand what you have done, you’ll have a terrific teaching opportunity to acquaint her with whatever you want her to know about investing. She’ll likely have plenty of opportunities to add some retirement savings over the years to add to the base layer that you’ve created. This may sound complex, but in fact you can make each annual $365 deposit into a brokerage account with very little fuss. Once you have moved each of these pools of money into a Roth IRA, your work is done. No rebalancing is needed. Except for transferring the money into a Roth IRA when she is eligible, there’s nothing to manage. Here are my specific recommendations of low-cost and no-minimum-balance mutual funds for nine of these asset classes, plus an ETF you can buy commission-free at Fidelity for the last one. Although you can make these investments in any order, the following list concentrates on Fidelity funds first. Asset class Fund name Ticker U.S. small-cap value Fidelity Small Cap Value Index Fund FISVX U.S. large-cap value Fidelity Large Cap Value Index Fund FLCOX U.S. small-cap blend Fidelity Small Cap Index Fund FSSNX U.S. large-cap blend Fidelity ZERO Large Cap Index Fund FNILX International large-cap Fidelity International Index Fund FSPSX Emerging markets Fidelity Emerging Markets Index Fund FPADX U.S. REITs Fidelity Real Estate Index Fund FSRNX International value Schwab Fundamental International Large Company Index Fund SFNNX International small cap blend Schwab Fundamental International Small Company Index Fund SFILX International small-cap value WisdomTree International Small Cap Dividend Fund (ETF) DLS Obviously, there’s no guarantee of a 12% future return from this plan. If the return were only 10%, your granddaughter would have $288,258 instead of nearly $1.02 million. (That’s equivalent to $34,182 in 2020 dollars.) But that’s still a nice sum for a first year of retirement — especially starting with only $365. I’m pretty sure that not many of her peers at age 70 will have had such a generous head start. For more on the amazing results that are possible from very-long-term investing, check out my podcast on the topic. Richard Buck contributed to this article."}]}