{"article": [{"url": "https://www.marketwatch.com/story/putin-appears-to-hedge-bets-on-us-presidential-election-in-russian-state-television-interview-2020-10-09", "published": 1602240920.0, "headline": "Putin appears to hedge bets on U.S. presidential election in Russian state television interview", "body": "MOSCOW (AP) — Russian President Vladimir Putin on Wednesday decried what he called Joe Biden’s “sharp anti-Russian rhetoric” but praised the Democratic presidential nominee’s comments on arms control. In his first detailed statements on the U.S. presidential campaign, Putin also lamented President Donald Trump’s failure to improve relations between Moscow and Washington but blamed this on a “bipartisan consensus on the need to contain Russia, to curb our country’s development.” Putin’s comments, to Russian state television, seemed intended to serve multiple purposes: playing to Trump’s side by casting the Democrats in a pro-Moscow light, while at the same time hedging his bets by flirting with Biden’s camp in case he wins. He said Biden’s reference to Trump in last week’s debate as “Putin’s puppy” was in fact a compliment to Russia and “actually enhances our prestige, because they are talking about our incredible influence and power.” Russia-U.S. relations have sunk to post–Cold War lows over Moscow’s annexation of Ukraine’s Crimea, the Russian meddling in the 2016 U.S. presidential election and other issues. Last month, Microsoft said that the same Russian military intelligence outfit that hacked the Democrats has attempted similar intrusions into the computer systems of more than 200 organizations, including political parties and consultants. While Putin again denied meddling in the U.S. election, U.S. intelligence officials believe Russia is using a variety of measures to denigrate Biden and that individuals linked to the Kremlin are boosting Trump’s re-election bid. See:Wisconsin Republican Ron Johnson on defensive over probe of Biden and Ukraine in wake of intelligence assessment about ongoing Russian election interference Plus:Mitt Romney says fellow Senate Republican Ron Johnson’s probe into Biden son is not a legitimate function of government Biden has been critical of Russia throughout the campaign and dating back to his time as vice president, and the Kremlin leader took note of his “sharp anti-Russian rhetoric,” saying it was something “we regrettably have grown accustomed to.” But Putin also praised Biden for declaring an intention to extend the New START arms-control treaty that expires in February. The U.S.-Russian talks on extending the pact have produced no visible progress, and Russian diplomats said that chances for making a deal with the Trump administration look slim. “This is a very serious element of our potential collaboration in the future,” Putin said, speaking on his 68th birthday. He added that Russia would be ready to work with any future U.S. president. Read on:Trump needs to go public with threats to election security, top Democrats say"}]}