{"article": [{"url": "https://www.marketwatch.com/story/the-no-1-thing-americans-are-spending-their-stimulus-checks-on-even-more-than-splurging-in-costco-walmart-and-target-2020-05-23", "published": 1592391680.0, "headline": "'It's alarming to look at how many Americans used these funds to keep a roof over their head'", "body": "U.S. retail sales jumped by 17.7% in May, the government said Tuesday. Economists polled by MarketWatch had forecast an 8.5% increase. The rebound in U.S. retail sales follows record drop in prior two months, with clothing, home-furnishing stores and stores that sell books, music, sporting goods and other hobby items showing an increase. However, food-service sales were still down 40% in May on the year. \"The comeback was much faster than expected, and looks like a beginning of a v-shaped recovery in consumer spending,\" wrote Jefferies analysts Aneta Markowska and Thomas Simons in a note. \"That's assuming the positive momentum is sustained, something we remain skeptical about.\" “ 'Americans used these funds to keep a roof over their head' ” Nearly one-third (30%) of people said they used their stimulus checks to pay bills, according to a survey released this week, another sign that Americans are struggling to make ends meet, particularly with more than 38 million people filing for unemployment since mid-March. Those bills - including for cellphones, utilities, cable TV and rent - are the No. 1 priority, even more than purchasing essentials and \"relief spending\" on apparel, televisions, video games, sporting goods and toys at Walmart WMT, +1.00%, Costco COST, +1.19%  and Target TGT, +1.14%. \"It's alarming to look at how many Americans used these funds to keep a roof over their head and pay for necessities considering the federal government has not provided clarity about another round of stimulus payments being provided in the near future,\" according to the report by YouGov. Also see:'I'll never give my wife $1,200 to blow her stimulus check. She'll get a couple of hundred bucks to go shopping.' What's wrong with that? \"Americans are aware of how grim the near future could be, and they took the opportunity to use the stimulus funds to help prepare them for it. By paying off debt, consumers free up some credit so they can turn to it, should they find themselves out of a job in the near future,\" it added. Over 160 million stimulus checks are winding their way to households. They're a key part of the government's $2.2 trillion CARES Act, but many furloughed and laid-off workers say a maximum $1,200 payment is not enough to see them through another, and perhaps bigger, Great Recession. Although new jobless claims have been falling since March, over 2.2 million applications for unemployment compensation were filed in the last week of May through state and federal relief programs. That's almost as many as the 2.5 million jobs supposedly regained in the entire month. Other recent findings support the theory that people are struggling to pay bills most of all. As Americans have received their $1,200 stimulus checks, many have used it to keep a roof over their head and food on the table, according to separate research by a team of economists. \"Given the size of the 2020 stimulus checks, we might have expected large impacts on categories like automobile spending, electronics, appliances, and home furnishings,\" wrote economists from Columbia University, Northwestern University, the University of Chicago and the University of Southern Denmark. “ 'Individuals are catching up with rent and bill payments.' ” \"Instead, it seems that individuals are catching up with rent and bill payments as well as engaging in spending on food, personal care and nondurables,\" it said. That research analyzed the spending and saving habits of more than 1,600 people who received their stimulus checks by April 21. The study, distributed this month by the National Bureau of Economic Research, provides another look at how the coronavirus outbreak and its economic consequences suddenly left many American families cash-strapped - especially those making lower incomes. There were glimmers of hope for U.S. workers who are endeavoring to make ends meet with their $1,200 stimulus checks. The Democratic-run House of Representatives approved its HEROES Act, a $3 trillion coronavirus relief package, a fortnight ago, and analysts say it's likely next month or later. Also see:My husband refuses to give me my stimulus check. He says that I don't deserve it because I didn't earn it. What can I do? \"We expect that negotiations over a finalized version of the Phase 4 bill will take at least until the end of May,\" said Height Capital Markets analysts in a note. \"We expect a final package to come together successfully but note that passage will likely be delayed into June.\" The number of confirmed COVID-19 cases and the number of deaths continues to rise. As of Wednesday, there are 2,141,306 confirmed cases of COVID-19 in the U.S., and 117,030 deaths, and 30,909 deaths in New York, the largest of any state in the country. Worldwide, there were 8,210,642 confirmed cases and 444,563 deaths, according to Johns Hopkins University. The Dow Jones Industrial Index DJIA, +0.56%  and the S&P 500 SPX, +0.87%  ended higher Tuesday on the back of higher-than-expected retail sales and a report of a potential therapeutic steroid treatment for patients with severe COVID-19 symptoms. (Andrew Keshner and Silvia Ascarelli contributed to this story.)"}]}