{"article": [{"url": "https://www.marketwatch.com/story/what-a-falling-dollar-means-for-stocks-sector-by-sector-11596652606", "published": 1596700400.0, "headline": "What history says about the stock market and a falling dollar", "body": "Dollar in focus. Getty Images A falling U.S. dollar is getting a lot of attention from stock-market investors, and according to the chart below from Wells Fargo Investment Institute, the focus isn’t misplaced. Wells Fargo Investment Institute The chart sums up how the stock market and a variety of sectors have performed during past episodes of dollar weakness stretching back to 1988. As noted previously, the dollar’s long-term correlation with the S&P 500 SPX is somewhat negative, meaning that equities tend to rise as the dollar falls — though there are exceptions. Dollar weakness has generally been seen as a positive, in particular, for shares of companies, typically large-cap multinationals, who derive a larger share of their revenues overseas. The chart reinforces that view. It shows that companies in the information technology and materials sectors —“with a significant share of sales from overseas—have seen their stock prices outperform when the dollar weakens,” wrote Chao Ma, global portfolio and investment strategist at WFII, in the Wednesday note. “Conversely, sectors heavily focused on U.S. business—including utilities and consumer discretionary—have lagged.” The ICE U.S. Dollar Index DXY, -0.58%, a measure of the U.S. currency against a basket of six major rivals, fell more than 4% in July, ending the month at a more-than-two-year low in a broad-based selloff against other developed-market currencies. The drop was the biggest monthly fall for the index since September 2010. The index was down 0.6% Wednesday near 92.84. The dollar’s retreat comes after a spike to a more-than-three-year high earlier this year as the COVID-19 pandemic began to force the near-shutdown of the U.S. and other economies around the globe. Some analysts see the subsequent unwind as merely a sign investors are more confident in the outlook for global economic growth, while others fear the greenback’s weakness could mark a step toward eroding its status as the world’s premier reserve currency. See: Dollar could be a ‘crash risk’ if U.S. loses its ‘credibility’, analyst warns Unlike some analysts who expect U.S. stocks to rise but underperform their international peers, Ma expects the U.S. equity market to remain in the driver’s seat amid any dollar-driven gains. While non-U.S. developed-market equities and emerging markets have tended to outperform during past periods of dollar weakness, that was probably due in part “to a more favorable international economic outlook and more preferential overseas investment opportunities—a trend that is less evident today,” he said. Instead, WFII favors U.S. over international equities—“along with higher-quality asset classes and sectors such as U.S. large-cap equities and information technology—to potentially capitalize on market leadership and to ‘hedge’ against potential uncertainties in the evolving pandemic and the coming elections,” Ma wrote."}]}