{"article": [{"url": "https://www.marketwatch.com/story/investors-face-a-big-risk-heading-into-the-election-strategist-warns-and-its-not-because-biden-might-win-2020-08-17", "published": 1597666760.0, "headline": "Investors face a big risk heading into the election, strategist warns â\u0080\u0094 and itâ\u0080\u0099s not because Biden might win", "body": "“ â\u0080\u0098It is less about what he does after (the election)â\u0080¦ it is more about what he does before to try and make sure that doesnâ\u0080\u0099t happen.â\u0080\u0099 ” By â\u0080\u009che,â\u0080\u009d Cribstone Strategic Macro founder Michael Harris is referring to Donald Trump. And by â\u0080\u009cthat,â\u0080\u009d Harris is talking about the potential for Trumpâ\u0080\u0099s humiliation at the polls. In other words, Trumpâ\u0080\u0099s efforts to avoid a big loss in November, in Harrisâ\u0080\u0099s mind, is a risk that investors need to guard against by raising cash, buying puts, etc. â\u0080\u009cThat is why I think geopolitics could be especially hot over the next couple of months, and people should be buying protection on that basis, in my view,â\u0080\u009d Harris told CNBCâ\u0080\u0099s â\u0080\u009cSquawk Box Europe.â\u0080\u009d An example of those efforts, he said, could be the ramping up of hostility toward Iran. â\u0080\u009cA most likely â\u0080\u0098rally around the flagâ\u0080\u0099 event would be (the U.S.) attacking Iran or perhaps (a) Venezuela overthrow,â\u0080\u009d Harris told CNBC in an email detailing his views. â\u0080\u009cSo something around a temporary oil spike but not a fundamental call on oil winners.â\u0080\u009d This, he said, could make defense contractors a good place to park some money. â\u0080\u009cTo me the message is just that a heavy act of military aggression is something investors should not be surprised by in the run up to the vote,â\u0080\u009d he explained. While many on Wall Street are concerned that a Joe Biden victory would be bad for the stock market, Harris doesnâ\u0080\u0099t see it that way â\u0080\u0094 in fact, quite the opposite. A Trump win would trigger a â\u0080\u009chuge amount of turbulence in markets,â\u0080\u009d he said, â\u0080\u009cbecause I think the running assumption is we are going to have a lot of hostility and dysfunction in an environment like that.â\u0080\u009d Watch the interview: Meanwhile, the stock market continues to hold up well, though the Dow Jones Industrial Average DJIA, +0.56% Â turned slightly lower in Mondayâ\u0080\u0099s trading session. Both the S&P 500 SPX, +0.87% Â and Nasdaq Composite COMP, +1.39% Â , however, were in the green."}]}