{"article": [{"url": "https://www.marketwatch.com/story/gold-rises-for-a-4th-day-aims-for-9-year-high-at-around-1800-2020-06-24", "published": 1593007400.0, "headline": "Gold marks first loss in 4 sessions as prices pull back from highest finish in nearly 8 years", "body": "Gold futures finished lower Wednesday, as the U.S. dollar strengthened, with the precious metal pulling back a day after their highest finish since 2012, but a retreat in equities amid reports of rising coronavirus cases in many U.S. states helped to limit losses for the safe haven asset. “It seems like a classic battle between the bulls and bears after gold’s very impressive rally over the last couple of days,” said Brien Lundin, editor of Gold Newsletter. “After such strength, it’s only natural to see some consolidation in the gold price, and it’s only natural to expect those with short positions that are under water after the rally to take advantage of a pause to defend their positions.” August gold US:GCQ20 fell $6.90, or 0.4%, to settle at $1,775.10 an ounce, after spending the day trading between a low of $1,770.60 and a high of $1,796.10. It settled Tuesday at the highest for a most-active contract since Oct. 4, 2012, when prices ended at $1,796.50. Prices still trade more than 1% higher week to date. July silver US:SIN20, meanwhile, retreated 39 cents, or 2.2%, at $17.67, following a 0.9% rise in the previous session. Comex gold bears are making every effort to prevent the metal from breaking past $1,800, said Chintan Karnani, chief market analyst at Insignia Consultants, in emailed commentary. “The second quarter is coming to an end,” and gold will see a sharp correction if some large trader looks to book a half yearly profit in gold, he said. Still, there are no fundamental conditions that suggest a gold-price sell off, said Karnani. “Everything is bullish,” with the U.S. and Europe seeing considerable increases in COVID-19 cases. The metal posted gains in each of the last three trading sessions, gaining momentum even as stocks have been buoyant in the past few weeks, partly because investors have been hedging their bets, fearful that the advance in equities from their coronavirus nadir isn’t sustainable. Read:Why gold may continue to rally—as long as U.S. stocks do “In fact, the rally prompted further investment demand for gold as an increasing number of traders are viewing the continued gains on stocks as fragile and unsustainable,” wrote Carlo Alberto De Casa, chief analyst at ActivTrades, in a research report. Weakness in stocks comes as new coronavirus cases have jumped in U.S. states Arizona, Texas and California, reigniting concerns about a resurgence of the virus and potentially throwing into disarray attempts to restart businesses locked down by the epidemic for months. The rise in infections prompted the governors of New York, New Jersey and Connecticut to mandate that visitors to those states coming from hot spots quarantine for at least two weeks. Meanwhile, the International Monetary Fund on Wednesday slashed its economic forecast for 2020 to negative 4.9%, saying that the coronavirus pandemic has caused an unprecedented decline in global activity. Reports of possible trade tensions between the U.S. and its European and North American allies, also was drawing attention after reports indicated that the Trump administration was considering imposing tariffs on an array of goods from Europe totaling some $3.1 billion as well as reimposing tariffs on aluminum imports from Canada. Elsewhere on Comex, metals ended broadly lower on the heels of the bearish economic prospects. July copper US:HGN20 fell 0.3% to $2.6505 a pound. July platinum US:PLN20 dropped 4.9% to $804.60 an ounce and September palladium US:PAU20 shed 3.2% to $1,888.50 an ounce."}]}