{"article": [{"url": "https://www.marketwatch.com/story/officials-from-fbi-homeland-security-other-federal-agencies-post-9-minute-video-to-reassure-voters-on-election-integrity-2020-10-06", "published": 1602064040.0, "headline": "FBI's Chris Wray joins homeland-security and other federal-agency officials in 9-minute video reassuring voters on election integrity", "body": "WASHINGTON (AP) - Four weeks ahead of Election Day, senior national-security officials provided fresh assurances about the integrity of the elections in a video message Tuesday, putting them at odds with President Donald Trump's efforts to discredit the vote. \"I'm here to tell you that my confidence in the security of your vote has never been higher,\" Chris Krebs, the director of the Department of Homeland Security's Cybersecurity and Infrastructure Agency, said in the video message. \"That's because of an all-of-nation, unprecedented election security effort over the last several years.\" “ 'I'm here to tell you that my confidence in the security of your vote has never been higher.' ” - Chris Krebs, Department of Homeland Security's Cybersecurity and Infrastructure Agency The video appeared to be aimed at soothing jangled nerves of voters ahead of an election made unique by an expected surge in mail-in ballots because of the coronavirus pandemic. Though Trump was not mentioned during the nine-minute video, the message from the speakers served as a tacit counter to his repeated efforts, including in last week's presidential debate, to allege widespread fraud in the mail ballot process and to preemptively cast doubt in the legitimacy of the election. The video was released as U.S. officials have revealed efforts to interfere in the election, including Russian attempts to denigrate Democratic presidential nominee Joe Biden. A recent blog post by Microsoft MSFT, +2.48%  described hacking attempts by Russia, China and Iran. William Evanina, the U.S. government's chief counterintelligence official, said in Tuesday's video that foreign adversaries are spreading disinformation, attempting to gain access to election infrastructure and trying to collect derogatory information on candidates, campaigns and prominent Americans. \"Despite these nefarious efforts, our election system remains resilient,\" said Evanina, director of the National Counterintelligence and Security Center. \"To be clear, it would be very difficult for adversaries to interfere with or manipulate voting results at scale.\" See:Russia aims to run down Biden candidacy in support of Trump's re-election, says U.S. counterintelligence official Evanina The four officials conceded that the Nov. 3 election will be different from past ones because of the millions of Americans expected to vote by mail. But they offered no support for the idea that mail-balloting will be tainted by fraud or foreign interference as they detailed the steps their agencies are taking to safeguard the vote. \"No matter which method you choose, your voice is important,\" said FBI Director Chris Wray. \"Rest assured that the security of the election, and safeguarding your vote, is and will continue to be one of our highest priorities.\" In an acknowledgment that the reporting of election results may be delayed not by fraud but for legitimate reasons, Krebs said the outcome of the vote may not be known on Nov. 3 - \"and that's OK. But we're going to need your patience until official votes are announced.\" The officials described the work of their respective agencies in combatting foreign interference and influence operations, with Gen. Paul Nakasone, the head of the National Security Agency and commander of U.S. Cyber Command, describing efforts to \"hunt\" adversaries in cyberspace, attribute particular malicious software to individual cyber actors and impose costs for attacks."}]}