{"article": [{"url": "https://www.marketwatch.com/story/u-s-treasury-yields-tick-lower-as-traders-brace-for-fed-policy-update-11600259865", "published": 1600271420.0, "headline": "U.S. Treasury yields bounce off lows after Fed signals willingness to keep rates low", "body": "Long-term Treasury yields came off their session lows on Wednesday after the Federal Reserve indicated it would keep interest rates at current levels until the end of 2023.What are Treasurys doing? The 10-year Treasury note yield TMUBMUSD10Y, 0.777% was up 0.8 basis point to 0.686%, after trading as low as 0.658%, while the 2-year note TMUBMUSD02Y, 0.156% was virtually unchanged at 0.137%. The 30-year bond yield TMUBMUSD30Y, 1.576% rose 1.6 basis points to 1.447%, after touching an intraday nadir of 1.405%. Bond prices move inversely to yields. What’s driving Treasurys? The Fed’s policy statement said the central bank would keep interest rates near zero until inflation overshot 2% for a sustained period and the U.S. hit maximum employment. The Fed also released its economic projections through 2023. Along with those forecasts, the Fed’s so called “dot plot” of likely interest rates showed that most officials anticipate rates will remain near zero until the end of 2023. After the statement, long-term Treasury yields rose faster than their shorter-term peers, steepening the yield curve. Investors said the bond-market reaction could reflect disappointment about hopes that the Fed would shift its asset purchases towards longer-dated maturities which would have anchored those yields. Fed Chairman Jerome Powell, however, did hold out the possibility of tweaking those purchases in the future. Read: Fed to signal interest-rate hikes won’t be an issue until 2024 In economic data, U.S. retail sales rose 0.6% in August, slightly shy of the consensus estimate of 0.7%. Stripping out for auto sales, retail spending grew 0.7%.What did market participants’ say? “Even if the economy starts to show some more life, there’s clearly a lower for longer and even sedentary bias to their policy,” said Scott Kimball, a portfolio manager at BMO Global Asset Management, in an interview."}]}