{"article": [{"url": "https://www.marketwatch.com/story/nvidias-deal-for-arm-could-mean-a-real-challenge-to-intel-and-amd-but-is-likely-to-face-opposition-2020-09-14", "published": 1600103660.0, "headline": "Nvidiaâ\u0080\u0099s deal for Arm could mean a real challenge to Intel and AMD, but is likely to face opposition", "body": "Nvidia Corp.â\u0080\u0099s bold $40 billion deal to buy chip designer Arm Holdings could create a major new threat to both Intel Corp. and Advanced Micro Devices Inc. in the data-center market, but the deal will face two major hurdles along the way. Nvidia NVDA, -0.54% NVDA, -0.54% NVDA, -0.54% â\u0080\u0094 best known for its graphics chips for gamers and servers â\u0080\u0094 said Sunday it had reached an agreement with Softbank Group Corp. 9984, -1.24% Â to buy Arm Holdings Plc. in a deal valued at $40 billion, in a mix of cash, stock and potential future payouts. Softbank purchased the Cambridge, U.K.-based chip designer in 2017 for more than $32 billion, but has been under pressure by activist investor Elliott Management to sell off some assets, as its balance sheet and portfolio of tech holdings took a heavy hit after the collapse in value of WeWork, one of its big investments. The deal could make Nvidia a strong direct competitor to Intel, which it passed in market value for the first time earlier this year, and AMD, the two leading developers of microprocessors for PCs and servers based on Intelâ\u0080\u0099s x86 architecture. Up until now, Nvidia and its graphics chips have been complimentary to their microprocessor families, but competitive with their graphics chips. A push into microprocessors, with Nvidiaâ\u0080\u0099s ownership of Arm and its different RISC (reduced instruction set computing) architecture, could be the first real challenge to its Silicon Valley neighbors. But Nvidia may face challenges from both regulators and competitors-turned-customers to get there. Eric Ross, an analyst at Cascend Securities, said in a note that if the deal goes through, â\u0080\u009cthe company who should be the most worried in Intel,â\u0080\u009d because Nvidia will pick up a central processing unit (CPU) core for the data center, in addition to the inroads it has made with its graphics chips in that market. â\u0080\u009cAdditional creative designs incorporating the best of CPUs and GPUs into one processor could be advantageous,â\u0080\u009d he said, adding though that the deal with surely face hurdles from many government regulators â\u0080\u0094 not just the U.S., but from China as well. Beyond regulatory hurdles, Nvidia could face some outcry from Arm licensees, many of which are Nvidia competitors. Arm is a unique chip company because it only licenses its designs to a wide swath of companies, where they are mostly used in low-power-consuming devices such as smartphones, tablets and wearables. Arm has over 500 licensees to its technology, and those licensees can tweak the designs and customize them for their own products and customers. Among the biggest Arm customers are Huawei Technologies, Qualcomm Inc. QCOM, +2.06%, Broadcom Inc. AVGO, +0.90% Â , Apple Inc. AAPL, +1.74%, Samsung Electronics 005930, -0.33% Â , Intel Corp. INTC, -1.03% Â and AMD AMD, -3.94%. MarketWatch reached out to several of the biggest Arm licensees for comments, but so far, only Intel responded, by saying it declined to comment. Bernstein Research analyst Stacy Rasgon asked Nvidia executives for more details on how they would keep the open-licensee model in the companiesâ\u0080\u0099 conference call early Monday. Intimated, but not directly stated, in his question was the concern that some customers might not be comfortable with Arm being owned by a competitor. â\u0080\u009cWe would protect the confidentiality information of all of our customers the way we do today and the way that Arm does today,â\u0080\u009d Nvidia co-founder and Chief Executive Jensen Huang responded. â\u0080\u009cNeither of us really know what the customers are doing with our technology. And of course, we work with every company in the world, and so does Arm work with every computer company in the world. We keep everybodyâ\u0080\u0099s confidentiality protected.â\u0080\u009d Rasgon said in a note to clients that if Nvidia can pull it off, â\u0080\u009cNvidiaâ\u0080\u0099s dominance will be extended into virtually every important compute domain which has undeniable strategic value, giving the company the opportunity to potentially differentiate along that path through ownership in ways that they could not if they were simple licensees [of Arm].â\u0080\u009d Evercore ISI Securities said Nvidia will help expand the Arm architecture even further in servers and into networking infrastructure and embedded artificial-intelligence markets, but the analysts remained concerned about regulatory approval. Nvidia executives told analysts on a conference call that they expected regulatory approval to take about 18 months, which is longer than the average approval cycle. In response to a question about China, Huang said that the issue for export controls is not the ownership of Armâ\u0080\u0099s intellectual property, but the origin of the IP, which was created in the United Kingdom. â\u0080\u009cThe IP of Arm was originated, created, developed over three decades in Cambridge,â\u0080\u009d Huang said. â\u0080\u009cAnd so the amount of code, the amount of innovation is measured in thousands of human years. And so the IP will essentially stay in the U.K., the headquarters of Arm will be in the U.K.â\u0080\u009d Even with that optimism, Rasgon noted that Armâ\u0080\u0099s licensees are likely to be â\u0080\u009cup in arms.â\u0080\u009d â\u0080\u009cThere would seem to be risk that Nvidia ownership will impair the current value of the asset,â\u0080\u009d he said. Huang and Co. may be facing one of Nvidiaâ\u0080\u0099s toughest battles yet, but if they win over regulators and Arm customers, the company has a chance to be the new Chip King of Silicon Valley over a pair of longtime rivals."}]}