{"article": [{"url": "https://www.marketwatch.com/story/a-powerful-force-will-determine-what-happens-next-in-the-stock-market-wharton-professor-predicts-2020-08-25", "published": 1598688380.0, "headline": "A 'powerful force' will determine what happens next in the stock market, Wharton professor predicts", "body": "“ 'It's not going to be a serious correction, not anywhere again down near those March lows. A little pause if we get that wave, but I don't think it's going to really stop the longer-term momentum upward.' ” That's Jeremy Siegel, the Wharton professor credited for calling Dow 20,000 in 2015, talking with CNBC about his bullish market outlook despite the potential for a surge in coronavirus cases. He explained that, ultimately, the combination of an effective vaccine and a government committed to pumping the economy with stimulus should provide a tailwind for the stock market. \"Even if it takes another six months more than we hope to get an effective vaccine, when you come back with the liquidity that's provided by the Fed, that's a really powerful force,\" Siegel said. Considering stocks are forward-looking assets, he explained that the market should hold up in the coming months even with lousing economic numbers and a lingering pandemic. \"That's why you can have a 'U' economy, a 'W' economy, and you can still have a 'V' stock market,\" Siegel said. Read:That V-shaped economic recovery? Don't count on it, warns 'Dr. Doom' In reference to the increasingly popular Wall Street theme that value stocks will return as tech stock run out of gas, Siegel told CNBC it doesn't have to be one or the other. \"The amount of the liquidity that's been added to this economy is there. It's not going to be withdrawn by the Fed because unemployment is going to remain high,\" he said. \"So I think there's room really for both groups to go up in 2021, even though we finally might get a turn towards value.\" Watch the full interview: Meanwhile the stock market hit a bit of a speed bump on Tuesday, with the Dow Jones Industrial Average DJIA, +0.56%  and S&P 500 SPX, +0.87%  moving lower. The Nasdaq Composite COMP, +1.39%  , however, managed to push into positive territory."}]}