{"article": [{"url": "https://www.marketwatch.com/story/third-night-of-unrest-in-kenosha-as-police-clash-with-protesters-2020-08-25", "published": 1598439380.0, "headline": "Kenosha Police: 3 shot, 2 fatally, during Wisconsin protests", "body": "KENOSHA, Wis. (AP) — Two people were shot to death and another was wounded during a third night of protests in Kenosha over the police shooting of a Black man, Jacob Blake, and authorities Wednesday hunted for a possible vigilante seen on cellphone video opening fire in the middle of the street with a rifle. The gunfire was reported just before midnight, and Sheriff David Beth said one victim was shot in the head and another in the chest, the Milwaukee Journal Sentinel reported. The third victim’s wounds were not believed to life-threatening. See also: ‘We are scared as Black people in America’: LeBron James and other athletes express anger over Jacob Blake shooting He said that investigators had reviewed footage of what happened and that he was confident a man would be arrested soon. Beth told the Journal Sentinel that armed people had been patrolling the city’s streets in recent nights, but he did not know if the gunman was among them. “They’re a militia,” Beth said. “They’re like a vigilante group.” Wisconsin Lt. Gov. Mandela Barnes told MSNBC early Wednesday that it appeared to be the case that a member of a militia group had taken the law into his own hands and, acting as a vigilante, “mowed down” protesters. Cellphone video of at least two of the shootings that was posted online shows what appears to be a white man with a semiautomatic rifle jogging down the middle of a street as a crowd and some police officers follow him. Someone in the crowd can be heard asking, “What did he do?” and another person responds that the man had shot someone. See also: The father of Jacob Blake, the Black man who was shot by police in Wisconsin, says his son is paralyzed from the waist down The armed man in the cellphone video stumbles and falls, and as he is approached by people in the crowd, he fires three or four shots from a seated position, hitting at least two people, including one who falls over and another who stumbles away to cries of “Medic! Medic!” A witness, Julio Rosas, 24, said that when the gunman stumbled and fell, “two people jumped onto him and there was a struggle for control of his rifle. At that point during the struggle, he just began to fire multiple rounds and that dispersed people near him.” “The rifle was being jerked around in all directions while it was being fired,” Rosas said. In the cellphone footage, as the crowd scatters, the gunman stands up and continues walking down the street as police cars arrive. The man puts up his hands and walks toward the squad cars, with someone in the crowd yelling at police that the man had just shot someone, but several of the cars drive past him toward the people who had been shot. Protester Devin Scott told the Chicago Tribune that he witnessed one of the shootings. “We were all chanting, ‘Black lives matter,’ at the gas station and then we heard, boom, boom, and I told my friend, `’That’s not fireworks,’ ” said Scott, 19. “And then this guy with this huge gun runs by us in the middle of the street and people are yelling, ‘He shot someone! He shot someone!’ And everyone is trying to fight the guy, chasing him and then he started shooting again.” Scott said he cradled one of the lifeless victims in his arms, and a woman started performing CPR. “I don’t think he made it.” At a news conference earlier Tuesday, Ben Crump, the lawyer for Blake’s family, said that Blake was shot multiple times by police on Sunday and that it would “take a miracle” for him to walk again. He called for the officer who opened fire to be arrested and for the others involved to lose their jobs. The shooting of Blake — apparently while three of his children looked on — was captured on cellphone video and ignited new protests over racial injustice in the U.S. just three months after the death of George Floyd at the hands of Minneapolis police touched off a wider reckoning on race. Kenosha police have said little about what happened, other than that they were responding to a domestic dispute. They have not said why the officers opened fire or whether Blake was armed, and they have not disclosed the race of three officers who were on the scene. The 29-year-old Blake underwent surgery Tuesday, according to Crump, who added that the bullets severed his spinal cord and shattered vertebrae. Another lawyer, Patrick Salvi II, said there was severe damage to organs. Blake’s father, also named Jacob Blake, told the Chicago Sun-Times that his son had eight holes in his body. At a news conference, he said police shot his son “seven times, seven times, like he didn’t matter.” “But my son matters. He’s a human being, and he matters,” the elder Blake said. Blake’s mother, Julia Jackson, told CBS “This Morning” in an interview that aired Wednesday that she feels as if she is in a “bad dream” and that it felt “unreal” that her son’s name has been added to the list of Black people shot by police. “Never in a million years did I think we would be here in this place. Him being alive is just a miracle in itself,” she said. During the latest round of unrest Tuesday, police fired tear gas for the third straight night to disperse protesters who had gathered outside Kenosha’s courthouse, where some shook a protective fence and threw water bottles and fireworks at officers lined up behind it. On Tuesday, before the two deadly shootings, the Kenosha County Board sent a letter to Gov. Tony Evers requesting that 1,500 National Guard members be sent to the city in addition to the 250 the first-term Democrat had already dispatched. On Monday night, crowds destroyed dozens of buildings and set more than 30 fires downtown. “Our county is under attack. Our businesses are under attack. Our homes are under attack. Our local law enforcement agencies need additional support to help bring civility back to our community,” the county board leaders wrote. Anger over the shooting has spilled into the streets of other cities, including Los Angeles and Minneapolis, the epicenter of the Black Lives Matter movement this summer following Floyd’s death. Kenosha, on the western shore of Lake Michigan, lies about 40 miles south of Milwaukee and 60 miles north of Chicago."}]}