{"article": [{"url": "https://www.marketwatch.com/story/unemployment-rate-falls-in-43-states-in-may-but-still-tops-20-in-nevada-michigan-and-hawaii-2020-06-19", "published": 1592568020.0, "headline": "Unemployment rate falls in 43 states in May, but still tops 20% in Nevada, Michigan and Hawaii", "body": "The unemployment rate fell in 43 states and Washington, D.C. in May as the economy began to reopen and more employees returned to their jobs, but the number of people not working still stood near record highs and was particularly acute in places like Nevada, Hawaii and Michigan. The unemployment rate fell the most last month in Mississippi, dropping to 10.6% from 16.3% in April. The jobless rate also fell sharply in Kentucky, Indiana, Nevada, Arizona and Tennessee. Even after falling in May, though, Nevada still had the highest unemployment rate in the country at 25.3%. Hawaii was a close second at 22.6%. Earlier this month the Bureau of Labor Statistics reported the U.S. regained 2.5 million jobs in May and the unemployment rate fell to 13.3%. On Friday, the BLS provided the state-by-state breakdown of the data for May. See: Marketwatch’s Coronavirus Economic Recovery Tracker Unemployment is also still extremely high in states with large numbers of COVID-19 cases or stricter lockdown orders such as Michigan. The Wolverine state, site of the some of the biggest anti-lockdown protests, saw just a small decline in unemployment in May to 21.2%. Unemployment rose in five states, with the biggest increase coming in Minnesota, where mass protests took place after the killing of African-American George Floyd by police. The jobless rate rose to 9.9% from 8.7%, though it’s unclear if the incident contributed. A series of sometimes violent protests didn’t take place until the end of the month. Unemployment has been lower in less populated states with smaller numbers of coronavirus cases, mostly in the Midwest and Southern parts of the country. States in those regions did not shut down quite as extensively. Nebraska, for instance, had the nation’s lowest jobless rate. It fell to 5.2% in May from 9.7%. Washington, D.C., meanwhile, also had a surprisingly low unemployment rate at just 8.9%. A greater percentage of people in the nation’s capitol apparently work at professional companies that give them more flexibility to work at home. Yet even with millions of people returning to their jobs, the official statistics on unemployment underestimate just how many people are still out of work. The government said earlier this month the unemployment rate dropped to 13.3% in May from a modern record of 14.7% in April. Most economists think the real jobless rate is closer to 20%. Read: Revisiting that funky drop in unemployment to 13.3%: Nobody really believes it What’s far from clear is whether the unemployment rate will continue to shrink rapidly, especially in light of a recent increase in coronavirus cases. The number of people applying for unemployment benefits is still quite high and estimated 30 million Americans were receiving benefits at the end of May."}]}