{"article": [{"url": "https://www.marketwatch.com/story/dow-futures-edge-back-with-tech-set-to-extend-swoon-as-focus-shifts-to-china-us-tensions-and-fiscal-stimulus-bill-languishes-2020-07-24", "published": 1595665580.0, "headline": "Dow slips Friday, Nasdaq logs back-to-back declines amid rising China-U.S. tensions and languishing fiscal stimulus", "body": "U.S. stocks closed lower Friday as the technology-heavy Nasdaq Composite notched its first back-to-back decline since mid-May, while investors fretted about rising Sino-American tensions and a lack of progress on another fiscal stimulus bill in Washington. Rising coronavirus cases in 40 American states are also limiting business and consumer activity and threatening economic recovery. How did benchmarks perform? The Dow Jones Industrial Average DJIA, +0.56% declined 182.44 points, or 0.7%, to close at 26,469.89; the S&P 500 index SPX, +0.87% gave up 20.03 points, or 0.6%, closing at 3,215.63; and the Nasdaq Composite Index COMP, +1.39% fell 98.24 points or 0.9% to close at 10,363.18. The Nasdaq-100 NDX, +1.51%, comprising the largest companies in the Nasdaq, was down 0.9% at 10,483.13. For the week, the Dow ended 0.8% lower, the S&P 500 had a decline of 0.3%, and the Nasdaq lost 1.3%. The Nasdaq-100 skidded 1.5% for the week, and the Russell 2000 RUT, +0.55% , which tracks smaller companies, finished 0.4% lower. What drove the market? Stocks ended the week with losses as appetite cooled for the giants of the technology world which have carried the burden of the recent multimonth run-up in the broader market. Valuations for the Nasdaq Composite are 22% above its long-term price trend, but that compares with 280% above trend during the height of the dot-com bubble in 2000, said Keith Lerner, chief market strategist, at SunTrust Advisory Services. “Absolute valuations are elevated but are less than half of the levels reached back then,” Lerner said. “The rising influence of a small group of stocks is a risk for the overall market, though these same companies are also contributing an increasing amount of cash flow and profits.” Wall Street has been heartened by quarterly results that have exceeded a low bar in the middle of pandemic, but a run-up in gold prices to a near record and super-low yields in government debt imply that investors fret that the market remains vulnerable to pullbacks after the Nasdaq and the S&P 500 index posted their worst daily drops since June 26 on Thursday. Asian markets tumbled overnight Friday as Beijing retaliated against the U.S. by ordering the closure of the country’s consulate in Chengdu, with tensions between the between the world’s two largest economies escalating from trade frictions to visa restrictions earlier. The U.S. earlier this week ordered China to close its Houston consulate. President Donald Trump, during a coronavirus news briefing on Thursday, also said that a trade pact between China and the U.S. “means less to me now than it did when I made it.” Trump’s comments came as Secretary of State Mike Pompeo on Thursday called on governments around the world to join the U.S. in confronting China’s Communist Party leaders. “The kind of engagement we have been pursuing has not brought the kind of change inside of China that President Nixon had hoped to induce,” Pompeo said in a speech. “Traders are fearful this could be the beginning of a tit-for-tat spat between the two largest economies in the world,” wrote David Madden, market analyst at CMC Markets UK. Thus far, China-U.S. tensions have been ignored in favor of a focus on the public-health crisis and fiscal stimulus. But more recently, all those issues ran head-on into an arguably overvalued market, said Will Geisdorf, senior research analyst with Sarasota, Fl-based Allegiant Private Advisors. “We’re in the middle of a pandemic and the markets are sitting just off their highs for the year,” Geisdorf said in an interview. Several sectors, in fact, are at all-time highs. The weakness in risky assets this week probably represents a “consolidation” rather than a response to the big headwinds, Geisdorf thinks. Markets would be reacting much more forcefully if investors didn’t think Congress would eventually pass some form of additional stimulus, he noted. Read: ‘I certainly don’t think we’re near the end of this.’ Fauci tells MarketWatch: I would not get on a plane or eat inside a restaurant Markets softened on Thursday after Senate Republicans, led by Majority Leader Mitch McConnell, abandoned plans to release a proposal for the next coronavirus relief bill due to continued differences among themselves, almost assuring that an agreement on a further round of stimulus to help curb the economic damage from the viral outbreak won’t come before a provision allowing $600 in extra weekly unemployment benefits expires at the end of the month. On the economic front, the IHS Markit flash manufacturing PMI rose to 51.3 in July from 49.8 in the prior month, weaker than estimates for 51.4, while the flash service PMI rose to 49.6 in the month from 47.9 in the prior month, also below expectations at 50.4, according to Econoday. The composite flash PMI for July was at 50 compared with 47.9 in June. A report on new homes sales showed a rise of 13.8% in June, hitting an annual rate of 776,00 compared with a revised 682,000 in the prior month. On the health front, the global tally for confirmed cases of the coronavirus that causes COVID-19 climbed above 15.5 million on Friday, according to data aggregated by Johns Hopkins University, and the death toll rose to 633,656. The U.S. added more than 69,900 cases on Thursday, according to a New York Times tracker, that shows cases rising in 40 states over the last 14 days, led by Florida and Louisiana. Which stocks were in focus? Intel Corp. shares INTC, -1.03% dove 16.2% and rival Advanced Micro Devices Inc. shares gained 16.5% , after Intel reported its next generation of semiconductor technology will be delayed and that it may actually use a third party to manufacture it as a contingency plan. Schlumberger Ltd. SLB, -1.21% said Friday it had a net loss of $3.434 billion, or $2.47 a share, in the second quarter, after income of $492 million, or 35 cents a share, in the same period a year ago. Shares edged up 0.9%, reversing earlier losses. E-Trade Financial Corp.shares US:ETFC fell 0.9% after the online brokerage service reported fiscal second-quarter results that slightly exceeded Wall Street estimates. Shares of Honeywell International Inc. HON, +0.34% slipped 2.8% after the diversified industrial company reported second-quarter profit and sales that fell, but beat expectations. Shares of Goldman Sachs Group Inc. GS, -0.21% gave up 0.8% Friday, after Bloomberg reported that the bank will pay $3.9 billion as part of a deal that would see Malaysia drop all criminal charges for its role in the 1MDB corruption case. Shares of American Express Co. AXP, +0.26% slid 1.4%, after the credit card and travel services company reported a surprise profit for the second quarter, but revenue that fell more than expected, amid a decline in card member spending and a lower average discount rate. Electric-vehicle maker Tesla shares TSLA, +1.89% were Friday, down 6%Friday as tech stocks were hammered. Verizon Communications Inc. VZ, +0.23% topped earnings and revenue expectations for its second quarter on Friday, but shares of the wireless company dipped slightly in premarket trading. Shares were up 1.8%. How did other markets trade? In Asia, China’s CSI 300 gauge 000300, +2.04% closed 4.4% lower, the Shanghai Composite Index declined 3.9%, while Hong Kong’s Hang Seng index HSI, -0.30% shed 2.2%. In Europe, the Stoxx 600 Europe index SXXP, +0.55% was headed 1.3% lower, while the U.K.’s FTSE 100 UKX, +0.64% shed 1%. Gold futures US:GCQ20 closed at a record Friday, up 0.4%, to settle at $1,897.50 an ounce on the New York Mercantile Exchange, based on records going back to November 1984. September futures for the U.S. crude benchmark US:CLU20 added 22 cents, or 0.5%, to settle at $41.29 a barrel on the New York Mercantile Exchange, despite concerns about rising inventories and geopolitics. The 10-year Treasury note yield TMUBMUSD10Y, 0.777% hung around the lowest levels since April 21 at 0.584%. Yields move in the opposite direction of prices. In currency markets, the dollar edged 0.3% lower in listless trade against its six major rivals, as gauged by the ICE U.S. dollar index DXY, -0.58%."}]}