{"article": [{"url": "https://www.marketwatch.com/story/gold-rides-to-a-record-with-prospects-for-2000-an-ounce-stronger-than-ever-2020-07-24", "published": 1595683040.0, "headline": "Gold rides to a record, with prospects for $2,000 an ounce stronger than ever", "body": "Gold futures posted a record settlement on Friday, along with their strongest weekly performance since early April, with calls for the never-before-seen level of $2,000 an ounce for the precious metal coming in louder than ever. “Gold and silver bulls will face a real challenge over the next two weeks,” said Chintan Karnani, chief market analyst at Insignia Consultants, in a Friday note. But if tensions between China and the U.S. escalate, and the U.S. sees a sharp daily increases in COVID-19 cases, “then gold and silver will only rise.” He believes that price corrections, if any, will be “mild.” The $2,000 mark for gold will be “very easily broken.” August gold GC00, +2.17% US:GCQ20 rose $7.50, or 0.4%, to settle at $1,897.50 an ounce on Comex Friday, after trading as high as $1,904.60. For the week, prices rose 4.8%, the biggest weekly percentage climb since the week ended April 9. The contract topped the most-active contract settlement record of $1,891.90 from August 22, 2011, based on records going back to November 1984, according to Dow Jones Market Data. The record most-active intraday level still stands at $1,923.70 an ounce from Sept. 6, 2011. The front-month July gold contract US:GCN20, which trades on significantly lower volume, notched a record for a second session in a row. It settled at $1,897.30 Friday, up $8.20, or 0.4%, for the session. That’s a record for the front-month contracts, based on data going back to 1975. Read: Gold scores a record close as U.S.-China tensions mount “There are lots of push-and-pull factors in the backdrop” of gold’s rally, said Barani Krishnan, senior commodities analyst at Investing.com. “You have stimulus expectations worldwide after the [European Union] $750 billion coronavirus relief plan, even as Congress goes back and forth on its own CARES 4.0 package for Covid-19 that should bring another $1 trillion into the mix.” The U.S. dollar also continues to “break down, pushing precious metals higher, though simmering U.S.-Chinese tensions are supporting the greenback from a complete meltdown,” he said in emailed commentary. Silver prices, meanwhile, also recently rallied to their highest settlement since 2013, with the September silver US:SIU20 contract on Wednesday settling at $23.144 an ounce. It ended Friday at $22.85, up 15.6% for the week. “Ordinarily this is the quiet time for gold—summer doldrums,” said Ross Norman, chief executive officer of precious metals news and information provider Metals Daily. “Well, not this year.” In a forecast issued to the London Bullion Market Association in December 2019, he had forecast that gold prices would achieve an all-time high this year. Given that, he said there’s “no surprise it has achieved it.” The move has “just been quicker than we had expected.” Read:Why gold has become a ‘weapon of choice’ for investors “In reality, virtually everything is going gold’s way—record debt, epic increase in money supply, silver catching up, negative real yields, and even a dollar correction,” Norman told MarketWatch. George Gero, managing director at RBC Wealth Management, told MarketWatch that gold’s upward momentum is “caused by perfect storm of pandemic headlines, benign dollars and interest rates, as global economic stimulus grows.” “This may last longer than usual cycles” as the pandemic casts a shadow on Europe, South America, the Far East, as well as the U.S., he said. Contributing to gold’s haven appeal are escalating tensions between China and the U.S., the upcoming U.S. election, worries about an increase in debts from continuing stimulus, and unrest everywhere, said Gero. Gold prices have climbed by around 50% since the summer of 2018, when the metal bottomed under $1,200 an ounce, said Adrian Ash, director of research at BullionVault. That’s the fastest two-year gain since New Year 2012, he said. The yellow metal also has climbed around $400 an ounce from March’s COVID-19 crash, “its steepest 17-week gain since the very tops of September 2011 and before that January 1980,” said Ash, adding that trading volumes on BullionVault, an online platform for physical precious metals, reached $28.9 million, which was the third busiest day ever, after March 17 when the COVID crisis really broke, and June 24, 2016, the day of the U.K.’s Brexit referendum result. “Hot money’s finally joined in,” said Ash. That said, analysts warned that gold could soon see a correction. Prices could move lower “on profit taking,” said Norman. At the same time, the stock market is “looking disconnected from the real economy and a sell off could see margin calls again like we saw” in the first quarter, prompting traders to sell gold to cover those margins. Gero voiced caution as well. “Next week, options expirations on Comex, with in-the-money options becoming futures contracts needing cash margin, could bring traders profit taking” in gold, he said. Even if there was a pullback in gold prices, however, Norman said “all that would do is provide a fresh buying opportunity…so that window could close quite quickly.”"}]}