{"article": [{"url": "https://www.marketwatch.com/story/an-experimental-antibody-treatment-reduced-viral-load-in-some-covid-19-patients-that-may-also-be-a-positive-sign-for-vaccines-2020-10-01%7CNEW", "published": 1601810660.0, "headline": "An experimental antibody treatment reduced viral load in some COVID-19 patients. That may also be a positive sign for vaccines", "body": "Promising new clinical data for an experimental COVID-19 treatment hints at a secondary but possibly more important takeaway for investors: if this neutralizing antibody treatment works in coronavirus patients, so will the vaccines that are in development. Regeneron Pharmaceuticals Inc. REGN, +0.36% on Tuesday shared preliminary data from a Phase 1/2/3 clinical trial for REGN-COV2, finding that the investigational therapy reduced viral load and made symptoms go away sooner in some non-hospitalized patients with mild or moderate cases of COVID-19. It was most effective in patients with higher viral loads who had not tested positive for antibodies. Regeneron’s stock was up 0.1% in Thursday trade. “We believe our data will have positive implications for the likelihood of success of vaccines that target the same spike protein that REGN-COV2 targets,” Regeneron CEO Leonard Schleifer told investors on Tuesday, according to a FactSet transcript of the call. See also: Abbott exec: Why better COVID-19 tests may help the U.S. get back to normal Of the different types of therapies being tested as COVID-19 treatments, at least two are what is called neutralizing antibody cocktails. Along with Regeneron’s candidate, Eli Lilly & Co. LLY, +2.20% is also developing one, called LY-CoV555 and produced using the plasma of people who have recovered from COVID-19 infections. In mid-September, the drugmaker released promising interim data from a Phase 2 trial for LY-CoV555. Wall Street analysts view an emergency use authorization for REGN-COV2 as somewhat inevitable — “We live in interesting times,” Bernstein analysts wrote in an investor note — and perhaps one that will arrive before the election in November. SVB Leerink’s Geoffrey Porges predicts that both Lilly and Regeneron’s antibody cocktails will receive authorization from the FDA this year. Yet what excited them the most was the broader implication that if an antibody-based cocktail appears to work in some COVID-19 patients, how will that finding carry over to the closely watched field of vaccine development. “We are most focused on [second] derivative read-through,” Raymond James analysts wrote in a note on Tuesday to investors. “If treatment works, prophylaxis should work, and if prophylaxis works, vaccines should work.” Read: There are seven coronavirus vaccine candidates being tested in the U.S. — here’s where they stand There are seven vaccine candidates in clinical trials in the U.S., including four that have moved into Phase 3 trials. (The late-stage study for AstraZeneca AZN, +1.16% AZN, +0.63% and the University of Oxford’s vaccine candidate is still paused in the U.S.) The vaccines use what is called the S-protein as their immunogen. Regeneron’s therapy includes two different forms of S-protein antibodies. “The implications here for timing of market opening are positive,” Bernstein analysts wrote. “To the extent antibody cocktail is available in additional [to] vaccines in early 2021, the confidence individual[s] will have in de-distancing will increase.” So far this year, Regeneron’s stock has soared 50.6%, shares of Lilly are up 9.9%, and the S&P SPX, +0.87% has gained 4.1%."}]}