{"article": [{"url": "https://www.marketwatch.com/story/market-timing-when-clocks-have-no-hands-warren-buffetts-warning-is-as-relevant-now-as-it-was-in-2000-2020-08-23", "published": 1598701460.0, "headline": "Market timing when â\u0080\u0098clocks have no handsâ\u0080\u0099 â\u0080\u0094 Warren Buffettâ\u0080\u0099s warning is as relevant now as it was in 2000", "body": "“ â\u0080\u0098They know that overstaying the festivities â\u0080\u0094 that is, continuing to speculate in companies that have gigantic valuations relative to the cash they are likely to generate in the future â\u0080\u0094 will eventually bring on pumpkins and mice. But they nevertheless hate to miss a single minute of what is one helluva party. Therefore, the giddy participants all plan to leave just seconds before midnight. Thereâ\u0080\u0099s a problem, though: They are dancing in a room in which the clocks have no hands.â\u0080\u0099 ” Thatâ\u0080\u0099s a quote from Warren Buffettâ\u0080\u0099s letter to shareholders way back in 2000, but it resurfaced on Reddit on Sunday, with investors comparing it to the current stock market environment. At the time, the Berkshire Hathaway BRK.B, +0.24% Â Â chairman was comparing those cashing in during the frenzy of the dot-com bubble to Cinderella at the ball. â\u0080\u009cThe line separating investment and speculation, which is never bright and clear, becomes blurred still further when most market participants have recently enjoyed triumphs,â\u0080\u009d Buffett wrote in the letter. â\u0080\u009cNothing sedates rationality like large doses of effortless money.â\u0080\u009d Todayâ\u0080\u0099s investor knows a thing or two about effortless money, as the disconnect between the market highs and the reality of the devastated economy has never been more pronounced, thanks in large part to the Federal Reserveâ\u0080\u0099s commitment to pumping cash into the system. Buffettâ\u0080\u0099s fairy-tale quote isnâ\u0080\u0099t the only thing harkening back to those heady tech days. The â\u0080\u009cBuffett Indicator,â\u0080\u009d which takes the Wilshire 5000 Index and divides it by the annual U.S. GDP, recently touched its highest level since right before the 2000 bubble popped. Hereâ\u0080\u0099s what that chart looks like: iframe.twitter-tweet { width: 100% !important; } â\u0080\u009cWhat does that mean for us? It means stay long stocks in longer-dated accounts, and make sure you own assets (such as a house, etc.),â\u0080\u009d Sevens Report Research founder Tom Essay recently explained to Yahoo Finance. â\u0080\u009cBut it also means this asset inflation cycle better not stop, because... if asset inflation stops, itâ\u0080\u0099s a long, long way down to fundamental support.â\u0080\u009d Meanwhile, the â\u0080\u009cgiddy participantsâ\u0080\u009d just keep dancing, with stocks extending last weekâ\u0080\u0099s gains on Monday. At last check, the Dow Jones Industrial Average DJIA, +0.56% Â , Nasdaq Composite COMP, +1.39% Â and S&P 500 all were solidly in the green. And if youâ\u0080\u0099re looking for signs of bubble behavior among investors, look no further than Redditâ\u0080\u0099s jayjay16022, who offered this take in the commentâ\u0080\u0099s section under the Buffett quote: â\u0080\u009cI canâ\u0080\u0099t help but feel like we live in times when the old rules donâ\u0080\u0099t apply any longer. Itâ\u0080\u0099s not just Tesla TSLA, +1.89% Â . Apple AAPL, +1.74% Â is worth almost ten times its revenue. Same goes for Alphabet AAPL, +1.74% Â and many other NASDAQ COMP, +1.39% Â companies,â\u0080\u009d he wrote in his Reddit post. â\u0080\u009cIs this really just another giant bubble, or is this the New Age fueled by low interest rates and massive bond buying by the FED? Only time will tell.â\u0080\u009d So, is it really different this time?"}]}