{"article": [{"url": "https://www.marketwatch.com/story/thinking-about-loaning-money-to-a-family-member-heres-how-to-avoid-a-tax-headache-2020-07-07", "published": 1594473500.0, "headline": "Loaning money to a family member? Donâ\u0080\u0099t raise these red flags with the IRS", "body": "The COVID-19 crisis and its economic fallout can put people into cash-strapped situations. If a favorite relative is in that unfortunate mode, you might be thinking about loaning that person some money. If you decide to follow through, please make the loan a tax-smart loan. We will explain. Here goes. Get it in writing Regardless of the interest rate you intend to charge your well-loved relative (if any), you want to be able to prove that you intended the transaction to be a loan rather than an outright gift. That way, if the loan goes bad, you have the option of claiming a non-business bad debt deduction on your Form 1040 for the year the loan becomes worthless. The Internal Revenue Code classifies losses from personal loans gone bad as short-term capital losses. Thatâ\u0080\u0099s OK, because short-term capital losses can be very helpful. You use the loss first to offset short-term capital gains that would otherwise be taxed at high rates. Any remaining net short-term capital loss is used to offset net long-term capital gain. After that, any remaining net capital loss is used to offset up to $3,000 of high-taxed ordinary income ($1,500 if you use married filing separate status). If after all that, you still have a remaining net capital loss, carry it forward to next year. Without a written document, your intended loan will probably be characterized as a gift by the IRS if you get audited. Then if the loan goes bad, you wonâ\u0080\u0099t be able to claim a non-business bad debt deduction. Ill-advised â\u0080\u009cgiftsâ\u0080\u009d do not result in deductible losses. To avoid this fate, your family loan should be evidenced by a written promissory note that includes the following details: * The interest rate, if any. * A schedule showing dates and amounts for interest and principal payments. * The security or collateral, if any. You should also document why it seemed reasonable to believe you would be repaid at the time you made the loan. That way, if the loan goes bad, you have evidence that the transaction was always intended to be a loan rather than an outright gift. Plan B If it looks like your well-loved borrower is going to be unable to repay the loan, your other option is to simply forgive it and treat the whole deal as a gift. With todayâ\u0080\u0099s ultra-generous unified federal gift and estate exemption ($11.58 million for 2020), turning the loan into a gift is unlikely to cause you any tax heartburn, unless the loan is really big. Youâ\u0080\u0099re probably well-advised to avoid making really big loans to relatives in the first place. Duh. Anyway, turn the loan into a gift before it has clearly become totally worthless and before making collection efforts. If youâ\u0080\u0099re audited, you want to have evidence to support your characterization of the transaction as an outright gift. When the IRS starts asking questions about anything, it can lead to more questions about completely unrelated things. You donâ\u0080\u0099t want that. The interest rate issue Assuming your loan stays a loan, please keep reading. Most loans to family members are so-called below-market loans in tax lingo. Below-market means a loan that charges no interest rate or a rate below the applicable federal rate, or AFR. AFRs are the minimum interest rates you can charge without creating any weird and unwanted tax side effects for yourself. AFRs are set by the IRS, and they can potentially change every month. Right now, AFRs are amazingly low. So, making a loan that charges the current ultra-low AFR, instead of 0%, makes amazingly good sense â\u0080\u0094 if you want to give your well-loved relative an ultra-low interest rate without causing any tax weirdness for yourself. Current AFRs for term loans For a term loan (meaning one with specified final repayment date), the relevant AFR is the rate in effect for loans of that duration for the month you make the loan. Here are the AFRs for term loans made in July of 2020. * For a short-term loan (one with a term of 3 years or less), the AFR is 0.14%, assuming annual compounding of interest. Thatâ\u0080\u0099s not a misprint. * For a mid-term loan (one with a term of more than 3 years but not more than 9 years), the AFR is 0.45%. Not a misprint. * For a long-term loan (one with a term of more than 9 years), the AFR is 1.17%. Not a misprint. Wow. The same AFR continues to apply over the life of the loan, regardless of how interest rates may fluctuate. As you can see, these AFRs are just a wee bit lower than rates charged by commercial lenders. As long as you charge at least the AFR on a loan to a family member, you donâ\u0080\u0099t have to worry about any weird federal tax complications. Example: You make a five-year term loan to your beloved nephew in July of 2020 and charge an interest rate of exactly 0.45% with annual compounding (the AFR for a mid-term loan made in July of 2020). Youâ\u0080\u0099ll have to report taxable interest income based on that microscopic rate for the life of the loan. Big deal. Your nephew will have an equal amount of interest expense, which may or may not be deductible depending on how the loan proceeds are used. Whatever. We are almost certainly talking peanuts here. AFRs for demand loans If you make a demand loan (one that you can call due at any time) instead of a term loan, the AFR for each year will be an annual blended rate that reflects monthly changes in short-term AFRs. The annual blended rate can change dramatically if general interest rates change dramatically. That creates uncertainty that both you and the borrower (your well-loved relative) might prefer to avoid. In contrast, making a term loan that charges the current AFR avoids any interest-rate uncertainty, because the same AFR applies for the life of the loan. The interest rate you charge equals or exceeds the AFR The federal income tax results are straightforward if your loan charges an interest rate that equals or exceeds the AFR. You must report the interest income on your Form 1040. The borrower (your relative) may or may not be able to deduct the interest, depending on how the loan proceeds are used. If the loan is used to buy a home, the borrower can potentially treat the interest as deductible qualified residence interest if you take the legal step of securing the loan with the home. Remember, however, that qualified residence interest wonâ\u0080\u0099t cut the borrowerâ\u0080\u0099s federal income tax bill unless he or she itemizes. The interest rate you charge is below the AFR Now the tax results can get weirdly complicated. But with AFRs as low as they are right now, the complications are highly unlikely to adversely affect your tax situation in any meaningful way. Nevertheless, hereâ\u0080\u0099s the story, because inquiring minds want to know. When you make a below-market loan (one that charges an interest rate below the AFR) to a relative, the Internal Revenue Code treats you as making an imputed gift to the borrower. The imaginary gift equals the difference between the AFR interest you â\u0080\u009cshould haveâ\u0080\u009d charged and the interest you actually charged, if any. The borrower is then deemed to pay these phantom dollars back to you as imputed interest income. Although this is all fictional, you must still report the imputed interest income on your Form 1040. The resulting extra federal income tax hit is not fictional. But with todayâ\u0080\u0099s ultra-low AFRs, the imputed interest income and the related tax hit will be negligible or nearly negligible â\u0080\u0094 unless you make a really big loan. The $10,000 loophole For below-market loans of $10,000 or less, the Tax Code says you can completely ignore all the aforementioned imputed gift and imputed interest income nonsense. To qualify for this loophole, all outstanding loans between you and the borrower (with below-market interest or otherwise) must add up to $10,000 or less. If that will be your situation, feel free to charge an interest rate below the AFR. Charge 0% if you want. There wonâ\u0080\u0099t be any weird federal tax consequences. Good.The $100,000 loophole Another loophole is available if all outstanding loans between you and the borrower (with below-market interest or otherwise) add up to $100,000 or less. This loophole involves imputed gifts and imputed interest income, but we wonâ\u0080\u0099t go into the sordid details because this column is already way too long. The important thing to know is this: right now, making a below-market loan that falls under this loophole is highly unlikely to cause you or the borrower anything other than a very negligible amount of tax heartburn, if it causes any heartburn at all. Your tax pro can fill in the blanks. The bottom line Weird and unwanted tax complications can arise when youâ\u0080\u0099re nice enough to make a below-market loan to a family member. For below-market loans made right now, however, the complications are highly unlikely to make any meaningful difference to your tax situation. They might not come into play at all. That said, AFRs usually change every month, so the exact tax results from making a below-market loan can be a moving target. Check with your tax pro before pulling the trigger on anything significant. If the current interest rate environment holds, youâ\u0080\u0099ll probably be told not to worry. But things can change in a hurry. Is that the understatement of the year or what?"}]}