{"article": [{"url": "https://www.marketwatch.com/story/as-trump-continues-to-press-for-coronavirus-vaccine-by-election-day-public-health-officials-vow-no-cutting-corners-2020-09-24", "published": 1600912220.0, "headline": "As Trump continues to press for coronavirus vaccine by Election Day, public health officials vow 'no cutting corners'", "body": "WASHINGTON (AP) - A huge international study of a COVID-19 vaccine that aims to work with just one dose is getting underway as top U.S. health officials sought Wednesday to assure a skeptical Congress and public that they can trust any shots the government ultimately approves. Hopes are high that answers about at least one of several candidates being tested in the U.S. could come by year's end. “ 'President Trump is still trying to sabotage the work of our scientists and public health experts for his own political ends.' ” - Sen. Patty Murray \"We feel cautiously optimistic that we will be able to have a safe and effective vaccine, although there is never a guarantee of that,\" Dr. Anthony Fauci, infectious-diseases chief at the National Institutes of Health, told a Senate committee. See:Just 4 in 10 Americans now say they would get the first coronavirus vaccine - and most don't expect to pay out of pocket President Donald Trump is pushing for a faster timeline, which many experts say is risky and may not allow for adequate testing. On Wednesday he tweeted a link to news about the new Johnson & Johnson vaccine study and said the Food and Drug Administration \"must move quickly!\" See:Trump suggests he wouldn't permit FDA to tighten standards for an emergency-use authorization of a coronavirus vaccine \"President Trump is still trying to sabotage the work of our scientists and public health experts for his own political ends,\" Sen. Patty Murray, a Democrat from Washington state, said before ticking off examples of pressure on the FDA. FDA Commissioner Stephen Hahn pledged that career scientists, not politicians, will decide whether any coronavirus vaccine meets clearly stated standards that it works and is safe. Vaccine development usually takes years but scientists have been racing to shorten that time, in part by manufacturing doses that will have to be thrown away if studies find they don't work. \"Science will guide our decisions. FDA will not permit any pressure from anyone to change that,\" Hahn said. \"I will put the interest of the American people above anything else.\" FDA has faced criticism for allowing emergency use of some COVID-19 treatments backed by little evidence, but Hahn said if vaccine makers want that faster path to market, additional standards will be coming soon. Vaccines, unlike therapies, are given to healthy people and thus usually require more proof. But Trump made clear at a Wednesday evening White House news conference that he was skeptical of any regulatory changes that might delay a vaccine's authorization, even if those changes are aimed at increasing public trust. Asked about the FDA considering stricter guidelines for emergency approval, Trump suggested the effort was politically-motivated. \"I think that was a political move more than anything else,\" he said, arguing that that the companies testing the vaccines, such as Pfizer PFE, -0.27%, Johnson & Johnson JNJ, +1.39%  and Moderna MRNA, +0.09%, are capable of determining whether they work. \"I have tremendous trust in these massive companies,\" he said. A handful of vaccines already are in final testing in the U.S. and other countries. In one of the largest studies yet, Johnson & Johnson aims to enroll 60,000 volunteers to test its single-dose approach in the U.S., South Africa, Argentina, Brazil, Chile, Colombia, Mexico and Peru. Other candidates in the U.S. require two shots. J&J's vaccine is made with slightly different technology than others in late-stage testing, modeled on an Ebola vaccine the company created. Final-stage testing of one experimental vaccine, made by AstraZeneca AZN, +1.16%  and Oxford University, remains on hold in the U.S. as officials examine whether it poses a safety risk. As for the testing of vaccine candidates, Fauci added: \"There is no cutting corners.\" Beyond vaccines, Trump regularly undercuts confidence in his own public health agencies, such as falsely tweeting about a \"deep state, or whoever at FDA\" - and in recent weeks, some political appointees were forced out after allegations they interfered with scientific advice. Conspiracy theories are sapping the morale of disease fighters working 24/7 at the Centers for Disease Control and Prevention, Dr. Robert Redfield, its director, told the Senate committee on health, education, labor and pensions. \"It's offensive to me when I hear this type of comment,\" said Redfield, noting that CDC, like the military, strives to be nonpartisan. Yet Redfield struggled to defend against criticism that CDC bowed to political pressure with guidelines that discouraged testing of people without COVID-19 symptoms. Asymptomatic people do spread the virus and CDC, under fire, later changed the guidelines' wording. Redfield insisted it all amounted to misinterpretation and stressed Wednesday: \"More tests will actually lead to less cases.\" More than 200,000 Americans have died from COVID-19 so far this year, and in many states infections still are climbing. The U.S. is confirming an average of 41,968 new daily cases, up 13% compared with the average two weeks ago. Fauci was blunt: More lives could have been saved if everyone in the country better followed recommendations to wear masks, avoid crowds and keep 6 feet apart. \"We know some states did a good job. Some states did not so good a job. Some states tried to do a good job but people didn't listen,\" he said, singling out mask-less crowds in bars. Going forward, \"we need uniformity throughout the country.\" In a testy exchange, Sen. Rand Paul of Kentucky insisted public health officials were wrong that a lockdown could change the course of the pandemic. A visibly angry Fauci accused the Republican of repeatedly misconstruing his statements. \"I don't regret saying that the only way we could have really stopped the explosion of infection was by essentially - I want to say shutting down,\" he said. Fauci dismissed Paul's contention that hard-hit New York has become largely immune because so many people were infected: \"If you believe 22% is herd immunity, I believe you're alone in that.\" Don't miss:Watch as Anthony Fauci hits back at Rand Paul over herd immunity: 'You're not listening' Fauci also called attention to so-called \"long-haulers,\" COVID-19 survivors who continue to struggle with a range of symptoms such as pain, fatigue, even heart damage. He warned much remains unknown about the long-term effects of the virus. Democrats warned those survivors are at risk of being denied insurance if the Trump administration succeeds in overturning an Obama-era health law that forbids companies from turning down people with pre-existing health problems or charging them more. The death of Justice Ruth Bader Ginsburg means there are no longer five justices on the Supreme Court who have upheld the Affordable Care Act. \"We will see rates skyrocket for anybody who has had COVID,\" predicted Sen. Chris Murphy, D-Conn. See:COVID-19 is the new pre-existing condition, Democratic senators warn as Republicans remain committed to vanquishing 'Obamacare' A vaccine \"will go a giant step\" in controlling infection, but Fauci warned people still will need to take those precautions for a while after the first vaccine arrives because it won't change conditions overnight. Why? It's unusual for a vaccine to be 100% effective. There won't be enough at first for everyone, and even once there is, it will take months to get the shots into the arms of every American who wants one - an effort CDC's Redfield sees stretching into June or July. Because of the enormous logistical challenges, CDC wants states to get ready now and on Wednesday, announced they would get $200 million to help begin setting up those operations. \"We want to do that the instant it is approved. Not the following day but the following moment,\" Trump said."}]}