{"article": [{"url": "https://www.marketwatch.com/story/5-things-to-do-if-you-inherit-a-roth-ira-2020-10-09", "published": 1602237320.0, "headline": "5 things to do if you inherit a Roth IRA", "body": "This article is reprinted by permission from NerdWallet. If someone in your life was kind enough to bequeath you their Roth IRA, bow your head in thanks. Then? Create a plan for what to do with that money. Planning for an inheritance is always important, but it’s become even more so since the Secure Act was signed into law in December of last year. The act imposes a new rule on inherited IRAs if the account owner died after Dec. 31, 2019: Beneficiaries must empty the account within 10 years of the owner’s death, unless they qualify for an exception (more on those below). See: Should everyone invest in a Roth? Before that new law, you could stretch inherited IRA withdrawals over your lifetime, letting the money grow for decades, assuming you didn’t need it sooner. Now, not so much. Still, there’s some flexibility: As long as you meet the 10-year rule, you can choose how much to pull out and when. Here’s how to plan your strategy.1. Move the money to an inherited IRA account Before you start making plans for this money, there’s some administrative work to get out of the way. If you’re a nonspouse beneficiary, you’ll need to open a new inherited IRA account and transfer the IRA you inherited into that account. If you inherited the IRA from your spouse, you can simply move the money into your own IRA account, if you already have one. If not, you can open one and transfer the assets in. A note on IRAs: There are two main types. Roth IRAs are a wonderful gift because you generally won’t owe any tax on withdrawals. However, if you inherit a traditional IRA, you will owe taxes when you withdraw money. When you open your inherited IRA, be sure to open the same type of account you inherited.2. See if you qualify for an exemption There are several exceptions to the Secure Act’s new 10-year requirement. The timeline for taking distributions is different if: You inherited the IRA from your spouse. You can treat this account like it’s your own. That means if it’s a Roth, you don’t have to take any withdrawals in your lifetime. If it’s a traditional IRA, required distributions start when you reach age 72. You’re a minor child. You must start distributions, but they’ll be figured based on your life expectancy, just as before the Secure Act. But don’t get too excited: That rule applies only until you reach the “age of majority,” which in most states is 18. At that point, you have 10 years to withdraw the entire account. You’re chronically ill or disabled. If you meet a strict IRS definition of chronically ill or disabled, you can stretch the IRA distributions out over your lifetime. You’re not more than 10 years younger than the account owner. Withdrawals can be stretched over your lifetime. This exception often applies if a sibling is named as beneficiary, but unmarried couples also may meet this exception. The surviving unmarried partner “will have to start taking the distributions, but they get to span it out over their lifetime,” says Jean Wilczynski, a certified financial planner with Exencial Wealth Advisors in Old Lyme, Connecticut. 3. Increase retirement savings If you don’t qualify for an exception to the 10-year rule, you’ll need to decide how much to withdraw and on what schedule. This decision is easier with an inherited Roth IRA because withdrawals come out tax-free. They’re not counted in your income. (With a traditional IRA, distributions generally are treated as income. They might push you into a higher tax bracket, so plan withdrawals carefully.) If you don’t need the money immediately, your Roth IRA inheritance could be a great opportunity to ramp up retirement savings. If you have a workplace retirement plan or your own IRA, consider using your inherited IRA withdrawals to cover living expenses. That could free you up to contribute more of your earned income into your own retirement plan. (You must have earned income from work to contribute to an IRA, and your income can’t exceed the Roth IRA income limits.) If you qualify, you can put as much as $6,000 a year ($7,000 if 50 or older) into an IRA every year, and up to $19,500 ($26,000 if 50 or older) into a 401(k). 4. Focus on other money goals If you’re already on track with retirement savings, consider allocating this money to another financial goal. “If you inherit money or have any windfall, the first thing is to build up your cash reserves or emergency funds, then pay down debt, especially high-interest credit cards and student loans,” Wilczynski says.5. Consult an expert There are all kinds of potential complexities to these decisions. Consider hiring a financial adviser for advice. For example, if you’re close to retirement, you may want to delay Social Security and live off your inherited IRA withdrawals for a few years. Delaying would mean higher monthly Social Security benefits for the rest of your life. Learn more: All about the Roth IRA If you’re younger, a financial adviser can help you juggle your goals and figure out the best place to put this money.More from NerdWallet: 5 Reasons to Add Beneficiaries to Your Investment Accounts Now Who Should Consider a Roth Conversion Now? 8 Moves to Consider for IRAs, 401(k)s Under New Secure Act Andrea Coombes is a writer at NerdWallet. Email: acoombes@nerdwallet.com. Twitter: @andreacoombes."}]}