{"article": [{"url": "https://www.marketwatch.com/story/coronavirus-concerns-kicked-to-curb-as-sturgis-motorcycle-rally-in-south-dakota-draws-tens-of-thousands-2020-08-09", "published": 1596976160.0, "headline": "Coronavirus concerns kicked to curb as Sturgis Motorcycle Rally in South Dakota draws tens of thousands", "body": "STURGIS, S.D. (AP) — The coronavirus may be changing the world, but there aren’t many signs of the pandemic at the massive annual motorcycle rally being held this week at a small city along Interstate 90 in western South Dakota. The scene Saturday at the 80th Sturgis Motorcycle Rally was familiar to veterans of the event, with throngs of maskless bikers packing the streets. Motorcyclist Kevin Lunsmann, 63, rode more than 600 miles to the rally from Big Lake, Minn., with several friends. Lunsmann said he has attended the Sturgis event every year since 2003 and didn’t want to miss the 80th, despite being “somewhat” concerned about the coronavirus. Still, the crowds of people and rows of bikes surprised him. He said there was no difference from previous years “other than a few people wearing masks.” See:U.S. coronavirus infections now exceed 5 million “ ‘Screw COVID. I went to Sturgis.’ ” — T-shirt on sale at event Lunsmann said he was avoiding the bars and nightclubs that line the city’s main drag this year, but many others were not. They were filled with revelers as the sun set Friday. “Everybody’s still partying hardy,” Lunsmann said. Organizers expected the overall crowd to be smaller, perhaps half the size of a normal year, when some half-million people from across the country roar into a town whose population is around 7,000. The sheer numbers raise the prospect that this year’s rally could spread the COVID-19 virus in a state with no special limits on indoor crowds, no mask mandates, and a governor who is eager to welcome visitors and their money. “Screw COVID,” read the design on one T-shirt being hawked at the event. “I went to Sturgis.” Bob Graham, 71, was one of the few people wearing masks as he walked along Main Street. “We don’t want the virus. We want to come up here a few more years yet,” Graham said. Graham made his 36th annual trip to Sturgis from Central City, Neb., with his wife, calling it “kind of like our therapy for the year.” For Stephen Sample, who rode his Harley from Arizona, the event was a break from the routine of the last several months, when he’s been mostly homebound or wearing a mask when he went to work as a surveyor. “I don’t want to die, but I don’t want to be cooped up all my life either,” he said. People crowded around bars in Sturgis, S.D., on Friday. Associated Press Sample was aware his trip to the rally could end in the hospital, which seemed to weigh on him. “This is a major experiment,” he said. “It could be a major mistake.” Republican Gov. Kristi Noem has taken a largely hands-off approach to the pandemic, avoiding a mask mandate and preaching personal responsibility. She supported holding the rally. Daily virus cases have been trending upward in South Dakota, but the seven-day average is still only around 84, with fewer than two deaths per day. Sturgis officials plan to mass test residents to try to detect and halt outbreaks, but the area’s largest hospital system is already burdened with the influx of tourists and bikers who inevitably need medical care during this time. Marsha Schmid, who owns the Side Hack Saloon in Sturgis, was trying to keep her bar and restaurant from becoming a virus hot spot by spacing out indoor tables and offering plenty of hand sanitizer. She also scaled back the number of bands hired for the rally, hoping the crowds would stay thin but still spend the cash that keeps her business viable for the rest of the year. “You’ve got people coming from all over the world,” she said. “I just hope they are being responsible and if they don’t feel good, they stay away.”"}]}