{"article": [{"url": "https://www.marketwatch.com/story/barclays-profit-plunges-books-48-billion-charge-2020-07-29", "published": 1595990840.0, "headline": "Barclays profit plunges, books $4.8 billion charge", "body": "Barclays PLC reported Wednesday a more-than-halved pretax profit for the first half of 2020 after booking large credit impairment charges for the period, while it warned of a challenging second half. The British bank posted a pretax profit for the first six months of the year of 1.27 billion pounds ($1.64 billion) compared with GBP3.01 billion for the same period a year earlier. Pretax profit for the second quarter was GBP359 million, down from GBP1.53 billion for the same quarter of 2019. This compares with estimates of GBP491 million, according to the bank's own compilation of consensus. The FTSE-100 lender had a credit impairment charge of GBP3.74 billion after booking a further GBP1.62 billion in the second quarter. The bank had credit impairment charges of GBP928 million for the first half of the previous year. Net profit for the first half fell to GBP695 million from GBP2.07 billion. Net profit for the second quarter was GBP90 million, down from GBP1.03 billion for the second quarter of 2019 and compared with an expected GBP180 million, according to Barclays's compilation of consensus for the period. Total income for the first half grew to GBP11.62 billion from GBP10.79 billion. Total income for the second quarter was GBP5.34 billion, down from GBP5.54 billion for the second quarter of 2019. This compares with the bank's compilation of consensus of GBP180 million, which expected a total income of GBP5.27 billion. Barclays's corporate-and-investment bank generated a 31% rise in total income of GBP6.93 billion \"driven by a standout performance in markets,\" the bank said. The bank ended the period with a common equity Tier 1 ratio--a key measure of balance-sheet strength--of 14.2%, up from 13.8% as at Dec. 31, 2019. Write to Sabela Ojea at sabela.ojea@wsj.com; @sabelaojeaguix"}]}