{"article": [{"url": "https://www.marketwatch.com/story/weekend-reads-best-new-money-ideas-2020-10-09", "published": 1602245120.0, "headline": "Weekend reads: Best new money ideas", "body": "MarketWatch’s third annual Best New Ideas in Money series explores innovative thinking with the potential to change how we live, work, spend, save and invest. Given all the upheaval of 2020, new thinking and action may be needed to repair the economy and the world. Here are five examples. 1. Babies and ‘baby bonds’ Alessandra Malito presents a retirement system proposal that would replace Social Security and be designed to cover a population with a much longer life expectancy. 2. Alternatives to nursing homes Nursing-home care has been a financial disaster for years. But the coronavirus crisis made it dangerous. Meera Jagannathan explains how different types of care can be safer and more cost effective. 3. Preparing for economic crises Timothy Meyer, the director of international legal studies at Vanderbilt University Law School, suggests a change to the federal government to smooth out responses to economic calamities. 4. A more effective way for charities to do good A traditional charitable foundation is designed to last forever. But spend-down philanthropy might be much more effective for solving targeted problems, as Leslie Albrecht explains. 5. An affordable way to make college education free Remote learning during a time of social distancing points the way to lower-cost or even free college education, according to Jillian Berman. Universal/Courtesy Everett Collection Harvard’s painful lesson for investors Harvard University has a $42 billion endowment fund. It hasn’t beaten the S&P 500 SPX, +0.87% for 12 straight years. Its performance offers important lessons for all investors.Vaccine hopes Jaimy Lee interviews Moncef Slaoui, who heads the Trump administration’s effort to speed coronavirus vaccines through the approval process. Slaoui expects 80% to 90% efficacy for early vaccines. Related:Can your employer require you to take a COVID-19 vaccine?How to help women who were pushed out of the workforce by COVID-19 The coronavirus economy has been very hard on female employees. Here’s what it will take them to get back into the workforce.Tax deductions for the self-employed Tax time will be here sooner than you think, and this may be one area where the dreadful coronavirus economy can work to your advantage. It’s not a simple subject, but Bill Bischoff breaks down the rules, including an important “correction” made this year. MarketWatch photo illustration/iStockphoto Help me retire A primer on the ins and outs of getting the most from Social Security: I’m 63, my husband is 70, we’ll have $90,000 a year in retirement — how can we claim our Social Security benefits?Banks may be a bright spot this earnings season JPMorgan Chase JPM, -0.57% and Citigroup C, +0.47% will lead third-quarter earnings season for the largest U.S. banks on Oct. 13. The banks were looking ahead and preparing for loan losses the previous two quarters, so investors may be seeing plenty of good news this time around.A better college-application strategy Applying to selective colleges can be quite an adventure for students and their families. Jeffrey Selingo explains how to spot the schools that are more likely to give you merit-based financial aid. MarketWatch How to prepare for a nasty divorce “Prepare now, confront later,” writes Quentin Fottrell, MarketWatch’s Moneyist.Can we get back to politics? Your cheat sheet on the 15 key Senate races that could decide which party has control."}]}