{"article": [{"url": "https://www.marketwatch.com/story/trump-is-right-many-401k-plans-are-benefiting-from-a-recovering-stock-market-but-that-doesnt-mean-americans-are-in-good-financial-shape-2020-10-01", "published": 1601718200.0, "headline": "Trump is right â\u0080\u0094 many 401(k) plans are benefiting from a recovering stock market â\u0080\u0094 but that isnâ\u0080\u0099t the whole story", "body": "President Donald Trump often touts how well the economy is recovering, even in the midst of a pandemic, and he mentioned it again â\u0080\u0094 as well as how that benefits Americansâ\u0080\u0099 401(k) plans â\u0080\u0094 during the presidential debate against Democratic nominee Joe Biden on Tuesday. â\u0080\u009cWhen the stock market goes up, that means jobs,â\u0080\u009d the president said during the debate. â\u0080\u009cIt also means 401(k)s.â\u0080\u009d The two candidates were in the middle of a heated argument over whether or not the economy was doing well when Trump replaced President Obama in office. The stock market is recovering from extreme volatility in March, when much of the country was shut down in response to the coronavirus crisis. The market was always expected to recover, though it did so sooner than some experts anticipated. That rise typically benefits 401(k) plans and other retirement investment accounts, depending on what investments are held. Does this mean Americans want to thank Trump? Yes and no, according to a September Bankrate survey. Slightly more than a quarter of respondents said their financial situations improved since Trump took office, while 40% said theyâ\u0080\u0099re in the same financial shape as they were before January 2017, and another quarter said their situations have gotten worse. Not all Americans have 401(k) plans. Many employers, especially smaller businesses, do not offer these types of retirement plans to their employees because of complexity or cost. And even when they do, some workers donâ\u0080\u0099t participate in them because they canâ\u0080\u0099t afford to or they may not know about these benefits. Only about a third of Americans were invested in a 401(k) plan in 2017, according to U.S. Census Bureau data. Still, Americans werenâ\u0080\u0099t sure if either candidate would help their personal finances. Almost four in 10 people (39%) said a Joe Biden/Kamala Harris ticket would be better for their finances, and 35% said a Donald Trump/Mike Pence combination would do the trick. Another 15% said they werenâ\u0080\u0099t sure who would be best for their money and 11% said neither. The younger the voter, the more likely they are to be undecided, the survey found. â\u0080\u009cAmericansâ\u0080\u0099 view of their own individual finances is much more complex than to be singularly focused on the performance of the stock market,â\u0080\u009d said Mark Hamrick, senior economic analyst at Bankrate. With the economy recovering, people who continued to contribute to their portfolios, or stayed with their investment strategies, are in â\u0080\u009cgood or better shape with the 401(k) balance versus pre-pandemic,â\u0080\u009d said Stuart Robertson, chief executive officer of ShareBuilder 401(k), which sells and manages businessesâ\u0080\u0099 retirement plans. But not everyone will experience that boost. Millions of Americans lost their jobs, which would affect if and how they contribute to a retirement plan, and others saw a reduction in wages, potentially halting any contributions they could afford. â\u0080\u009cMany businesses and jobs have been impacted, so some have lost the ability to contribute to their 401(k) due to job loss,â\u0080\u009d he said. The crisis wonâ\u0080\u0099t deter every American from retiring â\u0080\u0094 even with so much volatility this spring, retirement savers showed they were disciplined with their investment strategies, according to Fidelity Investments data. The success of the stock market doesnâ\u0080\u0099t affect 401(k) plans equally. Some portfolios may be heavily invested in assets tied to the marketâ\u0080\u0099s performance, such as an index fund that tracks the overall market, Hamrick said. There are so many underlying variables that impact a balanceâ\u0080\u0099s rise or decline, including which asset classes theyâ\u0080\u0099re invested in, the percentage of their portfolio is invested in those assets and interest rates. When a person chooses to retire also affects how crucial the volatility is to an individualâ\u0080\u0099s current financial situation. Someone retiring in three or four decades will see years of market ups and downs before they need the money in their portfolios, while someone retiring in the next few years would be more sensitive to major market movement. Still, the stock market recovery and rising 401(k) balances as a result, are common talking points of the presidentâ\u0080\u0099s. During the summer, Trump said with a different president, 401(k) plans would â\u0080\u009cdrop down to nothing.â\u0080\u009d"}]}