{"article": [{"url": "https://www.marketwatch.com/story/how-grim-is-the-outlook-for-aging-in-america-2020-06-24", "published": 1593010760.0, "headline": "How grim is the outlook for aging in America?", "body": "This article is reprinted by permission from NextAvenue.org. What does the future of aging in America look like? For answers, every year we ask some of our newest Influencers in Aging to offer their views at the American Society on Aging’s Aging in America conference. The pandemic turned this year’s in-person panel into a June 11 webinar, and the Influencers’ forecasts — as well as their laments — couldn’t have been timelier. “I want to acknowledge that we as a country have had a few rough months and weeks. We are living and dying in at least two pandemics: COVID-19 and racism,” said panelist Imani Woody, named an Influencer in Aging for her work to create Mary’s House, an independent living community for LGBTQ older adults in Washington, D.C.The influencers in aging webinar panelists The two pandemics shaped Woody’s webinar comments as well as those of the two other panelists: Ron Long, head of Wells Fargo’s Aging Client Services Center of Excellence and an authority on elder financial abuse, and Larry Curley, executive director of the National Indian Council on Aging, a nonprofit advocating for the health, social services and economic well-being of American Indian and Alaska Native Elders. “I really believe that what’s been happening in this country, especially in the era of COVID-19, is that we’ve gotten to a point where I feel as if elders have been a dispensable product; that it’s OK that they’re collateral damage. And that concerns me,” said Curley. “When we start devaluing elder people, we have a very serious problem in our country, and we need to address it.” Also read: The coronavirus recession is destroying millennials’ retirement dreams and they need to act now And, Long noted, “We are all in this boat together and all of us have to make sure we’re not leaving anyone behind.” “Here, here!” Woody responded. I hosted the one-hour webinar and asked each panelist to talk about: what concerns them about aging in America, what they’re most optimistic about and where they think the future of aging in America is heading. You can read highlights below and watch the free webinar on the American Society of Aging’s webcast site. One more thing before getting to what the panelists said: Next Avenue just opened nominations for our 2020 Influencers in Aging. Please send us yours soon at our site’s Influencers in Aging nomination submission page. Highlights from the webinar:What concerns us about aging in America Ron Long: “There is a lack of coordination among [government] agencies, financial firms, regulators, nonprofits and other third parties as we try to take on this important mission of elder financial abuse prevention and protection…We could have a centralized portal where no matter where you are, if you see a victim of elder abuse, you send it in and within seconds that portal should be able to send a full report to the adult protection agency that can help that elder get through that situation and to law enforcement if that’s critical. Also see: COVID-19 will force older workers into early retirement “I’m also concerned about isolation and social disconnection in coordination with many cases of elder abuse…When folks are isolated, it makes it easier for scammers to work on them….I fully anticipate that as we start going back and visiting our parents more [as the pandemic lessens], we will learn about more elder abuse cases that have occurred during COVID lockdowns.” Larry Curley: “COVID-19 has had a major, major impact on Indian Country, with what it has done and services that have been disrupted for elderly people, who are having a difficult time dealing with it. The coronavirus infection rate on reservations has equaled those of New York and New Jersey. In Arizona, Indians comprise 6% of the population, yet they represent 16% of the fatalities from COVID-19. “Funding has always been low for the Indian Health Service, the primary health provider for Indian people…The funding level has been a challenging endeavor in light of COVID-19. Moreover, there are only eight nursing homes on Indian reservations with a total bed capacity of just over eight hundred….And one in three Indian Country elders are diagnosed with Alzheimer’s and dementia.” Imani Woody: “It’s hard to be old and gay at the same time. Many old LGBTQ SGL [Same Gender Loving] people are finding it insurmountable and are going back into the closet. These times of COVID-19 make it definitely worrisome…LGBTQ people of color and elders can be particularly marginalized. “I don’t want to be in the position where a 30-year-old and I need to use a ventilator. The decision makers may think I’ve already led a full life. Yes, the ageism and disregard for old people generally is fierce.”What we’re most optimistic about and want to see Ron Long: “We are aging well and living longer. Some say that with better science and medical innovations, we will live longer and healthier so that you can be playing tennis at 95 — singles, not doubles….It will be absolutely critical to be able to financially support those longer lives.” Read: For older workers, there are risks if they return to the office—and if they don’t Larry Curley: “There is room for optimism and hope in Indian Country. One of the things I see is an increase in the growth of intergenerational programs that preserve the language, customs and traditions of Native Americans…The younger population is looking to the elders — our living encyclopedias who hold the history of Indians in their minds and hearts.” Imani Woody: “We can create aging communities and social service environments that are visibly welcome and inclusive. We can continue to develop programs that specifically address the needs of lesbian, gay, bisexual, transgender, queer and same-gender loving people, particularly LGBTQ people of color.” “We can produce materials that celebrate the lives of older, LGBTQ SGL elders. We can dismantle institutional levels of racism, ageism, heterosexism and classism.”Where the future of aging in America is heading Ron Long: “I would like us to do [in the U.S.] what they’ve done in England: have a Minister of Loneliness….That can start us on the path to look at the right solutions.” Larry Curley: “Increasing numbers of tribal governments see the value of elders and have begun to move forward and fund elderly programs far more than ones the federal government is providing.” “With the prevalence of the incidence of Alzheimer’s in Indian Country, where are the caregivers — the people trained to deal with people with Alzheimer’s and dementia?” What I’d like to see nationwide is a much greater emphasis on training more caregivers. That’s something this country needs to respond to, I think.” Imani Woody: “I would like to see a change in our culture in how we treat our elders and how we house our elders. “I’m in my 60s and I’ve been marching awhile…women’s rights, reproductive rights, LGBTQ SGL rights, civil rights for black people, for people of color….[Being older] doesn’t stop you from being politically reactive. Political is the personal. We can all do something.” Richard Eisenberg is the Senior Web Editor of the Money & Security and Work & Purpose channels of Next Avenue and Managing Editor for the site. He is the author of “How to Avoid a Mid-Life Financial Crisis” and has been a personal finance editor at Money, Yahoo, Good Housekeeping, and CBS Moneywatch. Follow him on Twitter. This article is reprinted by permission from NextAvenue.org, © 2020 Twin Cities Public Television, Inc. All rights reserved."}]}