{"article": [{"url": "https://www.marketwatch.com/story/palantir-plans-to-go-public-as-it-moves-away-from-reliance-on-government-work-2020-08-25", "published": 1598431040.0, "headline": "Palantir plans to go public as it moves away from reliance on government work", "body": "Palantir Technologies Inc. has created controversy by selling its data software to militaries and government agencies for years, but it has the private sector to thank for revenue growth that is now expected to bring the company to Wall Street. Palantir filed Tuesday for a direct listing, which allows the company’s shares to be sold on the open market but does not involve the sale of fresh shares like an initial public offering. The approach has grown popular for well-funded, mature startups, being used in recent years by another enterprise-software startup, Slack Technologies Inc. WORK, +3.36% , as well as Spotify Technology SA. SPOT, +0.08% . Palantir became infamous for selling big-data software that helped to surveil citizens and conduct warfare, the type of contracts that employees at Alphabet Inc.’s GOOGL, +1.82% GOOG, +1.97% Google, Amazon.com Inc. AMZN, +3.01% , Microsoft Corp. MSFT, +2.48% and Salesforce.com Inc. CRM, +2.21% have sought to end at their companies. Chief Executive and co-founder Alexander Karp led off the company’s filing with the Securities and Exchange Commission with a letter that defended that business and excoriated Silicon Valley, as he moves the company to Denver from Palo Alto, Calif. Read: Palantir takes swings at Silicon Valley on its way to Wall Street Deeper in the filing, though, Palantir details how it has moved past just working for the government to push its software to sales of three-quarters-of-a-billion dollars last year. The company revealed that a little more than half — 53% — of its customers come from the private sector instead of government, even as Palantir considers different divisions in the same government departments as separate customers. Palantir was co-founded by Karp, Facebook Inc. FB, +0.26% investor and board member Peter Thiel, and Stephen Cohen, who serves as president. The company originally received funding from the Central Intelligence Agency’s In-Q-Tel arm to develop Gotham, its first software platform that launched in 2008 and is built specifically for government uses. “Defense agencies in the United States then began using Gotham to investigate potential threats and to help protect soldiers from improvised explosive devices,” Palantir disclosed in its filing. “Today, the platform is widely used by government agencies in the United States and its allies.” In 2016, Palantir launched a second platform, Foundry, that it has sold to commercial entities; Airbus SE AIR, -0.20% EADSY, -0.25% was used as an example of a private-sector customer in the filing. The growth of Foundry is what moved Palantir’s customer base toward the private sector, though governments can and do use the newer program as well. While the majority of Palantir customers may be commercial businesses, that doesn’t mean the majority of its revenue comes from those contracts. Palantir had only 125 customers in the first half of this year that paid an average of $5.6 million each in 2019, but its largest customers — which Palantir does not name — have a much larger average. “Our top 20 customers, based on our revenue in 2019, generated $495.2 million in revenue, or 67% of our total revenue in that period,” Palantir disclosed in its filing. “From those top 20 customers, we generated an average revenue per customer of $24.8 million during 2019.” Opinion: A tale of two $2 billion Chinese IPOs headed in very different directions Palantir said that it had contracts with government entities for an additional $1.2 billion in business on its books, and an additional $2.6 billion in “indefinite delivery, indefinite quantity” contracts that are not counted because the funding has not yet been determined. “Our partnerships with government agencies in the United States and abroad have had and will continue to have a significant impact on our business,” the company stated. Palantir revealed in its SEC filing that revenue grew to $742.6 million in 2019 from $595.4 million in 2018, while losses stayed even at more than half a billion dollars a year — $579.6 million in 2019 and $580 million in 2018. In the first six months of this year, Palantir recorded a loss of $164.7 million on revenue of $481.2 million, after recording a loss of $280.5 million on sales of $322.7 million in the same period of 2019. While attacking Silicon Valley, Palantir still is retaining some of the DNA of the tech hub, especially in regards to retaining power with its founders after going public, just as Mark Zuckerberg maintains control of Facebook and Sergey Brin and Larry Page still rule over Google. The company created a three-tiered stock structure that gives one vote to publicly available shares, 10 votes to class B insider shares, and “variable” votes to “class F” shares owned by its three co-founders. The collective class F shares will hold up to 49.99% of votes, while other shares owned by the trio will allow them to effectively control the company. The company said that its business has not been materially impacted adversely by the COVID-19 pandemic, and that it may help Palantir’s business. See also: A ‘powerful force’ will determine what happens next in the stock market, Wharton professor predicts “The pandemic has made clear to many customers that accommodating the extended timelines ordinarily required to realize results from implementing new software solutions is not an option during a crisis,” the company disclosed. “As a result, customers are increasingly adopting our software, which can be ready in days, over internal software development efforts, which may take months or years.” Palantir’s class A shares will eventually trade on the New York Stock Exchange under the ticker symbol PLTR. Palantir listed a dozen banks that are acting as financial advisers on the deal, with Morgan Stanley as the main consultant with the designated market maker, which will determine the opening price of the shares. Palantir joins a parade of software companies filing this week to enter the public markets. At least five software companies filed with the SEC on Monday, including Asana Inc., which was co-founded by a Facebook co-founder and will also undergo a direct listing. Snowflake Inc., Unity Software Inc., Sumo Logic and Jfrog Ltd. also filed for IPOs on Monday."}]}