{"article": [{"url": "https://www.marketwatch.com/story/bonds-or-bond-fundswhich-is-better-2020-08-19", "published": 1597850660.0, "headline": "Bonds or bond funds-which is better?", "body": "Which is better to own in a rising-rate environment: Bond mutual funds, or individual bonds? Retirees and soon-to-be retirees have been asking this perennial question with increasing frequency in recent months. That's because they think there is a near certainty that interest rates will be higher in five or 10 years' time. If they're right, of course, bonds purchased today will fall in price. But if those bonds are held until maturity, and assuming their issuers don't default, they will return 100 cents on the dollar-fully recovering any paper loss they incur along the way. That certainly seems like a big advantage that individual bonds have over bond mutual funds. In fact, however, this advantage doesn't really exist. Consider the returns over the next 10 years of two hypothetical bond portfolios: â\u0080¢ A 10-year Treasury purchased today and held until maturity in August 2030 â\u0080¢ A portfolio that each August sells its 10-year note (which now has 9 years left until maturity) and with the proceeds purchases a brand new Treasury with a 10-year maturity. For all intents and purposes, believe it or not, these two portfolios will have an identical return-even if interest rates rise between now and August 2030. Any differences in return, which will be tiny, will be due to transaction costs. To understand how this can be, consider the transaction that this annual-rebalancing portfolio undertakes one year now. For illustration purposes, assume that the 10-year Treasury yield TNX, +1.30% has risen a full percentage point between now and then-from its current 0.69% to 1.69%. The original 10-year note bought today would a year from now trade at 91.7% of par ($917 per $1,000 of face value); that's the price that reflects a yield to maturity (from both interest and capital appreciation) of-you guessed it-1.69% annualized. As a result, by selling the original 10-year note bought today, and buying a brand new one a year from now that yields 1.69%, your subsequent return will be equal to that of simply holding on to that original. As Vanguard puts it in a primer on the subject: \"The fact that an investor is able to get principal back at a specific maturity date adds no economic value compared with a mutual fund that does not have a specific maturity date.\" Cliff Asness, founding principal at AQR Capital Management, is blunter. In an article for the Financial Analysts Journal a few years ago, he wrote that those who think individual bonds are superior than bond funds in a rising-rate environment \"belong in one of Dante's circles at about 3½ (between gluttony and greed).\" Asness continued: \"Bond funds are just portfolios of bonds marked to market every day. How can they be worse than the sum of what they own? The option to hold a bond to maturity and 'get your money back'â\u0080¦is, apparently, greatly valued by many but is in reality valueless. The day interest rates go up, individual bonds fall in value just like the bond fund. By holding the bonds to maturity, you will indeed get your principal back, but in an environment with higher interest rates and inflation, those same nominal dollars will be worth less. The excitement about getting your nominal dollars back eludes me.\" Duration targeting and bond laddering Of course, most retirees who invest in individual bonds own several at once, forming what is known as a ladder. That is, they own a portfolio of bonds of different maturities; when one matures, the proceeds are reinvested in a bond with a long-enough maturity so as to maintain the ladder's average maturity. This approach is also known as duration targeting. Duration targeting and bond laddering are functionally equivalent to a bond mutual fund, of course. So I perhaps set up a false dichotomy at the beginning of this column when I presented the choice as between individual bonds and bond mutual funds. Perhaps the more appropriate question is how to protect our bond investments (whether they be individual bonds or funds) from the ravages of higher interest rates. The answer: Hold on long enough. A bond ladder's long-term return will come very close to its initial yield, even if interest rates rise throughout the holding period. That's because the higher interest rates that the ladder earns when reinvesting maturing bonds make up for losses the other bonds in the ladder incur because of those higher rates. That is the surprising finding of a study that was published in 2015 in the Financial Analysts Journal, entitled \"Bond Ladders and Rolling Yield Convergence.\" Its authors were Martin Leibowitz and Anthony Bova, managing director and executive director at Morgan Stanley, respectively, and Stanley Kogelman, a principal at New York-based investment-advisory firm Advanced Portfolio Management. The authors derived a specific formula for how long you need to hold the ladder in order to have high confidence that your total return will equal the starting yield: One year less than twice its average maturity (a.k.a. duration target). To illustrate, consider the iShares Core U.S. Aggregate Bond ETF AGG, +0.02%, which over the years has had an average duration of around 5.3 years and which has rarely deviated very much from that. (Its current effective duration, according to Morningstar, is 5.5 years.) Employing the formula the study's authors derived, that means that your total return in the fund will come very close to its initial yield provided you hold the fund for 9.6 years. To test the formula, I went back 9.6 years ago, to the beginning of 2011, when the iShares Core U.S. Aggregate Bond ETF yielded 3.91%. Guess what its total return since then has been, according to FactSet: 3.82% annualized. This ETF's current dividend yield is 1.2%. While that's not so high as to make you jump up and down for joy, you can have confidence that, should you hold on for the next decade, your annualized return with the fund will be quite close to this yield-even if interest rates rise markedly between now and 2030. If a fear of rising rates was keeping you out of bonds, you might therefore want to reconsider. Mark Hulbert is a regular contributor to MarketWatch. His Hulbert Ratings tracks investment newsletters that pay a flat fee to be audited. He can be reached at mark@hulbertratings.com."}]}