{"article": [{"url": "https://www.marketwatch.com/story/dow-futures-bounce-around-as-investors-await-powell-mnuchin-testimony-on-the-coronavirus-response-2020-06-30", "published": 1593535460.0, "headline": "Dow books best quarter since 1987 despite warnings from Powell and Mnuchin on economy", "body": "U.S. stock-indexes finished higher Wednesday, as data showed a recovery in consumer confidence and higher home prices, helping to offset ongoing concerns about the rising number of new coronavirus cases in many American states. Both the Dow and S&P 500 index booked their best quarterly performance in more than 20 years, while the Nasdaq Composite had its best quarter since 1999, as the indexes recovered from the lows seen in late March when the coronavirus crisis forced business activity to grind to a halt. The stock market will be closed on Friday in observance of the Fourth of July holiday. How did benchmarks perform? The Dow Jones Industrial Average DJIA, +0.56% gained 217.08, or 0.9%, to settle at 25,812.88, those for the S&P 500 index SPX, +0.87% rose 47.05 points, or 1.5%, to close at 3,100.29, while the Nasdaq Composite Index COMP, +1.39% added 184.61 points, or 1.9%, to end at 10,058.77, its second highest close ever. On Monday, the Dow gained 580.25 points, or 2.3%, its best one-day percentage climb since June 5, according to Dow Jones Market Data. The S&P 500 index advanced 44.19 points, or 1.5%, to finish at 3,053.24. The technology-laden Nasdaq Composite Index picked up 116.93 points, or 1.2%, to end at 9,874.15.What drove the market? Stocks rallied after testimony to Congress by Federal Reserve Chairman Jerome Powell and U.S. Treasury Secretary Steven Mnuchin underscored an ongoing commitment to anchor the U.S. economy through the global public health disaster. Recap: Mnuchin, Powell testify before House panel on coronavirus aid Mnuchin said the Treasury and Fed were looking at extending the Fed’s established 11 emergency lending facilities to include asset-based lending markets, but also reiterated that additional types of COVID-19 aid likely will need to be addressed by Congress under the next phase of stimulus. Powell emphasized that the ‘overriding goal’ of the central bank’s facilities is to help get the roughly 25 million workers who lost jobs during the pandemic back to work, while also warning that a second wave of COVID-19 infections could undermine consumer confidence again. “While this bounce back in economic activity is welcome, it also presents new challenges—notably, the need to keep the virus in check,” Powell said. The hearing was required by the $2 trillion relief package Congress approved in March and came as the global tally for confirmed cases of the coronavirus that causes COVID-19 rose to 10.3 million on Tuesday, according to data aggregated by Johns Hopkins University. Within the U.S., infections have climbed in 35 states over the past 14 days, according to a New York Times tracker, with California, Texas and Florida leading the way. “The government’s inability to restrain public behavior, even through something as simple as ensuring mask compliance, is a dangerous threat to the economy of the U.S.,” said Eric Schiffer, chief executive officer of private-equity firm Patriarch Organization, in Beverly Hills. “It ensures this cycle of viral pain continues longer than it should,” he told MarketWatch. Both New Jersey and New York, states that have been seeing a smaller rise in new cases, have said that they may be forced to delay aspects of their business reopening plans as the virus spreads elsewhere. Earlier New York Fed President John Williams on Tuesday warned that the worst of the early days of the pandemic may be over, but noted that the economy remains damaged, at a virtual talk sponsored by the Institute of International Finance. Powell’s promise on Tuesday to keep doing whatever it takes to support the U.S. economy until it gets back to where it was before the pandemic reverberated beyond the stock market. “Those are pretty strong words and pretty strong actions,” said David Norris, head of U.S. credit at TwentyFour Asset Management, in an interview with MarketWatch. “We know the road ahead is going top be filled with uncertainty, mostly driven by the trajectory of the virus, but we also know we have the support of the Fed.” In a separate hearing Tuesday, public-health expert Dr. Anthony Fauci warned that the U.S. could see 100,00 new coronavirus infections a day in the U.S., unless everyone steps up their game. Speaking at the Senate Health, Education, Labor and Pensions Committee in Washington, D.C., Fauci said many states have reopened too quickly, and people are not abiding by rules of social distancing. In U.S. economic data, the Case-Shiller house price index rose 4% on an annual basis in April. The index of consumer confidence rose to 98.1 this month from a revised 85.9 in May, the Conference Board said Tuesday, though the level of confidence still remains well below pre-crisis levels.Which stocks were in focus? Shares of Lululemon Athletica Inc. LULU, +2.52% gained 6% on news it will acquire at-home fitness company Mirror for $500 million. Shares of Conagra Brands Inc. rose 4.4% on Tuesday after the owner of food brands, including Birds Eye and Healthy Choice, topped earnings estimates for its fiscal fourth quarter thanks to strong demand for at-home dining during the pandemic. FedEx Corp. FDX, +0.18% is slated to report results after the close of trade Tuesday. Wells Fargo shares WFC, fell 0.4% after the bank was one of the few major lenders to announce that it was cutting its dividends after bank stress tests conducted last week. Papa John’s International Inc. PZZA, -1.18% said Tuesday that same-store sales for the five weeks ended June 28 at its North America restaurants rose 24.4% from a year ago, and rose 6.0% internationally, as demand continued to be strong amid the COVID-19 pandemic. Its stock rose 1.3%. Netlfix Inc. NFLX, +1.43% announced Tuesday an effort to grow economic opportunities for Black communities by allocating money to banks and other institutions that help provide financial support. Shares rose 1.7%. Shares of Inovio Pharmaceuticals Inc. INO, -1.36% tumbled 15% Tuesday after the company, without disclosing relevant data, said its COVID-19 vaccine candidate was considered safe and well-tolerated in all 40 of the participants in a Phase 1 clinical trial. Tesla Inc. TSLA, +1.89% shares gained 7% on Tuesday, pushing the Silicon Valley car maker’s valuation just shy of $200 billion, ahead of second-quarter sales numbers expected this week. Shares of Uber Technologies Inc. UBER, -0.18% advanced 4.9% following reports that the ride-hail service is close to a deal to buy privately held Postmates for about $2.6 billion. How did other assets perform? West Texas Intermediate U.S. crude US:CLQ20 for August delivery slipped 43 cents, or 1.1%, to settle at $39.27 a barrel on the New York Mercantile Exchange, leaving oil prices for the year’s first half down nearly 36%. In precious metals, gold futures US:GCQ20 shot up $19.30, or 1.1%, to finish at $1,800.50 an ounce, with the most-active contracts gaining 18% in the first half of 2020. The 10-year Treasury note yield TMUBMUSD10Y, 0.777% was 1.7 basis points higher at 0.653%. Bond prices move inversely to yields. The greenback was down 0.2% against a basket of its major rivals, based on trading in the ICE U.S. Dollar Index DXY, -0.58%. In European equities, the Stoxx Europe 600 index SXXP, +0.55% closed 0.1% higher and London’s FTSE 100 UKX, +0.64% fell 0.9%. In Asian markets, the Japanese Nikkei NIK, -0.11% gained 1.3%, Hong Kong’s Hang Seng HSI, -0.30% picked up 0.5%, while South Korea’s Kospi climbed 0.7%. China’s CSI 300 000300, +2.04% rallied 1.3%, while the Shanghai Composite Index SHCOMP, +1.67% advanced 0.8%."}]}