{"article": [{"url": "https://www.marketwatch.com/story/pelosi-skeptical-of-limiting-new-round-of-virus-checks-to-people-making-less-than-40000-2020-07-09", "published": 1594455140.0, "headline": "Pelosi skeptical of limiting new round of virus checks to people making less than $40,000", "body": "House Speaker Nancy Pelosi said Thursday she was unconvinced of the need to limit eligibility for another round of coronavirus economic aid checks to people making less than $40,000 annually, an idea that’s been broached by a top Republican. Pelosi’s initial stance could complicate matters when negotiations on a new coronavirus aid bill begin in earnest later this month. Both chambers of Congress are empty following the July 4 holiday but lawmakers expect to spend the last two weeks of the month in Washington hammering out a bill. “I think there are many families, depending on the size of the family, so many different things, that $40,000 would have to explained, justified, the rest,” Pelosi said at a weekly news conference at the U.S. Capitol. Now read:Mnuchin says unemployed workers should not get benefits higher than their old wages in next stimulus plan. “I think families making over $40,000 probably need assistance, again, depending on their family situation.” The Washington Post has reported that Senate Majority Leader Mitch McConnell floated the idea of more targeted checks in recent days. Kentucky Republican McConnell said lawmakers would be “acutely aware of that segment of our population” on Wednesday, according to the paper. While Pelosi said she was unaware of where the idea of focusing aid on lower-income eamers had come from, Federal Reserve Chairman Jay Powell noted in May how badly the virus-related lockdown was for such workers. Pelosi has cited Powell’s urging to “think big” for the size of the House Democrats’ proposal for another aid package. “Among people who were working in February, almost 40% of those in households making less than $40,000 a year had lost a job in March,” Powell told the Peterson Institute for International Economics in mid-May. Also see:Top economists say next coronavirus relief bill should be $1.5 trillion at minimum and hopefully larger."}]}