{"article": [{"url": "https://www.marketwatch.com/story/google-searches-for-panic-attack-anxiety-attack-hit-all-time-high-due-to-coronavirus-2020-08-25", "published": 1598541140.0, "headline": "Google searches for 'panic attack,' 'anxiety attack' hit all-time high during coronavirus pandemic", "body": "Keep calm and carry on? That's been easier said than done this year. In fact, the number of Americans who Googled information about panic and anxiety attacks reached a 16-year high this spring, when the novel coronavirus that causes COVID-19 began spreading across the U.S. That's according to a new analysis from the Qualcomm Institute's Center for Data Driven Health at the University of California San Diego, which was published in the Journal of the American Medical Association (JAMA) this week. Researchers tracked how often people looked up phrases including \"panic attack,\" \"anxiety attack,\" \"am I having a panic attack?\", and \"anxiety attack symptoms\" using Google GOOG, +1.97% Trends data, and analyzed how often these phrases were searched for in the U.S. between January 2004 and May 2020. After adjusting for variables such as population growth and increased internet use over the past 20 years, the researchers found that these anxiety and panic attack searches reached an all-time high between mid-March and mid-May. Acute anxiety queries were 11% higher than expected during the 58-day period that began when President Trump declared that COVID-19 was a national emergency on March 13 and ending on May 9, which was the last date of data used in this analysis. What's more, spikes in searches for these anxiety symptoms correlated with key dates early in the pandemic, particularly those related to shutdowns and social distancing guidelines. Searches surged when national social distancing guidelines were first rolled out on March 16, for example. Searches skyrocketed the most overall on March 28, the day before these social distancing guidelines were extended, when anxiety queries were 52% higher than expected. There were also jumps when: the U.S. passed China for the most reported cases of COVID-19 on March 26; the CDC began telling everyone to wear face masks on April 3; and when the U.S. death toll surpassed Italy's death toll on April 11. Anti-anxiety medication prescriptions (which had been in decline between 2015 and 2019) also spiked 34.1% during the week ending March 15, according to Express Scripts, a Cigna-owned CI, -0.82%  pharmacy benefit manager. \"This analysis, showing that many Americans are turning to medications for relief, demonstrates the serious impact COVID-19 may be having on our nation's mental health,\" the report concluded. Read more:Anti-anxiety medication prescriptions have spiked 34% during the coronavirus pandemic Searches for anxiety and panic attack symptoms first began dropping back to normal levels on April 15, and have been returning to more typical levels since then. The researchers suggest this could be because Americans have become more resilient, or adapted to the coronavirus' disruptions on their everyday lives. Or perhaps this is because many people had already received whatever help they could get for their anxiety from searching the internet. A Seattle hospital worker is overcome with emotion after visiting with a patient. Getty Images The pandemic's impact on mental health has been of increasing concern, however. Anxiety disorders were already the most common mental illnesses in the U.S. before the pandemic, affecting 40 million adults (or 18.1% of the population) each year. Signs of an anxiety attack can include chest pain, difficulty breathing, a rapid heart rate, sweating, dizziness, nausea, as well as a feeling of sudden, overwhelming fear. So now this pandemic that has infected at least 5.74 million Americans and killed more than 177,000 - not to mention putting millions more out of work, and disrupting almost every aspect of every day life - is placing unprecedented amounts of stress on an already anxious population. The New York City branch of the National Alliance on Mental Illness saw a 60% increase in calls to its helpline in the last two weeks of March alone (when the JAMA study reported the highest spikes in searches for panic and anxiety attacks). An Axios/Ipsos poll conducted during the same period found that 35% of Americans claimed their mental health had gotten worse during the pandemic, and 43% said their emotional well-being was also worse. Indeed, more than four in 10 Americans said they were feeling lonelier than ever in April. Salesforce CRM, +2.21%  CEO Marc Benioff revealed this week that about one-third of the company's employees had reported experiencing a mental-health issue. And as the country has struggled to flatten the curve of COVID-19 infections, a recent report from the Commonwealth Fund, a nonprofit that supports independent research on health care issues, warns that Americans are suffering more mental health consequences from the pandemic than people in other countries. One-third of American adults surveyed between March and May 2020 reported experiencing stress, anxiety, or great sadness that was difficult to cope with by themselves, which was significantly higher than countries including the United Kingdom, Canada, France and New Zealand, where only a quarter of respondents (or less) said the same. A CDC survey of around 5,400 adults in late June also found that the prevalence of anxiety symptoms was three times higher this summer than it was in the second quarter of 2019, and the prevalence of depression was four times as high. Also alarming: Young adults ages 18 to 24, racial and ethnic minorities, essential workers and unpaid adult care-givers are suffering disproportionately worse mental health outcomes during this time, including increased substance abuse and more thoughts of suicide. Read more:'We can get through this': How to manage your mental health during the coronavirus pandemic There are also a number of ways to cope with anxiety when it arises, such as sticking to a daily routine, getting into a meditation practice to soothe yourself, or excusing yourself to go for a walk or take a few deep breaths. Read here for advice from panic attack sufferers on how they cope with their symptoms in public. Or here are several more tips for getting through the COVID-19 pandemic when you're already struggling with anxiety or mental health issues. If you or someone you know is struggling emotionally or considering hurting themselves, call the National Suicide Prevention Lifeline at 1-800-273-8255, or text the Crisis Text line by texting HOME to 741741 to get help. The National Action Alliance for Suicide Prevention also recommends that those needing emotional support related to COVID-19 should call the Disaster Distress Helpline (800-985-5990), or text TalkWithUs to 66746."}]}