{"article": [{"url": "https://www.marketwatch.com/story/long-term-treasury-yields-inch-lower-after-u-s-reports-1-31-million-increase-in-jobless-claims-11594299014", "published": 1594308620.0, "headline": "10-year Treasury yield plumbs April low after best 30-year bond auction since 2014", "body": "U.S. long-term Treasury yields fell Thursday after investors showed strong demand for a sale of long-term bonds, buoying trading for government debt. What are Treasurys doing? The 10-year Treasury note yield TMUBMUSD10Y, 0.777% fell 4.8 basis point to 0.605%, its lowest since April 24. The 30-year bond yield U.S. 30 Year Treasury Bond tumbled 8.3 basis points to 1.308%, its lowest since May 14. Both long-dated maturities scored their biggest daily declines in nearly a month. The 2-year note yield TMUBMUSD02Y, 0.156% edged 0.6 basis point down to 0.149%. Bond prices move inversely to yields. What’s driving Treasurys? Investors took down the last auction of the week, with the Treasury Department selling $19 billion of 30-year bonds. The auction stopped through by 2.6 basis points, the most since 2014. A stop-through indicates by how much the highest yield the Treasury sold in the auction falls below the highest yield expected when the auction began – the “when issued” level. Traders suggested some market participants may have used the auction to wind down a bond-market strategy known as a yield-curve steepener, in effect, betting on the spread between short and long-dated yields to widen by placing a short position on long-dated bonds and buying short-dated debt simultaneously. To close out the short position, a trader might buy long-dated bond from the auction where it would cost less to source a large amount of debt at a Treasury auction than, say, buying from another broker-dealer. Another factor supporting bond prices were the continued worries around the unabated spread of the COVID-19 pandemic across the majority of U.S. states, which has weighed on hopes for a swift return to a pre-coronavirus economy. Though, the rate of infections across the U.S. has accelerated, the total tally of deaths has remained depressed. But that showed signs of changing after Florida reporting a record 120 deaths due to the coronavirus on Wednesday. The S&P 500 SPX, +0.87% and Dow Jones Industrial Average DJIA, +0.56% were trading lower, even as the tech-heavy Nasdaq Composite COMP, +1.39% clung to its session gains. In economic data, the number of Americans filing for new jobless claims fell by 99,000 to 1.314 million in the latest weekly period. That came in below MarketWatch-polled consensus of 1.40 million. See: Jobless claims tell us 30 million people are unemployed, but many doubt it’s that bad Here’s what market participants say “These are lower yields than we started at this week. It’s telling you that the bond market is nervous about what’s happening in the general economy and specifically the labor markets. And the economic data is also not taking into account the latest round of shutdowns in two very large economies: Florida and Texas,” said Patrick Leary, chief market strategist at Incapital, in an interview. “It’s always so difficult to handicap the outcome of an auction. But we got a little bit of a clue that there was appetite for duration after the strong results on the 10-year auction,” Michael Lorizio, senior fixed-income trader at Manulife Investment Management, told MarketWatch. Investors will often refer to longer-maturity debt as duration."}]}