{"article": [{"url": "https://www.marketwatch.com/story/is-the-stock-market-more-important-to-the-economy-than-the-600-unemployment-benefit-2020-08-20", "published": 1597998320.0, "headline": "Is the stock market more important to the economy than the $600 unemployment benefit?", "body": "The stock market is not the economy. But it may have more influence on consumer spending than the extraordinary fiscal stimulus program put in place to stem the fallout from the pandemic, one economist notes. “The $600 top-up in unemployment benefits is critical for those getting the funds, but its absence means less to overall retail spending than many opine,” wrote Steve Blitz, chief US economist for TS Lombard, in a note out Monday. “More critical to the revival in retail spending is the recovery in the equity market, a recovery itself owed to the Federal Reserve and the increase in overall employment as the economy reopened.” It’s a slightly provocative stance, but as Blitz noted in an interview with MarketWatch, “The $600 was extraordinarily important to the people who received it. But they’re not the ones driving consumer spending” — and thus, the broader economy. As has been reported, this downturn has hit the most vulnerable Americans hardest. Low-paying jobs in tourism and hospitality have been impacted the most. Meanwhile, the top 20% of income earners are responsible for 80% of consumer spending, Blitz pointed out. How does this all relate to the stock market? It’s not just the well-known “wealth effect” that comes from seeing one’s one portfolio doing well that keeps the economy humming, Blitz noted. More critically, the stock market’s performance is what he calls “a conveyor of confidence.” While that link has been known to the Fed since the 1990s, Blitz argues that it really came into sharper focus after the 2008 financial crisis. Retail sales and the stock market hit bottom and started their long recoveries at the same time — March 2009 — even as the jobless rate remained elevated for much longer, as shown in the chart above. A similar pattern is playing out now, he noted in his analysis. “As for unemployment and retail sales, spending is now above pre-virus nominal levels despite initial unemployment claims remaining well above normal recessionary levels.” Meanwhile, stocks keep setting fresh highs. Of course, while it’s important to understand what’s driving the broad macro economy, it’s also critical not to lose sight of the individuals behind the numbers. As Blitz acknowledged, no matter what the stock market is saying about the economy, many millions of Americans care far more about income that pays the rent and puts food on the table. Related: ‘The stock market no longer thinks it needs the economy if it has the Fed,’ David Rosenberg says And anyone in need of a government transfer payment right now is more likely not to personally benefit from rising asset valuations. Approximately half of all American households have some exposure to the stock market, but they are more likely to be richer, older, and white: 61% of white households have stock holdings, compared to 31% of Black and 28% of Hispanic households, according to a Pew Research Center analysis. That’s one reason the Fed took a lot of criticism for boosting asset values in the wake of the Great Recession. And it’s why monetary policymakers keep repeating their calls for more fiscal support for the economy, Blitz believes. “The Fed needs to display sensitivity to all parts of the economy,” he said. And while many people believe the central bank may be at its limit in terms of what it can accomplish, Blitz thinks policymakers learned their lesson from the last cycle and won’t just throw stimulus at the economy, but leave it in place as long as necessary to lift all boats. “They’ve always started to remove accommodation as the economy closes toward its potential,” Blitz said. “Now everyone realizes you’re beginning to tighten just when you get to the point in the cycle where more vulnerable workers begin to get hired. That will be the change this cycle. By waiting longer before removing, you give more time for lower-skilled workers to get employed.” Read next: The financial and housing market rescue left many Americans behind"}]}