{"article": [{"url": "https://www.marketwatch.com/story/its-not-just-double-duty-its-triple-duty-student-parents-prepare-to-juggle-college-work-and-childcare-this-fall-11596548732", "published": 1596614120.0, "headline": "'It's not just double duty, it's triple duty': Student-parents prepare to juggle college, work and childcare this fall", "body": "Colleges students with children are preparing to work triple duty this fall. Courtney Hale/Getty Images, courtesy of the Seldin/Haring-Smith Foundation Syeedah White is used to juggling. Even in the days before many parents were forced to balance taking conference calls from home with overseeing their children's schooling, her schedule was packed. The 21-year-old would wake up at around 6 a.m. to get her five-year-old daughter ready for school, drop her off at 7:45 a.m. and then head to Bowie State University in Bowie, Maryland, where she's a student, majoring in psychology. After attending classes until 1:30 or 2 p.m., White would head to her retail job, where she'd work until about 9:30 p.m. \"I would save time for homework on my days off,\" she said. \"The only leisure time I had would be on campus in between classes.\" Syeedah White attends college at Bowie State University. She's also mom to a five-year-old. Striking a balance between taking care of her daughter, attending school and working has become even more complicated for White over the past few months - and that's likely to continue. In the spring, she had to step back from a leadership position at her job so she'd have time to help her daughter with remote assignments. As the fall looms with her daughter's education continuing online, White is planning on taking a break from work at least for a month or so. \"There's just going to be too many things going on as far as me having my own classes and my daughter starting kindergarten on the computer,\" she said.  At the nexus of K-12 and college challenges White is one of millions of student-parents who will be coping this fall with schooling that is less than ideal for both themselves and their children as the coronavirus pandemic rages on. All parents are facing childcare challenges amid announcements from major school systems that classes will be mostly remote. At the same time, college students across the country are preparing for an experience that is at best, different from what they expected, and at worst, could severely disrupt their progress towards a degree. But the nation's 3.8 million student-parents - who make up about 22% of today's undergraduate college students - sit at the nexus of both these trends. The pandemic and all of its health, financial and logistical challenges are amplifying the obstacles to earning a degree that student-parents face under normal circumstances, experts say. Roughly 37% of student-parents who enrolled in college for the first time between 2012 and 2017 earned a degree or certificate within six years, compared with 59% of students without children who earned their credential during that period, according to an analysis by the Institute for Women's Policy Research, a Washington, D.C.-based think tank \"For student-parents, many of whom work, it's not just double duty, it's triple duty now,\" said Lindsey Reichlin Cruse, study director at IWPR.    Nicole Lynn Lewis knows about the challenges student-parents face first-hand. Lewis attended and graduated from college in the early 2000s while raising her young daughter. In 2010, she founded Generation Hope, a nonprofit organization that offers student-parents in the Washington, D.C. area financial assistance, mentoring, and other resources that weren't available to Lewis when she was a college student. Those efforts have continued during the pandemic, and in some cases, resources the organization already provides, like mental health counseling, have become even more critical, Lewis said. But there are some things that are out of her organization's and students' control. \"There's frustration around not knowing what institutions' plans are for the fall, or those plans constantly changing,\" she said. \"As parents, you have to plan and be able to set up whatever child care you can plan right now.\" Add to that the situation in the K-12 school system and student-parents are \"worried about demands to be in a college classroom when your children aren't going to be in class,\" she said. Generation Hope is one of many organizations pushing colleges and policymakers to do more to meet the needs of student-parents - efforts that are particularly important in light of the pandemic, when employment and childcare are so uncertain. Meeting the needs of student-parents In the past, these organizations have advocated for increasing government funding for campus child care centers. They've also pushed for changes at the school level. Creating spaces in libraries where students can bring their children and reminding professors that a sick child at home may explain a late assignment are just some of the ways colleges can support their student-parents, said Abigail Seldin, the chief executive officer of the Seldin/Haring-Smith Foundation. Her organization funds and organizes public interest projects to create social and economic change for what SHSF describes as the new college majority: students with children, students with debt, students who have left college without a degree and students struggling with basic needs. \"The greatest need that I see for student-parents is additional resources,\" Seldin said. \"The best thing a school can do is to make it clear to student-parents that there is financial assistance available.\" Seldin's organization launched a tool earlier this year, called SwiftStudent, that students can use to populate letters to send to their schools appealing for changes to their financial aid packages. One of the templates available allows parents to ask for funds to cover child care expenses. Under typical circumstances financing can be a challenge for student parents, given that they're not just providing for themselves during college, they're supporting their children too. Among student-parents who were enrolled in college during the 2015 to 2016 academic year, median undergraduate debt was $6,500 compared to $2,500 for students without children, according to IWPR.  \"This population is incredibly vulnerable to bottoming out financially and not being able to return to school,\" said Anne Hofmann, who is the chair of the English department at Frederick Community College and co-founded Parents Lead, an organization that works with student-parents at the school. \"Tuition might be the first thing that goes if you're strapped.\" Getting student-parents to and through college is not only important for the parents themselves, but for the economy and workforce more broadly, experts say. In Maryland, where White lives and where Frederick Community College is located, single mothers who graduate with an associate's degree save the state $24,971 in public assistance spending over their lifetime, according to an analysis by IWPR. These graduates also earn $249,545 more over their lifetimes and contribute $80,558 more in taxes than single mothers with a high school diploma. 'I didn't see how I could pour more out of an empty cup' The new pandemic reality pushed Joanne Mateo to drop a class this summer for the first time since she started school in the fall of 2018. \"I just wanted to keep the ball rolling because I had been doing such a phenomenal job,\" said Mateo , who is pursuing an associate's degree in elementary and special education at FCC. \"Then COVID happened and it was out of our control.\" Mateo had hoped and planned for years to attend college, but she couldn't make it work until she had a partner who provided the support she needed to balance school, parenting and her job at a local childcare center. During the pandemic she's prioritized the safety, well-being, and education of her children, who are 12 and two-years old - responsibilities that didn't balance well with the requirements of a summer Biology II course. \"I didn't see how I could pour more out of an empty cup,\" she said. Joanne Matteo, her two daughters and her fiancée. As the fall semester approaches, Mateo said she's conflicted about all the juggling she'll need to do. She plans to enroll in courses, but she's still not sure exactly what that's going to look like with a toddler at home and another daughter starting middle school online. \"When there's academic demands on her and there's seventh grade and things may seem harder, how much time am I going to have to help her with homework, do my homework, take a shower, make dinner and make sure everyone eats?\" Mateo said."}]}