{"article": [{"url": "https://www.marketwatch.com/story/china-threatens-retaliation-after-us-slaps-sanctions-on-11-companies-over-human-rights-abuses-2020-07-21", "published": 1595374160.0, "headline": "China threatens retaliation after U.S. slaps sanctions on 11 companies over human rights abuses", "body": "BEIJING — China said Tuesday it would take unspecified “necessary measures” after the U.S. government imposed trade sanctions on 11 companies it says are implicated in human rights abuses in China’s Muslim northwestern region of Xinjiang. The sanctions add to U.S. pressure on Beijing over Xinjiang, where the ruling Communist Party is accused of mass detentions, forced labor, forced birth control and other abuses against Muslim minorities. Xinjiang is among a series of conflicts including human rights, trade and technology that have caused U.S.-Chinese relations to plunge to their lowest level in decades. The Trump administration also has imposed sanctions on four Chinese officials over the accusations. Beijing responded by announcing unspecified penalties on four U.S. senators who are critics of its human rights record. Three of the companies cited Monday were identified by investigations by The Associated Press in 2018 and 2020 as being implicated in forced labor. One company, Nanchang O-Film Tech, supplies screens and lenses to Apple AAPL, +1.74% , Samsung 005930, -0.33% and other technology companies. AP reporters found employees from Xinjiang at its factory in the southern city of Nanchang weren’t allowed out unaccompanied and were required to attend political classes. U.S. customs authorities seized a shipment from the second company, Hetian Haolin Hair Accessories, on suspicion it was made by forced labor. People who worked for the third, Hetian Taida, which produces sportswear sold to U.S. universities and sports teams, told AP detainees were compelled to work there. The Department of Commerce said the addition of the 11 companies to its Entity List will limit their access to U.S. goods and technology. It gave no details of what goods might be affected. “This action will ensure that our goods and technologies are not used in the Chinese Communist Party’s despicable offensive against defenseless Muslim minority populations,” said Commerce Secretary Wilbur Ross in a statement. The Chinese foreign ministry rejected the sanctions as interference in its affairs and an attempt by Washington to hurt Chinese companies. “What the United States is concerned about is not the human rights issues at all, but to suppress Chinese companies, undermine the stability of Xinjiang, and smear China’s Xinjiang policies,” said spokesperson Wang Wenbin. “We urge the United States to correct its mistakes, revoke relevant decisions and stop interfering in China’s internal affairs.” Wang said Beijing will “take all necessary measures” to protect Chinese businesses, but gave no indication of possible retaliation. China has detained an estimated 1 million or more members of the Uighur and other Muslim ethnic minority groups in internment camps. The government describes them as vocational training facilities aimed at countering Muslim radicalism and separatist tendencies. It says those facilities have since been closed, a claim that is impossible to confirm given the restrictions on visits and reporting about the region. Veterans of the camps and family members say those held are forced, often with the threat of violence, to denounce their religion, culture and language and swear loyalty to Communist Party leader and head of state Xi Jinping. The companies cited Monday include clothing manufacturers and technology suppliers. Two companies cited, Xinjiang Silk Road BGI and Beijing Liuhe BGI, are subsidiaries of BGI Group, one of the world’s biggest gene-sequencing companies. The Commerce Department said they were “conducting genetic analyses used to further the repression” of Muslim minorities. In a statement, BGI Group said it provides no gene technology for surveillance of Uighurs. The company said Beijing Liuhe BGI provides gene synthesis services for scientific research. It said Xinjiang Silk Road BGI has conducted no business since being established in November 2016. “BGI Group does not engage in unethical practices and does not provide gene technology for the surveillance of Uighurs,” the company said. “BGI Group does not condone and would never be involved in any human-rights abuses.” Human rights groups say security forces in Xinjiang appear to be creating a genetic database with samples from millions of people including through using blood and other samples subjects are compelled to provide. Nationwide, authorities have gathered genetic information from the Chinese public for almost two decades that the government says is for use in law enforcement. Phone calls to BGI’s public relations and investor relations departments weren’t answered. The Commerce Department imposed similar restrictions last October and in June on a total of 37 companies it said were “engaged in or enabling” abuses in Xinjiang. The department issued a warning on July 1 that companies that handle goods made by forced labor or that supply technology that might be used in labor camps or for surveillance might face unspecified “reputational, economic and legal risks.” The Chinese foreign ministry criticized the warning, saying Beijing would take “necessary measures” to protect Chinese companies but giving no details."}]}