{"article": [{"url": "https://www.marketwatch.com/story/more-cuts-to-401k-matches-are-coming-2020-04-16", "published": 1596713660.0, "headline": "More cuts to 401(k) matches are coming", "body": "To conserve cash, some employers are suspending contributions to their workers’ 401(k) accounts. And if this downturn plays out like previous recessions, more will follow. The handful of employers announcing suspensions in recent weeks include travel companies and retailers hit first and hardest by shrinking consumer demand, including Amtrak, Marriott Vacations Worldwide MAR, -0.96%, the travel company Sabre, Macy’s M, -0.95%, Bassett Furniture Industries BSET, -1.07%, Haverty Furniture Cos HVT, -0.24%, and La-Z-Boy LZB, -0.35%. Tenet Healthcare THC, +0.74% and a physician practice in Boston on the front lines of providing expensive coronavirus care have also suspended their matches. Employees, not surprisingly, are unhappy with these moves. An emergency room doctor told the Boston Globe that his organization’s decision comes as he is “working huge extra hours trying to scrape together [personal protective equipment] and otherwise brace for COVID-19.” Read: Congress has doubled the amount you can borrow from your 401(k) — but there’s a hidden danger Employers are required to give their workers a 30-day notice and cannot stop the match prior to the 30-day period. Suspending matching contributions has become somewhat of a recession tradition. In the months following the September 2008 market crash, more than 200 major companies rushed to do so, according to the Center for Retirement Research. The firms’ primary financial motivation was easing an immediate cash-flow constraint — not a concern about profits — the researchers found. But cutting 401(k) contributions may be a small price to pay for mitigating layoffs, said Megan Gorman, a managing partner with Chequers Financial Management in San Francisco. “It might be a stopgap to help save the business in the long run,” she said. A typical employer matches 50% of employee contributions up to 6% of their salaries. Read: Many Americans are underprepared for retirement — and that was before the coronavirus pandemic Amy Reynolds, a partner at Mercer Consulting, said the bigger danger for workers’ future retirement security is tapping their 401(k)s to pay their routine expenses in a tough economy. As part of the rescue package Congress passed in March, workers can withdraw up to $100,000 without paying the 10% penalty usually imposed on 401(k) withdrawals by people under 59½. “We want them to be thoughtful and consider other sources before they get to that,” Reynolds said. She said matching contribution suspensions are often temporary and are reinstated as things get back to normal. That’s what happened in 2010, when companies slowly restored all or part of their contributions as the economy recovered. Employers use 401(k) matches to hire and retain talented employees, and Reynolds noted that suspending contributions isn’t something they want to do. One thing distinguishing this economic downturn from previous recessions, she said, is that some companies are sharing the pain by cutting top executives’ compensation at the same time. Marriott Vacations announced it would cut executive salaries by 50%, and Sabre is reducing its CEO’s base pay by 25%. “We are seeing this go-around trying to minimize the layoffs as much as possible and executives allowing themselves to be impacted more,” Reynolds said. This column originally appeared on Squared Away, a blog covering financial behavior, psychology and the U.S. money culture. It was published with permission. Kimberly Blanton is a veteran financial and economics reporter. She is the lead writer of Squared Away, which is supported by the Center for Retirement Research at Boston College. Follow Squared Away on Twitter @SquaredAwayBC. ."}]}