{"article": [{"url": "https://www.marketwatch.com/story/women-and-credit-in-the-80s-women-gained-career-options-and-financial-clout-2020-08-04", "published": 1596815420.0, "headline": "Women and credit: In the â\u0080\u009980s, women gained career options and financial clout", "body": "This article is reprinted by permission from NerdWallet. This series examines the financial progress made by women in the U.S. since the Equal Credit Opportunity Act was passed in 1974. In this installment: the 1980s, the decade when Congress officially declared March as Womenâ\u0080\u0099s History Month.Â Strides in continued education While college was largely a boysâ\u0080\u0099 club in the early 20thÂ century, women turned that around during the 1980s. Beginning in the â\u0080\u009980s, more than half of bachelorâ\u0080\u0099s degrees were awarded to women, according to theÂ National Center for Education Statistics. Women also made up about half of graduates from masterâ\u0080\u0099s programs and nearly 30% of graduates with doctorates for the 1980-1981 school year, though these degrees were disproportionately awarded to white women. As women became more educated, theirÂ salaries began to increase in relation to menâ\u0080\u0099s salaries. The income gap wasnâ\u0080\u0099t closed during this time â\u0080\u0094Â it remains today â\u0080\u0094Â but it began shrinking as women attained more high-paying professional and managerial positions. The influenceÂ of the Equal Credit Opportunity Act of 1974Â â\u0080\u0094Â which allowed women toÂ get a credit cardÂ separate from their husbandsÂ and ushered in a new level of financial freedomÂ â\u0080\u0094Â continued to increase. Women now had more career options and more financial clout. Also on MarketWatch: What does retirement mean for women? Itâ\u0080\u0099s important to note that the wage gap between women of different races existed in the â\u0080\u009980s and still exists today. In 1989, white women working full time made a median weekly wage of $334, while Black women made $301 and Latina women made $269. According to the most recent data â\u0080\u0094 from 2018 â\u0080\u0094 while white womenâ\u0080\u0099s median weekly wage was $817 and Asian women made $937, Black women had a median wage of $654 and Latina women made $617 a week. More from this series: In the 1970s, the Equal Credit Opportunity Act became lawâ\u0080\u0094 a key step in financial freedom for women In the 1990s, women made strides in politics, and pop culture rewrites what it means to be a girl In the 2000s, the fight against pay discrimination continues In the 2010s, the Credit Card Act is amended and more women are breadwinners Advances in political power Women in the â\u0080\u009980s madeÂ huge strides in politics. Sandra Day Oâ\u0080\u0099Connor became the first woman nominated to the Supreme Court in 1981.Â Geraldine Ferraro was the first female vice presidential candidate for a major party in 1984.Â EMILYâ\u0080\u0099s ListÂ was founded in 1985 to help fund campaigns for Democratic women who supported abortion rights. Since it was started 35 years ago, EMILYâ\u0080\u0099s List has helped nearly 1,300 women get elected to federal, state and local offices.Pop culture Television in the 1980s showcased women in the workplace supporting their families and themselves, while speaking out for womenâ\u0080\u0099s rights and equality. TwoÂ TVÂ shows, â\u0080\u009cFamily Tiesâ\u0080\u009d and â\u0080\u009cThe Cosby Show,â\u0080\u009d werenâ\u0080\u0099t perfectly feminist sitcoms by any means, but they both starred strong, working female leads. Also read: Iâ\u0080\u0099m a 32-year-old stay-at-home mom, and my husband earns $150,000 a year. Will I ever be able to enjoy a retirement? Elyse Keaton on â\u0080\u009cFamily Tiesâ\u0080\u009d was a hippie-turned-work-at-home-mom who raised four children with her husband, Steven, over the course of the show. Both worked full time, Steven in an office, and Elyse at home as an architect. The show made it clear that a woman needs an identity outside of her family and the ability to bring in an income in order to thrive in the modern world. The matriarch of â\u0080\u009cThe Cosby Show,â\u0080\u009d Clair Huxtable â\u0080\u0094 a working mother of five â\u0080\u0094 delivers several pitch-perfect feminist speeches throughout the showâ\u0080\u0099s eight seasons. She calls out the sexism of the men around her, refusing to bite her tongue when faced with chauvinistic attitudes. Clair was in a financial position that meant she arguably didnâ\u0080\u0099t need to work, but she chose to do so anyway. The show highlighted the importance of equality in marriage, with a division of household labor that wasnâ\u0080\u0099t all the responsibility of the wife.More from NerdWallet: Can a Credit Card Company Lower My Credit Limit? Is It OK to Never Have a Credit Card? Todayâ\u0080\u0099s Definition of Financial Adulthood Is More Flexible Than Ever Erin El Issa is a writer at NerdWallet. Email: erin@nerdwallet.com. Twitter: @Erin_El_Issa."}]}