{"article": [{"url": "https://www.marketwatch.com/story/f40a431c-bafa-11ea-b5b2-fa449ce6ea0d-2020-06-30", "published": 1593594620.0, "headline": "FedEx stock soars as online shopping sprees boost companyâ\u0080\u0099s quarterly results", "body": "FedEx Corp. stock rallied after the deliveries and logistics company reported late Tuesday better-than-expected adjusted profit and sales in its fiscal fourth quarter, as the surge in online buying amid the coronavirus pandemic offset higher costs and thinner margins. FedEx FDX, +0.18% reported a loss of $334 million, or $1.28 a share, in the quarter, compared with a loss of $1.97 billion, or $7.56 a share, in the year-ago quarter. Adjusted for one-time items, the company earned $663 million, or $2.53 a share, compared with adjusted earnings of $5.01 a year ago. Sales fell slightly to $17.4 billion from $17.8 billion a year ago. Analysts polled by FactSet had expected FedEx to report adjusted earnings of $1.58 a share on sales of $16.4 billion. The quarter was â\u0080\u009cseverely affectedâ\u0080\u009d by the COVID-19 pandemic, Chief Executive Frederick W. Smith said in a statement. Thanks to â\u0080\u009cherculean effortsâ\u0080\u009d by employees and the companyâ\u0080\u0099s investments in improving capacity and efficiencies, â\u0080\u009cFedEx is well-positioned to support and benefit from the reopening of the global economy,â\u0080\u009d he said. The stock soared 12% in premarket trading on Wednesday, putting them on track to open at the highest price seen during regular-session hours since late February. Commercial volumes were down significantly due to worldwide business closures, but there were surges in residential deliveries for its FedEx Ground business and in transpacific and charter flights for FedEx Express, the company said. FedEx also incurred about $125 million in increased operating costs related to personal protective equipment and medical and safety supplies for its employees, as well as additional security and cleaning services to protect them, it said. Operating results were impacted by increased costs to expand services, among other factors, the company said. The company also took a hit from pandemic-related temporary store closures and declining print revenue at its FedEx Office stores. FedExâ\u0080\u0099s net income includes a tax benefit of $71 million related to a Coronavirus Aid, Relief, and Economic Security Act (CARES Act) provision that allows tax losses to be offset against income from prior years that was taxed at higher rates. The benefit, however, was mostly offset by a non-cash tax expense of $51 million due to a change in deferred tax balances related to foreign operations, the company said. FedEx did not provide an earnings forecast for fiscal 2021, saying that â\u0080\u009cthe timing and pace of an economic recovery are uncertain.â\u0080\u009d The company said it would continue to make adjustments as needed to its operations and remain focused on â\u0080\u009clast mileâ\u0080\u009d delivery improvements. Wall Street has worried that, for both FedEx and competitor United Parcel Service Inc. UPS, +0.27%, Â the loss of higher-margin business-to-business volumes would cancel out the benefits from the boon in higher-cost business-to-consumer deliveries related to online buying sprees. FedEx said last month it was taking a $370 million charge in the quarter, mostly related to falling print revenue and temporary FedEx office and printing-store closures. Shares of FedEx have lost 8% this year, compared with losses of 5% and 10% for the S&P 500 SPX, +0.87% Â and the Dow Jones Industrial Average, respectively DJIA, +0.56% Â ."}]}