{"article": [{"url": "https://www.marketwatch.com/story/amazon-is-making-gains-with-older-consumers-as-more-people-turn-to-e-commerce-during-covid-19-2020-07-31", "published": 1596481760.0, "headline": "Amazon is making gains with older consumers as more people turn to e-commerce during COVID-19", "body": "Amazon.com Inc. has become the go-to shopping site for many consumers during the COVID-19, including an increasing number of older customers, according to SunTrust Robinson Humphrey analysts. Amazon AMZN, +3.01% reported earnings late Thursday that nearly doubled year-over-year to $10.30 per share, with sales up 40% to $88.9 billion. E-commerce rose 47.8% to $45.9 billion in revenue. The company said online grocery sales tripled from 2019. Read:Amazon promised to spend its profit amid pandemic, but ended up with record earnings anyway “We believe contributing to this acceleration was the on boarding of older demographics, who had under indexed to e-commerce pre-pandemic, and are likely to sustain their online spend given the health consequences the virus presents and then through habit post-pandemic,” SunTrust wrote. “As more customers utilize the full breadth of the Prime offering, we believe that allows Amazon to eventually 1) charge more for Prime, and 2) reinvest back into the service on behalf of customers, creating a virtuous cycle that deepens its competitive moat.” SunTrust rates Amazon stock buy with a $3,600 price target, up from $3,400. SunTrust was one of at least 27 analyst groups that raised their price target on Amazon stock, with JMP Securities’ price target reaching $4,075. Amazon stock has gained 70.7% in the year to date. The S&P 500 index SPX, +0.87% is up 2% this year, and the Amplify Online Retail ETF IBUY, +1.39% has rallied 71.4%. “We expect many consumers to remain reticent to return to normal consumption patterns so long as the threat of infection is meaningful,” wrote Wedbush analysts led by Michael Pachter. “Until testing capability, a therapeutic solution and a vaccine are made widely available, we expect demand for Amazon’s product delivery and services to remain elevated.” Wedbush rates Amazon stock outperform with a $3,700 price target, up from $3,500. Chief Financial Officer Brian Olsavsky said Prime members were active throughout the second quarter, streaming entertainment, buying goods and more. Streaming video hours doubled from last year, primarily through Prime Video. See:Target talks Christmas in July with holiday shopping announcement “We’re seeing good pickup in frequency and basket size for new members in Prime as well, certainly not the same as people who have been Prime members for a number of years, but it’s encouraging,” Olsavsky said on the call, according to a FactSet transcript. KeyBanc Capital Markets says growth in online grocery is an “attractive” proposition for retail broadly, and for Amazon specifically. “We think that COVID-19 has accelerated adoption of grocery delivery by two-to-three years, at a minimum,” wrote analysts led by Edward Yruma. “Social distancing within the Whole Foods Market stores and fresh fulfillment centers still remains a bit of a headwind, but we expect efficiency to continue to improve.” KeyBanc rates Amazon stock overweight with a $3,500 price target, up from $3,285. Though Amazon added 175,000 new jobs since March to handle the pandemic-related surge, Daniel Elman, an analyst Nucleus Research, an IT research firm, says the company was prepared even before the spike in demand. Don’t miss:Ann Taylor parent joins other retailers that have recently filed for bankruptcy. Here are a few things they have in common “This is a fair bit of ‘right place at the right time’ as Amazon being the leading online retailer didn’t have to do a whole lot to succeed through this pandemic – aside from revamp distribution chain to meet new safety procedures – when nearly all of its brick-and-mortar competitors were forced closed for months,” he said. “After adjusting to the new influx of orders, Amazon has successfully expanded shipping operations to accommodate the increased traffic – this is critical to its continued success. The online retailer that can consistently deliver products to customers the fastest will win out in the long term.”"}]}