{"article": [{"url": "https://www.marketwatch.com/story/congress-has-a-million-plus-documents-from-big-tech-antitrust-investigation-and-are-ready-to-grill-big-name-ceos-2020-07-25", "published": 1596011240.0, "headline": "Congress has a million-plus documents from Big Tech antitrust investigation, and are ready to grill big-name CEOs", "body": "For more than a year, the federal government has circled Big Tech and its business practices. On Wednesday, members of the House of Representatives will roll out evidence their staffs have found and put pressure directly on some of the most prominent executives in the world. Four of tech’s most prominent chief executives — Sundar Pichai of Google parent Alphabet Inc. GOOGL, +1.82% GOOG, +1.97% , Jeff Bezos of Amazon.com Inc. AMZN, +3.01% , Tim Cook of Apple Inc. AAPL, +1.74% and Mark Zuckerberg of Facebook Inc. FB, +0.26% — are scheduled to answer questions from lawmakers about their business practices and enormous influence over the economy and Americans’ day-to-day life. (The hearing, originally scheduled for Monday, was delayed until Wednesday due to plans for the late Rep. John Lewis to lie in state at the U.S. Capitol.) Appearing via video links, the quartet — whose companies are collectively worth $5 trillion — should expect withering queries and statements from the House Judiciary Antitrust Subcommittee as investigations into their business practices by the Justice Department and Federal Trade Commission deepen. Senior subcommittee aides held a call with members of the media on Thursday and outlined their planned approach. Armed with 1.3 million documents collected from the companies and third-party sources, the subcommittee will be “laser focused” on competition and whether current law can adequately keep their power in check, the aides said. One line of questioning they mentioned will deal with the mountains of personal data collected and used by the companies to build their formidable market share. A report based on the CEOs’ testimony is due later this year — as early as late summer. “Since last June, the Subcommittee has been investigating the dominance of a small number of digital platforms and the adequacy of existing antitrust laws and enforcement. Given the central role these corporations play in the lives of the American people, it is critical that their CEOs are forthcoming. As we have said from the start, their testimony is essential for us to complete this investigation,” House Judiciary Committee Chairman Jerrold Nadler, D-N.Y., and Antitrust Subcommittee Chairman David Cicilline, D-R.I., said in a joint statement on Saturday. Amazon declined comment. Facebook, Apple, and Alphabet did not reply to emails seeking comment. Bezos and his corporate brethren are under the regulatory microscope for the considerable sway they hold over multiple markets, ranging from shopping (via Amazon and Google), entertainment (Apple and Google’s YouTube), news and how-to tutorials (Google search), and socializing (Facebook). The steep ascent of Big Tech, which is fueling a resurgent stock market despite a deepening pandemic, underscores the enduring power of the industry as consumption escalates in a work-from-home economy. Read more: Tech shares fall as U.S. finally admits it is investigating Big Tech for antitrust “It won’t be a condemnation as much as part of an ongoing investigation,” Matt Stoller, research director at the American Economic Liberties Project and author of “Goliath: Hundred Year War between Monopoly Power and Democracy,” told MarketWatch in a phone interview. “The committee members are trying to understand their business models, where their revenue comes from, and how they operate.” Heading into Wednesday’s virtual face-off, all four companies present distinct and different antitrust issues, and each is taking steps to downplay their influence. Last week, Apple issued third-party economic research showing fees it collects from developers are in line with those charged by other digital platforms — a possible preview of Cook’s testimony. The company’s App Store, which hauls in about $15 billion in annual revenue according to analysts, gets a 30% cut of sales and strongly influences how developers market and price apps. Because it is the only app store available on more than 900 million iPhones worldwide, it collects roughly twice the sales as its largest rival, Google Play Store. Apple says it collects a portion of sales from a small percentage of the nearly 2 million apps available in the store, which does not make it a monopolist. Read more: Big Tech’s latest reckoning is coming as it continues to rack up record valuations Zuckerberg’s case may hinge on its strong competition, particularly with Alphabet and Amazon for advertising, and Twitter Inc. TWTR, -0.23% , Snap Inc. SNAP, -0.18% and TikTok in social media. Facebook has consistently called for government regulation in areas where it has been criticized: election integrity, privacy, and harmful content. Bezos, meanwhile, is expected to explain how small sellers on its third-party marketplace platform continue to “thrive despite competition from Amazon” and online purchase options available for consumers. His argument, in essence, is the pandemic has boosted e-commerce overall, including that for large retail rivals like Walmart Inc. WMT, +1.00% , according to a report by Reuters. It remains unclear what Alphabet will say, though it arguably faces the most fierce reception. The company, which reportedly hopes to avert an EU antitrust investigation into its planned $2.1 billion acquisition of Fitbit Inc. FIT, -0.14% by promising not to use Fitbit’s health data to help it target ads, could be sued in the coming months by the Justice Department for alleged abuse of power in the market for advertising technology and search products. The government is also examining allegations that Google abused its dominance in search, according to published reports. The “overhang of regulatory scrutiny” remains a constant source of anxiety for Wall Street with Amazon, Google, Apple, and Facebook expected to be targets of a “political football” between now and the November election, Wedbush Securities analyst Dan Ives said in a research note on Thursday. Ultimately, what conclusions federal lawmakers take from Wednesday’s hearing might come down to a simple question, monopoly expert Stoller said. “It really comes down to this: How do you become super powerful without answering to anyone?” he said."}]}