{"article": [{"url": "https://www.marketwatch.com/story/heres-whats-behind-the-crackpot-and-baseless-wayfair-child-trafficking-conspiracy-theory-2020-07-16", "published": 1594940120.0, "headline": "Here's what's behind the crackpot - and baseless - Wayfair child-trafficking conspiracy theory", "body": "CHICAGO - The baseless conspiracy theory took off after an anonymous user posed a bizarre question in an internet chatroom: What if retail giant Wayfair is using pricey storage cabinets to traffic children? Self-proclaimed internet sleuths quickly responded by matching up the names of Wayfair products to those of missing children, producing social media posts that have since overrun Facebook, Instagram and YouTube. The result: A national human trafficking hotline suddenly began taking a number of calls about the imagined Wayfair scheme, stretching its resources. A woman said she posted a video of herself on Facebook to counter false claims that she was missing. One mother's pleas to Facebook and YouTube to remove a video of her young daughter that was being used to suggest she was a Wayfair victim went unanswered for days. Wayfair W, -2.59%  was forced to respond to the accusations in a recent statement: \"There is, of course, no truth to these claims.\" Yet internet users continue to weave a complex web around Wayfair's furniture and decor, spun from falsehoods and conjecture. Social media influencers, fringe online communities and even political candidates have also now seized on the conspiracy theory as evidence of an even grander one, known as QAnon, that centers on the baseless belief that President Donald Trump is waging a secret campaign against enemies in the \"deep state\" and a child sex trafficking ring. \"Conspiracy theorists always managed to spread their theories in the past, but the internet has made this much easier,\" said Kathryn Olmsted, a history professor who studies conspiracy theories at University of California, Davis. \"If you believe in one, you believe in another. You start collecting them.\" Mentions of Wayfair and \"trafficking\" have exploded on Facebook and Instagram over the past week. And on TikTok, the hashtags #Wayfairconspiracy and #WayfairGate together amassed nearly 4.5 million views even as several strands of the conspiracy theory have been debunked. Some social media posts pointed to the high cost of the storage cabinets - which sell for about $13,000 each - as suspect. Wayfair, however, said the steel structures were priced correctly for industrial use. A pillow listed for $9,999 also fueled suspicion, but was an error, the company said. Other posts shared thousands of times on Facebook FB, +0.26%  and Twitter TWTR, -0.23%  connected the name of one of Wayfair's cabinets, Samiyah, to an outdated missing person report for an Ohio girl named Samiyah Mumin, claiming it was proof that the company is trafficking young girls. A woman who identified herself as Mumin filmed a Facebook video to set the record straight. \"Why am I mad? Because I'm not missing,\" she said. Mumin did not respond to The Associated Press' requests for comment. The Ohio Attorney General's Office confirmed Mumin was found after being reported missing for a four-day period in May 2019 and has not been reported missing since. A Maryland boy who briefly went missing in April also was identified by internet conspiracy theorists as a possible Wayfair victim because his last name matched the name of a pillow. He was found in less than 24 hours, with no signs that he had been trafficked or kidnapped, according to the sheriff's office in St. Mary's County. The burst of attention for the Wayfair claims also renewed interest in the QAnon conspiracy theory. In recent days, three conservative congressional candidates in Florida, Georgia, and California who have expressed support for QAnon have also pushed unfounded allegations about Wayfair on Twitter. Thousands of tweets promoted the QAnon hashtag with claims that Wayfair is trafficking. A network of popular QAnon Facebook groups shared a video with a mashup of claims about human trafficking, including the Wayfair conspiracy theory. The term QAnon skyrocketed on Instagram and Facebook, receiving more interactions last week than any other week over the last year, according to data from CrowdTangle, which tracks more than 4 million public pages, profiles and accounts. The attention created by the Wayfair conspiracy theory has, in some cases, been damaging for the very people social media users say they're trying to help. An increase in calls prompted by the conspiracy theory is straining the National Human Trafficking Hotline, which provides emergency help to victims. The line was already seeing a surge in requests for emergency shelter assistance because of the coronavirus, said Robert Beiser, of Polaris, a nonprofit organization that runs the hotline. \"There's a very real possibility that if there's a conspiracy theory that comes out on the internet and it generates thousands of signals into our hotline, that could get in the way for us providing timely service to survivors who are in crisis,\" Beiser said. Meanwhile, a YouTube video of a young London girl sitting on a couch to audition for a Wayfair commercial was used by some pro-Trump YouTube accounts to claim that she was a victim in the alleged trafficking scheme. The video was taken from the girl's mother's YouTube account and spread across the internet, said Carleen McCarthy, a senior agent for the talent agency Alphabet Agency, which represents the girl. The agency and the girl's mother repeatedly flagged the videos to YouTube and Facebook, as they continued to rake in thousands of views online. YouTube removed the video after the AP inquired about it, although new versions remain on the site. Facebook said in a statement that it's reduced circulation of false claims around the Wayfair conspiracy theory. One YouTube influencer - who posted a video, viewed 155,000 times, that accused Wayfair of trafficking children through their products - walked back the comments a few days later. \"I didn't really have all the facts for that video, I just kind of made it on impulse because I was so scared,\" said Jeremiah Willis in a later video. \"I personally have no knowledge, no evidence, nothing.\""}]}