{"article": [{"url": "https://www.marketwatch.com/story/student-loan-borrowers-could-face-financial-administrative-headaches-when-loan-payments-resume-advocates-warn-11594765821", "published": 1594793240.0, "headline": "Student-loan borrowers could face financial, administrative headaches when loan payments resume, advocates warn", "body": "President Donald Trump speaks as Secretary of Education Betsy DeVos and Vice President Mike Pence look on, on March 27, 2020. Earlier in the day, the U.S. House of Representatives approved the CARES Act, $2 trillion coronavirus relief bill that included a student-loan payment pause. (Photo by Drew Angerer/Getty Images) Drew Angerer/Getty Images As the financial fallout from the coronavirus pandemic started to emerge in March, Elizabeth Barber began to worry. Since January, Barber has had her wages garnished to repay about $10,000 in defaulted student loans. Barber works as a home health aide for a woman with cerebral palsy; her duties range from folding bed sheets to driving to doctor’s appointments to playing board games. It’s a job Barber loves for its variety, but it can be hard to make ends meet.. “My yearly salary right now is about $20,000,” Barber said. “So trying to keep up with the town taxes, trying to keep up with the gas and electric and everything, and then the garnishment on top of that, and then possibly my hours dwindling — I was panicking. I was just absolutely panicking.” “ ‘I was panicking. I was just absolutely panicking.’ ” — Elizabeth Barber, who had her paychecks garnished over defaulted student loans during the CARES Act collections pause In March, Congress passed a coronavirus relief bill, known as the CARES Act, that included a provision pausing payments and collections on student loans owned by the Department of Education. It’s a law Barber could have benefited from, but she hadn’t heard of it and at least through April, the news wasn’t showing up in her paycheck. During a period of a few weeks when the wage garnishment was supposed to have been turned off, the government took roughly $165 from Barber’s paychecks, according to court documents. Eventually, Barber got that money back, but only after filing a lawsuit with the help of the National Student Legal Defense Network, an organization founded by alums of the Obama-era Department of Education that represents student loan borrowers and for-profit college students, and the National Consumer Law Center. An agency spokeswoman said previously that the Department was working with its default loan servicer to contact employers by phone, emails and mail to stop wage garnishment. For Barber, the halt in garnishment has helped her catch back up on her bills, but she’s not sure how she’ll cope once the relief period ends on September 30. “The pause is good,” she said, “But September is still looming and unless I can get another job, it is going to be tough going.” Barber and other borrowers’ experiences when the Department of Education turned off student loan collections to comply with the CARES Act has advocates worried about what will happen when the agency turns that machinery back on in a few months. “From the perspective of all of the people that have reached out to us,” said Alex Elson, senior counsel at NSLDN who is representing Barber and other, similarly situated borrowers, “I’m just very concerned that September 30 right now feels like a kind of arbitrary date. To turn it right back on again, it’s a frightening prospect for tens of thousands of people.” Kicking the can down the road Some borrowers who have defaulted on their loans, like Barber, will face the resumption of wage garnishment. But even those who are current on their loans could be coping with administrative and financial headaches once payments resume. For years, borrower advocates have complained that student loan servicers — borrowers’ main point of contact when repaying their debt — don’t do enough to ensure borrowers have access to the affordable repayment plans they’re entitled to by law. Add to that an economic crisis that is likely making it difficult for thousands of borrowers to manage their bills and the fact that this is the first time the government has ever shut off and turned back on student loan payments for all of its millions of borrowers and the challenges could be unprecedented. The payment pause has “merely kicked the can down the road,” for the struggle borrowers are facing managing their student loans, said Seth Frotman, the executive director of the Student Borrower Protection Center, a borrower advocacy group. “ ‘What’s really frightening is the idea that millions and millions of people are going to need to reach out for help.’ ” — Seth Frotman, the executive director of the Student Borrower Protection Center “What’s really frightening is the idea that millions and millions of people are going to need to reach out for help,” said Frotman, who was also the student loan ombudsman at the Consumer Financial Protection Bureau. “What we’ve seen is these student loan companies are ill-equipped to handle it on a good day. It seems as if there’s zero planning, zero effort put into how we could be better accommodating the real plight of student-loan borrowers over the long-term.” Angela Morabito, a spokeswoman for the Department of Education, wrote in an emailed statement that communications will be sent to borrowers beginning in August as required by the CARES Act. “The series of communications will inform borrowers that the administrative forbearance and 0% interest period will end and loan repayment will begin after Sept. 30, 2020,” she wrote. “We will also use social media and other channels to reach borrowers, and we plan to work with partners to help spread the word.”Economic fallout from the pandemic continues The economic fallout from the pandemic is still ongoing, which could complicate borrowers’ ability to repay their debts. Roughly 22 million Americans lost their jobs during the height of the pandemic and the U.S. has only regained 7.5 million of those in May and June. In addition, many of the other efforts aimed at providing economic relief, like eviction moratoriums, will soon be lifted, exacerbating borrowers’ challenges affording their student loan bills. Roughly 33% of federal student loan borrowers said they were already struggling to afford their monthly payments before the coronavirus pandemic, according to a survey of more than 38,000 people released in May by Student Debt Crisis, an advocacy group, and Savi, a company offering a tool borrowers can use to identify and enroll in repayment and forgiveness plans. But that share goes up once the payment pause ends; 46% said they expected to struggle to make their payments in six months. “A six month payment pause was somewhat based on the idea that in six months the economy would be better and this was just the breathing room borrowers needed,” said Persis Yu, the director of the Student Loan Borrower Assistance Project at NCLC. “The pandemic is not over, in many places, it’s getting dramatically worse. It seems to me that we’re not going to be ready on October 1 to really turn the system back on from the borrower finance perspective.” Those issues could be exacerbated by logistical challenges. The machinery of the student loan system features many players: The Department of Education owns the loans and also hires servicers and debt collectors to manage them. Those relationships are governed by contracts that can be difficult to adjust quickly for extenuating circumstances. Government watchdog highlights challenges turning the student-loan collection system off A June report from the Government Accountability Office on federal agencies’ administration of the CARES Act highlighted these challenges. The report noted that the Department was slow to turn off wage garnishment with some borrowers still seeing their wages seized into June 2020 because the agency first had to get in touch with their employers in writing, who would stop the garnishment. In addition, the agency “faced challenges in providing borrowers with timely and accurate information,” about the CARES Act payment pause to borrowers in its initial weeks, the GAO noted. Increased call volume to servicers meant that there were higher-than-usual instances of dropped calls and in some cases representatives provided borrowers with inaccurate information. Suspended interest accruals and payments also didn’t show up immediately on borrowers’ accounts, according to the GAO. The report also touched on a headline-grabbing error by one of the agency’s student loan servicers that left millions of borrowers with temporary downgrades to their credit scores. In comments to the GAO, Mitchell Zais, the deputy secretary of education, called the report, “fundamentally flawed, inaccurate, incomplete and unfair.” “The federal student loan provisions of the CARES Act required [Federal Student Aid] to assist virtually every borrower across the entire federally held student loan portfolio,” Zais wrote. “In essence, FSA accomplished the enormous task of modifying payment and other requirements for more than 40 million borrowers in a matter of weeks.” The issues highlighted in the GAO report — as well as evidence that a lack of communication during past, smaller payment pauses for other emergencies allowed borrowers to slip into default — have consumer advocates eyeing the Department’s plans closely for October 1. They worry that if the government and servicers botch the resumption of payments, a wave of defaults could result. “ ‘Nobody has turned off the collection system for the federal government before for everybody ‘ ” “This has never happened before,” said David Bergeron, a senior fellow at the Center for American Progress, a left-leaning think tank, who also worked at the Department of Education for more than three decades. “Nobody has turned off the collection system of the federal government before for everybody.” Manual fixes that could be implemented for borrowers having issues during Hurricane Maria or Katrina-related payment pauses “just don’t work when you’re to the scale of everybody who has a student loan that is held by the federal government,” he said. Only recently have borrowers even begun to understand the contours of the CARES Act payment pause, said Cody Hounanian, the program director of Student Debt Crisis. Roughly 36% of federal student loan borrowers had no idea relief was available when their survey was released in May. “We’ve finally gotten to a place of some settledness and now we’re going to be disrupted all over again,” he said. Advocates and servicers worry about a crush of calls Of particular concern for advocates and servicers is the likelihood that many borrowers who have had their financial circumstances change during the payment pause will be flooding the system with requests to change their repayment plan once the pause is over. Federal student loan borrowers are entitled to make payments tied to their income through what are known as income-driven repayment plans. But getting into those programs involves paperwork and time from servicer call center representatives. Consumer advocates and state attorneys general have complained for years that instead of taking this more time-consuming approach, servicers have pushed struggling borrowers towards forbearance, a status that pauses payments, but can ultimately be costly because of the way interest builds during the period. “If those calls all come on September 29, that’s going to be a real practical challenge,” Scott Buchanan, the executive director of the Student Loan Servicing Alliance, a trade group, said of requests for payment plan changes. To try to avoid this deluge of calls, his organization and the companies that it represents are working with the Department of Education to develop a communications strategy, he said. They’re considering creating more targeted communications to send to borrowers who are likely struggling and may need extra assistance transitioning back into repayment, he said. In addition, the companies are also trying to ensure that they align the timing of messages with appropriate levels of staffing because the messages are “going to be a driver of demand in the customer service center,” Buchanan said. “At the beginning of this when the President announces the suspension of payment in a news conference without much notice and then we’re slammed with phone calls — that’s the kind of thing we want to avoid,” he added. The companies are also preparing for the likely scenario that they don’t reach every borrower before payments resume, Buchanan said. Though interest will begin accruing on October 1, there is a delay between a borrower missing a payment and consequences, like late fees or reporting to credit bureaus. “Oftentimes not everyone is going to respond and so we’re going to have to catch some of these folks after we cross that line — it’s not what we want to do,” Buchanan said, adding that no matter how many times servicers reach out to borrowers, “people are really focused on their day-to-day in these times of crisis.”If you’re financial situation has changed, get help now Advocates and servicers agree that borrowers whose financial situations may have changed since the beginning of the payment pause should reach out to their student loan companies now and ask to enroll in an income-driven repayment program. That way, borrowers can start the process of switching repayment plans during a period when servicers aren’t as likely to be facing a crush of calls and with enough time to make sure their monthly payment is affordable by the time collections resume. “The things that they got wrong shutting down, they should be very deliberate in making sure it goes right when turning it back out,” Bergeron said of the Department of Education. “It’s a do-over and no one gets do-overs, the Department should take advantage of it and so should borrowers.”"}]}