{"article": [{"url": "https://www.marketwatch.com/story/social-distancing-substantially-varies-by-income-study-2020-07-30", "published": 1596271400.0, "headline": "Social distancing â\u0080\u0098substantially variesâ\u0080\u0099 by income: study", "body": "Sheltering in place and self-quarantining has been a luxury that many Americans cannot afford. Recent studies are painting a clearer picture of who has been practicing social distancing the most during the coronavirus pandemic. And being able to stay completely at home probably depends on how much money you make, according to a new report. Researchers from the University of California, Davis analyzed mobility data from SafeGraph, Place IQ and Google Mobility GOOG, +1.97% Â between January 2020 and April 2020 to determine whether the amount that people have traveled outside of their homes during the pandemic varies by income. Their findings: Before the COVID-19 outbreak, mobile device location pings show that the wealthiest were the most mobile, while the poorest were the least mobile. But after states issued stay-at-home orders and began closing non-essential businesses in March and April to flatten the curve, the wealthiest became the ones most likely to stay put, while the poorest continued to leave their homes the most. â\u0080\u009cIt was a complete reversal,â\u0080\u009d writes lead author Joakim Weill, a graduate student with the UC Davis Department of Agricultural and Resource Economics. Indeed, the number of the wealthiest individuals staying completely at home jumped 25 percentage points, compared with just a 10 percentage point increase for the poorest communities staying put. A graph from the study depicts the percentage of people staying completely at home on weekdays. The highest income levels are represented in yellow, and the lowest are in purple. J.Weill et. al. While there are other demographics (such as age, gender and politics) that determine how likely someone is to wear a face mask or avoid going to bars while cases of COVID-19 continue to spike, household income appears to largely determine how much people can stay home and stay safe. A recent analysis sampling roughly 1,000 people in New York, Florida, Texas and California found that the top earners (averaging $233,895 a year) were almost 54% more likely to engage in social distancing than those making roughly $13,775. People pulling in more than $200K were also 12.4% more likely to socially distance themselves than those making $63,572. Read more:Some Americans are more likely to socially distance and wear face masks than others â\u0080\u0094 hereâ\u0080\u0099s why And this isnâ\u0080\u0099t exclusive to COVID-19. During the 2009 H1N1 swine flu pandemic in Mexico City, when residents were also asked to stay home to stop the spread of a contagious virus, researchers also found that higher socioeconomic households spent more time staying in place compared with lower socioeconomic households. While the most recent UC Davis report doesnâ\u0080\u0099t determine exactly why the highest and lowest earners swapped places in staying home, the researchers do highlight some plausible mechanisms that are probably at play. Perhaps the most obvious reason is that lower-income workers are less likely to have the option to work from home compared to upper- and middle-class workers. Less than 30% of workers overall can work from home, and low-wage workers have the least flexibility of all. Just 9.2% of workers in the lowest quartile of the wage distribution can work remotely, compared with 61.5% of workers in the highest quartile, according to the Economic Policy Institute. Whatâ\u0080\u0099s more, while 33.6 million Americans donâ\u0080\u0099t have access to paid leave from work, including sick days or vacation days, it becomes even scarcer the less money they make. The Pew Research Center has found that 92% of workers in the top quarter of earnings (making more than $32.21 an hour) have access to some form of paid sick leave, compared to just 31% of those making $10.80 an hour or less. And many of those in the lowest income brackets have become â\u0080\u009cessential workersâ\u0080\u009d during the pandemic. The Centers for Disease Control and Prevention (CDC) notes that a disproportionate number of the employees who have been called upon to keep showing up to work at health care facilities, farms, factories, grocery stores and public transportation jobs â\u0080\u0094 not to mention the carriers delivering packages from retailers like Amazon AMZN, +3.01%, Walmart WMT, +1.00% Â and Target TGT, +1.14% Â â\u0080\u0094 are racial and ethnic minorities in lower-wage jobs with less flexibility. â\u0080\u009cPeople in these situations often cannot afford to miss work, even if theyâ\u0080\u0099re sick, because they do not have enough money saved up for essential items like food and other important living needs,â\u0080\u009d the CDC writes on its site. Indeed, these workers are leaving their homes and potentially exposing themselves to the coronavirus to do the work that makes it possible for many white collar employees to be able to work from home at all. Related: Just 3 in 10 people working outside the home get hazard pay, despite â\u0080\u0098pervasive fearâ\u0080\u0099 of bringing coronavirus home Delivery and subscription services that can save trips to the store can also be cost prohibitive for lower-income families. One-third (32%) of shoppers using meal kit delivery services like Blue Apron APRN, +1.60% Â and Hello Fresh HLFFF, -5.00% Â are in high-income households, for example. So people earning less money often still have to leave their homes to buy groceries, pick up prescriptions and over-the-counter medications, or run other essential errands. Compounding this health and economic crisis, many lower-income workers are also concentrated in more densely populated areas, or living in multigenerational homes, which makes it even harder to socially-distance themselves. (City dwellers without a washer and dryer in their homes may have to travel to a laundromat to wash their clothes, for example.) New York City, which was an early epicenter of the pandemic in the U.S., has found that poor, dense neighborhoods suffered the highest rate of COVID-19 deaths, while affluent neighborhoods recorded very few deaths. Related:Should Black and Latino people get priority access to a COVID-19 vaccine? The UC Davis study notes that this struggle to practice social distancing is exacerbating COVID-19â\u0080\u0099s already devastating impact on lower income and minority communities. â\u0080\u009cThis implies a double burden of COVID-19: lower-income communities appear to be most vulnerable to the economic and health impacts of the disease ... and here we show that they also exhibit less of the social distancing that could buffer against it,â\u0080\u009d the report concludes. â\u0080\u009cThe results highlight the urgent need for policy options to build capacity for social distancing â\u0080\u0094 and other COVID-19 risk reduction measures â\u0080\u0094 in lower-income regions.â\u0080\u009d Read more of MarketWatchâ\u0080\u0099s coronavirus coverage here."}]}