{"article": [{"url": "https://www.marketwatch.com/story/apple-in-the-age-of-covid-19-can-new-iphones-be-made-and-who-will-buy-them-2020-04-06", "published": 1595831300.0, "headline": "Closed Apple Stores could change iPhone buying habits, but thereâ\u0080\u0099s reason for hope amid pandemic", "body": "Corrects spelling of name Angelo Zino MarketWatch photo illustration/Getty Images, iStockphoto Whatâ\u0080\u0099s normally a ho-hum quarter for iPhone sales will be interesting for Apple Inc. this year as the COVID-19 crisis prompts big changes in the way people shop for electronics. After closing all of its stores outside China in March, Apple AAPL, +1.74% Â began reopening some U.S. locations in May before it then had to scale back those plans and re-close certain locations due to a worsening of the pandemic in many U.S. states. Executives admitted in late April that Appleâ\u0080\u0099s store closures as well as those of sales partners had the potential to impact the business in ways investors may not have immediately considered. Apple saw pressure on demand for iPhones and Apple Watches, and Chief Financial Officer Luca Maestri said that Apple also expected a negative effect on Apple Care insurance plans. Thatâ\u0080\u0099s a critical trend to consider, according to Raymond Jamesâ\u0080\u0099 Chris Caso, since Apple Care is an important part of Appleâ\u0080\u0099s fast-growing services segment, making up perhaps 25% of revenue for that segment, according to his estimates. Apple Care â\u0080\u009ctends to move along with iPhone units,â\u0080\u009d he said, indicating that the companyâ\u0080\u0099s services segment is more closely tied to phone sales than some may think. Apple had reopened China stores at the time of its last earnings call and the company pointed to improving trends there following the reopenings, though store traffic still wasnâ\u0080\u0099t back to where it had been prior to the lockdowns. AT&T Inc. T, -1.01% Â offered more recent indications of a snapback domestically, with Chief Executive John Stankey sharing on the companyâ\u0080\u0099s July 23 earnings call that â\u0080\u009ctraffic has bounced back in the stores.â\u0080\u009d While the traffic is â\u0080\u009cnot quite entirely back,â\u0080\u009d customers also seem to be coming around to the idea of curbside pickup. See also: AT&Tâ\u0080\u0099s continued media woes prompt questions about competitive potential On the production side, the pandemic is expected to slightly delay Appleâ\u0080\u0099s traditional fall iPhone launch. Analysts now expect the phones to be announced in October rather than September. Caso told MarketWatch that COVID-19 concerns have likely made it more difficult for Apple to check in on production in China. What that means on a practical level for the upcoming earnings report is that the company probably wonâ\u0080\u0099t give a quarterly financial outlook when it reports results after the closing bell on July 30. It skipped a forecast last time around as well. Apple typically counts a few weeks of new iPhone sales in its September-quarter numbers but wonâ\u0080\u0099t be able to this year if the widely anticipated delay indeed occurs. The company also doesnâ\u0080\u0099t like to telegraph its plans much, and Caso reasons that a forecast excluding iPhone 12 sales expectations would be a dead giveaway for investors that Apple intends to delay the device launch. What the numbers are saying Revenue: Analysts surveyed by FactSet expect that Apple did $51.12 billion in sales for its fiscal third quarter, down from $53.81 billion a year earlier. Back in late February, analysts had projected $58.76 billion in June-quarter revenue. Earnings: The consensus forecast calls for $2.04 a share in earnings, down from $2.18 a share a year earlier and below the $2.55 a share that analysts had been expecting as of the end of February. Stock movement: Apple shares have added 35% over the past three months as the Dow Jones Industrial Average DJIA, +0.56%, of which Apple is a component, has risen 13%. The S&P 500 SPX, +0.87% Â is up 16% in that span. Of the 37 analysts tracked by FactSet who cover Appleâ\u0080\u0099s stock, 26 have buy ratings, eight have hold ratings, and three have sell ratings. The average price target listed is $364.81. What the company is saying June 24: Apple confirmed in a statement that â\u0080\u009cwith an abundance of cautionâ\u0080\u009d it was temporarily shutting seven stores in the Houston area. The company has closed stores in other states as well, including in California, North Carolina, Arizona, and Virginia. May 17: Apple announced in a press release that nearly 100 of its global stores were open at the time. â\u0080\u009cOur commitment is to only move forward with a reopening once weâ\u0080\u0099re confident we can safely return to serving customers from our stores,â\u0080\u009d the release said. Apple added that â\u0080\u009ca store opening in no way means that we wonâ\u0080\u0099t take the preventative step of closing it again should local conditions warrant.â\u0080\u009d April 30: Chief Executive Tim Cook said on Appleâ\u0080\u0099s earnings call that the company saw â\u0080\u009csaw downward pressure on demand, particularly for iPhone and wearablesâ\u0080\u009d due to temporary store closures. Maestri said that the advertising unit of Appleâ\u0080\u0099s services segment â\u0080\u009chas been impacted by overall economic weakness and uncertainty on when businesses will reopen.â\u0080\u009d Apple reported $2.55 a share in earnings on revenue of $58.31 billion, up from $2.46 a share and $58.02 billion, respectively, in the year-earlier quarter. The company also announced that it would add $50 billion to its buyback authorization and boost its quarterly dividend by 6% to 82 cents a share. Read: Apple earnings show companyâ\u0080\u0099s â\u0080\u0098resiliencyâ\u0080\u0099 amid pandemicWhat analysts are saying â\u0080¢ â\u0080\u009cIf stores remain closed, that will have an effect on things,â\u0080\u009d Raymond Jamesâ\u0080\u0099 Caso told MarketWatch in a phone interview. He joked that it would be hard for the company to â\u0080\u009chave lines around the block at the Fifth Avenue store,â\u0080\u009d a customary tradition among iPhone die-hards on Apple launch day that has gradually diminished as online orders become more popular. Caso has a market outperform rating and $400 target on Appleâ\u0080\u0099s stock. â\u0080¢ â\u0080\u009cWhile iPhone demand remains anemic, we see a Jun-Q trough and signs of a recovery,â\u0080\u009d wrote CFRA Research analyst Angelo Zino. â\u0080\u009cIt is also important to note both the Mac and iPad businesses are benefiting from recent developments related to COVID-19, as employees are forced to work from home and invest in PCs/tablets.â\u0080\u009d â\u0080¢ â\u0080\u009cWhile we expect the next iPhone to launch in C4Q20, production volumes and availability could be marginally slower due to the impact of COVID-19 on overall development timelines. We view this shift in volume production by a month or two to not be material in the long term.â\u0080\u009d -Cowen & Co. analyst Krish Sankar, who has an outperform rating and $400 target on the shares. â\u0080¢ â\u0080\u009cFollowing favorable data showing large increases in [over-the-top] consumption during the pandemic, we anticipate strong results in Appleâ\u0080\u0099s streaming business,â\u0080\u009d wrote D.A. Davidson analyst Tom Forte. He said that 2020 was supposed to be Appleâ\u0080\u0099s big year of 5G but has instead become â\u0080\u009cthe year of the pandemic.â\u0080\u009d COVID-19 â\u0080\u009chas stimulated demand for what had been some of the slower growing products in its portfolio, such as laptops and tablets.â\u0080\u009d Forte has a buy rating and $355 price target on Apple shares. This article is part of a series tracking the effects of the COVID-19 pandemic on major businesses, and will be updated. It was originally published on April 6."}]}