{"article": [{"url": "https://www.marketwatch.com/story/cdc-wont-revise-guidelines-for-reopening-schools-despite-trump-criticism-2020-07-09", "published": 1594317020.0, "headline": "CDC wonâ\u0080\u0099t revise guidelines for reopening schools, despite Trump criticism", "body": "ATLANTA â\u0080\u0094 Federal health officials wonâ\u0080\u0099t revise their coronavirus guidelines for reopening schools despite criticism from President Donald Trump, the head of the Centers for Disease Control and Prevention said Thursday. What they will do, he said, is provide additional information to help states, communities and parents decide what to do and when. â\u0080\u009cOur guidelines are our guidelines,â\u0080\u009d Dr. Robert Redfield declared. In draft CDC documents obtained by The Associated Press, the agency says there are steps that schools can take to safely reopen but that it â\u0080\u009ccannot provide one-size-fits-all criteria for opening and closing schools or changing the way schools are run.â\u0080\u009d â\u0080\u009cDecisions about how to open and run schools safely should be made based on local needs and conditions,â\u0080\u009d the documents say. They also include a checklist that encourages parents to carefully consider whether they should send their kids back to school in person or seek virtual instruction. Many districts nationwide are offering parents a choice of either mode of instruction. New York City, among other school districts, has announced that students will only return part-time in the fall. That runs counter to Trumpâ\u0080\u0099s messaging. He has been repeatedly pressuring state and local officials to reopen schools this fall, even threatening to withhold federal funds from those that keep teaching and learning remote. Trump on Wednesday criticized the CDCâ\u0080\u0099s guidelines as â\u0080\u009cvery tough and expensiveâ\u0080\u009d and said the agency was â\u0080\u009casking schools to do very impractical things.â\u0080\u009d Speaking of CDC officials, he tweeted, â\u0080\u009cI will be meeting with them!!!â\u0080\u009d And Vice President Mike Pence said revised guidelines would be issued next week. But in an appearance on ABCâ\u0080\u0099s â\u0080\u009cGood Morning America,â\u0080\u009d Redfield firmly stuck to the existing CDC guidelines. â\u0080\u009cItâ\u0080\u0099s really important, itâ\u0080\u0099s not a revision of the guidelines, itâ\u0080\u0099s just to provide additional information to help schools be able to use the guidance that we put forward.â\u0080\u009d Asked about the apparent discrepancy between Redfieldâ\u0080\u0099s and Penceâ\u0080\u0099s statements, White House spokeswoman Kayleigh McEnany said they were on the same page. She said â\u0080\u009csupplemental guidelinesâ\u0080\u009d would be forthcoming. Education Secretary Betsy DeVos has said that schools will be failing kids if they donâ\u0080\u0099t provide full-time, in-person instruction. But the draft CDC documents, which have yet to be released publicly, say decisions like that should be left to local officials. They say, â\u0080\u009cEach school and each community will have different needs and should implement the strategies best designed to meet them.â\u0080\u009d The documents say that in-person schooling will lead to at least some infections but that there are steps schools can take to lessen the risk. A graph of the CDCâ\u0080\u0099s disease modeling indicates thereâ\u0080\u0099s likely to be significantly more virus spread if all students attend school five days a week. The graph projects alternate schedules could cut infections by as much as 80%, although the agency acknowledges there is much more to learn about the disease. â\u0080\u009cScientists are still learning about how it spreads, how it impacts children and what role children may play in its spread,â\u0080\u009d the introduction to the parent checklist states. Redfield said the upcoming reference documents in part would cover how to monitor for symptoms and use face masks in schools. The CDCâ\u0080\u0099s current guidance recommends that students and teachers wear masks whenever feasible, spread out desks, stagger schedules, eat meals in classrooms instead of the cafeteria and add physical barriers between bathroom sinks. When asked about the documents AP obtained, CDC spokesman Benjamin Haynes wrote in an email that the agency would distribute additional guidance next week and pointed to what has already been released. The 30-question parent checklist asks about a childâ\u0080\u0099s health, use of special education services, comfort with local school plans and whether parents can facilitate at-home learning. It warns that if parents check multiple items on the â\u0080\u009cstay-at-homeâ\u0080\u009d column, that â\u0080\u009ccould be an indicator that your family should consider alternative learning formats other than in-person schooling.â\u0080\u009d The checklist says parents should evaluate school district plans, including how districts are â\u0080\u009cpreparing for when someone gets sick.â\u0080\u009d â\u0080\u009cIf your child, members of your household, or individuals with whom you interact frequently are at increased risk for severe illness, the best way to reduce risk of getting sick is to limit your interaction with other people,â\u0080\u009d it states. In his tweet on Wednesday, Trump did not clarify which of the CDC guidelines he opposed. But McEnany said, for example, that the president takes issue with the CDCâ\u0080\u0099s suggestion that students bring their own meals to school when feasible. â\u0080\u009cThere are 22 million children in this country who depend on these meals at schools, who depend on access to nutrition in schools,â\u0080\u009d she said. Democrats have warned Trump to keep out of the CDCâ\u0080\u0099s work. Sen. Patty Murray of Washington, ranking Democrat on the Education Committee, said the agency needs to be trusted to make decisions based on scientific evidence, â\u0080\u009cnot on President Trumpâ\u0080\u0099s Twitter outbursts.â\u0080\u009d"}]}