{"article": [{"url": "https://www.marketwatch.com/story/apple-joins-tech-rivals-with-pledge-to-be-100-carbon-neutral-by-2030-2020-07-21", "published": 1595499620.0, "headline": "Apple joins tech rivals with pledge to be 100% carbon neutral by 2030", "body": "Apple Inc. on Tuesday joined the ambitious aim of rival tech giants, believing it can reduce and offset emissions along its entire supply chain and in the production of its iPhones and other devices, all in less than 10 years. The company AAPL, +1.74% pledges to be 100% carbon neutral by 2030. Apple’s global corporate operations are already carbon neutral, so Tuesday’s update means that the company will extend that goal to its manufacturing supply chain and product life cycle. It’s a response that has largely followed increased pressure from consumers, and in some cases, shareholders. Shuli Goodman, executive director of LF Energy said “consumer pressure has finally grown ‘loud’ enough to actually force Big Tech and the broader private sector to take steps to reduce their carbon footprints.” Apple’s most recent environmental report, covering fiscal 2018, put its carbon footprint at 25.2 million tons. Apple said it aims to achieve 75% of the goal by reducing emissions, with the remainder coming from carbon removal or offset projects such as planting trees and restoring habitats. CEO Tim Cook argued that climate action “can be the foundation for a new era of innovative potential, job creation, and durable economic growth.” “With our commitment to carbon neutrality, we hope to be a ripple in the pond that creates a much larger change,” he said. All iPhone, iPad, Mac and Apple Watch devices released in the past year are made with recycled content, the company noted. Its latest recycling-specific innovation, a robot called “Dave,” can recover key materials such as rare earth magnets from old iPhones. Rare earth elements are energy intensive to mine but recycling the small amount from the final product has historically been uneconomical. Apple said it is supporting the development of what it claims is the first-ever direct carbon-free aluminum smelting process and that the first batch of this low-carbon aluminum is being used in production of the 16-inch MacBook Pro. As for powering its own operation, new and completed projects in Arizona, Oregon and Illinois bring Apple’s renewable capacity for its corporate HQ to over 1 GW — equivalent to powering over 150,000 homes a year, it said. The company also said it has commitments from over 70 suppliers to use 100% renewable energy for Apple production. And it inked a partnership with the U.S.-China Green Fund, investing $100 million in accelerated energy-efficiency projects for Apple’s suppliers. The Apple announcement lags by several months a similar pledge by rival Microsoft MSFT, +2.48% , which said in January it believes it can go “carbon negative” by 2030. Microsoft will aim to clean up emissions at its headquarters, while the maker of Office software and Xbox said it will expand a carbon “tax” along its supply chain. CEO Satya Nadella said then that his company believes that by 2050 it can remove all the carbon it has emitted since the company’s 1975 founding. Carbon negativity is the reduction of a carbon footprint to less than neutral, with the net effect of removing carbon dioxide from the atmosphere rather than adding it. Only a handful of companies have committed to net-negative or, as they sometimes put it, “climate-positive,” greenhouse gas emissions targets. Alphabet’s Google GOOGL, +1.82% has said it intends to extend the carbon-neutral status it claims for its own operations to include its supply chain, but it has yet to set a deadline. Delivery giant Amazon late last year set a goal to meet the Paris Climate Agreement objectives for 2050 10 years early, with a pledge to be carbon neutral by 2040, even for its Prime one-day shipping service. The Paris pact is an international voluntary effort that aims to keep global average temperature rise to below 2 degrees Celsius, and ideally limit it to 1.5 degrees. Private companies are acting alone after the Trump administration pulled the U.S. from the Paris deal, citing in part its belief that developing nations don’t share the burden. “However, actions by Big Tech or citizen activist groups alone are not enough,” said Goodman. “For radically effective climate action, we need our public and private sectors to align. It’s great for Apple and other Big Tech companies to make promises like these, but there’s no cost for them if they fail. Until policies exist that also hold these companies accountable to these promises, it will be difficult to enforce any solid action plans.”"}]}