{"article": [{"url": "https://www.marketwatch.com/story/abigail-disney-confused-by-disney-reopening-its-florida-theme-parks-as-coronavirus-cases-spike-2020-07-16", "published": 1594906100.0, "headline": "Abigail Disney â\u0080\u0098confusedâ\u0080\u0099 by Disney reopening its Florida theme parks â\u0080\u0094 and she still wants to be taxed more", "body": "Abigail Disney isnâ\u0080\u0099t ready to be Disney Worldâ\u0080\u0099s guest just yet. The Walt Disney Co. DIS, +1.53% Â heiress, who does not have an operating role in the company, told CNBCâ\u0080\u0099s â\u0080\u009cSquawk Boxâ\u0080\u009d on Thursday that sheâ\u0080\u0099s â\u0080\u009cconfusedâ\u0080\u009d about why Disney has reopened some of its Florida theme parks even as coronavirus cases surge in the Sunshine State. Whatâ\u0080\u0099s more, just days after the Orlando area parks reopened, Hong Kong Disneyland announced it will shut down again following a spike in coronavirus cases there. Disney, the granddaughter of Disney co-founder Roy Disney, admitted that sheâ\u0080\u0099s not looking at the same information that park operators have probably considered in making the decision to reopen some parks. Related:â\u0080\u0098The beginning of a horror movieâ\u0080\u0099? Disney World slammed as doors reopen amid spiking coronavirus cases â\u0080\u009cBut given what I do know â\u0080¦ from reading newspapers and so forth, Iâ\u0080\u0099m confused about how they think they can possibly protect their guests and their employees,â\u0080\u009d she said on the Comcast-owned CMCS, -0.34% news program. â\u0080\u009cI certainly know people who work there who are very uncomfortable, who have conditions like asthma and diabetes that put you at high risk, who are literally deciding whether they want to go back to work or buy food.â\u0080\u009d Watch it here: iframe.twitter-tweet { width: 100% !important; } Disney parks chairmanÂ Josh Dâ\u0080\u0099AmaroÂ recently told CNBC thatÂ the company feels â\u0080\u009creally goodâ\u0080\u009dÂ about the safety precautions it put in place. Abigail Disney is no stranger to blasting the company that shares her name. Earlier in the pandemic, she attacked it for moving to furlough more than 100,000 workers due to the COVID-19 pandemic while still retaining some executive bonuses. She has also said that former Disney CEO Bob Iger was overpaid, stating â\u0080\u009cJesus Christ himself isnâ\u0080\u0099t worth 500 times his median workerâ\u0080\u0099s pay.â\u0080\u009d Related:Abigail Disney attacks Disneyâ\u0080\u0099s decision to furlough workers: â\u0080\u0098What the actual fâ\u0080\u0094?â\u0080\u0099 Disney also doubled-down on her recent open letter with the â\u0080\u009cMillionaires for Humanityâ\u0080\u009d to increase taxes on wealthy individuals like herself to help fund COVID-19 relief. On Monday, Disney joined dozens of millionaires across the world, including Ben & Jerryâ\u0080\u0099s co-founder Jerry Greenfield, former BlackRock managing director Morris Pearl, in asking governments to â\u0080\u009craise taxes on people like us. Immediately. Substantially. Permanently.â\u0080\u009d Read more:Tax us: Abigail Disney among 83 millionaires begging for higher taxes for coronavirus relief Disney said that the effective tax rate for wealthy Americans has dropped from around 50% to 23% in the past 40 years, or roughly what the middle class pays. â\u0080\u009cI would be happy to go back to the 50%,â\u0080\u009d she said. â\u0080\u009cIf thatâ\u0080\u0099s not politically feasible, letâ\u0080\u0099s talk about 40 [percent], but we need to recognize that there are people in this country who are so wealthy that a 40% tax rate would do nothing to erode the quality of their life. â\u0080\u009cItâ\u0080\u0099s time for us to cough up a little bit more,â\u0080\u009d she said. iframe.twitter-tweet { width: 100% !important; } The tax windfall could be key to helping the 13.6 million people and counting who have been infected with COVID-19 worldwide, she argued, as well as the tens of millions who have lost their jobs as the pandemic has disrupted large sections of the economy. In fact, she says doing this before the pandemic could have cushioned the coronavirusâ\u0080\u0099 blow. â\u0080\u009cIf we had invested more in our health systems, if we had invested more in making sure the low-income and middle-income workers had, for instance, some savings or owned their homes or anything that ensures a life thatâ\u0080\u0099s secure, we would be doing so much better,â\u0080\u009d she said. â\u0080\u009cBut you saw how quickly those lines formed at the food pantries. Millions and millions of people who work full time in this country did not have enough money laid by to ensure that they had enough to eat for the next week, much less however long this is gonna last,â\u0080\u009d she added."}]}