{"article": [{"url": "https://www.marketwatch.com/story/teslas-stock-shoots-up-toward-another-record-after-wedbush-analyst-boosts-target-to-4th-highest-on-the-street-2020-08-17", "published": 1597737860.0, "headline": "Tesla's stock shoots above $1,800 for first time after Wedbush analyst boosts target to 4th highest on the Street", "body": "Shares of Tesla Inc. rose Monday above the $1,800 level for the first time, after Wedbush analyst Dan Ives raised his target to be the fourth-highest on Wall Street, citing signs of accelerating demand in China. Tesla shares charged up 11.2% to a record close of $1,835.64, and have rocketed 33.6% in four sessions since the electric vehicle maker's announced of a 5-for-1 stock split. That marks the eighth time Tesla's stock has produced a rally of more than 30% in four sessions this year. Don't miss: Tesla's stock run leads to 5-1 share split. Good timing, because Ives raised his \"base case\" price target to $1,900 from $1,800. Of the 35 analysts surveyed by FactSet, Ives's target is now only below the $2,400 target of Piper Sandler's Alexander Potter, Oppenheimer's Colin Rusch's target of $2,209 and the $1,903.97 target of Everbright Securities' Yu Jing Ni. Ives's target is well above the average target of $1,235.37, which is 32.7% below Monday's closing price. Meanwhile, Ives's \"bull case\" target is $2,500. \"We continue to believe [electric vehicle] demand in China is starting to accelerate in July/August with Tesla competing with a number of domestic and international competitors for market share with Giga 3 remaining the linchpin of success which remains the prize that [Chief Executive Elon] Musk and Tesla are laser focused on capturing,\" Ives wrote in a research note. Giga 3 is the factory Tesla operates in Shanghai. \"We are seeing more leverage in the story now on the horizon out of Giga 3 along with some price cuts both in the US and China that could further stimulate demand as the macro starts to improve and the lockdown conditions ease globally,\" Ives wrote. Despite Ives's bullish call, he still doesn't recommend investors buy the stock. He reiterated the neutral rating he's had Tesla since April 25, 2019. At that time, his price target was $275. Ives expects Tesla to announce a number of new potential \"game changing\" battery developments at the company's Battery Day event, scheduled for Sept. 22, including a \"million mile\" battery. \"In theory, this battery will support an electric vehicle for 1 million miles and be a major step forward when competing versus. traditional gasoline powered automotive competitors from both a [return on investment] and environmental perspective,\" Ives wrote. Tesla's stock has more than doubled (up 129.7%) over the past three months, while shares of China-based rival Nio Inc. NIO, +0.14%  have skyrocketed fourfold (up 316.9%) and the S&P 500 index SPX, +0.87%  has climbed 18.1%. Over the same time, Ives's price target has more than tripled, as his price target as of May 17 was $600. Tesla's market capitalization has swelled to $342.02 billion. That is more than triple the combined market caps of auto makers General Motors Co. GM, -0.15%  ($42.95 billion), Ford Motor Co. F, -1.36%  ($$27.77 billion) and Fiat Chrysler Automobiles N.V. FCAU, -0.95%  ($23.16 billion), and more than 50% above the market cap of Japan's Toyota Motor Co. TM, -0.65%  7203, -0.95%  ($221.12 billion). Meanwhile, General Motors shares jumped 7.7% to the highest close since June 8, after Deutsche Bank analyst Emmanuel Rosner pushed for the automaker to spin off its EV business into a separate entity. Rosner, who rates GM a buy, said he was adding the stock to Deutsche Bank's short-term Catalyst Call Buy List. Rosner said he believes an EV spinoff would force the market to recognize its EV technology and upcoming vehicle lineup, \"unlock considerable shareholder value,\" give the new entity access to cheap capital and provide the new entity with the ability to attract high-caliber talent. GM's stock has gained 32.6% over the past three months, but has dropped 18.0% year to date."}]}