{"article": [{"url": "https://www.marketwatch.com/story/aaa-expects-cheapest-summer-gasoline-prices-since-2016-2020-06-25", "published": 1593043760.0, "headline": "AAA expects cheapest summer gasoline prices since 2016", "body": "American drivers are likely to pay the cheapest summer prices for gasoline in four years, according to a forecast released by motorist and leisure travel group AAA on Thursday. National gas prices are likely to average near $2.25 a gallon for the third quarter of this year, representing a 15% decline from the $2.66 average seen last summer, AAA said in its report, which is based on economic forecasting and research by IHS Markit. “This will be the cheapest summer for filling-up since 2016,” AAA said. AAA forecasts that Americans will take 707 million trips for the July 1 to Sept. 30 summer period, down 14.6% from the same period a year ago. Out of that total number, 683 million Americans will take a trip by automobile, down 3.3% from the same period a year earlier. The “rail, cruise and other” category will suffer an 85.5% drop to just 9.3 million this summer, while trips by air are expected to be down by nearly 74% to 15.1 million. Car trips account for about 97% of the favored mode of transportation and will see the smallest decrease in travel volume, AAA said. Americans this summer are taking a “‘wait and see approach’ when it comes to booking and are likely to book more long weekend getaways than extended vacations,” said Paula Twidale, AAA’s senior vice president of travel, in a statement. “When they do venture out, the greatest share of travelers — 683 million — will take to the road to satisfy their wanderlust.” Without the pandemic, AAA would’ve projected 857 million trips during the third quarter, which would’ve represented a 3.6% increase over last year, so it estimates that the pandemic wiped out nearly 150 million summer trips. AAA did not release Memorial Day or Independence Day travel forecasts, citing the pandemic’s impacts on travel. In mid-May, a survey of more than 1,800 people from fuel-price tracker and travel app GasBuddy revealed that 31% of Americans said that they plan to go on a summer road trip. Read:Nearly 1 in 3 Americans are planning to take a road trip this summer, as low gas prices outweigh coronavirus fears On Wednesday, AAA pegged the average price for national regular gasoline at $2.157 a gallon. That was up from $1.958 a month earlier, but down from $2.662 a year ago. On the New York Mercantile Exchange on Wednesday, the front-month July reformulated gasoline futures contract US:RBN20 settled at $1.1964 a gallon, its lowest finish since June 15. It’s down more than 29% year to date. Read:Why gasoline is set to lead a bumpy rebound in transportation fuels"}]}