{"article": [{"url": "https://www.marketwatch.com/story/the-north-face-parent-vf-corp-sees-sales-uptick-as-people-head-outdoors-or-to-their-backyards-during-coronavirus-pandemic-2020-06-11", "published": 1591964720.0, "headline": "The North Face parent VF Corp. sees sales uptick as people head outdoors, or to their backyards, during coronavirus pandemic", "body": "With lockdowns lifting around the country, consumers are heading to the great outdoors, or to their backyards, for activities like camping and hiking that require merchandise that VF Corp. brands offers, positioning the business for increased sales, the company says. VFC’s VFC, -0.91% portfolio includes The North Face, Timberland and Eagle Creek. Speaking at the Stifel Cross Sector Insights Virtual Conference on Wednesday, VFC Chief Executive Steven Rendle highlighted four trends, which he says were growing even before COVID-19 and are accelerating after the pandemic, including an “appreciation for the outdoors.” “[W]e’ve seen a nice uptick, as an example, in our North Face equipment business,” Rendle said, according to a FactSet transcript. See:RH is planning to open hotels and sell houses, but analysts ask whether it can pull it off “People purchasing tents and sleeping bags at a higher rate and then sharing the experiences that they’re creating with… their families in the backyard, sleeping outside, cooking dinner over their camp stoves, but really trying to generate some new excitement in a stay-at-home environment.” Some are vacationing in the wild. “[A]s states and countries begin to reopen, we are seeing an uptick in outdoor participation in national parks and outdoor environments where people typically would take a more multiday approach to the outdoors,” Rendle said. “And our North Face, Timberland, SmartWool, Icebreaker brands are very, very well-positioned.” Even when consumers aren’t camping, they’ve become more casual during these lockdown periods. VFC is also the parent company for Vans, an athletic brand known for its laid-back, skateboard lifestyle aesthetic. “[T]he work that we’ve done to reshape our portfolio [to] position ourselves in this total addressable market of outdoor, active and athleisure, and this area of work lifestyle is really paying great dividends, Rendle said. VFC is positioned to capitalize on the tailwinds of “being purpose-led and performance-driven, enabling us to... be well-suited to accelerate as everything comes back to a new normal,” he said. Read:Tractor Supply benefiting from consumer trends like gardening and the move to rural communities, analysts say NPD Group analysts have also taken note of a shift in consumer apparel shopping behavior. Shoppers were once snapping up items like pajamas and loungewear to be comfortable at home, a trend that Target Corp. TGT, +1.14% highlighted. Now, they’re moving toward recreational gear. “Apparel was a low priority early in the COVID-19 crisis when consumers were focused on things like groceries and other in-home necessities, but we’re seeing evidence that apparel is once again entering the spending consideration set,” said Maria Rugolo, apparel industry analyst for NPD in a May 28 report. “Warmer weather is spanning much of the country, allowing consumers to extend their mostly homebound routines to the outdoors, and expanding their apparel needs beyond comfort and above-the-keyboard dressing.” Baird analysts also note the fitness and outdoor trend, but remain cautious. The lack of tourism is a headwind, analysts say. High unemployment is a deterrent to spending, and whether there is another stimulus package is to be determined. Don’t miss:Mnuchin says Trump administration will ‘seriously look’ at sending out more stimulus checks Baird rates VFC stock outperform with a $66 price target, citing recent momentum for both The North Face and Vans brands. In addition to these trends, Stifel analysts cite VFC’s move to more direct-to-consumer sales and growing brand strength abroad as assets for the business. “Compared to other brands in the portfolio, Vans and Dickies reportedly performed better and will likely be leaders in portfolio stabilization,” analysts said. “Vans benefits from consumer engagement and built in China growth. Dickies benefits from a small but growing Asia business, and sales through partners that had been deemed as essential businesses, like Walmart.” Stifel rates VFC stock buy with a $75 price target. VFC reported fiscal fourth-quarter earnings that missed expectations in mid-May. VFC shares fell 3.9% on Thursday, and have fallen 39.7% for the year to date. The S&P 500 index SPX, +0.87% is down 5.7% for 2020 so far."}]}