{"article": [{"url": "https://www.marketwatch.com/story/nvidia-hurdles-300-billion-market-cap-which-intel-hasnt-topped-since-the-dot-com-bust-2020-08-17", "published": 1597681040.0, "headline": "Nvidia hurdles $300 billion market cap, which Intel hasnâ\u0080\u0099t topped since the dot-com bust", "body": "Nvidia Corp. is worth more than $300 billion for the first time as 2020 continues to be a watershed year in the semiconductor industry for companies not named Intel Corp. Nvidia NVDA, -0.54% Â shares closed up 6.7% at $493.48, giving the Santa Clara, Calif.-based chip maker a market capitalization of $303.49 billion to firmly place it as the largest U.S. chip company. The milestone comes just before Nvidia is scheduled to report second-quarter earnings on Wednesday. Nvidiaâ\u0080\u0099s stock has been on fire all year, surging 110% and pushing its market capitalization beyond Intelâ\u0080\u0099s INTC, -1.03% for the first time ever in July. After jockeying positions for several sessions, Nvidia left Intel in the dust after Intel said its next generation of 7-nanometer chips would be delayed until at least late 2022 because of manufacturing problems. The $300 billion level is a tough one even for Intel, which last saw a $300 billion market cap back in November 2000 as the dot.com bubble burst was in full swing. On Monday, Intelâ\u0080\u0099s cap stood at $208.10 billion. Intelâ\u0080\u0099s pain in 2020 has also translated into Advanced Micro Devices Inc.â\u0080\u0099s AMD, -3.94% Â gain. AMD has been selling several versions of 7-nm chips all year, and just came off of strong earnings and indications that the companyâ\u0080\u0099s market share gain from Intel was quickening. For its part, AMD logged its own market cap milestone recently, closing above a $100 billion valuation for the first time earlier this month. While Intelâ\u0080\u0099s shares are down 18% for the year, AMDâ\u0080\u0099s are up 80%. In comparison, the PHLX Semiconductor Index SOX, +1.77% is up 20%, the S&P 500 index SPX, +0.87% Â is up nearly 5%, and the tech-heavy Nasdaq Composite Index COMP, +1.39% Â is up 24%."}]}