{"article": [{"url": "https://www.marketwatch.com/story/your-morning-cup-of-cold-brew-coffee-now-comes-in-bourbon-form-11601650464", "published": 1601712380.0, "headline": "Bourbon that tastes like cold-brew coffee - the perfect drink for 2020?", "body": "FEW Spirits founder Paul Hletko says Cold Cut Bourbon has 'layers upon layers of flavor and nuance.' FEW Spirits The bottle: FEW Spirits Cold Cut Bourbon, $44.99 The back story: It's no secret that we love our bourbon - sales of the classic American-made whiskey hit an all-time high of $1.78 billion in 2019. And we also love our coffee, with the cold-brew style gaining in popularity of late. So it's perhaps inevitable that some enterprising spirits company would finally combine the two sips into one. That company is FEW, an Illinois-based distillery that started almost a decade ago, making just a few cases (hence, the name, though the company also notes, with tongue-in-cheek, that F.E.W. are the initials of Frances Elizabeth Willard, a pioneer of the temperance movement). FEW founder Paul Hletko points out that coffee-flavored spirits are hardly anything new, but he says that Cold Cut Bourbon represents a different idea. It's really about the bourbon, which, like much whiskey, is produced at a potent level - aka cask strength - and then cut with liquid to bring it down to something easier to drink. Typically, that liquid is water, but FEW decided to experiment with using cold-brew coffee. The result is Cold Cut Bourbon, a sip that Hlekto says has \"layers upon layers of flavor and nuance.\" Since the bottle's release almost a year ago, it has become a strong seller for FEW, especially of late. Monthly sales have averaged 30% growth since April, the company says. What we think about it: This is a one-of-a-kind bourbon - and a tasty one to boot. It's a smooth sip - you get a mouthful of what FEW rightly describes as \"corn sweetness and oak,\" but the coffee is decidedly there in the background, adding richness and spice. The bottle is so unique that we'd hesitate to call it your everyday go-to bourbon, but it's definitely one worth trying. How to enjoy it: The FEW team suggests this is a perfect after-dinner drink - when it's too late for a cup of coffee and you \"don't necessary want dessert.\" It's perhaps too boozy (93 proof) as an alternative to your morning cup. Then again, if you want a strong drink in the morning, FEW also makes a Breakfast Gin."}]}