{"article": [{"url": "https://www.marketwatch.com/story/can-my-cat-get-coronavirus-should-my-dog-wear-a-mask-what-pet-owners-need-to-know-about-covid-19-2020-04-10", "published": 1596001880.0, "headline": "Can my dog or cat get coronavirus? Can I kiss my pet? FDA video warns pet owners about spreading COVID-19", "body": "Protecting your family during the pandemic includes protecting your pets. A six-year-old siamese cat has become the first animal in the U.K. infected with coronavirus, just weeks after the U.S. announced the first infection in two pet cats in New York state. The U.K.’s chief veterinary officer confirmed the virus responsible for COVID-19 has been detected in the pet cat in the U.K. It had suffered a shortness of breath. An increasing number of pets has caught the virus, but infections have been reported in relatively few animals worldwide. In April, the U.S. Centers for Disease Control and Prevention and the U.S. Agriculture Department’s National Veterinary Services Laboratories announced the first confirmed cases of SARS-CoV-2 infection in two pet cats. The FDA recently released a YouTube GOOGL, +1.82% video warning pet owners about the risks of infecting companion animals — cats and ferrets, in particular — with the novel coronavirus that causes COVID-19. “At this time, the risk of pets spreading the virus that causes COVID-19 in people is considered low,” the video narrator explains. “But it does appear people can give the virus to animals.” The PSA outlines ways to practice social-distancing with pets, as well as tips for taking of pets if you or someone in your household contracts COVID-19. Oh, and sorry, pet parents: experts are also warning people not to kiss their pets, share food with them, or let their fur babies sleep in the same bed as them. The American Veterinary Medical Association notes that pets do not appear to be easily infected by COVID-19, with less than 25 testing positive for the disease globally. Meanwhile, there have been at least 16.7 million confirmed cases and 660,593 deaths worldwide. Still, these scattered COVID-19 cases in pets, including a North Carolina pug and at least two cats in New York, are giving many dog and cat owners pause. The CDC has also updated its guidance for pet owners in light of these cases — although it is still not recommending routine testing for pets. University of Wisconsin researchers also recently warned that cats appear to be able to infect each other with the coronavirus, although many may not show symptoms. The Chapel Hill pug was tested as part of a study at Duke University after his caretakers fell ill with the virus, according to local outlet WRAL-TV. The dog, Winston, was coughing and sneezing at first, but recovered after a few days. Read more:North Carolina pug becomes first dog in U.S. to test positive for coronavirus The cats are also believed to have contracted the virus from people in their households or neighborhoods, the U.S. Department of Agriculture and the CDC told the Associated Press. iframe.twitter-tweet { width: 100% !important; } And earlier in April, a Bronx Zoo tiger tested positive for COVID-19, while six other big cats were showing symptoms of the virus. And the zoo told National Geographic that four more tigers and three lions also eventually tested positive. That incident led Google GOOG, +1.97% searches for “can domestic cats get coronavirus” to spike 950% in the week after the NYC zoo revealed that a 4-year-old tiger tested positive for the novel coronavirus after developing a dry cough. It is believed that the big cats were infected by a person caring for them who wasn’t showing symptoms. (And lest you think that animals are clawing tests away from humans who need them, the Bronx Zoo’s veterinarian explained in a statement that the tiger was tested “in a veterinary school laboratory and is not the same test as is used for people.” The CDC also notes that animals are only being tested “in very rare circumstances,” and routine animal testing is not recommended at this time.) “ “There’s no evidence that pets are playing a role in spreading this disease to people.” ” This adds to the small number of confirmed COVID-19 cases in animals worldwide, and health experts continue to state that while it appears some animals can indeed get the coronavirus from people, there is still no indication that the animals are spreading it to humans. “We don’t want people to panic. We don’t want people to be afraid of pets” or to rush to test them en masse, CDC official Dr. Casey Barton Behravesh told the AP. “There’s no evidence that pets are playing a role in spreading this disease to people.” Still, the sick pets (which are expected to fully recover) have refueled fears over whether people infected with the virus could pass the illness onto their four-legged friends, or that they could catch the virus from them in turn. Read more:Two cats in N.Y. are the first pets in the U.S. to test positive for the coronavirus So MarketWatch spoke with Dr. John Howe, the president of the American Veterinary Medical Association, and pulled the CDC and World Health Organization’s latest guidelines to lay out everything that is known about the relationship between pets and the coronavirus so far. You can also watch the FDA video here: div.youtube { height:0; position:relative; padding-bottom:56.25%; } div.youtube > iframe { position: absolute; left: 0; top: 0; width: 100%; height: 100%; } Can you get COVID-19 from your pet, or someone else’s pet? “The answer at this point is no,” Howe said. The CDC states on its coronavirus and animals section that, “At this time, there is no evidence that companion animals, including pets, can spread COVID-19 to people or that they might be a source of infection in the United States.” What’s more, Dr. Maria Van Kerkhove, the World Health Organization’s technical lead, said in a recent press briefing that “we don’t believe that [pets are] playing a role in transmission.” But what about people spreading the virus to their pets? Besides these cats and this pug, didn’t two dogs in Hong Kong get it? While the CDC notes that it is “aware of a small number of pets, including cats, reported to be infected with the virus that causes COVID-19, mostly after close contact with people with COVID-19,” the possibility of transmission still appears unlikely. Thousands of dogs and cats in 17 countries were tested by IDEXX Laboratories Inc. IDXX, +1.81%, and none came up positive for the virus. But there is still much that we still don’t know about this new virus, and there have indeed been a handful of isolated sick animal cases, including two dogs in Hong Kong, a cat in Belgium and the Bronx Zoo lions and tigers. That’s why the World Health Organization is actively investigating the human transmission of COVID-19 to animals. Kerkhove acknowledged, “we think that [animals] may be able to be infected from an infected person.” And as for the much-discussed cases of the two dogs in Hong Kong, Howe explained that these animals showed the presence of the virus, but otherwise had no clinical symptoms and were not ill. They also later tested negative. What’s more, the test that was used in these cases could detect the presence of just a particle of the virus. “To find pieces of the virus in stomach contents or stool does not mean [the dogs] are infected,” he said. Should you buy your cat or dog a mask? Probably not — and here’s why. Aonip/iStock So what should a pet owner do if they contract COVID-19? Howe and other health experts agree that you should play it safe and have minimal or no contact with your pet, especially because there are still a lot of unknowns about this new coronavirus. That means no cuddling, petting, kissing or sharing food with your fur baby, unfortunately. They also shouldn’t lick you. Keep the pet out of the room that you are recovering in, if possible, and have a family member take care of your critter while you rest up, including feeding, bathing and walking it. “Better yet, see if you can have a friend or neighbor who could take your pet out of the household,” Howe said. If you live alone and have to take care of your pet yourself while sick, try to limit contact as much as possible. Wear a face mask or face covering when you’re around your animal, and wash your hands before and after you handle them. Related:How do I self-quarantine? Can I walk my dog? Be warned, there can be legal consequences for violators Should your pet wear a mask or booties for protection? While pictures of dogs wearing masks over their noses have spread on social media, Howe said “this is a total waste of money, a total waste of time. It’s not a valid concern.” The virus that causes COVID-19 spreads mostly from person to person through respiratory droplets from coughing, sneezing and talking. iframe.twitter-tweet { width: 100% !important; } Should you get your pet tested for COVID-19? No, the CDC is not recommending tests for pets at this time. What if you suspect your pet is sick with the coronavirus? The CDC states that If your pet gets sick after contact with a person with COVID-19, do not take your animal to the veterinary clinic yourself. Call your vet and explain that your pet is showing symptoms like coughing, sneezing and not eating after being around a person with COVID-19. Some veterinarians may offer telemedicine consultations or other plans for seeing sick pets. Your veterinarian can evaluate your dog or cat, and determine the next steps for your pet’s treatment and care from there. Again, pets are only being tested in “very rare circumstances” and on a case-by-case basis. The good news is, all of the U.S. animals that have tested positive so far are expected to recover. What precautions should you take if you walk a dog or foster a pet that belongs to someone sick with COVID-19? Howe explained that while the virus is easy to pick up off of smooth surfaces such as countertops and door knobs, dog and cat fur is more porous and traps the virus. This makes it difficult to pick up from an animal’s coat. “There’s certainly nothing wrong with bathing [the animal] when it gets in your home, or before,” he said. “There’s all kinds of great disinfectant shampoos for dogs.” And basic hygiene, such as washing your hands before and after you handle a pet — and, sorry animal lovers, but no kissing your pet on the mouth — is key to prevent picking up any kind of germ from an animal, let alone COVID-19. “A dog’s mouth is not as clean and sterile like some people think,” he said. “When you think about all of the things a dog licks ... it’s just not a good idea.” Read more:‘We needed each other in this crazy mess.’ Is it a good time to rescue a dog during the coronavirus lockdown? You’re fostering a sick friend’s pet. Should you quarantine it from your own pets? Could pets spread it to other pets? At this point, “we don’t believe so,” Howe said of quarantining pets from each other. The University of Wisconsin study suggests that cats can catch it from each other, but none of the felines in the experiment appeared to get sick or show any symptoms. Three domestic cats were inoculated with the virus, and they were each put in a cage with an uninfected cat. While the cage mates did contract the virus, none of the cats got sick, and all six were virus-free within six days. But more research still needs to be conducted, including among domesticated dogs. Of course, if the animals don’t know each other, or aren’t friendly with each other, you would want to introduce them gradually anyway. That could include socialization techniques such as supervised introductions, crating, and making sure you’re not praising or fawning one animal over another. The Humane Society offers these tips for introducing new dogs and new cats into multi-pet households. The FDA also noted in its new video that preliminary research suggests that cats and ferrets are more likely to get the virus than dogs. What’s the proper social distancing etiquette with pets? Keep six feet away from other people. Wear face masks in public. Avoid crowds, and don’t congregate in tight spaces. Humans have been practicing these social distancing measures to fight the spread of the coronavirus for weeks now, and the CDC stresses that pet owners need to make sure that their animals follow these new guidelines, too. So that means you shouldn’t let your pets interact with people from outside your household. Keep your dog leashed and six feet away from other dogs and other people while you’re on a walk; avoid dog parks and dog runs where people and their pets may congregate (if your city hasn’t already closed them); and politely discourage anyone from petting your pupper. “You’re not letting your dog go up and sniff other dogs or people,” Howe explained. “You don’t know if somebody recently coughed on that dog.” While the evidence so far suggests that it’s extremely unlikely you would pick up the coronavirus from an animal’s coat, health experts are still advising everyone to keep their distance out of an abundance of caution. “Trying to maintain social distancing is always a good thing,” he said. “And if someone pets your dog on a walk, it may be good to bathe your dog when you get home.” And if you generally let your cat out, now is the time to keep kitty indoors, just to stay on the safe side. What if your pet gets sick with something else while you’re in quarantine? While many veterinary offices are only seeing urgent care or emergency cases at the moment, you still need to call a vet if your pet shows symptoms such as: an extreme change in eating habits; excessive thirst; vomiting frequently or vomiting blood; unusual stool; becoming more sluggish than usual; sudden weight loss; cloudy or red eyes; as well as emergency situations such as possibly ingesting poison, difficulty breathing, seizures, open wounds or broken bones. “Animals are still getting sick, and vets are still seeing animals every day,” Howe said. Call your local vet and explain what’s going on, and they can help determine if a pet should be brought in or not. Some practices may ask the pet owner to drive up to the clinic, where someone will then talk to the owner in the car, and possibly bring the pet into the clinic for care while the owner waits outside or waits at home. “If an animal gets sick, you can probably be 99.99% sure it will be anything but coronavirus,” Howe added. People have been warned about over-indulging in comforting junk food or alcohol while sheltering in place. Are there similar health concerns for pets? Anecdotally, many people have reported that their pets seem thrilled to bits that they are spending so much more time at home with them. But could that be too much of a good thing? Yes, Howe says — especially if you and your animal companion are not getting as much exercise as you used to because you’re staying inside. Maybe you’re taking the dog on fewer walks, or cutting those walks short. Dog runs are now out of the question. And as for cats, maybe you’re lavishing them with too many treats? “Unfortunately, so many pets in America are already obese, and if they don’t get the exercise they were used to getting before, it’s going to get worse,” Howe said. He suggests checking with your veterinarian and putting your pet on a diet; reduce their portion sizes, especially if they’re laying around more than they were before. “And it’s important to exercise them as much as possible,” he said. Apart from maintaining their weight, the lack of stimulation and activity from staying in can cause many dogs to act out and destroy your house. “Any way that you can take them for a walk, even if it’s just walking around the house — make sure they get some exercise,” he said. For more information about taking care of your pets during the pandemic, check out the following resources: American Veterinary Medical Association:avma.org The Centers for Disease Control:cdc.gov/coronavirus And read more of MarketWatch’s coronavirus coverage here. This article was updated on July 29, 2020. Rupert Steiner in London contributed to this article."}]}