{"article": [{"url": "https://www.marketwatch.com/story/one-teacher-is-welcoming-normalcy-while-another-is-feeling-rage-how-the-pandemic-has-radically-altered-educators-feelings-about-going-back-to-school-2020-09-09", "published": 1600661240.0, "headline": "Two teachers face a difficult choice: One welcomes â\u0080\u0098normalcy,â\u0080\u0099 while another feels â\u0080\u0098rage.â\u0080\u0099 COVID-19 has radically altered their feelings about school", "body": "For many teachers, a new school year can start with a mix of anticipation and apprehension about the semesters lying ahead. But after schools slogged through distance learning in the spring because of the coronavirus pandemic, the physical reopening of some districts this fall is making the mix of emotions more extreme. Some teachers are elated and others are furious at the prospect of a physical return to school. Ryan Noel, who teaches in Kansasâ\u0080\u0099 Unified School District 322 Onaga-Havensville-Wheaton Courtesy Ryan Noel Ryan Noel remembers watching students stream out of buses and cars for the first day of school at Unified School District 322 Onaga-Havensville-Wheaton. It was a moment of pure happiness for the 20-year Kansas school teacher. There was nothing special about the weather that moment near one of the temperature check entry points at Onaga High School. “ â\u0080\u0098What made it great was to be back with the kids.â\u0080\u0099 ” â\u0080\u0094 Ryan Noel, a physical education and English Language Arts teacher at Kansasâ\u0080\u0099 Unified School District 322 Onaga-Havensville-Wheaton. â\u0080\u009cWhat made it great was to be back with the kids,â\u0080\u009d Noel said. â\u0080\u009cWeâ\u0080\u0099re back.â\u0080\u009d â\u0080\u009cIt was a sense of normalcy again,â\u0080\u009d he added. But Harley Litzelman, a high school social science teacher in Oakland, Calif.â\u0080\u0099s Skyline High School, says he gets angry when he thinks about any physical return right now. â\u0080\u009cRage at the idea that my school could simply just try to kill us,â\u0080\u009d Litzelman told MarketWatch. â\u0080\u009cBecause itâ\u0080\u0099s not a matter of if and when. Itâ\u0080\u0099s a matter of how many people we are going to sacrifice.â\u0080\u009d Harley Litzelman, high school social sciences teacher and founder of Refuse to Return. Courtesy Harley Litzelman Litzelman founded Refuse to Return, a campaign of educators and supporters calling for no in-person return to school until the surrounding county has no new cases for 14 days. Since its early summer start, Refuse to Return has gathered more than 100,000 signatures on its online petition and added chapters in 35 to 40 states. â\u0080\u009cThereâ\u0080\u0099s nothing more I want than to go back,â\u0080\u009d Litzelman said. â\u0080\u009cThe question is, do we recognize the epidemiological relationship of disease, or do we ignore it?â\u0080\u009d “ â\u0080\u0098Thereâ\u0080\u0099s nothing more I want than to go back. â\u0080¦ The question is, do we recognize the epidemiological relationship of disease, or do we ignore it?â\u0080\u0099 ” â\u0080\u0094 Harley Litzelman, a high school social science teacher in Oakland, Calif.â\u0080\u0099s Skyline High School â\u0080\u009cIf we want a return to normal, we need normal amount of COVID-19 in our communities, which should be zero,â\u0080\u009d Litzelman added. Noel and Litzelman are two diverging voices in a school year thatâ\u0080\u0099s filled with diverging plans for Americaâ\u0080\u0099s approximate 56.4 million pre-kindergarten-12th grade students and 3.7 million teachers teaching those grades. Noelâ\u0080\u0099s rural school district â\u0080\u0094 without a single stoplight in its limits â\u0080\u0094 is returning to full-time, in-person instruction for its approximate 360 students. The three towns combine for an entire population of around 1,000, according to U.S. Census Bureau data. The surrounding Pottawatomie County accounts for less than 1% of Kansasâ\u0080\u0099 46,914 coronavirus cases. Litzelmanâ\u0080\u0099s school system, Oakland Unified School District, is offering only remote learning for the time being for its nearly 50,000 students. The surrounding Alameda County added roughly 2.5% of Californiaâ\u0080\u0099s 735,235 cases. There had been 6.3 million coronavirus cases in the United States and 189,972 deaths as of Wednesday, according to data aggregated by Johns Hopkins University. Many big city school systems, including Los Angeles and Chicago, are beginning the year with remote-only instruction â\u0080\u0094 but not all of them. New York City, the countryâ\u0080\u0099s largest school district, is planning for a blended model. Families can choose fully-remote learning or do a hybrid where kids do a combination of remote instruction with one to two days a week of in-person school. It postponed in-person classes to Sept. 21 to avert a potential strike from the teachersâ\u0080\u0099 union, which worried about safety conditions. Schools large and small face pressure to reopen â\u0080\u0094 right up to President Donald Trump â\u0080\u0094 as other parts of American life adapt to the new normal. Educators also have to try countering the â\u0080\u009cCOVID slideâ\u0080\u009d that could stunt many students who fell behind in the spring. See also:Hereâ\u0080\u0099s how much school closures will cost parents in lost wages, reduce GDP â\u0080\u0094 and negatively impact the nationâ\u0080\u0099s education system But schools also have to consider the health of students and teachers, and some research makes that a daunting call. Asymptomatic children can â\u0080\u009cshedâ\u0080\u009d the virus â\u0080\u0094 meaning, potentially infect others â\u0080\u0094 for several weeks, one study suggests. Meanwhile, one-quarter of all U.S. children who had contracted coronavirus since the start of the pandemic were infected as of late July, as some of the earliest school reopenings occurred. Around one-third of Americaâ\u0080\u0099s teachers are 50 and older, according to the National Center for Education Statistics. “ Almost 80% of urban schools are re-opening with remote instruction and 65% of rural districts are opting for in-person schooling, according to one survey. ” Almost 80% of urban schools are reopening with remote instruction and 65% of rural districts are opting for in-person schooling, according to the Center on Reinventing Public Education. Suburban districts are split: one-third are starting the year remote, roughly one-quarter are going with in-person instruction and another quarter are doing a hybrid model, according to the research center. The patchwork of plans can create a patchwork of feelings for teachers. They have to balance their attachment to a difficult but rewarding job against their health and their familyâ\u0080\u0099s health. Educators like Noel and Litzelman are at opposite ends of the spectrum. Others are somewhere in between. “ â\u0080\u0098I think everyoneâ\u0080\u0099s a mix. I think everyone wants to be back, but everyoneâ\u0080\u0099 nervous. â\u0080¦Thereâ\u0080\u0099s still a lot of questions that make people really anxious.â\u0080\u0099 ” â\u0080\u0094 Kelly Smith, a third grade teacher at P.S 157 in the Bronx, Kelly Smith, a third grade teacher at P.S 157 in the Bronx, wants to get back to her classroom. She hasnâ\u0080\u0099t been there since June, and that was to pick up belongings after last being in the building in March. There were still snacks in her desk and a stack of papers to grade. Smith, 26, said there was worry mixed with her anticipation as she prepared for her first day of work. â\u0080\u009cI think everyoneâ\u0080\u0099s a mix. I think everyone wants to be back, but everyoneâ\u0080\u0099s nervous. â\u0080¦Thereâ\u0080\u0099s still a lot of questions that make people really anxious.â\u0080\u009d â\u0080\u0098We appreciate schedulesâ\u0080\u0099 Noel teaches high school physical education and middle school English Language Arts. When his PE students are done in the weight room, he goes through the room with a fogger of disinfectant and then closes the door for 10 minutes. His students eat lunch on the same side of the table to avoid facing each other. They are on slightly varied bell schedules and can only visit their locker at certain hours to avoid crowding the halls. Itâ\u0080\u0099s not how school looked last year, but Noel, 42, will take it after a spring where he sent out gym routines to his student via an app and watched his own four school-age children working on screens too much for his taste. “ â\u0080\u0098We appreciate schedules and bells and sticking to a rigorous timing schedule.â\u0080\u0099 ” â\u0080\u0094 Ryan Noel, a Kansas teacher who is glad to be back in the classroom Noel missed the structure of a class day for both him and his kids. Heâ\u0080\u0099s glad to have it back, noting he and other teachers like routines. â\u0080\u009cWe appreciate schedules and bells and sticking to a rigorous timing schedule.â\u0080\u009d Structure is good, but for Noel, being around his students is even better. â\u0080\u009cItâ\u0080\u0099s the reason we all do this. Weâ\u0080\u0099re here for the kids,â\u0080\u009d he said. A return to school isnâ\u0080\u0099t risk-free, Noel understands. Two fourth-grade classes in his district are in quarantine for two weeks after one student contracted COVID-19, he said. But he trusts the school administrators and their plans. â\u0080\u009cI am comfortable with what we are doing,â\u0080\u009d he said. Noel sees the risk on a personal level. One of his children has Type 1 Diabetes. So he and his wife consulted their sonâ\u0080\u0099s endocrinologist, weighed the options and decided school, which is in a nearby district, was still best. â\u0080\u009cWe thought we made the best decision for all our children,â\u0080\u009d he said. Dan Polk, Onaga-Havensville-Wheatonâ\u0080\u0099s superintendent, said the school year is â\u0080\u009cgoing really wellâ\u0080\u009d and says many district staffers share the same attitude as Noel. “ â\u0080\u0098Itâ\u0080\u0099s a lot easier to manage with smaller numbers.â\u0080\u0099 ” â\u0080\u0094 Dan Polk, superintendent of USD 322 Onaga-Havensville-Wheaton There have been cases, he said, like the fourth grader who tested positive and is experiencing mild effects, if not asymptomatic, as well as a stafferâ\u0080\u0099s possible exposure. A sixth grader also tested positive and is exhibiting mild effects, and possibly asymptomatic. Polk understands why larger schools in different parts of the country may opt for remote or hyrbid models. â\u0080\u009cItâ\u0080\u0099s a lot easier to manage with smaller numbers,â\u0080\u009d he said. â\u0080\u0098This comes back to how well do we care for each otherâ\u0080\u0099 Litzelmanâ\u0080\u0099s wife has chronic asthma and her Houston, Texas-based grandparents contracted COVID-19. The symptoms were â\u0080\u009crelatively mildâ\u0080\u009d for the couple in their 70s, but Litzelman said it still scared the family. Nevertheless, Litzelman, 24, says his stance isnâ\u0080\u0099t powered by his personal experiences. â\u0080\u009cMy politics are driven by general solidarity with the working class,â\u0080\u009d he said. One criticism of teachers refusing to return â\u0080\u0094 often found on social media like Twitter TWTR, -0.23% Â â\u0080\u0094 goes like this: if all sorts of essential workers, from grocery store workers to delivery drivers to doctors, can venture out to their jobs, why do teachers deserve special treatment? “ â\u0080\u0098The point of disease control or public health is a cooperative effort of members of society to reduce our overall exposure to it. If teachers go to work, nurses have a much bigger job.â\u0080\u0099 ” â\u0080\u0094 Harley Litzelman, an Oakland teacher who is opposed to returning to the classroom until COVID is less of a threat â\u0080\u009cThe logic underlying that question is a hyper-individualistic way of thinking about disease,â\u0080\u009d Litzelman said. â\u0080\u009cThe point of disease control or public health is a cooperative effort of members of society to reduce our overall exposure to it. If teachers go to work, nurses have a much bigger job.â\u0080\u009d Staying out of the classroom at this moment is the right thing to do to reduce larger exposure risk, Litzelman said. â\u0080\u009cThis comes back to how well do we care for each other,â\u0080\u009d he said. As for distance learning, Litzelman said, â\u0080\u009citâ\u0080\u0099s tough, itâ\u0080\u0099s new, itâ\u0080\u0099s a lot of work, but I truly feel that our student are having a solid educational experience.â\u0080\u009d Looking ahead, Litzelman said if district officals â\u0080\u009cunderstand we cannot go back until COVID-19 is virtually eradicated, then we are good.â\u0080\u009d But if administrators â\u0080\u009cwant to force us back, then we will fight like hell.â\u0080\u009d â\u0080\u009cAs it stands right now, we canâ\u0080\u0099t even make the choice to reopen because our county, Alameda County, remains on the stateâ\u0080\u0099s COVID watch list because cases remain high here,â\u0080\u009d said an Oakland Unified School District spokesman. â\u0080\u009cThe state says schools in any county on the watch list cannot open until the county has been off the watch list for two straight weeks, at the earliest. At this stage, it is unclear how soon that will happen.â\u0080\u009d Noel acknowledges he might feel differently about returning to school if he worked in a more densely-populated district. But living and working in a rural area is the choice Noel made. â\u0080\u009cI respect each personâ\u0080\u0099s ability to choose and choose wisely,â\u0080\u009d he said of other teacherâ\u0080\u0099s decisions about return. Litzelman wouldnâ\u0080\u0099t second guess the situation in Onaga without knowing the local facts. If there were no new cases for 14 days in the area, that would fit his organizationâ\u0080\u0099s demands, he noted. â\u0080\u009cIâ\u0080\u0099m not going to judge. But I also know our Kansas chapter was really active.â\u0080\u009d"}]}