{"article": [{"url": "https://www.marketwatch.com/story/fox-news-host-chris-wallace-trump-campaign-looks-silly-for-not-owning-up-to-tulsa-rallys-crowd-size-2020-06-21", "published": 1592780060.0, "headline": "Fox News host Chris Wallace: Trump campaign looks â\u0080\u0098sillyâ\u0080\u0099 for not owning up to Tulsa rallyâ\u0080\u0099s crowd size", "body": "Trump campaign adviser Mercedes Schlapp did her best to respond to Fox News host Chris Wallace on Sunday when he pressed her on the size of the presidentâ\u0080\u0099s rally in Tulsa. But Wallace wasnâ\u0080\u0099t having it. “ â\u0080\u0098Mercedes, please donâ\u0080\u0099t filibuster. Weâ\u0080\u0099re showing pictures here, and it shows big, empty areas. Frankly, it makes you guys look silly when you deny the reality of what happened.â\u0080\u0099 ” Wallace was pointing out the fact that Saturdayâ\u0080\u0099s rally was hyped up by the campaign as having drawn more than 1 million requests for tickets. The arena, which holds about 19,200 people, only drew about 6,200, according to the Tulsa Fire Department. Schlapp explained that several Trump supporters were â\u0080\u009cworried about the protesters coming in,â\u0080\u009d but Wallace refuted that claim. â\u0080\u009cProtesters did not stop people from coming to that rally,â\u0080\u009d he said, pointing out that Trump often cites the size of his rallies as a gauge of support. â\u0080\u009cThe fact is, people didnâ\u0080\u0099t show up.â\u0080\u009d The upper section of the arena is partially empty as President Donald Trump speaks at the rally. Getty Schlapp then focused her attention on Biden, calling him a â\u0080\u009cfailed politician,â\u0080\u009d but again, that didnâ\u0080\u0099t stop Wallace for digging for answers on the no-shows. â\u0080\u009cYouâ\u0080\u0099re shifting to a campaign speech, which has nothing to do with the attendance of the rally,â\u0080\u009d he said. Watch the exchange: iframe.twitter-tweet { width: 100% !important; } Another explanation that some, like Rep. Alexandria Ocasio-Cortz, latched on to is that teenage TikTok users and K-pop fans were reportedly behind the â\u0080\u009cmillionsâ\u0080\u009d of ticket requests ahead of the event. The youngsters supposedly pranked the administration by signing up but not showing. Brad Parscale, the man leading Trumpâ\u0080\u0099s re-election efforts, denied the validity of those reports. â\u0080\u009cLeftists and online trolls doing a victory lap, thinking they somehow impacted rally attendance, donâ\u0080\u0099t know what theyâ\u0080\u0099re talking about or how our rallies work,â\u0080\u009d he said. â\u0080\u009cRegistering for a rally means youâ\u0080\u0099ve RSVPed with a cell phone number and we constantly weed out bogus numbers, as we did with tens of thousands at the Tulsa rally, in calculating our possible attendee pool.â\u0080\u009d"}]}