{"article": [{"url": "https://www.marketwatch.com/story/yes-you-may-still-be-able-to-retire-one-day-2020-08-11", "published": 1597143260.0, "headline": "Yes, you may still be able to retire one day", "body": "COVID-19 pandemic has caused us to rethink many parts of daily existence, such as our health, jobs, where we live, our financial future, education, travel and the simple handshake. But according to data released Tuesday, many savers are still financially on the path to retirement. The combination of a stronger market, pandemic-related stimulus opportunities and steady, disciplined investing in the second quarter, gave Fidelity Investments cause for optimism. The firm, which publishes its analyses on investors and employers’ retirement trends every quarter, found double-digit increases in 401(k) plans and individual retirement accounts. Read: COVID-19’s next threat to your 401(k) The firm also said 11% of employers reduced or eliminated their employer matches to retirement plans, and about a third of them said they will reinstate it within the next year (another half said they would do so as soon as financially possible). The average employer contribution in the second quarter of the year was $1,080 — something roughly three-quarters of workers received. See: This is how much you need for retirement — and how COVID-19 will change that Retirement savers haven’t stopped saving, Fidelity found. Nearly nine in 10 401(k) account holders (88%) were contributing to their accounts during the second quarter, which spanned April, May and June. Of those, 9% increased their contribution rates. Almost all (96%) of 403(b) account holders maintained or increased their contribution rates during the same months. The average 401(k) balance in the second quarter was $104,400, up 14% from the first quarter but down 2% from the same time last year. The average 403(b) account balance was $91,100, a 17% increase from the last quarter and also 3% up from the year before. The average individual retirement account was $111,500, a 13% increase from the first quarter and just slightly more than the average $110,400 the same time last year. Also see: Is Suze Orman right? Is a traditional IRA really the wrong way to invest for retirement? Millennials continued to favor Roth IRA accounts, which are funded with after-tax dollars but can be withdrawn tax-free. This generation made up 23% more IRA accounts in the second quarter of 2020. Roth IRAs specifically had a 36% year-over-year growth (with a 50% increase in contributions). Read: The Roth strategy we wish we’d built for early retirement Not all retirement savers can be optimistic. The pandemic has put millions of Americans out of work, some of whom are close to retirement age and didn’t have enough to retire yet. The CARES Act, passed in March, allowed savers to withdraw more than usual from their retirement accounts, though financial advisers urge consumers to think carefully before doing so."}]}