{"article": [{"url": "https://www.marketwatch.com/story/treasury-yields-hold-steady-before-fed-policy-review-2020-08-27", "published": 1598544320.0, "headline": "10-year Treasury yield nears 0.75% after Fed says it will aim for 2% average inflation", "body": "U.S. long-term Treasury yields rose sharply on Thursday after Federal Reserve Chairman Jerome Powell said the central bank would aim for an average annual inflation rate of 2%, wrapping up the Fed’s review of its policy approach and goals.What are Treasurys doing? The 10-year Treasury note yield TMUBMUSD10Y, 0.777% rose 5.8 basis points to 0.744%, its highest since June 16, while the 30-year bond yield TMUBMUSD30Y, 1.576% surged 9.3 basis points to 1.499%, its highest since June 17. The yield for both the 10-year note and 30-year bond saw their biggest daily increase in two weeks. The shorter 2-year note rate TMUBMUSD02Y, 0.156% stood pat at 0.158%. Bond prices move inversely to yields.What’s driving Treasurys? The Fed announced the outcome of its review of its policy review at the virtual Jackson Hole central banker symposium Thursday in a speech by Fed chair Jerome Powell. The Fed said it would allow inflation to pop above the central bank’s target before looking to institute tighter financial conditions as part of its goal of aiming for a yearly average inflation rate of 2%. in contrast with the past policy of preemptively raising rates when inflation neared 2%. After seeing an initial knee-jerk rally, bond prices came under sustained pressure as investors realized the central bank’s willingness to allow inflation to run hot would weigh on longer-dated Treasurys, the part of the bond market most susceptible to the corrosive influence of inflation. Read: Here are the major changes to Fed’s strategy to foster jobs and stable inflation In U.S. economic data, new claims for U.S. jobless benefits in the latest weekly period came in at 1.01 million, a decrease from the previous week but nonetheless a highly elevated number. A revision of the U.S.’s second-quarter GDP showed the economy contracted by an annualized 31.7%. Meanwhile, pending home sales for July rose 5.9%. A $48 billion 7-year note auction in the afternoon saw strong demand, closing out this week’s string of better-than-expected debt sales. What did market participants’ say? “The Fed laid the cards on the table today, we’re likely to get some follow-up to this on September,” said Gregory Faranello, head of U.S. rates at AmeriVet Securities, in an interview. “Big picture, the Fed wants to keep rates low and financial conditions loose,” he said. “A move to average inflation implies that the back end is less protected, as the Fed would have a tolerance to seeing inflation moving to above 2% to compensate for prior experiences below,” said analysts at ING."}]}