{"article": [{"url": "https://www.marketwatch.com/story/thousands-of-restaurants-reopen-and-riders-return-to-subways-as-new-york-city-enters-phase-2-2020-06-22", "published": 1592838320.0, "headline": "Thousands of restaurants reopen and riders return to subways as New York City enters Phase 2", "body": "Several thousand restaurants are reopening for outdoor dining and New Yorkers are once again allowed to work in certain offices, shop in retail stores, and visit hair salons and barbershops as Phase 2 of the city’s reopening kicks off Monday. This comes as the state has registered a new low point in the number of COVID-19 fatalities since the pandemic began in March. New York state has gone from the deadly U.S. epicenter of the pandemic to a state with enviable statistics as the virus continues to spread across the country. There were just 10 recorded deaths from the virus on Sunday and 15 on Saturday, according to Gov. Andrew Cuomo’s office, by far the lowest numbers since the start of the crisis in March. Of the more than 50,000 tests conducted statewide on Sunday, just 0.97% came back positive for COVID-19. In New York City, the rate of positives was 1.1%. Meanwhile, both subway ridership and vehicle traffic have increased in New York City in advance of Phase 2. Subway ridership increased 29% between June 4-8, said Mayor Bill de Blasio, while bus ridership is up 22%, and traffic on the East River bridge is up 24%. “People are seeing that safety and health are being taken seriously, and they’re responding to it,” the mayor said Monday. Reopened offices will be limited to 50% of their usual capacity, and customers entering retail stores will be required to wear masks and maintain a 6-foot distance from others. Restaurants are currently restricted to outdoor seating as part of the city’s Open Restaurants initiative, which allows them to seat dine-in customers in backyards and on patios, sidewalks, and curb lanes. Also read: How to stay safe from coronavirus in a public restroom More than 3,000 restaurants have already applied to reopen with outdoor dining, and the mayor has previously estimated that Phase 2 will allow 5,000 city restaurants to open back up for business. All told, New York City is estimated to have around 25,000 restaurants, cafes and bars. See: Restaurants in New York City look to reopen, but future remains uncertain In other parts of the state, Phase 3 of the recovery—which includes the reopening of “personal care” services such as nail salons; gatherings of up to 25 people; and indoor dining with 50% capacity—has been allowed as early as two weeks after the start of Phase 2. In a news conference Monday morning, de Blasio demurred on questions about slowing down the pace of reopening in New York City to account for heightened density and risk. Mid-Hudson Valley (which includes Westchester, Dutchess and Rockland counties) is scheduled to begin Phase 3 Tuesday, and Long Island is expected to enter it on Wednesday. “Two weeks is the official minimum, but the state’s always been clear and I’ve always been clear that we’re going to judge by the data and look at the particular complexities of New York City,” de Blasio said. “I’ll hold out hope that we can move through it quickly, but it’s going to be based on the data. And it’s a high bar, because to do something here, affects so many people. We have to get it right.” The city’s Test and Trace program continues to expand, and has identified 7,500 cases across the city so far, preventing an estimated 2,000 further cases through contact tracing and providing support to help New Yorkers quarantine, including delivery of food, medication, and other supplies. In addition to restaurants, Phase 2 allows for the limited reopening of hair salons and barbershops; in-store retail; offices; houses of worship; real estate services; and car sales and rental dealerships."}]}