{"article": [{"url": "https://www.marketwatch.com/story/medicare-administrator-verma-said-to-have-paid-private-consultants-nearly-6-million-in-taxpayer-money-for-personal-image-building-campaign-2020-09-16", "published": 1600330460.0, "headline": "Medicare administrator Verma said to have paid private consultants nearly $6 million in taxpayer money for personal image-building campaign", "body": "WASHINGTON (AP) — Private consultants to the federal official who oversees Medicare billed taxpayers almost $6 million in less than two years to bolster her personal image, including efforts to win awards, place her on lists of powerful women and arrange meetings with influential people, a report by congressional Democrats said Thursday. The consultants, many with Republican Party ties, billed taxpayers up to $380 per hour on work largely aimed at polishing the profile of Medicare administrator Seema Verma, the investigators wrote. One contractor, Pam Stevens, who’s done extensive work for the GOP, charged up to $330 hourly to pursue ideas like asking publications including Oprah Magazine and Garden & Gun to write articles about Verma. Stevens also seemed to bill at least $1,117 to arrange an interview that resulted in a Verma profile in AARP The Magazine, the report said. The contractors were “handpicked” by Verma’s aides, the report said, creating “a shadow operation” that sidelined the communications staff of the federal Centers for Medicare and Medicaid Services. The consultants’ work often had nothing to do with running Medicare, Medicaid and other massive health programs that the agency operates, said the 56-page report, which was backed by over 1,700 pages of documents. Verma has run the agency since 2017. “Congress did not intend for Administrator Verma or other senior CMS officials to use taxpayer dollars to stockpile CMS with handpicked consultants or promote Administrator Verma’s public profile and personal brand,” the report said. “Given the reckless disregard she has shown for the public’s trust, Administrator Verma should reimburse the taxpayers for these inappropriate expenditures,” it said. A Health and Human Services Department official called the report a “political smear” by “far left politicians.” The statement by Michael Caputo, the department’s assistant secretary for public affairs, did not deny any of the report’s specific findings. “This is just another reckless, politically timed, drive-by hit job on a reform-driven Trump Administration official and, by extension, on President Trump himself,” said Caputo, who announced on Wednesday he was taking a leave of absence after he publicly accused government scientists of prolonging the coronavirus crisis to harm Trump in the November election and seemed to suggest Trump backers make plans for armed insurrection. Caputo said Verma “will continue the Administration’s unprecedented success transforming the American healthcare system.” See:House Democrats to probe whether officials meddled with CDC coronavirus data The report released Thursday was prepared by the Democratic staffs of two Senate and two House committees. The inspector general of the Department of Health and Human Services, of which Verma’s agency is a part, issued similar findings in July. Thursday’s report said that besides burnishing Verma’s image, the consultants took the lead fashioning agency communications strategies and had access to sensitive internal information that could affect financial markets. Marcus Barlow, a consultant who’d previously worked for Verma at a firm in Indiana, billed the Medicare agency for hours comparable to those of full-time workers and had decision-making powers over some federal workers, the report said. Consultants arranged for private meetings between Verma and hosts of conservative Fox News and editors of Woman’s Day and Women’s Health Magazine, the investigators wrote. One memo suggested seeking to land Verma on Washingtonian magazine’s list of Washington’s most powerful women. Another document indicated contractors billed at least $13,000 to offer Verma’s name for awards and to participate in other events. There was also an entry for nearly $3,000 for a “Girl’s Night to honor the Administrator,” held at the home of Susan Page, USA Today’s Washington bureau chief. Page wasn’t aware that Verma’s agency was billed for the event, and personally paid more than $4,000 for its costs without reimbursement, USA Today said in a statement. The news organization said the Girl’s Night events have been held for years, with journalists honoring politicians of both parties. The report said Verma brought consultants with her on official travel, even when government aides were there, driving up taxpayers’s costs. In one instance, Verma took a three-day trip to California, accompanied by three agency aides plus four consultants who charged up to $310 hourly for some of that time. Verma worked on health issues under Vice President Mike Pence when he was Indiana governor. She clashed with Democrats as part of President Donald Trump’s team when he unsuccessfully tried repealing former President Barack Obama’s health-care law."}]}