{"article": [{"url": "https://www.marketwatch.com/story/us-coronavirus-cases-near-an-all-time-high-as-governors-backtrack-2020-06-25", "published": 1593129320.0, "headline": "U.S. coronavirus cases near an all-time high as governors backtrack", "body": "NEW YORK — The coronavirus crisis deepened in Arizona on Thursday, and the governor of Texas began to backtrack after making one of the most aggressive pushes in the nation to reopen, as the daily number of confirmed cases across the U.S. closed in on the peak reached during the dark days of late April. While greatly expanded testing probably accounts for some of the increase, experts say other measures indicate the virus is making a comeback. Daily deaths, hospitalizations and the percentage of tests that are coming back positive also have been rising over the past few weeks in parts of the country, mostly in the South and West. In Arizona, 23% of tests conducted over the past seven days have been positive, nearly triple the national average, and a record 415 patients were on ventilators. Mississippi saw its daily count of confirmed cases reach record highs twice this week. “It’s not a joke. Really bad things are going to happen,” said Dr. Thomas Dobbs, Mississippi’s health officer. Republican Gov. Greg Abbott of Texas put off lifting any more restrictions and reimposed a ban on elective surgeries in some places to preserve hospital space after the number of patients statewide more than doubled in two weeks. Republican Gov. Doug Ducey of Arizona also said further efforts to reopen are on hold as cases surge. Sandwiched between the two, New Mexico Gov. Michelle Lujan Grisham, a Democrat, worried about rising numbers and the risks posed by her neighbors, declaring, “We’re on hold.” “The last thing we want to do as a state is go backwards and close down businesses,” Abbott said. The U.S. reported 34,500 COVID-19 cases Wednesday, slightly fewer than the day before but still near the high of 36,400 reached April 24, according to a count kept by Johns Hopkins University. The daily average has climbed by more than 50% over the past two weeks, an Associated Press analysis found. The true numbers are probably much higher because of limited testing and other factors. Whether the rise in cases translates into an equally dire surge in deaths across the U.S. will depend on a number of factors, experts said, most crucially whether government officials make the right decisions. Deaths per day nationwide are around 600 after peaking at about 2,200 in mid-April. “It is possible, if we play our cards badly and make a lot of mistakes, to get back to that level. But if we are smart, there’s no reason to get to 2,200 deaths a day,” said Dr. Ashish Jha, director of Harvard’s Global Health Institute. The nation’s daily death toll has actually dropped markedly over the past few weeks even as cases climbed, a phenomenon experts said may reflect the advent of treatments, better efforts to prevent infections at nursing homes and a rising proportion of cases among younger people, who are more likely than their elders to survive a bout with COVID-19. “This is still serious,” said Dr. Robert Redfield, director of the Centers for Disease Control and Prevention, but “we’re in a different situation today than we were in March or April.” Several states set single-day case records this week, including Arizona, California, Nevada, Texas and Oklahoma. Florida reported over 5,000 new cases for a second day in a row. Mississippi’s Dobbs blamed a failure to wear masks and observe other social-distancing practices. “I’m afraid it’s going to take some kind of catastrophe for people to pay attention,” he said. “We are giving away those hard-fought gains for silly stuff.” Tom Rohlk, a 62-year-old grocery store worker from Overland Park, Kansas, complained that young people sometimes act as if they don’t care: “It seems like it’s time to party.” The U.S. has greatly ramped up testing in the past few months, and it is now presumably finding many less-serious cases that would have gone undetected earlier in the outbreak, when testing was limited and often focused on sicker people. But there are other more clear-cut warning signs, including a rising number of deaths per day in states such as Arizona and Alabama. The numbers “continue to go in the wrong direction,” Ducey said. “We can expect our numbers will be worse next week and the week after.” The number of confirmed infections, in itself, is a poor measure of the outbreak. CDC officials, relying on blood tests, estimated Thursday that 20 million Americans have been infected. That is about 6% percent of the population and roughly 10 times the 2.3 million confirmed cases. Officials have long known that many cases have been missed because of testing gaps and a lack of symptoms in some infected people. Worldwide, over 9.5 million people have been confirmed infected, and nearly a half-million have died, including over 124,000 in the U.S., the world’s highest toll, by Johns Hopkins’ count. While some states impose new restrictions or pause their reopenings, some businesses also are backing off. Disney delayed its mid-July reopening of Disneyland. As politicians try to strike a balance between public health and the economy, the government reported that the number of Americans applying for unemployment benefits last week declined slightly to 1.48 million, indicating layoffs are slowing but still painfully high. Elsewhere around the world, Paris’ Eiffel Tower reopened to visitors after its longest peacetime closure: 104 days. With hospitals overwhelmed in New Delhi, Indian troops provided care in railroad cars converted to medical wards."}]}