{"article": [{"url": "https://www.marketwatch.com/story/exxon-out-salesforce-amgen-honeywell-added-to-dow-because-of-apple-stock-split-2020-08-24", "published": 1598296220.0, "headline": "Apple stock split leads to major Dow Jones shake-up: Exxon is out, Salesforce is in", "body": "The S&P Dow Jones Indices announced a major shake-up for the Dow Jones Industrial Average on Monday, switching out three stocks for the second time in a decade and the third time in this millennium. On the 30-stock, price-weighted Dow Average DJIA, +0.56%, cloud-based customer relationship-management software company Salesforce.com Inc. CRM, +2.21% will replace oil giant Exxon Mobil Corp. XOM, -1.47% , biotech drugmaker Amgen Inc. AMGN, -1.41% will replace pharmaceutical company Pfizer Inc. PFE, -0.27% , and software and industrial conglomerate Honeywell International Inc. HON, +0.34% will replace defense contractor Raytheon Technologies Corp. RTX, -1.46% , S&P Dow Jones said. S&P Dow Jones said the changes were “prompted” by Apple Inc.’s AAPL, +1.74% decision for a 4-for-1 stock split, which will reduce the index’s tech-sector weighting. “The announced changes help offset that reduction,” S&P Dow Jones said in a statement. “They also help diversify the index by removing overlap between companies of similar scope and adding new types of businesses that better reflect the American economy.” Apple joined the Dow back in 2015 not long after a stock split, and expects to split its stock again after trading ends Friday — a rare move for a Dow stock. “From 1980, there have been three 4-for-1 stock splits in the Dow: Visa V, +1.80% in March 2015, Walt Disney DIS, +1.53% in May 1992, and Philip Morris in October 1989,” S&P Dow Jones Indices Senior Index Analyst Howard Silverblatt noted in an email. He added that there have been 17 total stock splits since the end of 1999, but none since Nike Inc. NKE, +0.97% split 2-for-1 in 2015. The Dow is off 0.8% for the year and closed up 1.4% at 28,308.46 on Monday. “The changes won’t disrupt the level of the index,” S&P Dow Jones said in a statement. “The divisor used to calculate the index from the components’ prices on their respective home exchanges will be changed prior to the opening on Aug. 31, 2020.” Apple’s position in the index will change, however. Previously in the No.1 position in the price-weighted index, Apple will slide to No. 17, Silverblatt said. UnitedHealth Group Inc., UNH, +1.68% Home Depot Inc. HD, +0.49% and Amgen will take over the top three spots, in that order. The last time the Dow experienced this sort of three-component shake-up was back in 2013, when Goldman Sachs Group Inc. GS, -0.21%, Visa Inc. V, +1.80% and Nike Inc. NKE, +0.97% were added. In 2004, three stocks were also replaced, with Pfizer entering the Dow at that time along with Verizon Communications Inc. VZ, +0.23% and American International Group Inc. AIG, -1.02% After hours, Salesforce shares rose 3.8%, while Exxon Mobil shares retreated 1.6%. Similarly, Amgen shares rallied 4%, while Pfizer shares shed 1.6%; and Honeywell shares surged 3.7%, while Raytheon shares shed 3%. For the year, as of Monday’s close, Salesforce shares are up 28% at a price of $208.46, while Exxon Mobil shares are down 40% at $42.22; Amgen shares are down 2.3% at $235.57, while Pfizer’s are down 0.9% at $38.84; and Honeywell’s are down 10% at $159.37, while Raytheon’s are down 30% at $61.88."}]}