{"article": [{"url": "https://www.marketwatch.com/story/im-having-a-hard-time-understanding-how-earning-over-200000-a-year-is-too-much-to-qualify-for-a-decent-stimulus-check-2020-07-09", "published": 1595766800.0, "headline": "'I'm having a hard time understanding how earning over $200,000 a year is too much to qualify for a decent stimulus check'", "body": "Dear Moneyist, Unfortunately, we are one of the families who only got a $200 stimulus payment. We have a family of five that we provide for, but because one of our kids would have owed around $800 in federal taxes and would benefit more from us not claiming her, we allowed her to file on her own. She was then able to receive a refund instead of owing taxes due to claiming the educational tax credit we couldn't claim because of the government's income threshold. That left us with a family of four to take care of. I'm having a hard time understanding how earning over $200,000 a year is too much to qualify for a decent stimulus check when you're paying someone else's income in federal taxes, and most people pay nothing after getting theirs back in earned-income tax credit, child-tax credits, etc. We have to pay for everything! I don't feel that earning $200,000 a year should be too much to qualify under the CARES Act. Also see: Yes, America needs to brace itself for a second wave of coronavirus I believe they need to raise the income threshold to $300,000 or $400,000 a year, or not have any income guidelines. After all, people who are making nothing or very little are receiving this money, so why can't the people who are paying the most taxes receive some of it back? What bothers me the most is that most of these families look a lot like ours, but they chose to not marry or they file separately. I earn less than $50,000, but my spouse earns barely over $150,000 a year. It's very sad how they judge who needs what, because there is never a one-size-fits-all approach when it comes to families and their needs. Upset at the Inequality Dear Upset, It's a crude and fast way of getting money to those who need it most. Many people would have gone hungry if they had not received a check. Some people are receiving an extra $600 in unemployment benefits, which will end soon unless the administration extends it. If the government gave $1,200 or more to individuals earning $200,000 or $400,000 a year, that would obviously cost billions more. Congress is already sending stimulus payments worth $250 billion to 150 million households. They have to draw a line in the sand. The economic impact payment is technically an advance payment of a tax credit on your 2020 return. The Commerce Department released a report last month outlining the government's benefits, which includes stimulus payments under the $2.2 trillion CARES Act, The Wall Street Journal reported. In March, it totaled a seasonally adjusted $44.6 billion. In April, it was $262.1 billion. In May, it came to $98.3 billion. Unemployment benefits hit $5.8 billion in March, $37.7 billion in April and $106.5 billion in May. The majority of the payments have been sent, so the total will fall again in June. Also see:Here's one 'remarkable' difference between COVID-19 and the 1918 Spanish flu Under the Trump administration's emergency measures, the Internal Revenue Service is sending $1,200 to individuals with annual adjusted gross income below $75,000 and $2,400 to married couples filing taxes jointly who earn under $150,000, plus $500 per qualifying child. Yes, the payments do begin to shrink above those levels. The aim is to take care of those who need it the most first, and have a sliding scale for higher earners. The tax system will never please everyone. You can be bothered by other people's tax credits from now until your dying day. However, during a public-health emergency and an economic crisis that could turn into another Great Recession - or worse, according to some observers - people must pull together and support one another, particularly those who are in need. If we all looked over our shoulders at those who have far less and also received far more than we did and wondered why life isn't fair, we would be in a far worse state. To put your complaint in context: The Urban Institute, a nonpartisan policy research group in Washington, D.C., estimates that no stimulus checks, no expansions to SNAP or unemployment benefits beyond the regular payments would lead to an annual poverty rate of 12.4% (or 39.5 million people in poverty). The administration's response lowered that poverty rate to 9.2% (or 29.3 million people), it estimated. These people are not tax cheats. They are, for the most part, trying to survive. Also see: Can you alter your 2019 taxes in order to qualify for the stimulus check? Northwestern University's Kellogg School carried out an analysis on how fast people spent their stimulus checks and what they spent the money on. The study found that those in the lowest income group, who earned less than $1,000 per month, spent approximately 40% of their stimulus checks in the first 10 days, double the highest income group (earning over $5,000 a month) who spent closer to 20% in those 10 days. The researchers conclusions suggest they were in dire need of that money. \"In each of the three days following check receipt, individual spending increased by between $50 and $75 for food, household items, and bill payments, including rent, suggesting that many people were using the funds to obtain necessities and catch up on bills. Compared to stimulus recipients in past recessions, people today are spending much more of their stimulus money on food,\" the Kellogg report found. They're trying keep a a roof over their heads, and put food on the table. According to the Institute on Taxation and Economic Policy, the majority of state tax systems are regressive. \"Those in the highest-income quintile pay a smaller share of all state and local taxes than their share of all income while the bottom 80% pay more. In other words, not only do the rich, on average, pay a lower effective state and local tax rate than lower-income people, they also collectively contribute a smaller share of state and local taxes than their share of all income.\" Also see: I hate that my friends still get help from their parents and were born into money. I want to stop comparing. How can I do this? Low-income workers are among the hardest hit during the coronavirus pandemic. Fast-food and counter workers would need to work 107 hours, or 2.5 weeks of full-time work, to earn $1,200, working at a rate of $11.18 per hour, LendingTree found in a separate study of the 100 most common occupations in which workers earn less than $75,000 per year, as per 2019 Bureau of Labor Statistics data. Restaurant hosts and hostesses would need to work 104 hours. White-collar workers are more likely to be able to work from home, while frontline workers are putting their health and lives at risk. Spare a thought for them, instead. I understand that you are frustrated and you have a large family, but the CARES Act is an emergency measure hastily designed to help those most in need. That's what we do. Birds do it. Bees do it. Even educated fleas (and ants) do it. We rally together. If that is not the No. 1 reason of being here on this planet, I wonder, what is? You can email The Moneyist with any financial and ethical questions related to coronavirus at qfottrell@marketwatch.com Want to read more?Follow Quentin Fottrell on Twitterand read more of his columns here Would you like to sign up to an email alert when a new Moneyist column has been published? If so, click on this link. Hello there, MarketWatchers. Check out the Moneyist private Facebook FB, +0.26%  group where we look for answers to life's thorniest money issues. Readers write in to me with all sorts of dilemmas. Post your questions, tell me what you want to know more about, or weigh in on the latest Moneyist columns."}]}