{"article": [{"url": "https://www.marketwatch.com/story/coronavirus-update-global-death-toll-inches-toward-1-million-as-hot-spots-emerge-in-india-europe-south-america-and-israel-2020-09-28", "published": 1601303840.0, "headline": "Coronavirus update: Global death toll inches toward 1 million as hot spots emerge in India, Europe, South America and Israel", "body": "The global death toll from the coronavirus that causes COVID-19 edged closer to a million on Monday, and India marked the grim milestone of more than six million confirmed cases, placing it second to the U.S. by case numbers. The number of COVID-19 deaths around the world has been climbing in late August and September and reached more than 5,000 a day on average in seven days, according to a New York Times tracker. New hot spots for cases include Spain, France and the U.K., while South American countries, including Peru, Brazil and Chile, count thousands of new cases daily. Israel set a record for hospitalizations over the weekend, according to local media, despite a strict lockdown that was imposed at the start of the Jewish holidays. Data aggregated by Johns Hopkins University shows the U.S. continues to lead the world with 7.1 million cases and 204,762 deaths. Globally, more than 33 million people are confirmed to have been infected and 998,145 have died. President Donald Trump will deliver remarks later Monday from the Rose Garden on the U.S.’ testing strategy, according to the Washington Post. That strategy has been sharply criticized by his opponent in November’s presidential race, Democrat Joe Biden, after Trump repeatedly said the U.S. would have fewer cases if it were to carry out fewer tests. Trump and Biden will hold the first of three planned presidential debates on Tuesday. The U.S. counted more than 55,000 cases on Friday, the highest since mid-August, and tallied more than 37,000 on Sunday, according to the New York Times tracker. In the last week, there have been an average of 43,111 cases a day, the tracker shows, up 23% from the average just two weeks ago. “Upward-trending case counts are unfortunately unsurprising following Labor Day social gatherings and the return of college students to universities across the country,” Raymond James analysts wrote in a note. “However, so far, it does not appear that the return of primary children to in-person learning has caused substantial surges. We are paying close attention to hospitalizations this week, as an uptick in hospitalizations would be the most telling sign that we could be on the cusp of a third major surge of the coronavirus in the U.S.” Meanwhile, the head of the Centers for Disease Control and Prevention Dr. Robert Redfield was overheard by an NBC News reporter criticizing a new member of the White House Task Force created to manage the pandemic. Redfield was heard on a phone call made in public on a commercial airline saying that Dr. Scott Atlas, a neuroradiologist with no background in infectious diseases who was brought into the task force in August, has been spreading misleading information about the illness with the public, as NBC reported. “Everything he says is false,” Redfield said on the call. He later acknowledged that he was talking about Atlas, who has lately appeared at White House briefings with Trump. Before joining the task force, Atlas was a frequent guest on Fox News, where he presented many of the views shared by Trump, including the need to reopen the economy quickly and get children back into schools. Both Dr. Anthony Fauci, head of the National Institute for Allergies and Infectious Diseases, and Dr. Deborah Birx, coordinator of the task force, have criticized comments made by Atlas. Atlas contradicted Redfield following testimony to Congress last week and said he had misstated under oath that 90% of Americans are still susceptible to the virus. Trump also contradicted Redfield for testifying that most Americans will not receive a vaccine until mid-2021, saying the CDC head did not understand the question. In other news: • German Chancellor Angela Merkel said she is ‘deeply concerned’ by the rapid jump in coronavirus infections in Germany, Agence France-Presse reported. Merkel urged Germans to adhere to strict safety measures, including wearing face masks if social distancing is not possible. “The development of infection numbers is of great concern to us,” Merkel’s spokesman Steffen Seibert said. “We can see from some of our European friends where that could lead.” In a meeting with her CDU party’s leaders, Merkel warned that new infection numbers which currently total about 2,000 a day could climb to 19,200 daily by Christmas if the trend “continues in this way,” party sources told AFP. • France has implemented new restrictions in Paris and 11 other cities as it works to contain its latest surge of infections, the Guardian reported. The rules include that bars close at 10 p.m. although restaurants are permitted to stay open longer. From today, recreational events such as weddings, festivals and organized gathering are banned. All gatherings involving more than 1,000 people are banned and no more than 10 people are allowed to gather in public places such as parks or for private events. The restrictions are due to last 15 days, but will be reviewed within a week. France has 1,230 clusters currently under investigation. • England is introducing fines of up to 10,000 pounds (or $12,852) for citizens who refuse to self-isolate when instructed to do so, the BBC reported. Anyone who tests positive for the coronavirus, or is told they have come into contact with someone who has, are now legally obliged to quarantine. The move comes after a government study found that just 18% of people with symptoms actually go into isolation. Home Secretary Priti Patel said the fines were “a clear sign that we will not allow those who break the rules to reverse the hard-won progress made by the law-abiding majority.” Health Secretary Matt Hancock said the government would “not hesitate” to take more drastic action if needed. The U.K. has the highest death toll from COVID-19 in Europe at 42,090 and the fifth-highest in the world. • Ukraine is emerging as a hot spot as infections climb and health officials have tracked it to summer holiday spots where holidaymakers abandoned public safety measures, the Washington Post reported. Odessa has borne the brunt of the spike thanks to its beaches and nighttime parties, which have led to more than 12,000 cases in that region alone. Ukraine is averaging more than 3,800 cases a day, surpassing its early record of 1,109 new cases in a single day in June. Ukraine has 206,579 confirmed cases and 4,082 people have died.Latest tallies There are now 33.2 million confirmed cases of COVID-19 worldwide and 999,202 people have died, the Johns Hopkins data shows. At least 22.9 million people have recovered. Brazil has the second-highest death toll after the U.S. at 141,741, but third-highest case tally at 4.7 million. India is second to the U.S. by case tally at 6.1 million, and has third-highest death toll at 95,542. Mexico is fourth with 76,430 deaths and seventh with 730,317 cases. China, where the illness was first reported late last year, has 90,493 cases and 4,739 deaths, according to its official figures. Read:Everything you need to know about what it would take for the FDA to approve a COVID-19 vaccineWhat’s the latest medical news? Shares of Inovio Pharmaceuticals Inc. INO, -1.36% tumbled 29%, after the company said the Phase 2/3 clinical trial for its COVID-19 vaccine candidate was in a “partial clinical hold” while it answered additional questions from the Food and Drug Administration. The hold is not due to an adverse event, which is what paused the Phase 3 study for AstraZeneca PLC AZN, +1.16% AZN, +0.63% and the University of Oxford’s experimental coronavirus vaccine. Inovio said in a news release that it is working on answering the regulator’s questions, it plans to respond to the FDA in October, and then the agency has 30 days to issue its decision about whether the trial can move forward. The Phase 1 trial is still under way. Read also:There are four coronavirus vaccines in late-stage studies — here’s how they differ Hologic Inc. shares HOLX, +1.61% were up 3.6% after the company said it had received emergency use authorization from the Food and Drug Administration for a diagnostic test specifically aimed at people with asymptomatic COVID-19 infections. Hologic is the first company to offer a test screening asymptomatic individuals. This test, which is also authorized to test symptomatic people for COVID-19 infections, originally received authorization in March. What are companies saying? • Caesars Entertainment Inc. CZR, -4.36% has commenced an offering of 30 million shares in a syndicated deal, joining the many companies issuing record levels of debt and equity during the pandemic. Proceeds will be used for general corporate purposes, including potentially the previously announced possible cash offer for William Hill PLC. Caesars said earlier that it is in advanced talks over a possible 2.9 billion pounds ($3.7 billion) cash offer for the U.K. betting company. Deutsche Bank and J.P. Morgan are underwriting the share offering. • Egg producer Cal-Maine Foods Inc. CALM, -0.75% posted a smaller-than-expected loss for its fiscal first quarter and sales that topped estimates. “Our results for the first quarter of fiscal 2021 reflect continued challenging market conditions as we proactively monitor and manage our operations in the face of the COVID-19 pandemic,” Chief Executive Dolph Baker said in a statement. Total dozens of eggs sold rose 3.8% in the period, he said, due to continued strong retail demand as consumers are still eating more at home. While demand from food service customers is improving as more restaurants reopen, food service demand is still far below pre-quarantine levels, weighing on egg prices. “Market prices for eggs remained volatile over the first quarter and decreased overall compared to prices at the end of fiscal 2020, which reflected increased consumer purchases due to the COVID-19 pandemic and seasonal demand due to Easter falling in the fourth quarter,” said Baker. The company will not pay a dividend for the quarter. • CarMax Inc. KMX, -1.02% said Monday it has resumed its share buyback program after suspending it in April due to the coronavirus pandemic. The retailer of new and used cars said in a regulatory filing that it has $1.51 billion left in its share buyback authorization."}]}