{"article": [{"url": "https://www.marketwatch.com/story/what-i-learned-as-an-immigrant-ceo-in-the-deep-south-2020-07-23", "published": 1595692160.0, "headline": "What I learned as an immigrant CEO in the Deep South", "body": "“ It’s important for all leaders to identify, call out, and correct biases and prejudices that may exist within their organizations. ” I’m an immigrant who has lived in the United States for almost 60 years. I left my native India when I was a teenager. My family didn’t have much wealth, so my mother had to sell her jewelry to afford the ticket for me to embark upon my journey. I initially landed in the United Kingdom where I worked as a common laborer in a Goodyear Tire factory, saving enough money so that I could eventually attend and graduate from Auburn University in Alabama. After college, I began working at Law Engineering, a regional firm, as a junior employee. A couple decades later, I became its chairman and CEO. I have spent most of my life living and working in the Southern U.S. Here are a few insights that I’ve gathered about what it’s like to work here — and how business can be an agent of change and progress in this region.Make no mistake — racism Is real In the 1960s, when I was working in the Birmingham, Ala. branch of my company, I struck up a friendship with a Black janitor in my office. I asked him if he wanted to learn how to conduct basic laboratory tests so he could make more money. He agreed and quickly learned the trade. One evening I came back to my apartment and saw a burning cross in my front yard. In my naiveté, I thought it was a welcome gift from a neighbor (in India, people use fire during religious ceremonies). I quickly learned that this was anything but. One of my colleagues didn’t like that I was helping a Black person. When my manager found out about what had happened, he upbraided my colleague who had placed the burning cross. The South has changed considerably since then, and such overt displays of racism aren’t the norm. But there are still subtle and pernicious biases that pervade the executive suites. I was passed over for a promotion because I didn’t “look like our clients,” in the words of my then-manager. When I was the CEO of Law Engineering in the 1990s, I was in a board meeting when some of the directors dismissed people of color and foreigners. I piped up, “I am from India,” to which someone responded “No, we don’t consider you a foreigner.” I voiced my disapproval of their sentiments. It’s important for all leaders to identify, call out, and correct biases and prejudices that may exist within their organizations.Catalyst for change My hometown of Atlanta prides itself as the “City Too Busy to Hate.” We try not to focus on who is Black, brown, or white, because we’re occupied with the “green” of making money. Throughout Atlanta’s history, money has certainly talked. In 1964, Coca-Cola KO, +0.69% threatened to leave Atlanta unless the city properly recognized Dr. Martin Luther King, Jr. after he had won the Nobel Peace Prize. City leaders bowed to pressure and eventually integrated its chamber of commerce. Business can certainly be a forerunner for societal progress. As the CEO of Law Companies Group, I took my company global and acquired Sir Alexander Gibb & Partners, a multinational engineering firm based in the U.K. One result was that my firm had offices in over 100 countries. We regularly welcomed our colleagues from around to the world to our headquarters. I like to think that our firm played a modest role in internationalizing Atlanta. Many of the global companies based in the Atlanta metro area including Home Depot HD, +0.49% , UPS, +0.27% and Delta Air Lines DAL, +0.39% have helped to create a “New South” in which there is more diversity and dynamism in our communities, classrooms and corporations. Indeed, businesspeople and not politicians are at the vanguard of improving relationships between people of different races, genders, and orientations. Whenever I hear someone talk about the backward policies that the state government in Georgia has implemented towards minorities, I first agree with them and then point them to the progress that is happening in the business world. “ I am living proof that immigrants can not only live and work in the South, but thrive there. ” I’ve always appreciated the politeness of people here in the South. Folks want to talk and get to know each other. When I was the Commissioner of the Georgia Department of Industry, Trade, and Tourism, my job was to recruit companies from around the world to do more business in our state. Our secret weapon was old-fashioned Southern hospitality. When executives at major companies visited us in Georgia, we invited them into our houses for home-cooked meals, lively music and friendly conversation. These person-to-person connections helped convince many executives to open offices in Georgia, and sometimes even move their headquarters here. I still have deep relationships with many of the people I met while in this position. I love living in the South, and I believe this region can attract the best and brightest minds from around the world. I would like for more international companies to come to Georgia, which will help accelerate progress as people from different walks of life join our community. City and state government officials should prioritize making the South a destination for those wanting to start a job or move their company. I am living proof that immigrants can not only live and work in the South, but thrive there. I am not an exception. Many foreign-born people fill the executive ranks of companies that are based in this region. But there is more work to do. Those in leadership positions can start turning their clout into political power by supporting immigrant-friendly politicians and policies — and opposing measures like the recently announced limits on H1-B visas. Raghbir (R.K.) Sehgal is the author of “Close the Loop: The Life of an American Dream CEO and His Five Lessons for Success”. He was the Chairman & CEO of Law Companies Group, an engineering group based in Atlanta. He was also the chairman & commissioner of the Georgia Department of Industry Trade and Tourism. More: Trump’s visa restrictions are already pushing American jobs overseas Plus: Canada’s appeal to tech startups grows in wake of Trump suspending H-1B visas"}]}