{"article": [{"url": "https://www.marketwatch.com/story/coronavirus-update-us-case-tally-climbs-above-22-million-as-tulsa-prepares-for-trumps-indoor-rally-2020-06-19", "published": 1592665280.0, "headline": "Coronavirus update: U.S. case tally climbs above 2.2 million as Tulsa prepares for Trumpâ\u0080\u0099s indoor rally", "body": "The number of confirmed cases of the coronavirus illness COVID-19 in the U.S. continued to climb above 2.2 million on Saturday, as Tulsa, Okla., geared up for President Donald Trumpâ\u0080\u0099s planned campaign rally. The number of new cases in the U.S. rose above 30,000 on Friday for the first time since May 1, and the World Health Organization said the pandemic is actually accelerating. WHO director-general Dr. Tedros Adhanom Ghebreyesu told reporters at a briefing that the agency had received reports of 150,000 new cases around the world on Thursday, and said that about half of those new cases came from the Americas. â\u0080\u009cThe world is in a new and dangerous phase,â\u0080\u009d Tedros said. â\u0080\u009cWe call on all countries and all people to exercise extreme vigilance.â\u0080\u009d In Tulsa, the number of cases also hit a new high on Friday. A group of local business owners and residents, worried at the prospect of a fresh outbreak of infections at the 19,000-seat indoor arena if attendees do not observe the safety guidelines set by the Centers for Disease Control and Prevention, had sued the owner of the venue to block it, but a Tulsa County judge denied their request for an injunction. The group appealed the decision with the Oklahoma Supreme Court, which ruled that the event can go ahead and rejected a request that attendees be ordered to wear face masks and remain at least 6 feet away from everyone else, as the BBC reported. The Centers for Disease Control and Prevention released guidelines for reopening safely last Friday, and identified the highest risk of spreading the virus as stemming from: â\u0080\u009clarge in-person gatherings where it is difficult for individuals to remain spaced at least 6 feet apart and attendees travel from outside the local area.â\u0080\u009d From the CDC:Considerations for Daily Life and Considerations for Events and Gatherings Trumpâ\u0080\u0099s rallies tend to involve attendees queuing outside for hours before going through security and into arenas, where they cheer, shout and chant, all risk factors for spreading the droplets that contain the virus. The Trump campaign has acknowledged that risk by insisting that those who attend sign legal waivers absolving Trump and his staff of any blame, if people get sick or are injured. Read: What we do know â\u0080\u0094 and donâ\u0080\u0099t know â\u0080\u0094 about the coronavirus at Day 100 of the pandemic Dr. Anthony Fauci, head of the National Institute for Allergies and Infectious Diseases, reiterated in an interview with the Washington Post his message that Americans should continue to observe social distancing, frequently was their hands and cover their faces in public. â\u0080\u009cWhen you have a congregation of people, you increase the risk. It doesnâ\u0080\u0099t matter why theyâ\u0080\u0099re congregating or where theyâ\u0080\u0099re congregating. When you have a congregation of people in a setting in which thereâ\u0080\u0099s active virus circulating in the community, you are at risk. You need to wear a mask.â\u0080\u009d For more on Tulsa, read:Trump rally attendees dismiss heat and coronavirus concerns as they line up outside Tulsa arena Face masks have been caught up in a culture skirmish that has seen many resist wearing them, including President Donald Trump, who has theorized this week that some Americans are wearing them not for stemming the spread of a deadly virus but to express displeasure with him. The White House has been criticized for failing to push the message that masks are an important means of containing the spread of COVID-19, although local officials have stepped into the vacuum. Read:Despite concerning data, White House continues to play down coronavirus worries California Gov. Gavin Newsom made them mandatory for Californians when theyâ\u0080\u0099re in public on Thursday. Fauci said the virus is â\u0080\u009cone of the most highly transmissible viruses that we know of,â\u0080\u009d and urged Americans to pull together and work to get the outbreak under control. â\u0080\u009cItâ\u0080\u0099s tough for everyone. But remember, we are in this all together. Weâ\u0080\u0099re not just separate individual components. Weâ\u0080\u0099re in it together.â\u0080\u009d Donâ\u0080\u0099t miss:100 days of the COVID-19 pandemic: 5 critical mistakes that created the biggest public health crisis in a generationLatest tallies There are now 8.7 million confirmed cases of COVID-19 worldwide, and at least 460,783 people have died, according to data aggregated by Johns Hopkins University. At least 4.3 million people have recovered. The U.S. has the highest case toll in the world at 2.2 million and the highest death toll at 119,158, with 20 states still seeing daily increases in infections, including California, Florida, Texas and Oklahoma. Brazilâ\u0080\u0099s case tally rose above 1 million overnight with 48,954 fatalities, the data show, the second highest death toll in the world. Russia has 576,162 cases and 7,992 fatalities. India has 395,048 cases and 12,948 deaths. The U.K. has 304,580 cases and 42,674 deaths, the highest death toll in Europe and third highest in the world. Spain has 245,575 cases and 28,315 deaths, while Italy, another early hot spot in Europe, has 238,011 cases and 34,561 deaths. Peru moved past Italy by case number, with 244,388 cases and 7,461 deaths. Chile, Iran, France, Germany, Turkey, Pakistan, Mexico, Saudi Arabia, Bangladesh, Canada, South Africa and Qatar are next and all ahead of China, where the illness was first reported late last year. China has 84,525 cases and 4,638 deaths. China has shut down parts of Beijing after a fresh cluster of cases. Beijingâ\u0080\u0099s Coronavirus Cases Spoil Its Return to Normal What are companies saying? The IPO market continued to heat up with supermarket operator Albertsons Cos. ACI, +1.47% Â setting terms for its planned deal on Thursday. The company is planning to sell 65.8 million shares priced at $18 to $20 to share, to raise $1.3 billion at the top of the range. Albertsons is profitable, earning $466 million in 2019 on sales of $62.5 billion. It has reported strong demand for delivery and pickup at its stores during the pandemic. The company has filed to list its shares on the New York Stock Exchange under the symbol â\u0080\u009cACI.â\u0080\u009d Chinese oncology biotech Genetron Holdings Ltd. priced its IPO at $16 per American depositary share, above its $11.50-to-$13.50 price range. The company upsized the deal early Thursday, indicating strong demand for its paper. The shares, trading on Nasdaq under the ticker symbol â\u0080\u009cGTH,â\u0080\u009d jumped 10% in their post-IPO debut. “ â\u0080\u0098We did not want to be drawn into a political controversy. We thought it might be counterproductive if we forced mask wearing on those people who believe strongly that it is not necessary.â\u0080\u0099 ” â\u0080\u0094 Adam Arom, CEO of cinema chain AMC Elsewhere, companies continued to update investors on their reopening plans and post their latest earnings. Here are the latest things companies have said about COVID-19: â\u0080¢ AMC Theatres, the biggest cinema chain in the U.S. thatâ\u0080\u0099s owned by AMC Entertainment Holdings Inc. AMC, -2.17%, Â will require all guests to wear face masks when it reopens its cinemas across the U.S. on July 15. The Leawood, Kansas-based company made the decision after listening to its customers and to scientific advisers, who recommend face masks to stop the spread of the coronavirus illness COVID-19. The announcement comes after AMC Chief Executive Adam Aron told Variety on Thursday that the company would not force customers to wear face masks, as he did not want to become part of what is now a political hot potato. His comments â\u0080\u009cprompted an intense and immediate outcry from our customers, and it is clear from this response that we did not go far enough on the usage of masks,â\u0080\u009d the executive said on Friday. â\u0080\u009cAt AMC Theatres, we think it is absolutely crucial that we listen to our guests. Accordingly, and with the full support of our scientific advisers, we are reversing course and are changing our guest mask policy.â\u0080\u009d AMC will continue to monitor the scientific communityâ\u0080\u0099s thinking on the efficacy of masks and will look at the varying case numbers around the country as it moves forward. It will make face masks available for a nominal price of $1.00 each. â\u0080¢ Apple Inc. AAPL, +1.74% Â was reported to be planning re-closures of some locations due to a resurgence in COVID-19 cases. The company is re-closing certain stores in Florida and Arizona, a CNBC report said. A tweet from Bloomberg said that the company would also be re-closing some stores in North Carolina and South Carolina. The company was among the first to temporarily close locations outside of China earlier this year, and it had been gradually reopening stores. Apple didnâ\u0080\u0099t immediately respond to a MarketWatch request for comment on its plans. The company is due to address developers beginning Monday at its annual WWDC developer event, which will be held virtually. â\u0080¢ Used-car retailer CarMax Inc. KMX, -1.02% Â posted better-than-expected sales for its first quarter, despite pressure from the pandemic. â\u0080\u009cMore than 80% of the days in the quarter were negatively impacted by a mix of store closures and limited operations,â\u0080\u009d the company said. Open stores were further impacted by occupancy restrictions. Same-store used-unit sales declined 42%. Sales have picked up since hitting a trough in early April, and same-store used-unit sales for the two weeks through June 14 were within 10% of last yearâ\u0080\u0099s sales. The company had $658 million in cash and $1.08 billion in unused capacity on its revolving credit facility, as of May 31 â\u0080¢ Bankrupt Hertz Global Holdings Inc.â\u0080\u0099s HTZ, -1.78% Â boardâ\u0080\u0099s finance committee determined it was â\u0080\u009cin the best interestsâ\u0080\u009d of the company to end the plan to sell newly issued stock. Hertz filed Monday to sell up to $500 million in shares that would potentially become worthless during the companyâ\u0080\u0099s restructuring. Hertz filed for bankruptcy on May 22. Earlier Thursday, the Wall Street Journal reported that Hertz was in talks with lenders to get a loan to fund its bankruptcy reorganization. â\u0080¢ Jones Lang LaSalle Inc. JLL, -0.77% Â has re-pened more than 75 offices in the U.S., or a little more than half of its portfolio, including its headquarters in Chicago. The real-estate management company is on track to reopen nearly 100 offices by the end of July. Internationally, JLL has opened 84 offices in the Asia Pacific region and 78 offices in the Europe, Middle East and Africa region. â\u0080¢ McDonaldâ\u0080\u0099s Corp. MCD, -0.43% Â plans to hire 260,000 workers in the U.S. this summer as states, and dining rooms, reopen amid the pandemic. McDonaldâ\u0080\u0099s has put more than 50 safety precautions in place including temperature checks for workers and social-distancing awareness signage in restaurants. Returning customers may also notice that some menu items are missing. Salads, bagels and yogurt parfaits are among 100 items that have been removed for the foreseeable future, according to the Wall Street Journal. The Chicago-based companyâ\u0080\u0099s menu changes are an effort to streamline efforts during the COVID-19 outbreak. â\u0080¢ Penn National Gaming Inc. PENN, -1.50% Â said 30 of its 41 gaming and racing properties have resumed operations after shutting down during the pandemic. That represents 70% of Pennâ\u0080\u0099s regional gaming portfolio in 13 of the 19 states in which it operates. The latest reopenings are at the companyâ\u0080\u0099s four Ohio properties, and in Pennsylvania at Hollywood Casino at Penn National Race Course. The company has implemented social distancing and safety protocols at its reopened properties, in line with the recommendations of health experts. â\u0080¢ Smith & Wesson Brands Inc. SWBI, +0.59% Â topped Wall Street estimates even as COVID-19 hurt sales of outdoor equipment. The company plans to complete its spinoff of American Outdoor Brands Corp. in August. The company changed its name back to Smith & Wesson during the quarter."}]}