{"article": [{"url": "https://www.marketwatch.com/story/fed-makes-its-last-stand-in-struggle-to-keep-potent-in-age-of-low-interest-rates-2020-09-17", "published": 1600419620.0, "headline": "Fed makes its last stand in struggle to keep potent in age of low interest rates", "body": "The Federal Reserve has said for some time that it didn’t want to become impotent with its policy rate stuck at zero. Now we know their plan of action to avoid this outcome. On Wednesday, the Fed rolled out of the final details of its new strategy, promising to allow inflation to overshoot its 2% target and setting a relatively strict criteria for the next interest-rate hike. One goal is to avoid past mistakes of tightening too soon to strangle a recovery, said Adam Posen, president of the Peterson Institute for International Economics. The Bank of Japan and the European Central Bank, both in the quicksand of zero rates, provide cautionary tales for the Fed. Low inflation can cause inflation expectations to drift down, pulling inflation lower. This pulls interest rates toward zero, giving central banks less room to support the economy in a future downturn. “We have seen this dynamic play out in other economies around the world, and we are determined to avoid it here in the United States,” Fed Chairman Jerome Powell said earlier this year. “ “We have seen this dynamic play out in other economies around the world, and we are determined to avoid it here in the United States.” ” — Fed Chairman Jerome Powell, on Jan. 29 A host of factors — mainly an aging population — have created a glut of savings that has pushed down global interest rates. These forces have hit Japan and Europe hard and their central banks are struggling to find ways to stimulate tepid economies. “This is why the Fed feels it has to try to avoid slipping into those situations,” said Michael Gapen, chief U.S. economist at Barclays. Ethan Harris,head of global research at Bank of America, agreed: “The Fed is taking these actions to avoid getting trapped in a permanent low-inflation world, so-called ‘Japanification.’” Although not in dire shape, the central banks in these two major economies have been unable to spur demand. “It is like the economy is never really out of the hospital, in a sense,” Harris said. Recap:Live blog of Fed’s decision day on Wednesday Prominent economists first suggested the Fed should raise its inflation target to a 3% or 4% annual rate to avoid the quicksand. But the Fed rejected this prescription, likely fearing a backlash from Congress. Instead, under the strategy revealed fully this week, the Fed has now pledged to hold rates between zero and 0.25% until the economy has reached maximum employment and inflation has risen to 2% and is on track to “moderately exceed 2% for some time.” Harris said the details of the strategy were kept vague and flexible so Powell could garner support from the members of the FOMC. Even so, there were two dissents. In the old days, this type of discretion for a central bank would have been viewed as highly inflationary, Posen said. “There are a dozen different indicators of unemployment and a dozen for inflation,” Posen said. The Fed also projects it won’t need to raise rates at least through the end of 2023. Roberto Perli, a former Fed staffer and now an analyst with Cornerstone Maco, thinks the Fed will be on hold until 2025. Read:Fed sets strict conditions for first rate hike Still, success for the Fed’s new strategy is not a given. “There is a high risk it doesn’t work,” said Harris. The COVID-19 pandemic will make the Fed’s goal of achieving higher inflation harder as wages are not expected to rise. “They will be quite lucky to hit the inflation target, let alone overshoot it in the next three years,” Harris said. The Fed had more credibility a decade ago to hit the 2% inflation target, Harris said. “Now the whole world is in a prove-it-to-me mode,” he added. The fact that there was no major move in financial markets DJIA, +0.56% SPX, +0.87% on Thursday as a result of the Fed’s new strategy is a bit of a disappointment for Powell, Posen said. In theory, if the Fed commits to not raise interest rates early next time, there should be a jump in inflation expectations. But that didn’t happen. “They are discovering, like the Bank of Japan and the ECB before it, that if the economy is going against you and you’ve undershot your inflation targets for years, even well-intentioned talk isn’t going to matter,” Posen added. “The U.S. feels like Europe felt like in the last cycle, when it couldn’t get inflation anywhere close to target, and their economy stumbled,” Harris said. While the Fed and Congress have poured trillions of dollars into the economy, it is still only operating at about “60%” of capacity and is vulnerable to policy mistakes, like the failure of another stimulus package from Congress, he said. “The current is running faster. The Fed is swimming a little faster but has lost some ground,” Harris said. “It is an open question on whether or not this works,” Gapen agreed. “I think the Fed is trying to say ‘we definitely want to try to avoid getting into a situation where we feel more permanently impotent.’” “We are fortunate that the U.S. economy appears to recover in a way to generate enough inflation where we don’t look like Europe and Japan yet, but there’s no guarantee that we’re just not a couple of cycles away from them,” he said."}]}