{"article": [{"url": "https://www.marketwatch.com/story/white-house-ends-payroll-tax-cut-bid-as-republicans-unveil-virus-aid-package-2020-07-23", "published": 1595502260.0, "headline": "White House ends payroll tax cut bid as Republicans unveil virus aid package", "body": "WASHINGTON (AP) — The White House has dropped a bid to cut Social Security payroll taxes as Republicans unveil a $1 trillion COVID-19 rescue package on Thursday, ceding to opposition to the idea among top Senate allies. “It won’t be in the base bill,” said Treasury Secretary Steven Mnuchin, speaking on CNBC about the payroll tax cut, killing the idea for now. The legislation, set to be released Thursday morning by Senate Majority Leader Mitch McConnell, R-Ky., comes amid alarming developments on the virus crisis. See also: ‘We want a stable dollar,’ says U.S. Treasury Secretary Mnuchin: ‘It is the reserve currency of the world and we’re going to protect that’ McConnell’s package is an opening GOP bid in talks with top Capitol Hill Democrats in a negotiation that could be rockier than talks in March that produced a $2 trillion rescue package. GOP senators and President Donald Trump are at odds over priorities, and Democrats say it’s not nearly enough to stem the health crisis, reopen schools and extend aid to jobless Americans. The Republican leader is expected to deliver a speech shortly after the Senate opens, and then senators will begin rolling out their separate parts of the package, according to a Republican granted anonymity to discuss the plans. The centerpiece of the GOP effort remains McConnell’s liability shield to protect businesses, schools and others from coronavirus-related lawsuits. The package is not expected to provide any new money for cash-strapped states and cities, which are clamoring for funds, but Republicans propose giving $105 billion to help schools reopen and $15 billion for child care centers to create safe environments for youngsters during the pandemic. But the GOP measure forges an immediate agreement with Democrats on another round of $1,200 checks to most American adults. The $600 weekly unemployment benefit boost that is expiring Friday will be reduced, likely to $200, and ultimately adjusted according to state jobless benefits rates. Some Republicans say the boost is a disincentive to work, but others prefer a phased approach. Some Republicans are pressing for a temporary extension of the current benefit if the talks drag. “We cannot allow there to be a cliff in unemployment insurance given we’re still at about 11% unemployment,” said Sen. Rob Portman, R-Ohio. The bill is likely to be silent on the potential housing crisis as a federal eviction moratorium on millions of rental units expires in days. One key holdup in the talks was Trump’s push for a payroll tax cut, according to a Republican granted anonymity to discuss the private talks. Hardly any GOP senators support the idea. Instead, McConnell and some other Republicans prefer the direct $1,200 cash payments to Americans. Sen. Marco Rubio, R-Fla., said there will be another boost for small business lending in the Paycheck Protection Program. “It’s going to be big,” he said. The bills will also include tax breaks for businesses to hire and retain workers and to help shops and workplaces retool with new safety protocols. The breakthrough on testing money was key after days of debate between Republicans and the White House. Republicans wanted $25 billion, but the Trump administration said the $9 billion in unspent funds from a previous aid deal was sufficient. The two sides settled on adding $16 billion to the unspent funds to reach $25 billion, senators said. There will also be fresh funds for vaccines. Of the $105 billion for education, Republicans want $70 billion to help K-12 schools reopen, $30 billion for colleges and $5 billion for governors to allocate. The Trump administration wanted school money linked to reopenings, but in McConnell’s package the money for K-12 would likely be split between those that have in-person learning and those that don’t. Democrats, who already approved House Speaker Nancy Pelosi’s more sweeping $3 trillion package two months ago, said the GOP infighting with Trump was delaying needed relief to Americans during the crisis. “We are just days away from a housing crisis that could be prevented,” said Sen. Elizabeth Warren, D-Mass. In their package, Democrats are calling for $430 billion to reopen schools, bigger unemployment benefits and direct aid checks and a sweeping $1 trillion for state and local governments. They also want a fresh round of mortgage and rental assistance and new federal health and safety requirements for workers. McConnell calls his proposal a “starting point” in negotiations with Democrats. Congress in March approved the massive $2.2 trillion CARES package, the biggest of its kind in U.S. history. The severity of the prolonged virus outbreak is upending American life. Schools are delaying fall openings, states are clamping down with new stay-home orders and the fallout is rippling through an economy teetering with high unemployment and business uncertainty. A new AP-NORC poll shows very few Americans want full school sessions without restrictions in the fall. Still, some Republicans said they are unlikely to approve any new aid. “I just don’t see the need for it,” Sen. Ron Johnson, R-Wis., told reporters on Wednesday."}]}