{"article": [{"url": "https://www.marketwatch.com/story/no-this-time-isnt-different-trust-cyclical-stocks-morgan-stanley-argues-2020-09-08", "published": 1599568700.0, "headline": "No, this time isnâ\u0080\u0099t different. Trust cyclical stocks, Morgan Stanley argues.", "body": "After a big runup through most of the year, broad stock indexes are likely to be â\u0080\u009crange-bound,â\u0080\u009d analysts at Morgan Stanley said in a recent note. That means that for all the discussion about investors sticking with broad index strategies, the only upside to be made now is in picking specific stocks. The correct picks, they say, will come down to trusting that the U.S. economy will heal, and opting for cyclical stocks â\u0080\u0094 those that stand to gain as economic activity picks up â\u0080\u0094 as well as â\u0080\u009crecovery stocks that have not yet reflected much of a recovery.â\u0080\u009d The Morgan Stanley analysts think a combination of falling 10-year yields TMUBMUSD10Y, 0.777% Â and rising earnings revisions have been driving stock prices higher through the summer. U.S. Treasury yields likely donâ\u0080\u0099t have any farther to fall though, they reckon, in large part because of the Fedâ\u0080\u0099s new policy targeting an â\u0080\u009caverageâ\u0080\u009d inflation rate, but forecasts for earnings over the next 12 months will continue to support stocks. The Morgan Stanley teamâ\u0080\u0099s forecast for is for 2021 earnings per share of $166 for S&P500 index companies, a higher estimate than consensus, but one that most Wall Street analysts are starting believe. If 2021 EPS forecasts start to rise over the next four months, what does it mean for the S&P 500 SPX, +0.87% Â ? Source: Morgan Stanley The midpoint of the range of most likely outcomes, 3425 for the S&P 500 index, is not far from current levels, the analysts point out. â\u0080\u009cWe suspect the rest of the year for equity investors will be about stock picking and getting the style shifts correct.â\u0080\u009d â\u0080\u009cWe continue to prefer cyclicals over defensives, small over large, and companies that can exhibit strong operating leverage to an ongoing recovery,â\u0080\u009d the analysts write. â\u0080\u009cIn short, we want to own stocks whose (next-12-month) EPS can rise more than our expected valuation decline.â\u0080\u009d One note that bolsters their argument: while the top-performing stocks in the year to date are the mega-cap technology stocks that have grabbed so much attention this year, the top gainers since the March 23 bottom for the S&P 500 index are anything but. Retailer L Brands Inc. LB, -0.98% Â is the biggest winner, rising 229% from the March nadir, followed by Halliburton Co. HAL, -1.79% Â , with a 205% increase, Freeport-McMoRan Inc. FCX, +2.56% Â with a 197% gain, Gap Inc. GPS, -0.10% Â , up 179%, and Whirlpool Corp. WHR, +0.60% Â , which has gained 162%. For stocks from cyclical sectors to outperform at this stage of the cycle wouldnâ\u0080\u0099t be unusual, the analysts note. In fact, thatâ\u0080\u0099s the pattern followed after every recession, as other market watchers have pointed out. Read next:Trees donâ\u0080\u0099t grow to the sky: tech stocks canâ\u0080\u0099t outperform forever, BCA Research argues"}]}