{"article": [{"url": "https://www.marketwatch.com/story/the-stock-market-would-love-a-democratic-sweep-in-november-2020-08-14", "published": 1597487720.0, "headline": "The stock market would love a Democratic sweep in November", "body": "The stock market has loved President Trump. His policies have been the major factor behind the market’s rise. Some people think that if there is a Democratic sweep in the November election, many of Trump’s policies will be reversed and taxes will increase. Based on that analysis, the stock market could fall about 20%. But for rare birds who attempt to rationally understand the stock market, it may come as a shocker that under one scenario the stock market may rise about 12% on a Democratic sweep. To understand this scenario, think of a party of drunkards where everyone loves a person who serves the most alcohol. At present, the stock market is behaving like a party of drunkards. The equivalent of alcohol is massive borrowing and money printing. Thus, the stock market is loving a potential Democratic sweep because Democrats will borrow more than Trump has. Prudent investors may be troubled. How would the borrowed money be paid back? Is there a limit to borrowing? Before I go further, I’d like to add that I am politically agnostic. My sole objective is to help investors. This isn’t a politically driven column. Trump policies The stock market has risen, in large part, due to the expansion of price-to-earnings multiples. That expansion is due to the following Trump policies: • Tax cuts for corporations. • Less regulation. • Jaw-boning the Federal Reserve to lower interest rates and to print more money. • Heavy borrowing by the government.Democratic sweep In theory, based on rational analysis, a Democratic sweep could send the stock market 20% lower. Please see, “The cost of Biden’s economic plan to the stock market is more than you might think.” After initial apprehension, the stock market is now loving a potential Democratic sweep. The reason is that the Democrats would borrow significantly more than Trump would. Democrats would increase taxes, and that would reduce earnings. For the longest time, the wisdom was that the single best determinant of the future of the stock market was earnings. Now earnings do not matter. It is the liquidity in the market that matters. More borrowing not only creates more liquidity, but also more spending. More spending may offset some of the hit to earnings by higher tax rates. What does it all mean? Prudent investors ought to follow the concept of protection bands. The high band of protection is appropriate for those who are older or conservative. The low band of protection is appropriate for those who are younger or aggressive. This is the only realistic way to protect yourself while taking advantage of the stock market bubble if it gets bigger. Disclosure: Arora Report portfolios have positions in Apple, Amazon, Alphabet, Microsoft and Facebook. Nigam Arora is the founder of The Arora Report, which publishes four newsletters."}]}