{"article": [{"url": "https://www.marketwatch.com/story/trump-newly-criticizes-michigan-gov-whitmers-covid-19-lockdown-on-day-militias-plot-to-kidnap-her-was-foiled-2020-10-08", "published": 1602239840.0, "headline": "Trump launches new attack on Michigan Gov. Whitmerâ\u0080\u0099s COVID-19 lockdown on same day a militia plot to kidnap her was foiled", "body": "President Trump tweeted Thursday night about the â\u0080\u009cterrible jobâ\u0080\u009d that Gov. Gretchen Whitmer is doing leading Michigan, just hours after an alleged plot by a militia group to kidnap the Democratic leader and attack the state capitol building was stopped and the alleged perpetrators arrested. Trump, who also remarked on the governorâ\u0080\u0099s lack of â\u0080\u009cthank youâ\u0080\u009d for action by the Department of Justice and law enforcement had not commented until the evening on Thursdayâ\u0080\u0099s arrests of 13 individuals in a militia whose actions some Americans said amounted to domestic terrorism. â\u0080\u009cGovernor Whitmer of Michigan has done a terrible job. She locked down her state [for COVID-19 protections] for everyone, except her husbandâ\u0080\u0099s boating activities,â\u0080\u009d the president tweeted. â\u0080\u009cThe Federal Government provided tremendous help to the Great People of Michigan. My Justice Department and Federal Law Enforcement announced today that they foiled a dangerous plot against the Governor of Michigan. Rather than say thank you, she calls me a White Supremacistâ\u0080\u0094while Biden and Democrats refuse to condemn Antifa, Anarchists, Looters and Mobs that burn down Democrat run cities...â\u0080\u009d He continued: â\u0080\u009cI do not tolerate ANY extreme violence. Defending ALL Americans, even those who oppose and attack me, is what I will always do as your President! Governor Whitmerâ\u0080\u0094open up your state, open up your schools, and open up your churches!â\u0080\u009d Critics noted Trump had called the DOJ â\u0080\u009cMy Justice Departmentâ\u0080\u009d in his tweet and later in a Fox News interview. Earlier in the day, Trump campaign senior adviser Jason Miller condemned the governor, who had tied Trumpâ\u0080\u0099s race rhetoric to the plot in earlier televised remarks. Miller suggested Whitmer â\u0080\u009cwakes up everyday with such hatred in her heartâ\u0080\u009d for Trump. Whitmer told CNN on Thursday night that sheâ\u0080\u0099s asked the White House and Republicans in her state to reduce the level of inflammatory rhetoric that she said helped spark the alleged plot. Read:â\u0080\u0098Wolverine Watchmenâ\u0080\u0099 militia group allegedly plotted to kidnap Michiganâ\u0080\u0099s Democratic governor, Gretchen Whitmer Whitmer put restrictions on personal movement throughout the state and on the economy to slow the spread of coronavirus cases, although many of those limits have been lifted. The Michigan Supreme Court last week said a 1945 law used as the foundation for many of the governorâ\u0080\u0099s orders is unconstitutional. In April, protesters and militia gathered at the state capitol for a rally, gridlocking the streets to call for Whitmer to lift the stay-at-home order. Michigan has reported 147,000 COVID-19 cases and 7,194 deaths. From the MarketWatch archives (April 30):Michiganâ\u0080\u0099s Republican-led House set to sue over governorâ\u0080\u0099s shutdown orders, as armed protesters enter statehouse One of those believed to be a leader of the â\u0080\u009cWolverine Watchmenâ\u0080\u009d group said he needed 200 men to storm the state capitol building in Lansing and take hostages, including the governor, according to the FBI. He said he wanted to try Whitmer for â\u0080\u009ctreasonâ\u0080\u009d and would execute the plan before the Nov. 3 election, the government said. The group later shifted to targeting the governorâ\u0080\u0099s vacation home, the FBI said. Just hours after the plot was revealed, some Republican lawmakers participated in a new anti-Whitmer rally at the capitol. Whitmer tweeted a response directly to the president Thursday night: iframe.twitter-tweet { width: 100% !important; } |"}]}