{"article": [{"url": "https://www.marketwatch.com/story/coronavirus-update-global-covid-19-cases-top-15-million-as-us-edges-closer-to-4-million-and-california-has-more-cases-than-new-york-2020-07-23", "published": 1595571200.0, "headline": "Coronavirus update: Global COVID-19 cases top 15 million, U.S. cases pass 4 million, and California has more cases than New York", "body": "The number of confirmed cases of the coronavirus illness COVID-19 worldwide climbed above 15 million on Thursday and the U.S. case tally passed 4 million, as California’s case tally rose above early U.S. hot spot New York following a surge in new infections in recent weeks. California now has more than 424,000 confirmed cases of COVID-19, compared with New York's 414,405, although New York’s death toll is still the highest in the nation at 32,270, according to a New York Times tracker. California is the most populous state in the U.S. with 40 million residents, or roughly double the population of New York. California set a record for number of cases in a single day on Wednesday at 12,162, and record number of deaths in a 24-hour period at 155. Missouri, North Dakota and West Virginia also tallied record case numbers and Alabama, Idaho and Texas recorded daily death records, the Times reported. On Wednesday, there were 59,628 Americans being treated for COVID-19 in hospitals, according to the Covid Tracking Project, closing in on the record of 59,940 set on April 15. California cases have been climbing since the state lifted its statewide lockdown in May and early June. Statewide, hospitalizations have nearly doubled in the past month to more than 7,100 patients, according to the Associated Press. Coronavirus patients in intensive care have risen 71% in that period to more than 2,000. Gov. Gavin Newsom and health officials have blamed the increase on people, especially younger people, gathering in groups and not wearing masks or maintaining social distancing. Newsom imposed new shutdowns at the end of June, closing bars and indoor dining, along with indoor malls and gyms. But officials caution it’s too early to say whether those measures will slow the spread of the virus. Los Angeles Mayor Eric Garcetti has warned the situation in LA has become so tenuous that a virtual lock-down may be needed. A day after President Donald Trump finally urged Americans to wear face masks and said the pandemic will get worse before it gets better, he undermined that message by saying he doubts the value of diagnostic testing in an interview with Fox News, calling it “overrated.” Health experts have consistently cautioned that testing, tracing and isolating contacts of infected patients are crucial in containing the spread of the deadly illness. Many state governors have lamented the lack of a national plan on testing and experts at Harvard University have said the U.S. is falling short of testing targets during the pandemic. See now: Maryland’s Republican governor slams Trump’s handling of coronavirus pandemic Related:New York Gov. Cuomo says President Trump has put politics above public health throughout pandemic Trump’s comments also undermined his own public health agencies. On Wednesday, officials at the National Institutes of Health unveiled a plan to ensure it has the capacity to provide up to 6 million diagnostic tests a day by year-end. The NIH established a Rapid Acceleration of Diagnostics program in April with $1.5 billion in stimulus funding, to focus on encouraging the development of point-of-care tests, in part by providing financial assistance to developers, and examining the role of home-based tests, biomarkers to identify an infection with the virus, and testing wastewater to understand the prevalence of the virus in a community. The Food and Drug Administration so far has granted emergency use authorization to 154 diagnostic tests, 31 antibody tests, and two antigen tests during the pandemic. Former FDA Commissioner Scott Gottlieb told MSNBC that testing demand will only continue to rise heading into the flu season. “Everyone who comes in with a febrile illness or a respiratory pathogen heading into the fall, or influenza, is going to have to be ruled out for COVID first,” he said. For now, testing is being hampered by the long delays in getting results, he said. About a quarter of the tests being conducted are point-of-care tests, and another quarter are hospital tests, both of which come back quickly. “It’s the other 50% that are run in the large commercial labs that are taking a lot of time because those labs are backed up,” he said. Those labs “literally can’t get the machines to expand their footprints,” he said. Gottlieb said data from the CDC this week that showed that the true tally of cases is far higher than expected suggests more of the same to come. “If you look what’s happening in Southern California right now, Texas, Arizona, Florida — there are indications perhaps that the epidemics in those states are starting to peak. It’s likely to be a long plateau. It’s not going to be like the New York experience, where there was a sharp up but a sharp down — granted, excess mortality, excess death and disease along the way. “But they came down pretty quickly from their epidemic. These are likely to be more extended, but, even when these states start to peak — if you look at the data, it looks like Georgia is getting hot, Ohio is getting hot, Missouri has an epidemic under way, Tennessee, Montana — so even as certain states start to peak and maybe have a reduction, other states are heating up.” Want to Know Where Covid-19 May Hit Next? Watch the Apple Store Closures Latest tallies There are now 15.3 million confirmed cases of COVID-19 worldwide and at least 625,005 people have died, according to data aggregated by Johns Hopkins University. At least 8.7 million people have recovered. The U.S. has the highest case tally at just over 4 million, or about a quarter of the total, and the highest death toll at 143,967. Brazil is next with 2.2 million cases and 82,771 deaths. India is third measured by cases at 1.2 million, followed by Russia with 793,720 and South Africa with 394,948. The U.K. has 298,721 cases and 45,639 fatalities, the highest in Europe and third highest in the world. China, where the illness was first reported late last year, has 86,026 cases and 4,649 fatalities.What’s the economy saying? The number of Americans seeking jobless benefits rose in the week ended July 18 for the first time since March, adding to concerns about the surge in new COVID-19 cases across the U.S. New applications for unemployment benefits, a rough gauge of layoffs, rose by 109,000 to 1.42 million, the Labor Department said Thursday, MarketWatch’s Greg Robb reported. The figures are seasonally adjusted. Economists polled by MarketWatch had forecast 1.41 million new claims. These figures reflect applications filed the traditional way through state unemployment offices. An additional 974,999 people sought benefits through a temporary federal-relief program. Claims had been trending down from a peak of 6.9 million in late March. Economists don’t expect much improvement in the labor market until the pandemic is contained. In addition, some companies that received Paycheck Protection Program funding could also be reducing payrolls. “To put these data in perspective, before the pandemic surge, the highest single weekly tally ever was 695,000 in 1982. Now, more than four months into the crisis, initial claims are still running at an astonishing 1.4 million per week. We continue to believe that after an initial period of sharp, but partial rebound as the economy reopens, the remainder of the process is going to be prolonged, and that the road back to February’s peak employment levels will be a long and bumpy one,” said Josh Shapiro, chief U.S. economist at MFR Inc. See also:Why Trump’s moves to limit immigration hurts U.S. companies and American jobs Separately, the Conference Board’s leading economic index increased in June but the pace of improvement has slowed, the Conference Board said Thursday. The index rose 2% in June following a revised 3.2% rise in May and a 6.3% drop in April. The gain in June reflects improvements brought about by the incremental opening of the economy, said Ataman Ozyildirim, senior director of economic research at the Conference Board. But, with the resurgence of new COVID-19 cases, the LEI suggests that the U.S. economy will remain in recession territory in the near term,” he added. The LEI is a weighted gauge of 10 indicators designed to signal business-cycle peaks and valleys. See:No stopgap to preserve $600 jobless benefit add-on, White House’s Meadows saysWhat are companies saying? Tesla Inc. TSLA, +1.89% surprised the market late Wednesday when it reported an adjusted profit for its second quarter, even though its main California plant was beset by coronavirus-related stoppages, as MarketWatch’s Claudia Assis reported. The number has set the electric car maker on course to join the S&P 500 index. SPX, +0.87% “Demand is not our problem,” Chief Executive Elon Musk told analysts on a conference call after the results. Most of the challenges, including some parts shortages, are related to supply-chain and production issues, he said. “Don’t worry about demand, that’s not the issue.” Tesla is not trying to be “super profitable,” Musk said, but rather it is focusing on maximizing growth and making electric cars that are affordable, he said. Read now: Elon Musk doesn’t want Tesla to be ‘super profitable’ as it soars toward a $300 billion valuation The second-quarter numbers were “very strong,” said Alyssa Altman, an auto-industry consultant with Publicis Sapient. “Tesla is showing the market they move fast, make quick decisions and are not afraid of failure,” she said. “They made bold choices to reduce costs while still launching a new model with all the challenges that go with a new model launch. In doing that, they are seeing success and confidence from the market. Any profit in this environment is good and shows resilience in uncertain times.” Microsoft Corp. MSFT, +2.48% announced record- breaking revenue for its latest quarter and profit that beat estimates. Microsoft has prospered during the pandemic as its Azure cloud-computing offering and cloud-software offerings have become more essential as its corporate customers sent employees home to work remotely. The legacy personal-computer business has also been hot, as companies and consumers replace equipment that is suddenly getting more use amid shelter-in-place restrictions due to the virus. Read:There’s growing evidence that Microsoft will overtake Salesforce in its core business within three years On Thursday, two other Dow Jones Industrial Average DJIA, +0.56% components presented their numbers. Insurer Travelers swung to an expected loss, reflecting higher catastrophe losses, lower net investment income and lower net favorable prior-year reserve development. “Our second quarter results reflect an improved underlying underwriting gain that was more than offset by a high level of catastrophe losses and, as expected, losses in our non-fixed income investment portfolio,” said Chief Executive Alan Schnitzer. Materials science company Dow Inc. swung to a narrower-than-expected loss and revenue fell less than expected. The company is planning cost cuts and will reduce its workforce by 6% as part of a restructuring aimed at increasing its expense reduction target to $500 million from $350 million. Elsewhere, American Airlines Group Inc. AAL, +0.34% and Southwest Airlines Co. LUV, +1.89% continued the streak of massive losses and cratering revenue that other airlines have reported. There was bad news for Ann Taylor parent Ascena Retail Group Inc. US:ASNA , when it filed for Chapter 11 bankruptcy protection, as the pandemic crushed the already troubled women’s clothing retailer. Here’s the latest news about companies and COVID-19: • American Airlines posted a big loss for the second quarter, as travel was decimated by the coronavirus pandemic. Revenue tumbled 86% to $1.622 billion from $11.960 billion, ahead of the FactSet consensus of $1.437 billion. “This was one of the most challenging quarters in American’s history,” CEO Doug Parker said in a statement. “COVID-19 and the resulting shutdown of the U.S. economy have caused severe disruptions to global demand for air travel.” The airline ended the quarter with $10.2 billion in available liquidity, after receiving bailout funds from the U.S. government and issuing $1.2 billion of debt. It expects to reduce 2020 capital expenditures by more than $15 billion, mostly due to cost cuts resulting from less flying. “Passenger demand and load factors have improved since bottoming out in April, but continue to be significantly below 2019 levels,” the airline said. “While May and June revenue trends were encouraging, demand has weakened somewhat during July as COVID-19 cases have increased and new travel restrictions have been put into place.” The company expects third-quarter system capacity to be down about 60% versus the year-earlier period. • Ascena Retail US:ASNA, parent of the Ann Taylor and Loft retail chains, filed for voluntary Chapter 11 bankruptcy, with a restructuring agreement supported by more than 68% of its secured term lenders, crushed by the effects of the pandemic on its already troubled business. The Mahwah, New Jersey-based company expects to reduce debt by about $1 billion in its pre-arranged restructuring, providing increased financial flexibility to become profitable. “The meaningful progress we have made driving sustainable growth, improving our operating margins and strengthening our financial foundation has been severely disrupted by the COVID-19 pandemic,” Interim Executive Chair Carrie Teffner said in a statement. “As a result, we took a strategic step forward today to protect the future of the business for all of our stakeholders.” • AutoNation Inc. AN, -1.70%, the new and used car retailer, reported a record second-quarter adjusted profit that was well above expectations and revenue that beat forecasts, helped by strength in its digital capabilities. New vehicle sales declined 18.4% to $2.26 billion to beat the FactSet consensus of $2.05 billion; used vehicle revenue fell 4.0% to $1.32 billion but topped expectations of $1.10 billion; and parts and service revenue dropped 23.5% to $689.9 million but missed expectations of $724.7 million. Same-store revenue fell 14%. “The COVID-19 pandemic has accelerated a shift in consumer behavior toward digital engagement,” the company said. • Chipotle Mexican Grill Inc. CMG, +0.01% topped Wall Street estimates, but declined to offer guidance because of the uncertainty caused by the pandemic. Revenue declined to $1.36 billion from $1.43 billion in the year-ago quarter. Same-store sales for the quarter declined 9.8%, while Wall Street had been expecting a decline of 11.5%. • Hershey Co. HSY, +1.47% beat profit estimates for the second quarter, as sales fell short in the coronavirus pandemic and declined to offer guidance. The chocolate maker expects sales to pick up in the second half, due to momentum exiting the second quarter. In North America, it expects elevated at-home consumption and the replenishment of retailer and distributor inventory levels to boost sales. Its international segment will continue to be pressured by less duty-free sales given current travel trends, government and macro trends. • Netgear Inc. NTGR, +3.13% reported strong second-quarter results as a result of increased demand as employees work from home during the pandemic. While the company said it expected strong demand for its Wi-Fi and other products to continue as employees keep working from home, it said it would not provide an outlook for the third quarter and for the full year due to the pandemic. • Quest Diagnostics Inc. DGX, +0.33%, a provider of diagnostic tests for the health care industry, reported a second-quarter profit that fell a lot less than expected, as the rapid expansion of COVID-19 testing helped revenue beat forecasts. The company reinstated its 2020 financial outlook, with guidance ranges for adjusted EPS of $6.60 to $8.60, compared with the FactSet consensus of $6.76, and for revenue of $8.0 billion to $8.6 billion, surrounding expectations of $8.25 billion. • Southwest Airlines swung to a large loss that was narrower than expected, as the drop in passengers demand wasn’t as bad as feared. The company’s bookings have slowed during July. Load factor fell to 31.4% from 86.4%, but topped expectations of 20.5%. “Thus far in July 2020, bookings for all months have softened; trip cancellations have increased modestly; and the rate of sequential monthly improvement for July revenue trends has slowed,” the company said. • Tractor Supply Co. TSCO, +0.47%, the rural lifestyle retailer, reported a second-quarter profit, net sales and same-store sales that rose above expectations and provided an upbeat outlook. Same-store sales growth of 30.5% beat expectations of a 21.6% increase. The increase in same-store sales was driven by “unprecedented demand” for spring and summer seasonal categories, and “exceptional growth” in everyday merchandise. For the third quarter, the company expects EPS of $1.15 to $1.35, net sales of $2.30 billion to $2.42 billion and same-store sales growth of 12.0% to 18.0%. That’s all above the FactSet consensus for EPS of $1.13, sales of $2.18 billion and same-store sales growth of 6.7%. • Insurer Travelers Companies Inc. TRV, +0.18% swung to a second-quarter loss that matched expectations, as net written premiums topped forecasts. The results reflect higher catastrophe losses, lower net investment income and lower net favorable prior-year reserve development. “Our second quarter results reflect an improved underlying underwriting gain that was more than offset by a high level of catastrophe losses and, as expected, losses in our non-fixed income investment portfolio,” said Chief Executive Alan Schnitzer • Dow Inc. DOW, -0.04% , the materials science company, swung to a narrower-than-expected second-quarter loss and reported revenue that fell less than expected, but also said it will cuts its workforce by 6% as part of a restructuring aimed at increasing its expense reduction target to $500 million from $350 million. The net loss was $225 million, or 31 cents a share, after a net income of $75 million, or 10 cents a share, in the year-ago period. The operating loss, which excluding non-recurring items such as integration and separation costs, the per-share loss was 26 cents, compared with the FactSet consensus for a loss of 28 cents. Sales fell 24% to $8.35 billion, above the FactSet consensus of $8.04 billion, as all three of its business segments beat sales expectations. • Twitter Inc. TWTR, -0.23% fell short of revenue expectations but saw a big surge in user growth. Twitter’s monetizable daily active users (mDAUs) increased sequentially by 20 million to 186 million for the June quarter, while analysts had been projecting about 172 million. “With a larger audience and progress in ads, we are even better positioned to deliver for advertisers when the live events and product launches that bring many people and advertisers to Twitter return to our lives,” Twitter Chief Financial Officer Ned Segal said. The company saw a “moderate recovery in advertising demand relative to the last three weeks of March.” • Whirlpool Corp. WHR, +0.60% reported earnings that topped Wall Street estimates and improved its sales outlook for the year. The company said North America sales, its largest segment, were less hurt than other regions were from the pandemic, and that there were early signs of demand recovery in June. Whirlpool said it expects full-year revenue to decline 10% to 15%, compared with a previous forecast range of a 13% to 18% decline. Additional reporting by Tim Rostan, Tomi Kilgore, Emily Bary, Tonya Garcia and Jaimy Lee"}]}