{"article": [{"url": "https://www.marketwatch.com/story/trumps-meeting-with-pharma-execs-called-off-as-analysts-say-his-moves-on-drug-prices-lack-bite-2020-07-28", "published": 1595938100.0, "headline": "Trumpâ\u0080\u0099s meeting with pharma execs called off, as analysts say his moves on drug prices lack bite", "body": "Analysts are dismissing President Donald Trumpâ\u0080\u0099s recent executive orders aiming to lower drug prices, as his meeting with major drug company executives was no longer set to happen on Tuesday as planned. â\u0080\u009cTrumpâ\u0080\u0099s executive orders on drug pricing are largely campaign fodder as each contains limitations or caveats, and is subject to further action,â\u0080\u009d said Kim Monk, a Capital Alpha Partners analyst, in a note. Other analysts offered similar takes. â\u0080\u009cThe EOs are likely aimed at bolstering the presidentâ\u0080\u0099s support among voters on health-care policy and come without the necessary force to meaningfully change prices in the U.S.,â\u0080\u009d wrote Hunter Hammond, a Height Capital Markets analyst. He also described the orders as â\u0080\u009clargely toothless.â\u0080\u009d The presidentâ\u0080\u0099s move with the orders â\u0080\u009cyet again shows Trump is all bark, no bite on drug pricing. A louder bark doesnâ\u0080\u0099t make the bite any harder,â\u0080\u009d said Chris Meekins, a Raymond James analyst, in a note. In unveiling the orders on Friday, the president said pharmaceutical industry execs â\u0080\u009cwill be at the White House on Tuesday, and they have some ideas how to significantly reduce drug prices.â\u0080\u009d â\u0080\u009cIf these talks are successful, we may not need to implement the fourth executive order, which is a very tough order for them,â\u0080\u009d added Trump, who is currently trailing Democratic challenger Joe Biden by 9 points in a RealClearPolitics average of national polls focused on Novemberâ\u0080\u0099s presidential election. But the meeting was no longer scheduled to take place on Tuesday, and the pharmaceutical industryâ\u0080\u0099s main trade group has been criticizing Trump. â\u0080\u009cAn executive order to implement price controls from health systems abroad is a reckless & dangerous distraction from beating #COVID19,â\u0080\u009d said a tweet on Monday from the Pharmaceutical Research and Manufacturers of America, also known as PhRMA. â\u0080\u009cOur focus needs to be on fighting #COVID19, not policies that jeopardize innovation and threaten the hope of progress toward a vaccine.â\u0080\u009d From the archives:Drugmakersâ\u0080\u0099 lobbying spending at 10-year high as Washington targets soaring prices And read:Pelosiâ\u0080\u0099s drug-pricing bill passes House, but pharma stocks are up as itâ\u0080\u0099s unlikely to become law Pharma stocks, as tracked by the Invesco Dynamic Pharmaceuticals ETF PJP, +0.30%, are higher by 1.6% so far this week after falling by 1.6% on Friday. They have gained 2% this year, while the broad S&P 500 index SPX, +0.87% Â is up just 0.2% in 2020."}]}