{"article": [{"url": "https://www.marketwatch.com/story/treasury-yields-edge-higher-as-investors-eye-data-debt-auction-11599739946", "published": 1599753140.0, "headline": "U.S. Treasury yields slide as traders get past last bond auction of week", "body": "U.S. Treasury yields fell Thursday after investors managed to take down the last auction of the week, making up for the lack of interest in previous auctions this week. The strong showing by buyers at the sale helped to spur higher bond values, erasing the earlier weakness at the start of the session.What are Treasurys doing? The 10-year Treasury note yield TMUBMUSD10Y, 0.777% fell 1.9 basis points to 0.684%, after hitting an intraday high of around 0.72%, while the 30-year bond yield TMUBMUSD30Y, 1.576% slid 2.2 basis points to 1.435%. The 2-year note rate TMUBMUSD02Y, 0.156% was steady at 0.139%. Bond prices move inversely to yields. What’s driving Treasurys? Supply ended up dictating trading for Thursday, with bond buyers digesting a $23 billion of U.S. Treasury 30-year bonds in the afternoon. The better-than-expected demand eased concerns that Treasurys had not cheapened enough this week to draw the interest of market participants, following two poor auctions earlier this week. Analysts also dug into data on the U.S. labor market and price pressures. Initial jobless benefit claims for the latest weekly period ending in Sept. 5 held steady at 881,000, suggesting further improvements in the employment picture may be flagging. Meanwhile, continuing jobless claims, or the number of people already receiving benefits, rose by 93,000 to a seasonally adjusted 13.39 million in the seven days ended Aug. 29. It was the first increase in five weeks. Producer prices in the U.S. rose 0.3%, slightly higher than the consensus estimate. As expected, the European Central Bank kept its key interest rates unchanged and the size of its monthly net asset purchases at €20 billion. ECB President Christine Lagarde did not offer much detail on the central bank’s outlook around the eurozone recovery, The 10-year German government bond yield TMBMKDE-10Y, -0.521%, a proxy for the eurozone debt market, rose 3 basis points to negative 0.43%. What did market participants’ say “There’s definitely an anchor on the lower-end of the yield curve because of the Fed. But I could see the curve marginally steepening a bit more. My guess is we’re pretty much going to stay where we’re at until we get into 2021,” said Max Gokhman, head of asset allocation at Pacific Life Fund Advisors, in an interview."}]}