{"article": [{"url": "https://www.marketwatch.com/story/wall-streets-rally-threatened-by-shroud-of-uncertainty-as-fresh-coronavirus-threats-to-economic-recovery-emerge-2020-06-20", "published": 1592733320.0, "headline": "Stock-market's rally threatened by shroud of uncertainty as fresh coronavirus threats to economic recovery emerge", "body": "The stock-market's ability to chug steadily higher despite uncertainty about how the economic recovery might shape up, and when the U.S. will bring the COVID-19 pandemic under control in all 50 states, is making some investors nervous. The worry is that the market's gains are standing on a precarious foundation of support from fiscal and monetary policymakers, while waiting for consumer and business spending to recover. \"It's not like the market has ignored those concerns. It's just that the massive Fed 'put' being as broad as it is, affecting more asset classes than they ever have, means investors can take comfort in the stimulus,\" said Marvin Loh, senior global macro strategist for State Street. Since the lockdowns of business and consumer activity to combat the coronavirus pandemic in early March, the Federal Reserve's balance sheet has swelled to over $7 trillion through buying everything from U.S. Treasuries to corporate bonds and mortgage backed securities, providing a backstop for financial markets analogous to the insurance provided by the purchase of a put option by an investor. In addition, the U.S. Congress approved the largest economic stimulus package in history which is forecast to increase the fiscal deficit to about $3.7 trillion or 18% of gross domestic product this year, according to the Congressional Budget Office. \"There's enough liquidity in the system to get people to eventually buy the bounce,\" said Loh. Meanwhile, a round of better-than-expected U.S. economic data recently suggested a recovery is already on the way, helping the stock-market bulls overcome the naysayers, for now. Retail sales surged a record 17.7% in May, while industrial production gained by 1.4% and 2.5 million jobs were added back, lowering the unemployment rate to 13.3%. Investors may be taking too much comfort in government and central bank stimulus efforts, however, and ignoring the long climb ahead for the U.S. economy. Nearly half of U.S. states are still seeing daily increases in coronavirus infections, especially Florida, Arizona and Texas, as business and social activities resume. The U.S. has the highest case toll in the world at 2.17 million and the highest death toll at 118,435, according to data aggregated by John Hopkins University as of Friday. As a result, Apple Inc. AAPL, +1.74%  said Friday it would re-close 11 stores in Florida, the Carolinas, and Arizona starting on Saturday and the Cruise Lines International Association announced a voluntary suspension of operations from U.S. ports until Sept. 15, leading to a lower close for U.S. stocks on Friday. The World Health Organization at a Friday briefing also said that the coronavirus pandemic has entered a \"new and dangerous phase\". But investors perceive a lack of will among local and state governments to reinstate lockdown measures, keeping efforts to reopen the economy on track. See: 'La la land?' The stock market is 'insanely disconnected' and due for a 'reckoning,' Warren Buffett buff warns Uncertainties still loom as a result, said State Street's Loh, who worries that though pent-up demand could see consumers opening up their wallets in the short term, it was unclear if a rebound in spending could be sustained if a large swathe of the population still chooses to stay indoors and hold back consumption over fears they may catch the virus. And the latest round of weekly jobless claims showed the number of people who are actually receiving traditional jobless benefits barely fell to 20.54 million in the week ended May 30. These so-called continuing claims, reported with a one-week lag, had peaked in the middle of May at nearly 23 million, but are declining at an agonizingly slow pace. All this uncertainty means investors should expect short-term dips in the stock-market as they did earlier this month when worries about a re-acceleration of the pandemic's trajectory contributed to a ferocious, but short, selloff on June 11 after the S&P 500 SPX, +0.87%  and Dow Jones Industrial Average DJIA, +0.56%   had briefly erased their losses for the year. \"It does seem that the market is 'pricing in perfection,'\" said Kevin Philip, managing director at Bel Air Investment Advisors, in e-mailed remarks. \"Any near-term disappointment in economic indicators, therapies for COVID-19, or a longer timeline for a possible vaccine could swiftly shift market sentiment.\" Yet since the June 11 selloff, equities have sauntered higher, taking both the Dow and S&P 500 up nearly 40% above their late March lows, but still leaving S&P 500 down 4.1% year-to-date and the Dow down 9.4% over the same stretch. The stock-market recovery based on government and central bank aid and some improvement in economic data reflects the tendency for investors to eschew factors they don't know how to handicap, like the unquantifiable epidemiological risks, in favor of \"more familiar and easily observable factors,\" wrote Joachim Fels, global economic adviser for bond fund manager Pimco, in an outlook article published earlier this week. Indeed, Takahide Kiuchi, executive economist at Nomura Research Institute and a former member of the Bank of Japan's policymaking committee, says the health-related nature of the economic shock made it more difficult for analysts to forecast when the U.S. and other developed economies would return to their pre-COVID state, adding that he personally expected this process to take a few years. \"I feel the market is too optimistic and understates the uncertainty of the future,\" said Kiuchi, in e-mailed comments. Reflecting those doubts, staff economists at the Federal Reserve thought there wasn't much daylight between the probability of a baseline scenario in which easing social restrictions allowed economic growth and labor markets to recover and the most pessimistic scenario. See: Fed's Rosengren expects economic rebound this year 'to be less than was hoped for' Looking ahead for next week, markets are fast approaching the next corporate earnings reporting season for the second quarter. Analysts are estimating profits for S&P 500 constituent companies to fall by 43.8%, which would mark the largest year-over-year decline since the fourth quarter of 2008, according to FactSet data. Economic data in the week ahead could also give clues the state of the consumer, the engine of U.S. growth, when the Department of Commerce releases May's update of personal income and outlays. Last month's existing and new home sales could show if home purchases were on the rebound, amid data showing that mortgage applications were rising."}]}