{"article": [{"url": "https://www.marketwatch.com/story/stock-market-selloff-why-its-too-early-to-call-tech-rout-the-start-of-a-correction-2020-09-03", "published": 1599309920.0, "headline": "Stock-market rout: Why it's too early to call tech plunge the start of a correction", "body": "Big rallies often come to an ugly end - and that was certainly the case Thursday for tech stocks and other high-flying sectors that have benefited from momentum-driven waves of buying. But that doesn't mean a full-fledged correction for the most popular stocks - or the broader market - is under way. \"It's very difficult to say definitively that something that is up 28% on the year and up [more than 70%] from the bottom going down 4% is a sustainable correction,\" said David Bahnsen, chief investment officer at Newport Beach, Calif.-based The Bahnsen Group, referring to the tech-heavy Nasdaq Composite Index COMP, +1.39% COMP, +1.39%. While a potentially brutal Nasdaq correction is likely inevitable, there's no \"formulaic\" way to tell when one has started, he said in an interview. Key Words: Is this 'the beginning of the end?' Billionaire Bill Ackman shares his thoughts on the big market retreat By the close, the Nasdaq was down 5%. The S&P 500 SPX, +0.87%  fell 3.5% and the Dow Jones Industrial Average DJIA, +0.56%  ended the day down more than 800 points, or 2.8%, after falling more than 1,000 points at its session low. The drop marked the biggest one-day percentage declines for all three benchmarks since June, and ended a four-day winning streak for the Nasdaq and a 10-day string of gains for the S&P 500 tech sector. See:These were the biggest stock-market losers on Thursday as tech shares tanked Warning signs abounded as technology shares kept pushing higher, market watchers said. Options volatility remained stubbornly high even as stocks continued to rally - a sign of nervousness - and tech valuations, while a poor guide to market timing, became increasingly stretched, said Fawad Razaqzada, analyst with ThinkMarkets, in a note. Related:Tech stocks and the rest of the market are both very expensive - for 2 'completely different reasons' Also, momentum indicators, such as the relative strength index, were at levels perceived as extremely overbought on major indexes, which meant that \"even the most bullish speculators chasing momentum would have found it difficult to justify buying at such extreme levels,\" he said. The selloff could be an indication of things to come, \"where fundamentals play a larger part in valuations, as opposed to the irrational exuberance that has persisted in recent months within tech,\" said Peter Essele, head of portfolio management for Commonwealth Financial Network. Essele said the lack of a broad selloff across all sectors showed that \"hot money\" had been chasing large tech names. Indeed, the lack of heavier selling outside the most high-flying sectors pointed to signs of rotation, a positive sign for the overall market, Bahnsen said. While the Dow fell more than 800 points, shares of JPMorgan Chase & Co. JPM, -0.57%, the world's largest bank, declined only 0.3% and shares of Exxon Mobil Corp. XOM, -1.47%, the world's largest oil company, lost only 0.2% after spending much of the day in the green. All 11 S&P 500 sectors fell, but energy shares lost only 0.6% and financials declined 1.6% - both are among the most out of favor in 2020, down nearly 43% and 19% year to date, respectively. Down days where you see energy and financials holding up despite steep losses elsewhere indicates rotation, not capitulation, a bullish sign overall, Bahnsen said. Also, in the era of heavy ETF ownership, when a fund needs to sell off Apple shares, shares of companies that don't have organic selling pressure get pulled down with them, he said. So now what? Friday's session already carried the potential for volatility, coming ahead of a three-day holiday weekend and after investors get a look at the July jobs report. Economic Preview: U.S. likely added 1.2 million jobs in August, economists say, but hiring has slowed Investors might have second thoughts about technology shares at still-elevated levels, Razaqzada said, which could make for either increased rotation into lagging sectors, pushing tech stocks into a period of consolidation or beginning a proper correction."}]}