{"article": [{"url": "https://www.marketwatch.com/story/new-lockdowns-ordered-in-new-york-neighborhoods-with-surge-of-coronavirus-cases-2020-10-06", "published": 1602010220.0, "headline": "New lockdowns ordered in New York neighborhoods with surge of coronavirus cases", "body": "COVID-19 hotspots in New York City and throughout the state will face new restrictions because of rising infection rates, Gov. Andrew Cuomo announced Tuesday. Nonessential businesses in COVID-19 clusters will be closed, restaurants limited to takeout only and religious gatherings will be capped at a maximum of 10 people, or 25% capacity, in the areas with the highest infection rates, the governor said in an afternoon news briefing. Areas outside the clusters, most of which are in Brooklyn and Queens, will also see some restrictions. Mass gatherings in clusters—called “red zones,” which are determined by testing data and mapping software—are also prohibited. “A mass gathering causes infections, infections cause a cluster, a cluster causes community spread,” the governor said, who noted that hotspots can be found in Brooklyn, Queens, New Rochelle, Binghamton and Orange and Rockland counties. “That is the natural evolution of things unless we intervene.” Clusters have already resulted in public and private schools across nine ZIP Codes in New York City suspending in-person learning on Tuesday. Clusters have been identified in neighborhoods such as Midwood and Borough Park, Brooklyn, and Kew Gardens, Queens. Mayor Bill de Blasio on Sunday proposed a plan to control the clusters in those ZIP Codes, including closing nonessential businesses. “We are prepared to implement as soon as [Wednesday],” the mayor said at a news briefing Tuesday morning. Also see: As Trump tweets false flu claims, here are the facts about the ‘twindemic’ that could be coming Cuomo gave a Friday deadline for restrictions to be put in place. The clusters and lesser impacted areas around them are “relatively small geographically...the trick is to keep it small,” he said. Earlier this year, the state issued guidance on essential businesses, defining them as those related to health care, retail such as grocery stores and pharmacies, restaurants offering takeout only and other services. The average rate of positive tests is 5.5% in the top 20 ZIP Codes in counties with recent outbreaks, according to the state. The rate of positive tests for the remainder of New York, not counting these 20 ZIP Codes, is 1.2%. Beyond the red zone clusters, the immediately surrounding neighborhood is an orange zone, with the outlying area classified as a yellow zone. In orange zones, worship will be limited to 25 people or 33% capacity, mass gatherings will be capped at 10, high-risk nonessential businesses like gyms will close and only outdoor dining will be permitted. For yellow zone areas, religious services can proceed at 50% capacity with mass gatherings capped at 25. Businesses will remain open. Schools will be closed in red and orange zones, and weekly testing will be mandated in the yellow areas, Cuomo added. It’s not clear how long the restrictions will be in place, according to de Blasio. It may be a “matter of weeks, but everyone has to participate,” he said. “If we all do this right...then we reopen in those places and keep moving forward. If we do it wrong, it will keep spreading into surrounding ZIP Codes.”Other New York coronavirus developments: Fines for holding mass gatherings have been increased to $15,000, according to the governor. New Mexico has been added to New York state’s COVID-19 travel advisory. People coming to New York from regions on that list, deemed to have significant community spread, are required to quarantine for 14 days. Coronavirus update: U.S. death toll tops 210,000 as doctors say Trump’s comments on COVID-19 are sending the wrong message"}]}