{"article": [{"url": "https://www.marketwatch.com/story/my-parents-are-in-their-50s-and-60s-and-unprepared-for-retirement-how-can-i-help-them-help-themselves-2020-08-05", "published": 1601731700.0, "headline": "My parents are unprepared for retirement â\u0080\u0094 how can I help them?", "body": "Dear MarketWatch, I have a question about planning retirement for both me and my husband, as well as our parents. His parents are a bit more prepared for their retirement, but my parents arenâ\u0080\u0099t as prepared. They have 401(k) plans but it doesnâ\u0080\u0099t seem like the amount within those 401(k)s is actually enough. How can kids prepare for their parentsâ\u0080\u0099 retirement, and should we be helping to set aside money not just for our own retirement but also for our parents? If our parents are already in their late 50â\u0080\u0099s to mid 60â\u0080\u0099s is there anything they can still do at that age to better prepare for retirement? Sincerely, Concerned Daughter See: Iâ\u0080\u0099m 63, a widow and lost my job because of COVID. I donâ\u0080\u0099t have much in savings and feel lost. What can I do? Dear Concerned Daughter, Your parents and in-laws are so lucky to have someone who worries about their future financial security. The truth is, youâ\u0080\u0099re right to be concerned. Without adequate planning and preparing, your loved ones could end up ill equipped for their old age, which would affect not only their lifestyle and comfort in the future, but potentially yours as well. â\u0080\u009cIn order for adult children to properly create their own financial path, itâ\u0080\u0099s so important to understand whether financial support for their parents will be a part of that path,â\u0080\u009d said Jake Northrup, financial adviser and founder of the advisory firm Experience Your Wealth. That they have 401(k) plans to begin with is great. To see if what they have is enough, or how much more they may need, you should have them figure out their current income, their total assets, their guaranteed sources of retirement income (like Social Security or a pension) and what theyâ\u0080\u0099re spending is like now (as well as what they anticipate their spending to be like in the future). This should include housing, groceries, utilities, health care costs, taxes, leisure and anything else important to them. They may need to downsize their housing or trim their expenses to help balance how much theyâ\u0080\u0099ve saved now with how much theyâ\u0080\u0099ll need in the future. And as theyâ\u0080\u0099re doing these calculations, they may learn whether they could maximize their current savings, or come up with a plan to earn more if possible. Itâ\u0080\u0099s like a financial health check-up, if you will. Talking about retirement planning and future financial security or health can be difficult, especially with parents who may become uneasy or defensive (and they may â\u0080\u0094 they want to take care of you, not have you worry about taking care of them). Still, itâ\u0080\u0099s one of the most important conversations you can have to ensure theyâ\u0080\u0099re at least thinking of ways to live comfortably in their old age, and so that you can know where you fit into that equation as well. Because if you are part of their plan, youâ\u0080\u0099ll need to budget for it. Youâ\u0080\u0099re already doing something to help them â\u0080\u0094 youâ\u0080\u0099re talking about it before they actually transition to retirement. â\u0080\u009cIn my experience both as a daughter and a planner, the best thing you can do is have the conversations early before itâ\u0080\u0099s too late,â\u0080\u009d said Laurie Allen, founder of LA Wealth Management. Her father was reluctant to share information about his finances with her, and when she finally did gain access, it was â\u0080\u009cutter chaos,â\u0080\u009d she said. She and her four siblings now help their father and his wife with housing, food and car payments. â\u0080\u009cIn our household, it ended up being a line item we had to budget in as we planned for our own future,â\u0080\u009d she said. The good news: Your parents, especially those still in their mid-50s, are still young and have time before they reach a traditional retirement age. The conversations you have now could really help all of them. Broaching the topic may be the hardest part, but there are ways around that. You can start the conversation talking about yourself and how you and your husband are figuring out your finances and thinking about your own old age, and then use that to transition to talking about them, their retirement plans and their estate documents, said Howard Pressman, partner at EBW Financial Planning. â\u0080\u009cUnfortunately, I have seen people having to work through significant problems and the anxiety and stress that comes with it, because simple documents were not in place,â\u0080\u009d Pressman said. â\u0080\u009cOften, this non-threatening conversation leads to larger conversations that can be very helpful for families.â\u0080\u009d You may even want to bring an actual financial planner into the discussion, if thatâ\u0080\u0099s an affordable or available option to you. â\u0080\u009cThe conversation will likely be awkward, but a financial planner can act as a â\u0080\u0098scapegoatâ\u0080\u0099 or â\u0080\u0098excuseâ\u0080\u0099 for having the conversation,â\u0080\u009d Northrup said. If youâ\u0080\u0099re talking to your parents one-on-one, there are a few questions you can ask, including: Do you have a budget? How do you manage your investments? What are your plans for health insurance until Medicare kicks in? Do you expect us to help you in retirement in any way, such as financially or physically? Do you plan to live with us? Do you have any concerns about your retirement, and what are they? â\u0080\u009cThese probing questions will uncover planning gaps allowing children to step in and assist if desired,â\u0080\u009d said Charles Adi, founder of the advisory firm Blueprint 360. â\u0080\u009cAssistance can look like monthly cash payments, investment management help or the purchase of the needed insurance coverage.â\u0080\u009d When they claim Social Security will also help. Individuals can begin claiming at 62, but their benefits would be reduced until their Full Retirement Age (they can check what their FRA is here). If they plan to work well into their 60s, they may be able to delay when they claim their benefits â\u0080\u0094 the longer they wait, the more they get. If they hold off on claiming until after their FRA, theyâ\u0080\u0099ll get even more money than theyâ\u0080\u0099re owed. Social Security was not meant to be the only source of retirement income for Americans, but it will certainly help offset any savings deficiencies. There are a few other considerations they can make. Long-term care insurance is a viable option, especially if they donâ\u0080\u0099t have many health concerns right now. The younger and healthier the individual, the lower the premium (itâ\u0080\u0099ll get expensive the closer they get to â\u0080\u009cold ageâ\u0080\u009d). Long-term care covers a personâ\u0080\u0099s health expenses when they are no longer able to care for themselves, such as bathing, feeding or moving around the house. It is also used to pay for nursing homes or assisted living facilities, which could cost thousands of dollars a month. Donâ\u0080\u0099t miss: Health care will cost this much in retirement â\u0080\u0094 but probably even more â\u0080\u009cA medical event that requires long-term care can decimate household finances by tens of thousands, or even hundreds of thousands of dollars per year,â\u0080\u009d said Karen E. Van Voorhis, director of financial planning at Daniel J. Galli & Associates. In some scenarios, adult children have paid the premium for their parents to ensure their finances arenâ\u0080\u0099t â\u0080\u009cdemolishedâ\u0080\u009d by the health care expenses, though of course it would be ideal if your parents could pay for it themselves. Even if paying for this type of coverage is not possible, having a plan in place for what to do in the event of a medical emergency or illness in the future would help. â\u0080\u009cWhether it is using an insurance company to help with the risk or if they choose to self-insure, plans should be made well in advance,â\u0080\u009d said Michael Resnick, senior wealth management adviser at GCG Financial. Think about the type of care they may need, who the caregiver would be (professional or familial), how it would be paid for and other living arrangements. They should also have a few crucial documents in order, including a power of attorney, a will and a health proxy, which will spell out their wishes for their health care should they become incapacitated as well as where their belongings go. There are websites and apps to help people store their necessary documents and requests. This can be done even during the current pandemic, which may be the best time to update their last wishes and get paperwork in order. The paperwork should also include a list of digital assets, such as passwords to online accounts, Resnick said. If you have siblings or any other family members who can help, this is a good time for you all to discuss your own plans about your older loved onesâ\u0080\u0099 well-being. Unfortunately, one of the major arguments siblings have involves how to care for mom and dad physically and financially. It may not be a pleasant few hours (or days), but getting the gears turning now is better than waiting until an emergency or unfortunate event occurs. Also see: How to talk to your family about your estate plan Throughout all of this, donâ\u0080\u0099t forget to take care of yourself and your familyâ\u0080\u0099s plans for your own retirement. Even if retirement isnâ\u0080\u0099t for a few more decades, try to stash away as much money in a retirement plan as possible. You should also have an emergency fund for unexpected scenarios. After talking to your parents about their realistic retirement plans, you may decide to open another account earmarked for them, which could give you some comfort in the event they have an emergency situation one day. It comes down to communication. You want your parents to be comfortable and secure in their old age, but you need to balance that with your own soundness. Having these conversations may not be easy, and they may take weeks if not months of back-and-forth, but theyâ\u0080\u0099ll be worth every second later in life. â\u0080\u009cIf you have a parent that has always done everything on their own, they may be stubborn to accept help at first,â\u0080\u009d said Mackenzie Richards, a financial planner at SK Wealth Management. â\u0080\u009cHowever, itâ\u0080\u0099s very likely that they are concerned with their own financial picture and could use assistance.â\u0080\u009d Have a question about your own retirement savings? Email us at HelpMeRetire@marketwatch.com"}]}