{"article": [{"url": "https://www.marketwatch.com/story/a-binge-bulge-or-just-the-new-normal-for-corporate-america-as-fed-helps-spur-string-of-records-11597339195", "published": 1597325240.0, "headline": "A binge? Bulge? Or just the new normal for debt in America as Fed helps spur string of records", "body": "Philip Toscano/Zuma Press Lower for longer. No, that’s not Federal Reserve Chairman Jerome Powell renewing his familiar vow to keep benchmark interest rates near zero well into future. It’s also the mantra of the biggest part of the $9.8 trillion U.S. corporate debt market in the months since the Fed stepped in with its support to keep credit flowing during the pandemic. As part of the Fed’s “do whatever it takes” policy, the central bank started buying up corporate debt for the first time ever in May, with a focus on investment-grade assets. It spurred a dramatic rally in bonds issued by U.S. companies, even though its own stake was only $3.6 billion at the end of July, and its daily pace of purchases recently slowed to a trickle. Specifically, the closely watched ICE BofA US Corporate Index yield fell to 1.87% in the past week, a new low for the record books, or at least since about December 1996 when the index started tracking the performance of America’s corporate debt load. Yields fall as bond prices rise. For context, the investment-grade portion of the corporate bond index had been hovering below 4.5% for much of the past decade, after touching an all-time high of 9.23% in October 2008 in the wake of the global financial crisis. What that’s meant is that companies over the past decade not only borrowed in droves, and cheaply, in the bond market, but also tapped its financing powers for longer periods than ever before. The pandemic only accelerated the activity, with bond issuance in the investment-grade corporate bond market hitting a record $1.4 trillion, or a 74% increase from a year ago, according to BofA Global data. This chart from UBS shows the duration of the investment-grade bond market hitting a new high of 8.4 years at the end of July, when yields dipped below 2% for the first time ever. In other words, corporate debts will take longer to repay and return less to investors serving as their creditors, even though the pandemic has derailed earnings at many companies. As a sign of the times, Marriott International Inc. MAR, -0.96%, the world’s largest hotel company and one of several major chains that furloughed workers and slashed staff at the onset of the pandemic, was able to borrow $1 billion at a 3.57% yield in the bond market on Wednesday through the sale of 12-year debt rated Baa3 by Moody’s and BBB- by S&P Global, or on the cusp of falling into the “high-yield” or junk-bond category. Hotels have been one of the hardest-hit industries by the pandemic and the financing comes on the heels of Marriott reporting a bigger-than-expected 72% drop in revenue in the second quarter and an occupancy rate of 31% in July across its chains globally. Arne Sorenson, Marriott’s president and CEO, said that while “folks are increasingly willing to step out and travel a bit more,” decisions by “big, big companies” to keep their offices closed for as much as the next year has been “frustrating to us,” because that’s “just sort of withdrawing from the economy,” during the company’s recent earnings call. At the same time, some return on bonds is better than none. “Yields are low everywhere, that doesn’t really tell you a lot,” said Greg Peters, head of multisector and strategy at PGIM Fixed Income, adding that Germany’s 10-year government bonds TMBMKDE-10Y, -0.521%, and a host of others currently trade below zero. At last check, the tally of global debt pegged at negative yields was near $16.6 trillion, up from $7.7 trillion during the worst of the February to March swoon sparked by the coronavirus pandemic, according to SunTrust data. Peters thinks the current, low rate environment can either help or hurt, namely because it does allow companies to borrow cheaply to shore up their liquidity needs during the coronavirus crisis, thus making them less prone to default. But investors also have been buying bonds at low returns with the expectation that after riding out the storm, corporations will see earnings return, and that they’ll take a more conservative stance to leverage and pay down their debts. “The risk in all this is that it doesn’t happen,” Peters said. “That’s kind of the double-edge sword of it all.” Another issue is that while the amount of global central bank stimulus sloshing through markets can benefit corporations and borrowers, it’s also been credited with propelling investors into riskier assets, like stocks. The S&P 500 index SPX, +0.87% has been knocking on the door of a fresh record close this week, and at last check was up 4.7% on the year to date. The market’s massive $58 billion iShares iBoxx $ Investment Grade Corporate Bond exchange-traded fund LQD, +0.23%, which offers investors exposure to the most frequently traded part of the bond market for highly rated companies, was up nearly 7% on the year, according to FactSet data. Of note, even though the Fed stopped buying corporate debt ETFs last month as credit markets rallied, the central bank still was list listed as the top buyer of LQD over the past three months with 17 million shares, per FactSet data. The Fed’s boost for markets also has extended into riskier corporate debt. This week Ball Corp. BLL, +1.41%, a maker of glass jars and aluminum cans, sold $1.3 billion of 10-year “junk” rated bonds with a coupon of 2.875%, or a record low for this type of debt maturing in 5 years or more, per Bloomberg data. Marriott and Ball did not immediately respond to requests for comment on the new financing. Low yields can spur investors to take on more risks to reach their return hurdles, but they also take a toll on savers looking to sock away money for retirement. “Really savers have been punished for more than a decade,” said Bob Boyd, a portfolio manager at Pacific Asset Management, in an interview. “There doesn’t seem to be any likelihood of that changing in the near term.”"}]}