{"article": [{"url": "https://www.marketwatch.com/story/business-in-chicago-region-surges-in-september-adds-to-evidence-of-steadily-improving-us-economy-2020-09-30", "published": 1601462780.0, "headline": "Business in Chicago region surges in September, adds to evidence of steadily improving U.S. economy", "body": "The numbers: A measure of business conditions in the Chicago region surged in September to the highest level since the end of 2018, a stronger than expected reading that reflects improvement in manufacturing and the resilience of the broader U.S. economy. The Chicago PMI business barometer jumped to 62.4 in September from 51.2 in the prior month, MNI Indicators said Wednesday. Any reading above 50 indicates improving conditions. Wall Street had expected a reading of 52. The Chicago PMI report came out early before its normal 9:45 a.m. Eastern release time. What happened: All five main components of the index rose in September, especially new orders and production. Both advanced to an almost two-year high in a region with a heavy concentration of auto and parts manufacturing. Car sales have been surprisingly strong as of late. That doesn’t mean business has returned to normal, however. Diffusion indexes like the Chicago PMI ask executives if business is getting better or worse. They don’t tell us how much better. Many firms are coping with lower sales at home and abroad and it will take time for business to return to normal. Even with manufacturers and other companies on the mend, some firms told the Chicago PMI they are still cutting jobs. Big picture: The surprisingly strong Chicago PMI reading is the latest in a series of reports that showed the U.S. economy still expanding at a moderate if somewhat slower pace in September. Consumer confidence surged in September, for example, and ADP reported the biggest increase in private-sector jobs in three months. Read:Consumer confidence surges to highest level since start of coronavirus pandemic Also:Private sector job growth in September is strongest in three months: ADP In short, the U.S. is performing better than expected, but an economic recovery is likely to be drawn out with millions of people still out of work and the coronavirus continuing to spread. What they are saying? “Manufacturing is still rising from low levels, but momentum has slowed in recent months,” said Rubeela Farooqi, Chief U.S. economist at High Frequency Economics. Market reaction: The Dow Jones Industrial Average DJIA, +0.56% and S&P 500 index SPX, +0.87% rose in Wednesday trades."}]}