{"article": [{"url": "https://www.marketwatch.com/story/second-coronavirus-wave-could-delay-europes-recovery-ecb-president-lagarde-2020-10-06", "published": 1602050540.0, "headline": "Second coronavirus wave could delay Europeâ\u0080\u0099s recovery: ECB President Lagarde", "body": "The current spike of the COVID-19 pandemic in Europe could delay the eurozoneâ\u0080\u0099s economic recovery, due to the impact of the containment measures being taken by governments across the region, European Central Bank President Christine Lagarde said in an interview on Tuesday. - â\u0080\u009cInstead of that [recovery] V shape that we all long for and hope for, we fear that it might have that second arm of the V a little bit more shaky,â\u0080\u009d she said in an interview ahead of the Wall Street Journal CEO Council. - Lagarde reiterated that the ECB was ready to â\u0080\u009cuse all the tools that will produce the most effective, efficient, and proportionate outcomeâ\u0080\u009d if it considers the economic situation demands it. That could include taking the key interest rate even lower than its current minus 0.5%. - Industrial production in the euro area was up 4.1% in July over the preceding month, but still 7.7% lower than in July, 2019, the latest data from European Union statistical office Eurostat showed. Eurozone inflation was at an annual minus 0.3% in September, far from the ECBâ\u0080\u0099s official target of â\u0080\u009cbelow but close to 2%.â\u0080\u009d - The ECBâ\u0080\u0099s task to boost inflation is made more difficult by the continuous appreciation of the euro this year. The common currency is up 5.5% against the U.S. dollar EURUSD, +0.60%, and more than 7% against the pound EURGBP, -0.26% Â since January. Read: Euroâ\u0080\u0099s two-year high nudges ECB toward more bond-buying The outlook: In spite of significant stimulus fiscal plans enacted by national governments throughout the region since March, topped by a massive â\u0082¬750 billion joint EU recovery fund, the ongoing recovery might peter out without new significant fiscal and monetary policy actions. As governments are reaching the limits, both political and financial, of what they can do, either at the national or the EU level, the onus will once again fall on the central bank to do whatever it can to prevent another debilitating recession in the region. Opinion:How Mario Draghiâ\u0080\u0099s â\u0080\u0098Whatever it takesâ\u0080\u0099 became Europeâ\u0080\u0099s antivirus mantra"}]}