{"article": [{"url": "https://www.marketwatch.com/story/microsoft-starbucks-and-nike-opt-for-show-and-tell-to-push-others-to-hit-net-zero-carbon-emissions-2020-07-21", "published": 1595410100.0, "headline": "Microsoft, Starbucks and Nike opt for show-and-tell to push others to hit net zero carbon emissions", "body": "Microsoft has teamed up with Unilever, Starbucks, Nike and a handful of other global companies that would seem to have little in common expect for established plans to cut carbon pollution and what their executives say is a willingness to teach others to hit net zero emissions by 2050. The companies, which also include Mercedes-Benz, the shipping company A.P. Moller - Maersk 0O77, +0.21% , European food company Danone BN, +0.98% , Natura & Co. NTCO, -0.47% , which is the Brazilian parent of The Body Shop and Indian tech concern WIT, +3.25% will work with the nonprofit Environmental Defense Fund to share information on the best practices for decreasing carbon emissions and pursuing this goal in a transparent way, they said Tuesday. The initiative will be called Transform to Net Zero. “The gap between where we are on climate change and where we need to be continues to widen. So does the gap between businesses that just talk about action and those that are actually getting the job done,” said Fred Krupp, president of EDF. “This new initiative holds tremendous potential for closing these gaps.” Read:Here’s how Burger King thinks it can cut cow emissions and still sell Whoppers Net zero requires emissions reductions across the entire value chain, including impact of products and services and supply chain. Net zero requires us to achieve greenhouse gas (GHG) emissions reductions aligned with the latest science and increase our capacity for GHG removals in the near term to be the path to get companies — and the world — to net zero no later than 2050 to ensure a stable climate, and will mean a mix of climate-positive actions should be pursued, the group said in a release. Microsoft MSFT, +2.48% earlier this year already said the company has plans to move beyond carbon neutral to become carbon negative by 2030. “No one company can address the climate crisis alone,” said Microsoft President Brad Smith in a release on Tuesday. “That’s why leading companies are developing and sharing best practices, research, and learnings to help everyone move forward.” Read:Ben & Jerry’s and Lipton parent Unilever spending $1.1 billion on climate fund, accelerates emissions plan Other tech companies have grabbed onto the movement, although aren’t part of Transform pact. Apple Inc. AAPL, +1.74% on Tuesday joined the ambitious aim of its rivals, believing it can reduce and offset emissions along its entire supply chain and in the production of its iPhones and other devices, all in less than 10 years. The company pledged to be 100% carbon neutral by 2030. Apple’s global corporate operations are already carbon neutral, so Tuesday’s update means that the company will extend that goal to its manufacturing supply chain and product life cycle. Earlier this year, Amazon AMZN, +3.01% CEO Jeff Bezos, often tagged for the carbon footprint of his delivery empire, revealed a $10 billion fund to fight climate change. The efforts all roughly align with the demands of the voluntary Paris Climate Accord, which aims to keep the global average temperature rise to below 2 degrees Celsius, and ideally limit it to 1.5 degrees. Private U.S. companies are largely acting alone after the Trump administration pulled the country from the Paris deal, citing in part the White House belief that developing nations don’t share the burden."}]}