{"article": [{"url": "https://www.marketwatch.com/story/gold-prices-retreat-as-us-dollar-firms-2020-07-07", "published": 1594131380.0, "headline": "Gold futures settle at nearly 9-year high", "body": "Gold futures on Tuesday finished at their highest settlement since September 2011, with the metal’s climb back above the $1,800-an-ounce coming amid rising cases of coronavirus and doubts about the health of the global economy. Gold saw “a classic case of the market allowing some early profit taking, clearing out some short term, [and] weaker participants then buying the dip in size to take gold higher,” Jeff Wright, executive vice president of GoldMining Inc., told MarketWatch. August gold US:GCQ20 rose $16.40, or 0.9%, to settle at $1,809.90 an ounce, wrapping up the session at the highest intraday level. Prices based on the most-active contracts logged the loftiest finish since Sept. 16, 2011, according to FactSet data. Meanwhile, September silver US:SIU20 tacked on 12 cents, or 0.6%, to reach $18.699 an ounce after a 1.4% gain on Monday. More broadly, precious metals silver and gold have benefited from safe haven appetite during the COVID-19 pandemic that has undermined global economic growth and elicited unprecedented stimulus from central banks and governments world-wide. That environment is seen keeping interest rates low and driving appetite for metals, bullish experts say. “There is no doubt that traders are pouring money in gold [exchange-traded funds] for the gold demand has strengthened due to virus concerns,” wrote Naeem Aslam, chief market analyst at AvaTrade, in a Tuesday report. In June, gold-backed ETFs recorded their seventh consecutive month of global positive flows, adding 104 metric tons, which is equivalent to $5.6 billion, or 2.7% of assets under management, according to a report from the World Gold Council issued Tuesday. For the first half of the year, global net inflows reached $39.5 billion—topping the previous annual inflow record from 2016. “Gold ETF investment demand shattered numerous records this year as investors sought safety from the economic turmoil created by COVID-19,” said Juan Carlos Artigas, head of research at the World Gold Council, in a statement. “To put it in context, inflows in the first half of 2020 significantly exceeded multidecade record levels of net gold purchased by central banks in 2018 and 2019.” “Falling interest rates around the globe, and the weaker dollar are keeping the rally alive for the gold price,” Aslam wrote. The U.S. dollar on Tuesday was up 0.1% at 96.83 after earlier falling to an intraday low of 96.60, as measured by the ICE U.S. dollar index DXY, -0.58%, a gauge of the buck against a half-dozen currencies. Moves in the greenback can influence gold because prices for the metal are traded in dollars. The 10-year Treasury note yield TMUBMUSD10Y, 0.777% has been kept in a range at around 0.70%, with such relatively low rates also stoking appetite for bullion which doesn’t bear a coupon. Rounding out action on Comex, September copper US:HGU20 rose 0.8% to $2.797 a pound. October platinum PLV20, +3.99% added 3% to $863.20 an ounce, while September palladium US:PAU20 edged down by 0.04% to $1,951.60 an ounce."}]}