{"article": [{"url": "https://www.marketwatch.com/story/t-11602186726", "published": 1602172940.0, "headline": "Catholicism is not an inherent threat to liberal democracy", "body": "Chandan Khanna/Agence France-Presse/Getty Images NEW YORK (Project Syndicate) – In his quest for the secret of U.S. democracy in the 1830s, the French aristocrat Alexis de Tocqueville reflected on the important role played by religion in American life. Having escaped from the authority of the pope, he argued, American Christians were free from any religious authority. Christianity in the New World, he concluded, could only be described as “democratic and republican.” By republican he did not mean the Republican Party, of course, but the republican form of government. And most Christians he met were Protestants. The American Republic was founded by Protestants, and American elites were for a long time largely Protestant. “ The challenge is once again out in the open, including in the Supreme Court, where conservative judges are often hostile to secular groups, as though they were barbarian enemies out to destroy America. ” So far, John Fitzgerald Kennedy has been the only Catholic president, and he had to affirm publicly during his election campaign that his first loyalty was to the United States, not to Rome.Extraordinary rise of Catholics But something extraordinary has happened since the republic was founded by Protestants in 1776. Five of the eight current Supreme Court justices are Catholics, and soon there may be six. The one Protestant on the court, Neil Gorsuch, was raised Catholic. (The other two justices are Jewish.) Nancy Pelosi, the speaker of the House of Representatives, is Catholic, as is the attorney general, William Barr. And Joe Biden, who might be the next president, is Catholic, too. How to explain the emergence of so many Catholics in high places? What does it signify? The least one can say is that the dominance of the White Anglo-Saxon Protestant (WASP) elites is over. Catholics, once distrusted and often excluded from public life because of the supposed incompatibility between their faith and liberal democratic principles, now occupy key positions. Tocqueville, a Catholic himself, did not think Catholicism was inimical to democracy, especially in the U.S. On the contrary, he said, Catholics are more egalitarian than Protestants, who prize individual liberty more than social equality. He believed that New World Catholics, often from poor immigrant communities, were perfectly in tune with American democratic ideals. “ Church adherents pose no inherent threat to liberal democracy. The problem in the U.S. is that people in the highest positions of authority, Catholic and Protestant alike, are pushing at the barriers between church and state, erected so carefully by America’s founders to ensure that the people, not God, would govern. ” In fact, Catholics are as divided as Protestants. There are left-wing Catholics, right-wing Catholics, and everything in between. Biden, a pious man, and not a radical in any sense, was denied communion last year because he supports women’s right to opt for an abortion. For many other Catholics, including a considerable number of Latinos, their fervent opposition to abortion is the main reason they support Donald Trump.Different strains Biden and Pelosi are Catholic liberals in the way Kennedy was. So is Sonia Sotomayor, one of the Supreme Court justices. But several other justices, as well as the attorney general, and Steve Bannon, one of Trump’s early ideological advisers, belong to a very different strain of Catholicism, which is often at odds with the current head of the Catholic Church, Pope Francis. Headlines: Pope Francis says coronavirus pandemic has further exposed capitalism’s flaws Indeed, Elizabeth Bruenig, a commentator for the New York Times, recently wrote that the “Catholic right is no longer recognizably Catholic. Its politics are more or less identical to those of the other members of the right-wing Christian coalition.” This is partly true. Right-wing Catholics have made common cause with evangelical Protestants, who view Trump as an unholy savior who will overturn abortion rights and various barriers between church and state. But to claim that they are no longer recognizably Catholic is questionable. The common cause between reactionary Catholics and Protestant enemies of the secular state goes back more than two centuries. Ever since the French Revolution toppled the authority of the Catholic Church, along with that of the absolute monarchy, Catholic reactionaries, including such anti-Enlightenment philosophers as Joseph de Maistre (1753-1821), have yearned to restore the Church’s central position in political life. Likewise, Protestant opponents of Thomas Jefferson branded him an “infidel” and “anti-Christian” for limiting religious faith to the private sphere. This challenge is once again out in the open, including in the Supreme Court, where conservative judges are often hostile to secular groups, as though they were barbarian enemies out to destroy America. Barr, moreover, has made speeches about Godless ideas threatening the “Judeo-Christian” values in public schools and other secular institutions. Also read: Supreme Court sides with two Catholic schools in employment case Vice President Mike Pence, a born-again evangelical who was raised Catholic, declared that he was “a Christian, a conservative, and a Republican, in that order.” And Trump’s nominee as the next Supreme Court justice, Amy Coney Barrett, is a member of the People of Praise, “charismatic Catholics” who have merged the Catholic faith with Pentecostal practices, such as speaking in tongues and communing directly with God. Now read: Amy Coney Barrett’s Supreme Court nomination puts a spotlight on charismatic Catholicism Coney Barrett has said that her faith would not interfere with her duties as a justice deciding on constitutional matters. But she also told law students at the University of Notre Dame to “keep in mind that [their] fundamental purpose in life is not to be a lawyer, but to know, love, and serve God.” She has supported claims that the right to abortion, protected by the Court’s decision in Roe v. Wade in 1973, is a wicked sin, and affixed her signature to an appeal decrying the ruling’s “barbaric legacy” and calling to overturn it.Pushing at barriers The problem, then, is not Catholicism as such, which can be many things. The problem is that people in the highest positions of authority are pushing at the barriers between church and state, erected so carefully by America’s founders to ensure that the people, not God, would govern. That the person seeking to tear down the wall between church and state is Trump, a man of no known faith, who has done more damage to the moral order than any of Barr’s imagined secular enemies, should seem odd. God’s ways are difficult to fathom. But many people in the U.S., Catholic and Protestant alike, are now convinced that He put Trump in the White House for a reason. Ian Buruma is the author of numerous books, including “Murder in Amsterdam: The Death of Theo Van Gogh and the Limits of Tolerance,” “Year Zero: A History of 1945,” and, most recently, “A Tokyo Romance: A Memoir.” This article was published with permission of Project Syndicate – The Catholic Challenge"}]}