{"article": [{"url": "https://www.marketwatch.com/story/the-big-move-i-work-in-silicon-valley-but-my-job-is-now-remote-i-can-finally-live-somewhere-cheaper-where-should-i-go-2020-08-13", "published": 1598724020.0, "headline": "The Big Move: I work in Silicon Valley, but my job is now remote. I can finally live somewhere cheaper. Where should I go?", "body": "‘The Big Move’ is a new MarketWatch column looking at real estate and work-life balance. Do you have a question about buying or selling a home? Do you know where your next move should be? Email Jacob Passy at jpassy@marketwatch.com. Dear MarketWatch, I’m a tech worker in Silicon Valley, and my company recently informed us that we can work remotely indefinitely. There’s a lot I love about living here — including the easy access to Michelin-starred restaurants and to outdoor activities like hiking and surfing. What I don’t love is the high cost of living. I earn all this money, and it goes on rent and transport and, yes, eating out. With everything that’s happened in the last six months, I have had long talks with friends about our future, and our relationship to our work. There’s got to be some reward for all of the long days, right? I’m a renter right now, but I have enough money saved up to buy a home somewhere. I hate to leave, but several members of my friend group have the same idea. We’re done! My money would go much further outside of Northern California. Where should I go? Searching and So Over It in San Jose Dear Searching, Open Google Maps GOOG, +1.97% GOOGL, +1.82% and take your pick. You’re far from alone when it comes to working from home on a more permanent basis. As far back as May, major companies like Twitter TWTR, -0.23% and Square SQ, +2.06% — which are both run by Jack Dorsey — said they would allow many employees to work from home indefinitely. A survey of more than 300 chief financial officers conducted by research firm Gartner found that around nearly three-quarter of them plan to shift at least 5% of on-site employees to permanently-remote positions post COVID-19. It appears that there’s something of a a movement afoot. The pandemic has forced lots of people to rethink their living arrangements. Faced with the prospect of working from home for many, many more months to come, major cities like New York and San Francisco are seeing an exodus of folks moving to the suburbs. And still more people are looking for cheaper housing in light of the pandemic-fueled economic downturn. Even before COVID-19, high-cost housing markets like where you live in San Jose were seeing people leave simply because it got to be too expensive. So where were those people moving? An analysis of listing-view data from Realtor.com found that 62.8% of the homes San Francisco Bay Area shoppers looked at were in fact not in the Bay Area. Here are Top 10 counties with the most home-listing views from current Bay Area residents: . Sacramento . San Joaquin . Placer . El Dorado . Stanislaus .. Monterey . Los Angeles . Santa Cruz . Fresno .. Nevada Buying a home like this in the Bay Area of California could cost you an arm and a leg — but looking further afield will provide you with many more affordable options. Getty Images “We are seeing a migration out of San Francisco to what we’ll call the North Bay, the East Bay, the Central Valley, and even Sacramento,” said Scott Fuller, a real-estate broker and founder of LeavingTheBayArea.com, a real-estate services firm that helps people relocate out of California. “People are feeling like they’re being given some independence and some flexibility and they want what they would consider a better quality of life,” he said. Many of the counties from Realtor.com’s list — including Sacramento and San Joaquin— are in the Central Valley. This region has become increasingly popular in recent years because of high home prices in areas like San Jose and San Francisco. (Realtor.com is operated by News Corp NWSA, -1.35% subsidiary Move Inc., and MarketWatch is a unit of Dow Jone, which is also a News Corp subsidiary.) But moving to this part of California has its trade-offs. “The most exciting thing you could do is go to Safeway or maybe duck hunting,” said Pat Kapowich, a Silicon Valley-based real-estate broker. “It’s still really a bedroom community — you have to get in your car if you want to do anything exciting or fun.” “ ‘It’s still really a bedroom community — you have to get in your car if you want to do anything exciting or fun.’ ” — Pat Kapowich, a Silicon Valley-based real-estate broker, on the downsides to living in California’s Central Valley It’s a bit of a resurgence of the drive-until-you-qualify phenomenon we saw in the housing bubble that preceded the Great Recession — people are moving to many towns and cities in this region despite the hours-long commute to work because they can afford to buy a home here. For someone in your position, who can work remotely indefinitely, living in the Central Valley could make a lot of sense. It’s not too long of a drive to many of the amenities you like about where you live now — the beach, the mountains, and even Napa Valley’s wineries. Plus, you need to consider the fact that you might want to change jobs eventually — and, if you do, your new job might not be remote. If you choose to buy in this region, you could theoretically commute to a job in Silicon Valley, if need be. But let’s say that you’re tired of California living. There are many markets across the country where you could be happy. Again, one consideration should be whether the region has a thriving or growing tech sector. Along those lines, there are the usual suspects — places like Seattle, Denver and Austin. But other markets Fuller and Kapowich identified as being popular among his clients also include areas like Phoenix, Nashville, Raleigh, N.C., and Boise, Idaho. Even more places to consider include Scottsdale, Ariz., Reno and Santa Fe or Albuquerque, N.M. In most of these places “for $500,000 and less you can get into a home that’s going to be at least 3,000 square feet,” Fuller said. Don’t miss:California’s emigrants aren’t all moving to cheaper housing markets Fuller estimated that some 80% of his clients who choose to relocate fully outside of California still stay west of the Rocky Mountains. “They’ve got family or something that’s tying them back so they want to be within a couple of hours plane ride to get back to California,” he said. Some of these cities — like Seattle, Nashville and Denver — will offer lots in the way of restaurants, entertainment and access to the great outdoors. Unfortunately, it may be hard to fully replicate the lifestyle you currently can lead in the Bay Area. “Here you have all these activities within a 90-minute drive,” Kapowich said. “You can go surfing on Saturday and snow skiing on Sunday.” Why didn’t I give you one or two suggestions? These aren’t normal times, so instead I suggest you reach out to your network to see if you know people who live in those areas and get the honest truth from them about what lifestyle you could lead after you move. The pandemic is a time when we can and should lean on each other. Take some time to narrow down where you might want to live, and then fly out to see if your most desired amenities are within a stone’s throw. If you have got close friends who have the same idea, you can pool your resources, creatively, if not financially. It might be easier if you made some of these decisions together."}]}