{"article": [{"url": "https://www.marketwatch.com/story/only-19-of-tesla-analysts-say-buy-the-stock-while-investors-remain-insatiable-2020-09-01", "published": 1599032060.0, "headline": "Only 19% of Tesla analysts say buy the stock while investors remain 'insatiable'", "body": "There is an old Wall Street saying that investing isn't about being right or wrong, it's about making money. No one understands that better than an investor in Tesla Inc.'s stock. The financial fundamentals and the historical valuations of earnings suggest the market is wrong about the electric vehicle (EV) maker's stock price, according to the overwhelming majority of Tesla analysts. But the stock keeps rising and Tesla investors keep making money. No one is making more money than Elon Musk, Tesla's chief executive officer, largest shareholder and arguably its most important cheerleader, who just became the third-richest person in the world, according to the Bloomberg Billionaires Index. RBC Capital Markets analyst Joseph Spak, who has been bearish on Tesla since Jan. 23 2019, when the stock closed at $57.52, put it this way in a note to clients: “ \"We recognize we underestimated a critical valuation point: seemingly insatiable investor demand for alternative/clean vehicles.\" ” - RBC's Joseph Spak Spak raised his price target to $290 from $170, but his target was still 42% below Monday's closing price. See related: His short position just got 'obliterated,' but this Tesla bear isn't giving up. The stock TSLA, +1.89%  soared 13% on Monday, and rocketed 74% in August, the best monthly performance in more than seven years, after a 5-for-1 stock split took effect. On Tuesday, the stock pulled back 4.7% to close at $475.05, after Tesla took advantage of the recent rally to announce a $5 billion share offering. Also read: Tesla takes advantage of stock's best month in 7 years with $5 billion offering. There are some fundamental reasons for investors being right to buy, as Tesla has been profitable for four straight quarters, while Wall Street was wrong to expect losses in three of the past four quarters. And despite concerns about the negative impacts of the COVID-19 pandemic, Tesla delivered way more EVs than expected during the second quarter. While the 5-for-1 stock split Tesla announced on Aug. 11 didn't improve the company's fundamentals in any way, investors were right to buy or hold on to their shares, for now, as the price has charged up more than 80% since the announcement through Monday. Read more: Tesla stock rally accelerates further into record territory after split takes effect. Despite such strong investor conviction, 81% of analysts don't recommend buying. Of the 36 analysts surveyed by FactSet, only seven, or 19%, have the equivalent of buy ratings on Tesla's stock. And only one of those analysts, Jefferies's Philippe Houchois, had a price target - $500 - that was above Monday's closing price. Meanwhile, half the analysts had the equivalent of hold ratings and 11 analysts, or 31%, had the equivalent of sell ratings. The average price target of all the analysts was $261.85, according to FactSet, which implied a 47% drop from Monday's closing price. FactSet Most of what analysts have been wrong about Tesla has taken place over roughly the past five months. At the end of March, when the COVID-19 crisis was full blown, there were the same number of bearish analysts as there are now and the average stock price target was $101.86, just 2.8% below the March 31 closing price of $104.80. With the stock's gain since then, Tesla's market capitalization increased to $464.3 billion as of Monday's close, which was the seventh highest among U.S. companies. RBC's Spak suggested that what may also keep supporting the stock is that given the sheer market valuation of Tesla, many portfolio managers have to add to positions \"just to keep pace.\" He also believes investors have been willing to show more patience and look further into the future to value the stock. \"We still view Tesla as fundamentally overvalued and having to grow into its valuation,\" Spak wrote. Spak recognizes that Tesla is clearly ahead of its competition, has relatively inexpensive access to capital, the ability to attract talent, an \"incredible\" brand, and understands that \"narrative, momentum and other factors\" can impact the stock price. But he still believes that ultimately, a company's value is related to fundamental factors. Basically, he's suggesting that one of the biggest risk factors to Tesla's stock isn't good or bad fundamental news, but how investors value that news. Here's how Tesla's earnings are currently being valued by investors, through a common metric known as the price-to-earnings (P/E) ratio, and how that compares to the companies that had larger market caps at Monday's closing prices: Company Market cap P/E ratio Apple Inc. AAPL, +1.74%  $2.27 trillion 40.87 Amazon.com Inc. AMZN, +3.01%  $1.75 trillion 134.54 Microsoft Corp. MSFT, +2.48%  $1.71 trillion 39.21 Alphabet Inc. GOOGL, +1.82%  $1.12 trillion 36.94 Facebook Inc. FB, +0.26%  $846.3 billion 36.26 Berkshire Hathaway Inc. BRK.B, +0.24%  $520.0 billion 23.75 Tesla Inc. TSLA, +1.89%  $464.3 billion 1,240.39 FactSet, MarketWatch The next major potential news catalyst is Tesla's \"battery day\" scheduled for Sept. 22, of which Wedbush analyst Dan Ives said recently he's expecting a number of potential \"game changing\" developments. One of those developments is the \"million mile\" battery, which in theory will support an EV for 1 million miles, which could put Tesla miles ahead of its traditional gasoline-powered automotive competitors. That said, Ives is one of the analysts that doesn't recommend buying - he's at hold - while his price target of $380 suggests the stock could fall 24%. Year to date, Tesla's stock has rocketed nearly fivefold (up 468%). In comparison with other EV makers, shares of China-based Nio Inc. NIO, +0.14%  ran up 401% this year, Workhorse Group Inc. WKHS, +12.62%  soared 563% and Nikola Corp. NKLA, -1.36%  climbed 297%. The S&P 500 index SPX, +0.87%  has gained 9.2% year to date.Tesla sees a lot of potential fundamental risks other than valuation For those looking for actual fundamental risks, the following are just some of those included in the more than 20 pages of \"risk factors\" Tesla lists in its latest quarterly report filed on July 28. So far, those risks haven't mattered to Tesla investors. â\u0080¢ \"We are highly dependent on the services of Elon Musk, our Chief Executive Officer.\" â\u0080¢ \"We have been, and may in the future be, adversely affected by the global COVID-19 pandemic, the duration and economic, governmental and social impact of which is difficult to predict, which may significantly harm our business, prospects, financial condition and operating results.\" â\u0080¢ \"We have experienced in the past, and may experience in the future, delays or other complications in the design, manufacture, launch, and production ramp of our vehicles, energy products, and product features, or may not realize our manufacturing cost targets, which could harm our brand, business, prospects, financial condition and operating results.\" â\u0080¢ \"Our future growth and success is dependent upon consumers' willingness to adopt electric vehicles and specifically our vehicles. We operate in the automotive industry, which is generally susceptible to cyclicality and volatility.\" â\u0080¢ \"Any issues or delays in meeting our projected timelines, costs and production at or funding the ramp of Gigafactory Shanghai, or any difficulties in generating and maintaining local demand for vehicles manufactured there, could adversely impact our business, prospects, operating results and financial condition.\" â\u0080¢ \"If our vehicles or other products that we sell or install fail to perform as expected, our ability to develop, market and sell our products and services could be harmed.\" â\u0080¢ \"The markets in which we operate are highly competitive, and we may not be successful in competing in these industries. We currently face competition from new and established domestic and international competitors and expect to face competition from others in the future, including competition from companies with new technology.\""}]}