{"article": [{"url": "https://www.marketwatch.com/story/rather-than-jump-start-reelection-campaign-tulsa-rally-highlights-trumps-vulnerabilities-2020-06-21", "published": 1592758880.0, "headline": "Rather than jump-start reelection campaign, Tulsa rally highlights Trumpâ\u0080\u0099s vulnerabilities", "body": "NEW YORK â\u0080\u0094 President Donald Trumpâ\u0080\u0099s return to the campaign trail was designed to show strength and enthusiasm heading into the critical final months before an election that will decide whether he remains in the White House. Instead, his weekend rally in Oklahoma highlighted growing vulnerabilities and crystallized a divisive reelection message that largely ignores broad swaths of voters â\u0080\u0094 independents, suburban women and people of color â\u0080\u0094 who could play a crucial role in choosing Trump or Democratic challenger Joe Biden. The lower-than-expected turnout at the comeback rally, in particular, left Trump fuming. â\u0080\u009cThereâ\u0080\u0099s really only one strategy left for him, and that is to propel that rage and anger and try to split the society and see if he can have a tribal leadership win here,â\u0080\u009d former Trump adviser-turned-critic Anthony Scaramucci said on CNNâ\u0080\u0099s â\u0080\u009cReliable Sources.â\u0080\u009d The president did not offer even a token reference to national unity in remarks that spanned more than an hour and 40 minutes at his self-described campaign relaunch as the nation grappled with surging coronavirus infections, the worst unemployment since the Great Depression and sweeping civil unrest. Nor did Trump mention George Floyd, the African American man whose death at the hands of Minnesota police late last month sparked a national uprising over police brutality. But he did add new fuel to the nationâ\u0080\u0099s culture wars, defending Confederate statues while making racist references to the coronavirus, which originated in China and which he called â\u0080\u009ckung flu.â\u0080\u009d He also said Democratic Rep. Ilhan Omar, who came to the U.S. as a refugee as a child, whom he said â\u0080\u009cwould like to make the government of our country just like the country from where she came, Somalia.â\u0080\u009d Trump won the presidency in 2016 with a similar red-meat message aimed largely at energizing conservatives and white working-class men. But less than four months before early voting begins in some states, there are signs that independents and educated voters â\u0080\u0094 particularly suburban women â\u0080\u0094 have turned against him. Republican strategists increasingly believe that only a dramatic turnaround in the economy can revive his reelection aspirations. â\u0080\u009cItâ\u0080\u0099s bad,â\u0080\u009d said Republican operative Rick Tyler, a frequent Trump critic. â\u0080\u009cThereâ\u0080\u0099s literally nothing to run on. The only thing he can say is that Biden is worse.â\u0080\u009d But the day after Trumpâ\u0080\u0099s Tulsa rally, the presidentâ\u0080\u0099s message was almost an afterthought as aides tried to explain away a smaller-than-expected crowd that left the president outraged. The campaign had been betting big on Tulsa. Trumpâ\u0080\u0099s political team spent days proclaiming that more than 1 million people had requested tickets. They also ignored health warnings from the White House coronavirus task force and Oklahoma officials, eager to host an event that would help him move past the civil rights protests and the coronavirus itself. His first rally in 110 days was meant to be a defiant display of political force to help energize Trumpâ\u0080\u0099s spirits, try out some attacks on Biden and serve as a powerful symbol of Americanâ\u0080\u0099s re-opening. Instead, the city fire marshalâ\u0080\u0099s office reported a crowd of just less than 6,200 in the 19,000-seat BOK Center, and at least six staff members who helped set up the event tested positive for the coronavirus. The vast majority of the attendees, including Trump, did not wear face masks as recommended by the Trump administrationâ\u0080\u0099s health experts. After the rally, the president berated aides over the turnout. He fumed that he had been led to believe he would see huge crowds in deep-red Oklahoma, according to two White House and campaign officials who spoke on condition of anonymity because they were not authorized to speak publicly about private conversations. There was no sign of an imminent staff shakeup, but members of Trumpâ\u0080\u0099s inner circle angrily questioned how campaign manager Brad Parscale and other senior aides could so wildly overpromise and underdeliver, according to the officials. Publicly, Trumpâ\u0080\u0099s team scrambled to blame the crowd size on media coverage and protesters outside the venue, but the small crowds of pre-rally demonstrators were largely peaceful. Tulsa police reported just one arrest Saturday afternoon. Itâ\u0080\u0099s unclear when Trump will hold his next rally. Before Oklahoma, the campaign had planned to finalize and announce its next rally this week. Trump is already scheduled to make appearances Tuesday in Arizona and Thursday in Wisconsin. Both are major general election battlegrounds. At least one swing state governor, meanwhile, says Trump would not be welcome to host a rally in her state amid the pandemic. Michigan Gov. Gretchen Whitmer, a Democrat, said she â\u0080\u009cwould think very seriously aboutâ\u0080\u009d trying to block Trump from hosting a rally there if he wanted to. â\u0080\u009cWe know that congregating without masks, especially at an indoor facility, is the worst thing to do in the midst of a global pandemic,â\u0080\u009d Whitmer said in an interview before the Oklahoma event, conceding that she wasnâ\u0080\u0099t aware of the specific legal tools she had available to block a prospective Trump rally. â\u0080\u009cI just know we have limitations on the number of people that can gather and that weâ\u0080\u0099re taking this seriously.â\u0080\u009d Bidenâ\u0080\u0099s campaign, meanwhile, seized on a fresh opportunity to poke at the incumbent president, suggesting that Trump â\u0080\u009cwas already in a tailspinâ\u0080\u009d because of his mismanagement of the pandemic and civil rights protests. â\u0080\u009cDonald Trump has abdicated leadership and it is no surprise that his supporters have responded by abandoning him,â\u0080\u009d Biden spokesperson Andrew Bates said."}]}