{"article": [{"url": "https://www.marketwatch.com/story/masks-optional-no-social-distancing-on-agenda-for-at-trump-fireworks-event-at-mount-rushmore-2020-07-03", "published": 1593790280.0, "headline": "Masks optional, no social distancing on agenda for Trump fireworks event at Mount Rushmore", "body": "SIOUX FALLS, S.D. (AP) — President Donald Trump will begin his Independence Day weekend on Friday with a display of fireworks at Mount Rushmore, an event expected to draw thousands where masks and social distancing aren’t required as coronavirus cases spike across the country. Trump is expected to speak at the event, which has issued 7,500 tickets to watch fireworks that he says will be a “display like few people have seen.” The president will likely enjoy a show of support, with the state Republican Party selling T-shirts that feature Trump on the memorial alongside George Washington, Thomas Jefferson, Abraham Lincoln and Theodore Roosevelt. But concern about the coronavirus risk and wildfire danger from the fireworks, along with protests from Native American groups, will also greet the president. Republican Gov. Kristi Noem, a Trump ally, has said social distancing won’t be required during the event and masks will be optional. Event organizers will provide masks to anyone who wants them and plan to screen attendees for symptoms of COVID-19. iframe.twitter-tweet { width: 100% !important; } Former Republican presidential candidate Herman Cain suggested in a tweet that people were fed up with face-mask guidance and that facial coverings would not be mandatory at the Mount Rushmore event — and ended up hospitalized for the coronavirus disease himself a day later. iframe.twitter-tweet { width: 100% !important; } The Republican mayor of the largest city near the monument, Rapid City, said he is watching for a spike in cases after the event, the Rapid City Journal reported. “We’re going to have thousands of people, shoulder to shoulder at these events — someone in line to see a president and being able to see fireworks at Mount Rushmore — they are probably not likely to disqualify themself because they developed a cough the day of or the day before,” the Rapid City mayor, Steve Allender, said. Cable-news reports on Friday showed a spectator-seating scheme with no nod to social distancing. See:Watchdog says Trump’s 2019 Fourth of July gala cost taxpayers $13 million Leaders of several Native American tribes in the region also raised concerns that the event could lead to coronavirus outbreaks among their members, who they say are particularly vulnerable to COVID-19 because of an underfunded health-care system and chronic health conditions. “The president is putting our tribal members at risk to stage a photo-op at one of our most sacred sites,” said Harold Frazier, chairman of the Cheyenne River Sioux Tribe. Some Native American groups are using Trump’s visit to protest the Mount Rushmore memorial itself, pointing out that the Black Hills were taken from the Lakota people against treaty agreements. Protests are expected in Keystone, the small town near the monument. Chase Iron Eyes, a spokesman for the Oglala Sioux president, said protesters would like to make their voice heard at the memorial itself, but it’s not clear they’ll be able to get close. “ ‘What can burn? It’s stone.’ ” — President Trump, when asked about the risk that fireworks could ignite wildfires Security is expected to be tight, with the road leading up to Mount Rushmore shut down. The governor’s spokesperson, Maggie Seidel, would not say whether the South Dakota National Guard was being deployed, but said organizers are making sure it is a safe event. But several people who once oversaw fire danger at the national memorial have said setting off fireworks over the forest is a bad idea that could lead to a large wildfire. Fireworks were called off after 2009 because a mountain pine beetle infestation increased the fire risks. Noem pushed to get the fireworks resumed soon after she was elected, and enlisted Trump’s help. The president brushed aside fire concerns earlier this year, saying, “What can burn? It’s stone.” The National Park Service studied the potential effect of the fireworks for this year and found they would be safe, though it noted that in a dry year, a large fire was a risk. Organizers are monitoring the fire conditions and were to decide Friday if the fireworks are safe. Trump made no mention of the fire danger in fresh comments Thursday. “They used to do it many years ago, and for some reason they were unable or unallowed to do it,” he said. “They just weren’t allowed to do it, and I opened it up and we’re going to have a tremendous July 3 and then we’re coming back here, celebrating the Fourth of July in Washington, D.C.” Trump has presided over a several large-crowd events — in Tulsa, Okla., where attendance was dramatically lower than the Trump re-election campaign expected, and at an Arizona megachurch — even as health officials warn against large gatherings and recommend face masks and social distancing. See:Former Republican presidential candidate Herman Cain hospitalized for coronavirus after attending Trump rally He plans a July 4 celebration on the National Mall despite health concerns from D.C.’s mayor. Trump and first lady Melania Trump plan to host events from the White House’s south lawn and from the Ellipse. Read on:Attorney General William Barr is seeking to rewrite the narrative surrounding Trump’s controversial photo-op"}]}