{"article": [{"url": "https://www.marketwatch.com/story/the-u-s-and-china-have-gone-to-the-brink-heres-how-to-make-sure-we-dont-go-over-it-11597326322", "published": 1597312400.0, "headline": "The U.S. and China have gone to the brink. Here's how to make sure we don't go over it.", "body": "Tensions between the U.S. and China will persist whoever wins the presidential election in November. AFP via Getty Images NEW YORK (Project Syndicate)-Observers of U.S.-China relations increasingly talk of a new cold war. On top of a long-running trade war, the two countries now find themselves in a destructive cycle of mutual sanctions, consulate closings, and increasingly bellicose official speeches. Efforts to decouple the U.S. economy from China's are under way as tensions mount in both the South China Sea and the Taiwan Strait. “ Hopes that integration into the global economy would bring about a more open, rules-abiding China have not materialized. ” A cold war between the United States and China would leave both countries and the world worse off. It would be dangerous and costly-not least because it would preclude needed cooperation on a host of regional and global issues.Little is inevitable The good news is that such an outcome is not inevitable. The bad news is the chances of a second cold war are far higher today than they were just months ago. Even worse, the chances of an actual war, resulting from an incident involving the countries' militaries, are also greater. Why is this happening? Some say Sino-American confrontation is inevitable, the result of friction between the established and rising powers of the day. But this overlooks the various episodes in history when such power shifts did not result in war. Even more, it underestimates the importance of decisions already made and yet to be made. For better and for worse, little in history is inevitable. A more serious assessment of how we got here begins with China. In recent years, and increasingly in recent months, the Chinese government has embraced a more assertive path at home and abroad. This is reflected in China's crackdown in Hong Kong in the wake of its enactment of a harsh new national security law; the inhumane treatment of its Muslim Uighur minority; the clashes along its unsettled border with India; the sinking of a Vietnamese vessel in the disputed South China Sea; and regular displays of military strength near both Taiwan and the Senkaku Islands, which both China and Japan claim as their own.Hopes dashed This has triggered deep disillusion with China in the U.S., compounding underlying tensions stemming from China's consistent theft of American intellectual property, trade practices that many blame for the disappearance of U.S. manufacturing jobs, a concerted military buildup, and mounting repression at home. Hopes that integration into the global economy would bring about a more open, rules-abiding China have not materialized. Why is China becoming increasingly assertive now? It could be that President Xi Jinping sees an opportunity to advance Chinese interests while the U.S. is preoccupied with the fallout of COVID-19. Or it could be an outgrowth of China's desire to distract domestic attention from its initial mishandling of the virus and the economic slowdown exacerbated by the pandemic. This would not be the first time a government turned to nationalism to change the political conversation. A third explanation is the most worrisome. In this interpretation, China's recent behavior is not so much opportunistic or cynical as representative of a new era of Chinese foreign policy, one that reflects the country's growing strength and ambitions. If this is the case, it reinforces the view that a cold war or worse could materialize.COVID blame game Of course, all this is taking place during a U.S. election campaign, and President Donald Trump's administration is seeking to blame others for its own inept handling of the pandemic. To be sure, China bears more than a little responsibility, as it initially suppressed information about the outbreak, was slow in responding, and failed to cooperate as much as it should have with the World Health Organization and others. But China cannot be blamed for the lack of adequate testing and contact tracing in the U.S., much less for Trump's failure to accept science and support social-distancing and mask-wearing mandates. But it would be wrong to attribute changing U.S. views of China primarily to American domestic politics. A tougher China policy will last regardless of who wins the upcoming presidential election. Indeed, U.S. policy toward China could become even more critical under a President Joe Biden, whose administration would be less preoccupied with negotiating narrow trade agreements and more focused on addressing other troublesome aspects of Chinese behavior. In the short run, both sides should ensure that crisis communications are in good order, so that they can respond quickly to a military incident and keep it limited. More positively, the two governments could find common ground by making any COVID-19 vaccine available to others, helping poorer countries manage the economic fallout of the pandemic, or both. Managed competition After the U.S. election, the two governments should start a quiet strategic dialogue to develop rules of the road for the bilateral relationship. The U.S. will need to abandon unrealistic hopes that it can foster regime change in China and instead focus on shaping China's external behavior. China will have to accept that there are limits to what the U.S. and its allies will tolerate when it comes to unilateral acts that seek to alter the status quo in the South China Sea, Taiwan, or with the Senkaku Islands. In the long run, the best hope is a U.S.-China relationship of managed competition, which would avoid conflict and allow for limited cooperation when it is in both countries' interest. This may not seem like much, but it is quite ambitious given where things are and where they are heading. Richard Haass is president of the Council on Foreign Relations and author, most recently, of \"The World: A Brief Introduction\" (Penguin Random House, 2020). This article was published with permission of Project Syndicate-To the Brink with China.Now read these How the U.S. and China can avoid an ugly breakup China has blown its opportunity to control the world with soft power If the U.S. really means to repulse China's challenge, Trump is botching it"}]}