{"article": [{"url": "https://www.marketwatch.com/story/heres-how-burger-king-thinks-it-can-cut-cow-emissions-and-still-sell-whoppers-2020-07-14", "published": 1594804880.0, "headline": "Hereâ\u0080\u0099s how Burger King thinks it can cut cow emissions and still sell Whoppers", "body": "Burger King is adding lemongrass to rebalance the diet of some of the beef herd used for its Whoppers in order to limit the methane emissions that contribute to climate change. The restaurant chain on Tuesday began selling its reduced methane emissions beef Whopper in select restaurants in Miami, New York, Austin, Portland and Los Angeles, while supplies last. Burger King, part of Restaurant Brands International Inc., QSR, -0.60% Â believes the addition of the herb can reduce each animalâ\u0080\u0099s daily methane emissions by about 33%. Cows (and sheep) emit methane as a digestive by-product through flatulence and belching. In fact, Burger King embraced these indelicate bodily functions in its social-media promotion, only the latest of a recent flurry of corporate actions, including from delivery giant Amazon AMZN, +3.01% Â and others to cash in on changing consumer behavior around climate change. But there is apparently some science behind the marketing move. Burger King worked with the Autonomous University at the State of Mexico and the University of California, Davis to test and develop its formula of adding 100 grams of lemongrass leaves to the cowsâ\u0080\u0099 daily diets. Preliminary tests indicate the concoction helps the animals release less methane as they digest their food. Beef industry groups in the past have pointed to scientific developments at the farm level in working toward reducing emissions, even as climate groups continue to up the pressure on the agriculture sector. Greenhouse-gas emissions from the entire agriculture sector, including methane, made up 9.9% of the U.S. total in 2018, according to the Environmental Protection Agency. Methane emissions from livestock specifically were roughly a quarter of the emissions from the ag sector. Read:Biden calls for $2 trillion in clean-energy spending and zero power-plant emissions by 2035 Animal protein from beef and lamb is the most GHG-intensive food, with production-related emissions more than ten times those of poultry or fish and 30 times those of legumes, a recent report from McKinsey detailed. Read:5 ways to slow global warming that share the burden with the oil patch: McKinsey Rival McDonaldâ\u0080\u0099s MCD, -0.43% Â previously said it had changed how the beef in its Big Macs and Quarter Pounders was produced, which it estimated to prevent 150 million metric tons (165 million tons) of greenhouse gas emissions from being released into the atmosphere by 2030. And both Burger King and McDonaldâ\u0080\u0099s have already added meat alternatives to their menus, although thatâ\u0080\u0099s a much smaller portion of sandwich sales. The Associated Press contributed to this article."}]}