{"article": [{"url": "https://www.marketwatch.com/story/why-soybeans-may-be-headed-for-their-highest-price-in-6-years-11600450312", "published": 1600436360.0, "headline": "Why soybeans may be headed for their highest price in 6 years", "body": "A farmer holds soybean from the 2018 harvest at her farm in Scribber, Nebraska. johannes eisele/Agence France-Presse/Getty Images Global supplies of soybeans are about to get even tighter, with the development of a La Niña climate pattern potentially leading to lower production. La Niña is a weather pattern in the Pacific Ocean that is the colder counterpart of the El Niño phenomenon and can have a global impact on weather, affecting crops in many parts of the world. Lower soybean production may provide a further boost for prices which have already risen significantly recently on growing demand from China and prices rising to their highest levels in over two years. Soybean futures SX20, +1.47% S00, +1.47% settled at $10.285 a bushel on Sept. 17, the highest finish since May 2018. They trade nearly 8% higher for the year and have rallied by 25% from their March low. The commodity has defied an overall decline of almost 11% in the Bloomberg Commodity Index BCOM, +1.51%, with the Bloomberg Soybeans Subindex up nearly 4% for the year. Before the rally this year, soybeans suffered from “demand destruction caused by the coronavirus and swine fever in China, forecasts of global oversupply, and a stronger U.S. dollar,” says Jeff Klearman, portfolio manager at GraniteShares, which offers the GraniteShares Bloomberg Commodity Broad Strategy No K-1 exchange-traded fund COMB, +1.44%. Klearman also points out that meat-processing plants around the world had been forced to shut down to stem the spread of Covid-19, reducing demand for livestock and hogs and leading to reduced soybean demand for animal feed. A weaker U.S. dollar this year, combined with dry weather conditions in the U.S. Midwest, strong Chinese demand, the reopening of meat-processing plants, and a “lessening threat” of swine fever in China, have all helped move soybean prices higher, says Klearman. China has been a strong buyer of soybeans, in part, as a “precautionary measure against increased U.S.-China trade frictions.” China’s soybean imports reached a record 98 million metric tons for the 2019-20 crop year ended in August, and are expected to reach a record again for 2020-21, with some estimates running above 100 million metric tons, says Sal Gilbertie , president at Teucrium Trading. Summertime demand from China for agricultural products had already been “unusually large” because of weather issues that affected Chinese crop production and due to the nation’s “aggressive” efforts to rebuild their swine herd, says Gilbertie. If China’s production problems turn out to be worse than expected, that could tighten the global soybean balance sheet even further, he says. At the same time, the Chinese are also “adept at buying for their strategic stockpiles when prices are low. Global 2020-21 soybean ending stocks, or the amount of supplies left over after demand has been met, are expected to stand at 93.59 million metric tons, representing a more-than-17% decline from two years earlier, Gilbertie says. That’s “an enormous decline for such a vital commodity.” Further contributing to worries about tighter supplies, the National Oceanic and Atmospheric Administration said on Sept. 10 that a La Niña climate pattern has developed and is expected to persist through the winter. That raises the likelihood of soybean production disruptions. “La Niña generally affects all the major agricultural crops in some way, from coffee to wheat,” says Gilbertie. “Dryness associated with La Niña in the United States, southern Brazil, and Argentina tends to negatively affect soybean, corn, and wheat production.” Tightening soybean supplies have already lifted prices to their “pre-trade-war multiyear trading range of between $9 and $12 per bushel,” he says. The U.S. and Brazil are the top two soybean exporters, so “beans in the teens” is the most likely scenario in an extreme La Niña event, says Craig Turner, senior commodities broker at Daniels Trading. That suggests that soybean prices may climb up to $13 or beyond. Futures prices haven’t climbed to levels that high since 2014. “If South America has substantial production issues due to La Niña, then the global soybean market would be forced into dramatic price rationing,” he says."}]}