{"article": [{"url": "https://www.marketwatch.com/story/u-s-auto-sales-fall-9-7-in-q3-but-the-news-isnt-all-bad-01601602903", "published": 1601588960.0, "headline": "U.S. auto sales fall 9.7% in Q3, but the news isn't all bad", "body": "Cars are seen parked in an auto dealer lot in unincorporated St. Louis County, Mo. Associated Press DETROIT - In normal times, a 9.7% drop in auto sales would cause executives to sweat profusely. These are not normal times. Instead, the industry sees some good things in the decline of U.S. new vehicle sales in the third quarter. Prices are up, inventories are low, and those who are in the market are buying more expensive vehicles. That's all swell for an industry whose factories were closed just five months ago due to the novel coronavirus. The July-through-September dip is small compared to the 31% decline in the second quarter when dealers were closed and it took 0% loans to entice customers. And sales in September actually grew 4.8% over a year ago, the first monthly increase since February. Auto makers attributed a lot of the third-quarter decline to falling sales to large fleet buyers such as rental car companies. \"Consistently lower interest rates encouraged new-car buyers - who were less likely to be financially hindered by the economic fallout of the pandemic - to pull the trigger on a purchase,\" said Jessica Caldwell, executive director of insights for the Edmunds.com auto website. According to Edmunds, which provides content to The Associated Press, rising used vehicle prices helped buyers offset increasing new-vehicle prices. J.D. Power said the average purchase price hit a record in September, at $35,655. The old record of $35,420 was set in August. Auto makers reported that people are buying more expensive trucks, and they're loading them with options, pushing prices up. Plus, because inventories are low, discounts are down. Trucks and SUVs were expected to account for more than 76% of new vehicle sales, a record for September, J.D. Power said. General Motors GM, -0.15%, which saw a 9.9% sales drop for the quarter compared with a year ago, said sales increased every month since July. \"Super low auto loan interest rates have boosted retail auto sales; yet more strength comes from pandemic-induced demand,\" GM Chief Economist Elaine Buckberg said in a statement. Surveys show consumers are buying vehicles to keep themselves safe from the virus, Buckberg said. Plus some households are confident in their finances and using money from canceled vacations and skipped restaurant meals to buy new vehicles, she said. Other large automakers reporting third-quarter sales figures Thursday: - Toyota, down 11%. - Fiat Chrysler, off 10.2%. - Nissan, down 32.4%. - Honda, down 9.5% - Hyundai/Kia, up 1.4% - Volkswagen/Audi, down 10.8% Edmunds estimated Ford F, -1.36% sales were down 7.9%, and analysts expect Tesla TSLA, +1.89% global sales to rise more than 40% over the third quarter of 2019. Both companies are to report numbers on Friday. Even though some automakers are optimistic, Cox Automotive says there are threats to the industry rebound. In addition to high prices and tight supplies, Chief Economist Jonathan Smoke said consumer confidence is likely to fall if virus cases keep rising. \"The auto market enjoyed a strong and profitable third quarter, but with the economy losing momentum as fiscal support wanes, we can't expect the sales pace to continue,\" he said. Cox expects new-vehicle sales for the year to reach only 13.9 million, down 16% from 2019."}]}