{"article": [{"url": "https://www.marketwatch.com/story/beyond-meat-shares-dive-7-following-widening-loss-2020-08-04", "published": 1596625820.0, "headline": "Beyond Meat shares dive 8% following widening loss", "body": "Beyond Meat Inc. shares abruptly ended what had been a steep ascent Tuesday, plunging 8% in premarket trading Wednesday after the plant-based meat maker logged a widening loss. The company reported a fiscal second-quarter loss of $10.2 million, or 16 cents a share, compared with a loss of $9.4 million, or 24 cents a share, in the year-ago quarter. After adjusting for stock-based compensation and other factors, Beyond Meat BYND, +0.80% reported a loss of $1.2 million, or 2 cents a share, compared with $2.3 million, or 5 cents a share a year ago. Revenue improved 69% to a record $113.3 million from $67.3 million a year ago. Analysts surveyed by FactSet had expected an adjusted loss of 2 cents a share on sales of $99.2 million. “Although COVID-19 has added complexity to managing our business, we are proud of the way our team has adapted and continues to execute against our long-term strategic plan, closely managing near-term risk while continuing to invest in Beyond Meat’s longer-term future,” Beyond Chief Financial Officer Mark Nelson said in a statement announcing the results. While Beyond Meat acknowledged a “meaningful slowdown” in its food-service business because of COVID-19, resulting in the closure or limited operations of many of its customers, the company said it “experienced an increase in demand by its retail customers as consumers shifted toward more at-home consumption, which more than offset the decline in sales to food-service customers.” Still, the company said its 2020 financial outlook, previously provided on Feb. 27, “remains suspended until further notice.” Though Beyond has topped the Street’s sales expectations for all six quarters it has reported as a public company, its stock has risen just twice following its quarterly disclosures. There were a couple reasons for investors’ caution late Tuesday. Food service sales, a category that includes restaurants, fell 61% year-over-year, a victim of the pandemic as more Americans ate at home. International sales, meanwhile, declined 17%. The results come amid an escalating distribution race between Beyond and its chief rival, Impossible Foods Inc. On Monday, Beyond said its Beyond Burgers will be sold at Walmart Inc.’s WMT, +1.00% warehouse chain Sam’s Club, and at BJ’s Wholesale Club Holdings Inc. BJ, +1.19% . Last summer, Beyond Meat began selling at Costco Wholesale Corp. COST, +1.19% . Privately-held Impossible Foods, meanwhile, last week announced a distribution deal with Walmart to add to its roster of partners that already included Safeway Inc., Albertsons Companies Inc. ACI, +1.71% , and Wegmans Food Markets Inc. (Impossible has also launched a direct-to-consumer e-commerce site, and its products are available through Kroger Co.’s KR, +0.46% site.) With the addition of nearly 2,100 Walmart locations, Impossible Burger is available in more than 8,000 brick-and-mortar grocery stores across 50 states — a more-than-50-fold increase of its retail presence since March. To accommodate a spike in demand, the company has scaled operations with food co-manufacturing collaborator OSI Group. Beyond Meat’s shares have surged 88% this year. The broader S&P 500 index SPX, +0.87% has improved 2% in 2020."}]}