{"article": [{"url": "https://www.marketwatch.com/story/is-it-safe-to-retire-in-a-college-town-in-the-pandemic-2020-10-01", "published": 1601528840.0, "headline": "Is it safe to retire in a college town in the pandemic?", "body": "This article is reprinted by permission from NextAvenue.org. Autumn is making its way into State College, Pa. home to Penn State University. The days are shorter, the nights are cooler and trees are beginning to burst with color. But for local retiree Greg Guise, 67, fall’s arrival is falling a bit short this year. Due to the coronavirus, the football season for his beloved Nittany Lions has been delayed nearly two months and once the team does start playing, attendance at Beaver Stadium will be strictly limited. “I’ve been coming to the home opener Labor Day weekend whenever possible for the past 40 years and this year the stadium was empty,” says Guise. “It got me down. To me, Labor Day is like Christmas.”The Grinch stealing 2020 for local retirees For Guise, COVID-19 is the Grinch stealing 2020 and his community of fellow retirees. He and his 65-year-old wife, Debbie, relocated to the home of Guise’s alma mater two years ago from Falls Church, Va. to take advantage of everything the college town has to offer them: concerts, classes, lectures, restaurants and a vibrant social scene. Also see: Can I visit family for Thanksgiving or Christmas? Your pandemic holiday travel questions, answered But just a few weeks into the fall semester, nearly 1,000 Penn State students tested positive for COVID-19, prompting the Guises to steer clear of the campus and downtown restaurants. “It’s been difficult socializing,” says Guise. “We’re newcomers and we want to meet people. With the social element gone, we’re precluded from making additional friends and getting involved in the community.” Some college-town retirement developments have had to keep their doors closed to visitors due to coronavirus safety concerns.College towns: Usually great retirement towns In normal times, college towns including Madison, Wis., Ann Arbor, Mich. and Ithaca, N.Y. make great retirement communities. Those three actually made the Best Cities for Successful Aging List by the Milken Institute’s Center for the Future of Aging, which calls them diverse, economically vibrant communities that promote healthy aging. College towns “are not just good for your mind and your sense of well-being, they’re also good for your health,” says the Center’s chairman Paul Irving. But these, of course, are not normal times. The pandemic is turning many college campuses into coronavirus hotspots, which may worry you if you’re thinking about retiring to one. Beth Mace, chief economist at the National Investment Center for Seniors Housing & Care, recently told Barron’s: “In some cases, people aren’t moving in just because of paralysis associated with COVID; not literally ‘paralysis,’ but fear.” The New York Times, which has been tracking the virus on college campuses since the pandemic began, has recorded nearly 90,000 cases on roughly 2,000 U.S. campuses. See: Here’s why college towns are among the most economically resilient places in the country COVID-19 cases began rising across the country this summer among people between in their 20s and 30s as restaurants, bars and health clubs reopened. After that, colleges saw dramatic spikes in the virus as students returned for the fall semester.How COVID-19 is changing life in college towns This has halted some activities that have long connected college students and local retirees. According to Barron’s, the intergenerational choir of Ithaca College has stopped singing, for instance. And it’s hurt businesses in many college towns. In some of those places, one-third to one-half of area unemployment is tied to the school. This can spell reduced opportunities to work part-time in retirement there. In Starkville, Miss., home to Mississippi State University (MSU), newly retired accountant Julie Lord, 60, and her husband, Jim Martin, 71, are moving into a home less than a mile from campus. But they’re concerned because in the first two weeks of September, 120 Mississippi students, faculty and staff tested positive for the virus. “We just don’t feel comfortable at our ages participating in things on campus with all of these kids,” says Lord. COVID-19 can be especially dangerous to people over 65. While that cohort accounted for only 15% of the 6.5 million coronavirus cases in the U.S. through mid-September, the Centers for Disease Control and Prevention says that group accounted for nearly 80% of the 200,000+ deaths. “Older people just have a harder time fighting off the virus than younger adults.” says Dr. Anna Liggett, professor of geriatric medicine at Northwestern University’s Feinberg School of Medicine.Think twice about retiring to a college town? So, should retirees and those soon to retire now think twice about living in college towns? Not necessarily. Dr. Preeti Malani, a professor of infectious diseases at the University of Michigan, doesn’t think college towns are any more dangerous to older adults during a pandemic than other communities, as long as proper precautions are taken. “It really has to do with the interactions this group has with the college community,” says Malani. “For most older adults, they aren’t interacting directly.” Most colleges are actively trying to prevent the virus from spreading by limiting close interactions of any kind. They’re moving classes online, canceling concerts, limiting access to libraries and requiring masks on campus. Read: I want to retire in a college town with warm weather and lower taxes — where should I go? Some who’ve retired to college towns have found the new COVID-19 restrictions a minor inconvenience.How one couple sees things That’s how Blue Reeves, 71, and her husband, Bill, 72, see things. They retired to MSU’s Starkville about two years ago and have formed a large network of friends, including other alumni of the school. Blue says the group has stayed connected throughout the pandemic, even finding a way to cheer on the MSU Bulldogs together without actually attending football games. “We live on a boulevard with a nice green, grassy area. We’re thinking of renting a big TV screen and just doing our tailgating there,” says Blue. As it turns out, the pandemic might even create new opportunities for retirees living in college towns.The silver lining Kendal Corp., which operates senior living communities in hometowns of schools including Cornell University, Oberlin College and Dartmouth College, has been making some of those institutions’ cultural activities and classes available remotely. That can be helpful if you live in a college town but fear going on campus or have transportation limitations. “If you do things virtually, you don’t necessarily have to be at Cornell or Ithaca to take classes at Cornell,” explains Kendal President and CEO Sean Kelly. The Kendal retirement communities have relationships with those schools letting residents take classes, attend lectures and participate in a variety of programs. Many of those programs have shifted online during the pandemic. Similarly, the Osher Lifelong Learning Institutes’ programs at 124 colleges and in college town-retirement communities have pivoted to remote learning.What college towns still offer Some geriatricians think the positive elements of retiring in college towns far outweigh the coronavirus issues some of those communities are facing. Dr. Alicia Arbaje, an associate professor at Johns Hopkins University School of Medicine, likens the intergenerational connections and engagement that colleges provide local retirees to brain food. “We know from studies that volunteering and staying engaged helps the brain’s size stay large and helps neuronal connections in brain cells,” says Arbaje. Lord is disappointed the pandemic has been interfering with the timing of her move, but doesn’t regret for a moment relocating to Starkville and reconnecting with her alma mater. Read more: New study estimates link between in-person college reopenings and COVID-19 cases “It’s a bit sad we can’t do some things we hoped to do,” she says. “But we feel blessed that we’re set up to do them in the future.” Diane Eastabrook is a Chicago-based journalist. She has reported for Al Jazeera and the PBS Nightly Business Report. This article is reprinted by permission from NextAvenue.org, © 2020 Twin Cities Public Television, Inc. All rights reserved."}]}