{"article": [{"url": "https://www.marketwatch.com/story/powell-says-lack-of-fiscal-package-adds-to-downside-risk-2020-09-24", "published": 1600950200.0, "headline": "Powell says lack of fiscal package adds to downside risk", "body": "Federal Reserve Chairman Jerome Powell on Thursday said the failure of Congress to pass additional relief for the economy adds to the worries about slower growth. “While the economy has been doing better than expected, I think there is downside risk,” Powell said. There are 11 million people who have lost jobs during the pandemic. These people have been able to spend because of government assistance, he noted. “There is downside risk probably coming if some form of that support doesn’t continue,” the Fed chairman said. Powell was sitting beside Treasury Secretary Steven Mnuchin when he made the comments during testimony to the Senate Banking Committee. Mnuchin sparred with Sen. Sherrod Brown, Democrat of Ohio, the top minority member on the committee, over who was to blame for the roadblocks in Congress that have quashed another relief package. Mnuchin said Congress should quickly pass targeted relief by focusing on items on which both parties agree. Then negotiations would continue on measures that need more work. Brown said Senate Republicans would simply deep-six any further relief legislation after they get what they wanted. He noted that 600,000 workers in Ohio lost the $600 extra federal jobless relief as a result of the impasse. “You’re simply saying to those 600,000 Ohioans, ‘I’m sorry, you’re on your own,’” Brown said. “That’s a gross misstatement,” Mnuchin shot back. He said Democrats were refusing to negotiate if a relief package was not worth at least $2.2 trillion. Sen. Mike Crapo, Republican from Idaho, and the chairman of the Banking Committee, said he agreed with Mnuchin. “We ought to do what we can to reach agreement and get it done soon,” Crapo said. Stocks flipped in and out of positive territory on Thursday but gridlock on fiscal relief has cast a pall over the equity market. The Dow Jones Industrial Average DJIA, +0.56% was trading 38 points higher in early afternoon trading. Asked about the stock market’s recent performance, Powell declined to comment."}]}