{"article": [{"url": "https://www.marketwatch.com/story/the-best-home-warranty-companies-of-2020-01598388765", "published": 1598374820.0, "headline": "The best home warranty companies of 2020", "body": "Barbara Helgason - stock.adobe.com MarketWatch has highlighted these products and services because we think readers will find them useful. This content is independent of the MarketWatch newsroom and we may receive a commission if you buy products through links in this article. Finding the right home warranty can bring you peace of mind while also saving you a lot of money, should you encounter unforeseen issues with a home appliance or system. In our review of the best home warranty companies, we look at trusted providers that offer protection in the event that items in your home break down and require repairs. Keep reading to learn more about the providers that our research team identified as the top home warranty companies in the industry. (See a detailed account of our methodology at the bottom of this story.)Top home warranty companies of 2020 American Home Shield Choice Home Warranty Select Home Warranty Amazon Home Warranty First American America’s 1st Choice Home Club Total Home Protection Home warranty companies: side-by-side comparison Home warranty promotions and discounts Best Overall: American Home Shield Availability: 49 states (all but Alaska) Years in business: 49 After analyzing more than 25 companies in the home warranty space, we identified American Home Shield as the best home warranty provider. This is largely due to AHS’s stellar reputation, the flexibility it offers with its Build-Your-Own Plan and its quick claims response. In addition to its Build-Your-Own plan, American Home Shield offers an Appliance Plan (covering refrigerators, dishwashers and other common appliances), a Systems Plan (ideal for important systems such as air conditioning and smoke detectors) and a Combo Plan that covers a combination of systems and appliances. Although customers with an AHS warranty cannot choose their own technician when they need repairs, the many benefits of American Home Shield make this the best-rated home warranty company on our list. Get a quote: You can call 844-529-9298 or fill out this quick form to get a quote. AHS is offering MarketWatch readers $50 off their policy.Covers The Essentials: Choice Home Warranty Availability: 48 states (all but California and Oklahoma) Years in business: 12 Choice Home Warranty offers two service plans: A Basic Plan that covers many of a home’s most important systems and appliances, and a Total Plan that provides coverage for all of those same items plus air conditioning systems, refrigerators, washers and dryers. For added flexibility, Choice also allows customers to select add-ons, making it easy to build a plan designed around their specific needs. While there is a mix of positive and negative reviews on Choice Home Warranty’s Better Business Bureau and Trustpilot pages, many customers stated that they had poor experiences with contractors after submitting claims. Others commended the professionalism and responsiveness of Choice’s customer service team. Get a quote: Call 800-495-1292 or fill out this form to get a price estimate. MarketWatch readers get $50 off and 1 month free.Budget-Friendly: Select Home Warranty Availability: 49 states (all but Alaska) Years in business: 7 Select Home Warranty stands out for its low cost relative to other providers and for its current discount offer of two free months when you sign up for a plan. In addition, the company offers free roof coverage for its customers. Like with any provider, there are downsides. In this case, consumers should be aware of low coverage caps and a $75 cancellation fee should they terminate their plan. However, Select Home Warranty offers multiple plan options at affordable prices, making this the top-rated home warranty company for customers seeking a budget-friendly plan. Get a quote: To get a customized price estimate, you can call 888-370-3956 or fill out this quick form. Select is offering MarketWatch readers $100 off and 2 months free.Trusted by Customers: Amazon Home Warranty Availability: 45 states (all but California, Iowa, Missouri, Oklahoma, Washington) Years in business: 11 A BBB-accredited business with a B+ rating, Amazon Home Warranty stands among our most trusted home warranty companies. With three comprehensive plans, 24/7 customer service and an extensive network of licensed contractors, this has been a popular home warranty provider since entering the space in 2009. Available in 45 states, Amazon Home Warranty is not accessible to all U.S. residents. However, with a range of coverage options at competitive prices, this could be an ideal provider if you live in one of the states the company covers. Get a quote: Customers can get a free quote by filling out this form or by calling 866-605-8194. MarketWatch readers get $100 off and 1 month free.Affordable with Add-Ons: First American Availability: 34 states (all but Alaska, Connecticut, Delaware, Hawaii, Illinois, Louisiana, Maine, Massachusetts, Minnesota, New Hampshire, New Jersey, New York, North Dakota, Rhode Island, Vermont and Wisconsin) Years in business: 36 Between its Basic and Premium Plans, First American Home Warranty offers coverage that is both comprehensive and affordable. The Premium Plan is available at $42.50 per month, which is excellent value for what is covered, and there are additional useful coverage options offered like a first class upgrade for appliances that were improperly installed or modified. Because FAHW is only available in 35 states, it failed to crack our top three of home warranty companies. First American also does not include coverage for central air conditioning in either of its core plans, although it does offer an add-on option. Get a quote: You can get a free quote from First American Home Warranty by completing this form or by calling 833-777-0049.Many Plan Options: America’s 1st Choice Home Club Availability: 46 states (all but California, Hawaii, Nevada and South Carolina) Years in business: 11 America’s 1st Choice Home Club is an ideal provider for homeowners seeking several plan options to choose from. Providing coverage in 46 U.S. states, AFC Home Club offers four plans as well as six a la carte options. An additional benefit is that members in need of repairs have the ability to choose their own licensed, insured technician and are not restricted to the provider’s network of contractors. One drawback is that AFC Home Club warranties do not cover known or unknown pre-existing conditions. Those who cancel may also be charged a $75 cancellation fee. Get a quote: For a free quote, call 678-335-2181 or fill out this quick form. AFC is offering MarketWatch readers up to $150 off a new plan.Great Add-On Coverage: Total Home Protection Availability: 45 states (all but California, Iowa, Nevada, New York, Washington) Years in business: 4 In addition to its Gold and Platinum plans, Total Home Protection offers optional coverage for a wide variety of appliances and systems. For that reason, they are our top-rated home warranty provider for add-on coverage. One of the newer companies on our list, Total Home Protection is not BBB-accredited and has a C+ rating on the site. The company does, however, have fewer BBB complaints than most competitors. Get a quote: Get a free quote with Total Home Protection by calling 866-605-8194 or by completing this form. THP is offering MarketWatch readers $100 off and 2 months free.Home warranty companies: side-by-side comparison While there are benefits to coverage offered by all of these home warranty companies, each provider is different. Below is a table with a side-by-side breakdown of the eight companies. Provider Our Take Cost (monthly) Service fee Waiting period BBB accredited? American Home Shield Best Overall $50-$60 $75-$125 30 days Yes Choice Home Warranty Covers the Essentials $36-$44 $85 30 days No Select Home Warranty Budget-Friendly $36-$38 $75 30 days No Amazon Home Warranty Trusted by Customers $42-$52 $75 30 days Yes First American Affordable with Add-Ons $28-$43 $75-$100 30 days Yes AFC Home Club Many Plan Options $38-$50 $75-$125 30 days Yes Total Home Protection Great Add-On Options $45-$52 $75 30 days No Home warranty promotions and discounts One of the benefits of a home warranty is that it can save you money on repairs. On top of that, some companies provide unique discounts. Below you’ll find the promos we collected for MarketWatch readers. Provider Phone Number Our Take MarketWatch Offer American Home Shield 844-529-9298 Best Overall $50 off Choice Home Warranty 800-495-1292 Covers the Essentials $50 off plus 1 month free Select Home Warranty 888-370-3956 Budget-Friendly $100 off plus 2 months free Amazon Home Warranty 866-605-8194 Trusted by Customers $100 off plus 1 month free AFC Home Club 678-335-2181 Many Plan Options Up to $150 off a new plan Total Home Protection 866-605-8194 Great Add-On Options $100 off + 2 months free What is a home warranty? A home warranty is a service contract that covers repair, maintenance and replacement of household appliances or systems. The contract lasts for a specific period of time — often a year — and can cover a variety of items depending on the plan. If you have a home warranty and encounter an issue with a home appliance or system, you can file a claim with your provider and arrange for a technician to come assess the problem. Should the appliance or system in question be covered by your plan, you will only have to pay a service fee for the repair. This can save you hundreds — or even thousands — of dollars in repair or replacement costs. Home warranties can cover electrical, heating, air conditioning and other systems, as well as appliances like dishwashers and refrigerators. These warranties can be purchased for both old and new homes, and they are especially useful for older homes when you may not know how well valuable household items were maintained by the previous owner.How to choose the best home warranty There are several factors to evaluate when identifying the best home warranty for your needs. Questions to ask include what items you will want to have covered, how high of a monthly payment you are willing to make and whether or not any of you are already covered. It is also important to consider which providers offer coverage where you live. Even if you believe you have found the ideal plan, the company may not cover your area.How is a home warranty different from homeowners insurance? Home warranties are service contracts specific to appliances and systems in your home. By contrast, homeowners insurance covers losses and damages to an individual’s property and belongings caused by an incident that the policy covers. Incidents that are typically covered include fires and natural disasters like hurricanes and tornadoes. Homeowners insurance also commonly offers protection from theft and vandalism. Having both a home warranty and home insurance can bring you peace of mind and protect you from gaps in coverage. For example, a home warranty generally will not apply to personal belongings that are stolen, and homeowners insurance is unlikely to cover a freezer that stops working unless the issue with the freezer was caused by a covered incident. With both, you decrease the likelihood of getting stuck with significant repair bills.Conclusion: Which home warranty is the best for you? The best home warranty company for you will depend on your specific needs. The cost of monthly premiums, service fees, breadth of coverage and consumer ratings are all factors to consider. We recommend American Home Shield as the top home warranty company overall for its fantastic reputation, wide range of plan options and great appliance protection. Call 844-529-9298 or fill out this form to get a quote and determine if AHS is right for you.Methodology Because our consumers rely on us to provide objective and accurate information, we created a comprehensive rating system to formulate our rankings of the best home warranty companies. This system accounts for a wide range of ranking factors, and we collected data on dozens of home warranty providers to grade the companies on each factor. The end result was a cumulative score for each provider, with the companies that scored the most points topping the list. To ensure our research was as thorough as possible, we called every major home warranty provider directly and spoke with representatives to get quotes, specifics on coverage options, availability based on location and additional information. We also reviewed sample contracts to better understand what each plan covers and to identify limitations. In addition, we simulated the process of reaching out to each company’s customer service team to evaluate their level of helpfulness and ability to solve problems. Once we had gathered all relevant data, we used the following scoring system to grade each home warranty company on a 100-point scale: Overall plan options (5 points possible, weighted X5): Companies that offer a variety of plan options are more likely to meet consumer needs. Thus, we awarded more points to providers that offered more plans and greater flexibility. Cost (5 points possible, weighted X5): Monthly fees and service fees are both taken into consideration. The lower the fees, the higher the score. Trust (5 points possible, weighted X5): Customer feedback on third-party review sites was analyzed to gauge the reputation of each company. Points were deducted for companies that are currently facing or have recently faced civil lawsuits. Customer service (5 points possible, weighted X2): This factor is based on the responsiveness, friendliness and helpfulness of a company’s customer service team. State availability (5 total points possible): Most home warranty companies do not serve all 50 U.S. states. Providers that offer service in the most states scored the highest in this category. Additional benefits (5 total points possible): Promotions and discounts are among the perks that can make a home warranty more attractive to consumers. Companies that offered benefits that competitors didn’t were awarded more points. Coverage specifics (5 total points possible): While the total number of plan options is important, it is also essential to consider what is covered under each plan. The more comprehensive the coverage, the better. All company data is monitored on an ongoing basis so that all rankings and information remain up-to-date."}]}