{"article": [{"url": "https://www.marketwatch.com/story/my-husbands-rv-is-his-pride-and-joy-but-he-owes-75000-on-it-if-he-dies-am-i-liable-for-this-debt-2020-08-31", "published": 1599893060.0, "headline": "â\u0080\u0098A man cave on wheelsâ\u0080\u0099: My husbandâ\u0080\u0099s RV is his pride and joy â\u0080\u0094 but he owes $75,000 on it. If he dies, am I liable?", "body": "Dear Moneyist, My husband and I have been married for almost eight years. Prior to marriage we had a prenuptial agreement made, where his RV and truck remained his to do whatever with, as my home and car remained mine. His RV is his pride and joy, and his â\u0080\u009cman caveâ\u0080\u009d on wheels. I recently learned that his RV is â\u0080\u009cupside down.â\u0080\u009d He owes $75,000 more on it than itâ\u0080\u0099s worth. My concern is that if something happens to him, I will end up with a lien on my home. My name is not on the RV, nor is his name on my home. Your help and thoughts are very much appreciated. Thank you. Mary Ellen The Moneyist: â\u0080\u0098Iâ\u0080\u0099m astounded that I have NOT received my paymentâ\u0080\u0099: When will I receive my stimulus check? Dear Mary Ellen, That was a clear prenuptial agreement. Whatâ\u0080\u0099s yours is yours and whatâ\u0080\u0099s his is his, and anything you earn during your marriage is, I presume, shared. More or less. It sounds like you want to commingle your lives, but not your finances. Boys love their toys and he clearly takes great pride in his man cave on wheels, and it was and is important to him that itâ\u0080\u0099s his, and his alone. Thatâ\u0080\u0099s good news for you: You are not liable for this debt, if his name alone is on the loan. In community-property states â\u0080\u0094 Arizona, California, Idaho, Louisiana, Nevada, New Mexico, Texas, Washington and Wisconsin â\u0080\u0094 debt incurred during a marriage is deemed â\u0080\u009ccommunityâ\u0080\u009d responsibility. That is, both spouses are liable for that debt. In Alaska, newlyweds can choose to opt into community property rules. In other common-law states, spouses can incur debt on credit cards and RV loans during their marriage, and they are solely responsible for them. The Moneyist: My motherâ\u0080\u0099s will says her boyfriend can live in her home after she dies. Can I still kick him out if the deed is transferred to me? There is one major exception to these rules, according to the American Bankruptcy Institute. You are liable for medical debts of your spouse under a legal theory called the Doctrine of Necessities. â\u0080\u009cThe necessities rule is not limited to medical bills. It could apply to utilities, rent, food, clothing and any other necessities, but the most common lawsuit utilizing this legal concept is in the collection of medical debts,â\u0080\u009d it says. (At least two states, Virginia and Alabama, challenged this.) â\u0080\u009cIn Nebraska, when you marry someone you also marry their future medical debts. If your spouse incurs medical debts during the marriage, you are liable for the debt. Even if the bills only come in the name of your spouse. Even if you did not sign for the debts. Even if you did not authorize the treatment. Even if you are separated. In Nebraska, when you marry someone you also marry their future medical debts. This doctrine has been accepted in Nebraska courts,â\u0080\u009d the institute adds. The Moneyist:My husband and I are worth $3.7 million, but Iâ\u0080\u0099m afraid Iâ\u0080\u0099ll spend my way into the poor house if he dies. When I was single, I bounced checks. What can I do? This does not, however, account for the indirect costs of a spouse incurring debts. You started your marriage with your eyes open, so you should continue in that spirit. Organize a monthly budget so you know where your red lines are on spending, and how much you need to earn to keep the books balanced, and put money aside for an emergency fund. You may also want to see if your husband can cut back on his spending to pay off his RV debt sooner rather than later. Youâ\u0080\u0099re a team. Worst-case scenario: If your husband cannot pay off the debt owed on his RV, it would obviously be repossessed by the company. If you or he lost his job, on the other hand, presumably the other spouse would shoulder the burden and help the other out. If he asks you to help out with the payments on his RV? Thatâ\u0080\u0099s another question entirely. Hopefully, that wonâ\u0080\u0099t happen, Mary Ellen, and you and your husband will have a long and happy life together, and a few memorable trips in his RV. You can email The Moneyist with any financial and ethical questions related to coronavirus at qfottrell@marketwatch.com Hello there, MarketWatchers. Check outthe Moneyist private Facebook FB, +0.26% Â group where we look for answers to lifeâ\u0080\u0099s thorniest money issues. Readers write in to me with all sorts of dilemmas. Post your questions, tell me what you want to know more about, or weigh in on the latest Moneyist columns. As of Saturday, COVID-19 had infected 28,511,215 people worldwide, a figure that mostly does not account for asymptomatic cases, and killed 916,040. The U.S. still has the worldâ\u0080\u0099s highest number of COVID-19 cases (6,445,289 and 193,016 deaths), followed by India (4,659,984), Brazil (4,282,164) and Russia (1,053,663), according to data aggregated by Johns Hopkins University. The Dow Jones Industrial Index DJIA, +0.56% and the S&P 500 SPX, +0.87% closed up modestly Friday, but the Nasdaq Composite COMP, +1.39% ended lower, and had its worst week since March. Doubts about traction for further fiscal stimulus from Washington and the right-sizing expectations about a vaccine are likely two factors currently concerning investors."}]}