{"article": [{"url": "https://www.marketwatch.com/story/just-3-in-10-people-working-outside-the-home-get-hazard-pay-despite-pervasive-fear-of-bringing-coronavirus-home-2020-06-16", "published": 1592471180.0, "headline": "Just 3 in 10 people working outside the home get hazard pay, despite 'pervasive fear' of bringing coronavirus home", "body": "For many people heading in to work during the COVID-19 pandemic, the rewards haven't kept pace with the perceived risks, a new analysis suggests. More than half of workers leaving their homes to go to work say they're concerned about exposing their households to the coronavirus, but just 30% are compensated with hazard pay, according to a new report by the Economic Policy Institute, a left-leaning think tank. About 27% of white people, 41% of black people and 34% of Hispanic people working outside the home receive hazard pay. See also:Cuomo: Federal government should pay frontline workers 'hazard pay' for risking their lives during coronavirus pandemic Black, Hispanic and non-college educated workers leaving home for work are more likely to get hazard pay, the study found, \"though not in proportion to the perceived greater risks\": About 71% of black people working outside the home are afraid of bringing the virus into their households, for example, while around 41% get hazard pay. The study commissioned questions on a recent YouGov poll and also wrapped in survey findings from the National Employment Law Project (NELP), the progressive Roosevelt Institute and other sources. It defined hazard pay as when workers \"received extra pay or benefits because of the higher risks you face\" as either a one-time bonus or payment, a change in wage rate or another type of financial benefit. “ 'Workers are thus being forced to make unacceptable choices between economic sustenance and their health and their family's health, a squeeze targeted at those with the least power in the labor market.' ” - report by the Economic Policy Institute \"There is pervasive fear among workers of bringing the coronavirus home from work, especially among vulnerable workers with the least bargaining power, such as Black and Hispanic workers and low- and middle-income workers,\" wrote the authors. \"These workers are not being protected by OSHA-established standards and they are also not receiving additional compensation in proportion to the risks they face.\" Workers of color are overrepresented in essential jobs that require them to commute to work outside the home, the U.S. Centers for Disease Control and Prevention note. One Washington Post-Ipsos survey included in the EPI analysis found that 72% of Hispanic workers and 68% of black workers employed outside of their homes worried about exposure to COVID-19 on the job and subsequent infection of household members, compared to 50% of white workers. Racial disparities also emerged in responses to a separate NELP survey, which asked, \"Have you gone to work outside your home during this pandemic, even though you thought it might be seriously risking your health or a family member's health?\" Some 73% of black respondents and 64% of Hispanic respondents replied \"yes\" to the question, versus 49% of white respondents. The HEROES Act passed by the Democrat-controlled House last month would provide up to $10,000 in \"pandemic premium pay\" for essential workers. Many employees are \"being forced to work in order to sustain their families, and many are being denied unemployment benefits for not being willing to go to jobs they consider unsafe,\" the EPI report's authors wrote. \"Workers are thus being forced to make unacceptable choices between economic sustenance and their health and their family's health, a squeeze targeted at those with the least power in the labor market,\" they said. \"Policies to protect workers' health on the job as well as to provide decent pay and income maintenance are essential.\""}]}