{"article": [{"url": "https://www.marketwatch.com/story/retired-and-want-to-try-day-trading-read-this-first-2020-07-07", "published": 1594116740.0, "headline": "Retired and want to try day trading? Read this first", "body": "Should retirees try their hand at day trading? This question would have been unthinkable up until a couple of months ago. Day trading is risky, and that’s the last thing you should be incurring in your retirement portfolios. Nevertheless, no doubt because many of you have lots of time on your hands during this pandemic, day trading has mushroomed in popularity. The fear of missing out has been intensified by a rash of recent news stories making day trading appear to be easy. One of the more extreme was the claim by a day trader that he’s a better investor than Warren Buffett and that day trading is “the easiest game” there is. I have one word of advice if you’re tempted by such boasts: Don’t. Or at least, read this column first. I say this not because day traders never make money. Many of them do—at least temporarily. But the overwhelming pattern is for them to eventually lose much of their winnings. It’s this latter point that too often is missed. The usual response from day-trading’s skeptics is to point out that day traders on average don’t beat the market. But that doesn’t speak to whether any individual day traders are beating the market consistently. If they can, then you couldn’t care less whether the average day trader is a market laggard. This is why recent anti-daytrading diatribes have largely fallen on deaf ears. One of these was from Burton Malkiel, the Princeton University economist and author of the classic book “A Random Walk Down Wall Street.” In recently arguing against day trading, he cited two studies: One which found that day traders at Charles Schwab SCHW, +1.29% on average lagged behind the market over a six-year period, and the other which found that only 3% of Brazilian day traders turned a profit. Those are indeed sobering statistics, but notice that they enable true believers to continue to have hope that they can be part of the elite subset that consistently make money. A recent study eliminates even that hope. The study, “To Follow or Not to Follow — An Empirical Analysis of the Returns of Actors on Social Trading Platforms,” was conducted by six researchers at the University of Regensburg in Germany. The study focused on day traders on two social trading platforms that allow users to mimic the portfolios of other users on those platforms (Ayondo and Wikifolio). Because these platforms publish each user’s performance, the researchers were able to simulate the returns of a day trader who followed others with the best track records. A short summary of what they found: Awful. Consider a strategy that each month followed the five portfolios with the best lifetime returns up to that point on that particular social trading platform. In the case of one of the platforms analyzed, this follow-the-winner strategy produced a 79% loss, according to the researchers; in the case of the other platform, the loss was 92%. (These returns are plotted in the accompanying graph as the “return-chaser” strategies.) The researchers next looked at progressively more sophisticated strategies for mimicking other day traders. These included focusing on the day traders with the highest risk-adjusted performances (in the chart as the “Sharpe Ratio chasers”), or eliminating from consideration any day trader that employed margin. After transaction costs none of these more sophisticated strategies beat their benchmarks. It’s hard to put lipstick on this pig. Notice that these awful returns don’t reflect averages, but the result of following the traders with the best lifetime returns. These results are not surprising, at least to me, given my four decades of tracking investment newsletters’ performances. Consider a strategy that each calendar year invested in the top-performing investment newsletter model portfolio from the previous year. As you can see from the accompanying chart, this strategy also lost more than 90%.Play money Even though earlier in this column I said to never engage in day trading, I am now going to walk this back—slightly. There is nothing wrong with day trading per se, so long as you do it with small amounts of money that are outside of, and segregated from, your retirement portfolio. An analogy is setting aside a certain sum of play money when visiting a casino, along with the commitment to leave when that sum has run out. I have in mind the wise counsel from many decades ago from the late Harry Browne, editor of a newsletter called Harry Browne’s Special Reports. Many of you may know of Browne as the Libertarian Party’s candidate for president in the 1996 and 2000 elections. Browne recommended that we divide our investible assets into two portfolios: The first, containing the bulk of our assets, would be a so-called “permanent” portfolio that would be held for the long term and rarely change. The second, containing our play money, would be a “speculative” portfolio. It’s in this latter portfolio that you could day trade with abandon. The reason Browne’s advice is wise is that it recognizes our all-too-human desire to gamble and play the odds. Instead of telling us never to try our hand at day trading, which could very well be honored more in the breach than the observance, creating a speculative portfolio of play money creates boundaries around our day-trading activities so that they can’t sabotage our retirement financial security. The other attractive feature of Browne’s advice is that you have a ready-made test for whether your day-trading adds value. Over time compare the performance of your speculative portfolio to that of your permanent portfolio. While there will be times when the former portfolio will hit the jackpot, odds are overwhelming that it will lag over the long term. But be my guest—try to prove me wrong. Mark Hulbert is a regular contributor to MarketWatch. His Hulbert Ratings tracks investment newsletters that pay a flat fee to be audited. Hulbert can be reached at mark@hulbertratings.com."}]}