{"article": [{"url": "https://www.marketwatch.com/story/jobless-claims-dip-to-148-million-but-slow-decline-signals-choppy-economic-recovery-2020-06-25", "published": 1593077960.0, "headline": "Jobless claims dip to 1.48 million, but slow decline signals choppy economic recovery", "body": "The numbers: New applications for traditional jobless benefits fell slightly last week to 1.48 million, but they remain stubbornly high three months after the start of the coronavirus pandemic and signal that a fledging economic recovery is likely to be uneven. Initial jobless claims, a rough gauge of layoffs, dipped in the seven days ended June 20 from 1.54 million in the prior week, the Labor Department said Thursday. The figures are seasonally adjusted. While it marked the 12th straight decline, new claims are still extremely high and raise questions about whether a small rebound in the economy after a prolonged coronavirus-tied shutdown is about to hit a wall. Hundreds of unemployed Kentucky residents wait in long lines outside the Kentucky Career Center for help with their unemployment claims on June 19, 2020 in Frankfort, Kentucky. Getty Images Economists polled by MarketWatch had forecast a seasonally adjusted 1.38 million new claims. These figures reflect applications filed the normal way through state unemployment offices. If people who applied for benefits through a temporary federal program are included, new claims totaled an unadjusted 2.19 million last week. That was down slightly from a revised 2.2 million. Read:U.S. entered recession in February after end of longest expansion in history The number of people who are actually receiving traditional jobless benefits, meanwhile, slid to 19.5 million in the week ended June 13 from 20.3 million. These so-called continuing claims, reported with a one-week lag, have fallen painfully slow after peaking in the middle of May at nearly 22.8 million. What happened: New jobless claims have fallen gradually across the country, but economists had widely expected they would decline more rapidly after a nationwide lockdown of business activity ended and people began returning to work. The elevated level of new claims could reflect a worrisome wave of fresh layoffs in the worst-case scenario. Some businesses also complain that generous unemployment benefits have dissuaded employees from returning to work. It’s also possible the record deluge of applications has led to widespread errors by overworked state employment offices trying to handle the crush. More than 50 million applications for benefits have been filed in the past three months. Before the crisis the states were handling around 222,000 a week. See: Marketwatch’s Coronavirus Economic Recovery Tracker Along with applications for benefits filed regularly through the states, an additional 728,120 new claims were submitted last week under a temporary federal relief program put in place after the pandemic began. Forty-six states reported unadjusted figures for federal claims under the Pandemic Unemployment Assistance program. If all eight state and federal assistance programs are included, continuing claims totaled an unadjusted 30.5 million in the seven days ended June 6, the most recent data available. That marks a small increase from 29.3 million in the prior week. MarketWatch is reporting select jobless claims data using actual, or unadjusted, figures to give a clearer picture of unemployment. The seasonally adjusted estimates typically expected by Wall Street have inflated jobless claims during the pandemic and become less accurate. Big picture: If the government is accurately capturing the number of people applying for jobless benefits, the slow decline in new claims is troublesome enough. Another round of coronavirus outbreaks in heavily populated states such as California, Florida and Texas could make it worse if businesses are forced to scale back again. While the speed of the initial economic rebound in May surprised economists, most still expect a choppy recovery with more peaks and valleys in the next several months. Businesses and governments are operating in uncharted territory and it may take awhile to figure out what works. What they are saying? “High levels of both initial and continuing claims are indicative of ongoing strains in the labor market,” said Rubeela Farooqi, chief U.S. economist at High Frequency Economics. “The concern is what the July and later months could show, given still high initial claims and rising Covid-19 case counts in many states” wrote economists Andrew Grantham and Katherine Judge of CIBC Capital Markets. Read: Revisiting that funky drop in unemployment to 13.3%: Nobody really believes it Market reaction:The Dow Jones Industrial Average DJIA, +0.56% and S&P 500 SPX, +0.87% were set to open lower on Thursday."}]}