{"article": [{"url": "https://www.marketwatch.com/story/senate-panel-approves-nomination-of-judy-shelton-to-fed-board-seat-11595357304", "published": 1595343380.0, "headline": "Senate panel approves nomination of Judy Shelton to Fed board seat", "body": "Judy Shelton testifies in February before the Senate Banking, Housing and Urban Affairs Committee. Getty Images The Senate Banking Committee on Tuesday approved Judy Shelton, an early supporter and adviser to President Donald Trump, to a seat on the Federal Reserve board of governors. The committee also approved the nomination of Christopher Waller, head of economic research at the St. Louis Fed, to fill another vacancy on the seven-member board. Shelton, a controversial nominee, was approved by a party-line vote of 13 to 12. Waller was approved by a wider margin of 18-7. Shelton has been controversial because she has a long record of vocal advocacy for some form of a gold standard, which would tie the value of the U.S. dollar to the price of gold. Until the Great Depression destroyed the policy, central banks had used a gold standard to set monetary policy. Democrats united against her nomination because they view a gold-standard as ignoring the plight of workers in policy making. Sen. Mike Crapo, a Republican from Idaho and the chairman of the Banking Committee, defending Shelton, saying she would “broaden and diversify” the Fed’s perspective. He downplayed her prior support for the gold standard. In her nomination hearing, Shelton had backed away from her prior writings. Democrats charged that Shelton had not changed her stripes and would have made the coronavirus crisis worse if she were on the Fed board at the advent of the pandemic. “A regulator’s job is not to … revive debunked economic theories,” said Sen. Sherrod Brown of Ohio, who is the ranking Democrat on the banking panel. For the past few months, Shelton’s nomination looked t be in danger after some Republicans, notably Sen. John Kennedy from Louisiana, appeared to withhold support for Shelton. On Monday, Kennedy said he had finally decided to support Shelton’s nomination. David Wilcox, a former senior Fed staff member, wrote an op-ed in the Hill newspaper urging the Senate panel not to vote in favor of Shelton’s nomination. He said the gold standard might require Fed officials to raise interest rates in a downturn just because gold was flowing out of the country, regardless of the concurrent destruction of millions of jobs. Some Fed watchers think Shelton would be on Trump’s shortlist to lead the Fed if the president is re-elected on Nov. 3. Fed Chairman Jerome Powell’s four-year term as chairman ends in 2022. Trump at times has been harshly critical of Powell, whom he nominated after deciding not to tap Janet Yellen for a second term as chairwoman, and has publicly mused about removing him from his post. Most analysts think there is only a small chance Trump would nominate Powell for a second term. If the two nominees are approved, Trump will have selected six of the seven Fed governors. Fed officials have staggered 14-year terms that don’t adjust for new governors. For instance, Shelton’s term would end in 2024, and under Fed rules she could then be renominated for a full term. The seat to which Waller is destined expires in 2030. In addition to the Fed board, there are also 12 regional Federal Reserve Bank presidents who help set interest-rate policy. Yet it is the seven-member board of governors that is in charge of the emergency powers that the central bank has used during the pandemic to make loans to all corners of the financial markets and to private firms. Some analysts said Trump’s appointees could slow any bank reforms proposed by Joe Biden if he is elected president. Shelton’s and Waller’s nominations now move to the full Senate for confirmation. In order to be confirmed, Shelton can only lose three Republican votes if the Democrats are united in opposition."}]}