{"article": [{"url": "https://www.marketwatch.com/story/five-cars-we-wish-were-still-being-made-2020-09-16", "published": 1600233140.0, "headline": "Five cars we wish were still being made", "body": "“It was just too far ahead of its time” the saying goes. It’s not uncommon for a vehicle to fall victim to this fate, often due to a design too bold or an attempt to create a new segment that the buying public just isn’t ready for. Here we’ll discuss five cars that were discontinued too soon before they had a chance to catch on. Had they stuck around, the modern-day versions of the vehicles below would likely be strong sellers today.Subaru Baja The 2006 Subaru Baja. Mr. Choppers/Wikipedia The Baja was essentially a pickup version of the Outback station wagon and was sold from the 2003 through 2006 model years. It was available with either a four-speed automatic transmission, or a five-speed manual, and both turbocharged and non-turbocharged engines were offered. In place of the Outback’s enclosed cargo area was a 41-in bed that could be extended via both an optional bed extender and door that allowed items to pass through into the cabin. Despite it only being sold new for four short model years, the Baja has developed a cult following, and used examples now sell for a premium, despite the fact that even the newest ones are now 15 years old. Given their utility, not to mention the current popularity of both trucks and modified Subarus, we can’t help but wonder if Subaru FUJHY, -1.41% isn’t wishing it has something with the Baja’s utility in its lineup today. Toyota FJ Cruiser The Toyota FJ Cruiser at the 2005 Chicago Auto Show. Getty Images The FJ Cruiser was meant to be both a tribute to the original FJ40 Land Cruiser and a competitor to the venerable Jeep Wrangler. While it certainly fits the heritage aesthetic, Toyota’s refusal to give it a removable roof or removable doors – arguably the Wrangler’s best features – meant it never quite achieved the popularity of the legendary Jeep during its years on sale, which lasted from 2007 through 2014. Unfortunately for Toyota TM, -0.65% , shortly after the company canceled the FJ Cruiser, off-road vehicles and overland travel experienced a massive jump in popularity, and used FJ Cruisers have held their value remarkably well to this day. It’s fair to say that the FJ Cruiser was discontinued too soon and that a dedicated Toyota off-roader smaller than the 4Runner would likely be a hot commodity today. See: Automakers are gambling on electric pickup trucks—will consumers buy them?GM EV1 The EV-1 was an experimental electric vehicle offered by GM GM, -0.15% from 1996 through 1999. It was technically sold over two generations; Gen I vehicles were built for the 1997 model year, while Gen II EV-1s were technically built for 1999. Altogether, 1,117 EV-1s were produced and were only available to the public via lease from GM. The cars had a range of between 70 and 100 miles. There are conflicting reports on what caused the cancellation of the project, which by most accounts was looking like a major success. Sources from outside of General Motors point toward the oil lobby playing a strong role, but either way, with the broader acceptance of EVs today, we can’t help but wonder where the technology would be if GM had kept the momentum it built through the EV-1 project, rather than waiting a full decade to get back into the electric vehicle game. See: Did you miss out on Tesla’s big run? There are still good alternatives to play the electric-car revolutionNissan Xterra The Nissan Xterra Nissan There hasn’t been much to get excited about from Nissan NSANY, -1.50% in recent years, which makes this one sting even more. The Xterra was sold over two generations; the first lasting from 2000 through 2004, and the second covering 2005 through 2015, after which it was discontinued. (Toyota still has some new ones left.) Like the Toyota 4Runner and FJ Cruiser, the Xterra was a body-on-frame SUV with a solid rear axle and good off-road capability; the exact kind of vehicle that’s enormously popular today. Despite the fact that it shared its platform with the midsize Frontier pickup, which undoubtedly led to cost efficiencies, Nissan for whatever reason discontinued the Xterra after the 2015 model year, only for this type of vehicle to skyrocket in popularity shortly thereafter. Unlike Toyota, which continued producing the 4Runner after discontinuing the FJ Cruiser, dropping the Xterra left a hole in Nissan’s lineup and has almost certainly cost the company sales and overall market share. Discontinued too soon doesn’t even begin to describe it. Also on MarketWatch: A look at Cadillac’s first electric car, promising a range greater than 300 milesHonda S2000 A Honda S2000 driven in the film “2 Fast 2 Furious” on display in Los Angeles. Getty Images One of the most beloved modern sports cars, the Honda S2000 was built from 2000 through 2009. Offering 240 horsepower from a naturally-aspirated 2.0-liter four-cylinder engine, the S2000 had an impressively high ratio of horsepower to liters of engine displacement. Combine that with rear-wheel drive, a six-speed manual transmission, attractive design, and a convertible top, and the S2000 was near perfect. Despite its formulaic excellence, the S2000 was discontinued in the midst of the 2009 financial crisis, and there’s still no indication of any plans to roll out a proper replacement. Given how well S2000s have held their value over the years, we can’t help but think a revival might be in order. Also see: These 3 EVs are the lowest cost to own over 5 years This story originally ran on Autotrader.com."}]}