{"article": [{"url": "https://www.marketwatch.com/story/paypal-taps-into-installments-with-new-feature-that-splits-purchases-in-four-2020-08-31", "published": 1598857880.0, "headline": "PayPal taps into installments with new feature that splits purchases in four", "body": "PayPal Holdings Inc. joined in on a hot e-commerce trend Monday as it announced that it would be offering an interest-free payment option that lets U.S. users make purchases in four installments. Though PayPal PYPL, +2.18% has offered a number of other consumer credit programs over the years that will continue to exist, the company’s new Pay in 4 option in the U.S. lets it offer interest-free installments, which have become increasingly popular through companies like Klarna and Afterpay that also let online shoppers split purchases into four pieces. PayPal argues that the company’s service is differentiated in part because it will come “at no additional cost” to PayPal merchants beyond the typical fees that these sellers already incur for the company’s traditional payment processing services, according to Doug Bland, the company’s senior vice president for global credit. Klarna and Afterpay charge fees to merchants for their installment offerings. Read: Here’s how PayPal hopes to turn Venmo into the next PayPal “The product is a new, cost-effective way for retailers to provide consumers with more payment choice,” Bland told MarketWatch. “It starts with looking at what’s happening in today’s challenging retail and economic environment, and we’re seeing businesses of all sizes look for ways to drive sales and attract customers without taking on additional costs.” Bland said that the Pay in 4 option is also in line with shopper preferences as “a lot of consumers want to avoid paying credit-card interest and want to borrow money without a credit check.” PayPal will still make credit-risk decisions and sometimes do soft credit checks, which don’t affect customers’ credit score, as part of its risk assessment, but Bland said the company will also lean on its “advanced analytics” in determining whether or not to allow access to the Pay in 4 option for a given transaction. PayPal CEO: ‘I don’t think there is any going back’ from e-commerce after COVID-19 The Pay in 4 offering will be available for purchases between $30 and $600 and span a six-week period. The first installment is due at the time of purchase and shoppers won’t incur fees if they make their payments on time. Bland said PayPal merchants that have offered general “messaging” on their sites about the ability for shoppers to pay over time have seen increased average order values. “We see this as a rising tide for everyone,” he told MarketWatch. The new installment offering will be integrated with the existing PayPal system and it will appear as an option in U.S. users’ PayPal wallets. The company already offers a pay-after-delivery feature for shoppers in Canada, Australia, France, Germany, Spain, the Netherlands and the U.K. PayPal’s stock has surged 89% over the past six months as the pandemic has driven a surge in online payments. The S&P 500 SPX, +0.87% is up 19% in that span."}]}