{"article": [{"url": "https://www.marketwatch.com/story/the-stock-market-no-longer-thinks-it-needs-the-economy-if-it-has-the-fed-david-rosenberg-says-11595429130", "published": 1595489360.0, "headline": "â\u0080\u0098The stock market no longer thinks it needs the economy if it has the Fed,â\u0080\u0099 David Rosenberg says", "body": "MarketWatch photo illustration/iStockphoto Itâ\u0080\u0099s hard out there for a bear. Millions of jobs have been lost, some likely permanently. Small businesses are failing. Government debt is ballooning. And yet the U.S. stock market just keeps going up. Economist David Rosenberg, whoâ\u0080\u0099s often more bearish than the general consensus, including now, has an explanation. â\u0080\u009cI realize that the stock market no longer thinks it needs the economy if it has the Fed,â\u0080\u009d Rosenberg wrote in his morning commentary Wednesday. That is, as long as the Federal Reserve keeps pumping monetary stimulus into the financial system, the financial markets can continue to ignore the awful state of the economy. And in case youâ\u0080\u0099re not clear on that topic, Rosenberg is happy to remind you. â\u0080\u009cConsumer activity is starting to cool off,â\u0080\u009d he notes, the holiday shopping season is likely to be â\u0080\u009cweak,â\u0080\u009d consumers are likely turn decidedly frugal, 68% of unemployment insurance recipients make more on the dole than while they were working, the U.S. now has the biggest debt-to-GDP ratio since World War II, with a much older population, lower-for-longer yields wonâ\u0080\u0099t support pensioners, and on and on. Perhaps more damning, in Rosenbergâ\u0080\u0099s telling, isnâ\u0080\u0099t that the market is disregarding the real economy, or that both are dependent on central bank stimulus. Both are understandable. Whatâ\u0080\u0099s really disconcerting is that the market is behaving like the ultimate creepy ex-boyfriend: it wonâ\u0080\u0099t let the central bank leave. The first sign of this disturbing behavior came as the Fed tried to unwind years of stimulus thrown at the legacy of the 2008 financial crisis, Rosenberg notes: â\u0080\u009cin late 2018 when (Fed Chairman) Jay Powell had the absolute temerity to take the Federal funds rate to that â\u0080\u0098oh-so-loftyâ\u0080\u0099 level of 2.5%, the lowest peak sinceâ\u0080¦ you ready for this? â\u0080¦ the 1930s (!) Powell got within 50 basis points of what the Fed back then believed was the â\u0080\u0098neutral rateâ\u0080\u0099 and couldnâ\u0080\u0099t go any further without the capital markets suffering a complete coronary. A massive hissy fit at that time, if you recall, as the high yield bond market dried up and the S&P 500 SPX, +0.87% plunged almost 20%. Before the famous Powell pivot and then late-2019 re-expansion of the balance sheet.â\u0080\u009d Read next: Wall Streetâ\u0080\u0099s road warriors have spent the past three months grounded. Howâ\u0080\u0099s that working out?"}]}