{"article": [{"url": "https://www.marketwatch.com/story/my-family-paid-7k-for-my-uncles-funeral-our-cousins-said-theyd-no-money-but-one-remodeled-his-kitchen-and-another-bought-800-jeans-would-you-ask-for-it-back-2020-09-17", "published": 1600575980.0, "headline": "My family paid $7K for my uncleâ\u0080\u0099s funeral. My cousins were poor, but then renovated their kitchen. Should I ask for it back?", "body": "Dear Moneyist, My two sisters and I recently paid over $7,000 for the funeral of our uncle, because he had no insurance and his three children claimed they had no money to do so. Soon after the burial, we found out that purchases on their part were being made, mainly an $800 pair of designer shoes and another cousin remodeled his kitchen. Because of this, would it be proper to ask for repayment? I want my share back, one sister doesnâ\u0080\u0099t want to anger our cousins, and the other is undecided. Thank you. J.C. Dear Niece, Funerals can be exhausting, distressing, healing, uplifting â\u0080\u0094 and expensive. The median cost of a funeral is more than $7,300, according to the National Funeral Directors Association. Cremation is significantly less â\u0080\u0094 between $6,000 and $7,000. Caskets and urns alone can cost thousands of dollars depending on whether theyâ\u0080\u0099re made of metal or cheaper wood, though some can sell for as much as $10,000 or more. Itâ\u0080\u0099s a business. Not only did you take care of your uncleâ\u0080\u0099s funeral costs, you feel like your cousins made a fool of you and your sisters. Without demanding to see their bank statements, however, we will never know the truth about their finances. The kitchen could be paid for on installments. The designer shoes? I canâ\u0080\u0099t quite believe they cost $800. Actually, yes I can. Few things truly surprise me anymore. The Moneyist: My late husband did not see his son in 30 years. Should I mail his son photos and other memorabilia â\u0080\u0094 and risk him making a claim on his estate? Did they take advantage of your good nature? Or did they really not have the funeral funds to bury their father? We will never know for sure. The time and stress you and your family would experience demanding this money back and trying to get it back are â\u0080\u0094 for what itâ\u0080\u0099s worth â\u0080\u0094 not worth it. If you had paid for a birthday party or a new wide-screen TV, that would be different. Treat it as a gift and/or a bad debt, and write it off. Iâ\u0080\u0099m not saying itâ\u0080\u0099s not a lot of money. It is. But you split the cost with your sisters, and they are already split on whether or not they should ask for the money back. Asking for it back is no guarantee of success, and will likely end your relationship with your cousins. To make an issue of it now would take away the dignity of your uncleâ\u0080\u0099s funeral. If you canâ\u0080\u0099t find another reason to let this go, do it for him. You can email The Moneyist with any financial and ethical questions related to coronavirus at qfottrell@marketwatch.com. Want to read more?Follow Quentin Fottrell on Twitterand read more of his columns here. Hello there, MarketWatchers. Check out the Moneyist private Facebook FB, +0.26% Â group where we look for answers to lifeâ\u0080\u0099s thorniest money issues. Readers write in to me with all sorts of dilemmas. Post your questions, tell me what you want to know more about, or weigh in on the latest Moneyist columns."}]}