{"article": [{"url": "https://www.marketwatch.com/story/palo-alto-networks-beats-on-earnings-and-announces-yet-another-acquisition-2020-08-24", "published": 1598344640.0, "headline": "Palo Alto Networks beats on earnings and announces yet another acquisition", "body": "Palo Alto Networks Inc.’s results and outlook topped Wall Street estimates Monday thanks to the work-from-home trend, and the cybersecurity company announced yet another in a long line of acquisitions. Palo Alto Networks PANW, +1.20% reported a fiscal fourth-quarter loss of $58.9 million, or 61 cents a share, compared with a loss of $20.8 million, or 22 cents a share, in the year-ago period. Adjusted earnings, which exclude share-based compensation charges and other items, were $1.48 a share. Revenue rose to $950.4 million from $805.8 million in the year-ago quarter. Analysts surveyed by FactSet had forecast earnings of $1.39 a share on revenue of $924 million, based on the company’s estimate of earnings of $1.37 to $1.40 a share on revenue of $915 million to $925 million. Billings, which reflects future business under contract, rose 32% to $1.39 billion from a year ago, while analysts had forecast $1.2 billion. Palo Alto Networks also said it would acquire incident-response company Crypsis Group for $265 million in cash to support its Cortex XDR platform, and expects the transaction to close in the fiscal first quarter. Palo Alto Networks has been on an acquisition spree for more than two years as it seeks to transform itself from a company mostly known for firewalls to a more full-service security software company. On a conference call, Chairman and Chief Executive Nikesh Arora said that not only is the company’s software business making up for the dropoff in its hardware business but that Palo Alto Networks is also shifting its own operations to a more cloud-centered environment. Much of that dropoff in hardware sales has to do with the simple reality that many businesses don’t have office staff on hand to take deliveries of equipment, Arora said. “We have significantly shrunk our data-center capacity, we basically shifted all of our all of our own compute to [Alphabet Inc.’s GOOG, +1.97% GOOGL, +1.82% ] Google Cloud or to [Amazon.com Inc.’s AMZN, +3.01% ] AWS,” Arora said. “And when that happens, we’re not deploying more hardware in our data centers, we’re actually buying more cloud from the public cloud providers.” Shares declined 5.3% after hours, following a 0.8% decline in the regular session to close at $267.08. Palo Alto Networks reported back in May that trends stemming from the COVID-19 pandemic had boosted the company’s results and outlook, and forecast that the world would likely remain in a transition period of at least a year to adapt to remote work models brought about by the pandemic. The company’s forecast this time around showed that confidence remains. Palo Alto Networks expects adjusted fiscal-first quarter earnings of $1.32 to $1.35 a share on revenue of $915 million to $925 million, while analysts had forecast $1.18 a share on revenue of $900.9 million. The company also expects billings of $1.03 billion to $1.05 billion, while analysts had forecast $1.04 billion. Palo Alto Networks shares are up 15% for the year. In comparison, the ETFMG Prime Cyber Security ETF HACK, +1.52% is up 17%, the S&P 500 index SPX, +0.87% is up 6.2%, and the tech-heavy Nasdaq Composite Index COMP, +1.39% is up 27%."}]}