{"article": [{"url": "https://www.marketwatch.com/story/dont-let-your-dream-of-being-a-401k-millionaire-fade-during-the-pandemic-2020-06-17", "published": 1592836040.0, "headline": "You can still be a 401(k) millionaire - if you even want to", "body": "The global pandemic has turned into one scary roller-coaster ride, but months into the crisis, the argument for investors to keep calm and carry on is sticking. Even for those who can remember Black Monday of 1987, the dot-com bubble or the 2008-09 financial crisis, stock-market volatility brought on by rolling pandemic headlines has been one for the history books, and it may not be over by a mile. Americans saving for retirement can be forgiven for wincing at the quarter ending March, which left the S&P 500 SPX, +0.87%  with a 20% loss, the worst performance since the financial crisis. And the June quarter looks better, with the index up 21% as that period winds down. Of course, that's small comfort to the 20 million Americans out of work as of May who will struggle to keep contributing to individual plans until and if they can get reemployed. This nurse says she's 'work optional' instead of FIRE - here's how For those managing to hang onto a job right now, there are threads of hope as financial services giant Fidelity points out that employers look largely dedicated to those vital 401(k) matches. A survey of 302 attendees representing companies whose plans are managed by Fidelity found that 82% aren't considering any match reduction or suspension to plans. Fidelity manages 29% of the nation's 401(k) or 403b plans. And while 9.6% of companies report having cut or suspended the match, just over half of those say they have \"active plans\" to reinstate that in the future. On the other side, investors have been staying mostly calm since the pandemic began, with very few making drastic moves such as cashing out of their retirement funds, Meghan Murphy, a vice president at Fidelity, told MarketWatch in a late May interview. In the first quarter, retirement savers opened more new accounts than ever before - at least 407,000 IRAs were created in the first quarter, Fidelity found. \"With the introduction of target-date funds in 2006, we've seen a massive decrease in the number of 401(k) investors who are over-allocated or under-allocated to equities,\" said Murphy. A target-date fund refers to an equity-allocation plan that automatically adjusts investments the closer a person gets to retirement age. In 2002, roughly 49% of the population was holding too much equity for their age range, a figure that now stands at 21%, said Murphy. Still, the market volatility has hit one popular yardstick for some investors - Fidelity said the number of investors with $1 million or more in their 401(k) retirement accounts dropped from 180,000 in the first quarter of 2019 to 150,000 in the first three months of 2020. There were also far fewer than in the fourth quarter of 2019 - 233,000, which is understandable, given heavy losses in the first quarter of the year and market volatility. The June quarter could show many scrambled back up that hill, with data on available in July, said Fidelity. individual retirement account, or IRA, millionaires totaled 156,800 in the first quarter of 2020, down from 168,000 a year ago. While 401(k) millionaires still only represent roughly 1% of Fidelity's total retirement-plan participants, the idea both intrigues and inspires others in their quest to reach retirement with enough of a nest egg. But Murphy said investors should remember that while $1 million is a lot of money, it isn't actually the right amount for everyone, with some needing more or less, depending on the life they want to live in their golden years. \"The crux of the guideline is to maintain your lifestyle come retirement, you should aim to save 10 times your income at retirement, so if you make $50,000 a year, they should save $500,000 in their 401(k) so a million would be twice as much,\" she said. Here's another look at how much is needed to become a 401(k) millionaire. And for now, the pandemic is showing investors are still making wise decisions to reach their own millionaire-esque goals, some by doing nothing as the target-date funds are doing the hard work for them, Murphy said. \"Those who may have a little bit of money to spare, we've seen 11% of our population increase the amount they are putting into their retirement plans, perhaps looking at that opportunity to buy low,\" she said. Read:What does the government need to do to help retirement savers through the COVID-19 crisis? Of course, as many Americans don't have $1,000 saved for an emergency such as COVID-19, some will be dipping into their retirement funds for some extra help. Between April 1 and May 8, some 373,242 investors took a Coronavirus Aid, Relief, and Economic Security Act distribution, which allows for early withdrawals without a penalty. That represents some 1.5% of participants for now, said Fidelity, with Murphy stressing that investors should remember those distributions are eligible to be repaid. Read more about the CARES Act As far as the pandemic is concerned, she said investors should look to the Great Recession as a teaching moment. \"For those who stayed invested - in equities, age appropriate - their accounts have grown in some cases by 100s of percentage points,\" she said. \"Staying the course has very much paid off for those people who stayed invested and really caught that rebound from the market.\" Read: Protecting your 401(k) from a pandemic driven market downturn \"It's easy to say now, but that's why the consistent message is check your asset allocation and make sure it's in line with the amount of risk you want to take on,\" said Murphy. \"Have a plan. People who have a plan in place, whether it's a written plan or a mental plan or their spouse or partner does. They are drastically more likely to report feeling confident in their financial situation.\""}]}