{"article": [{"url": "https://www.marketwatch.com/story/amazon-upgraded-as-analysts-forecast-the-e-commerce-giants-staying-power-even-after-shoppers-return-to-stores-11600775893", "published": 1600761980.0, "headline": "Amazon upgraded as analysts forecast the e-commerce giantâ\u0080\u0099s staying power even after shoppers return to stores", "body": "Amazon's one-day delivery has been a bigger benefit than analysts thought Getty Images Amazon.com Inc. shares rose 2% in Tuesday premarket trading after the e-commerce giant was upgraded to outperform from market perform at Bernstein. Analysts maintained their $3,400 price target. Bernstein forecasts that Amazon AMZN, +3.01% will still be the go-to choice for shoppers, even after the pandemic. â\u0080\u009c[W]e undervalued the power of being the sole e-commerce demand aggregator,â\u0080\u009d Bernstein wrote in a note. Read: Amazon launches Luxury Stores, an invitation-only shopping experience for high-end fashion and beauty â\u0080\u009cAmazon is positioned to increase their dominant share position when the return to physical stores occurs. Amazon has also quietly made substantial inroads into grocery and â\u0080\u0098shoppingâ\u0080\u0099 verticals.â\u0080\u009d Analysts led by Mark Shmulik also have first-hand experience with the benefits of one-day delivery, an offering that they first thought would not be much of a competitive advantage. Analysts say they ended up purchasing a TV and having it installed through services they found on Amazon that were cheaper and quicker than BestBuy.com BBY, +1.45%. â\u0080\u009cAmid COVID, Amazon has executed incredibly well, pivoting its operations and inventory to in-demand verticals â\u0080\u0093 with flexibility and speed we didnâ\u0080\u0099t expect,â\u0080\u009d analysts said. And the company can make further gains in other â\u0080\u009crevenue poolsâ\u0080\u009d like advertising and cloud services. Amazon stock has rallied more than 60% for the year to date. The Amplify Online Retail ETF IBUY, +1.39% has gained 67.8%. And the S&P 500 index SPX, +0.87% is up 1.6% for the period."}]}