{"article": [{"url": "https://www.marketwatch.com/story/new-york-citys-eateries-see-a-glimmer-but-only-a-glimmer-of-whats-next-2020-06-23", "published": 1592923640.0, "headline": "New York Cityâ\u0080\u0099s eateries see a glimmer, but only a glimmer, of whatâ\u0080\u0099s next", "body": "Come out, come out, wherever you are! Just donâ\u0080\u0099t rush into anything! On paper, New Yorkâ\u0080\u0099s newest new normal is easy enough to grasp: Indoor shopping, outdoor dining, haircuts and â\u0080\u0094 call this last one aÂ Â mixed blessing â\u0080\u0094 the gradual return of office life. But this city is more than the sum of its public-health regulations. Itâ\u0080\u0099s what 8.3 million residents and hundreds of thousands of business owners decide to do. And as New York City enters Phase 2 of its long, drawn-out reopening, people are still trying to figure that out. â\u0080\u009cSome restaurants are getting three outside tables,â\u0080\u009d Andrew Rigie said from an open-air four-top at Melbaâ\u0080\u0099s on West 114th Street and Frederick Douglass Boulevard in Harlem. â\u0080\u009cOthers are getting 12. But this industry has been utterly devastated. So you know what? Every dollar is gonna help.â\u0080\u009d Rigieâ\u0080\u0099s group, the New York City Hospitality Alliance, has been working with local officials to nudge the industry back to life, an effort that by Monday had generated more than 3,000 applications for sidewalk-table permits. And not a minute too soon. â\u0080\u009cPeople are walking by ecstatic,â\u0080\u009d Rigie said. â\u0080\u009cThey canâ\u0080\u0099t wait to come by and have a great meal, have a drink and socialize. Itâ\u0080\u0099s a step. But we still need a lot more support to help these small businesses survive.â\u0080\u009d It was back in March that the coronavirus snuffed the energy out of New York City, most of the fun stuff, anyway: the bars, the restaurants, the theaters, the sporting events, even the simple morning pleasure of scarfing down a plump everything bagel smeared with cream cheese from the constantly jumping Ess-a-Bagel on Third Avenue between 50th and 51st streets, where the hungry masses used to line up uncomplainingly on the sidewalk before heading to work. Donâ\u0080\u0099t miss: Lockdowns ease in New York City and other major cities, but commercial real estate still tied in knots â\u0080\u009cIt all just happened so quickly,â\u0080\u009d said Melanie Frost, who runs the shop and another on West 32nd Street with her mother, Melba. â\u0080\u009cWe lost 80% of our business, maybe more, in three days. So we have no choice. We just keep coming up with new ways to survive.â\u0080\u009d As food purveyors, the cityâ\u0080\u0099s bagel shops were never forced to close. That wasnâ\u0080\u0099t the problem. The problem was that so many of the customers suddenly vanished. The nearby office towers looked like someone had pulled a giant fire alarm. The people who live in the doorman apartment buildings were hiding in the Hamptons or hiding inside. That left Melanie and her mom scrambling to save a business that Melanieâ\u0080\u0099s late aunt and uncle, Florence and Gene Wilpon, founded in 1976. Melanie Frost runs the Ess-a-Bagle shop on Third Avenue and another on West 32nd Street with her mother, Melba. Courtesy Melanie Frost So what have they done? What havenâ\u0080\u0099t they done? They teamed up with Juice Press to deliver to Connecticut, New Jersey and Long Island. They got their bagels into Amazon Go AMZN, +3.01% Â stores, which were open, then closed and are now opening again. They pumped up the online ordering, shipping New York goody bags across America. They sold pizza bagels, bagel dogs and meal kits. They tracked down their best corporate accounts and offered to feed sequestered employees at home. They made deals with four new food-delivery services. They sold toilet paper, masks, flour and gloves, not normally seen on bagel-shop menu boards. They renegotiated the rent. They donated massive loads of bagels to Mount Sinai Hospital, then found a law firm to underwrite the cost.Â Now, as some of the cityâ\u0080\u0099s high-end hotels are finally reopening, the guests are being greeted with platters of Ess-a-Bagels, as are returning tenants at several Midtown office buildings, thanks to a partnership with a real-estate management company. The outdoor tables will be up this week. All the while, the walk-in customers are being reminded they must wear face masks and the frontline employees look like they work in a hospital ICU â\u0080\u0094 masks, gloves, gowns and hairnets. Three hours from now, Melanie and her mother will probably have four new ideas. Also see: Here are 9 hand sanitizers that the FDA warns can be toxic if absorbed by the body â\u0080\u009cYou have to be open to shifting around,â\u0080\u009d Melanie said. â\u0080\u009cIf youâ\u0080\u0099re gonna stay in your old model of doing business, it may not work anymore.â\u0080\u009d Those partnerships, she said. are especially important. â\u0080\u009cItâ\u0080\u0099s about helping each other and bringing the community together in whatever ways we can. Everybody needs that now.â\u0080\u009d So how long will all this take? Shutting down, it turns out, is a whole lot quicker than starting up again. No one has a better grip on the timetable than Rigie, and he doesnâ\u0080\u0099t even pretend to know. â\u0080\u009cYou tell me: When will one million New Yorkers whoâ\u0080\u0099ve lost their jobs get hired again and have disposable income to eat and drink out?â\u0080\u009d he said. â\u0080\u009cWhen will 70 million tourists come back? When will the office workers grab a cup of coffee in the morning again and pop out for lunch? There are so many variables. But this at least is a start.â\u0080\u009d Ellis Henican is an author based in New York City and a former newspaper columnist."}]}