{"article": [{"url": "https://www.marketwatch.com/story/chilly-sidewalks-struggling-restaurants-nyc-diners-finally-inch-inside-2020-09-25", "published": 1601134400.0, "headline": "Chilly sidewalks, struggling restaurants: NYC diners finally inch inside", "body": "Hardly anything is certain about New York City’s long slog toward normalcy, but this much seems highly likely on a late-September weekend: It’s going to get a lot colder in the weeks and months ahead. Curbside dining, delightful though it’s been, won’t be nearly as pleasant in January as it was all summer, even if City Hall is on the verge of making the outdoor eating permanent. Double hot chocolates! And hold the COVID-19, please! Starting Wednesday, the eating moves indoors. Some of it. Sort of. If the restaurants can figure out the details and the customers feel comfortable coming back in. Oh, and if Mayor Bill de Blasio doesn’t blink. The resumption of public school classroom learning was delayed a couple of times. But so far everyone’s sticking with the first wave of indoor dining next week, maximum occupancy 25% — and perhaps more to come. If the infection rate doesn’t rise, Gov. Andrew Cuomo promises, restaurants may go to 50% after Nov. 1. And on Friday, de Blasio announced that the outdoor tables won’t disappear at the end of October, as was previously planned. Now, they can remain in place permanently — or as permanently as anything can ever be in New York — in this case, through the winter and beyond. Going forward, propane heat lamps will also be allowed, so the entrees and the diners don’t freeze. Coronavirus update: U.S. cases rise toward 7 million, after jumping by more than 45,000 in a single day But none of this is going to be easy for the city’s 25,000 restaurants and bars, where employment is still less than half the 319,000 it was a year ago. “It’s a dire time filled with tons of uncertainty,” said Andrew Rigie, executive director of the New York City Hospitality Alliance, who has as clear an overview as anyone. “The 25% with a road map to 50%, hopefully by November, is a step in the right direction. But to be clear, 25% or 50% is not going to save the industry. It was difficult enough to survive pre-pandemic at 100%.” How bad are things, even with the boost of outdoor dining and the coming of indoor? A Hospitality Alliance survey of 450 city restaurants found that 87% were unable to pay their full rent in August. Thirty-four percent paid no rent at all. That’s a winning formula only for restaurants whose landlords are infinitely patient — and how common is that in New York commercial real estate? Each new step is hugely complicated. Even beyond the strict crowd limits, the restaurants must institute a menu of additional safety protocols that make a TSA strip search sound like a howdy-do. Temperature checks. Contact information for tracing. Face coverings when not seated. No bar service, and restaurants will have to close by midnight under the theory that the coronavirus gets extra frisky after 12:01 — or maybe it’s that the post-midnight flow of alcohol can lead some diners to be incautious. Also on MarketWatch: Macy’s Thanksgiving Day Parade to go virtual this year No, going out to dinner has never been like this before. And no one knows if diners will still consider it fun. Four-hundred city inspectors will join a special state police unit to enforce the new rules, with shutdown orders in their pockets for restaurants that don’t comply. It’s a learn-as-they-go situation for every restaurateur, from the owner of the tiniest diner to the city’s five-star chefs. “We’re gonna do some little bungalows so people can feel protected from the wind, the snow,” the legendary Daniel Boulud, who presides at Restaurant Daniel on East 65th Street, told WPIX-TV. “That should create a little bit of a transition and bring a little bit of excitement. We hope that 25% will keep us very safe. We are taking the great measure for that.” Also see: Pandemic startups: These N.Y. entrepreneurs did the unthinkable during COVID-19 But will it be enough to save the industry and its jobs, not to mention a treasured part of New York City life? “We need ongoing support from all levels of government to give these small businesses a chance of survival,” Rigie cautioned. “Everyone has to power through it. People are doing the absolute best they can.” Those establishments that have had outdoor tables have an advantage over those that haven’t, according to the Hospitality Alliance director. “People who have been closed for the past six months and will open for the first time will have a bigger learning curve,” he said. “It’ll be tough for everyone. But restaurants that have been outside already know how to serve people safely. They understand QR code menus. Mobile payments. These things are all going to help with the transition to indoor.” Ellis Henican is an author based in New York and a former newspaper columnist."}]}