{"article": [{"url": "https://www.marketwatch.com/story/trump-plays-on-fears-in-campaign-for-suburbs-2020-07-25", "published": 1595687660.0, "headline": "Trump plays on fears in campaign for suburbs", "body": "President Donald Trump this week sent a message to “The Suburban Housewives of America,” and in a single tweet summed up his strategy for shoring up support in communities critical to his reelection chances: Scare them. “Biden will destroy your neighborhood and your American Dream. I will preserve it, and make it even better!” he wrote. In tweets, campaign ads and new policies, Trump is trying to win over suburbanites by promising to protect their “beautiful” neighborhoods from the racial unrest that has gripped some U.S. cities this summer. He’s sent federal agents to stem violence in cities, warned of a way of life being “obliterated,” and raised the prospect of falling property values. It’s a strategy with deep roots in presidential politics, racist overtones and some record of success. But even some GOP strategists and Republican voters note it doesn’t account for the rapid demographic changes in the suburbs and may be misreading the top concerns of voters he’s trying to retain. “I think he’s just throwing stuff against the wall and seeing what sticks,” said Linda Abate, an unemployed bartender in this working-class suburb about a 45-minute drive from Philadelphia. Abate says she voted for Trump in 2016 and is likely, but has not decided, to do so again. But she has more pressing things to worry about than threats of lawlessness in her quiet borough — namely the looming expiration of enhanced federal unemployment benefits. “That $600 runs out this week. I’m more worried about that than looting in Quakertown,” she said. The commuter towns and leafy developments circling Philadelphia and other U.S. cities — areas with increasing racial diversity and a growing number of college-educated voters — have been a clear source of trouble for the president and his party. Republicans lost more than three dozen suburban House districts in 2018, when suburban voters backed Democrats by an 11-point margin, according to AP VoteCast polling. Recent polls show Democrats’ presumptive nominee, former Vice President Joe Biden, holding that edge — with a 9 percentage point margin in the recent Washington Post-ABC News poll and an 11 percentage point margin in a recent Fox News poll. Both surveys showed an especially wide advantage for the presumptive Democratic nominee among suburban women. That’s a dire prospect for the president. Republicans have long relied on finding upper-income and white voters in the growing suburbs to build on their base in rural America and win elections. But those voters have been harder to win over in the Trump era, forcing the GOP to move farther away from cities, into less-populated exurbs and shrinking small towns, in search of votes. In recent weeks, Trump has tried to regain his footing. His campaign launched ads claiming inaccurately that Biden wants to defund the police — a rallying cry for some of the protesters who took to the streets after George Floyd’s death in May. He revoked an Obama-era housing policy aimed at ending racial disparities in suburbs, saying it would lead to crime and lower home values. And this week, Trump announced he was activating federal agents to fight crime in Chicago and Albuquerque, after sending agents to Portland, where local officials say their presence has exacerbated tensions between protesters and police. The Trump campaign believes these moves will resonate with both suburbanites and older voters who may be rattled by the violent images, and turned off by calls to restructure police departments. One new ad depicted an elderly white woman calling 911 for help with a burglar at the door. The operator doesn’t pick up in time. There is some evidence to support that tack. The Washington Post-ABC News survey found 58% of suburban voters opposed reducing funding for police and spending the money instead on social services, while 37% supported it. “If we don’t have law and order in this country, we don’t have a country. It’s outrageous to let this stuff go on,” said Gloria Doak, a 70-year-old Trump backer in Bucks County, where Democrat Hillary Clinton only narrowly beat Trump four years ago. But recent polls have also found strong support in the suburbs for the broader push for racial justice and the Black Lives Matter movement — a reminder that suburbs are becoming a more politically complex and diverse battleground. In 2018, one in four suburban voters identified as nonwhite, according to AP VoteCast. That includes Robert Jackson, a 39-year-old Black man and a Democrat who moved four years ago to the suburbs from Philadelphia with his family in search of better schools. He says he saw plenty of Trump signs then around his hometown of Lansdale, in Montgomery County. Now, he thinks many of his neighbors who voted for Trump have buyer’s remorse. “Suburbanites took a gamble on him and it didn’t pay off,” said Jackson. Back in Quakertown, Alex Whalen, 19, said she thinks Trump will lose just as many suburban voters as he gains with his law-and-order pitch. The Democrat doesn’t think voters will recognize the sort of urban chaos he is describing. “Anything that’s happened in Quakertown has been peaceful,” she said. Christine Matthews, a GOP pollster and Trump critic, said the president’s “law and order” strategy is based on an outdated idea of suburbia as the overwhelmingly white communities of 50 years ago. “He doesn’t have any idea what the suburbs are,” she said. Others linked it directly to Richard Nixon’s “Southern Strategy,” which played on white voters’ racism to consolidate Republican control of the South for generations to come. “He’s gone to the well, gone to the old playbook, but it’s a much different playing field” now, said Fletcher McClellan, a political scientist at Elizabethtown College in Pennsylvania. Dan Johnson, a 72-year-old retired insurance agent from Brookfield, Wisconsin, outside Milwaukee, also see race politics in Trump’s play. “I think there’s a lot of hidden racism among people who voted for Donald Trump,” said Johnson, who voted for Republicans for president every election since 1980 but supported a third-party candidate in 2016 — a decision he now sees as a “wasted vote” — because he was turned off by Trump but didn’t like Hillary Clinton. “I don’t doubt for a minute that he’s trying to mine that.” Still, in Texas, where Democrats are trying to flip several suburban House seats, Cynthia Rauzi said it’s not far-fetched to think that Trump’s dark warnings will resonate with her neighbors in suburban Round Rock, outside Austin. When she joined a small rally against police brutality outside a private golf course this summer, one driver stopped to lay on the horn and wave a middle finger out his window. Trump won this district on the outskirts of liberal Austin by 13 points in 2016. Just two years later, Republican Rep. John Carter only narrowly escaped defeat. Rauzi, a 57-year-old yoga instructor and mother of three, called Trump’s tweet directed to “The Suburban Housewives of America” offensive. “To suggest that suburban housewives are a bunch of pearl-clutchers who are afraid of everything ... we’re smarter than that,” she said. ___"}]}