{"article": [{"url": "https://www.marketwatch.com/story/oil-aims-to-close-out-a-strong-august-with-gains-after-upbeat-china-data-2020-08-31", "published": 1598889080.0, "headline": "Oil futures end lower for the session; U.S. prices up a fourth month", "body": "Oil futures finished with a loss Monday, though with signs of a recovery in energy demand contributing to a fourth straight monthly gain for U.S. benchmark crude. Prices had found support early Monday after data showed a stronger-than-expected pickup in China’s service sector, then moved broadly lower and uncertainty continues to surround the outlook for demand. “The uptrend has clearly lost momentum since the early stages of the Q2 rebound,” said Tyler Richey, co-editor at Sevens Report Research. However, “the path of least resistance is still higher right now as technical support has been built out” in the low $40 a barrel level. “That key support area should hold barring another massive demand shock like we saw during the early 2020 global lockdowns,” he told MarketWatch. On Monday, West Texas Intermediate crude for October delivery CL.1, -1.62% US:CLV20 rose 36 cents, or 0.8%, to settle at $42.61 a barrel on the New York Mercantile Exchange. The new front-month November Brent crude BRN.1, -0.07% UK:BRNX20 contract ended 53 cents, or 1.2%, lower at $45.28 a barrel on ICE Futures Europe. Based on the most actively traded contracts, U.S. benchmark WTI crude saw a monthly gain of 5.8%, which represented a fourth straight monthly climb, according to Dow Jones Market Data. Brent, the global benchmark, notched a nearly 4.6% rise for the month to tally a fifth monthly climb in a row. Oil’s monthly gains have accompanied a global rally in equities that has the U.S. market on track for its strongest monthly gain in more than three decades. The latest move for oil prices follow “moderate week-on-week gains during last week’s trading, with continued improvement to global demand levels combining with a weaker dollar and ongoing supply cuts to offer support to [a] market that still holds plenty of downside risk,” said Robbie Fraser, senior commodity analyst at Schneider Electric. The Organization of the Petroleum Exporting Countries and their allies, known as the OPEC+ alliance of producers, has largely complied with its self-imposed production curbs. Meanwhile, the U.S. dollar has continued to weaken versus major rivals, with the ICE U.S. Dollar Index DXY, -0.58% on track for a 1.3% August drop. A weaker dollar is seen as supportive to commodities priced in the currency, making them less expensive to users of other currencies. Meanwhile, oil bulls saw earlier support from data out of China. The country’s official nonmanufacturing purchasing managers index rose to 55.2 in August, up from 54.2 in July, the National Bureau of Statistics said Monday. The August reading was the sixth consecutive expansion after the gauge in February was fell well below the 50 mark, which separates expansion from contraction. Back on Nymex, September gasoline settled at $1.2761 a gallon, down 3%, and September heating oil lost nearly 1.7% to $1.1961 a gallon. The September contracts expired at the end of the trading session. For the month, based on front-month contract prices, gasoline futures climbed by 7.5%, while heating oil futures declined by 1.7%. October natural gas US:NGV20 fell 1% to $2.63 per million British thermal units, with front-month prices ending August with a gain of 46%—the largest such increase since September 2009. “The natural gas market really began to gain upside momentum in early August when extended weather forecasts began to show it was likely going to be a much hotter month than initially expected,” said Richey. Once natural-gas futures broke out to fresh 2020 highs, “there was a new bullish technical dynamic that further supported the August uptrend while a series of tropical storms and hurricanes increasingly threatened production in the Gulf of Mexico,” he said. If temperatures remain above average in the weeks ahead, “supporting unseasonably high power demand for air-conditioning use, then the nat gas market will maintain a bid and we could see prices continue to approach $3,” Richey said. Focus will shift from above average temperatures to below average temperatures as the market approaches the winter supply withdrawal season, “and if we see a cold start to winter into the end of the year, the rally will be able to extend to new highs,” he said."}]}