{"article": [{"url": "https://www.marketwatch.com/story/florida-man-uses-coronavirus-aid-money-to-buy-a-318000-lamborghini-2020-07-28", "published": 1595966780.0, "headline": "Florida man allegedly uses coronavirus aid money to buy a $318,000 Lamborghini", "body": "Fund payroll, take care of employee benefits, pay the mortgage, cover utilities, buy a Lambo? Apparently, that last one doesn’t quite qualify as a permissible cost under the Paycheck Protection Program, but that allegedly didn’t stop one Florida man from putting some of his coronavirus aid money toward buying a $318,000 Huracán EVO. David Hines, whose business was in the red by more than $30,000, received a $4 million loan from the government and soon took to the streets of Miami Beach in his fancy Italian sports car. As if the Lambo wasn’t enough, Hines also splashed $4,600 while shopping at Saks Fifth Avenue as well as thousands more on fancy hotels and jewelry, according to the Washington Post. Maybe, just maybe, he should have kept a lower profile. Hines was arrested and charged with making false statements to a lending institution, bank fraud and engaging in transactions in unlawful proceeds. “Collectively, Hines falsely claimed his companies paid millions of dollars in payroll in the first quarter of 2020,” Bryan Masmela, a U.S. Postal inspector, said in an affidavit. “State and bank records, however, show little to no payroll expense during this period.” A lawyer for Hines said he’s “anxious” to tell his side of the story. “David is a legitimate business owner who, like millions of Americans, suffered financially during the pandemic,” he told the Post, while acknowledging the severity of the allegations. The Miami Herald reported that federal investigators linked Hines with the sports car after he was involved in a hit-and-run accident earlier this month. When the bank froze Hines’ corporate accounts, they showed a balance of $3,463,162 but no repayments on the loans."}]}