{"article": [{"url": "https://www.marketwatch.com/story/whats-it-like-to-own-an-audi-e-tron-2020-09-24", "published": 1600924340.0, "headline": "Whatâ\u0080\u0099s it like to own an Audi e-tron?", "body": "Until the recent acquisition of an Audi e-tron, our family couldnâ\u0080\u0099t find an EV that fit our needs. Like most American families, weâ\u0080\u0099ve had a midsize crossover SUV stealing space in our garage for more than a decade. Itâ\u0080\u0099s easy to get used to all that interior volume. In our case, the slightly taller design allows for easier loading and unloading of kids and car seats into the back seat.The competition TheÂ Tesla Model XÂ andÂ Jaguar iPaceÂ were both on our radar. However, we wanted something with more room than the Jag. And we could do without the flashiness of the Tesla TSLA, +1.89% Â . TheÂ Audi e-tronÂ seemed ideal. The handsome design of the e-tron echoes other Audi crossovers without looking too futuristic. Itâ\u0080\u0099s also the perfect size, only slightly larger than the Q5 we used to own but much roomier on the inside, particularly in the back seat. Like most Audis today, the interior is modern, plush, and dressed in beautiful materials. See: What itâ\u0080\u0099s like to drive a Tesla Model Y It might sound strange, but electric driving range was less critical for our family. Most of the time, the vehicle would be driven 30 to 50 miles a day. We have a secondary gas vehicle that can handle long family road trips. So the 204-mile EPA range is plenty.The drive Our $87,025 Siam Beige Prestige e-tron arrived in July wearing 21-inch wheels and just about every option, including the towing package ($650), cold weather package ($900), and rear side thorax airbags ($400). First impressions? I was surprised at how well the car rode, considering the low profile 21-inch tires. Itâ\u0080\u0099s smoother than our old Q5 as well as the Mercedes GLC 300 we recently leased, and the e-tronâ\u0080\u0099s overall structure feels robust, even when driven through a field of potholes. The interior is forward-looking and techy but easy to navigate too. The overall experience is more A8 than Q5 in terms of the quality of the furnishings and the serenity of the drive experience. The e-tron is reasonably quick. It handles nicely in Dynamic driving mode, with the air suspension lowered down. Even in that more aggressive vehicle setting, the e-tronâ\u0080\u0099s suspension is compliant. But honestly, we rarely push the handling limits of the e-tron. This car spends most of its time in Efficiency mode plodding along relatively straight and uninteresting roads â\u0080\u0093 commuting, fetching kids and running errands.Road tripping Weâ\u0080\u0099ve taken the e-tron on a few road trips and itâ\u0080\u0099s been an excellent companion. However, on one weekend trip to Legoland California, we ran out of space. The e-tronâ\u0080\u0099s cargo hold swallowed all the luggage for our family of four but didnâ\u0080\u0099t quite have enough room for our stroller too. So, we had to rent one each day from Legoland. Not a huge deal, but weâ\u0080\u0099d welcome more cargo capacity on a future model. Legolandâ\u0080\u0099s resort has 16-amp 240V charging stations available, which we used. But to fully recharge our half-depleted pack, it required more than an overnight. On that trip, we all noticed how exceptionally quiet and isolated from the world this Audi is, more so than other EVs weâ\u0080\u0099ve tested. Our kids fall asleep quicker and easier in this Audi than any vehicle weâ\u0080\u0099ve ever owned. If you have young kidsâ\u0080\u0094you know thatâ\u0080\u0099s important. See: These are the best cars for families in 2020 In terms of EV range, on relatively flat routes, weâ\u0080\u0099ve found the e-tronâ\u0080\u0099s EPA rating of just over 200 miles to be a little conservative. On one trip, we drove the Audi from Los Angeles to Santa Barbara for a weekend. And we didnâ\u0080\u0099t re-charge until we returned home. The car traveled 220.6 miles on a full charge over the mostly freeway route.Turtle mode Interestingly, the e-tron warns you of a â\u0080\u009clowâ\u0080\u009d battery at around 60 miles remaining, then again at 30 miles. When you reach 10 miles or less, it flashes â\u0080\u009cDrive System Warning! Limited Performanceâ\u0080\u009d and shows a tiny bright yellow turtle. Cute. That mode feels like a hyper-restrictive Efficiency mode when you push down on the accelerator. At that point in the trip, we engaged the carâ\u0080\u0099s Range Mode, which added 9 miles to our battery by dialing back the air conditioner and ventilated seats. But unlike some relatively pedestrian EVs weâ\u0080\u0099ve driven, the e-tron doesnâ\u0080\u0099t automatically search and suggest public charging stations nearby when the battery gets critically low, which was a little surprising. On our way home, we took a downhill canyon route, which put some range back into the battery pack thanks to the carâ\u0080\u0099s regenerative braking. You can dial in more regen temporarily by tapping a paddle shifter on the steering wheel. Or you can set the regen level manually through the infotainment system. But on this trip, we let the Audiâ\u0080\u0099s default mode decide how much to use. By the time we reached the Pacific Coast Highway at the bottom, we had put 4 miles back into the pack. Not bad. Read: A plug-in hybrid Jeep is coming. Check out the Wrangler 4xe On that trip, we averaged 4.3 km per kWh according to the display, which is about 2.7 miles per kWh. In the 1,100 miles weâ\u0080\u0099ve driven the car, weâ\u0080\u0099ve averaged 3.5 km per kWh or about 2.2 miles per kWh.Charging at home We decided to buy a ChargePoint 32A home charging station for our garage mainly out of convenience. Yes, we could have used the supplied portable charger that comes with the car. But that would require pulling it out of the e-tronâ\u0080\u0099s â\u0080\u009cfrunkâ\u0080\u009d every time we needed a charge. And since we needed to wire our garage for 240V anyway, it made sense to permanently mount a Level 2 charger. The sleek design of the ChargePoint charger appealed to us more than other home chargers we cross-shopped. And it works great. A nearly depleted battery will fully charge about 13 hours. The downside? It cost over $500, not including the installation. The ChargePoint app is easy to set up so we can monitor charging from our phones, turning it on and off as well as schedule charging at off-peak times when rates are lowest. You can also see an estimate of how many miles have been added while charging and how much it cost for the charge. Audiâ\u0080\u0099s own app also monitors and allows you to plan charging as well as perform many functions like locking and unlocking your doors, setting stationary climate control, and locating the e-tron should it be stolen. Also see: 8 new luxury SUVs for under $50,000 Volkswagen VWAGY, +0.14% Â and Audi have a partnership with Electrify America 150 kW DC fast charging, which is exciting. We canâ\u0080\u0099t wait until the network is fully developed with charging stations to allow longer interstate road trips. The app is downloaded on our phones, but we havenâ\u0080\u0099t needed to use one of the stations yet. If youâ\u0080\u0099re thinking three apps for one car seems like two too many, well, we kind of agree.Good and bad Thereâ\u0080\u0099s a lot to love about the e-tron. But there are also a few things that could use some improvement. The steering wheel tilts and telescopes, but itâ\u0080\u0099s not quite enough. Both my wife and I want more range of adjustment, and weâ\u0080\u0099re two very differently sized people. See: Thinking about an EV? Here are the 6 best in 2020 Though the shifter is handsome, itâ\u0080\u0099s a little awkward to use, and it doesnâ\u0080\u0099t like to be shifted quickly from Park to Drive. Your foot needs to be pressing with enough pressure on the brake pedal to allow shifting, more than most gas cars. The tiny Park button on the end of the shifter can be tough to find sometimes. In Drive, the e-tron will roll backward on the gentlest slope as soon as you lift your foot from the brake. You expect the vehicle to provide some resistance and hold you there as a gas car would, but it doesnâ\u0080\u0099t. Oddly, there is a hill holder function but it releases too quickly when you lift your foot from the brake. Also see: Toyota brings back the Venza as a hybrid only, and it has a lot going for it In terms of the carâ\u0080\u0099s electronics, we like most of the systems â\u0080\u0093 and we love the functionality of the touch screen. However, it would be helpful to be able to tune the safety systems to our preferences a bit more. The cross-traffic alert, which we rely upon on our tightly-packed street, does not warn you quickly and aggressively enough if traffic is crossing behind the car. On the contrary, the parking sensors are highly sensitive and very loud. Pulling into our garage every day is accompanied by a symphony of long, sustained beeps, even though we have plenty of space. That said, the 360-degree view camera weâ\u0080\u0099ve found to be helpful when negotiating tight, unfamiliar spots.Conclusion Those are small critiques of an otherwise incredibly comfortable, luxurious, and smart EV. Weâ\u0080\u0099ve just begun our adventure with this car, but weâ\u0080\u0099re happy so far. If given the choice would we choose the e-tron again? Absolutely. This story originally ran on KBB.com."}]}