{"article": [{"url": "https://www.marketwatch.com/story/powell-says-its-tough-for-fed-to-boost-lending-to-smaller-businesses-11600791085", "published": 1600777160.0, "headline": "Powell says itâ\u0080\u0099s tough for Fed to boost lending to smaller businesses", "body": "U.S. Treasury Secretary Steven Mnuchin, on left, and Federal Reserve Chair Jerome Powell share an elbow bump greeting prior to the start of a House Financial Services Committee hearing Tuesday. POOL/AFP via Getty Images Federal Reserve Chairman Jerome Powell said Tuesday the central bank would have to start from scratch if Congress wants it to make smaller loans to U.S. companies. Democrats, led by House Financial Services Committee Chairwoman Rep. Maxine Waters of California, want the Fed to do lend more for companies hurt by the coronavirus. At a hearing on Tuesday, Waters suggested that the Fed and Treasury Department lower the minimum size of the loans under the Main Street Lending Program to $100,000 from the current $250,000 threshold. Powell pushed back on this idea. He said that there was little demand for loans below $1 million. And lowering the threshold would mean the Fed would have to start over with the program. â\u0080\u009cExtending credit in those small quantities would require a facility built from the ground that would be quite different than Main Street,â\u0080\u009d Powell said. â\u0080\u009cIt wouldnâ\u0080\u0099t look like the current Main Street facility now. Itâ\u0080\u0099s just a very different kind of thing,â\u0080\u009d he added. Treasury Secretary Steven Mnuchin said â\u0080\u009cthereâ\u0080\u0099s not more we can doâ\u0080\u009d to make the Fedâ\u0080\u0099s emergency lending programs more used. Mnuchin said some of the $454 billion allocated for the lending program could be shifted to better use. Some lawmakers have criticized the Treasury for not wanting the lending program to take losses. But Mnuchin stessed this wasnâ\u0080\u0099t the case. â\u0080\u009cWe do expect to take losses on that,â\u0080\u009d he said. Powell said smaller business loans would be better handled with grants from the Paycheck Protection Program, which provided about $500 billion in loans to small businesses that could be forgiven if they did not lay off their employees. â\u0080\u009cTrying to underwrite the credit of hundreds of thousands of very small businesses would be very difficult,â\u0080\u009d Powell said. He said many of these small loans are based on personal promises. The PPP program expired in August and reauthorizing it has been held up because Democrats and Republicans canâ\u0080\u0099t reach agreement on another coronavirus relief package. Both Powell and Mnuchin told lawmakers it was not easy for the federal government to craft an aid program for the commercial real estate sector. â\u0080\u009cItâ\u0080\u0099s an issue. We donâ\u0080\u0099t have a solution. I wish we did,â\u0080\u009d Mnuchin said. The Treasury Secretary said reauthorizing the PPP program might be the answer so that firms can pay their rent and landlords can pay their mortgages. Stocks were mixed on Tuesday with the Dow Jones Industrial Average DJIA, +0.56% down slightly while the S&P 500 index SPX, +0.87% was up a bit."}]}