{"article": [{"url": "https://www.marketwatch.com/story/coronavirus-update-global-case-tally-tops-8-million-and-states-reopen-businesses-even-as-infections-and-hospitalizations-rise-2020-06-16", "published": 1592324960.0, "headline": "Coronavirus update: Global case tally tops 8 million and states reopen businesses even as infections and hospitalizations rise", "body": "The number of confirmed cases of the coronavirus illness COVID-19 globally climbed above 8 million on Tuesday, and many parts of the U.S. showed rises in infections even as officials continued their push to reopen economies and end lockdowns. Arkansas’s daily growth rate remains above 5%, while six states — Arizona, South Carolina, Alabama, Arkansas, North Carolina and Tennessee — have daily growth rates of more than 3%, according to J.P. Morgan analysts. “ ‘The administration’s argument that less testing means fewer COVID-19 cases exist is absurd.’ ” — Kyle Herrig, Accountable.US “Eight states ... have a five-day moving average case growth [of] 50 basis points above their 14-day [moving average],” analysts led by Gary Taylor wrote in a Tuesday note to clients, noting that those states make up about 14% of the U.S. population. Ten states had record levels of hospitalizations on Sunday, according to data obtained by the Washington Post, namely Alabama, Arkansas, California, Florida, Nevada, North Carolina, Oklahoma, South Carolina, Tennessee and Texas. Yet states are still moving fast to reopen shops and other businesses, and in some areas the wearing of face masks has become part of a culture war. See: Why do so many Americans refuse to wear face masks? California is reopening malls, cinemas and museums, raising concerns among health-care experts as its numbers start to tick higher again. Vice President Mike Pence on a call with state governors on Monday actively encouraged them to echo the administration’s stance that the increase in cases is due to an increase in testing and only reflect what he called “intermittent spikes,” the New York Times reported. Pence — who also had an op-ed published Tuesday in the Wall Street Journal, wherein he credited President Donald Trump with having “rallied the American people to embrace social-distancing guidelines” — was offering a variation on the message voiced by Trump earlier Monday. “If you don’t test, you don’t have any cases,” Trump had said. “If we stop testing right now, we’d have very few cases, if any.” Critics were unimpressed by the White House’s emerging argument. “The administration’s argument that less testing means fewer COVID-19 cases exist is absurd,” said Kyle Herrig, president of the nonpartisan advocacy group Accountable.US. “The president and his allies pushed states to reopen before they had the testing resources to do so safely. Now that coronavirus infections are spiking in states across the country, Trump and Pence again want to shift the blame for their own administration’s failures.” Don’t miss:Is America’s most masked city losing its grip on safety? Michael Osterholm, head of the Center for Infectious Disease Research and Policy at the University of Minnesota, reiterated his position on MSNBC on Tuesday that the virus “won’t rest” till 60% to 70% of the population has been infected. “We have 21 states where cases are going up and quite dramatically, and it’s not just testing, but more people are testing positive and in some places hospitals are overflowing,” he said. One city was taking notice of the renewed public-safety concerns. Miami, one of Florida’s most populous cities, is putting its reopening on pause, according to Mayor Francis Suarez, as ABC News reported. Florida Gov. Ron DeSantis, a Trump-aligned Republican, ended his stay-at-home order on May 4, against the advice of health experts. At the time, the Sunshine State was counting about 680 cases a day. As of June 14, the state’s seven-day rolling average had climbed to 1,661 a day. Daily confirmed new cases — three-day moving average shown — in Florida. Johns Hopkins University Don’t miss:The surge in coronavirus cases in some states isn’t part of a ‘second wave’ See:Americans haven’t been this unhappy in 50 years: pollWhat are the latest tallies? There are now 8.08 million confirmed cases of COVID-19, and at least 437,939 people have died, according to data aggregated by Johns Hopkins University. At least 3.9 million people have recovered. The U.S. has the highest case toll in the world at 2.12 million and the highest death toll at 116,250. Brazil has 888,271 cases and 43,959 fatalities, the data show, the second highest death toll in the world. Russia has 544,725 cases and 7,274 fatalities, followed by India with 343,091 cases and 9,900 deaths. Read also:United, other major airlines tell passengers to wear face masks or risk getting banned The U.K. has 299,594 cases and 42,054 deaths, the highest death toll in Europe and now third highest in the world. Two early hot spots, Spain has 244,328 cases and 27,136 deaths, while Italy has 237,290 cases and 34,371 deaths. Peru, France, Iran, Germany, Chile, Turkey, Mexico, Pakistan, Saudi Arabia, Canada and Bangladesh are next and all ahead of China, where the illness was first reported late last year. China has 84,378 cases and 4,638 deaths. China has shut down parts of Beijing after a fresh cluster of cases and has restricted travel to other regions. Elsewhere, New Zealand recorded its first cases in weeks when two travelers from the U.K. tested positive. The Philippines started to reopen its economy after an almost three-month lockdown. The Philippines has 26,781 confirmed cases of the virus and 1,103 deaths, according to the Johns Hopkins data.What’s the latest medical news? A commonly used steroid reduced deaths in hospitalized COVID-19 patients who were on ventilators or receiving oxygen support, according to a snapshot of data from a clinical trial in the United Kingdom, as MarketWatch’s Jaimy Lee reported. The randomized study, which is being conducted by the University of Oxford, is testing dexamethasone as part of a larger trial evaluating multiple potential treatments for COVID-19. About 2,100 patients received a low dose of dexamethasone for 10 days; another 4,300 patients received the standard of care. Though the steroid reduced death in ventilated and oxygen-receiving patients, it did not benefit patients with COVID-19 who did not require respiratory support. The trial’s steering committee had halted enrollment in the dexamethasone arm on March 8. Oxford researchers said in a news release that they plan to publish the full clinical details “as soon as possible.” “Dexamethasone is the first drug to be shown to improve survival in COVID-19,” Dr. Peter Horby, a chief investigator for the study, said in the news release. “The survival benefit is clear and large in those patients who are sick enough to require oxygen treatment.” In the U.S., Gilead Sciences Inc.’s GILD, +0.82% remdesivir is one of the few treatments to have an emergency-use authorization as a COVID-19 therapy. The Food and Drug Administration on Monday revoked the emergency authorizations granted in March to hydroxychloroquine and chloroquine, two decades-old malaria drugs that were touted by Trump and allies as a potential treatment despite a lack of supporting evidence. On Monday, the FDA warned that the two drugs could adversely affect remdesivir if used in combination and would reduce its efficacy. What’s the economy saying? Sales at U.S. retailers roared back in May as the economy started to reopen and claw its way out of the recession created by the pandemic. Retail sales jumped a record 17.7% last month, the government said Tuesday. Economists polled by MarketWatch had forecast an 8.5% increase. Sales had tumbled by a record 14.7% in April and 8.2% in March, revised statistics show. The rebound in sales largely reflects the loosening of restrictions on business activity after two months of stay-at-home orders. Along with pent-up consumer demand, federal tax payments to families and more generous unemployment benefits also helped stoke higher sales. Still, sales remain 6% lower compared to the same month in 2019, showing the lingering damage caused by the lockdown of the economy. Read:Clothing stores, not bars and restaurants, took the biggest sales hit from the coronavirus “The strength of retail sales is testimony to the power of reopening the economy, even partially. It is also a testimony to how big the decline in activity was in the three months through April,” said chief economist Chris Low of FHN Financial. See now: The coronavirus recession may already be over, but it’s a long uphill climb to ‘normal’ A separate report showed business inventories declined 1.3% in April.What are companies saying? The IPO market continued to recover from a pandemic-induced lull in March, April and May, with the pricing of the biggest deal so far this year. Royalty Pharma RPRX, -0.04%, a buyer of biopharmaceutical royalties, priced its IPO late Monday at the high end of its range and upsized the deal, pointing to strong demand from investors, which was later borne out in open trading. The company sold 77 million shares priced at $28 each to raise $2.2 billion. It originally planned to offer 70 million shares. That puts it ahead of the previous biggest 2020 deal, the IPO of Warner Music Group Corp. WMG, +0.54%, which raised $1.925 billion for the parent of Atlantic Records, Warner Records and Elektra Records. “Royalty Pharma is highly profitable and generates strong cash flow, and it intends to pay a dividend with 2.3% yield at the midpoint,” said Renaissance Capital, a provider of institutional research and IPO ETFs, in commentary. Read also:Mad dash for cash drives biggest month for follow-on offerings since the financial crisis The shares, trading on the Nasdaq under the ticker symbol “RPRX,” closed Tuesday with a 60% gain from the IPO pricing level. There were 13 banks underwriting the deal, led by J.P. Morgan. The deal is the first of five expected to price this week, all of them in the health-care and biotech sectors. Elsewhere, Citigroup assigned Apple Inc. AAPL, +1.74% its highest stock-price target among Wall Street analysts listed on FactSet. Analyst Jim Suva raised his target for the iPhone maker to $400, up from $310, while sticking with a buy rating. Suva is expecting Apple to benefit from the upcoming 5G upgrade cycle, and, while it may start selling its new 5G phones a month or so later than usual in the fall, the company “will likely have a strong 5G product offering in time for Christmas 2020.” Suva said he sees room for the company to gain share from Huawei, which he estimates could drive about $8 billion in incremental sales. Suva predicted that the services business could get a boost from growing adoption of Apple Pay due to the pandemic and a rebound for the Apple Care business once the new iPhone comes out later this year. Apple may also debut a bundled offering for some of its services, including music, video, news and gaming, he wrote. Other companies continued to announce bond and equity offerings to bolster liquidity hurt by the crisis, and to offer updates on sales and earnings. Here are the latest things companies have said about COVID-19: • Amazon.com Inc. AMZN, +3.01% is working to open source its new “Distance Assistant” technology, which helps people maintain 6 feet of distance from others. Amazon engineers developed it as part of new processes and workstations during the pandemic. Distance Assistant uses artificial intelligence, machine learning and cameras to alert people on a 50-inch monitor when they are fewer than 6 feet away from others. The device only needs an electrical outlet to be deployed. Amazon has installed Distance Assistance in “a handful” of its own buildings, and will be adding hundreds over the coming weeks. “We are also beginning the process to open source the software and AI behind this innovation so that anyone can create their own Distance Assistant,” wrote Brad Porter, a vice president and Amazon engineer, in a blog post on the company website. • Big Lots Inc. BIG, -0.72% completed a previously announced $725 million sale and lease-back transaction with Oak Street Real Estate Capital LLC, with proceeds totaling $550 million after taxes and expenses. The deal involves four distribution facilities in Columbus, Ohio, and Durant, Okla., and other locations. Proceeds will be used for liquidity after paying the outstanding borrowings on its revolving credit facility with $120 million of its cash on hand. However, as the markets settle, the company said it could use the money for “other corporate purposes,” including potential share repurchases. Same-store sales for the second quarter to date, including the first two weeks of June, are ahead of expectations, but are expected to moderate as competitors reopen, stimulus checks are spent and other factors • Caesars Entertainment Corp.’s CZR, -4.36% revenue for the reopened regional properties, for the period they were operating in May and/or June through June 10 were flat to up 2% from a year ago. For the reopened Nevada properties, revenue through June 10 dropped 56% to 58% from a year ago. Operating income for reopened regional properties through June 10 were up 60% to 70%, while income for reopened Nevada properties fell 110% to 120%. The casino operator’s properties were closed as of March 31 as a result of the pandemic, a gradual reopening had begun in Louisiana on May 18, in Mississippi on May 21 and Iowa and Missouri on June 1 and Nevada on June 4. • Car technology company Dana Inc. DAN, +0.33% launched an offering of $400 million in senior notes that mature in 2028. Proceeds will be used to repay debt under the company’s revolving credit facility and for general corporate purposes. The company is planning to terminate an undrawn $500 million bridge loan that it entered into in April. • McDonald’s Corp.’s MCD, -0.43% U.S. same-store sales were down 12% for the quarter through May 31. The fast-food giant experienced a 19.2% decline in April and a 5.1% decline in May with 99% of locations operating in both months. As of June 15, nearly all McDonald’s restaurants have drive-through, delivery or take-out service with about 1,000 stores offering dine-in service with limited seating. Globally, same-store sales for the quarter-to-date through May 31 fell 29.8% with 95% of locations around the world open for business as of June 15. McDonald’s is offering franchisee assistance as well as help for those locations that rely heavily on delivery service. And McDonald’s will spend $200 million in advertising around the world to aid in the recovery, with most of it recorded in the second quarter under SG&A (selling, general and administrative expenses). • J.P. Morgan said the New York Times Co. NYT, -3.79% is seeing continued momentum for subscriber growth as a result of the protests over the killing of George Floyd by a Minneapolis police officer. Analyst Alexia Quadrani reiterated the overweight rating she’s had on the stock since April 2018, but raised her price target to $50, which is 19% above current levels, from $42. While growth of monthly active users and mobile app downloads have slowed since the heights of the pandemic in March and April, “recent protests appeared to have contributed to elevated growth for both metrics.” The company has succeeded in raising prices on promotional subscribers, with about 690,000 tenured subscribers “graduated” to the higher $17 price point. Other media companies have suggested that advertising spending bottomed out in April. • Sonic Automotive Inc. SAH, -1.02% provided Tuesday an earnings update for the second quarter that was better than expected, with the auto retailer’s Chief Executive Jeff Dkye saying sales have experienced a “V-shaped recovery” as the reopening of the economy continues. The company expects second-quarter net earnings per share of 23 cents to 33 cents, well ahead of the FactSet consensus for a loss of 48 cents a share. On a same-store basis for franchised dealerships, new vehicle unit sales volume fell 10% so far in June, after falling 20% in May and 40% in April, while used vehicle unit sales rose 7% in June, after declining 8% in May and 32% in April. The company expects to report second-quarter results on July 27. • Square Inc.’s SQ, +2.06% Cash App unit acquired Verse, a startup in Spain that offers the ability to send cash between users, and Square shares neared a 52-week high. Square’s Cash App also allows for person-to-person transfers of funds, but is only available in the U.S. and U.K. The company plans to allow Verse to continue operating autonomously in Spain while supporting it with technology and resources. The San Francisco–based financial-technology company, which shares its CEO with Twitter TWTR, -0.23%, did not disclose a purchase price for Verse, but a report in Spanish put it in a range between €30 million and €50 million. • Tesla Inc. TSLA, +1.89% and Travis County, Texas, are negotiating the terms of a possible incentives package to bring the company’s next factory to the area, according to a report in the Austin American-Statesman Monday. County commissioners are scheduled to discuss the deal in an executive session Tuesday, and a vote is expected “in the coming weeks,” the newspaper said, citing people with knowledge of the proceedings. Tesla reportedly has shortlisted Austin and Tulsa, Okla., as the possible locations for the plant, which would be its second U.S. car-making factory after its longstanding plant in Fremont, Calif. It was unclear whether the discussions in Texas meant that the Austin area had been selected as the location or if the company continued to discuss the matter with other locations. CEO Elon Musk has threatened to pull out of California in protest at stay-at-home orders that forced the temporary closure of the Fremont plant. • WW International Inc.’s WW, +3.96% digital subscriptions boosted numbers during the pandemic. Subscriptions rose 7% to 4.9 million in the second quarter, consisting of 3.8 million digital subscribers, and 1.1 million studio and digital subscribers. “Starting in the middle of April 2020, digital recruitment trends returned to growth on a weekly basis, compared to the prior year period,” WW said. “This weekly growth trend has accelerated since then and is now trending ahead of the weekly recruitment growth rates in the first quarter of fiscal 2019 prior to the escalation of COVID-19 in mid-March.” Coronavirus Update: Global Cases Top 8 Million, Fed’s Bond-Buying Plan"}]}