{"article": [{"url": "https://www.marketwatch.com/story/we-are-saving-every-penny-we-can-what-life-could-look-like-for-this-66-year-old-man-when-he-loses-all-his-unemployment-benefits-next-month-2020-06-03", "published": 1594647980.0, "headline": "'We're saving every penny we can': What life will look like for this 66-year-old man when his extra $600 unemployment ends", "body": "Ray Maslyk will stop receiving unemployment benefits both at the federal and state level by the end of July. Ray Maslyk Two-thirds of laid-off Americans are receiving more money from their unemployment benefits than they did from their lost jobs. That's largely because the $2.2 trillion stimulus package, known as the CARES Act, temporarily allocates an additional $600 a week on top of state unemployment benefits to Americans who are out of work due to the pandemic. Critics of the extra cash say that employers who want to rehire former workers simply cannot offer enough pay to compete with those generous unemployment benefits. They also argue that the extra $600 disincentivizes some people to return to work, because they can earn more money from not working. That's not the case for Ray Maslyk. Maslyk, 66, is grateful to be receiving $1,121 a week in unemployment benefits, even though that is far less than his weekly pay from the $70,000-a-year position he started in early January as a lead recruiter for a hotel chain based in Fort Lauderdale, Fla. He's been working in human resources for hotels and restaurants, primarily focusing on recruiting, for the past 15 years. Before moving to Florida, he worked for a furniture company that had 11 stores in the Virginia Beach area. He left that position once the company started closing some stores last year because he felt there was \"more opportunity for me out there.\" Little did he know that the new position he relocated for would only last a matter of months. Maslyk would gladly forfeit his weekly unemployment check if he could get his job back - or any job, for that matter, he told MarketWatch. He heard that some of his coworkers were being hired back with 60% pay cuts. But he's already been informed that the company won't be able to rehire him. Related: The extra $600 Americans receive in weekly unemployment benefits ends in July - how that could cost the U.S. more jobs He says he would happily take a full-time job that paid him less than what he's been making on unemployment benefits. Landing a permanent position is more important to him than the salary, Maslyk told MarketWatch. \"That'll take me through the end of the year or next year, rather than stay on unemployment which ends in July and then panic.\" July 25, he said, is the last day he will be receiving the extra $600 in unemployment benefits.That's because the CARES Act calls for these payments to end \"on or before July 31,\" and states make these payments on a weekly cycle that ends on Saturday or Sunday. “ The extra $600 he and his wife have been receiving every week since the second week of March he said has been \"a godsend to just keep attempting to live at least 50% of our lifestyle.\" ” That's if lawmakers don't pass the HEROES Act, which would, among other things, extend the extra $600 federal unemployment benefit to January. Several other proposals call for sliding scale of supplemental unemployment benefits that are tied to states' jobless rates. On top of this, his wife, Brenda, 53, was also laid off from her job as an assistant manager at a laundromat. She's been receiving $766 a week in unemployment benefits. After July, she'll be receiving just $166 a week when the supplemental $600 benefit expires if lawmakers don't take action to extend the program. The two of them have been living together in a hotel room since they moved to Florida from Virginia Beach in January. At first, Maslyk's employer was covering the cost of staying at a hotel until he could find more permanent housing. On March 9, the hotel owner told him that because of the pandemic, they'd have to kick him out. “ 'We're saving every penny we can, we're not even looking at non-essential items because we can't afford to do that right now' ” \"That left me with no roof over my head because we hadn't signed a lease and we didn't want to sign a lease since my position was eliminated, so we jumped into another hotel,\" he said. It's costing them $2,000 a month to live there, he said. He's fairly confidant that they will raise their nightly rates in the fall, in which case he will have to move regardless of whether he secures a new job. \"I have never moved somewhere and then looked for a job. I've always moved because I had an offer in that city so that's another scary thing for me,\" he said. The extra $600 he and his wife have each been receiving every week since the second week of March has been \"a godsend to just keep attempting to live at least 50% of our lifestyle,\" he said. \"If we didn't have the $600, we wouldn't have even been able to stay here,\" he added. Aside from the hotel costs, they've been using their unemployment benefits to cover food, auto insurance payments and other essentials. \"We're saving every penny we can, we're not even looking at non-essential items because we can't afford to do that right now,\" Maslyk told MarketWatch. \"It's not like we're on vacation. We buy groceries for dinner and save as much money as we possibly can, not knowing what the future holds for us and particularly once we lose $600.\" \"When that drops off at the end of July, it's a huge concern because I'm 66 years old, and to find a position at this age is a challenge.\" Employers, he thinks, are more hesitant to hire someone his age \"because they don't know how long you're going to stick around.\" Meaning they don't want to hire someone who will be on the job for six months and then decide to retire, he said. That hasn't stopped him from applying every day to more positions. But companies have been slow to move on him. \"I've had companies that will talk to me and say 'Let me give you a call back in three weeks,'\" Maslyk said. He said he'd be willing to relocate anywhere in the country if he landed a new job. \"If someone comes running and says: 'Hey we need a recruiter,' I'm going to be there.\" In recent weeks the Trump administration has hinted at enacting return to work bonuses to incentivize people who are receiving unemployment benefits to seek out job opportunities. \"But what about people like me whereby our jobs have been eliminated?\" Maslyk said. \"I wish so badly I could get to these senators that are attempting to reward people for going back to work and present this question.\""}]}