{"article": [{"url": "https://www.marketwatch.com/story/gilead-sciences-agrees-to-sell-europe-up-to-500-000-courses-of-remdesivir-11602163256", "published": 1602263420.0, "headline": "Gilead Sciences agrees to sell to Europe up to 500,000 courses of remdesivir", "body": "Gilead Sciences will sell Europe up to 500,000 courses of its antiviral drug remdesivir ulrich perrey/Agence France-Presse/Getty Images Gilead Sciences said on Thursday that it has agreed to supply Europe with up to 500,000 courses of remdesivir, as the region looks to boost its stockpile of the antiviral drug amid a surge in COVID-19 cases. The deal with the European Commission (EC) covers purchases of the drug for the next six months for 36 countries: the 27-nation European Union, the U.K., Albania, Bosnia & Herzegovina, Iceland, Kosovo, Montenegro, North Macedonia, Norway, and Serbia. “We are leaving no stone unturned in our efforts to ensure that safe and efficient therapeutics are available against COVID-19,” said Stella Kyriakides, commissioner for health and food safety. The Commission said all participating countries can now place their orders to procure Veklury — the brand name for remdesivir — directly. Gilead GILD, +0.82% said it would begin fulfilling orders from Oct. 12. “We’ve been ramping up production and rapidly expanding the supply of remdesivir to meet European real-time demand and support national stockpiling of the medicine for current and future surges of COVID-19,” a spokesperson for Gilead said in an emailed statement to MarketWatch. The agreement comes amid a Europe-wide surge in the number of SARS-CoV-2 coronavirus cases. The World Health Organization warned on Oct. 6 that countries across the region are reporting “rising levels of COVID-19 fatigue.” On Wednesday, the U.K. reported 14,162 new cases, taking the total to 544,275, while Spain’s health ministry confirmed 5,075 in the past 24 hours. Read: Prepare for a ‘marathon’ and two years of wearing masks to battle COVID-19, says prominent Spanish virologist Veklury and the steroid dexamethasone are the only authorized drugs in Europe to treat COVID-19. Both were among the drugs given to U.S. President Donald Trump when he tested positive. Read: President Trump is prescribed a third drug to combat his COVID-19 infection In May, the U.S. Food and Drug Administration authorized the emergency use of remdesivir for COVID-19 patients who need extra oxygen or ventilators to help them breathe. It extended the emergency-use authorization in August to anyone in hospital with the virus, irrespective of their severity of disease. The antiviral drug, which is administered intravenously, was previously tested as a treatment for Ebola. Gilead has ramped up production of remdesivir to meet increased demand, after research showed it helped shorten hospital recovery times in a clinical trial. Read: Gilead says shorter remdesivir regimen is effective and drug met main goal in government study The company has said it is on track to make more than two million courses this year, increasing supply by more than 400-fold since January 2020. It said it would produce several million more treatment courses in 2021, if required. Thursday’s joint procurement framework contract follows the EC’s contract with Gilead to secure 33,380 treatment courses of Veklury that have been distributed across the EU and the U.K. since August. The contract was financed from the Commission’s Emergency Support Instrument, worth a total of €70 million ($82 million)."}]}