{"article": [{"url": "https://www.marketwatch.com/story/increased-wait-times-for-covid-19-test-results-coincide-with-higher-rates-of-infection-among-younger-people-2020-07-15", "published": 1594840280.0, "headline": "Increased wait times for COVID-19 test results coincide with higher rates of infection among younger people", "body": "The average New Yorker is now getting their COVID-19 test results back in three days, Mayor Bill de Blasio said on Wednesday, as the city works against a national “logjam” in diagnostic testing. This week, test result time has started to “rapidly” decrease in New York City, de Blasio said, though with the caveat that the data was preliminary. “Based on the latest information, the average — this is not everyone — but the average for test results is down to three days.” That’s roughly twice as fast as the nation’s leading laboratories, which this month revised their expected turnaround times up to a week or more as cases surge across the country. Earlier this week, de Blasio said the national “logjam” had slowed down test results in New York, where some 40,000 people are tested everyday. Potentially elongated wait times came at a moment when the virus is spreading fastest among young adults, a demographic that is more likely to be asymptomatic or only mildly ill, and who have shown to be more cavalier about social distancing and other precautions. Some of the most egregious examples of people flouting the mask mandates and distancing guidelines in New York City have been crowds of young adults around bars, restaurants and parks, particularly in Manhattan. See: COVID-19 is far from contained and could rival 1918 flu pandemic that killed 50 million, experts warn Total infections among 18-to-44-year-olds in New York City grew three times as fast as the infections among people 65 and older in the first two weeks of this month, according to data from the city’s health department. Hospitalizations among people 18 to 44 years old rose roughly twice as fast as those 65 and older during that timespan. As in other parts of the country, much of the growth in cases has come specifically from people in their 20s, de Blasio said this week, as he announced a campaign to target that demographic with messaging about taking precautions and getting tested. Cases among 20-somethings have reportedly risen sharply in the Financial District, Greenwich Village and Lincoln Square—all in Manhattan. “We knew it was going to be more challenging for younger people,” said Dr. Jay Varma, a senior adviser to the mayor, on Wednesday, calling the phenomenon “epidemic fatigue.” “They need to sacrifice a lot even though their individual risk of getting severe disease is low,” Varma said. The challenge of quarantining at home while awaiting a test result only grows the longer the results take to come back. The challenge of contract tracing also grows if people who eventually test positive spend more than a week leaving their homes before receiving their result. The city’s public Health + Hospitals system, which has dozens of locations with free walk-in testing, offers the fastest turnaround time, de Blasio said. An email sent to the hospital system seeking comment on why it can provide faster testing was not immediately returned, though the mayor said the city had been pushing “labs to step up.” Inevitably, some New Yorkers will wait longer than others, and in some cases twice as long as they would have waited a month ago — before the surge in U.S. cases inundated national laboratories, where many of the city’s private clinics send tests. Also see: Though New York City rat sightings are down overall, there could soon be an increase In late April, when New York City was still the nation’s leading hot spot, walk-in clinic CityMD sent out an email to patients saying its branches finally had enough tests for anybody who needed one. Results could be expected in three to five days, the email said. Now, the chain, based in New York and Northern New Jersey, has had to update the turnaround time on its website and on the signage across its 120-plus branches, said Joy Lee-Calio, a spokeswoman for CityMD’s parent company, Summit Medical Group. “We have been telling all COVID-19 test patients to expect a minimum seven-day turnaround time for test results, based on guidance from our national lab partners,” she said in an email. “If we could speed up the process, we certainly would.” Indeed, two of the nation’s biggest commercial labs, Laboratory Corporation of America LH, +0.77% and Quest Diagnostics, DGX, +0.33% which combined can process north of 1.7 million tests a week, have seen turnaround times roughly double since mid-June. A month ago, the average wait time for Quest to process a diagnostic test was 2-3 days. On Monday, the company updated that guidance to seven days or more and said it was working to ramp up capacity by 20% by the end of July to handle the surge in U.S. cases. Also see: Moderna’s stock extends rally as experts await details of the coming Phase 3 study of the coronavirus vaccine candidate “We will not be in a position to reduce our turnaround times as long as cases of COVID-19 continue to increase dramatically,” the company said in a news release on Monday. Northwell Health Labs, which processes thousands of tests a day at its in-house laboratories, typically turns around an asymptomatic or mild-case screening within three days, though a patient in immediate care in one of Northwell’s many hospitals in New York state will get a result in a few hours, said Executive Director Dr. Dwayne Breining. “We have multiple tiers of turnaround time, depending on the clinical acuity,” Breining said. Breining acknowledged, however, that the wait time could be longer than three days in some cases because of certain dependencies, such as supply chains, that could be impacted on a nationwide level."}]}