{"article": [{"url": "https://www.marketwatch.com/story/heres-where-trump-and-biden-stand-on-health-care-2020-09-28", "published": 1601303900.0, "headline": "Hereâ\u0080\u0099s where Trump and Biden stand on health care", "body": "President Donald Trump and Democratic challenger Joe Biden are blasting each other over their approaches to health care â\u0080\u0094 long a top issue for voters, and now even more in focus as Americans deal with the coronavirus crisis. The two White House contenders have big differences on Obamacare and Trumpâ\u0080\u0099s handling of the COVID-19 pandemic, but they do have some things in common on health-care matters. Polls suggest Biden has the advantage on health care, with a recent KFF-Cook Political Report survey finding that swing voters in three battleground states preferred the Democratic nominee over the Republican incumbent when it came to this issue. But how do Trump and Bidenâ\u0080\u0099s stances sit with you? To help with that, hereâ\u0080\u0099s a brief look at where theyâ\u0080\u0099ve positioned themselves on a few key health-care topics. Medical coverage: Biden is promising to build on Obamacare, meaning the Affordable Care Act that overhauled the U.S. health-care system XLV, +0.90% Â a decade ago, when the longtime politician was President Barack Obamaâ\u0080\u0099s vice president. The Trump administration is waging a legal fight against Obamacare, arguing that it must be scrapped after federal lawmakers in 2017 zeroed out the individual mandateâ\u0080\u0099s penalty for lacking health insurance. That comes after the failure of Trump and the GOPâ\u0080\u0099s efforts to repeal Obamacare, with the late Republican Sen. John McCain of Arizona casting a decisive vote at one point in 2017. Biden and Trump are both being pulled by a wing of their party on medical coverage, said Kim Monk, an analyst and managing director at Capital Alpha Partners. Progressive Democrats got Biden to â\u0080\u009cdo a proposal that I think for them is a foothold in the door for a more expansive agenda that gets them closer to â\u0080\u0098Medicare for All,â\u0080\u0099â\u0080\u009d she told MarketWatch. Biden is pledging to deliver a public-health insurance option, while â\u0080\u009cMedicare for Allâ\u0080\u009d (which was backed by many of his unsuccessful opponents in the Democratic presidential primary) would be a government-run program that replaces the private health insurance system. He also says heâ\u0080\u0099ll lower the Medicare eligibility age to 60 from 65. â\u0080\u009cWhile the perceived threat of a broad government-run â\u0080\u0098public optionâ\u0080\u0099 would threaten managed-care companies and hospitals, we believe the actual result will be something both managed care and hospitals IHF, +0.36% Â can live with,â\u0080\u009d Raymond James analysts said in a recent note. Meanwhile, Trump â\u0080\u009chas been convinced by the right wing of the party that if they can somehow undo Obamacare, they can sweep in with more market-based reforms, while still protecting pre-existing conditions,â\u0080\u009d Capital Alphaâ\u0080\u0099s Monk said. But there is no clear GOP consensus on an Obamacare replacement, and Trumpâ\u0080\u0099s recent executive order intended to protect those with pre-existing conditions does nothing legally and just proves heâ\u0080\u0099s â\u0080\u009cfeeling some pressure,â\u0080\u009d she added. Trump last week signed the executive order in an effort to address the concerns of Americans with such conditions who have health-insurance protections because of Obamacare and fear those safeguards will disappear. That came as he announced an â\u0080\u009cAmerica First Healthcare Planâ\u0080\u009d and $200 discount cards for Medicare recipients in a speech that conflated some of his administrationâ\u0080\u0099s achievements with policies that are in stages of implementation and others that remain aspirational. Coronavirus pandemic: Biden has repeatedly attacked Trumpâ\u0080\u0099s handling of the coronavirus pandemic, which has left more than 200,000 Americans dead, according to data aggregated by Johns Hopkins University. â\u0080\u009cSo many lives lost unnecessarily because the president is only worried about the stock market SPX, +0.87% Â and his re-election,â\u0080\u009d Biden said in a speech on Sept. 18 in Minnesota. â\u0080\u009cHeâ\u0080\u0099s not protecting America.â\u0080\u009d The Democratic nominee also has said heâ\u0080\u0099ll â\u0080\u009csupport rather than tear down the expertsâ\u0080\u009d and talked about implementing a national mask mandate. Trump has given himself an â\u0080\u009cA+â\u0080\u009d on handling the pandemic, but just a â\u0080\u009cDâ\u0080\u009d on public relations â\u0080\u009cbecause I have fake news.â\u0080\u009d He has touted his Jan. 31 travel restrictions on China, which had the first COVID-19 hotspot, and harped on Biden saying he would shut down the economy again to stop the spread of the coronavirus if experts recommended it. Trump has also defended himself after storied journalist Bob Woodward reported that the president acknowledged playing down the pandemic in its early days, with Trump saying he was trying prevent a panic. Monk said she thinks the Trump administration and Congress have done â\u0080\u009can extraordinary amount, both in terms of tackling COVID directly and in terms of the economic impact,â\u0080\u009d and she praised the â\u0080\u009cOperation Warp Speedâ\u0080\u009d public-private partnership that aims to accelerate vaccine development. But she said there were â\u0080\u009cmissteps in the beginning,â\u0080\u009d and the No. 1 problem for Trump has been communications. â\u0080\u009cStarting with him. I mean just stepping on the message, confusing the message, suggesting political interference in the FDA. Thatâ\u0080\u0099s just been the biggest problem,â\u0080\u009d she said. Related:Trump lashes out amid pandemic at medical research thatâ\u0080\u0099s discordant with his views And see:How Congress is spending trillions in response to the coronavirus crisis â\u0080\u0094 in one chart The August jobs report suggested an economic recovery from the coronavirus recession is still plowing ahead even if the pace of growth has slowed since the start of the summer, as the release showed the U.S. unemployment rate fell to 8.4% last month. About $5 trillion has been spent or committed in response to the pandemic and economic crisis, according to the Center for a Responsible Federal Budgetâ\u0080\u0099s COVID Money Tracker. Drug prices, surprise billing: Both Biden and Trump have made pledges to tackle rising prices for prescription drugs. And theyâ\u0080\u0099ve addressed surprise billing, the high fees charged after a procedure due to discrepancies in insurance coverage and other issues. The president has talked up his recent executive orders on drug pricing, though analysts have dismissed them as â\u0080\u009clargely campaign fodder as each contains limitations or caveats, and is subject to further action.â\u0080\u009d Drug pricing â\u0080\u009cdefinitely is a priority for both parties,â\u0080\u009d Monk said. Biden is likely to be pushed to do something that looks like the drug-pricing bill that passed the Democratic-run House last year, but the measure wouldnâ\u0080\u0099t be able to pass even a Democratic-controlled Senate due to opposition from moderate Democrats, she predicted. Some analysts have described the bill as â\u0080\u009cnuclear winterâ\u0080\u009d for drug makers PJP, +0.30%. To address surprise billing, a president â\u0080\u009ccanâ\u0080\u0099t do it with an executive order, or even with a regulation,â\u0080\u009d Monk said. â\u0080\u009cItâ\u0080\u0099s going to require Congress to act to do it significantly.â\u0080\u009d Related: Democratsâ\u0080\u0099 chances of Senate takeover rise, and that could affect health care, energy and financial services And see:Donâ\u0080\u0099t buy health-care stocks if Democrats sweep the November elections, these contrarian analysts say"}]}