{"article": [{"url": "https://www.marketwatch.com/story/lumber-futures-climb-to-a-record-and-more-than-double-for-the-year-as-pandemic-boosts-demand-2020-09-10", "published": 1599759920.0, "headline": "Lumber futures climb to a record and more than double for the year, as pandemic boosts demand", "body": "Lumber futures have managed to do something no other major commodity has been able to do in the face of the pandemic’s hit to the economy — more than double in price since the start of the year to touch their highest level on record. Futures prices for the front-month September lumber contract US:LBU20 settled at $939 per 1,000 board feet on Thursday, the highest on record, according to Dow Jones Market Data. Prices based on the front months were up by nearly 132% year to date. Both cash and futures hit all-time highs, “exceeding previous highs by a moonshot,” said Greg Kuta, president of lumber broker Westline Capital Strategies, describing the move as a “parabolic, explosive move to the upside.” Lumber demand was expected to fall because of the pandemic, but demand didn’t go away — it just got “delayed,” and now there’s demand growth amid the shelter-in-place ordered imposed to prevent the spread of COVID-19, as some people have decided to move to the suburbs while others, who Kuta referred to as “weekend warriors,” have used the time to do repairs and renovations to their homes. Demand is easily up in the ballpark of 10% to 20% from pre-COVID levels, he said. There’s “still a shortage of wood in the field — at the end-user, retail and distribution level,” said Kuta. The “demand component is still greater than what exists supply wise.” Supplies of lumber had declined in March and April because of restrictions tied to stemming the spread of COVID-19. That probably led to a supply fall of around 15% to 20% in the market, as an eight-week wind-down in operations led to significantly less production, said Kuta. That “doesn’t come back in one fell swoop.” The September lumber contract is currently considered the spot month, said Kuta, referring to the nearest month for delivery. Still, he pointed out that the September contract stands at a “massive discount” to the November contract LBX20, -4.94%, which trades on higher volume, with the spread between September and November at an all-time high. November lumber settled Thursday at $611.40, for a difference of more than $327 from the spot month. Bottom line: The differential is “not normal, not even close,” said Kuta, who sees a wide range for prices in the next several weeks. Cash prices paid on the spot market may vacillate in a range between $500 and $850 in the next four to six weeks, with $450 as a floor and $1,000 as a ceiling, he said. Even so, Kuta doesn’t expect an immediate collapse in physical cash prices, as demand isn’t likely to fall anytime soon. “Companies that buy lumber for home builders typically carry roughly 45- to 90-plus days of working inventory — constantly accumulating inventory based on expected demand,” he said. With COVID, those companies stopped buying, running inventories to the ground, and demand is so high that they haven’t had a chance to rebuild inventory, he explained. “The just-in-time buy model got exposed with COVID and failed miserably, so I expected a return to inventory accumulation” for Q4 2020 and Q1 2021 needs, Kuta said."}]}