{"article": [{"url": "https://www.marketwatch.com/story/when-will-i-get-my-extra-300-a-week-in-unemployment-benefits-why-isnt-everyone-out-of-work-eligible-under-trumps-proposal-2020-08-12", "published": 1597560560.0, "headline": "When will I get my extra $300 a week in unemployment benefits? Why isn't everyone out of work eligible under Trump's proposal?", "body": "President Donald Trump signed four executive orders this month - one of which calls for an additional $300 in federal weekly unemployment benefits from a $44 billion fund set aside for disaster aid. But there are several catches to the order that could leave behind some 6 million Americans who were previously eligible for the extra $600 a week benefit under the $2 trillion CARES Act stimulus package, said Eliza Forsythe, a labor economist and assistant professor at the University of Illinois at Urbana-Champaign. Trump's executive order came after the $600 weekly unemployment benefit expired at the end of July. As a result, the average amount of weekly unemployment benefits Americans received fell to $257 from $812.Americans could start getting the extra $300 in two weeks time There is one not-so-insignificant catch: Republican and Democratic lawmakers failed to reach a compromise on supplemental unemployment benefits during negotiations that took place in the first two weeks of August. So the legality of Trump's order is still in dispute. Senate Majority Leader Mitch McConnell commended Trump's executive order while Republican Sen. Ben Sasse, from Nebraska, labeled it an \"unconstitutional slop.\" “ 'We are concerned about the significant administrative burdens and costs this latest action would place on the states' ” - A joint statement by New York Gov. Andrew Cuomo, a Democrat, and Arkansas Gov. Asa Hutchinson, a Republican House Speaker Nancy Pelosi and Senate Minority Leader Chuck Schumer signaled that they were not willing to budge on the $600 weekly benefit arguing that it is essential to help keep jobless Americans afloat. On the other side of the political spectrum: McConnell and several other Republican senators felt the $600 benefit was too generous, and was akin to paying Americans not to work. Others are more optimistic on the extra unemployment benefit going ahead. \"Within the next week or two\" Treasury Secretary Steven Mnuchin said last week. That's when \"most of the states\" will be able to make the necessary changes to implement the new payment structure, he added. Some state governors, however, warned that it could take longer. Additionally, they said it would not be possible to chip in so that every jobless citizen in their respective states receive at least $100 a week to qualify for the $300 benefit. Only some Americans would only be eligible for the extra $300 \"We appreciate the White House's proposals to provide additional solutions to address economic challenges,\" New York Gov. Andrew Cuomo, a Democrat, and Arkansas Gov. Asa Hutchinson, a Republican, said in a statement put out by National Governors Association, a nonpartisan coalition of governors. \"However, we are concerned about the significant administrative burdens and costs this latest action would place on the states.\" Cuomo is the chair of the NGA and Hutchinson is vice-chair. “ Under the CARES Act, anyone eligible for unemployment benefits from their state got an extra $600. Not this time. ” \"NGA has requested $500 billion in unrestricted state aid and NGA continues to urge Congress and the White House to reach a quick resolution to provide immediate assistance to unemployed Americans. This resolution should avoid new administrative and fiscal burdens on states,\" the statement added. White House Economic Advisor Larry Kudlow disputed their claims, stating that \"we will work with them if there's any complications,\" adding that many state workforce agencies have \"already changed their programs to meet the CARES [Act] demand.\" Initially, Trump's executive order called upon states to dole out an extra $100 a week in unemployment benefits to receive the $300 a week benefit at the federal level, Kudlow said last week. Anyone who gets at least $100 in unemployment benefits from their state would qualify for the extra $300. \"The way we're leaving it now,\" Kudlow said in a Fox News interview. Don't miss: Here's what Trump's payroll tax deferral could mean for your paycheck Under the CARES Act, any American who was eligible for unemployment benefits from their state would automatically get an extra $600. On top of which, self-employed and gig workers who would otherwise not be eligible for unemployment benefits qualified under the $600 under the CARES Act. These types of workers who don't receive a consistent paycheck will remain eligible for unemployment benefits through the end of the year. Unlike traditional salaried workers, self-employed and gig workers often have volatile incomes that are not automatically reported to state workforce agencies. Many of these workers are more likely to receive their state's minimum unemployment benefit, which is below $100 for the majority of states, according to the Department of Labor. Forsythe said this could apply to approximately 5 million workers. Her calculations reveal that nearly 1 million unemployed workers are currently receiving below $100 a week from their respective states and hence would also be ineligible for the extra $300. Coronavirus update: COVID-19 has now killed at least 771,276 people worldwide, and the U.S. ranks 10th in the world for deaths per 100,000 people (51.5), Johns Hopkins University says. As of Sunday, the U.S. has the world's highest number of confirmed COVID-19 cases (5,361,302) and deaths (169,483). Worldwide, confirmed cases are now at 21,261,598. The Dow Jones Industrial Index DJIA, +0.56% closed Friday with a small gain, while the S&P 500 SPX, +0.87% and Nasdaq COMP, +1.39%  closed slightly lower as investors await progress on a vaccine and, as Democrats and Republicans debate the details of the next unemployment benefits, round two of the economic stimulus program. AstraZeneca AZN, +1.16% in combination with Oxford University, BioNTech SE BNTX, +1.23% and partner Pfizer PFE, -0.27%, GlaxoSmithKline GSK, +1.10%, Johnson & Johnson JNJ, +1.39%, Merck & Co. MERK, +1.59%, Moderna MRNA, +0.09%, and Sanofi SAN, -1.48%, among others, are currently working on COVID-19 vaccines."}]}