{"article": [{"url": "https://www.marketwatch.com/story/5-things-to-know-about-health-care-in-retirement-11595367178", "published": 1595399900.0, "headline": "5 things to know about health care in retirement", "body": "Most people receive Medicare Part A (inpatient hospital coverage) for a discount if they have accumulated the qualified 30 quarters of work and for free if they have 40 quarters. An earlier version gave the incorrect number of quarters needed to be eligible for free Part A coverage. Getty Images Waiting for Medicare to cover your retirement health-insurance expenses? Look again. Figuring out Medicare is a minefield. This is not like your employer’s two or three insurance options. There are many more components and Medicare planning comes together more like a puzzle. Compounding the issue, health care is so personal that there are no cookie-cutter answers; each individual’s needs are unique. This is what’s essential to know now — whether retirement is a few years off or early retirement options may be on the table today.Medicare is not free Most people receive Medicare Part A (inpatient hospital coverage) for a discount if they have accumulated the qualified 30 quarters of work and for free if they have 40 hours. Yet that is only one piece of health insurance. Each piece of Medicare coverage has its own deductible as well as coverage. They all have different fees as well. For example, what you are charged for Part B is based on income. The average monthly premium for 2020 is $144.60. There is not a family or couple discount. And starting at age 65 you must pay for it — even if you are not collecting Social Security yet. Plan for it. Be ready. Here are the Medicare basics: Part A is hospital insurance for inpatients and is free in most cases. Part B is Medical for doctors’ services whether on an inpatient or outpatient basis. Cost varies by income. Part C is premium-paid coverage through private plan. Cost varies by plan and coverage. Part D is prescription coverage through Medicare and a private insurance company. Co-pays and coverage varies by plan. Understand your prescription needs. Additional costs come beyond Medicare coverage. They include dental care, eye care, along with deductibles and co-pays. Many people assume long-term care costs of assisted living or home care are covered by Medicare, but this is not true. Medicare coverage is not automatic Signing up is easy. You can do it online. However, if you don’t sign up during a window around your 65th birthday, you will be charged a penalty when you finally do. If you miss this deadline, your monthly premium will increase as much as 10% for the rest of your life. Even if you have been collecting Social Security since age 62, you must sign up for Medicare separately. If you will be waiting to collect Social Security until age 67 or even 70, you still must sign up at age 65. If you are working beyond age 65 and have good health insurance, you still need to take think about Medicare. You may delay signing up as long you as have Part B coverage through your employer. But the employer coverage and Medicare exceptions may mean you need both. One insurance becomes your primary insurance and the other one your secondary coverage. Your current Human Resource person or insurance provider will be able to help. Getting on COBRA for early retirement may be a good move if you are taking early retirement. If you are over 65 and offered COBRA,; however, you most likely will be better off with Medicare. Why? The rule that lets you delay Medicare coverage applies to employer plans. COBRA is not an employer plan. Not knowing this would mean a penalty on your premium every month once you do sign up.You still have to decide among health-insurance policies To pick a plan, you must know what you need for additional medical coverage. Then, you can look at what your options are. Do you qualify for Medicaid because you have limited income and resources? Or do you have an employer insurance plan or veterans benefits? You may not need additional coverage, but everyone needs to understand some details. Medigap, which is also called Medicare supplement insurance, is a private insurance policy that helps fill in the “gaps” of coverage for costs like deductibles and co-pays. Medicare Advantage is a health plan by a private company that contracts with Medicare to provide all your Part A and Part B benefits. Some Medicare Advantage plans cover prescriptions. You can get a Medigap policy, a Medicare Advantage plan or none at all if you are covered elsewhere, like through an employer or spouse’s plan. To distinguish among these options, do your homework before you sign up for Medicare. You can learn more in several ways: Do your research on the Medicare website, which has lots of information, including what’s offered in each state. Reach out to your State Health Insurance Assistance Program (SHIP) that helps sort through different health insurance options. Get objective advice. Contact your local senior center and area nonprofit organizations. Many have workshops to get you started on your educational journey to become comfortable with Medicare and all it entails. Or hire a financial planner or Medicare insurance consultant. However you learn, get educated first and then explore the insurance plans that are offered by different insurance companies in your state. The names and options can be confusing. Only three states have standardized the plans. Massachusetts, Minnesota, and Wisconsin. Only contact a salesperson for an insurance company after you have narrowed down your options and are ready to learn more about their plan. Reading the sales brochure and talking to an agent first may result in you buying more coverage than you need, which means paying more than necessary. For example, Medigap policies have higher monthly premiums because they cover more. You may pay end up paying more with a Medicare Advantage plan in the long run because of copays and deductibles. Or you may choose a plan which does not include your doctor. This will leave you with a personal medical decision that may be heart-wrenching and affect your care. The good news is your choice is not permanent. You can change your Medicare plan every year during open enrollment (Oct. 15-Dec. 7). If your health situation changes or you make a poor choice, you can start the following year with a new plan. Read: What to know before switching to Medicare Advantage You may need a new policy if you move to a new state Planning a move out of state in retirement? Medicare is a federal program, which means it does apply nationwide, so the basic portion is the same wherever you live. But getting informed on the Medigap and Medicare Advantage plans starts all over again. Be sure to review plans and get a Medigap plan for the state you live in (if you decide to go that route), as each state licenses different insurance companies and policies. For example, Vermont, where I live, has a handful of types of supplemental insurance. Massachusetts has many more. If you change your state of residency, you must sign up for coverage in the state you reside in. Luckily, each state also has a SHIP. Medicare won’t always cover you when traveling abroad You finally have the time to travel. However, your health insurance may not cover you when you are traveling out of the country. Before you take any sojourn out of the U.S., be sure to understand what is covered and what is not. Most medical expenses won’t be covered by Medicare or Medicare Advantage programs if you are outside the U.S. or its territories. One exception is that Part A will cover a hospital stay to certain limits. Some Medigap plans do cover you for a short time overseas. Consider paying extra for the medical travel insurance, which is different from travel interruption service as it will cover expenses if you should experience a health crisis overseas. Your travel professional can help find a plan that works for you. The last thing you want after a trip you saved, planned for, and enjoyed is a surprise medical bill. CD Moriarty, CFP is a Vermont-based financial speaker, writer and coach who wants to create financial peace of mind for others. She can be reached through her website. Now read: There is more to picking a place to retire than low taxes — avoid these 5 expensive mistakes"}]}