{"article": [{"url": "https://www.marketwatch.com/story/a-message-hard-to-ignore-new-yorkers-paint-black-lives-matter-in-front-of-trump-tower-2020-07-09", "published": 1594334180.0, "headline": "A message hard to ignore: New Yorkers paint â\u0080\u0098Black Lives Matterâ\u0080\u0099 in front of Trump Tower", "body": "New Yorkers on Thursday gave President Donald Trump a message that should be hard to ignore, painting â\u0080\u009cBlack Lives Matterâ\u0080\u009d on a block of Manhattanâ\u0080\u0099s Fifth Avenue in front of Trump Tower. The city closed off the street and painters stenciled in the massive block letters, filling them in with bright yellow paint. iframe.twitter-tweet { width: 100% !important; } Mayor Bill de Blasio, a vocal Trump critic, took part as well. â\u0080\u009cPresident Trump said we would be denigrating the luxury of Fifth Avenue. Let me tell you: weâ\u0080\u0099re not denigrating anything, we are liberating Fifth Avenue, we are uplifting Fifth Avenue,â\u0080\u009d he said, according to CNN. â\u0080\u009cWhen we say â\u0080\u0098Black Lives Matterâ\u0080\u0099 there is no more American statement, thereâ\u0080\u0099s no more patriotic statement, because there is no America without Black America. We are acknowledging the truth in ourselves and in America. By saying â\u0080\u0098Black lives matterâ\u0080\u0099 we are righting a wrong.â\u0080\u009d iframe.twitter-tweet { width: 100% !important; } Last week, Trump tweeted that the mural denigrated Fifth Avenue, and claimed it was a â\u0080\u009csymbol of hate.â\u0080\u009d Trump used to live at the tower, though he has visited infrequently since becoming president and has changed his official residence to Florida. There were some tense moments Thursday, as some counterprotesters jeered de Blasio and the painters, with some chanting â\u0080\u009cAll Lives Matter.â\u0080\u009d â\u0080\u009cBlack Lives Matterâ\u0080\u009d murals have been painted on streets in a number of cities, including Washington and Oakland, as well as elsewhere in New York, amid a national reckoning on race in the wake of massive protests set off by the killing of George Floyd by Minneapolis police. But activists say more needs to be done. Last month, the Washington chapter of the Black Lives Matter Global Network called the D.C. mural â\u0080\u009ca performative distraction from real policy changes.â\u0080\u009d"}]}