{"article": [{"url": "https://www.marketwatch.com/story/the-man-who-warned-in-2018-that-america-was-unprepared-for-a-pandemic-says-the-us-squandered-every-possible-opportunity-to-control-the-coronavirus-2020-08-04", "published": 1596614000.0, "headline": "The man who warned in 2018 that America was unprepared for a pandemic says: 'The U.S. squandered every possible opportunity to control the coronavirus'", "body": "The man who sounded an alarm that the U.S. was facing a pandemic, and was grossly unprepared to deal with it, has some harsh words for the government's efforts thus far. \"Despite ample warning, the U.S. squandered every possible opportunity to control the coronavirus. And despite its considerable advantages - immense resources, biomedical might, scientific expertise - it floundered,\" Ed Yong, who warned in 2018 of another pandemic, writes in September issue of The Atlantic. \"While countries as different as South Korea, Thailand, Iceland, Slovakia, and Australia acted decisively to bend the curve of infections downward, the U.S. achieved merely a plateau in the spring, which changed to an appalling upward slope in the summer.\" Yong said he has spoken to over 100 health experts since the pandemic began and sums up the U.S. mistakes thus: \"A sluggish response by a government denuded of expertise allowed the coronavirus to gain a foothold. Chronic underfunding of public health neutered the nation's ability to prevent the pathogen's spread. A bloated, inefficient health-care system left hospitals ill-prepared for the ensuing wave of sickness. Racist policies that have endured since the days of colonization and slavery left Indigenous and Black Americans especially vulnerable to COVIDâ\u0080\u009119.\" In New York City, the epicenter of the pandemic in the U.S., was a case study in how some Americans fared better than others. Black and Latino people were hospitalized at twice the rate of Caucasians during the peak of the crisis, data released in May by the City of New York showed. Black New Yorkers were hospitalized at a rate of 632 per 100,000 people, while Caucasians were hospitalized at a rate of 284 per 100,000 people. Black and Hispanic residents were dying at a rate of 21.3 per 100,000, while non-white races were dying at a rate of 40.2 per 100,000, it added. “ 'Chronic underfunding of public health neutered the nation's ability to prevent the pathogen's spread. A bloated, inefficient health-care system left hospitals ill-prepared for the ensuing wave of sickness.' ” - Ed Yong, who in 2018 warned of another pandemic and said the U.S. was not prepared to deal with it, says COVID-19 is a test run for future pandemics. So what can be done? Flattening the curve of new cases through social distancing, testing and contact tracing will help to avoid overwhelming the health-care system during any possible second wave, health professionals say. The U.S. has about 2.8 hospital beds per 1,000 people, according to industry website STAT News, which reports on public health and science issues. \"With a population of 330 million, this is about 1 million hospital beds. At any given time, about 68% of them are occupied. That leaves about 300,000 beds available nationwide,\" it said. Experts say the U.S. must also stock up on medical-grade N95 surgical masks and other personal protective equipment after health authorities in the early days of the coronavirus pandemic told the American public NOT to wear face masks; authorities were concerned it would disrupt the supply of masks to medical professionals working on the front lines. Kay, a nurse at The Brooklyn Hospital who was wearing a garbage bag as protective clothing, told CBS in April. \"It's like something out of the Twilight Zone. I don't think any of us going through it will ever be the same.\" Anthony Fauci, director of the National Institute of Allergy and Infectious Diseases for three decades, acknowledged to MarketWatch in an extensive interview that health authorities in the U.S. did not act swiftly enough with previous pandemics such as HIV/AIDS in the 1980s, and underestimated the seriousness of COVID-19, despite those lessons of the past: \"It was felt to be just a virus that jumps species from an animal to a human, and we found out that was not the case, that it spread very easily from human to human. It rapidly exploded into a major global pandemic.\" However, President Donald Trump disagrees, and hit back at Fauci on Twitter TWTR, -0.23%  last weekend. Replying to a post by CBS News VIAC, -2.34%  of Fauci's testimony that the U.S. should improve its testing abilitie, the president wrote: \"Wrong! We have more cases because we have tested far more than any other country, 60,000,000. If we tested less, there would be less cases. How did Italy, France & Spain do? Now Europe sadly has flare ups. Most of our governors worked hard & smart. We will come back STRONG!\" “ 'It was felt to be just a virus that jumps species from an animal to a human, and we found out that was not the case, that it spread very easily from human to human.' ” - Anthony Fauci, director of the National Institute of Allergy and Infectious Diseases, speaking in an interview with MarketWatch last month. Nearly 53 million people have been tested for coronavirus in the U.S. to date, according to the Centers for Disease Control and Prevention, with more than 5 million or 10% of those testing positive for the virus. Wait times of more than 10 days have become the norm for many Americans. There are, however, stories of people who have had to wait 26 days to get their results. Waiting 10 days for a test defeats the purpose of getting tested as they're less likely to quarantine if they don't believe or don't know they have the virus, health professionals say. Approximately half of the tests being performed daily are conducted by commercial labs such as Quest Diagnostics DGX, +0.33%  and LabCorp. \"Only one state has an average turnaround time of greater than five days,\" said Admiral Brett Giroir, a member of the White House coronavirus task force.\" And yet the Trump administration is trying to block $25 billion for states to conduct testing and contact tracing in the next coronavirus relief bill, people involved in the talks told the Washington Post this month. Democratic lawmakers, in negotiations over a new stimulus bill, have demanded $25 billion for the testing and contact-tracing, over three times what the GOP have suggested. As of Wednesday, COVID-19, the disease caused by the virus SARS-CoV-2, had infected at least 18.5 million people globally and 4.8 million in the U.S. It had killed over 701,085 people worldwide and at least 156,839 in the U.S. The disease is experiencing a resurgence in southern and western states. Cases in California hit 526,982 and deaths reached 9,708 as it reported 6,275 new cases Tuesday and 201 new deaths. New York has the most fatalities (32,725) followed by New Jersey (15,857). The stock market has been on a wild ride in recent months. The Dow Jones Industrial Index DJIA, +0.56%, the S&P 500 SPX, +0.87%  and Nasdaq Composite COMP, +1.39% closed higher Tuesday, as investors tracked round two of the potential fiscal stimulus. The Nasdaq logged its 30th record of 2020 and the S&P 500 ended above 3,300 in a choppy session, as large-cap tech stocks took a breather. Disney DIS, +1.53%  reported a depressing financial performance Tuesday that included a quarterly loss of nearly $5 billion due to COVID-19. How COVID-19 is transmitted"}]}