{"article": [{"url": "https://www.marketwatch.com/story/why-older-americans-might-be-having-trouble-getting-credit-cards-2020-08-25", "published": 1598354000.0, "headline": "Why older Americans might be having trouble getting credit cards", "body": "This article is reprinted by permission from NerdWallet. Whether it’s to earn rewards toward vacations or just finance everyday purchases, there’s strong demand for credit cards among older adults. According to a report from credit bureau Experian EXPGY, +1.38% , baby boomers (those born between 1946 and 1964) carried an average of 4.8 credit cards in the second quarter of 2019, more than any other generation in the report. One might think that an older adult’s chances of getting approved for a new credit card would be relatively high. It’s a demographic that’s had more time to establish long credit histories, pay mortgages and exhibit responsible borrowing. The Equal Credit Opportunity Act even bars creditors from discriminating against an application on the basis of age. If you fall into that demographic, though, there are several reasons why it could be challenging for you to get approved for a new credit card. Here’s what could be influencing your creditworthiness, and what you can do about it.Why older adults could be denied credit Less income During the credit card application process, you’ll be asked to report your annual income or income that you have reasonable access to; the bank needs to make sure you’re able to pay back what you charge. If you’re retired, you may be living on less since you no longer have that steady employment income, and that can affect your chances of approval. The good news is that you can count more income than just a traditional salary, including things like: Social Security benefits. Income from a spouse or partner. Income from investments and retirement. Part-time or seasonal jobs. Dividends and interest. Thin or ‘invisible’ credit files If you’re an older American who’s worked hard over many years to pay off your mortgage and whittle down daily expenses, you may not think your credit scores matter much anymore. But you may be rudely awakened when you incur a large unexpected expense, want to downsize to an apartment, or try to open a new travel rewards credit card to help boost a retirement trip. Credit scores do indeed still matter, and some factors may be working against you. In order to even have a FICO FICO, +0.70% credit score, you need to have credit activity reported to the U.S. credit bureaus at least once every six months. Plus, that credit line with activity on it must be at least six months old. Also read: Inflation is low now, but it still poses a big threat to retirees’ financial security So if you’re fully free of debt — say, you’ve long ago paid off your home, your car and other loans and haven’t had any other credit activity in a year or more — the bureaus simply may not have enough information about you. Your credit file may be too thin. According to a 2019 analysis from credit bureau Equifax EFX, +1.53% , about 91.5 million consumers in the U.S. either have no credit file or have insufficient information in their files to generate a traditional credit score. Poor ‘mix of credit’ Even if you’re an older American who’s actively using credit cards and paying them off on time and in full each month, it doesn’t ensure you’ll get approved for your next card. In fact, if you have only credit card accounts in your credit file but no installment accounts like mortgages or car loans, it can be a drag on your credit scores. That’s because credit scoring models also like to see a “mix of credit,” meaning a variety of accounts that show you have experience with different kinds of borrowing. There are two basic types of credit: Revolving: Doesn’t have a set end date or consistent balance. Credit cards and home equity lines of credit are the most common types. Installment: Installment loans have set end dates and require a standard payment every month. Mortgages and car loans are the best examples. If you have a long credit history of on-time payments as well as low credit utilization, then not having a mix of credit likely won’t be enough to make or break your creditworthiness. But lacking a mix of credit could drag down a borderline score and make it hard to qualify for a new credit card. Cosigning pitfalls Did you agree to cosign on a personal loan for your son, or on student loans for your granddaughter? Your generous help may have had unintended consequences for your credit scores. Read next: COVID-19 has revealed this trait in retired Americans Plus: I’m a ‘young 68’ with $3,200 a month in Social Security and don’t want it taxed — where should I retire north or west of Colorado? When you cosign a loan, both the loan and payment history show up on your credit reports as well as the borrower’s. If the person you cosigned for misses payments, it’s your score that will be negatively affected. Even if the person you cosigned for is making all their payments on time, the loan could still count against you. That’s because it can constitute a debt obligation that leaves you too little disposable income to qualify for a credit line in the eyes of issuers.5 ways older adults can boost their odds of credit card approval Even if you’ve paid off your mortgage, have a thin or invisible credit file or have never used credit cards at all, there are still ways to improve your chances of getting a new credit card. Check your credit report: Pull your credit report regularly to make sure there are no errors. A credit card issuer could have incorrectly reported a late payment, or your report could show accounts that don’t belong to you at all. If you find anything wrong, dispute the errors right away. Make sure you continue to monitor your credit regularly. Become an authorized user: If you have a loved one with a strong credit history, ask if they’ll consider adding you as an authorized user on their credit card. The issuer will send the primary account holder a card with your name on it, and you may benefit from their good credit. It may not be enough to have a huge impact on your credit scores, but it could give you a bump relatively quickly. Build credit with a secured credit card: A secured credit card acts like a regular credit card in many ways, with one key difference: It requires an upfront deposit, which acts as your credit limit and protects the card issuer in case you’re unable to pay back what you charge. Use a secured card to help build credit in the near-term, then upgrade to a traditional credit card once your credit scores are in better shape. Consider a credit-building installment loan: A credit-builder loan holds the amount you borrow in a bank account while you make the payments. You generally won’t be able to access the money until you’ve paid off the loan, but those payments are reported to at least one of the credit bureaus. Not only can that help your credit scores, but it can also add to your credit mix. Don’t close long-held accounts: If you have some credit history but are trying to improve it, avoid closing any cards that you’ve held for years. The length of your credit history and average age of accounts are factors in your credit scores. Keep your oldest accounts open, but look to downgrade cards if they carry an annual fee that’s no longer worth it. More from NerdWallet: I Paid Off My Credit Card Debt … Now What? How to Increase Your Chances of Credit Card Approval Smart Money Moves When Cash Is Tighter Than Time Erin Hurd is a writer at NerdWallet. Email: ehurd@nerdwallet.com."}]}