{"article": [{"url": "https://www.marketwatch.com/story/how-the-coronavirus-pandemic-could-create-a-ticking-time-bomb-that-worsens-racial-and-income-inequality-in-higher-education-2020-06-11", "published": 1591967240.0, "headline": "'Higher education essentially preserves intergenerational racial and class inequality': How coronavirus could make it worse", "body": "For the past several weeks, families, college leaders and even lawmakers have been focused on the question of whether students will be returning to campuses this fall. But the coronavirus pandemic's impact on America's higher education landscape will likely far outlast the next semester, or even year. One of the most devastating consequences of the public health crisis and the accompanying economic downturn for colleges and their students could be the way in which it exacerbates the inequality already present in the system. The fact that this widening of the gulf could come at a time when the nation is grappling with systemic racism and the institutions that perpetuate it is particularly troubling. A small subset of relatively elite colleges suck up most of the money and attention devoted to higher education. Thanks to these resources, the students that attend these schools are likely to graduate with a credential that has value in the labor market. In addition, students at these schools who need financial aid are likely to receive generous packages, but these students make up a relatively small share of the student population at these wealthy schools. At the same time, the colleges that educate the bulk of students generally and low-income students and students of color in particular - community colleges, regional public colleges and historically black colleges and universities - are often strapped for funding, hampering their ability to provide for their students both academically and financially. With the economic downturn squeezing schools even further, that gap is only likely to increase. \"It seems to be this ticking time bomb for the institutions that are least well-resourced,\" said Mark Huelsman, associate director of policy and research at Demos, a left-leaning think tank. \"The inequality between the haves and the have-nots is going to grow even more.\"How did we get here? In many ways, our higher education system mirrors and exacerbates inequalities present in other areas of society. Since the 1980s inequality in earnings has increased substantially, driven in large part by some workers' access to college degrees that have an economic payoff, said Anthony Carnevale, the director of Georgetown University's Center on Education and the Workforce. As a society we've taken for granted the idea that people who receive the degrees that set them up for a life of financial stability deserve them. This notion, what Carnevale and his co-authors recently dubbed \"the merit myth\" in a book by that title, mean that Americans are generally comfortable believing that those with access to an elite college education competed fairly for the opportunity and won. In reality, this group actually got a leg up through admissions processes that focus on metrics that tend to be correlated with wealth. In this way, Carnevale argues, the \"merit myth\" reproduces the inequality already present in the kindergarten through 12th grade education system, passes it through to higher education and then spits it out into the labor market. “ 'Higher education essentially preserves intergenerational racial and class inequality in America now.' ” - Anthony Carnevale, the director of Georgetown University's Center on Education and the Workforce \"Higher education essentially preserves intergenerational racial and class inequality in America now,\" he said.Pandemic is squeezing colleges The coronavirus pandemic has squeezed colleges' budgets, which could make it more difficult for them to assist students financially who need it and may put the schools serving large swaths of these students at a disadvantage. In a report published this week, Fitch Ratings predicted that at some colleges' enrollment could decline as much as 20% this fall, as students opt to sit out this year entirely or take courses at a different institution. Because colleges derive much of their revenue from tuition, a dramatic drop in enrollment could be devastating financially. Even if enrollment stays relatively stable, colleges could still suffer. Analysts at Moody's Investors Service wrote in a recent report that college fall enrollment could actually increase as students who might normally work opt for school instead in the absence of available jobs. Still, the ratings agency is predicting that the revenue schools receive from tuition will drop because colleges will need to offer more financial aid to lure students in an economic downturn. They'll also likely see a decrease in revenue from housing and dining services. The role of government funding Schools with strong brands and a deep coffer of resources will be better positioned to weather the challenges to this business model. Dynamics that colleges have limited control over - such as how much state and federal funding they get - will likely mean the gap between institutions that can survive and maintain the level of services they provide to students and those that can't will grow. Under the CARES Act, one of the coronavirus relief packages passed by Congress earlier this year, public community colleges received about 27% of the funds allocated to higher education, despite educating almost 40% of the nation's students, according to an analysis published by Miller last month. If the Great Recession is any indication, it's likely that public colleges will see the money they receive from their states drop. The public schools that educate the bulk of low-income students and students of color - community colleges and four-year regional public schools - tend to rely on this funding the most for lack of other resources. They received less of it per full-time student in the wake of the Great Recession than public research universities. \"If past is prologue,\" Miller said, these schools are \"probably at the greatest risk,\" in the wake of the pandemic and economic downturn. Even at public schools that are able to survive, cuts to state funding mean that tuition will likely go up and the schools will have less money to serve their students, said David Tandberg, the senior vice president of policy research and strategic initiatives at the State Higher Education Executive Officers Association. Community colleges in particular may see a bump in enrollment as families opt for a cheaper college experience closer to home. But experts worry these schools won't have the funding available to adequately serve the influx of students. Philanthropy could drop off Another major source of revenue for colleges - philanthropy - is a resource that's already distributed unequally among schools, a trend that's only likely to get worse in an economic downturn. In 2109, 20 universities took in 28% of the money donated to higher education institutions. Many of these same schools have endowments worth $1 billion or more and received donations of at least $100 million over the past several years. Meanwhile, Howard University, the historically black university in Washington, D.C., just celebrated its largest donation ever at $10 million. “ 'Most of the money still goes to a handful of schools that are already wealthy.' ” - Walter Kimbrough, the president of Dillard University \"We still have a flawed idea of what philanthropy is for higher education. Most of the money still goes to a handful of schools that are already wealthy,\" said Walter Kimbrough, the president of Dillard University, a historically black university in New Orleans. If his school were to receive the level of funds sent to its wealthier counterparts, it could play a transformative role in the lives of his students, more than 80% of whom receive a Pell grant, the money the government provides to low-income students to attend college, Kimbrough said. An economic downturn, when donors are broadly more hesitant to give, \"just exacerbates that practice of still giving money to more institutions that are best able to weather a recession,\" he said.Inequity among individual students could only get worse In addition to the disparity between institutions, there are also disparities in the resources available to individual students, a gap that will likely only widen due to the pandemic. Karissa Anderson, the advocacy director at the Scholarship Foundation of St. Louis, said she worries that the disproportionate harm black communities have experienced as a result of the pandemic will put black students' ability to return to and complete college at risk. Black students are already less likely to graduate than their white counterparts. But the health and economic consequences of the virus aren't the only challenges some college students have faced during this period that are likely to persist as the pandemic-era restrictions continue. As classes moved online, some students didn't have access to technology, reliable internet or the academic resources colleges typically provide in person. \"Most students were told to leave their dorms,\" in the spring, Anderson said. \"Some folks do not have homes to return to, some folks are returning to difficult conditions for learning, some folks are returning to emotionally or physically dangerous home lives. There's just a myriad of considerations that a low-income student has to take when thinking about college right now.\""}]}