{"article": [{"url": "https://www.marketwatch.com/story/tesla-reports-surprise-q2-profit-2020-07-22", "published": 1595680160.0, "headline": "Tesla stock soars more than 5% after company reports surprise Q2 profit, on track for S&P 500", "body": "Tesla Inc. stock rose more than 5% in premarket trade Thursday after the Silicon Valley car maker reported a second-quarter GAAP and adjusted profit, setting it on a course to join the S&P 500 index and surprising investors as most of the quarter was beset with coronavirus-related stoppages. Tesla TSLA, +1.89% said it earned $104 million, or 50 cents a share, in the quarter, contrasting with a loss of $408 million, or $2.31 a share, in the year-ago quarter. Adjusted for one-time items, Tesla earned $2.18 a share, swinging from an adjusted loss of $1.12 a share a year ago. Sales fell 5% to $6.04 billion from $6.35 billion a year ago. Analysts polled by FactSet expected an adjusted loss of 2 cents a share on sales of $5.15 billion. “Demand is not our problem,” Chief Executive Elon Musk told analysts on a conference call after the results. Most of the challenges, including some parts shortages, are related to supply-chain and production issues, he said. “Don’t worry about demand, that’s not the issue.” Neither Tesla in its letter to shareholders nor Musk during the call addressed the coronavirus pandemic directly. Musk started the call thanking employees for their efforts: “There were so many challenges, too numerous to name, but they got it done.” The call veered on sedate, for Tesla standards, with Musk issuing calls for “revolutionary actuaries” to further develop Tesla’s insurance product; urging more mining companies to mine for nickel, used in batteries; and announcing the Austin, Texas, area as the site of Tesla’s future second U.S. car-making factory. Tesla is not trying to be “super profitable,” Musk said, but rather it is focusing on maximizing growth and making electric cars that are affordable, he said. The second-quarter numbers were “very strong,” setting Tesla for S&P 500 index SPX, +0.87% inclusion, said Alyssa Altman, an auto-industry consultant with Publicis Sapient. “Tesla is showing the market they move fast, make quick decisions and are not afraid of failure,” she said. “They made bold choices to reduce costs while still launching a new model with all the challenges that go with a new model launch. In doing that, they are seeing success and confidence from the market. Any profit in this environment is good and shows resilience in uncertain times.” The “real news,” said Gene Munster of Loup Ventures, “is Tesla hit profitable and free cash flow with sustainable measures. The company did not pull a one-time lever to get to profitability.” In the letter to investors, Tesla said its progress in the first half of the year “has positioned us for a successful second half of 2020. Production output of our existing facilities continues to improve to meet demand, and we are adding more capacity.” Tesla did not provide an outlook for 2020, saying it was still “difficult” to predict shutdowns and shifts in consumer sentiment for the second half of the year. The word “pandemic” appeared only on standard legal disclosures at the very end of the document. The company also kept its 2020 goals unchanged from its first-quarter letter, mentioning again “capacity” to achieve the milestone of selling more than half a million vehicles in the year. “We have the capacity installed to exceed 500,000 vehicle deliveries this year, despite recent production interruptions. While achieving this goal has become more difficult, delivering half a million vehicles in 2020 remains our target,” it said in the letter. The company said has enough liquidity to fund production and long-term capacity expansion plans. Tesla said it continues to build capacity for the Model Y, its compact SUV, at factories in Berlin and Shanghai, and it remains on track to start Model Y sales from both locations in 2021. Tesla Semi, the company’s long-haul electric truck, is also slated for 2021. Preparations in the Austin area for the auto factory, which will be Tesla’s largest property, are underway, Musk said. Austin will be tasked with making the Semi and the Cybertruck pickup, as well as the Model 3 and Model Y for eastern North America. Before Wednesday, the Silicon Valley car maker had reported three consecutive quarters of GAAP and adjusted profit. That fourth consecutive quarterly profit now opens the likelihood of joining the S&P 500 index within a few months. Tesla pinned the surprise profit on “fundamental operational improvements,” with costs with factory shutdowns offset by cost-cutting measures. GAAP operating margin reached nearly 5%, the company said, adding it expects it to continue “to grow over time, ultimately reaching industry-leading levels.” Tesla earlier this month reported second-quarter sales that crushed Wall Street expectations, even as its U.S. car-making factory in California was shuttered for most of the quarter under local shelter-in-place orders. The sales surge was one of the recent catalysts for the stock rally, which has pushed Tesla’s market valuation around $300 billion, about $95 billion ahead of Japan’s Toyota Motor Corp. TM, -0.65% and the No. 1 car maker in the world by market value. The shares ended at a record $1,643 on Monday, and hit an intraday record of $1.794.99 on July 13. In April, Tesla also surprised investors by posting a first-quarter profit. Musk kept the surprises going on a post-results call with analysts, going off script to condemn the closures put in place to curb the spread of the virus and likening them to fascism. Musk also ignited Twitter and legal spats that prompted President Donald Trump to chime in on the factory closure. Tesla’s Fremont, Calif., factory reopened in May in defiance of local shutdown orders. The standoff was eventually resolved, with Tesla reopening the plant after filing a health and safety plan with local authorities. See also:Tesla stock is ‘overheated;’ remain cautious despite hype, BofA analysts say Earlier Wednesday, analysts at Bank of America Securities kept their cautious stance on Tesla, saying that the stock was overheated and urging investors to “remain cautious despite hype and momentum.” The analysts increased their price target on the shares to $800, from $500, but kept their equivalent of a sell rating. The mean price target on Tesla from 31 analysts polled by FactSet is $912, with the top of the range being above $1,500. Tesla shares have gained nearly 300% this year, comparing with gains around 1% for the S&P 500 index SPX, +0.87% and contrasting with a loss around 6% for the Dow Jones Industrial Average DJIA, +0.56% ."}]}