{"article": [{"url": "https://www.marketwatch.com/story/james-carville-says-theres-a-significant-chance-trump-drops-out-of-the-presidential-race-2020-07-02", "published": 1593849920.0, "headline": "James Carville says thereâ\u0080\u0099s a â\u0080\u0098significant chanceâ\u0080\u0099 Trump drops out of the presidential race", "body": "“ â\u0080\u0098I think there is a significant chance he doesnâ\u0080\u0099t run. I mean, this thing is going so poorly. Heâ\u0080\u0099s so far back â\u0080¦ to me, it doesnâ\u0080\u0099t make much sense to run.â\u0080\u0099 ” Thatâ\u0080\u0099s Democratic strategist and â\u0080\u009c2020 Politics War Roomâ\u0080\u009d co-host James Carville on MSNBCâ\u0080\u0099s â\u0080\u009cMorning Joeâ\u0080\u009d on Thursday morning, doubling down on his prediction last week that Donald Trump will drop out of the presidential race before November. He suggested on the Comcast-operated CMCSA, -0.99% news channel that Republican senators including Mitch McConnell of Kentucky, Lindsey Graham of South Carolina, Martha McSally of Arizona and Dan Sullivan of Alaska will try to separate themselves from Trump this fall. â\u0080\u009cThis is the great â\u0080\u0098Moscow Mitchâ\u0080\u0099 strategy: â\u0080\u0098After Labor Day, weâ\u0080\u0099re going to turn on him.â\u0080\u0099 Thatâ\u0080\u0099s really going to work,â\u0080\u009d Carville said with sarcasm. â\u0080\u009cMcSally and Sullivan and Lindsey have been licking his boots for three years and nine months. But, boy, come Labor Day, weâ\u0080\u0099re going to get some separation.â\u0080\u009d Carville continued by asserting â\u0080\u009cthe chances of that working are zero. He is gonna drag the whole outfit down with him.â\u0080\u009d He listed anti-Trump campaigns such as the Republican-led Lincoln Project â\u0080\u009cbludgeoning him every nightâ\u0080\u009d and spending â\u0080\u009ctens of millions of dollarsâ\u0080\u009d to stop Trump from being re-elected â\u0080\u0094 or, in his words, â\u0080\u009cto extract this menace from the body politic.â\u0080\u009d “ â\u0080\u0098Trump has no idea of what heâ\u0080\u0099s getting ready to get hit with. There are a lot more patriots in this country than he ever thought.â\u0080\u0099 ” Carville made a similar claim last week, on the same cable channel, when he said there is â\u0080\u009cno chanceâ\u0080\u009d that Trump gets re-elected. â\u0080\u009cI think there is a better chance Donald Trump does not run for re-election than he is re-elected,â\u0080\u009d he told Brian Williams. â\u0080\u009cIf you just take the events of the last 10 days, obviously he has no control over the virus, he has no control over the tension in the streets. ...Heâ\u0080\u0099s lost control over everything.â\u0080\u009d He added that, â\u0080\u009cJared [Kushner], or somebody, is gonna have to sit down and have a real, like, talk, a real man-to-man, a come-to-Jesus, as people used to say, I donâ\u0080\u0099t know what. ... That is, that which canâ\u0080\u0099t continue will not.â\u0080\u009d Carville isnâ\u0080\u0099t the only one suggesting that the president will withdraw his re-election bid as Trump lags presumptive Democratic presidential nominee Joe Biden in most national polls, and coronavirus cases have continued to rise in 35 states over the past two weeks. Earlier this week, Charlie Gasparino of Fox Business reported that â\u0080\u009cmajor playersâ\u0080\u009d in the GOP are wondering whether Trump should drop out. â\u0080\u009cItâ\u0080\u0099s too early, but if the polls continue to worsen, you can see a scenario where he drops out,â\u0080\u009d one anonymous source is quoted as having said. iframe.twitter-tweet { width: 100% !important; } But the president also had the opportunity this week to celebrate a better-than-expected jobs report, telling reporters and TV cameras that the economy is â\u0080\u009croaring backâ\u0080\u009d and warning, â\u0080\u009cYour 401(k) will drop down to nothing and the stock market will drop down to nothingâ\u0080\u009d if a president inclined to raise taxes is elected. iframe.twitter-tweet { width: 100% !important; } Whatâ\u0080\u0099s more, Trump campaign spokesman Tim Murtaugh told Fox News that the rumblings of GOP operatives suggesting the president should quit the race are â\u0080\u009cthe granddaddy of fake news.â\u0080\u009d He continued, â\u0080\u009cEveryone knows that media polling has always been wrong about President Trump â\u0080\u0094Â­ they undersample Republicans and donâ\u0080\u0099t screen for likely voters â\u0080\u0094Â­ in order to set false narratives. It wonâ\u0080\u0099t work. There was similar fretting in 2016, and if it had been accurate, Hillary Clinton would be in the White House right now.â\u0080\u009d Watch Carville on MSNBC: div.youtube { height:0; position:relative; padding-bottom:56.25%; } div.youtube > iframe { position: absolute; left: 0; top: 0; width: 100%; height: 100%; } And stay up to date with MarketWatchâ\u0080\u0099s coronavirus updates and 2020 election coverage."}]}