{"article": [{"url": "https://www.marketwatch.com/story/costco-clears-4-billion-in-earnings-for-first-time-amid-record-growth-but-the-stock-is-falling-11600979558", "published": 1600969700.0, "headline": "Costco clears $4 billion in earnings for first time amid record growth, but the stock is falling", "body": "Costco Wholesale Corp. stopped handing out samples due to COVID-19, though some unmanned samples of dry or packaged goods have returned. Getty Images Costco Wholesale Corp. brought in $4 billion in profit for the first time in a fiscal year, thanks to a big boost from shoppers stocking up during the COVID-19 pandemic. Costco COST, +1.19% revealed Thursday that net revenue increased 12.5% in its fiscal fourth quarter, the best gain in nearly three years, thanks to same-store sales growing at their fastest pace this millennium. Costco has steadily experienced stronger growth in recent months as the COVID-19 pandemic has continued, as mask-wearing customers became more comfortable with in-store shopping yet still wanted to stock up on supplies for the long-term. “As people are spending less on travel, air and hotel and dining out, they seem to have redirected at least some of those dollars to categories like lawn and garden, furniture, mattresses, exercise equipment, bicycles, housewares, cookware, domestics and the like,” Chief Financial Officer Richard Galanti said in a conference call Thursday. Costco reported fiscal fourth-quarter earnings of $1.39 billion, or $3.13 a share, on sales of $53.4 billion, up 12.5% from $47.5 billion a year ago. Analysts on average expected adjusted earnings of $2.80 a share on sales of $52.1 billion, with sales expectations rising since Costco reported strong preliminary August sales earlier this month. Same-store sales for Costco grew 11.4% in the fourth quarter, the largest year-over-year gain in FactSet records that date to 2000, and more than double the growth of the previous quarter. For the full year, same-store sales grew 9.2%, the highest growth since 2004. For the full fiscal year, Costco revenue grew 9.3% to $163.2 billion from $152.7 billion, while net income also grew 9.3% to $4 billion from $3.66 billion. “Costco’s consistent revenue growth across merchandise categories reinforces our view that the membership model is arguably the most attractive business model in hardline retail today,” Raymond James analysts said earlier this month in maintaining an outperform rating and $355 price target on the stock. Costco shares dipped more than 2% in after-hours trading Thursday following the release of the report, after closing the regular session with a 0.7% gain at $347. The stock has returned 18.7% so far this year, as the S&P 500 index SPX, +0.87% has returned 1.6%."}]}