{"article": [{"url": "https://www.marketwatch.com/story/a-warning-to-muni-bond-investors-coronavirus-recession-will-decimate-state-and-local-finances-2020-06-19", "published": 1592555360.0, "headline": "A warning to muni bond investors: Coronavirus recession will decimate state finances", "body": "The effects of the coronavirus pandemic have spread widely, causing over 100,000 deaths in the U.S., massive disruptions to the global economy and the loss, however briefly, of some 40 million jobs. Now the next wave is about to hit: Shutdowns, layoffs, and business bankruptcies will cause a sickening drop in tax revenues for state and local governments, plunging their budgets deep into the red. That is likely to result in a steep drops to government payrolls, maybe higher taxes and cuts in essential services. It also could mean sharp declines in the quality of life of thriving urban centers. And it makes municipal bonds, which have done exceptionally well in recent years and have become particularly attractive to middle- and upper-middle-class people in high-tax states, a far less desirable investment. The loss in tax revenues may turn out to be staggering. A new study by Christos Makridis, a research assistant professor at Arizona State University and a Digital Fellow at MIT Sloan School of Management, and Robert McNab, a professor at Old Dominion University, estimates total declines in state tax revenues at a mind-boggling $289.4 billion, measured in 2019 dollars. That represents a mean 20% drop in state tax revenues. In emails, Makridis and McNab told me their estimates do not include tax revenues from counties and municipalities, like New York City, whose drop in tax revenues already has been pegged at almost $10 billion. Makridis and McNab based their projections on the impact of job losses on various forms of tax revenue. So the economic and tax situation in each state creates widely different potential outcomes, and they shared their state estimates with me. As the table below shows, California, the largest state by far, also would take the biggest projected hit—$73.4 billion in 2019 dollars out of its total budget of nearly $200 billion, a 37% hit. New York State, the epicenter of COVID-19 in the U.S., could suffer the biggest percentage decline, almost 40%. States suffering the biggest tax-revenue losses from COVID-19 Total 2019 Est. decline tax revenues Projected in 2019 dollars State ($ billions) % decline ($ billions) New York 92.3 -40.0% -36.9 Maine 4.8 -39.7% -1.9 Hawaii 8.5 -39.5% -3.4 Massachusetts 32.3 -37.5% -12.1 California 198.7 -37.0% -73.4 Georgia 24.3 -35.9% -8.7 New Jersey 39.4 -34.9% -13.8 Nevada 10.4 -33.6% -3.5 North Dakota 4.9 -32.8% -1.6 Connecticut 19.3 -32.7% -6.3 Source: Christos Makridis and Robert McNab, based on data from Bureau of Labor Statistics and U.S. Census Bureau. The usual Northeastern suspects—Massachusetts, New Jersey and Connecticut—are among the states showing the 10 biggest projected declines, while some smaller states, like Maine, Hawaii, Nevada and North Dakota, also could see disproportionate drop-offs. Makridis and McNab estimate that Texas and Florida—the nation’s second- and third- biggest states by population—will see tax revenues drop by 23.6% and 11%, respectively. Neither state has an income tax, a big source of decline in their high-tax counterparts. These big numbers suggest big layoffs and service cuts ahead. Over the last few years, many of these states have built up reserves and “rainy day” funds, but what do you do if a tsunami hits? According to the Bureau of Labor Statistics, more than 1.5 million state and local government workers lost their jobs between March and May, and the revenue decline is just beginning. Since states can’t print money like the U.S. Treasury (or, indirectly, the Federal Reserve), they have to balance their budgets. They also face mandatory payments like their share of Medicaid, pension obligations and the like, and thus often have little wiggle room. So, we can expect to see big layoffs in essential services like health care, education, from K-12 through public universities, fire, sanitation and police. The $150 billion allocated to state and local governments in one of three COVID-19 rescue bills passed by Congress won’t be nearly enough to fill this cavernous crater. “Defund the police”? More like “defund everything.” All of this is a warning flag to investors in municipal bonds. And indeed the iShares National Muni Bond ETF MUB, +0.05%, which outperformed the Vanguard Total Bond Market ETF BND, +0.02% since 2017, has lagged since coronavirus hit: It’s rallied from its lows but total return has been 1.9% in the year to date, versus a 5.9% total return for the Vanguard Total Bond Market ETF (which I own). But most people own bonds or funds that invest in their own states to get the most tax advantages, and as bond yields have tumbled, so have muni yields, which for California now earn less than 1%. (For households that pay 32% combined state, local and federal taxes, it’s the equivalent of a 50% higher pretax yield.) Thus far, ratings firms have mostly waited to see what impact the coronavirus carnage will have on states’ budgets. But downgrades could force states to raise yields to sell their bonds and, of course, that would make munis bought by investors at rock-bottom yields worth less. That’s why if you own individual state bonds, you should consult your financial adviser to see whether they’re still a good deal. There are good reasons to own muni bond funds, but it might make sense to reduce your exposure and shift some money to intermediate- and long-term Treasurys or investment-grade corporate funds that aren’t exposed to the dire fiscal situation state and local governments face now. Howard Gold is a MarketWatch columnist. Follow him on Twitter @howardrgold."}]}