{"article": [{"url": "https://www.marketwatch.com/story/cdc-issues-nationwide-eviction-ban-through-the-end-of-the-year-in-an-effort-to-control-coronavirus-2020-09-01", "published": 1599547280.0, "headline": "Renters in U.S. cannot be evicted through the end of the year due to coronavirus, CDC order states", "body": "The Centers for Disease Control and Prevention implemented a temporary eviction moratorium through the end of the year, protecting U.S. renters from losing their homes during the COVID-19 pandemic, the Trump administration announced Tuesday. The CDC’s moratorium will apply to all rental units nationwide until Dec. 31 and goes into effect immediately, senior administration officials said of an unpublished CDC agency order. Treasury Secretary Steven Mnuchin told a U.S. House of Representatives panel Tuesday that the moratorium would cover around 40 million renters. A previous federal eviction moratorium created by the CARES Act ended in late July and only applied to federally-funded housing, including rental units with mortgages backed by Fannie Mae FNMA, +0.73% and Freddie Mac FMCC, +0.52% . The moratorium will apply to any state in which there is not already a more protective ban in effect, according to the order. Multiple states have eviction moratoriums in place, including California, which established new rules in a late-night vote Monday. Renters will be eligible for the moratorium’s protection if they received an economic impact payment, or stimulus check, as provided for by the CARES Act. Therefore, single renters must earn no more than $99,000 a year, while couples filing jointly can earn up to $198,000 annually. “ Around 40 million people will be covered by the nationwide eviction moratorium, according to Treasury Secretary Steven Mnuchin. ” The order, which was shared ahead of being published in the Federal Register on Sept. 4, includes a declaration for renters to sign and give their landlord. Senior Trump administration officials said the form would be made available on the CDC’s website. Renters must indicate on the declaration that they cannot afford to pay their rent in full and that if evicted they would become homeless or force to move into congregate housing. Renters also must be able to prove that they made an effort to receive government assistance and that they could not afford rent. The moratorium does not absolve renters of paying the rent. That money is still due to landlords, and senior administration officials said that renters should still attempt to make partial payments when they cannot afford to pay in full. Landlords will still be permitted to evict tenants in certain cases, such as instances in which the tenant has destroyed property or poses a threat to the health or safety of neighbors. The moratorium builds on a previous executive order from President Donald Trump that directed the Department of Health and Human Services and the CDC to determine whether halting evictions was necessary to contain the spread of the virus that causes COVID-19. “In the context of a pandemic, eviction moratoria — like quarantine, isolation, and social distancing — can be an effective public health measure utilized to prevent the spread of communicable disease,” the CDC’s unpublished order said. “President Trump is committed to helping hardworking Americans stay in their homes and combating the spread of the coronavirus,” White House deputy press secretary Brian Morgenstern said during a briefing Tuesday. “ ‘While an eviction moratorium is an essential step, it is a half-measure that extends a financial cliff for renters to fall off of when the moratorium expires and back rent is owed.’ ” — Diane Yentel, president and CEO of the National Low Income Housing Coalition Housing advocates said the move was “long overdue,” but called for more help to be provided to renters facing financial difficulties amid historically high levels of unemployment caused by the pandemic. “As we have said for five months, the very least the federal government ought to do is assure each of us that we won’t lose our homes in the middle of a global pandemic: The administration’s action would do so and will provide relief from the growing threat of eviction for millions of anxious families,” said Diane Yentel, president and CEO of the National Low Income Housing Coalition. “But while an eviction moratorium is an essential step, it is a half-measure that extends a financial cliff for renters to fall off of when the moratorium expires and back rent is owed,” Yentel added, while calling on Congress to pass another COVID-19 relief bill with at least $100 billion in emergency rental assistance. Previously, some lawmakers and activists called for a cancellation of rent during the pandemic. Trump administration officials during Tuesday’s briefing said that renters and landlords would have access to emergency funds already in place, including billions of dollars in grants from the Department of Housing and Urban Development and the $142 billion coronavirus relief fund from the Treasury Department. Administration officials could not clarify whether the CDC moratorium would prevent eviction filings from occurring. Housing and legal advocates have raised concerns that landlords filed evictions against many people nationwide who should have been protected by the CARES Act moratorium."}]}