{"article": [{"url": "https://www.marketwatch.com/story/statues-around-the-world-in-question-amid-re-examination-of-racial-injustices-2020-06-12", "published": 1591927700.0, "headline": "Statues around the world in question amid re-examination of racial injustices", "body": "The rapidly unfolding movement to pull down Confederate monuments around the U.S. in the wake of George Floyd’s death at the hands of police has extended to statues of slave traders, imperialists, conquerors and explorers around the world, including Christopher Columbus, Cecil Rhodes and Belgium’s King Leopold II. Protests and, in some cases, acts of vandalism have taken place in such cities as Boston; New York; Paris; Brussels; and Oxford, England, in an intense re-examination of racial injustices over the centuries. Scholars are divided over whether the campaign amounts to erasing history or updating it. New Zealand’s fourth-largest city removed a bronze statue of the British naval officer Capt. John Hamilton, the city’s namesake, on Friday, a day after a Maori tribe asked for the statue be taken down and one Maori elder threatened to tear it down himself. The city of Hamilton said it was clear the statue of the man accused of killing indigenous Maori people in the 1860s would be vandalized. The city has no plans to change its name. At the University of Oxford, protesters have stepped up their longtime push to remove a statue of Rhodes, the Victorian imperialist who served as prime minister of the Cape Colony in southern Africa. He made a fortune from gold and diamonds on the backs of miners who labored in brutal conditions. Oxford’s vice chancellor Louise Richardson, in an interview with the BBC, balked at the idea. “We need to confront our past,” she said. “My own view on this is that hiding our history is not the route to enlightenment.” Near Santa Fe, New Mexico, activists are calling for the removal of a statue of Don Juan de Oñate, a 16th-century Spanish conquistador revered as a Hispanic founding father and reviled for brutality against Native Americans, including an order to cut off the feet of two dozen people. Vandals sawed off the statue’s right foot in the 1990s. In Bristol, England, demonstrators over the weekend toppled a statue of 17th-century slave trader Edward Colston and threw it in the harbor. City authorities said it will be put in a museum. Across Belgium, statues of Leopold II have been defaced in half a dozen cities because of the king’s brutal rule over the Congo, where more than a century ago he forced multitudes into slavery to extract rubber, ivory and other resources for his own profit. Experts say he left as many as 10 million dead. “The Germans would not get it into their head to erect statues of Hitler and cheer them,” said Mireille-Tsheusi Robert, an activist in Congo who wants Leopold statues removed from Belgian cities. “For us, Leopold has committed a genocide.” In the U.S., the May 25 death of Floyd, a black man who died after a white Minneapolis police officer pressed a knee to his neck, has led to an all-out effort to remove symbols of the Confederacy and slavery. The Navy, the Marines and NASCAR have embraced bans on the display of the Confederate flag, and statues of rebel heroes across the South have been vandalized or taken down, either by protesters or local authorities. On Wednesday night, protesters pulled down a century-old statue of Confederate President Jefferson Davis in Richmond, Virginia, the former capital of the Confederacy. The 8-foot (2.4-meter) bronze figure had already been targeted for removal by city leaders, but the crowd took matters into its own hands. No immediate arrests were made. It stood a few blocks away from a towering, 61-foot-high (18.5-meter-high) equestrian statue of Gen. Robert E. Lee, the most revered of all Confederate leaders. Democratic Gov. Ralph Northam last week ordered its removal, but a judge blocked such action for now. The spokesman for the Virginia division of the Sons of Confederate Veterans, B. Frank Earnest, condemned the toppling of “public works of art” and likened losing the Confederate statues to losing a family member. Richmond Mayor Levar Stoney, who has proposed dismantling all Confederate statues in the city, asked protesters not to take matters into their own hands for their own safety. But he indicated the Davis statue is gone for good. “He never deserved to be up on that pedestal,” Stoney said, calling Davis a “racist & traitor.” Elsewhere around the South, authorities in Alabama got rid of a massive obelisk in Birmingham and a bronze likeness of a Confederate naval officer in Mobile. In Virginia, a slave auction block was removed in Fredericksburg, and protesters in Portsmouth knocked the heads off the statues of four Confederates. The monument is believed to be located where a slave whipping post once stood, and removing it is a small step in the right direction, Portsmouth activist and organizer Rocky Hines said. “It’s not a history that we as a nation should necessarily be proud of. For us, the history is a lot of history of slavery and hatred,” he said. “It’s bothered people for a long time.” In Washington, House Speaker Nancy Pelosi said it is time to remove statues of Confederate figures from the U.S. Capitol and take their names off military bases such as Fort Bragg, Fort Benning and Fort Hood. President Donald Trump on Wednesday rejected the idea of renaming bases. But Republicans in the Senate, at risk of losing their majority in the November elections, aren’t with Trump on this. A GOP-led Senate panel on Thursday approved a plan to take Confederate names off military installations. Supporters of Confederate monuments have argued that they are important reminders of history; opponents contend they glorify those who went to war against the U.S. to preserve slavery. The Davis monument and many others across the South were erected decades after the Civil War during the Jim Crow era, when states imposed tough new segregation laws, and during the Lost Cause movement, in which historians and others sought to recast the South’s rebellion as a noble undertaking, fought to defend not slavery but states’ rights. For protesters mobilized by Floyd’s death, the targets have ranged far beyond the Confederacy. Statues of Columbus have been toppled or vandalized in cities such as Miami; Richmond; St. Paul, Minnesota; and Boston, where one was decapitated. The city of Camden, New Jersey, removed a statue of Columbus. Protesters have accused the Italian explorer of genocide and exploitation of native peoples. New York Gov. Andrew Cuomo, who is Italian American, said he opposes removal of a statue of Columbus in Manhattan’s Columbus Circle. “I understand the feelings about Christopher Columbus and some of his acts, which nobody would support,” he said. “But the statue has come to represent and signify appreciation for the Italian American contribution to New York. So for that reason I support it.” Historians have differing views of the campaigns. “How far is too far, in scrubbing away a history so that we won’t remember it wrong – or, indeed, have occasion to remember it at all?” asked Mark Summers, a University of Kentucky professor. “I’ve always felt that honor to the past shouldn’t be done by having fewer monuments and memorials, but more.” Scott Sandage, a historian at Carnegie Mellon University, noted that Americans have a long tradition of arguing over monuments and memorials. He recalled the bitter debate over the now-beloved Vietnam Veterans’ Memorial in Washington when the design was unveiled. “Removing a memorial doesn’t erase history. It makes new history,” Sandage said. “And that’s always happening, no matter whether statues go up, come down, or not.”"}]}