{"article": [{"url": "https://www.marketwatch.com/story/dell-vmware-shares-rise-on-strength-of-working-and-learning-from-home-11598563312", "published": 1598549360.0, "headline": "Dell, VMware shares rise on strength of working (and learning) from home", "body": "Dell Technologies Inc. shares climbed higher in the extended session Thursday as the computing company’s revenue and adjusted earnings beat Wall Street expectations. Dell DELL, -0.39% shares rose 1.8% in after-hours trading after closing the regular session at $62.43, up about 0.5%. The company reported second-quarter net income of $1.1 billion, or $1.37 a share, compared with $4.2 billion, or $4.47 a share, in the year-ago period. Adjusted earnings were $1.92 a share, adjusted for purchase accounting. Revenue fell to $22.7 billion from $23.4 billion in the year-ago quarter, but the Round Rock, Texas-based company noted that consumer sales rose 18% to $3.2 billion, citing double-digit growth across consumer notebooks and gaming systems. Chief Financial Officer Tom Sweet attributed the gains to demand for remote-work and -learning solutions from education, government and consumer customers. Analysts surveyed by FactSet had forecast earnings of $1.38 a share on revenue of $22.48 billion. Meanwhile, enterprise cloud company VMware Inc. VMW, +0.81%, in which Dell owns an 81% stake, saw its shares rise in extended trading after reporting what CEO Pat Gelsinger called solid results amid pandemic-related “uncertain times” on the strength of an increase in subscriptions and SaaS license revenue. Shares of the Palo Alto, Calif.-based company rose as much as 3% after hours, after closing down less than 0.5% to $142.90. VMware reported second-quarter net income of $447 million, or $1.06 a share, compared with $5 billion, or $12.47 a share, in the year-ago period that included a recorded tax benefit. Adjusted earnings were $1.81 a share, adjusted for stock-based compensation. Revenue rose to $2.88 billion from $2.63 billion in the year-ago quarter. Analysts surveyed by FactSet had forecast earnings of $1.45 a share on revenue of $2.8 billion. Dell also mentioned that it is exploring a potential spinoff of VMware."}]}