{"article": [{"url": "https://www.marketwatch.com/story/the-age-of-70-videogames-has-arrived-11602257572", "published": 1602260300.0, "headline": "Videogames are about to get more expensive for the first time in 15 years", "body": "MarketWatch photo illustration/iStockphoto When a new generation of gaming consoles arrives ahead of the holidays, there will also be a new price tag on top-end videogames for the first time in more than a decade. Publishers have announced that certain games for Microsoft Corp.’s MSFT new Xbox and Sony Corp.’s SNE JP:6758 new PlayStation will reach a $70 price point. Take-Two Interactive Software Inc. TTWO caused a stir in the gaming world over the summer when it announced that its annual basketball game, “NBA 2K21,” would cost $69.99 for next-generation consoles, and recent Sony announcements included two games priced at that level. Top-of-the-line videogame titles have remained at a $60 price point since 2005, when game developers started hiking prices from a standard $50 to follow Activision, which pushed the cost for “Call of Duty 2,” to $59.99, according to NPD Group analyst Mat Piscatella. Adjusted for inflation, $60 in 2005 would have the same buying power as $78.29 today, according to the Bureau of Labor Statistics. “We believe our suggested retail price for NBA 2K21 on next-generation platforms fairly represents the value of what’s being offered: power, speed and technology that is only possible on new hardware,” Take-Two spokesman Alan Lewis told MarketWatch in an email. From Barron’s: Videogame Stocks Have Soared for 20 Years. They’re About to Get Another Boost Activision Blizzard Inc. ATVI told MarketWatch it had no announcements on future games but confirmed that “Call of Duty: Black Ops Cold War” would retail in the U.S. at $70. When asked if Electronic Arts Inc. EA intended to release $70 games, a spokesman would only say that customers who buy “FIFA 21” or “Madden NFL 21” for $59.99 on the current PlayStation or Xbox will be able to upgrade their game for the new consoles at no additional cost. Barclays analyst Mario Lu expects the other publishers to move higher for premium games after Sony listed $69.99 prices last month for two games exclusive to the PlayStation 5, “Demon’s Souls” from Bluepoint Games and “Destruction All Stars” from Lucid Games. “We think this could mark the tipping point for next-gen games pricing as we think many developers will now be more inclined to follow suit after seeing Sony pricing its own first-party titles at launch at $70,” Lu said. The 2005 increase to $60 from $50 did little to slow down rapid growth in videogame sales, and the COVID-19 pandemic has increased videogame play even more. Piscatella, though, pointed out that the industry has since diversified to offer more games as part of subscriptions or as free-to-play games that monetize through in-game purchases. “When it comes to what’s different now, well, not much and everything,” NPD’s Piscatella told MarketWatch. “Not much in that the same trepidation that exists now about some next generation titles releasing at $69.99 also occurred prior to the launch of ‘Call of Duty 2,’ … [but] the range of games and services available makes it a much more competitive marketplace today than it was way back when.” Piscatella noted that many games have higher-priced “Premium” or “Collector’s” editions that are often priced as much as $40 higher than the basic game, and that the number of gamers willing to pay that much has been growing, especially for high-profile titles. He also expects many games to avoid going for that higher price, though, saying $69.99 will not become “a de facto standard across all releases on the next-generation consoles.” “There are so many ways games can be monetized now, and no one way of pricing or selling a title will work for everyone,” he said. The videogame industry has been one of the biggest beneficiaries of the coronavirus pandemic, as gamers play with friends online from the safety of their homes. Videogame sales in the U.S. are expected to come in around $45.6 billion this year, out of an estimated $200.3 billion world-wide, according to Lewis Ward, IDC research director of gaming. Worldwide, that’s a growth rate of 21.3%, with $22 billion more in sales than in earlier forecasts. For more: Videogames are flourishing in the pandemic, and game makers aren’t scared of the future Sony’s release of the PlayStation 5 is scheduled for Nov. 12, seven years after it released the PS4. Also seven years after its last major iteration, Microsoft’s release of the Xbox Series X is slated for Nov. 10. An update to Nintendo’s JP:7974 NTDOY Switch console, which first came out in 2017, has no official release date but is expected to arrive sometime in 2021. Piper Sandler surveyed 9,800 teenagers this summer and found that they are growing more eager to buy new consoles and continue paying upfront for games despite free-to-play options. Analyst Yung Kim reported that 63% of teens intended to buy a next-gen console, up from 59% in the spring, and 44% said that free-to-play games would not discourage them from buying games, up from 40% in the spring. Activision’s “Call of Duty” was the most cited title, with 42% of teens saying they were “excited” to buy it this year. Kim has overweight ratings on Activision, EA and Take-Two. Jefferies analyst Alex Giaimo expects the current momentum behind videogames will result in faster refresh rates for new consoles compared with previous releases, and of course more profit. “This is important in the context of full-game price hikes, as we estimate that a 10MM unit seller would contribute an incremental $56MM in net income at a $70 price point as compared to $60,” Giaimo said. Read: Will videogames be the Achilles heel for Apple, Google in antitrust investigations? Barclays’ Lu expects the shift to $70 games will boost earnings-per-share to Take-Two and EA by double-digit percentages in fiscal 2022, and boost Activision’s EPS by 6% in fiscal 2021. For the year, shares of Activision are up 31%, EA is up 17%, and Take-Two has gained 31%. In comparison, the S&P 500 index SPX, +0.87% is up 7% and the tech-heavy Nasdaq Composite Index COMP, +1.39% is up 27%."}]}