{"article": [{"url": "https://www.marketwatch.com/story/lyft-to-suspend-rides-in-california-over-order-to-classify-drivers-as-employees-11597942617", "published": 1597944380.0, "headline": "Uber and Lyft granted emergency stay, shutdown averted in California", "body": "Lyft is suspending its ride-hailing service in California before midnight Thursday, and Uber is expected to do the same. Robyn Beck/AFP via Getty Images Ride-hailing will continue in California for the time being as Uber Technologies Inc. and Lyft Inc. won more time Thursday in their appeal of a ruling that ordered them to immediately classify their ride-hailing drivers as employees in compliance with state law. The companies have five days to agree to expedited procedures outlined by a state appeals court judge Thursday, which includes consolidating both appeals and requiring Uber UBER, -0.18% and Lyft LYFT, +2.16% to submit sworn statements by Sept. 4 from their chief executives that the companies have developed plans to obey an Aug. 10 order to classify their drivers as employees instead of independent contractors. “Should Lyft or Uber fail to comply with these procedures, the People may apply to this court to vacate this stay,” wrote Stuart Pollak, presiding judge of the First District Court of Appeal in California. He set an Oct. 13 date for oral arguments in the case. “The court of appeal is holding the companies’ feet to the fire,” said William Gould, professor emeritus at Stanford Law School and a former National Labor Relations Board chairman, in an interview with MarketWatch. He said the expedited procedures are “quite unusual,” and that “the significant thing is they have to affirm an implementation plan.” Uber and Lyft confirmed they will not be shutting down their ride-hailing services, as they had planned to do if they failed to secure an emergency stay. “While we won’t have to suspend operations tonight, we do need to continue fighting for independence plus benefits for drivers,” said Julie Wood, spokeswoman for Lyft. Uber spokesman Davis White said, “We are glad that the Court of Appeals recognized the important questions raised in this case, and that access to these critical services won’t be cut off while we continue to advocate for drivers’ ability to work with the freedom they want.” In May, California’s attorney general and the city attorneys of San Francisco, Los Angeles and San Diego sued Uber and Lyft, accusing them of failing to obey California law by continuing to consider their drivers as independent contractors, and asked the court for an injunction to force the companies to classify them as employees. A San Francisco Superior Court judge ruled Aug. 10 that the ride-hailing giants must immediately comply but gave them a 10-day stay for their appeals. That expired Thursday. See: Uber and Lyft must make drivers employees because California law has ‘overwhelming’ edge, judge says According to Pollak’s ruling, the companies must come up with a plan for compliance should he uphold the decision by Schulman and Prop. 22 fails in November. If that happens, it appears the companies would have 30 days to comply. “The Court of Appeal is calling Uber and Lyft’s bluff,” said John Cote, spokesman for San Francisco City Attorney Dennis Herrera, in an email Thursday. “These companies may have bought themselves a little more time, but the price is that they have to demonstrate – under oath – that they have an implementation plan that complies with the law.” Cote added that the plaintiffs “will continue to vigorously prosecute this case to ensure these drivers and the public are treated fairly. We intend to prevail.” The two companies are counting on California voters to approve Proposition 22, an initiative they and other gig companies have poured $110 million into to exempt gig workers from the law, Assembly Bill 5, which became effective Jan. 1. With Prop. 22, the companies are proposing a “third way” that they say gives additional pay and benefits to drivers and preserves their flexibility to choose when they work. But the initiative falls short of classifying drivers as employees with all the benefits that entails, including being eligible for unemployment insurance. “If our livelihoods weren’t on the line today, we’d laugh at Uber and Lyft for trying to make this fight about the illusion of flexibility, when what they’re telling drivers like us is: it’s our way of low-wage jobs, or we’ll hit the highway and leave you with nothing,” said Mostafa Maklad, an Uber driver in San Francisco and an organizer with Gig Workers Rising. California Attorney General Xavier Becerra said in a tweet Thursday: “REMINDER: Companies can both classify their workers as employees and continue fostering the innovation that we deeply value as a state. For any company to suggest otherwise is a false choice.” Lyft shares closed the day up 5.76% to $29.76, after falling to as low as $25.87 during the day after announcing that it would shut down rides before midnight. Uber shares ended the session at 6.76% to $31.41. Lyft made the announcement ahead of the appeals court ruling to give its customers time to prepare, Wood said. Analyst Dan Ives of Wedbush Securities said in a note to clients that “implementation and enforcement of AB 5 is challenging and a major gut punch to the Gig Economy‘s future growth prospects.”"}]}