{"article": [{"url": "https://www.marketwatch.com/story/european-stocks-trade-lower-as-eu-summit-drags-on-2020-07-20", "published": 1595224040.0, "headline": "European stocks turn higher, with EU leaders scheduled to resume rescue fund talks", "body": "European stocks edged higher on Monday, with top leaders still negotiating on a rescue fund to bolster the economic response to the coronavirus. In midmorning action, the Stoxx Europe 600 SXXP, +0.55% traded 0.2% higher, overcoming a weaker start. The German DAX DAX, +0.06%, French CAC 40 PX1, +0.71% and U.K. FTSE 100 UKX, +0.64% also saw cautious moves. After the S&P 500 SPX, +0.87% advanced 1.25% last week, futures on the Dow Jones Industrial Average YM00, +0.82% slipped 146 points. Attention was on Brussels, where a two-day meeting of European leaders has turned into four, with talks scheduled to resume in the afternoon. Reports suggest that the leaders may agree on €390 billion worth of grants on a fund that could be worth between €700 billion and €750 billion. “That the summit heads into its fourth day could be a good sign. It suggests a deal may be possible at this summit already, at least on parts of what is on the table,” said Florian Hense, European economist at Berenberg Bank. In addition to the Brussels summit, EU negotiators are in London on Monday for a fifth set of negotiations on the U.K.’s exit from the trading bloc. The coronavirus also is a focus, with U.K. Prime Minister Boris Johnson over the weekend likening a second lockdown to a nuclear deterrent. U.S. coronavirus numbers have plateaued, with new cases of about 64,000 on Sunday. GlaxoSmithKline GSK, +1.52% shares slipped 1% after agreeing to pay CureVac as much as £866 million, in a deal that nets the U.K. pharmaceutical giant a nearly 10% stake in the German biotech known for its vaccines capabilities. AstraZeneca AZN, +0.63% rose 2% ahead of the publication of a study expected in The Lancet on the coronavirus vaccine from the University of Oxford it will distribute. Shares of Enzymatica ENZY, -0.55% surged 77% as the company said preliminary results show the ability of the mouth spray ColdZyme, in vitro, to deactivate SARS-CoV-2, the virus causing the COVID-19 pandemic. Philips PHIA, +0.90% rose nearly 5% after better-than-forecast second-quarter earnings. UBI Banca IT:UBI shares shot up 13% as Intesa Sanpaolo added a cash component to its takeover offer."}]}