{"article": [{"url": "https://www.marketwatch.com/story/drivers-set-to-pay-lowest-labor-day-weekend-gasoline-prices-in-16-years-2020-09-04", "published": 1599221480.0, "headline": "Drivers set to pay lowest Labor Day weekend gasoline prices in 16 years", "body": "U.S. drivers are likely to pay the lowest Labor Day holiday weekend prices for gasoline at the pump in 16 years, as demand for travel continues to suffer in the wake of efforts to curb the spread of COVID-19. A majority of U.S. states will find prices this Labor Day weekend that are “as low as they’ve been for that holiday since 2004,” said Tom Kloza, global head of energy analysis for the Oil Price Information Service (OPIS), in a note to clients Friday. “The cheapest holiday travel in 16 years is all the more remarkable since dozens of states have added various state and local taxes to the price of fuel in that time.” The average U.S. retail price for regular gasoline as of Aug. 31 stood at $2.22 a gallon—the lowest for this time of year since 2004, according to weekly data from the Energy Information Administration. In a report released Friday, the government agency attributed the “relatively low” price to “continued low demand for gasoline since mid-March, as travel demand fell because of efforts to limit the spread of coronavirus.” Implied demand for motor gasoline averaged 8.9 million barrels a day over the past four weeks ended Aug. 28, down 8.9% from the same period last year, according to EIA data. As of late Friday morning, the average regular gasoline price was at $2.22, according to travel and navigation app Gasbuddy. It was down about 35 cents a gallon from a year ago. OPIS said Americans will only spend about $3 billion on motor fuel during the four day weekend, which traditionally marks the end of the summer travel season. That compares with $5.4 billion in gasoline spending for the Labor Day holiday travel season in 2014, it said. Also see:Hurricane Laura may do little to disturb relative calm in summer gasoline prices “ ‘Once vacation travel ends, we’ll continue to see gasoline demand that falls well short of what was recorded in 2017, 2018, and 2019.’ ” — Tom Kloza, OPIS Prices for gasoline are expected to stay low through the end of the year, said Kloza. “Once vacation travel ends, we’ll continue to see gasoline demand that falls well short of what was recorded in 2017, 2018, and 2019,” he said. “The sharp cutback in commuting, together with high unemployment and a lack of recreational venues will limit consumption through the next four months.”"}]}