{"article": [{"url": "https://www.marketwatch.com/story/americans-havent-been-this-unhappy-in-50-years-poll-2020-06-16", "published": 1592302700.0, "headline": "Americans havenâ\u0080\u0099t been this unhappy in 50 years: poll", "body": "ST. PETERSBURG, Fla. (AP) â\u0080\u0094 Spoiler alert: 2020 has been rough on the American psyche. Folks in the U.S. are more unhappy today than theyâ\u0080\u0099ve been in nearly 50 years. This bold â\u0080\u0094 yet unsurprising â\u0080\u0094 conclusion comes from the COVID Response Tracking Study, conducted by NORC at the University of Chicago. It finds that just 14% of American adults say theyâ\u0080\u0099re very happy, down from 31% who said the same in 2018. That year, 23% said theyâ\u0080\u0099d often or sometimes felt isolated in recent weeks. Now, 50% say that. The survey, conducted in late May, draws on nearly a half-century of research from the General Social Survey, which has collected data on American attitudes and behaviors at least every other year since 1972. No less than 29% of Americans have ever called themselves very happy in that survey. Most of the new surveyâ\u0080\u0099s interviews were completed before the death of George Floyd touched off nationwide protests and a global conversation about race and police brutality, adding to the feelings of stress and loneliness Americans were already facing from the coronavirus outbreak â\u0080\u0094 especially for black Americans. Lexi Walker, a 47-year-old professional fiduciary who lives near Greenville, South Carolina, has felt anxious and depressed for long stretches of this year. She moved back to South Carolina late in 2019, then her cat died. Her father passed away in February. Just when she thought sheâ\u0080\u0099d get out and socialize in an attempt to heal from her grief, the pandemic hit. â\u0080\u009cItâ\u0080\u0099s been one thing after another,â\u0080\u009d Walker said. â\u0080\u009cThis is very hard. The worst thing about this for me, after so much, I donâ\u0080\u0099t know whatâ\u0080\u0099s going to happen.â\u0080\u009d Among other finding from the new poll about life in the pandemic: â\u0080\u0094 The public is less optimistic today about the standard of living improving for the next generation than it has been in the past 25 years. Only 42% of Americans believe that when their children reach their age, their standard of living will be better. A solid 57% said that in 2018. Since the question was asked in 1994, the previous low was 45% in 1994. â\u0080\u0094 Compared with surveys conducted after President John F. Kennedyâ\u0080\u0099s assassination in 1963 and after the Sept. 11 terrorist attacks, Americans are less likely to report some types of emotional and psychological stress reactions following the COVID-19 outbreak. Fewer report smoking more than usual, crying or feeling dazed now than after those two previous tragedies, though more report having lost their temper or wanting to get drunk. â\u0080\u0094 About twice as many Americans report being lonely today as in 2018, and not surprisingly given the lockdowns that tried to contain the spread of the coronavirus, thereâ\u0080\u0099s also been a drop in satisfaction with social activities and relationships. Compared with 2018, Americans also are about twice as likely to say they sometimes or often have felt a lack of companionship (45% vs. 27%) and felt left out (37% vs. 18%) in the past four weeks. What is surprising, said Louise Hawkley, a senior research scientist with NORC at the University of Chicago, was that loneliness was not even more prevalent. â\u0080\u009cIt isnâ\u0080\u0099t as high as it could be,â\u0080\u009d she said. â\u0080\u009cPeople have figured out a way to connect with others. Itâ\u0080\u0099s not satisfactory, but people are managing to some extent.â\u0080\u009d The new poll found that there havenâ\u0080\u0099t been significant changes in Americansâ\u0080\u0099 assessment of their familiesâ\u0080\u0099 finances since 2018 and that Americansâ\u0080\u0099 satisfaction with their familiesâ\u0080\u0099 ability to get along financially was as high as itâ\u0080\u0099s been over nearly five decades. Jonathan Berney, of Austin, Texas, said that the pandemic â\u0080\u0094 and his resulting layoff as a digital marketing manager for a law firm â\u0080\u0094 caused him to reevaluate everything in his life. While he admits that heâ\u0080\u0099s not exactly happy now, thatâ\u0080\u0099s led to another uncomfortable question: Was he truly happy before the pandemic? â\u0080\u009c2020 just fast forwarded a spiritual decay. When things are good, you donâ\u0080\u0099t tend to look inwards,â\u0080\u009d he said, adding that he was living and working in the Miami area before the pandemic hit. As Florida dealt with the virus, his girlfriend left him and he decided to leave for Austin. â\u0080\u009cI probably just wasnâ\u0080\u0099t a nice guy to be around from all the stress and anxiety. But this forced an existential crisis.â\u0080\u009d Berney, who is looking for work, said things have improved from those early, dark days of the pandemic. Heâ\u0080\u0099s still job hunting but has a little savings to live on. He said heâ\u0080\u0099s trying to kayak more and center himself so heâ\u0080\u0099s better prepared to deal with any future downturn in events. Reimagining happiness is almost hard-wired into Americansâ\u0080\u0099 DNA, said Sonja Lyubomirsky, a psychology professor at the University of California, Riverside. â\u0080\u009cHuman beings are remarkably resilient. Thereâ\u0080\u0099s lots and lots of evidence that we adapt to everything. We move forward,â\u0080\u009d she said, adding that sheâ\u0080\u0099s done happiness studies since the pandemic started and found that some people are slightly happier than last year. Melinda Hartline, of Tampa, who was laid off from her job in public relations in March, said she was in a depressed daze those first few weeks of unemployment. Then she started to bike and play tennis and enrolled in a college course on post-crisis leadership. Today, sheâ\u0080\u0099s worried about the state of the world and the economy, and she wonders when she can see her kids and grandkids who live on the West Coast â\u0080\u0094 but she also realizes that things could be a lot worse. â\u0080\u009cAnything can happen. And you have to be prepared,â\u0080\u009d she said. â\u0080\u009cWhether itâ\u0080\u0099s your health, your finances, whether itâ\u0080\u0099s the world. You have to be prepared. And always maintain that positive mental attitude. Itâ\u0080\u0099s going to get you through it.â\u0080\u009d ___ The survey of 2,279 adults was conducted May 21-29 with funding from the National Science Foundation. It uses a sample drawn from NORCâ\u0080\u0099s probability-based AmeriSpeak Panel, which is designed to be representative of the U.S. population. The margin of sampling error for all respondents is plus or minus 2.9 percentage points."}]}