{"article": [{"url": "https://www.marketwatch.com/story/no-2-house-democrat-says-its-not-clear-if-bill-extending-paycheck-protection-program-will-advance-before-recess-2020-07-01", "published": 1594037360.0, "headline": "Bill extending Paycheck Protection Program gets Trump's signature", "body": "President Donald Trump over the weekend signed legislation passed Wednesday in the House by unanimous consent to extend a federal government program that provides forgivable loans to small businesses hurt by the coronavirus crisis, a day after Democratic senators late Tuesday unexpectedly secured unanimous approval in the Republican-run Senate for an extension of the Paycheck Protection Program. The deadline for applying for PPP loans was Tuesday, but lawmakers sought to push it out to Aug. 8. Earlier Wednesday, Majority Leader Steny Hoyer had said House Democrats were still in talks with Republican lawmakers and the Trump administration over whether to bring the extension for the PPP to the floor, with the House headed into a two-week recess. Hoyer had said Rep. Nydia Velazquez, a New York Democrat who chairs the House Small Business Committee, had concerns that details about borrowers have not been provided by the administration. The Maryland congressman said there was also concern over whether an extension would be seen as giving the administration approval to spend the PPP's remaining funds differently. \"There's some indication that they're saying that there's not additional money needed for the Paycheck Protection Program, and they have an intent to repurpose that money. At this point in time, we don't know what that repurposing would be,\" he said. The PPP, which received $670 billion in funding through March's CARES Act and April's follow-on relief package, had 4.9 million loans outstanding as of Tuesday, totaling $521 billion, according to Small Business Administration data. Lawmakers have been putting forth different proposals on how to spend the leftover money. Sen. Chris Coons, a Delaware Democrat, proposed allowing businesses that had spent the funds from their first loan to get more money. Sen. Kevin Cramer, a North Dakota Republican, had offered a bill, with Democratic co-sponsors, that would forgive loans of up to $150,000 if business owners submit a one-page form. The program has drawn criticism over how publicly traded companies secured loans, as well as over sending money to less hard-hit areas and allegedly discriminating against businesses owned by women and minorities. The Trump administration has relented to public pressure and pledged to provide more details about PPP borrowers, but government watchdogs say still more transparency is needed. Related:Watchdog says Washington's growing swampier, even as coronavirus lockdowns let Congress climb off 'hamster wheel of fundraising' U.S. stocks SPX, +0.87% DJIA, +0.56%, which were up in Monday's post-holiday-weekend session at least in part on the heels of a market rally in China, have rallied from their March lows thanks in part to optimism around Washington's aid efforts."}]}