{"article": [{"url": "https://www.marketwatch.com/story/nyc-restaurants-can-reopen-indoor-dining-on-sept-30-gov-cuomo-says-2020-09-09", "published": 1599673880.0, "headline": "NYC restaurants can reopen indoor dining on Sept. 30, Gov. Cuomo says", "body": "Just one day after referring to indoor dining in New York City as a “reckless” proposition, Gov. Andrew Cuomo announced on Wednesday that such service will return to the city at the end of the month. As of Sept. 30, restaurants will be allowed to serve guests indoors at 25% of their usual capacity, the governor said. The reopening plan includes a series of new safety measures and restrictions. Diners will be required to wear face coverings when not seated; at least one member of each party must provide information for contact tracing; temperature checks will be given at the door; no bar seating will be permitted; and restaurants will close at midnight. Businesses will also be required to operate with enhanced air filtration systems, a requirement similar to one of the stipulations used for gym reopenings. The positivity rate in New York state — or the percentage of tests coming back positive for the virus — has remained below 1% for 33 days as of Tuesday. In New York City, that rate was 0.7%, down from a peak of more than 60% at the height of the crisis in March and April, when the city was the nation’s viral epicenter. Don’t miss: I went to the Met, and here’s what I saw The governor previously cited concerns about the city’s failure to come up with a plan to enforce safety compliance for indoor dining, suggesting at one point that several thousand police officers be deployed to ensure good behavior in restaurants. It appears a mixture of improving compliance on outdoor dining rules and a promise of additional enforcement from the city cleared the way for Wednesday’s decision. “Because compliance is better, we can now take the next step,” Cuomo said. The city will provide 400 enforcement personnel to monitor indoor dining in addition to compliance officers with the State Liquor Authority, Cuomo said. It wasn’t immediately clear which city agencies would be staffing that beefed-up enforcement. The governor also called for New Yorkers themselves to aid in enforcement at the 10,000 restaurants that are expected to require inspection. Restaurants will be required to publicly post capacity limits and phone numbers for patrons to report violations: 833-208-4160, or text ‘VIOLATION’ to 855-904-5036. “I trust that if they have the right information, they will do the right thing,” he said, warning that if the infection rate in New York City spikes, the state can always close indoor dining again. If the infection rate has not increased by Nov. 1, indoor dining may be allowed to expand to 50% capacity, Cuomo said. Also see: Welcome to New York! Don’t you dare go outside! Pressure to reopen also came from the restaurant industry itself; in August, a group of more than 300 restaurants filed a class-action lawsuit against the state for the ongoing closure mandates, seeking more than $2 billion in damages. James Mermigis, the attorney representing the restaurants in the suit, did not immediately respond to request for comment. “The New York City restaurant industry has been financially devastated by the Covid-19 pandemic, and a safe return to indoor dining is critical to help save these vital small businesses and jobs,” NYC Hospitality Alliance executive director Andrew Rigie said in a statement emailed to MarketWatch. “We’re thankful to Gov. Cuomo for announcing a return to indoor dining with a blueprint for future expansion. Restaurants are essential to New York’s economic and social fabric, and indoor dining is a key component to the industry’s recovery.” Read next: There are seven coronavirus vaccine candidates being tested in the U.S. — here’s where they stand"}]}