{"article": [{"url": "https://www.marketwatch.com/story/keep-your-dog-safe-when-you-travelhere-are-some-pointers-2020-08-07", "published": 1596815300.0, "headline": "Keep your dog safe when you travelâ\u0080\u0094here are some pointers", "body": "With air travel down significantly this year due to theÂ coronavirus pandemic, more people are venturing out the old-fashioned way by hitting the road in a car or RV. One positive aspect of this is that more families can include their pet when traveling. Whether itâ\u0080\u0099s just a short day trip or a longer trek across state lines, itâ\u0080\u0099s vital to ensure that your furry family member is as safe as everyone else in the vehicle. Here are tips for assuring that.Buckle up! The first and most important step when traveling with a pet is to make sure they are safely secured in the vehicle. Just as you would never drive without a seat belt, your pets also need to be harnessed when a vehicle is moving. This is for their safety and yours. If a collision occurs and the pet isnâ\u0080\u0099t harnessed, they can be seriously injured â\u0080\u0093 and so can you as your beloved pet can fly forward in the vehicle if a crash occurs. Your best bet is a canine seat belt. These come in a variety of sizes to fit all manner of dogs. They usually attach to a collar or harness, then buckle into a seat belt. A pet carrier may be more comfortable for smaller dogs, but again make sure that it is securely fastened to the seat. And while we all know that dogs love to put their heads out the window, itâ\u0080\u0099s really safer that they stay inside. This is especially true at highway speeds, where even the smallest of debris can hurt your dogâ\u0080\u0099s eyes or ears.Bring the necessities and more The length of your trip will determine what and how much of it you should bring for your pet, but some items are essential no matter if you drive down the road or across the country. The most important is fresh water and a bowl. Bring more than you think youâ\u0080\u0099ll need. Itâ\u0080\u0099s always better to have extra than not enough, and this is true for the humans in your vehicle, too. For hotter climates and in the summer months, weâ\u0080\u0099d recommend keeping water bottles in a cooler â\u0080\u0093 after all, no one likes warm water on a hot day. You might like: The 10 best new cars for dog owners If your dog requires medication, this too should be brought. Even if you donâ\u0080\u0099t think youâ\u0080\u0099ll be using it due to the duration of your trip, itâ\u0080\u0099s always better to bring it along. If weâ\u0080\u0099re learning anything from 2020, itâ\u0080\u0099s that life is full of unexpected detours. Play it safe and plan for curveballs along the way.Plan for meals Bringing dog food on your trip is also vital. While we humans can get away with pulling into a drive-through when our stomachs growl, a double-cheeseburger and fries probably isnâ\u0080\u0099t the best bet for Fido. Dogs do best with the familiar, so bring along the food they know, and keep those drive-through indulgences to a minimum, if that. The last thing you want is an accident in the car or outside a restaurant. Trust us, we speak from experience on this one.Bring toys Just as we donâ\u0080\u0099t expect our kids to idly sit in back on a long trip without games, books or something to keep them occupied, itâ\u0080\u0099s wise to have a toy, ball, bone or the like to keep your dog busy. While some dogs â\u0080\u0093 and their fortunate owners â\u0080\u0093 have no trouble sleeping for the duration of trips, others can get restless. Bring something familiar to keep them busy along the way. Read: How to shop for the right economy car Finally, bring your dogâ\u0080\u0099s bedding or pillows and bedding with their scent on them. This will give them comfort and a sense of home even when youâ\u0080\u0099re away from it.Keep everyone comfortable Once youâ\u0080\u0099ve finally wrangled and secured everyone in the vehicle and are on your way, itâ\u0080\u0099s time to keep them comfortable. Again, just as with kids, a good tip is to prepare them before getting inside. That means last-minute bathroom breaks and, for our dogs, a nice walk. Be sure to read: RIP Buddy: The first dog to test positive for the coronavirus in the U.S. has died Once inside, make sure your dog has room to spread out and be comfortable while buckled in. If youâ\u0080\u0099re including the family cat along for the ride, bringing a litter box is a good idea. Ventilation and keeping your pet cool and comfortable is key. If your vehicle has rear-seat air vents, make sure they are open and directed toward your dog. If you only have front vents, point them so air reaches in back. Itâ\u0080\u0099s also helpful to crack the windows now and then to get in fresh air. Keep attuned to your dog and take breaks as necessary so they can stretch their legs, heed the call of nature and sniff out the places youâ\u0080\u0099re traveling through. And, of course, never, ever leave a pet inside a parked car, no matter how brief you think it will be. Read: These are the best cars for families in 2020 Keep these tips and safety measures in mind, and all of your family members â\u0080\u0093 the four-legged ones included â\u0080\u0094 will have a far better experience when traveling. This story originally ran on Autotrader.com."}]}