{"article": [{"url": "https://www.marketwatch.com/story/heres-how-key-swing-states-are-leaning-in-the-presidential-race-and-how-theyre-weathering-the-recession-11600708945", "published": 1600779860.0, "headline": "Here's how key swing states are leaning in the presidential race - and how they're weathering the recession", "body": "The road to the White House goes through a few key swing states. MarketWatch photo illustration/ Getty Images|iStockphoto As a few battleground states look on track to decide the 2020 White House race, it's worth looking at how their economies are faring during the coronavirus recession. Do any key swing states suffer from a relatively high unemployment rate, potentially making them easier game for Democratic challenger Joe Biden as he battles President Donald Trump? Pennsylvania, with its 20 electoral votes, appears to fit the bill. The Keystone State had 10.3% unemployment last month, topping the national rate of 8.4%. The table below shows how six key swing states have been faring in terms of August unemployment, as well as two other metrics based on data from earlier in the summer - renters behind on payments to their landlords and usage of food stamps, also known as Supplemental Nutrition Assistance Program (SNAP) benefits. Further down, another table shows how Biden is generally leading Trump in polls focused on those six states, which are viewed by analysts as likely to determine the presidential election's outcome. The former vice president's advantage in Pennsylvania is 4.0 percentage points vs. his average edge of 3.8 points in the battleground states. Trump and his campaign have said pollsters are getting the 2020 race wrong. Unemployment rate in August % of renters behind on rent % rise in food-stamp recipients Florida 7.4% 21% 42% Pennsylvania 10.3% 18% 10% Michigan 8.7% 20% 14% North Carolina 6.5% 27% 15% Arizona 5.9% 17% 13% Wisconsin 6.2% 12% 15% Average for the 6 swing states 7.5% 19% 18% U.S. average 8.4% 21% 19% Sources: Bureau of Labor Statistics, Center on Budget and Policy Priorities The two additional metrics (renters behind on rent and food-stamp usage) come from an analysis of government data by the Center on Budget and Policy Priorities, a left-leaning think thank. North Carolina has shown an especially high percentage of cash-strapped renters, based on Census Bureau figures from July, while Florida had a particularly large increase in food-stamp usage from February to June, according USDA data. Polling average for top swing states Source: RealClearPolitics loadCSS('https://asset.wsj.net/wsjnewsgraphics/dice/rcp-battleground-polls-table-6792bad1-a2b9-469a-bbf6-c995b1ea4be5/app.min.css'); loadJs('https://asset.wsj.net/wsjnewsgraphics/dice/rcp-battleground-polls-table-6792bad1-a2b9-469a-bbf6-c995b1ea4be5/app.min.js'); Larry Sabato, director of the University of Virginia's Center for Politics, has argued that Biden needs to push his economic message in the weeks leading up to the Nov. 3 election in order to win. \"The one thing that Biden simply has to do is to talk about the economy more,\" Sabato said in a webcast last week. \"He's not going to have the edge on Trump on the economy for lots of reasons, good and bad, but what he can do is reduce the gap. He needs to have that be a wash, and it's not close to a wash right now. Trump is getting credit for those first three good years of his term with the economy.\" The former vice president \"needs to get out and campaign more, fundamentally, and then he needs to campaign about the economy more while he's out,\" Sabato added. \"Don't just talk about the pandemic, even though it's your No. 1 issue. Work the economy in, too.\" Related: Biden says U.S. economy was 'more equitable' in Obama era And read: Trump can beat Biden, analyst says - watch for 'a big Q3 GDP figure' Betting markets are giving Biden a 54% chance of winning vs. the Republican incumbent's 45%. Another closely watched measure of viability is each campaign's finances, and Biden had more cash on hand as this month began. Trump also often touts the performance of the stock market. The S&P 500 SPX, +0.87% has been selling off this month, but the equity gauge is still positive for the year and notched an all-time high on Sept. 2. Now read: Republicans bet that sudden Supreme Court vacancy will galvanize their voters And see: Trump says he'll name Supreme Court pick on Friday or Saturday This report was first published on Sept. 21, 2020."}]}