{"article": [{"url": "https://www.marketwatch.com/story/dallas-feds-kaplan-bemoans-lack-of-mask-wearing-in-texas-and-elsewhere-2020-06-25", "published": 1593084800.0, "headline": "Dallas Fedâ\u0080\u0099s Kaplan bemoans lack of mask wearing in Texas and elsewhere", "body": "The strength of any U.S. economic recovery from the coronavirus is going to depend just as much on â\u0080\u009cbasicâ\u0080\u009d preventative steps like wearing a mask as government funding, and so far the â\u0080\u009cjury is still outâ\u0080\u009d on how the U.S. is doing, said Dallas Fed President Robert Kaplan on Thursday. â\u0080\u009cThe government can aid the unemployed workers and provide funds for cash-strapped states and local governments, but this isnâ\u0080\u0099t going to be a substitute for basic things like people in the United States wearing masks. I mean broadly wearing masks and that is not happening in the U.S.,â\u0080\u009d Kaplan said during a virtual panel on central banking and the COVID 19 pandemic sponsored by the Bretton Woods Committee. There has been some confusion and mixed messages about the need for masks in the U.S., and mask wearing has been â\u0080\u009cunevenâ\u0080\u009d in Texas, he added. â\u0080\u009cWeâ\u0080\u0099ve had a resurgence in a whole range of states and that means consumers are going to be reluctant to engage,â\u0080\u009d he said. Indeed, the U.S. counted 34,700 new confirmed cases on Wednesday, according to the Associated Press, the highest level since a late April peak number of 36,400. While New York and neighboring states have succeeded in flattening their infection curve, 29 states are still seeing increasing cases over the last 14 days, according to a New York Times tracker. The outbreaks have threatened to impede efforts to restart businesses that have been shut down to prevent a more severe outbreak of the pathogen. Bringing back small businesses and other firms that rely on consumer spending â\u0080\u009cwonâ\u0080\u0099t happen to the extent it would have unless we really are disciplined here in our health-care protocols,â\u0080\u009d he said. In Texas, which began lifting its shutdowns on May 1, infections are skyrocketing. Hospitalizations as a result of the coronavirus have doubled and new cases have tripled in two weeks, according to the AP. Some other states like North Carolina, Louisiana and Kansas are holding off of plans to reopen their economies."}]}