{"article": [{"url": "https://www.marketwatch.com/story/mortgage-rates-are-going-back-up-just-as-home-prices-begin-to-skyrocket-2020-08-20", "published": 1597920380.0, "headline": "Mortgage rates are going back up - just as home prices begin to skyrocket", "body": "Although they are rising, mortgage rates continue to remain below 3%. But a surge in home prices is threatening to make buying a home unaffordable once again for many Americans. The 30-year fixed-rate mortgage averaged 2.99% for the week ending Aug. 20, rising three basis points from the week prior, Freddie Mac FMCC, +0.52%  reported Thursday. It was the second consecutive week in which rates increased. Meanwhile, the 15-year fixed-rate mortgage jumped eight basis points to an average of 2.46%. The 5-year Treasury-indexed hybrid adjustable-rate mortgage rose by a single basis point to 2.91% on average. A couple of factors drove mortgage rates higher. \"The rates advanced because the U.S. Treasury issued a large number of notes and investors are eyeing hopeful updates on COVID vaccine trials,\" said George Ratiu, senior economist at Realtor.com. Mortgage rates roughly track the direction of the yield on the 10-year Treasury note, which has remained at its highest level since early July in recent weeks. Don't miss:'It was definitely a gamble': What you need to know before buying a home virtually But another factor contributing to the rise in interest rates was the surprise announcement last week that Fannie Mae and Freddie Mac were charging a new \"adverse market\" fee on mortgage refinances, a move that drew criticism from trade groups, consumer advocates and lawmakers on both sides of the aisle. \"The announcement by the [Federal Housing Finance Agency] to apply a 0.5% fee to all mortgage refinance loans was one that caught lenders off guard, placing many in a difficult financial spot and forcing them to raise rates across the board - even for purchase loans, which aren't directly affected by the new policy - in order to cover their losses,\" said Matthew Speakman, an economist with Zillow ZG, -0.42%  . The fee has functionally lifted the baseline for mortgage rates, Speakman said. The rise in rates comes as competition among buyers in the housing market remains extremely elevated. And that's pushing home prices even higher, given the short supply of homes. Also see:Refinancing your mortgage will cost more thanks to a new fee from Fannie Mae and Freddie Mac Median home list prices were up 10.1% year-over-year for the week ending Aug. 15, according to a new report from Realtor.com. It represents the fastest growth in listing prices since January 2018. (Realtor.com is operated by News Corp NWSA, -1.35%  subsidiary Move Inc., and MarketWatch is a unit of Dow Jones, which is also a subsidiary of News Corp.) \"With supply and demand moving in opposite directions, sellers are clearly gaining the upper hand in the market as buyer competition builds up and prices gain momentum going into the fall,\" Javier Vivas, director of economic research for Realtor.com, said in the report. Rising interest rates could cause the housing market to cool a bit if they prompt some buyers to rethink buying a home. But for those buyers who do remain in the market, higher rates will make buying a home even more expensive."}]}