{"article": [{"url": "https://www.marketwatch.com/story/my-abusive-soon-to-be-ex-husband-is-withholding-my-half-of-the-stimulus-check-why-some-domestic-violence-survivors-still-havent-gotten-relief-payments-2020-07-23", "published": 1596519200.0, "headline": "Domestic abusers are taking survivorsâ\u0080\u0099 stimulus checks â\u0080\u0094 and lawmakers want the IRS to do something about it", "body": "While millions of Americans have saved, spent or invested their stimulus checks, some domestic-violence survivors have found themselves deprived of the financial lifeline and often saddled with the knowledge that their abuser has the money. Now, senators and advocates are pressing the Internal Revenue Service to send replacement checks to survivors and set rules that would prevent abusers from intercepting the cash if thereâ\u0080\u0099s a second round of stimulus checks. “ â\u0080\u0098A stimulus payment can make a huge difference in financially easing the burdens many survivors and their children are facing with remaining safe and secure economically.â\u0080\u0099 ” â\u0080\u0094 Sonya Passi, founder and CEO of FreeFrom â\u0080\u009cA stimulus payment can make a huge difference in financially easing the burdens many survivors and their children are facing with remaining safe and secure economically,â\u0080\u009d said Sonya Passi, the founder and CEO of FreeFrom, an organization focused on increasing domestic-violence survivorsâ\u0080\u0099 financial security. Without access to the money theyâ\u0080\u0099re entitled to, some survivors are forced to rely on their abusersâ\u0080\u0099 financial support to support their children â\u0080\u0094 and, Passi said, they worry that could one day be used against them in court. â\u0080\u009cThe pandemic has caused many survivors to fall further into debt and placed even more limitations on their ability to financially seek safety from abuse and harm,â\u0080\u009d she told MarketWatch in an email. Itâ\u0080\u0099s tough to quantify how many victims are missing out on the $1,200 payments and potential $500 payments per child. But it has happened frequently enough for tax lawyers and domestic-violence advocates to offer anecdotal evidence. Passi, who said her organization had heard from at least 40 survivors unable to access their stimulus payments, shared two such accounts. “ â\u0080\u0098My abusive soon-to-be-ex-husband is withholding my half of the stimulus check as another way to control me.â\u0080\u0099 ” â\u0080\u0094 One domestic violence survivor â\u0080\u009cMy abusive soon-to-be-ex-husband is withholding my half of the stimulus check as another way to control me,â\u0080\u009d one person said, according to Passi. â\u0080\u009cDue to this I am struggling to pay for fees that would allow me to move into a new place.â\u0080\u009d â\u0080\u009cMy ex-husband claimed me as a dependent on his taxes even though I made $11,000 of my own money in 2019, and provided child care for our toddler,â\u0080\u009d said another. â\u0080\u009cNow we are separated, and not only did I not receive any of the tax return, but I wasnâ\u0080\u0099t eligible for the stimulus check either.â\u0080\u009d These are just the people who were aware of the payment. â\u0080\u009cHarm-doers typically have access to survivorsâ\u0080\u0099 identifying information and bank accounts and use them to abuse, monitor and control survivors,â\u0080\u009d Passi said, â\u0080\u009cso if a stimulus check is deposited, the survivor may never actually see it.â\u0080\u009d “ One survivor calling the National Domestic Violence Hotline said an abuser claimed $60 was half the stimulus check. ” The National Domestic Violence Hotlineâ\u0080\u0099s advocate log reveals similar stories, turning up at least three specific mentions of stimulus-check trouble. One abuser tried convincing a survivor that $60 amounted to half the check, according to excerpts shared with MarketWatch. Another abuser refused to share the money for a divorcing survivorâ\u0080\u0099s rent and car payment. Still another cashed the payment and bought a motorcycle, leaving the survivor to look after debts and two children. A national COVID-19 economic-impact survey of 608 U.S. direct-service providers conducted by the Center for Survivor Agency and Justice and other partner organizations, meanwhile, estimated that about 40% of domestic and sexual-violence survivors served by those groups had mentioned concerns about stimulus checks. Given that the vast majority of abuse victims report also experiencing financial abuse, â\u0080\u009cwe can reasonably expect perpetrators who leverage financial dependency as a form of control are taking advantage of this additional opportunity,â\u0080\u009d said Teal Inzunza, the program director for economic empowerment at the Urban Resource Institute, a New York-based service provider for domestic-violence survivors. Passi identified a handful of survivor populations that have encountered structural hurdles to receiving stimulus checks: those who lack a permanent address and/or are experiencing homelessness; those who werenâ\u0080\u0099t involved in tax filing, who were unable to claim the kids as dependents because their abuser did, and/or whose financial abuse included tax fraud; unbanked survivors who used check-cashing services that took a cut of their check; and undocumented survivors, who were excluded from eligibility. The push to get stimulus checks to domestic violence survivors parallels ongoing efforts to get stimulus checks to people experiencing homelessness, who face similar financial roadblocks standing between them and their money. â\u0080\u0098One more way the abuser is exerting controlâ\u0080\u0099 As it quickly cut stimulus checks, the IRS looked at 2019 tax returns to determine eligibility. If those returns werenâ\u0080\u0099t yet filed, it looked at 2018 returns. That means the agency could have been relying on outdated information and sending a stimulus check to an account controlled by an abuser or an address the survivor had left. “ Sometimes the abuser is unilaterally filing a joint return and pocketing both stimulus checks. ” Nancy Rossner, a senior staff attorney at the Community Tax Law Project, has seen this scenario unfold. Other times, the abuser and survivor have separated but the abuser unilaterally filed a joint return and pocketed both stimulus checks. â\u0080\u009cThis is one more way that the abuser is exerting control and power over the victim,â\u0080\u009d Rossner said. Sheâ\u0080\u0099s worked with approximately 15 domestic violence survivor clients who have been deprived of their stimulus check. But thereâ\u0080\u0099s no clear answer on how to fix the problem, she said, let alone do it quickly. Rossner had advised clients to submit â\u0080\u009csupersedingâ\u0080\u009d tax returns by July 15. Those returns, treated as the most up-to-date version, can change the filing status to married, filing separately or head of household. Most importantly, they can include new bank account or mailing address information. “ A taxpayer may be able to change bank account and mailing address information in a superseding tax return. ” Even if someone missed the deadline, Rossner said they could still mail in a return and a letter explaining the circumstances. This would at least trigger an IRS review of the original return and give a survivor an opportunity to dispute the first returnâ\u0080\u0099s validity, she said. The IRS hasnâ\u0080\u0099t declared whether a superseding return will resolve the matter, Rossner said. Whatâ\u0080\u0099s more, a superseding return has to be filed as a paper return and the IRS is wading through a backlog of paperwork after it temporarily closed offices. At the very least, a superseding return could set up survivors to receive the second payment, she said. Sen. Catherine Cortez Masto, a Democrat from Nevada, and 35 of her colleagues sent a letter to the IRS last month urging the agency to make sure survivors get the money to which they are entitled. That followed a similar letter that Sen. Joni Ernst, a Republican from Iowa, sent the IRS in April. The Cortez Masto letter contained recommendations, including a dedicated hotline where survivors could report misdirected stimulus checks, guidance about superseding returns and public explanations telling taxpayers what they should do if they arenâ\u0080\u0099t with their spouse anymore. (The American Bar Associationâ\u0080\u0099s taxation section also wrote the IRS in May with suggested ways to help survivors, such as dividing money into separate bank accounts when underlying tax returns had paperwork instructing a split refund.) During a late-June Senate Finance Committee hearing, Cortez Masto asked IRS Commissioner Charles Rettig what his agency had been doing â\u0080\u009cto get replacement checks to victims of domestic violence who are in desperate, desperate need right now.â\u0080\u009d “ â\u0080\u0098Our people care, and they care a lot. ...To have a victim of domestic violence also not be able to receive the payment, particularly at this time of need, does not sit well with us.â\u0080\u0099 ” â\u0080\u0094 IRS Commissioner Charles Rettig Rettig said the issue was a priority. â\u0080\u009cOur people care, and they care a lot,â\u0080\u009d he said. â\u0080\u009cTo have a victim of domestic violence also not be able to receive the payment, particularly at this time of need, does not sit well with us.â\u0080\u009d The IRS did not elaborate on any further steps it will be taking when reached for comment Tuesday. A spokesman pointed to instructions for people to trace a stimulus check that has been issued but not received. Taxpayers can call the IRS, though they may experience long wait times. They can also start a trace by mailing a form â\u0080\u0094 but if theyâ\u0080\u0099re married, both spouses need to sign. â\u0080\u009cThe delivery of these stimulus payments directly into the hands of domestic violence survivors is vital to their safety and wellbeing,â\u0080\u009d Cortez Masto told MarketWatch in a statement. â\u0080\u009cIâ\u0080\u0099ll continue to do everything I can to push this administration to prioritize payments to survivors of domestic violence so they receive the payments they are legally entitled to.â\u0080\u009dâ\u0080\u0098The bottom is literally falling out from underneath peopleâ\u0080\u0099 Advocates have been sounding the alarm since March over the pandemicâ\u0080\u0099s potential to exacerbate conditions for domestic-violence survivors, citing early shelter-in-place orders that left many survivors confined in close quarters with abusive partners. Experts also warned about the specter of recession, which some studies have linked with increases in domestic violence. “ 24% of people contacting the National Domestic Violence Hotline between mid-March and mid-May mentioned financial abuse, ” Between March 16 and May 16, 24% of contacts to the National Domestic Violence Hotline mentioned experiencing economic or financial abuse. But financial or economic abuse was already fairly common among domestic-abuse survivors: In one frequently cited 2008 study of 103 survivors, â\u0080\u009calmost every woman had been involved with a partner who controlled her use of or access to economic resources and/or took advantage of her economically.â\u0080\u009d Economic and financial control can be just as debilitating as physical abuse, Karma Cottman, the executive director of Ujima, Inc.: The National Center on Violence Against Women in the Black Community, told MarketWatch. â\u0080\u009cYou pile on this public-health emergency, and it exacerbates the ways in which an abuser can exact financial control and economic abuse,â\u0080\u009d she said. “ â\u0080\u0098[Survivors] can put money down on a deposit; they can rent a U-Haul or buy a plane ticket.â\u0080\u0099 ” â\u0080\u0094 Kim Pentico, director of economic justice for the National Network to End Domestic Violence Domestic-violence survivors often use cash infusions â\u0080\u0094 like tax returns â\u0080\u0094 as a springboard toward safety, said Kim Pentico, the director of economic justice for the National Network to End Domestic Violence. â\u0080\u009cThey can put money down on a deposit; they can rent a U-Haul UHAL, -0.54% Â or buy a plane ticket,â\u0080\u009d she said. The $1,200 payments can make a significant difference in many survivorsâ\u0080\u0099 lives, said Kavita Mehra, the executive director of the New York-based domestic-violence organization Sakhi for South Asian Women, but thatâ\u0080\u0099s especially true when viewed within the current economic context of widespread food and housing insecurity. Of the survivors Sakhi works with who are employed, 90% are hourly-wage workers who live paycheck to paycheck, she said. “ â\u0080\u0098The bottom is literally falling out from underneath people, and that money could provide longer-term support.â\u0080\u0099 ” â\u0080\u0094 Kavita Mehra, executive director of Sakhi for South Asian Women â\u0080\u009cThe bottom is literally falling out from underneath people, and that money could provide longer-term support,â\u0080\u009d Mehra added. One reason many survivors remain with their abusers is insufficient means to financially support themselves and/or their kids, advocates say. Some 73% of domestic-violence survivors report staying with an abusive partner longer or returning to that partner due to financial problems, according to a 2018 Institute for Womenâ\u0080\u0099s Policy Research survey of 164 individuals in 11 states and Washington, D.C. â\u0080\u0098Thereâ\u0080\u0099s more for all of us to doâ\u0080\u0099 Advocates urged policymakers to keep domestic-violence survivors in mind from the beginning, rather than addressing their needs as an afterthought. “ â\u0080\u0098Weâ\u0080\u0099ve got to listen to survivors when we create policies.â\u0080\u0099 ” â\u0080\u0094 Kim Pentico, director of economic justice for the National Network to End Domestic Violence â\u0080\u009cWeâ\u0080\u0099ve got to listen to survivors when we create policies â\u0080\u0094 and if not survivors, then their advocates â\u0080\u0094 so we can head some of these issues off instead of trying to do cleanup,â\u0080\u009d Pentico said. The best resource right now for a survivor who hasnâ\u0080\u0099t received their stimulus payment is community support, Passi said, including resources shared among survivors and fundraising by the broader community â\u0080\u009cto get money directly into the hands of survivors.â\u0080\u009d Survivors should reach out to community-based organizations and the domestic-violence hotline for help developing financial and physical safety plans, Cottman added. People who arenâ\u0080\u0099t in danger or dire financial straits must also do their part, Passi said: Her organizationâ\u0080\u0099s COVID-19 response guide suggests specific ways for communities and individuals, religious organizations, banks, employers, attorneys and other entities to support survivors. â\u0080\u009cSurvivors should not have to figure this out on their own,â\u0080\u009d Passi said. â\u0080\u009cThereâ\u0080\u0099s more for all of us to do.â\u0080\u009d"}]}