{"article": [{"url": "https://www.marketwatch.com/story/mnuchin-and-pelosi-resume-discussions-after-trump-changes-of-course-on-fiscal-stimulus-11602082017", "published": 1602073340.0, "headline": "Mnuchin and Pelosi resume discussions after Trump changes course on fiscal stimulus", "body": "Nancy Pelosi arrives for her weekly news conference in the House Visitors Center at the U.S. Capitol on Oct. 1. U.S. Treasury Secretary Steven Mnuchin and House Speaker Nancy Pelosi spoke Wednesday morning after President Donald Trump signaled he wanted Congress to pass targeted fiscal stimulus measures, a day after pulling the plug via tweet on further pandemic relied talks. According to a tweet from Pelosi spokesman, Mnuchin pressed Pelosi about the possibility of passing a stand-alone measure to help the airline industry that has been hit hard by the coronavirus pandemic. Election Countdown: Betting markets see Biden win as increasingly likely, while Trump struggles with aid issue Pelosi responded that House Republicans had blocked an attempt by Democrats to consider a standalone airline bill last week. iframe.twitter-tweet { width: 100% !important; } She recommended, according to a tweet by her deputy chief of staff, that Mnuchin review the bipartisan legislation led by Rep. Peter DeFazio, an Oregon Democrat, the spokesman said. DeFazio’s bill, titled the Moving Forward Act, calls for a $500 billion investment in transportation infrastructure. To pass the bill on short notice, it would need unanimous support in the House. Republican members were reported to have blocked it last week. On Tuesday afternoon, Trump pulled the plug on fiscal stimulus talks, saying he wanted to wait until after the November election to pass another aid bill to help the economy recover from the coronavirus pandemic. A few hours later, in other tweets, Trump changed course and said he would sign individual stimulus measures, including a package of $25 billion in airline payroll support and another round of $1,200 stimulus checks to individual taxpayers. See: Good news: You now have until Nov. 21 to claim your stimulus check from last spring Trump did so because “he saw the political downside of his statement of walking away from the negotiations” and is “rebounding from a terrible mistake that he made yesterday,” Pelosi said on ABC’s “The View” on Wednesday. On the proposed checks for American households, Pelosi commented that it was “interesting that he said he’d send out those checks if we just sent him that bill because all he has ever wanted in the negotiation was to send out a check with his name printed on it.” When asked why Pelosi isn’t making more concessions to get Republicans on board, she responded that she already had. “We came down a trillion dollars, and then we came down $200 billion more,” Pelosi said. Contrary to Pelosi’s argument that the U.S. economy can’t survive without additional stimulus measures, White House National Economic Council Director Larry Kudlow said the economy will continue to grow if no large fiscal stimulus is passed. “I don’t think the recovery depends on a massive assistance package,” Kudlow said on CNBC. Kudlow said the view of the president and Senate Majority Leader Mitch McConnell is that Democrats “don’t really want to play ball.” McConnell said that the Senate will “re-engage after the election.” “We do need another rescue package but because of a pending election, we simply weren’t able to get together,” he said Wednesday on Fox News. On Tuesday the Federal Reserve chairman, Jerome Powell, argued that the economy needs more fiscal support to recover fully from the recession caused by businesses being locked down to combat the coronavirus’s spread."}]}