{"article": [{"url": "https://www.marketwatch.com/story/trump-rails-against-flag-burning-activist-athletes-at-wisconsin-rally-01600396663", "published": 1600382720.0, "headline": "Trump rails against flag-burning, activist athletes at Wisconsin rally", "body": "President Donald Trump speaks during a campaign rally Thursday in Mosinee, Wis. Associated Press MOSINEE, Wis. — President Donald Trump stepped up his rhetoric Thursday on cultural issues, aiming to boost enthusiasm among rural Wisconsin voters as he tries to repeat his path to victory four years ago. Making his fifth visit to the pivotal battleground state this year, Trump views success in the state’s less-populated counties as critical to another term. He held a rally Thursday evening in Mosinee, in central Wisconsin, an area of the state that shifted dramatically toward Republicans in 2016, enabling Trump to overcome even greater deficits in urban and suburban parts of the state. Trump has increasingly used his public appearances to elevate cultural issues important to his generally whiter and older base, as he hinges his campaign on turning out his core supporters rather than focusing on winning over a narrow slice of undecided voters. In Mosinee, he called for a statute to ban burning the American flag in protest — a freedom protected by the Supreme Court — and criticized sports players and leagues for allowing demonstrations against racial inequality. “We have enough politics, right,” he said, joking that sometimes, “I can’t watch me.” He added of protests in sports, “People don’t want to see it and the ratings are down.” Earlier Thursday, in a speech at the National Archives to commemorate Constitution Day, he derided The New York Times’ “1619 Project,” which aimed to recognize the often overlooked consequences of slavery and the contributions of Black Americans. “For many years now, the radicals have mistaken Americans’ silence for weakness. But they are wrong,” Trump said. “There is no more powerful force than a parent’s love for their children — and patriotic moms and dads are going to demand that their children are no longer fed hateful lies about this country.” Trump told supporters in Wisconsin: “We’re launching a new pro-American lesson plan for students called 1776 Commission. We’re going to teach our children the truth about America.” Trump’s last visit to Wisconsin came on Sept. 1, when he met with law enforcement and toured damage from protests in Kenosha that turned violent after the police shooting of Jacob Blake, a Black man hit seven times in the back during an attempted arrest. Trump has sought to use the unrest after the August shooting of Blake and the May police killing of George Floyd to tout a “law and order” message and to paint an apocalyptic vision of violence if Democrat Joe Biden wins on Nov. 3. “I saved the suburbs,” Trump said Thursday of his call for federal law enforcement and national guard troops to confront protesters. He added that police “did a great job in Kenosha.” Trump also previewed aid to the region’s farmers, saying $13 billion would begin flowing “starting next week” to help farmers, though he provided no additional details. Trump also took a victory lap two days after he presided over Bahrain and the United Arab Emirates recognizing Israel in a White House ceremony. “I got nominated twice for the Nobel Peace Prize. That’s a big deal,” Trump said, adding, “I should’ve gotten nominated seven times.” His supporters chanted “Nobel Peace Prize” in response. Trump won Marathon County, which includes Mosinee, by more than 12,000 votes in 2016 — over three times more than the margin by which 2012 GOP nominee Mitt Romney won the area. Trump’s team is wagering the 2020 contest on a similar performance in the county and the dozens of others like it across battleground states. Trump’s path to 270 Electoral College votes may well hinge on Wisconsin, and his campaign is investing tens of millions of dollars on advertising and get-out-the-vote efforts in the state. Trump’s event took place largely outside an aircraft hangar at the Mosinee airport, his campaign’s preferred format for mass rallies amid the coronavirus, though Trump has been willing to host large events indoors as well, sometimes in violation of state and federal distancing guidelines. Republican Sen. Ron Johnson of Wisconsin was set to join Trump on Air Force One but ended up under quarantine Thursday after learning he was exposed to someone earlier in the week who subsequently tested positive for the virus. Johnson tested negative on Wednesday night ahead of his anticipated trip with Trump, his office said."}]}