{"article": [{"url": "https://www.marketwatch.com/story/confused-by-all-those-covid-19-relief-programs-for-consumers-heres-a-chart-to-break-down-whats-happening-2020-07-07", "published": 1594217180.0, "headline": "Confused by all those COVID-19 relief programs for consumers? Here's a chart to break down what's happening", "body": "There's been a torrent of debt-relief programs aimed at U.S. consumers since March, at the onset of the coronavirus pandemic. Payments on auto loans, credit cards, personal loans and more could be put on pause, as local authorities have raced to get a handle on the COVID-19 crisis. It's now been nearly four months since the earliest restrictions on social gatherings and business activities were put in place in California. Since then, the virus hasn't vanished, only moved beyond places such as New York City to communities in the South and West, with Texas on Tuesday surpassing the grim milestone of 10,000 new daily infections. To help track what the ongoing crisis means for U.S. consumer credit, credit-rating agency Moody's Investors has been keeping tabs on lender-relief efforts to date, as well as the usage by borrowers of the temporary aid programs. Their snapshot of COVID-19 consumer aid, broken down by asset class, shows the highest usage is among borrowers with student loans and auto debt. Tracking consumer debt relief Moody's Investors Service Drilling down, it's perhaps not shocking that the record $1.5 trillion pile of U.S. student debt has seen the usage of payment suspensions surge among eligible borrowers. Moody's data shows about 20% to 40% of borrowers with loans from the now defunct Federal Family Education Loan Program (FFELP), are using payment relief programs, up from 10% to 15% pre-crisis. Private student-loan relief jumped to around 10%-20% from 7% before the pandemic. Importantly, the rating agency only is reporting on consumer loans, not mortgages, that have been bundled into bond deals it rates, reflecting the latest data as of early June. Of note, government-backed mortgages and federally-owned student loans automatically were granted other forms of relief at the onset of the U.S. coronavirus outbreak. Read:Trump halts interest payments on student loan debts during coronavirus pandemic Auto debt, specifically loans and leases to borrowers with less-than-pristine credit, have jumped in recent months too, reaching as high as about 33% from around 2% pre-COVID-19 crisis, per Moody's. Previously, there were nearly no deferred payment requests by borrowers with cell-phone payment plans that were bundled into bond deals, but even that sector has seen requests for relief jump to nearly 5% of consumers with device payment plans. What's ahead? A lot will depend on the trajectory of new infections and \"if lawmakers fail to offer new programs to replace earlier stimulus and expanded unemployment benefits when they expire,\" according to the Moody's team lead by Jody Shenn, a senior analyst. The recent sharp rally in U.S. stocks has been under some pressure since Tuesday, after the White House reiterated a call for Congress to cap the next round of pandemic stimulus at $1 trillion or less, with the Dow Jones Industrial Average DJIA, +0.56%  treading water Wednesday the S&P 500 index SPX, +0.87% clinging to a slight gain. Senate Majority Leader Mitch McConnell, earlier this week, said the next round of stimulus could include another round of direct payments to some Americans, while saying a target for passing the measure would be ahead of Congress's August summer break."}]}