{"article": [{"url": "https://www.marketwatch.com/story/worried-about-being-bored-in-retirement-your-financial-adviser-has-a-plan-2020-09-11", "published": 1599928100.0, "headline": "Worried about being bored in retirement? Your financial adviser has a plan", "body": "After decades of working, your professional identity is seared into you. It largely shapes how you see yourself. As you near retirement, an underlying concern lurks just below the surface: What happens when my career ends? Where will I keep a sense of purpose? “The fear is entirely rational,” said Thomas Hlohinec, a Philadelphia-based financial adviser. “Look at a workaholic. With their work, they’re well respected. But they may be unhappy at home.” Executives can measure their success with yardsticks such as annual bonuses, impressive job titles and lavish perks. But at home, things are different. You might brag about your kids or possessions, but it’s not the same as gaining instant status from the soaring arc of a respected career. Advisers who help pre-retirees transition into a new phase know that the loss of professional prestige can sting. Even if their clients don’t necessarily love their chosen line of work, it gives them a daily structure and drive to excel. To proactively address his clients’ fears of losing their purpose after retiring, Hlohinec asks them two questions: 1. In the last five years, what aspects of your job did you not enjoy? 2. In the last five years, what did you work on that you really enjoyed? Their answers tell him a lot about how to design a retirement that capitalizes on what someone enjoys and minimizes what they don’t. If a client likes to coach new hires, for instance, Hlohinec might connect him with local entrepreneurship programs that seek volunteer mentors. “It’s shifting their focus from the fear and uncertainty of what’s ahead to getting them excited to do more of what they enjoyed,” Hlohinec said. When clients open up about their anxiety, attentive advisers welcome these personal conversations. They acknowledge the fear and offer a roadmap to address it. Ryan Sullivan uses a four-step approach to guide clients through their fears. A managing director at Hartford Funds in Wayne, Pa., Sullivan urges advisers to apply this repeatable process whenever a client confides in them: 1. Empathize: Before racing to offer solutions, attend to clients’ emotional state and see the situation through their eyes. 2. Offer perspective: Normalize the fear by assuring clients that they’re not alone. (“Many of my clients feel that way as they approach retirement.”) 3. Give options. Propose a menu of strategies for clients to consider. Explore a range of possibilities, from basic steps (“Sample a few new hobbies”) to more ambitious ones (“Run for city council”). 4. Agree on the next steps: Confirm what the client and adviser will do to implement potential solutions — and set a follow-up appointment. “In the last step, you’re setting up mileposts so that the client thinks about getting to the next meeting,” Sullivan said. “Having a definite date for the next interaction alleviates a fear of the unknown” and holds everyone accountable for following through. Advisers also can help by recommending outside resources, such as referring the pre-retiree to a therapist. For Kyle Moore, a certified financial planner in St. Paul, Minn., a simple gift works wonders: Moore gives out copies of “How to Retire Happy, Wild, and Free” by Ernie Zelinsky. For example, when a client in her late 60s, a university professor, expressed concern about retiring, Moore gave her the book. After reading it, she decided to pursue personal writing projects and serve on nonprofit boards as she segues into retirement over the next few years. “She went from being nervous about retirement to being more excited about it,” Moore said. “She still doesn’t know what’s on the other end, but now she has lots more ideas. The book helps you reflect on what skills you’ve acquired over your working years and how you can use those gifts and talents to be fulfilled in retirement.” More: Are you overlooking this critical factor in deciding what is the ‘best place’ to retire? Plus: You’re probably not ready to retire — psychologically"}]}