{"article": [{"url": "https://www.marketwatch.com/story/the-big-move-im-tired-of-renting-in-manhattan-but-love-living-in-new-york-is-now-the-time-to-buy-if-the-city-is-supposedly-dead-2020-08-25", "published": 1598690600.0, "headline": "The Big Move: Iâ\u0080\u0099m tired of renting in Manhattan, but love living in New York. Is now the time to buy if the city is supposedly dead?", "body": "â\u0080\u0098The Big Moveâ\u0080\u0099 is a new MarketWatch advice column exploring the ins and outs of real estate. Do you have a question about buying or selling a home? Do you know where your next move should be? Email Jacob Passy at jpassy@marketwatch.com. Dear MarketWatch, I have been reading with interest about the exodus of people from New York City, and the perhaps inevitable increase in house prices in towns up to 100 miles away, including Woodstock and Kingston. Rents have come down in the city as apartments lie empty or are difficult to fill with new tenants. But what about buying? I want to purchase a place in Manhattan, but Iâ\u0080\u0099m unsure whether to wait until next year when prices in New York City could come down further. Is that wishful thinking? Obviously, interest rates are at a record low, so thereâ\u0080\u0099s that. What should I do? What would you do? Sincerely, Manhattan Man, Tired of Renting Dear Manhattan Man, Iâ\u0080\u0099m sure Jerry Seinfeld would be thrilled to hear you want to stay in the city. The common wisdom thatâ\u0080\u0099s emerged since the coronavirus pandemic swept across the country is that city dwellers â\u0080\u0094 tired of working and teaching their kids from home â\u0080\u0094 are moving to the suburbs in droves in search of wide open spaces. In reality, across much of the country, thatâ\u0080\u0099s not really happening. Recent research from Zillow ZG, -0.42% Â shows that for most parts of the U.S., demand for homes in the suburbs has actually kept pace with demand in urban areas. New York, though, is one of the exceptions â\u0080\u0094 along with San Francisco. Youâ\u0080\u0099re correct: Sales activity in the Big Appleâ\u0080\u0099s suburbs are going through the roof. In areas such as Westchester County and the Hamptons, contract signings are occurring at double the pace from a year ago, according to recent data from brokerage Douglas Elliman and consulting firm Miller Samuel. The problem that many buyers moving to the suburbs have found is that there arenâ\u0080\u0099t enough homes up for sale to meet the demand. As a result, asking prices are rising quickly. The situation is very different in New York City. But before I address whether I think you should buy right now or wait, I first want to make an appeal to you: Talk to your current landlord. â\u0080\u009cThereâ\u0080\u0099s a chance you may be able to get a significantly lower rent,â\u0080\u009d said John Walkup, co-founder and chief operating officer of real-estate technology firm UrbanDigs. â\u0080\u009cLandlords with renters in hand are looking to keep those renters, whatever it takes.â\u0080\u009d Landlords are caught in a bind. Many renters are indeed fleeing for the suburbs â\u0080\u0094 and theyâ\u0080\u0099re not being replaced by the typical wave of college students and workers relocating to the city that never sleeps. Donâ\u0080\u0099t miss:â\u0080\u0098The housing market is on a sugar highâ\u0080\u0099: Home sales are soaring, but is it a good time to buy? Hereâ\u0080\u0099s what the experts say â\u0080\u009cNormally you have a lot of people come into the city during the summer â\u0080\u0094 that was really put on pause,â\u0080\u009d Walkup said. Many apartments are sitting vacant right now, and your landlord wouldnâ\u0080\u0099t want your unit to be thrown into the mix. Iâ\u0080\u0099m not sure when your lease is up, but you should see about cutting a deal with your landlord now while they may be sweating. If your rent goes down, youâ\u0080\u0099ll have more room to save up to buy the apartment of your dreams. On that note, prices for apartments in New York City have fallen. And they were falling even before the pandemic began, believe it or not. â\u0080\u009cPrices have been falling now for the third year in a row,â\u0080\u009d said Nancy Wu, an economist at Zillow subsidiary StreetEasy. According to Wu, sales are closing at around 10% lower than the asking price in recent months, which she said is a sign that â\u0080\u009ca lot of off-market negotiations are happeningâ\u0080\u009d behind closed doors. New York City has seen a building boom in recent years, with luxury condominiums springing up in Manhattanâ\u0080\u0099s Hudson Yards, Downtown Brooklyn and Long Island City in Queens. These newer units are pushing prices for older apartments down. Itâ\u0080\u0099s even hurt the values of condos in buildings bearing the Trump name. “ â\u0080\u0098Weâ\u0080\u0099re not seeing the panic on the sell side that would force prices lower.â\u0080\u0099 ” â\u0080\u0094 John Walkup, co-founder and chief operating officer of UrbanDigs Some neighborhoods are seeing bigger discounts than others. Apartments located near Midtown and the Financial District in Manhattan are a bargain right now. â\u0080\u009cThese are areas where people are usually paying a premium to be closer to where offices are,â\u0080\u009d Wu said. Naturally, with everyone working from home, thatâ\u0080\u0099s less of an urgent need these days. On the flip side, apartments with outdoor space such as terraces are fetching a significant premium. Data from Miller Samuel shows that apartments with terraces in Manhattan are selling for 5% more per square foot than they were before the coronavirus pandemic began. As you noted, low mortgage rates make buying a home a very appealing possibility right now. And economists say thereâ\u0080\u0099s no guarantee rates will stay that low â\u0080\u0094 if a coronavirus vaccine were to come along, for instance, rates would probably skyrocket. Similarly, thereâ\u0080\u0099s no guarantee prices will get any lower, or even stay as low as they are right now. â\u0080\u009cGeneral uncertainty has its tentacles everywhere,â\u0080\u009d Walkup said. Many sellers have simply pulled their homes off the market recently if they didnâ\u0080\u0099t get the offers they wanted, Walkup said. â\u0080\u009cWeâ\u0080\u0099re not seeing the panic on the sell side that would force prices lower,â\u0080\u009d he said. Read more:â\u0080\u0098It was definitely a gambleâ\u0080\u0099: What you need to know before buying a home virtually At the same time though, many people who bought homes in the suburbs may not have yet sold their Manhattan abodes. Should they choose to embrace the suburbs indefinitely, they may eventually sell their city properties. And if enough properties come onto the market, that could push prices down. My ultimate advice to you is this: First, make sure your finances are in order so you can make a large down payment and afford the additional costs that come with owning a property. You donâ\u0080\u0099t want to be in over your head with a mortgageâ\u0080\u0094 especially when your apartmentâ\u0080\u0099s value could drop. Then, keep your eye on the market. If you see a property you like, make an offer and see if the seller is open to negotiating. The worst that happens is you keep your current apartment â\u0080\u0094 with hopefully a lower monthly rent â\u0080\u0094 and you hold out for another apartment that catches your eye. Youâ\u0080\u0099ll lose all the bids you donâ\u0080\u0099t make on homes â\u0080\u0094 and timing the market amid a pandemic can be a bit of a foolâ\u0080\u0099s errand."}]}