{"article": [{"url": "https://www.marketwatch.com/story/the-government-is-making-a-big-change-in-how-it-reports-jobless-claims-heres-why-2020-09-02", "published": 1599070040.0, "headline": "The government is making a big change in how it reports jobless claims. Hereâ\u0080\u0099s why", "body": "Investors beware: The number of people applying for unemployment benefits could fall sharply when the government reports jobless claims on Thursday, but it wonâ\u0080\u0099t necessarily mean far fewer people are losing their jobs. The Bureau of Labor Statistics said last week it will change its method for adjusting initial jobless claims to account for seasonal swings in employment. Thatâ\u0080\u0099s a big deal. As a result, new claims could show a large decline of potentially 200,000 or more in the week ended Aug. 29. The BLS will report the numbers at 8:30 a.m. Eastern. Read: ADP says private sector added a less-than-expected 428,000 new jobs in August Why the change? The agencyâ\u0080\u0099s traditional season-adjustment process worked fine when the U.S. experienced regular ups and downs in employment around the holidays or the end of the school year. Tens of thousands of people, for example, are hired before Christmas and left go after the New Year. The claims numbers are adjusted to smooth out these normal swings in employment. Yet the old approach to seasonal adjustments has been thrown out of whack by a once-in-a-century pandemic. The seasonally adjusted numbers have constantly exceeded the actual number of people applying for benefits, with the gap becoming especially large in the past month. Consider the most recent week. The government said new jobless claims in the week ended Aug. 22 rose by 1 million after seasonal adjustments. Yet actual or unadjusted claims increased by a smaller 821,591. Thatâ\u0080\u0099s an 18% difference. The new method of adjustment, based on an additive instead of a multiplicative approach, is complicated to explain. Suffice to say it should result in a much narrower gap between the actual and seasonally adjusted number of new jobless claims. If so, new claims in the most recent week could fall to 800,000 or below. (If the number actually rises, it would be a bad sign). Wall Street DJIA, +0.56% Â economists polled by MarketWatch forecast a 940,000 reading, but not every estimate took into account the governmentâ\u0080\u0099s change in methodology. If itâ\u0080\u0099s not confusing enough, the government wonâ\u0080\u0099t revise prior figures for jobless claims under the old method of seasonal adjustments. Not that it matters all that much. Jobless claims soared to record peaks after the coronavirus struck and they are still extremely high by historical standards, even as they continue to decline. New claims ran in the low 200,000s each week and sat near a 50-year low before the crisis."}]}