{"article": [{"url": "https://www.marketwatch.com/story/heres-why-one-strategist-has-slashed-his-sp-500-target-and-it-isnt-just-because-of-the-fed-and-covid-19-2020-06-12", "published": 1591950560.0, "headline": "Hereâ\u0080\u0099s why one strategist has slashed his S&P 500 target â\u0080\u0094 and it isnâ\u0080\u0099t just because of the Fed and COVID-19", "body": "An earlier version misstated the direction of the Japanese yen. Well. The S&P 500 SPX, +0.87% Â dropped 5.9% on Thursday, the largest one-day decline since March 16. The small-cap Russell 2000 RUT, +0.55% Â entered correction territory in just three days â\u0080\u0094 the quickest descent since Dec. 2008. The dollar DXY, -0.58%, just a day after the Federal Reserve said it is likely to keep interest rates at zero for at least two years, had its best day since March 19. CNNâ\u0080\u0099s popular fear/greed gauge turned to neutral from greedy. Was it the Fedâ\u0080\u0099s lack of action? Signs that states including Arizona and Texas have seen a pickup in new infections? The increased odds that Democrats will make a clean sweep of not just the presidency but both chambers of Congress, and the possibility of higher corporate tax rates that would bring? All three, according to Barry Bannister, head of institutional equity strategy at Stifel, who lowered his price target for the S&P 500 to 3100 in December, from 3250 in August. â\u0080\u009cShifting 2020 election trends may threaten the 2017 corporate tax cuts and deregulatory environment, (2) While the Fed pledged to continue the current easing the Fed did not increase the pace of easing, which is an incremental tightening, and (3) a double-dip recession is possible if media and government continue to portray the SARS-Cov2 virus as a modern-day plague in a spectacle that we believe has become politicized,â\u0080\u009d he says. Bannister acknowledges the Fed and Treasury are â\u0080\u009call inâ\u0080\u009d but the S&P 500 is at a place where gross domestic product growth must follow through in the second half of the year. â\u0080\u009cStrength in defensive sectors relative to cyclicals this week indicates concerns about that second half GDP growth, which only time will clarify,â\u0080\u009d he said. He said defensive sectors, which have fallen relative to cyclicals since the rally from the March lows, are now likely to do better in comparison. Bannister adds that the Fedâ\u0080\u0099s success in holding down inflation-adjusted interest rates have kept price-to-equity multiples high. But it also results in higher volatility, causing larger swings in the S&P 500 as the equity risk premium approaches lower levels. The buzz Houston may reimpose a lockdown because of rising coronavirus cases. The Atlantic has an in-depth piece arguing that collateralized loan obligations have a far greater risk of default than rating agencies assign, and that banks could collapse if those as well as other instruments decline sharply in value. Hereâ\u0080\u0099s a lengthy rebuttal. Adobe ADBE, +2.30% Â reported earnings and contract revenue that topped Wall Street estimates, as COVID-19 increased demand for its digital products. Bankrupt automobile-rental company Hertz HTZ, -1.78% Â says it wants to sell up to $1 billion in stock to capitalize on the surge in its equity. Electric-car maker Tesla TSLA, +1.89% Â was downgraded to neutral while General Motors GM, -0.15% Â was upgraded to buy at Goldman Sachs. Goldman said data out of the U.S. housing market and Chinese car sales have made it more optimistic on GM, while recent datapoints for Tesla have been mixed. Activist investor Cevian Capital took a big stake in Pearson PSO, +4.62% Â , sending the educational publisherâ\u0080\u0099s shares higher. Consumer sentiment data for June highlight a quiet day on the economics front. The U.K. reported a catastrophic 20.4% decline in GDP for April, showing the economy dropped by more than a quarter from its pre-COVID peak. The market In a better mood â\u0080\u0094 U.S. stock futures ES00, +1.13% Â YM00, +0.82% Â NQ00, +1.63% Â roared higher, though they are still far below Wednesdayâ\u0080\u0099s levels. The dollar USDJPY, -0.38% Â rose against the Japanese yen. Gold GC00, +2.17% Â did inch higher, and oil CL.1, -1.62% Â rose. The chart Transaction data from U.S. credit and debit card usage compiled by 1010data show a collapse in spending on June 5, which is the last day of data that is available for that time series. The Dallas Fedâ\u0080\u0099s mobility and engagement index, by contrast, shows improvement on June 5 and 6, the last two datapoints of that series. It isnâ\u0080\u0099t immediately clear why, but could be suggestive of the impact of the nationwide protests over the death of George Floyd. Random reads Statues are falling across the world. Love it or hate it, there is a shortage of the Marmite yeast spread. Black holes donâ\u0080\u0099t just suck things in â\u0080\u0094 they also spew hot gas and energy into space. Need to Know starts early and is updated until the opening bell, but sign up here to get it delivered once to your email box. Be sure to check the Need to Know item. The emailed version will be sent out at about 7:30 a.m. Eastern."}]}