{"article": [{"url": "https://www.marketwatch.com/story/taxpayers-who-wait-to-file-their-taxes-this-year-can-get-interest-on-top-of-their-refund-just-dont-bank-on-getting-much-2020-06-26", "published": 1594736540.0, "headline": "Taxpayers who wait to file their taxes can get interest on their refund - what you need to know ahead of July 15 tax deadline", "body": "In this unusual and prolonged tax season, good things come to those who wait - like interest on top of a refund. The Internal Revenue Service will be paying interest to taxpayers on refunds for returns that are filed between April 15 and July 15. This year, the deadline to file a return and pay taxes is Wednesday, July 15 instead of the traditional April 15. That's a Treasury Department accommodation to help people with cash flow in the spring amid the coronavirus pandemic. Normally, interest on any refund doesn't accrue until a return is filed, explained Edward Zollars of Thomas, Zollars & Lynch, certified public accountants in Phoenix, Ariz. Likewise, the IRS usually doesn't start paying interest on refunds until 45 days from the return's due date. But President Trump's emergency declaration in mid-March enabled the Treasury Department to set new filing deadlines for the year and \"put the interest rules out the window,\" Zollars explained. The special rules on interest are usually applied in the wake of natural disasters like a flood, he noted. People who received their refund before April 15 will not be getting any interest payments, he added. Interest on refunds filed by July 15 \"will generally be paid from April 15, 2020 until the date of the refund,\" according to an IRS announcement. The interest rate through June 30, the end of the second quarter, is 5%, compounded daily. It's 3% during the third quarter, which starts July 1 and ends September 30. \"Interest payments may be received separately from the refund,\" the announcement said. The IRS did not immediately respond to a request for comment on more clarification about how it will pay the interest to taxpayers. As of July 3, the IRS had received 2.9 million fewer returns than it had at the same point last year. The tax collector had also processed 13.7 million fewer returns, which is a necessary step before it can issue a refund. The average refund was $2,762, according to IRS statistics. Don't miss:The July 15 tax deadline is almost here - here's one good reason NOT to worry People shouldn't be expecting a windall in these interest payments, Zollars said. Supposing a taxpayer received the average $2,763 refund on June 30, he or she would receive an extra $28.63, according to Zollars' calculation. A taxpayer receiving that refund on July 15 would get $32, Zollars said. \"These people will not be able to go on a vacation on this money. You might get a latte,\" he said. The IRS considers the money as taxable interest income, Zollars noted."}]}