{"article": [{"url": "https://www.marketwatch.com/story/volatility-in-oil-and-gold-may-offer-more-opportunity-than-risk-11599757413", "published": 1599743480.0, "headline": "Volatility in oil and gold may offer more opportunity than risk", "body": "“Many commodities are trading well below their long-term incentive prices,” says Alissa Corcoran at Kopernik Global Investors. MarketWatch photo illustration/iStockphoto Many of the biggest movers in commodities this year, including oil and precious metals, will continue to take the spotlight as the year draws on. Traders are trying to assess the effects of the pandemic on demand and are looking for signs of a global economic recovery. Year to date, the Bloomberg Commodities Index XX:BCOM, which is heavily weighted in energy, is down around 12%, with the Bloomberg Energy Subindex off almost 43% as of Sept. 8. “Many commodities are trading well below their long-term incentive prices,” says Alissa Corcoran, director of research at Kopernik Global Investors. As long as they continue to be in demand, however, these prices aren’t sustainable, and a move to their “incentive prices” would motivate spending to keep supply in line with demand, she said. Energy commodities are among the biggest decliners, with U.S. benchmark West Texas Intermediate crude CL CLV20 losing almost 40% so far this year. Oil prices have been “driven down by reduced demand,” said Corcoran. Oil below its long-term incentive price, which she estimates at $75 a barrel, is unlikely to stay at that level. On Sept. 8, U.S. and global benchmark oil futures BRN00 settled below $40 a barrel, the lowest since June. Still, John Echols, partner at Opportune, believes expectations for a slow restart of the global economy, and resulting tepid energy consumption growth, make it likely that crude oil and refined product prices will see only “modest increases” from current levels. Then, as the economy “moves toward normal,” and with U.S. drilling largely shut down, it’s “natural to see the possibility of an upcycle in prices within the intermediate term” of about 18 months. Outcomes related to the pandemic will be a “clear driver” for energy in coming months, he says. If the pandemic fades, then other factors, such as the U.S. presidential election, will come more into focus, Echols said. Meanwhile, most-active lumber futures LB00 had more than doubled for the year to a record high of $928.50 per 1,000 board feet on Sept. 1, with demand driven by home renovations and a move to the suburbs, as coronavirus restrictions slowed production, says Greg Kuta, president of lumber broker Westline Capital Strategies. The $1,000 area probably presents a “ceiling,” right now, with $450 as a floor, he said. Commodity investors, however, will continue to eye moves in precious metals, which got a boost as the pandemic raised demand for gold and silver as a haven. Signs of some recovery in global economies led silver, which is also an industrial metal, to far outpace gold’s rise. As of Sept. 8, silver futures SI00 SIZ20 traded around 50% higher year to date, while gold GC00 GCZ20 rose 27%. “The factors that have underpinned gold’s move higher are still with us,” said Ross Norman, chief executive officer of Metals Daily. Long-term drivers will continue to be 10-year U.S. Treasury yields BX:TMUBMUSD10Y, and the U.S. presidential election will play a part. “The unclear outcome, in what is likely a close run race, will be to keep uncertainty high and by extension, gold high,” Norman said. Metals Daily expects gold to potentially climb as high as $2,200 before year-end, “which would give gold a 45% gain on the year,” while silver may challenge the $35 level at year-end, which would represent a “massive” 95% gain on the year, says Norman. Overall, commodities can be “very volatile” in the short term, which “we view not as risk but as opportunity,” says Corcoran. The “best opportunities to invest are when commodity prices are well below their incentive price,” as is the current case for most commodities."}]}