{"article": [{"url": "https://www.marketwatch.com/story/oil-prices-inch-higher-friday-but-set-to-post-a-weekly-loss-amid-lingering-worries-about-coronavirus-impacts-2020-06-26", "published": 1593184880.0, "headline": "Oil prices decline, with U.S. prices down over 3% for the week as spread of coronavirus looks to hurt demand recovery", "body": "Oil futures declined on Friday, as a record rise in U.S. coronavirus cases and growing infections in parts of the world pointed to long-term challenges for a recovery in crude-oil demand, pulling U.S. prices down by more than 3% for the week. “The oil demand recovery story was dealt a blow this week after the U.S. registered the biggest-ever jump in coronavirus cases, suggesting many states may have to visit regional lockdowns soon,” wrote Edward Moya, senior market analyst at Oanda, in a Friday research note. U.S. states, including Arizona, Texas, South Carolina and Florida, saw confirmed cases rise by more than 30% over the past week, according to a Wall Street Journal analysis of data aggregated by Johns Hopkins University. West Texas Intermediate crude for August US:CLQ20 fell 23 cents, or 0.6%, to settle at $38.49 a barrel on the New York Mercantile Exchange, following a 1.9% gain on Thursday. US:CLQ20 Global benchmark Brent oil for August delivery UK:BRNQ20 shed 3 cents, or 0.07%, to end at $41.02 a barrel on ICE Futures Europe, after a 1.8% advance in the previous session. For the week, WTI saw a 3.4% decline, while Brent lost 2.8%, based on the most-active contract settlements last Friday, according to Dow Jones Market Data. Data from Baker Hughes BKR, -1.34% Friday showed little change in the weekly U.S. oil-rig count, which fell by just 1 to stand at 188. The number of active U.S. oil rigs has not seen an increase since the week ended March 13. Helping to provide some support for prices was a report from Reuters, using satellite data, pointing to a pick up in traffic in China, Europe and the U.S., that could be upbeat for energy uptake. However, that contrast with a survey of economists by Reuters that indicates expectations for a deeper global recession than earlier estimates, which could ultimately prove a headwind for oil prices in the future. In a note dated Thursday, Bethany Beckett, assistant economist at Capital Economics, said “given that we now expect China GDP growth to return to its pre-virus path by end-2020, domestic oil demand is likely to recover in tandem.” The picture outside of China, however, is “much less rosy,” she wrote. In the U.S., “we expect that the rapid rebound so far in gasoline demand will soon run out of steam and that it will only rise gradually thereafter.” “All told, it is clear that the near-term outlook for oil prices is fairly gloomy,” said Beckett. Capital Economics stuck to its price forecasts for Brent and WTI to reach just $45 a barrel by the end of this year. Read:AAA expects cheapest summer gasoline prices since 2016 On Nymex Friday, July gasoline US:RBN20 fell 3.4% to $1.1533 a gallon, losing 9.3% for the week, and July heating oil US:HON20 fell 1.7% to $1.1363 a gallon, ending 6.2% lower for the week. On its expiration day, July natural gas US:NGN20 gave up earlier losses to settle at $1.495 per million British thermal units, up 0.9%. Prices lost over 7% on Thursday after U.S. government data revealed a bigger-than-expected climb in domestic supplies for the week ended June 19. Prices were down more than 10% from last Friday’s finish. August natural gas US:NGQ20, the new front-month contract, fell 0.1% to $1.544."}]}