{"article": [{"url": "https://www.marketwatch.com/story/fed-to-signal-interest-rates-hikes-wont-be-an-issue-until-2024-2020-09-15", "published": 1600242920.0, "headline": "Fed to signal interest-rate hikes won't be an issue until 2024", "body": "The Federal Reserve is expected to signal later Wednesdat that its interest-rate policy will remain unchanged and close to zero through the end of 2023. For the first time, the Fed will release its economic projections for 2023. Economists expect the Fed's \"dot plot\" to show that most officials think rates will remain at 0.125%. \"It's looking like rate hikes are going to be a 2024 story, at the earliest,\" said Michael Gregory, deputy chief economist at BMO Capital Markets. The Fed will release a policy statement at 2 p.m. Eastern. Powell will hold a press conference a half hour later. Read:Fed is fighting the last battle and there are risks to the strategy While the unemployment rate has shown improvement, the lack of congressional action on another fiscal-aid package leaves the future path of the economy in doubt. The Fed may note the improved economy but not celebrate it. Avery Shenfeld, chief economist at CIBC Capital Markets, thinks the Fed may adopt \"conditional\" forward guidance, with officials pledging not to raise rates until specific economic conditions are met. This would follow the Bank of Canada's promise not to raise rates until inflation is sustainably back to their 2% target. Most other economists think a change in the Fed's forward guidance will be delayed until later this year. At the moment, the Fed statement says policymakers expect \"to maintain this target range until it is confident that the economy has weathered recent events and is on track to achieve its maximum employment and price stability goals.\" Shenfeld said the path of Fed rate policy depends so much on issues that are impossible to pin down. \"If someone told me that 'I don't think they're going to raise rates until 2024,' and someone else told me 'I think they are going to raise rates at the end of 2022', I would say both are reasonable guesses,\" Shenfeld said. Lewis Alexander, chief economist at Nomura Securities, said he didn't think the Fed has forged a consensus on forward guidance. \"We expect the FOMC to adopt this type of outcome-based forward guidance by the end of the year, but it does not seem ready to do that at this meeting,\" Alexander said in a note to clients. Instead, the Fed will take smaller steps, like setting the rationale for their monthly purchases of $120 billion of government bonds and mortgage-backed assets to advance its economic objectives. At the moment, the Fed has said the purchases were needed to \"sustain market functioning.\" Bigger questions will concern the scale and composition of asset purchases, and the Fed's long-term plan with its $7 trillion balance sheet. This will be the first Fed meeting under its new flexible inflation target strategy. This allows the Fed to let inflation run above 2%, and essentially calls for rates to remain lower for longer. Economists are watching to see how the strategy is incorporated in the statement and projections. Tim Duy, a Fed watcher at the University of Oregon, doesn't think this will cause major changes in the Fed's presentation Wednesday. \"For the moment, the Fed remains content to simply entrench expectations that the policy path is locked down at zero for the foreseeable future,\" he said. Stocks rose modestly Tuesday, with the Dow Jones Industrial Average DJIA, +0.56%  inching up slightly while the S&P 500 SPX, +0.87%  and Nasdaq Composite COMP, +1.39%  posted more solid gains."}]}