{"article": [{"url": "https://www.marketwatch.com/story/it-aint-over-its-new-york-2020-08-25", "published": 1598369120.0, "headline": "It ainâ\u0080\u0099t over! Itâ\u0080\u0099s New York!", "body": "New York canâ\u0080\u0099t die now. With all the shutdowns, the protests and the coronavirus restrictions, we couldnâ\u0080\u0099t even hold a proper shiva. You see? Thatâ\u0080\u0099s how real New Yorkers react when the panic rises around us and loud voices declare the cityâ\u0080\u0099s imminent demise, for what must be the 713th time. We respond with dark humor. With appropriate ridicule. And with practical suggestions for the loudest, richest whiners around: OK, then, sell me your three-bedroom Manhattan co-op for whatever you paid in 1974. Then, you can scamper off to Boca Raton or Scottsdale or East Hampton or wherever it is all the other scaredy cats are hiding during New Yorkâ\u0080\u0099s time of need. New York was never for everyone, and it sure isnâ\u0080\u0099t now. No doubt youâ\u0080\u0099ve heard the dire diagnoses. They say that COVID-19, racial unrest, rising disorder, rampant crime, darkened theaters, spectatorless sports, visible homelessness, and a gaping municipal deficit have all coalesced to make a once-great city unlivable at exactly the same time that Wi-Fi, Zoom ZM, +2.89% Â , shuttered offices and distance learning have made it unnecessary. And this time, the hand-wringers insist, New York isnâ\u0080\u0099t coming back. The latest round of New York bashing erupted on LinkedIn (of course) by a venture capitalist and hedge-fund manager (of course) under the headline: â\u0080\u009cNYC IS DEAD FOREVER. HEREâ\u0080\u0099S WHY.â\u0080\u009d In a very, very long post, James Altucher cites all the usual complaints and concludes: â\u0080\u009cI donâ\u0080\u0099t think I have an answer but I do think itâ\u0080\u0099s clear: itâ\u0080\u0099s time to move out of NYC.â\u0080\u009d Now that heâ\u0080\u0099s made his fortune here, heâ\u0080\u0099s chosen to spend it elsewhere, just like previous waves of tax avoiders, weather complainers and grumpy retirees from time to time have decided to do. And what exciting new locale has New Yorkâ\u0080\u0099s latest outbound refugee settled on? An apartment in Florida. â\u0080\u009cIâ\u0080\u0099m starting to like the sun a little bit,â\u0080\u009d he tells himself and the rest of LinkedIn Nation. â\u0080\u009cI mean, when itâ\u0080\u0099s behind the shades. And when I am in air conditioning.â\u0080\u009d Ah, Florida! Where the coronavirus still runs rampant, months after New Yorkâ\u0080\u0099s usual grit and determination have stomped the virus into the ground! Please, whatever you do, donâ\u0080\u0099t drive over to the local Walmart WMT, +1.00% Â without your mask on, no matter how the local culture warriors point and laugh at you! The Great Return: How to get the wealthy to come back to New York City? Thankfully, New York still has its high-profile defenders, people whose love for the city cannot be shaken by the challenges of any one moment. People like Jerry Seinfeld, who answered Altucherâ\u0080\u0099s funeral dirge with an op-ed in the New York Times. Seinfeld takes particular umbrage at the notion that â\u0080\u009cNew York is over because everybody will â\u0080\u0098remote everything.â\u0080\u0099 Guess what: Everyone hates to do this. Everyone. Hates. You know why? Thereâ\u0080\u0099s no energy. Energy, attitude and personality cannot be â\u0080\u0098remotedâ\u0080\u0099 through even the best fiber optic lines. Thatâ\u0080\u0099s the whole reason many of us moved to New York in the first place.â\u0080\u009d You go, Jerry! â\u0080\u009cReal, live, inspiring human energy exists when we coagulate together in crazy places like New York City,â\u0080\u009d he wrote. â\u0080\u009cFeeling sorry for yourself because you canâ\u0080\u0099t go to the theater for a while is not the essential element of character that made New York the brilliant diamond of activity it will one day be again.â\u0080\u009d Thereâ\u0080\u0099s no denying these are tough times in New York City, as they are almost everywhere. You think New Yorkâ\u0080\u0099s the only place where the gyms are empty and people canâ\u0080\u0099t send their kids back to school full time? See: â\u0080\u0098New York City, dead? Pshaw!â\u0080\u0099 says this lifelong resident. â\u0080\u0098I, for one, will not forsake my city. We roll up our sleeves and helpâ\u0080\u0099 In that way, New York isnâ\u0080\u0099t much different from most places except that New York has done such a better job curtailing the virus, which is the only thing that will put all the suffering behind us for good. However long that takes, New Yorkâ\u0080\u0099s in a far better position to bounce back. We have the infrastructure. We have the money, still big piles of it circulating around here. And we have the people, millions who havenâ\u0080\u0099t cut and run. Oh, and if the suspensions here seem more extreme than elsewhere, maybe itâ\u0080\u0099s because we had so much more to suspend. We miss Broadway because we had Broadway. We miss the worldâ\u0080\u0099s greatest restaurants because we had them.Â We miss the museums â\u0080\u0094 many of them are back now, by the way â\u0080\u0094 because where else would they be? And we still have each other, the ones who dragged us through the riots of the 1960s (much worse than the anarchists who infiltrated the Black Lives Matter protests), the bankruptcy threat of the 1970s (much worse than City Hallâ\u0080\u0099s current red ink) and the crime wave of the late-1980s and early-1990s (much worse than todayâ\u0080\u0099s troublesome uptick). In 1990, New York had 2,245 homicides. Last year, it was 318. Dispatches from a Pandemic: New York is reminiscent of the Wild West ghost town of my youth â\u0080\u0094 our cityâ\u0080\u0099s future depends on our collective fortitude If that number shoots up to 400 or 500, that would be awful. But weâ\u0080\u0099ve climbed out of deeper holes before, and we will climb out of this one. Ellis Henican is an author based in New York City and a former newspaper columnist."}]}