{"article": [{"url": "https://www.marketwatch.com/story/trump-says-biden-would-raise-taxes-by-4-trillion-budget-group-says-it-would-only-be-3-4-trillion-11600118437", "published": 1600104500.0, "headline": "Trump says Biden would raise taxes by $4 trillion. Budget group says it would only be $3.4 trillion", "body": "Printing Supervisor Donavan Elliott inspects sheets of one-dollar bills run through the printing press at the Bureau of Engraving and Printing in Washington. (Getty Images) Presidential candidate Joe Biden’s economic plans would bring more than $3 trillion into federal coffers over 10 years, but it would still not be enough to offset his spending plans, a nonpartisan budget group said Monday. In its analysis, the Penn Wharton Budget Model, a group led by former a George W. Bush-era Treasury Department economist Kent Smetters, scored Biden’s plans as boosting revenues by $3.4 trillion over 10 years, with a little bit less than half of that coming from raising corporate taxes. But that money would not offset the Biden’s planned new spending on just two big priorities — education and infrastructure/research and development. Overall, the PWBM projected spending to rise by $5.4 trillion, once those items and others were factored in. The estimates could add fuel to the fall presidential campaign fire. President Donald Trump has hit Biden as a tax-raiser. “The Biden plan begins with a $4 trillion tax hike. And that will end everything, including growth. There won’t be growth. There’ll be total contraction,” Trump said at a Sept. 7 press conference at the White House. Over the 10-year time horizon over which federal budgets are usually scored, the group said Biden’s plans would have a relatively minor impact on the size of the economy. Gross Domestic Product would drop by 0.5% in 2030, the last year of the budget window, but average hourly wages would grow by 2.7%, the group said. While the difference between Biden’s projected spending and his projected revenues would be about $2 trillion over 10 years, its increase in the national debt would only be about 0.1% in 2030 once the impacts on the economy from the policies were taken into account, a so-called dynamic analysis. According to the nonpartisan Congressional Budget Office, the government currently is set to spend almost $13 trillion more than it takes in from 2021 to 2030. But that assumes certain policies in the law now, like the expiration of individual tax cuts in the 2017 Republican tax overhaul, happen as scheduled, a prospect many doubt. President Trump’s budget released earlier this year, before the coronavirus pandemic hit, would have shaved about $2 trillion from the $13 trillion baseline deficit, according to the CBO. But their estimate was about $2 trillion less than what the White House’s Office of Management and Budget had projected would be cut from the deficit, thanks to differences in estimates of revenues and achievable savings between the two agencies. The White House declined to update its budget projections or economic forecasts in July, despite a law mandating the mid-congressional session review include “substantial changes in or reappraisals of estimates of expenditures and receipts” and “substantial obligations imposed on the budget after its submission.”"}]}