{"article": [{"url": "https://www.marketwatch.com/story/coronavirus-update-global-case-tally-tops-75-million-as-countries-push-ahead-toward-phased-reopenings-with-mixed-results-2020-06-12", "published": 1592053340.0, "headline": "Coronavirus update: Global case tally tops 7.68 million as countries push ahead toward phased reopenings - with mixed results", "body": "The number of global cases of the coronavirus that causes COVID-19 climbed above 7.68 million on Saturday, as countries around the world continued to lift restrictions on movement with mixed results. France has seen no increase in new cases of the illness a full month after ending a strict lockdown, and health authorities say there are 933 patients in intensive-care units across the country, a steep decline from the peak of 7,148 seen in April, the Guardian reported. France is expected to lift its state of emergency on July 10. Denmark, Austria and Germany are also moving ahead with phased reopenings as new case numbers continue to fall. But other countries, including Pakistan, Brazil and Russia, are still seeing sharp increases from day to day. Pakistan had a record number of new cases this week, and, given challenges in its health-care system, its true numbers are expected to be higher than official data show. In the U.S., Florida also saw its highest number of cases in a single day on Friday, exceeding the record set a day ago. The Sunshine State counted 1,902 new cases of COVID-19, according to the health department, after 1,698 new infections on Thursday, as the New York Post reported. That's almost 20% higher than the previous one-day record of 1,419 cases, recorded just last Thursday. Florida was an early hot spot in the U.S. but also moved early - on May 4 - to lift restrictions on movement, against the advice of health-care experts and public health officials. The loosened restrictions allowed people to flock to the beach, some of which were packed over the Memorial Day weekend. Another 23 states are still seeing increases in new infections, according to a New York Times tracker, including Arizona, Texas, California and Louisiana. Read now:Asymptomatic transmission of coronavirus appears to be worse than SARS or influenza - 5 reasons you should care President Donald Trump said he will resume his campaign rallies starting next Friday in Tulsa, Okla., as the Associated Press reported - that's another state that loosened restrictions on movement early. Gov. Kevin Stitt, a Republican, has placed no limits on crowds gathering, which health experts say is a one of the main risk factors in viral spread. Trump backed off holding the Tulsa gathering on a key date for black Americans, although Tulsa is also a key location, as the site of a horrifying race massacre on May 31 and June in 1921; white mobs killed up to 300 black people. And June 19, known as Juneteenth, is traditionally celebrated as the anniversary of slavery's end in the U.S.; it marks the day Abraham Lincoln's Emancipation Proclamation was read by Gen. Gordon Granger to freed slaves in Texas, the last state in which slaves were freed. For more, read: Black leaders call Trump's Juneteenth rally in Tulsa 'a slap in the face' Sen. Kamala Harris, a California Democrat and former presidential candidate, tweeted her criticism of the Tulsa rally plan: iframe.twitter-tweet { width: 100% !important; } Trump's campaign has warned attendees that they must assume all risks related to exposure to COVID-19 and agree not to hold the president and his re-election campaign liable for injury or illness. Meanwhile, in another sign that many Americans are wary of gathering in large numbers while the pandemic continues to rage, Walt Disney Co. DIS, +1.53% has become the subject of a Change.org petition protesting its announcement that it will reopen the Disneyland and Disney California Adventure theme parks on July 17, with significant operational changes. Those southern California theme parks have been closed to the public since March 14 as a result of the coronavirus pandemic. For more, read:'Disneyland reopening schedule looks like the unsafest thing ever': Thousands sign petition asking to delay July opening \"Many people have lost loved ones due to this pandemic and by reopening the parks they are endangering cast members and guests to be exposed to COVID-19,\" the petition reads in part. The petition also notes concerns about the potential for a second wave of COVID-19.Latest tallies There are now 7.68 million confirmed cases of COVID-19 worldwide, and at least 426,427 people have died, according to data aggregated by Johns Hopkins University. More than 3.7 million people have recovered. The U.S. has the highest case toll in the world at 2.05 million and the highest death toll at 114,703. Brazil has 828,810 cases and 41,828 fatalities, the data show, the second-highest death toll in the world, after it moved ahead of the U.K. overnight. Russia has 519,458 cases and 6,819 fatalities. India has moved past the U.K. by case numbers with 308,916 cases and 8,884 deaths. The U.K. has 294,402 cases and 41,566 deaths, the highest death toll in Europe and now third highest in the world. See now:The U.K. economy collapsed by a record 20.4% in April Two early hot spots, Spain has 243,209 cases and 27,136 deaths, while Italy has 236,305 cases and 34,223 deaths. Peru, France Germany, Iran, Turkey Chile, Mexico, Pakistan, Saudi Arabia, Canada and Bangladesh are next and all ahead of China, where the illness was first reported late last year. China has 84,229 cases and 4,638 deaths. Read:'We have glimmers of hope' - scientists testing whether coronavirus survivor plasma can prevent infection in othersWhat's the economy saying? The cost of goods imported into the U.S. rose in May for the first time since the coronavirus throttled the economy, reflecting a rebound in oil prices and signaling that a bout of deflation after the pandemic may be coming to an end, as MarketWatch's Jeffry Bartash reported. The price index for U.S. imports climbed 1% last month to mark the first increase since January. Excluding energy, import prices rose a much smaller 0.1%, the government said. Even after May's increase, import prices are 6% lower compared with a year earlier. The pandemic has delivered a massive blow to global trade, reduced demand for a variety of goods and services, and forced many companies to cut prices to try to drum up sales. Separately, U.S. consumer sentiment climbed to 78.9 in early June from 72.3 as reopening eased some worries.What are companies saying? The IPO market showed renewed resilience on Friday, after four deals priced at the top or above their price ranges and companies issued more shares than originally planned, with two of them, outdoor-building-materials maker Azek and vaccine producer Vaxcyte seeing rises of about 20% from their pricing levels in trading debuts. See now:Azek is going public: 5 things to know about the maker of decking, patio and other outdoor products CNBC reported that mortgage lender Quicken Loans is planning an IPO, and data-mining company Palantir Inc. is preparing to confidentially file for a deal, according to a Reuters report. Palantir was founded by VC Peter Thiel, and does data-mining work for the Trump administration. In other news, building products maker Johnson Controls International PLC said it will resume its share buybacks in the fourth quarter, after halting them at the peak of the pandemic to preserve cash. And sporting retailer Dick's Sporting Goods said it is resuming dividend payments. Elsewhere, companies continued to offer updates on their businesses and plans to reopen and to discuss bond deals. Here are the latest things companies have said about COVID-19: â\u0080¢ American Airlines Group Inc. AAL, +0.34% announced a series of business updates in a filing with the Securities and Exchange Commission as its demand trends and cash-burn trajectory improve from the worst of the pandemic. The company expects second-quarter revenue and total system capacity to be off by 90% and 75%, respectively, from a year earlier. American Airlines has cut $13.5 billion from its operating and capital budgets for the year through \"significant cost reduction actions\" around marketing, maintenance, events, training, airport facilities, and other areas. The company has \"passed the peak in cash refund activity\" as flight demand has started to improve. That's helped American Airlines' cash burn rate improve to an estimated $40 million a day for the month of June, from a peak of more than $100 million a day during April. The company is hoping to reduce its cash-burn rate to about zero by the end of the year \"as expected demand conditions continue to improve and its cost initiatives continue to gain traction.\" â\u0080¢ Centene Corp. CNC, -0.74%  raised its full-year earnings guidance to reflect its current expectations for membership, revenue and medical utilization trends during the pandemic. The managed care company is now expecting full-year per-share earnings of $3.06 to $3.20 and adjusted EPS of $4.76 to $4.96. The company expects full-year revenue to range from $109.5 billion to $111.9 billion. The current FactSet consensus is for full-year EPS of $4.72 and revenue of $110.7 billion. â\u0080¢ Dave & Buster's Entertainment Inc. PLAY, +0.37%, the entertainment and dining chain, reported a fiscal first-quarter loss amid lower sales caused by coronavirus. Dave & Buster's reported a loss of $43.5 million, or $1.37 a share, compared with net income of $42.4 million, or $1.13 a share, in the year-ago quarter. Revenue tumbled 56% to $159.8 million from $363.6 million a year ago. Analysts surveyed by FactSet had expected a loss of adjusted earnings of 77 cents a share on sales of $167.8 million. â\u0080¢ Dick's Sporting Goods Inc. DKS, -1.09% is bringing back its dividend. On June 10, the company declared a dividend of $0.3125 per share payable on June 30 to shareholders of record as of the close of business on June 22. The dividend program had been suspended as part of the measures taken to preserve liquidity after the coronavirus spread in the U.S. and stores were shuttered. Dick's Sporting Goods expects to reopen nearly all of its stores by June 30, will bring back \"substantially\" all of its associates from furlough and will restore pay, except for certain executives. â\u0080¢ JetBlue Airways Corp.'s JBLU, -0.07%  credit rating was downgraded further into \"junk\" territory at S&P Global Ratings, which cited an expected \"substantial cash flow deficit\" in 2020 as the pandemic has resulted in a steep decline in airline traffic. The rating was cut to B+, which is now four notches into speculative-grade. The outlook is negative, which warns of possible further downgrades. \"While the company is reducing capacity and some associated costs, and benefits from the steep decline in oil prices, we expect these to continue to be more than offset by much weaker traffic levels,\" S&P said. â\u0080¢ Johnson Controls JCI, -0.55% plans to resume share buybacks in its fiscal fourth quarter. Like many companies, Johnson Controls suspended buybacks during the coronavirus pandemic as it moved to preserve cash given the uncertain economic outlook. The company has about $735 million available under its current authorization for 2020 and $3.1 billion in the full program. â\u0080¢ Lululemon Athletica LULU, +2.52% reported fiscal first-quarter profit that was above Wall Street expectations but sales were a miss. The yoga-wear maker ended the quarter with $823 million in cash and equivalents, and a borrowing capacity of $398 million. Online sales were a highlight of the quarter, up 68% and making up half of the company's total sales in the three-month period. \"Our strong digital business demonstrates the strength of our guest connection,\" Chief Executive Calvin McDonald said in a statement. Lululemon didn't provide fiscal 2020 guidance thanks to \"rapid and continuous developments\" related to the pandemic's impact on its business. It also did not provide same-store sales figures, saying they wouldn't represent true business trends due to the closures. â\u0080¢ Party City Holdco Inc. PRTY, +0.39% announced a possible deal that would reduce the company's debt by 25% and raise $100 million in capital. The retailer made the announcement as it posted weaker-than-expected quarterly earnings as the pandemic hurt sales. \"[T]o support our ongoing transformation initiatives, we recently announced an agreement with certain of our bondholders to support a set of transactions that, if consummated, is expected to reduce the company's debt by over 25% and raise approximately $100 million in new capital,\" said CEO Brad Weston. The deal would be with 54% of holders of Party City's 6.125% senior notes due 2023 and 6.625% senior notes due 2026. Party City began to reopen stores on May 1, and 85% of locations are now in operation with measures taken to prevent the spread of coronavirus, including the addition of signage to encourage social distancing and restrictions on the number of customers in a store at one time. For the remainder of 2020, the company will shutter 21 stores and open two stores, with another 10 planned new stores moved to 2021. â\u0080¢ PVH Corp. PVH, -2.18%, owner of the Calvin Klein and Tommy Hilfiger brands, reported results below the Wall Street consensus due to the pandemic. A majority of its stores and wholesale customer stores were closed for an average of six weeks worldwide in the quarter because of the pandemic, and that it hoped to have more than 85% of its stores open by mid-June. Still, PVH expects its revenue decline in the second quarter to be \" more pronounced than in the first quarter. Coronavirus Update: U.S. Cases Top Two Million, Stocks Drop on Fed Plans"}]}