{"article": [{"url": "https://www.marketwatch.com/story/ipo-market-braces-for-another-five-deals-and-one-could-become-the-biggest-year-to-date-2020-06-15", "published": 1592374460.0, "headline": "IPO market braces for another busy week and Royalty Pharma becomes the biggest deal year-to-date", "body": "The newly revived U.S. market for initial public offerings welcomed the biggest deal of the year to date on Tuesday and shares soared out of the gate. Royalty Pharma RPRX, -0.04%, a buyer of biopharmaceutical royalties, priced its IPO late Monday at the high end of its range and upsized the deal, suggesting strong demand from investors. The company sold 77 million shares priced at $28 each to raise $2.2 billion. It originally planned to offer 70 million shares. That puts it ahead of the previous biggest deal, the IPO of Warner Music Group Corp., which raised $1.925 billion for the parent of Atlantic Records, Warner Records and Elektra Records. Shares were last up 61.6%. “Royalty Pharma is highly profitable and generates strong cash flow, and it intends to pay a dividend with 2.3% yield at the midpoint,” said Renaissance Capital, a provider of institutional research and IPO ETFs, in commentary. The shares are trading on Nasdaq under the ticker symbol “RPRX.” There were 13 banks underwriting the deal, led by J.P. Morgan. “Since our founding in 1996, we have been pioneers in the royalty market, collaborating with innovators from academic institutions, research hospitals and not-for-profits through small and mid-cap biotechnology companies to leading global pharmaceutical companies,” the company says in its IPO documents. Royalty Pharma has built a portfolio of royalties by co-funding late-stage clinical trials in return for future royalties, and by acquiring existing royalties from the original developers of drugs. The portfolio includes such drugs as Tysabri, an immunosuppressive drug that is used to treat multiple sclerosis and Crohn’s disease, and Imbruvica, a small molecule drug used to treat B cell cancers such as mantle cell lymphoma. “In 2019, a total of 22 therapies in our portfolio each generated 2019 end-market sales of more than $1 billion, including seven therapies that each generated 2019 end-market sales of more than $3 billion,” the company says. Proceeds of the IPO will be used for general corporate purposes and to make acquisitions if appropriate. The other deals this week are all in the biotech and health care sector. Oncology biotech Forma Therapeutics Holdings Inc. FMTX, -1.84% is planning to offer 11.8 million shares priced at $16 to $18 each to raise up to $212 million. The stock is expected to list on the Nasdaq under the ticker symbol “FMTX.” Jefferies, SVB Leerink and Credit Suisse are the joint book-running managers. The company recorded a net loss of $34.8 million on collaboration revenue of $100.6 million in 2019, after net income of $5.3 million on collaboration revenue of $164.1 million in 2018. Biotech Progenity Inc. PROG, -2.32% is planning to offer 6.7 million shares priced at $14 to $16 each, raising up to $107.2 million. The company has applied to list on Nasdaq under the ticker symbol “PROG.” Piper Sandler, Wells Fargo, Baird, Raymond James and BTIG are underwriters on the deal. Proceeds will be used for R&D and for working capital and general corporate purposes. Don’t miss:Why virus stocks are driving market volatility “We are a biotechnology company with an established record of success in developing and commercializing molecular testing products as well as innovating in the field of precision medicine,” says the prospectus. Another oncology biotech Repare Therapeutics Inc. RPTX, -2.77% plans to offer 7.4 million shares priced at $16 to $18 each to raise $133.2 million. The company has applied to list on Nasdaq under the ticker symbol ‘RPTX.” Morgan Stanley, Goldman Sachs, Cowen and Piper Sandler are underwriting the deal. Proceeds will be used to finance clinical trials, to fund other R&D and for working capital and general corporate purposes. The company had a loss of $12.6 million in the first quarter, wider than the loss of $4.8 million posted in the year-earlier period. Don’t miss:Mad dash for cash drives biggest month for follow-on offerings since the financial crisis Rounding out the list is Chinese cancer diagnostics provider Genetron Holdings Ltd. That company is planning to offer 13 million American Depositary shares in the IPO, which is expected to price between $11.50 to $13.50 a share, to raise up to $175.5 million. See also:Luckin Coffee shows how risky Chinese IPOs can be, but investors are just not listening The stock is expected to be listed on the Nasdaq under the ticker symbol “GTH.” Credit Suisse and CICC are the joint book-running managers. The company recorded a net loss of RMB676.0 million ($95.5 million) on revenue of RMB323.4 million in 2019, after a loss of RMB465.0 million on revenue of RMB225.2 million in 2018. The Renaissance IPO ETF IPO, +1.98% was up 3.9% Monday and has gained 25% in the year to date, easily outperforming the S&P 500 SPX, +0.87% which is down 6%. The ETF has benefited from the inclusion in the fund of recent deals involving companies that recently went public and that are prospering in the pandemic, including Zoom Video Communications Inc. ZM, +2.89% and Slack Inc. WORK, +3.36%"}]}