{"article": [{"url": "https://www.marketwatch.com/story/european-stocks-fall-dow-futures-slump-300-points-as-traders-react-to-fed-decision-11600328031", "published": 1600331540.0, "headline": "European stocks fall, Dow futures slump 300 points as traders react to Fed decision", "body": "Women wearing face masks exit a shopping mall where a sign is posted at the entrance reminding people of the mask requirement at the Westfield Santa Anita shopping mall on June 12, 2020, in Arcadia, California. Unibail-Rodamco-Westfield shares fell on Thursday. frederic j. brown/Agence France-Presse/Getty Images European stocks slumped and U.S. stock futures weakened on Thursday, with traders in Europe getting their first chance to react to the Federal Reserve’s decision and its cautious outlook on the world’s top economy. The Stoxx Europe 600 SXXP, +0.55% lost 0.8%, and the major regional indexes, the German DAX DAX, +0.06%, the French CAC 40 PX1, +0.71% and U.K. FTSE 100 UKX, +0.64%, registered similar declines. The Federal Reserve on Wednesday, after European markets had closed, stated it was planning to hold interest rates at nearly zero until at least 2024, as it also said bond purchases would be done to help foster accommodative market conditions and not just market functioning. Chairman Jerome Powell gave a cautious outlook. “All in all, the piecemeal changes to the Fed’s communications suggest the Committee is comfortable with current market conditions and with the likely path of recovery. Should conditions worsen, the Fed has left itself some room to strengthen the existing guidance,” said Bill Diviney, senior economist at Dutch bank ABN Amro. “Markets need some more time to digest the news because the reality is that the Fed’s message wasn’t even close enough to be hawkish,” added Naeem Aslam, chief market analyst at AvaTrade. “However, if we have learned anything from previous [quantitative easing programs], the market participants become jittery when the Fed starts scaling back from its asset purchase program. On this front, we do not have any clear and defined timeline.” The Bank of England didn’t alter interest rates, as expected, but minutes from the meeting indicated there was a discussion about how it could set negative interest rates if conditions warranted. The minutes also contained a pledge not to hike interest rates until there is “clear evidence” that significant progress was being made eliminating spare capacity and achieving the 2% inflation target “sustainably.” The pound GBPUSD, +0.83% fell after the decision. See London Markets. European automobile makers, including Renault RNO, -3.35% and Volkswagen VOW3, -0.23%, fell after data showing new-car registrations slumped 18.9% in August and a 5.7% drop in July. German registrations fell 20% and French registrations dropped 19.8%, the European Automobile Manufacturers’ Association said. U.K. clothing retailer Next NXT, +2.44% rose 3%. On the heels of positive reports from Inditex ITX, +0.33% and H&M HM.B, -1.22%, Next lifted its fiscal-year-ending-January profit forecast, now seeing a pretax profit of £300 million, up from its previous forecast of £195 million. Next said sales have held up much better than it expected, citing its online business, which already had presented more than half of revenue before the coronavirus lockdown, the strength of its home, childrenswear, loungewear and sportswear businesses, and its out-of-town stores. Unibail-Rodamco-Westfield URW, +2.28%, the shopping mall operator, slumped 7% after announcing a €3.5 billion capital raise, as well as a plan to limit dividends and dispose of €4 billion of assets by the end of 2021. Grenke GLJ, +1.02%, the German leasing company, rose 18% after a 40% drop on Wednesday. Grenke is going to hold a call with investors and analysts on Friday and said it strongly rejects the accusations of accounting fraud made by a short seller, Viceroy Research, and said there was a credit balance of €761 million in the German Bundesbank on Tuesday."}]}