{"article": [{"url": "https://www.marketwatch.com/story/oil-boosted-as-norway-strike-u-s-hurricane-curtail-crude-output-11602158754", "published": 1602170360.0, "headline": "Oil ends higher as hurricane cuts over 90% of Gulf crude output", "body": "Carina Johansen/Agence France-Presse/Getty Images Oil prices ended higher Thursday as Hurricane Delta forced the shut-in of more than 90% of the Gulf of Mexico’s crude output and the Saudis reportedly consider postponing OPEC plans to raise output. A strike in Norway also threatened to reduce production in the North Sea. As of Wednesday, 91.53% of Gulf oil production and 61.82% of natural-gas output were shut in as the hurricane churned in the Gulf of Mexico, according to the U.S. Bureau of Safety and Environmental Enforcement. Meanwhile, Saudi Arabia is considering the postponement of plans for the Organization of the Petroleum Exporting Countries to raise oil production early next year to the end of the first quarter, The Wall Street Journal reported Thursday, citing comments from senior Saudi oil advisers. They cited the rise in COVID-19 cases in many parts of the world, as well as the expected return of Libyan crude oil to the world market for rethinking the plan, the report said. OPEC and its allies, collectively known as OPEC+, had agreed to cut overall oil output by 9.7 million barrels per day starting in May. The group tapered the cuts starting in August to 7.7 million barrels per day. “The Saudi reluctance to raise output should solidify an oil bottom,” Phil Flynn, senior market analyst at The Price Futures Group, told MarketWatch. With uncertainty surrounding a second wave of COVID-19 cases and the success that OPEC+ has had with output cuts, and with global supply tightening, “why change course?” West Texas Intermediate crude for November delivery CLX20, -1.62% CL.1, -1.62% rose $1.24, or 3.1%, to settle at $41.19 a barrel on the New York Mercantile Exchange. December Brent crude BRNZ20, -0.07% BRN00, -0.07%, the global benchmark, added $1.35, or 3.2%, at $43.34 a barrel on ICE Futures Europe. Oil prices also got a boost amid a widening strike action could cut output in Norway, Western Europe’s largest oil producer, by a quarter, operators said on Thursday, according to Reuters. The “problems on the supply side can no longer be ignored,” said Carsten Fritsch, analyst at Commerzbank, in a note. “The strike in Norway could now also affect the country’s largest oil field – Johan Sverdrup — which has a daily production capacity of 470,000 barrels,” Fritsch said, in a note. If production was halted there, outages at all strike-affected oil fields would total 941,000 barrels per day, he said, noting the operator said production would need to be suspended if the strike, which began on Sept. 30, isn’t resolved by Oct. 14. Among the petroleum products traded on Nymex, November gasoline RBX20, -2.11% rose 2.6% to $1.2316 a gallon and November heating oil HOX20, -0.05% added 2.7% to $1.1923 a gallon. Oil prices had posted a decline on Wednesday, partly due to a weekly rise in U.S. crude supplies and uncertainty surrounding U.S. fiscal stimulus plans in Congress. There were also concerns that that Hurricane Delta “would create massive demand destruction because of power outages and flooding,” said Flynn, in a Thursday note. However, he believes that forecasts seem to suggest a weaker storm than previously indicated, so “production and demand might come back faster than anticipated.” Changes in demand linked to the pandemic have also been a concern for traders. In its World Oil Outlook report released Thursday, the Organization of the Petroleum Exporting Countries said that while the pandemic has led to “huge” financial losses in the energy industry, “there have been signs of the market rebalancing after the colossal 23 [million barrel per day] contraction in oil demand in April 2020.” The market, however, also has a “long way to go to eliminate the huge stock overhang and for the markets to return to balance and stability,” the report said. Read: OPEC expects oil to hold ground as the world’s fuel of choice through 2045 Natural gas, meanwhile, will be the “fastest-growing fossil fuel” between 2019 and 2045, according to the OPEC report. Global demand for the fuel is expected to rise to 91 million barrels of oil equivalent per day in 2045, from nearly 67 mboe/d in 2019. On Nymex Thursday, November natural gas NGX20, +5.17% added 2 cents, or 0.8%, to $2.627 per million British thermal units. The U.S. Energy Information Administration reported Thursday that domestic supplies of natural gas rose by 75 billion cubic feet for the week ended Oct. 2. On average, analysts polled by S&P Global Platts forecast an increase of 71 billion cubic feet."}]}