{"article": [{"url": "https://www.marketwatch.com/story/are-you-ready-for-your-second-act-how-would-you-feel-if-nothing-in-your-life-changed-for-5-years-2020-08-11", "published": 1597122440.0, "headline": "Are you ready for your second act? How would you feel if nothing in your life changed for 5 years?", "body": "This article is reprinted by permission from NextAvenue.org. You probably know actress Patricia Heaton from her TV sitcom roles on “Everybody Loves Raymond,” “The Middle” or “Carol’s Second Act.” That last show, recently canceled, led Heaton, 62, to explore the subject of second acts by interviewing 16 people who’ve launched them and writing “Your Second Act” — a book with their stories and advice, plus her own tips. She’s in a second act herself, doing humanitarian efforts with World Vision, selling the Patricia Heaton Home line of housewares at Walmart WMT, +1.00% and being a producer and author. You can hear her talk about second acts in the Second Act Stories With Andy Levine podcast. The following excerpt from “Your Second Act” can help you figure out if you’re ready for a second act. How do you know if you’re ready for your second act? There are some telltale signs that it’s time to make your move: a sense of restlessness, general dissatisfaction, the awareness that there is more, a dreadful nagging on the inside. Or, very clearly: you feel that you have no other choice. Sounds a little like a midlife crisis. The problem with that term is the word crisis. A better word would be metamorphosis. You don’t have to have a crisis when you are focused on your calling. It’s a good idea to take some time to reflect so you can clearly see what those clues are and figure out how to put them together. I think understanding your motivations is a good place to start. Our greatest motivation strikes when the pain of staying the same becomes stronger than the pain of change. So, stop and think for a moment about your life and how would you feel if nothing changed for the next five years? What about the next 10 years…or the next 20? How does the thought of that make you feel? The other interesting thing about motivation is that you can fuel it by your actions. Which brings me to my next point: just take action, because action fuels momentum. When moving into a new season, it’s a good idea to make peace with your past and take the time to really mourn it if necessary. You have to allow yourself to mourn the person you used to be and acknowledge disappointments, missed opportunities, expectations not met. Then choose to forgive yourself and anyone else who comes to mind in the process. Read: It might be time to think about a career change When we let go of what didn’t work out and our preconceived ideas and expectations, we make room inside for healthy things, like dreams for the future. Sometimes life has this wonderful way of providing unexpected launchpads into our next season. One very common launchpad for a second act is loss. Perhaps you experienced a layoff or divorce or the death of a parent or a loved one. Maybe you had an illness. If you are in a season of loss in your life right now, don’t view that loss as an end; view it as a launchpad. Then, try to move forward and find meaning from it. One thing to keep in mind: Even though it’s your second act, you can’t stage it alone. A core group of friends with common values helps make it easier to navigate the unchartered terrain. You might like: These boomers just made massive retirement mistakes — don’t be one of them I have wonderful friends that I’ve known for years, and we are all walking through this second act transition together. The six of us have married, birthed, adopted, struggled, prayed and laughed together for more than 30 years. I always know I can turn to them with and for advice. One of my friends, who has been an actress for many years, has transitioned into screenwriting. I now send her scripts to critique because she’s extremely perceptive. Another one, an artist, was also ready to make a change. She didn’t really know what she wanted to do next, so she set aside some time to do some soul-searching. As part of her self-exploration, she took the European pilgrimage El Camino de Santiago, or, in English, the walk of St. James. She still hasn’t settled on what she wants to do next but is more grounded internally and at peace with herself, her faith and this stage of her life. A few things you could try to help you decide whether to launch a second act: Take a class. Just stepping out and learning something new will do wonders for you. Also, many state colleges offer free tuition to adults age 62+, so look online for options in your area. Read books. Reading is a wonderful way to expand the mind, find inspiration, learn, and grow. Marci Alboher, vice president of Encore.org, has a wonderful book called “The Encore Career Handbook” that you may find useful. Journal. Your journal doesn’t have to be just about your deepest emotions and private thoughts. You can write goals. Journaling helps you slow down and really connect with your inner drive and motivation. See: Need ideas for your retirement ‘second act’? There’s no right or wrong way to frame up your second act. Start from a place of openness and curiosity and step out. And why not grab your friends and make a “second act” party out of it? Have a free-range inspiration session — share ideas, make vision boards, write goals, and hold each other accountable! Who knows? You may find someone who’d like to come along for the ride. For now, let me be the first to officially say…welcome to Your Second Act! (Your Second Act by Patricia Heaton. Copyright © 2020 by Third Coast Productions. Reprinted by permission of Simon & Schuster. All rights reserved.) Patricia Heaton is an Emmy Award-winning actress and author of “Your Second Act.” She runs the FourBoys Entertainment production company with her husband, David Hunt, and recently launched her homewares line, Patricia Heaton Home, with Walmart. A committed philanthropist, she is the founding member of World Vision’s Celebrity Ambassador Network. This article is reprinted by permission from NextAvenue.org, © 2020 Twin Cities Public Television, Inc. All rights reserved. It is art of the America’s Entrepreneurs Special Report"}]}