{"article": [{"url": "https://www.marketwatch.com/story/mad-dash-for-cash-drives-biggest-month-for-follow-on-offerings-since-the-financial-crisis-2020-06-12", "published": 1592209160.0, "headline": "Mad dash for cash drives biggest month for follow-on offerings since the financial crisis", "body": "Companies in need of cash are rushing to take advantage of an opportunity to raise money through equity markets while they still can. The mad dash to fortify balance sheets following a rocky spring and ahead of an uncertain fall helped make May the biggest month for follow-on offerings by dollar value since December 2009, according to Dealogic data. There’s perhaps no better sign of the exuberance of the current equity market than Hertz Global Holdings Inc.’s HTZ, -1.78% desire to sell up to $1 billion in new shares just weeks after it filed for bankruptcy. The market for initial public offerings hasn’t been quite as robust, though it’s picking up again after a slow start to the year. June isn’t even halfway over, but it’s already been the best month so far this year for IPO volumes, buoyed by successful debuts for Warner Music Group Corp. WMG, +0.54% and Vroom Inc. VRM, -0.26% Both stocks are up sharply from their IPO prices, helping inspire confidence among other companies considering moves to the public markets. “There’s still uncertainty about what the future holds with vaccines and a second wave [of COVID-19 infections], so while the window of opportunity is available, it makes a lot of sense for companies to raise capital,” said Reena Aggarwal, a finance professor at Georgetown’s McDonough School of Business. If the window is going to stay open through the balance of the year, “a lot has to fall in that direction,” said RapidRatings Chief Executive James Gellert. He deems it unlikely that there will be stability heading into election season or that the U.S. will avoid a second surge of COVID-19 infections, which could rattle investor confidence. Companies looking to bolster their balance sheets conducted 104 follow-on offerings that raised $50.3 billion in aggregate during May, making for the second largest month by dollar volumes since at least 1995, according to Dealogic. Last month’s totals compare with 62 offerings that raked in $15.5 billion in the same period a year ago. June has seen 59 follow-on deals so far valued at $16.4 billion in aggregate. Weekly follow-on volumes in each of the past five weeks have been at least double what was seen in the comparable periods a year earlier. “There’s a lot of diversity in terms of the size of the offerings,” Aggarwal said, citing smaller offerings in the $20 million range all the way up to billion-dollar plus deals like Moderna Inc.’s MRNA, +0.09% May offering, which raised more than $1.3 billion as the company works on developing a potential COVID-19 vaccine. There’s also been some variation in the scope of companies testing the IPO market, but many seem to be plays on the “new ways people are operating,” coming out of the COVID-19 crisis, said Kathleen Smith, a principal at Renaissance Capital, which offers the Renaissance IPO ETF IPO, +1.98%. The current IPO market is bringing out lots of new-economy technology companies, as is typical, but it also recently featured Azek Co. Inc. AZEK, +1.24%, which manufactures composite building products with more of a focus on residential business. Azek IPO: 5 things to know about the maker of decking, patio and other outdoor products “It’s not a tech company, not a biotech, but a company that will benefit from construction and home improvement” now that work-from-home trends mean increased spending on projects around the house, Smith said. Azek shares opened up 20% above their IPO price Friday after pricing the offering above a previously expected range. Azek notably has said that it intends to use some of its IPO proceeds to help pay back debt—a sign of the changing times, according to RapidRatings’ Gellert. “With companies that have debt to refinance, if they’re coming to the equity market, it suggests they’re willing to dilute current shareholders in order to retire debt…and generally means that they don’t have access to capital in the way they once did” now that the debt market has become more conservative, he told MarketWatch. After only six IPOs in March, 10 companies went public in April, followed by 15 in May and 18 so far in June, per Dealogic. The dollar value of deals conducted thus far in June totaled $7.45 billion, already making for the highest monthly total since May 2019, when Uber Technologies Inc.’s UBER, -0.18% blockbuster IPO helped drive monthly deal volumes of $17.1 billion. Read: Here’s how the Uber IPO stacks up among the biggest of all time The average IPO has returned 40% from the IPO price as of Thursday, according to Renaissance’s Smith, of which 26% represents the first-day pop. Equity-market investors seem increasingly willing to bet on fast-growth names that are still bleeding cash, in a departure from trends seen before the COVID-19 crisis began, when investors showed a preference for companies that seemed to be on more sustainable trajectories. “It’s as though the lessons of last year have not been carried forward into 2020,” Gellert said. Marketing software company ZoomInfo Technologies Inc. ZI, -2.31% saw losses nearly triple to $78 million in its latest fiscal year, but shares surged some 60% on their first day of trading and headed higher from there. That dynamic “runs against what we thought had emerged post-WeWork and Uber, with companies having to show a near-term path to profitability,” said Phil Haslett, the co-founder and chief revenue officer of EquityZen, a marketplace for pre-IPO shares. Fellow money-losing companies like Vroom and Lemonade Inc. LMND, +12.82%, which recently filed IPO paperwork, are also at odds with pre-pandemic IPO preferences, Haslett said, indicating that there’s “a lot of money that wants to get deployed into the market” given a relative drought in IPOs over the past few months. He said that investors might be willing to forgive big losses for software-as-a-service companies like ZoomInfo, which can be more easily compared to already-public companies, but there are few public analogies for Lemonade, which is in the insurance-tech business. One thing investors may not see much of in the current IPO market are true direct-to-consumer companies. Shares of companies like Uber, Lyft Inc. LYFT, +2.16%, and SmileDirectClub Inc. SDC, -2.59% have disappointed since their IPOs last year and while notable private names like Postmates and DoorDash may be looking for lifelines given changes in the food-delivery industry, they may have trouble currying favor with investors. “While the IPO window is certainly open, it’s a much longer putt for these businesses,” said Todd Holman, a director at Union Square Advisors."}]}