{"article": [{"url": "https://www.marketwatch.com/story/amid-alarm-over-trumps-refusal-to-commit-to-peaceful-power-transfer-both-parties-are-vowing-election-will-be-orderly-2020-09-25", "published": 1600996280.0, "headline": "Amid alarm over Trumpâ\u0080\u0099s refusal to commit to peaceful power transfer, both parties are vowing election will be orderly", "body": "WASHINGTON (AP) â\u0080\u0094 President Donald Trumpâ\u0080\u0099s refusal to commit to a peaceful transfer of power if he loses drew swift blowback Thursday from both parties in Congress, and lawmakers turned to unprecedented steps to ensure he canâ\u0080\u0099t ignore the vote of the people. Amid the uproar, Trump said anew heâ\u0080\u0099s not sure the election will be â\u0080\u009chonest.â\u0080\u009d See:Trump says Kentucky attorney general is â\u0080\u0098handlingâ\u0080\u0099 Breonna Taylor situation â\u0080\u0098very wellâ\u0080\u0099 and refuses to commit to peaceful transition of power Congressional leaders, including Senate Majority Leader Mitch McConnell and House Speaker Nancy Pelosi, rejected Trumpâ\u0080\u0099s assertion that heâ\u0080\u0099ll â\u0080\u009csee what happensâ\u0080\u009d before agreeing to any election outcome. Many other lawmakers â\u0080\u0094 including from Trumpâ\u0080\u0099s party â\u0080\u0094 vowed to make sure votersâ\u0080\u0099 wishes are followed ahead of Inauguration Day in January. And some Democrats were taking action, including formally asking Trumpâ\u0080\u0099s defense secretary, homeland-security adviser and attorney general to declare theyâ\u0080\u0099ll support the Nov. 3 results, whoever wins. Asked as he departed the White House for a campaign rally if the election is only legitimate if he is the winner, Trump said, â\u0080\u009cWeâ\u0080\u0099ll see.â\u0080\u009d The president said he wants to â\u0080\u009cmake sure the election is honest, and Iâ\u0080\u0099m not sure that it can be.â\u0080\u009d Trumpâ\u0080\u0099s attacks on the upcoming vote -- almost without modern precedent in the U.S. -- are hitting amid the tumult of the campaign, as partisan tensions rage and more Americans than ever are planning to vote by mail because of the coronavirus pandemic. Itâ\u0080\u0099s not the first time he has sowed doubts about the voting process. But his increased questioning before any result is setting off alarms ahead of an Election Day like no other. Even without signs of illegality, results could be delayed because of the pandemic, leaving the nation exposed to groups or foreign countries seeking to provoke discord. McConnell, the GOP Senate leader, said in a tweet, â\u0080\u009cThe winner of the November 3rd election will be inaugurated on January 20th.â\u0080\u009d He said, â\u0080\u009cThere will be an orderly transition just as there has been every four years since 1792.â\u0080\u009d Said Pelosi, â\u0080\u009cCalm down, Mr. President.â\u0080\u009d â\u0080\u009cYou are in the United States of America. It is a democracy,â\u0080\u009d she said, reminding Trump this is not North Korea, Russia or other countries with strongman leaders he admires. â\u0080\u009cSo why donâ\u0080\u0099t you just try for a moment to honor our oath of office to the Constitution of the United States.â\u0080\u009d Trump is fanning the uncertainty as he floats theories the election may be â\u0080\u009criggedâ\u0080\u009d if he loses, echoing warnings he made ahead of the 2016 voting â\u0080\u0094 even though past elections have not shown substantial evidence of fraud from mail-in voting. During a Wednesday news conference, Trump said, â\u0080\u009cWeâ\u0080\u0099re going to have to see what happens,â\u0080\u009d responding to a question about committing to the results. â\u0080\u009cYou know that Iâ\u0080\u0099ve been complaining very strongly about the ballots, and the ballots are a disaster.â\u0080\u009d Reaction to his comment was strong from Capitol Hill â\u0080\u0094 from both parties. Lindsey Graham, a Trump ally and the GOP chair of the Senate Judiciary Committee, told â\u0080\u009cFox & Friendsâ\u0080\u009d on Thursday: â\u0080\u009cIf Republicans lose, we will accept the result. If the Supreme Court rules in favor of Joe Biden, I will accept that result.â\u0080\u009d Rep. Liz Cheney of Wyoming, a member of the House GOP leadership, tweeted: â\u0080\u009cThe peaceful transfer of power is enshrined in our Constitution and fundamental to the survival of our Republic. Americaâ\u0080\u0099s leaders swear an oath to the Constitution. We will uphold that oath.â\u0080\u009d Joe Biden, the Democratic presidential nominee, was incredulous, â\u0080\u009cWhat country are we in?â\u0080\u009d he said late Wednesday of Trumpâ\u0080\u0099s comment. â\u0080\u009cLook, he says the most irrational things. I donâ\u0080\u0099t know what to say about it. But it doesnâ\u0080\u0099t surprise me.â\u0080\u009d On Capitol Hill, Trumpâ\u0080\u0099s possible refusal to accept the election results has been discussed privately for weeks as lawmakers consider options. One senator said recently it was the biggest topic of private discussions. Two House Democrats, Reps. Mikie Sherrill of New Jersey and Elissa Slotkin of Michigan â\u0080\u0094 both members of the Armed Services Committee â\u0080\u0094 are formally asking members of Trumpâ\u0080\u0099s Cabinet to go on record and commit to upholding the Constitution and peaceful transition. Gen. Mark Milley, chairman of the Joint Chiefs of Staff, responded in a letter to the lawmakers last month that he sees â\u0080\u009cno roleâ\u0080\u009d for the military to intervene in a disputed election. But Defense Secretary Mark Esper declined to respond to the lawmakersâ\u0080\u0099 questions. Similar queries have been sent to Attorney General William Barr and acting Homeland Security Secretary Chad Wolf. They have yet to respond. â\u0080\u009cThe president canâ\u0080\u0099t successfully refuse to accept the results of the election without a number of very senior officials aiding him,â\u0080\u009d said Slotkin, a former CIA analyst. Sherill, a former Navy pilot, said peaceful transition â\u0080\u009creally relies a lot on the Cabinet officers turning over their departments to the next administration.â\u0080\u009d She told The Associated Press recently she wants to hear from â\u0080\u009call of them.â\u0080\u009d Meanwhile, Republicans are rushing to fill the vacancy on the Supreme Court created by Ruth Bader Ginsburgâ\u0080\u0099s death, partly to ensure a Trump-friendly court majority to resolve any post-election lawsuits by their party or Trump himself. Texas Sen. Ted Cruz is among leading Republicans pushing the importance of the courtâ\u0080\u0099s role. And Graham suggested on Fox that the Supreme Court could end up all but declaring the winner. Democrats object strongly. â\u0080\u009cHe wants to be named president for life?â\u0080\u009d Sen. Elizabeth Warren, D-Mass., exclaimed at the Capitol. Thatâ\u0080\u0099s how a â\u0080\u009cdictatorâ\u0080\u009d operates, she said. â\u0080\u009cThatâ\u0080\u0099s not how a democracy works.â\u0080\u009d Earlier Thursday, the White House press secretary Kayleigh McEnany sought to clarify Trumpâ\u0080\u0099s words, saying he â\u0080\u009cwill accept the results of a free and fair election.â\u0080\u009d But the press secretary did not define her terms and added that Trump wants to â\u0080\u009cget rid of mass, mail-out voting.â\u0080\u009d The president, who avails himself of mail-in voting himself, has tried to distinguish between states that automatically send ballots to all registered voters and those, like Florida, that send only to voters who request them. Five states that routinely send mail ballots to all voters have seen no significant fraud. Of the nine states with universal ballots this year, only Nevada is a battleground, and likely pivotal only in a total national presidential deadlock. Before the 2016 election, much as now, Trump refused to commit to accepting the results during the summer. â\u0080\u009cI have to see,â\u0080\u009d Trump said two months ago on â\u0080\u009cFox News Sunday.â\u0080\u009d â\u0080\u009cNo, Iâ\u0080\u0099m not going to just say yes. Iâ\u0080\u0099m not going to say no, and I didnâ\u0080\u0099t last time either.â\u0080\u009d MarketWatch contributed."}]}