{"article": [{"url": "https://www.marketwatch.com/story/americans-are-eyeing-homes-in-the-suburbs-as-pent-up-demand-hits-housing-market-2020-06-17", "published": 1592377760.0, "headline": "Americans are eyeing homes in the suburbs  as pent-up demand hits housing market", "body": "Coronavirus cases may be on the rise in some parts of the country, but that hasn’t stopped Americans from looking for homes to buy. And increasingly, those homes are in the suburbs. A new study from Realtor.com found that Americans are showing a more pronounced interest suburban and rural areas as the housing market recovers from pandemic-induced shutdowns. Views of online home listings in May 2020 on Realtor.com grew by 13% compared to May 2019 for suburban ZIP codes, roughly double the rate of urban areas, researchers found. Overall, suburban listing views in May 2020 exceeded those from a year ago. And while it’s not rare for views of suburban listings to outpace views of urban ones, Realtor.com reported that the discrepancy was the second largest since it began tracking this data in 2016. Read more:Racist house deeds were ‘the most powerful tools to segregate American cities and determine who could own properties’ Meanwhile, listing views for homes in rural areas were up 16% year-over-year. And while it now takes longer to close a deal because of the pandemic, the time homes spend on the market in the suburbs and rural areas has not increased as substantially as in urban areas. “ ‘The housing market continues to experience the release of unrealized pent-up demand from earlier this spring.’ ” — Joel Kan, associate vice president of economic and industry forecasting at the Mortgage Bankers Association Time on the market increased 25% in rural areas and 30% in the suburbs, while it was up 35% in urban areas in May. This is a sign that less densely populated parts of the country are attracting greater demand. “This migration to the suburbs is not a new trend, but it has become more pronounced this spring,” Javier Vivas, director of economic research at Realtor.com, said in the report. “After several months of shelter-in-place orders, the desire to have more space and the potential for more people to work remotely are likely two of the factors contributing to the popularity of the burbs.” Also see:Mortgage rates are circling record lows — will the Fed’s actions push them lower? While cities like New York and Seattle were the biggest hot spots for the pandemic in the U.S., these were not the metropolitan areas that appeared most primed for a migration to the suburbs. Listing views of suburban homes increased the most compared with a year ago among home shoppers in McAllen, Texas, followed by Oklahoma City and Augusta, Ga. (Realtor.com is operated by News Corp NWSA, -1.35% subsidiary Move Inc., and MarketWatch is a unit of Dow Jones, which is also a subsidiary of News Corp.) Regardless of where buyers live currently — or where they’re looking to buy — interest in entering the property market continues to grow. The number of people applying for mortgages used to purchase homes increased for the ninth consecutive week, hitting the highest level in over 11 years, according to data released Wednesday by the Mortgage Bankers Association. “The housing market continues to experience the release of unrealized pent-up demand from earlier this spring, as well as a gradual improvement in consumer confidence,” Joel Kan, associate vice president of economic and industry forecasting at the Mortgage Bankers Association, said in the report."}]}