{"article": [{"url": "https://www.marketwatch.com/story/germanys-dax-turns-positive-for-the-year-after-eu-leaders-agree-coronavirus-recovery-package-2020-07-21", "published": 1595334800.0, "headline": "European stock rally fades after EU leaders agree coronavirus recovery package", "body": "European stocks rose on Tuesday, as European Union leaders finally agreed a €750 billion ($860 billion) coronavirus rescue fund after marathon negotiations. The bloc’s 27 leaders had been locked in discussions for four days over the spending package aimed to aid the economic recovery — twice the scheduled time — making investors nervous at the beginning of the week. But news of the deal boosted European equities, sending the German DAX DAX, +0.06% into positive territory for the year. The German benchmark index lost some of those gains in the afternoon, slipping back into the red for 2020, trading 1% up for the day in late afternoon trading. The pan-European Stoxx 600 SXXP, +0.55% index provisionally closed 0.3% up, having made 1.2% gains earlier in the day, while the French CAC PX1, +0.71% rose 0.2% and the U.K.’s FTSE 100 UKX, +0.64% nudged 0.1% higher. The euro EURUSD, +0.60%, which had climbed to four-month highs earlier in the week on hopes of a deal, climbed 0.5% after an initial fall. The negotiations had reportedly stalled due to a split between the so-called frugal EU countries — Sweden, Denmark, the Netherlands and Austria — and those worst affected by the pandemic, such as Italy and Spain. The agreed deal will see €390 billion offered in grants to individual countries, with the rest coming in the form of loans, lower than the proposed €500 billion in grants. The leaders also agreed on a multiyear budget of around €1.1 trillion from 2021-2027. Sam Cooper, vice president of market risk solutions at Silicon Valley Bank, said the conclusion of the marathon summit would be a relief to many and an opportunity when it comes to the euro. “Although the euro initially sold off in what appears to be a classic case of buy the rumor, sell the fact, many will welcome the developments and view the intraday weakness as an opportunity to buy a ticket for the long-term euro rally,” he said. GVC Holdings GVC, +3.85% fell 11.7% after the FTSE 100 betting and gambling group said it was being investigated by the U.K. tax authority over “potential corporate offending” in relation to its former Turkish-facing online gambling business. Norway’s Adevinta ADE, +1.25% surged 26% after the online marketplace said it had agreed to buy eBay’s EBAY, +6.47% classified ads business for $9.2 billion."}]}