{"article": [{"url": "https://www.marketwatch.com/story/tesla-battery-was-long-on-vision-and-boldness-short-on-the-here-and-now-2020-09-23", "published": 1600863980.0, "headline": "Tesla's so-called Battery Day was 'long on vision and boldness,' short on here-and-now", "body": "A \"sell the news\" reaction was in full display Wednesday as Tesla Inc. shares sunk more than 8%, a day after the Silicon Valley car maker's long-awaited \"Battery Day\" appeared to disappoint most on the Street. Tesla's stock TSLA, +1.89%  tumbled 8.6% in midday trading, and was on track for its lowest close in two weeks. Shares are down more than 20% in September, but have nearly quadrupled this year, compared with gains of less than 2% for the S&P 500 index SPX, +0.87%. Tesla late Tuesday unveiled a road map to what it called better, 56% cheaper and more efficient batteries set to lower electric-car prices. The plans included changes in battery size, design and engineering, and are being developed at a pilot battery plant in Fremont, Calif. The company also announced a future $25,000, fully autonomous car within three years and a longer-range, souped up \"Plaid\" Model S sedan version. Read more about Tesla's announcement. It was \"close to working,\" Chief Executive Elon Musk said at the event. \"It does work but not with a high yield,\" he went on to say, sending the stock plunging in the late session Tuesday. Wall Street latched onto that multiyear horizon and a perceived lack of specifics, although at least one investment bank upgraded its rating on to buy and recommended a \"buy the dip.\" \"Overall, Tesla's battery day was long on vision and boldness, but short on specifics and near term deliverables,\" Toni Sacconaghi with Bernstein said in a note Wednesday. The event \"at times felt more visionary (even \"vaporware-ish\") than specific, with few details\" around production locations, timing, and key technical milestones achieved so far, he said. Moreover, an improved battery technology \"will only get Tesla a small part of the way towards achieving\" the goal of selling a $25,000 car, Sacconaghi said. On the positive side, Musk's statement that he expected Tesla to grow 30% to 40% this year is consistent with earlier plans and \"appears to imply a strong Q4,\" he said. Emmanuel Rosner at Deutsche Bank upgraded Tesla stock to buy from hold, saying that Battery Day showcased an \"impressive trajectory for its technology, capacity and cost, which should help accelerate the world's shift to electric vehicles and extend Tesla's lead considerably.\" In addition to the planned battery-technology improvements and the \"Model 2\" $25,000 car, Tesla also unveiled plans to build \"massive\" battery-cell capacity, which would open new markets for Tesla in long-haul trucking, stationary energy storage, and supplying batteries to other manufacturers, Rosner said. He raised his price target on Tesla to $500 from $400, implying a 26% upside from Wednesday's prices. \"With the stock price indicated down post market as traders 'sell the news,' we recommend longer-term investors take advantage of weakness to buy Tesla as the best way to invest in vehicle electrification,\" he said. Adam Jonas of Morgan Stanley highlighted the costs associated with Tesla's battery plans. Battery Day \"largely lived up to the hype, but didn't clearly exceed it,\" he said in a note. Tesla's battery technology \"is outpacing current growth in supply... and it's time to spend significantly.\" It is \"too soon to tell if the increase in execution risk is commensurate with the potential increase in rewards beyond that already heavily discounted in the current share price,\" Jonas said. Patrick Hummel at UBS said that \"patience was required,\" since most of what Tesla presented on Battery Day is at least one year from fruition and lacked detail. \"Nonetheless, we remain confident Tesla remains the battery tech and cost leader,\" he said, with the caveat that leadership \"seems already fully discounted.\" Garrett Nelson at CFRA said he came away \"impressed\" with Tesla plans, but the hype leading up to the event was such that the \"sell the news reaction was perhaps unavoidable.\" \"If there was any disappointment, we think it was the fact there was no mention of a million mile battery per se,\" he said. Musk's focus on lowering vehicle prices and making electric cars more affordable also may have raised some concerns among investors hoping that the company's innovations would instead result in \"must have\" features, Nelson said. \"Nonetheless, we remain hard-pressed to find a more compelling EPS growth story and view [Tesla's] addition to the S&P 500 as an eventuality and positive catalyst,\" he said."}]}