{"article": [{"url": "https://www.marketwatch.com/story/heres-what-wall-street-is-saying-about-nikola-founders-shocking-departure-2020-09-21", "published": 1600693520.0, "headline": "Hereâ\u0080\u0099s what Wall Street is saying about Nikola founderâ\u0080\u0099s â\u0080\u0098shockingâ\u0080\u0099 departure", "body": "Shares of Nikola Corp. added to earlier losses on Monday as Wall Street faulted founder Trevor Milton for his â\u0080\u009cmisstepsâ\u0080\u009d in the wake of his resignation but largely kept its expectations for the stock unchanged. Nikola NKLA, -1.36% Â stock fell more than 20%, on track for its lowest close since May 22 and its largest percentage decline since July 20. Mondayâ\u0080\u0099s losses would snap a three-session winning streak for the shares, which are down 34% this month but 161% higher in the year. That compares with gains of around 0.5% for the S&P 500 SPX, +0.87% Â this year. Donâ\u0080\u0099t miss:3 things to know about Teslaâ\u0080\u0099s â\u0080\u0098battery dayâ\u0080\u0099 Nikolaâ\u0080\u0099s board announced Miltonâ\u0080\u0099s voluntary departure earlier Monday, naming board member and former General Motors Co. GM, -0.15% Â executive Stephen Girsky as board chairman. The focus â\u0080\u009cshould be on the company and its world-changing mission, not me,â\u0080\u009d Milton said in the statement accompanying the news. Miltonâ\u0080\u0099s departure comes roughly two weeks after a scathing report earlier this month by short seller Hindenburg Research that roiled the companyâ\u0080\u0099s shares, accusing Nikola of being an â\u0080\u009cintricate fraudâ\u0080\u009d built on lies told by Milton. The electric-vehicle maker fired back by saying the report was â\u0080\u009cfalse and misleading.â\u0080\u009d The Justice Department and the Securities and Exchange Commission are reportedly in looking into the allegations. Of the five analysts covering Nikola polled by FactSet, three rate the stock a hold and two rate it a buy. Their average price target is $47.50, implying an upside of more than 75% over Mondayâ\u0080\u0099s prices. See also: GM should spin off electric-vehicle business, Deutsche Bank says JPMorgan analyst Paul Coster kept his overweight rating on Nikola shares, but dialed down his price target to $41 from $45 â\u0080\u009cto reflect risk,â\u0080\u009d he said in a note Monday. The new chairman may be a better fit for Nikola in its next phase, â\u0080\u009cbut Trevor Miltonâ\u0080\u0099s resignation could weigh on some of the partner and customer relationships he has forged, and employee morale is probably fragile right now, just as the workload is intensifying and competitive threat looms,â\u0080\u009d he said. JPMorgan kept its expectations for the stock unchanged, saying it presumes that Nikola â\u0080\u009cwill still execute to plan given that most developments to date have slightly exceeded our expectations, that is with the exception of Mr. Miltonâ\u0080\u0099s social media and marketing missteps.â\u0080\u009d Related:Nikolaâ\u0080\u0099s stock rockets after GM takes $2 billion equity stake, announces partnership Miltonâ\u0080\u0099s departure was a positive for the stock, even as the â\u0080\u009coptics of the resignation are terrible,â\u0080\u009d Jeffrey Osborne at Cowen said in their note. Cowen kept its rating on Nikola stock at their equivalent of buy with a $79 price target. â\u0080\u009cHopefully this will minimize the drama in the weeks and months ahead as the company moves forward with the development of its all electric and fuel cell Class 8 trucks and related infrastructure as well as works to close the deal with General Motors,â\u0080\u009d he said. Milton relied heavily on his Twitter and Instagram accounts to engage with critics of his company, showing that â\u0080\u009cthere were some elements of being a public company that in our view the company and some members of management were not prepared for,â\u0080\u009d the analyst said. New board chair Girsky and other senior executives at the helm â\u0080\u009cwill set a more measured and less promotional tone with investors. We continue to see catalysts ahead for the stock,â\u0080\u009d Osborne said. Dan Ives of Wedbush called Miltonâ\u0080\u0099s departure a â\u0080\u009cshocking move.â\u0080\u009d â\u0080\u009cTrevor stepping down voluntarily at Nikola will be perceived by the Street as a major near-term gut punch for the companyâ\u0080\u0099s lofty EV ambitions as he plays a key role strategically in driving the companyâ\u0080\u0099s vision,â\u0080\u009d Ives said. â\u0080\u009cWhile there will be a lot of worries on the Street around Trevorâ\u0080\u0099s departure especially in light of the bear noise recently with the company, going forward Nikola has a strong bench and now itâ\u0080\u0099s all about execution going forward with the GM partnership a linchpin to its success.â\u0080\u009d Nikola is still a â\u0080\u009cprove meâ\u0080\u009d stock, Ives said, keeping his rating the equivalent of hold with a price target of $45."}]}