{"article": [{"url": "https://www.marketwatch.com/story/online-food-prices-jump-as-food-companies-struggle-to-meet-demand-2020-07-13", "published": 1595060180.0, "headline": "Online food prices jump as food companies struggle to meet demand", "body": "Online food prices have climbed 4.2% over the past six months according to the latest Adobe Inc. data as grocery e-commerce accelerated amid the COVID-19 pandemic and food producers struggled to keep up with continued high demand. “We’ve always thought of the online marketplace as a ‘value marketplace’ for consumers, meaning consumers can get a bit more bang for their buck, and this is supposed to be a more favorable time of year for them in terms of prices,” said Vivek Pandya, digital insights manager at Adobe. “But they aren’t getting that relief.” Grocery prices typically go up in the second half of the year as the holidays roll around, Adobe ADBE, +2.30% wrote on its blog. But the increase in food prices was a bit extreme when compared with the latest consumer inflation data. “Food at home” costs have gone up 5.6% on a yearly basis, according to government data released on Tuesday. That’s the highest jump since 2011. Read:Higher gas, food prices trigger first increase in consumer inflation in four months U.S. online grocery sales rose 9% month-over-month in June, reaching $7.2 billion, according to the Brick Meets Click/Mercatus Grocery Survey. That survey found that the June sales increase corresponded with increased concern about contracting coronavirus and as more food retailers offered the option for grocery pickup after ordering online. See:The meat industry will be completely gone in 15 years, Impossible Foods CEO says “This increase in online grocery capacity has flipped the equation,” said David Bishop, partner and research lead at Brick Meets Click. “Today as shoppers have more choice, the increased capacity is now actually enabling the continued growth of online grocery.” The number of coronavirus cases in the U.S. has reached 3.3 million with Florida counting a record of more than 15,000 new cases on Sunday. The U.S. death toll is more than 135,000. Some state legislators and public health officials have called for stay-at-home orders as the number of cases surge. Overall, Adobe found that e-commerce spending was $77 billion higher than expected while inflation has driven digital purchasing power (DPP) into negative territory for the first time ever, “which means consumers can now purchase goods online for $1.01 that would have cost $1.00 in June 2019,” Adobe said. The SPDR S&P Retail ETF XRT, +0.05% is down 5.6% for the year to date. The Invesco Dynamic Food and Beverage ETF PBJ, +1.66% is down 8.3%. And the S&P 500 index SPX, +0.87% has slipped 2.2% for the period. “Online grocery orders for delivery or curbside collection have grown significantly and we expect online penetration to grow structurally,” Fitch Ratings wrote in a report about global corporate recovery from coronavirus. Read:Grocery prices are rising as eat-at-home demand soars during the pandemic “Some weaker regional companies with limited investment capacity may be unable to support robust omnichannel models and will lose share to better-capitalized companies.” Adobe notes that grocery cart size has fallen due to a decline in stockpiling and rising online grocery prices after skyrocketing 33% in mid-February . Even if shoppers aren’t pantry-loading any longer, food manufacturers have discussed the struggle to keep up with demand. Campbell Soup Co.’s CPB, +0.10% Chief Executive Mark Clouse addressed what he’s seeing in consumer demand as the pandemic progresses in the U.S. during third-quarter earnings call in June. For example, the company saw a 140% increase in demand for ready-to-eat soup, which had a significant impact on manufacturing. There’s also been an increase in cooking from scratch, with Clouse saying that risotto made with tomato soup is a “very, very high demand recipe.” And customers are trying new products, which is hopefully accompanied by a positive response. “So the other work that we need to be doing right now is to really understand that optimal assortment and making sure that inventory remains kind of balanced with where demand’s going to come from, that we’re selective and thoughtful about what that assortment looks like, while making room for innovation that we still believe is going to be important,” Clouse said, according to a FactSet transcript. See:We have plenty of food, so why are grocery store shelves so empty? Clouse says customers might not see the same number of promotions going forward, something that other food producers, like Conagra Brands Inc. CAG, +0.18% noted as well. Also:Meat shortage looms as coronavirus shuts packing plants leaving farmers with tough choices Conagra, on its June 30 call, highlighted the “robust demand” for frozen vegetables. “Given the incredible surge in demand we experienced during the fourth quarter and our number one brand position, we hit a ceiling on capacity,” said Sean Connolly, chief executive of Conagra, according to a FactSet transcript. Despite the challenges, shoppers don’t have to worry about a widespread lack of food. “There is limited supply-chain risk in this sector, other than some shortages (such as beef) in key food categories,” Fitch Ratings said."}]}