{"article": [{"url": "https://www.marketwatch.com/story/3ms-stock-sinks-as-increase-in-n95-face-mask-demand-wasnt-enough-to-deliver-an-earnings-beat-2020-07-28", "published": 1595953040.0, "headline": "3Mâ\u0080\u0099s stock sinks as increase in N95 face mask demand wasnâ\u0080\u0099t enough to deliver an earnings beat", "body": "Shares of 3M Co. took a dive Tuesday, after the maker of personal safety, industrial and consumer products reported second-quarter earnings that fell short of expectations, as the negative effects of the COVID-19 pandemic outweighed the positives, which included a ramp-up in sales of N95 face masks. The stock MMM, +0.94% Â slumped 4.9% to $155.33, the first loss in six sessions, and enough to pace the Dow Jones Industrial Averageâ\u0080\u0099s DJIA, +0.56% Â decliners. The $7.91 price decline shaved about 54 points off the Dowâ\u0080\u0099s price, while the index dropped 205.49 points, or 0.8%. â\u0080\u009cThe financial impact of the pandemic remained mixed across 3M during Q2. We continue to see strong demand in personal safety, along with other areas such as home improvement, general cleaning and biopharma filtration,â\u0080\u009d said Chief Executive Mike Roman in a post-earnings conference call with analysts, according to a FactSet transcript. â\u0080\u009cAt the same time, we experienced steep but expected declines in other end markets including medical and dental elective procedures, automotive [original equipment manufacturing] and aftermarket and general industrial.â\u0080\u009d The personal safety business includes the production and sales of N95 respirators, which are face masks used by health care professionals globally as protection from the coronavirus. Although 3M ramped up production to make 800 million respirators in the first half of the year and expects to make 2 billion this year, which is triple what it made in 2019, Roman said demand continues to â\u0080\u009cfar outpace what the industry can supply.â\u0080\u009d 3Mâ\u0080\u0099s personal safety business is part of its safety and industrial business segment, which saw sales fall 9.2% from a year ago to $2.7 billion, but topped the FactSet consensus of $2.6 billion. 3M said personal safety sales saw double-digit growth, driven by â\u0080\u009cunprecedented levels of demandâ\u0080\u009d for its respirators. But the rest of its safety and industrial business portfolio â\u0080\u009cdeclined significantlyâ\u0080\u009d because of the pandemicâ\u0080\u0099s effect on global industrial production. See related: 3M sees coronavirus boosting demand for face masks, as China projected to return to growth. Among 3Mâ\u0080\u0099s other businesses, health-care sales slipped 0.4% to $1.8 billion, missing the FactSet consensus of $1.95 billion, as the COVID-19 pandemic resulted in delays in elective medical procedures and closed most dental offices around the world. The oral care business was the most impacted, as sales fell 60%. Elsewhere, transportation and electronics sales tumbled 20.9% to $1.9 billion, below expectations of $2.0 billion, as continued weakness in consumer electronics, particularly smartphones, offset strength in its semiconductor, factory automation and data center business. Consumer sales declined 6.2% to $1.2 billion, roughly in line with expectations of $1.22 billion, as growth in home care products sales, particularly for its Scotch-Brite cleaning products, was offset by declines in stationery and office supplies sales, as many offices and schools were closed. Overall sales fell 12.2% to $7.18 billion, below the FactSet consensus of $7.32 billion. Net income rose to $1.29 billion from $1.13 billion, and earnings per share grew to $2.22 from $1.92. Excluding nonrecurring items, adjusted earnings per share fell 16.4% to $1.78, which missed the FactSet consensus of $1.80. On an adjusted basis, operating margins were 19.6%, compared with 20.8% in the first quarter. The fact that investors were disappointed with 3Mâ\u0080\u0099s results isnâ\u0080\u0099t much of a surprise. Although the stock gained after first-quarter results, it is now set to decline on the day earnings were reported for the fifth time in the past six quarters, and for the seventh time in 10 quarters. Also read: 3Mâ\u0080\u0099s stock surges on earnings beat, that was nearly 20 years in the making. The stock has shed 12.0% year to date, while the Dow has lost 7.6%.The good news On the bright side, 3M said it realized cost savings during the quarter, which Roman said were mostly temporary, of $400 million, which was at the high end of the estimated range of $350 million to $400 million. In addition, adjusted free cash flow improved 18% from a year ago to $1.5 billion, well above the FactSet consensus of $1.07 billion. 3M said it was still unable to provide financial guidance, given uncertainties surrounding the duration, magnitude and pace of recovery from the COVID-19 pandemic. However, the company said so far for the month of July, total sales are up in the â\u0080\u009clow-single digitsâ\u0080\u009d percentage range from last year. While it is still very early in the third quarter, the current FactSet consensus for revenue of $7.63 billion implies a 4.6% decline from last year. â\u0080\u009cWe are seeing a broad-based pickup in growth across our businesses and geographies as we start the third quarter,â\u0080\u009d said new Chief Financial Officer Monish Patolawala in the post-earnings conference call. â\u0080\u009cWith respect to respirators, we anticipate continued strong demand, which we estimate will contribute approximately 300 to 350 basis points to companywide Q3 organic growth.â\u0080\u009d And although costs are expected to increase as sales growth improves, Patolawala said the company would maintain its â\u0080\u009caggressive cost discipline.â\u0080\u009d As a result, he expects adjusted operating margins to improve to the 20% to 21% range."}]}