{"article": [{"url": "https://www.marketwatch.com/story/rice-futures-slice-year-to-date-gain-in-half-over-the-course-of-a-week-2020-06-12", "published": 1591975640.0, "headline": "Rice futures slice year-to-date gain in half over the course of a week", "body": "Rice has outperformed most major commodities so far this year, touching their highest level since 2008 earlier this month, as consumer demand for the food staple spiked in the midst of pandemic-related hoarding. Trading has been volatile, however, and futures prices look to end the week down nearly 22%, for their biggest weekly loss since March 1994, according to FactSet data. The rice market has seen a couple of years of tighter stocks “with Mother Nature delaying or outright stopping planting,” said Ted Nelson, risk management consultant for INTL FCStone, with heavy rains affecting the 2019-20 crop throughout the U.S. Delta region, which includes the top rice-producing state of Arkansas. So far in 2020, most-active rough rice futures have climbed 21%, with the July contract US:RRN20 settled at $16.065 per hundredweight on Friday. Most-active rice futures settled at $22.065 on June 4, the highest finish since April 25, 2008. Carryout stocks for the 2019-20 crop year, which is defined as the amount of supply minus demand, has dropped throughout the year on the back of early export demand, said Nelson. Then came an “unexpected spike in domestic use and export interest” as the COVID-19 pandemic brought “food security” to the fore. The tighter stocks and higher demand situation “pushed an already illiquid futures market into levels we have not seen since 2008,” said Nelson. “Currently, there is a very tight, almost nonexistent supply in the U.S. interior markets,” said Nelson, adding that domestic mills and rice buyers are trying to ration demand, with new crop rice only a couple of months away from harvest. Shawn Hackett, president of Hackett Financial Advisors Inc., however, doesn’t see a shortage. Instead, it’s “access” to rice that may be a problem because of COVID-19 hoarding. There “could be regional shortages stemming from logistical problems,” he said. If those pandemic fears subside, and the U.S. ends up with a large crop, that may cause prices to collapse, said Hackett. Upcoming supplies in the U.S., however, are expected to rise. They should be “much more plentiful” for the 2020-21 crop year, Nelson said. Total acres planted in the U.S. are forecast to rise to 2.85 million acres this year, from 2.54 million acres in 2019, according to a U.S. Department of Agriculture report released in late March. The USDA also forecasts the 2020-21 U.S. rice crop at 216.2 million hundredweight (cwt), up 17% from a year earlier, according to a report released in May. Nelson expects rice prices to weaken as harvest starts in Louisiana and the southern Delta and “works its way north starting in the coming weeks.” Globally, however, supply and demand may remain tight. The International Grains Council estimates global rice demand of 500 million metric tons for the 2020-21 crop year, with production at an estimated 506 million metric tons. So globally, “this year’s weather in key growing areas will be watched closely and any adverse weather could result in reduced global production,” said Blake Robben, senior market strategist at Archer Financial Services. On a short-term basis, Robben expects rice prices to remain within a $16 to $13 range, “unless the market undergoes another supply shock.”"}]}