{"article": [{"url": "https://www.marketwatch.com/story/florida-to-lift-ban-on-nursing-home-visits-2020-09-01", "published": 1598972960.0, "headline": "Florida to lift ban on nursing home visits", "body": "TALLAHASSEE, Fla. (AP) — Florida Gov. Ron DeSantis announced Tuesday that he will lift the state’s ban on visiting nursing homes that has cut off vulnerable seniors from family since mid-March over fears of spreading the new coronavirus. With his voice cracking at times, he wondered aloud if his actions might have contributed to suffering in his state. At one point, he took a long pause to collect himself as he made his announcement during a round table in Jacksonville. “Part of having a healthy society is understanding that human beings seek affection,” DeSantis said. “Many of the folks understand that they have loved ones who are in the last stage of their life. They’re not demanding a medical miracle. They’re not having unrealistic expectations. They just would like to be able to say goodbye or to hug somebody, so ... It was, you know ...” Then the visibly emotional governor paused to collect himself, and silence filled the room for about 20 seconds. “I think it’s difficult to think that some of our actions may have precipitated,” the governor said, his final word barely audible as he invited another speaker to take over. DeSantis said he would lift the ban on visitations in an executive order later Tuesday, following recommendations from a nursing home task force that has met in recent weeks. The governor’s order is expected to allow family members to visit their loved ones no more than two at a time, wearing protective gear including masks. Facilities would need to go 14 days without any new cases of COVID-19 among staff or residents to allow the visits. A task force appointed by the governor recommended a lengthy set of rules last week, giving wide leeway for wary nursing homes on how to implement them. Critics were quick to express concern over what will likely be a patchwork approach, varying greatly among facilities statewide. More than half of Florida facilities — 62% — have not had new cases since Aug. 11, said Mary Mayhew, who led the task force and heads the state’s Agency for Health Care Administration. The biggest sticking point was over hugging and touching, with gut-wrenching debates between the task force’s health experts and an advocate for families. The task force ultimately recommended that essential caregivers be allowed to touch and hug loved ones. But some members, including state Surgeon General Dr. Scott Rivkees, repeatedly expressed grave concerns during task force meetings. “The more people that are coming in, that really increases the risk,” Rivkees said last week. Task force member Mary Daniel pleaded on behalf of hugs for residents who she said are dying from loneliness. Daniel took a part-time job as a dishwasher just to be allowed to visit her husband, who has Alzheimer’s. “I’m turning in my two weeks’ notice today. I’m not going to be a dishwasher anymore. I’m going back to being just a wife,” Daniel said Tuesday. She represents the group Caregivers for Compromise Because Isolation Kills Too. All parties agreed on the terrible toll isolation has taken on residents, who have now gone almost six months without seeing loved ones. Some facilities expressed concerns about the continued danger of exposing vulnerable residents to the virus while new cases remain high — though on a downward trend for several weeks — and without more widespread testing and stricter distancing rules. “I am concerned that the state will throw open the doors to our communities and then walk away. Suddenly you will see a war develop between providers and families as we try to do what is best for residents and staff,” said Jay Solomon, CEO of Aviva senior home in Sarasota. It’s unclear how many of the state’s more than 4,000 nursing homes, assisted living facilities and group homes will choose to open to visitors in any capacity. “I received feedback from our members — who represent 82% of the nursing homes in Florida — that some of the administrators are scared because they’ve worked so hard” to keep the virus out, said Emmett Reed, executive director of the Florida Health Care Association, an industry advocacy group. “And then some of them are like, ‘We have to get visitors in here.’” Mayhew said Tuesday that she felt confident visitors would adhere to the rules knowing the stakes were high. “Human touch is absolutely critical,” said Mayhew, whose 87-year-old mother has been living with her for several months during the pandemic. “I understood how much my mother craved the interaction. No one should be going this long without a hug.”"}]}