{"article": [{"url": "https://www.marketwatch.com/story/a-juneteenth-revival-we-must-end-economic-violence-too-2020-06-19", "published": 1592567360.0, "headline": "A Juneteenth revival: we must end economic violence, too", "body": "Following the brutal murder of George Floyd on May 25, protests against police brutality further uncovered the systemic police violence that occurs within and across American communities. At the same time, we are witness to an ongoing global pandemic that is disproportionately harming and killing black people. Polling shows that from late May to early June, Americans’ support for the Black Lives Matter movement “increased by nearly as much as it had over the previous two years.” We are seeing a multiracial, intersectional movement that is growing in people power, scope, and impact. One key example of this is Juneteenth, also known as Freedom Day. Though it’s not (yet) a national holiday, Juneteenth rapidly became a business holiday in recent weeks. While a day off to honor the good side of history should be celebrated, we cannot forget how the blatant, longstanding dehumanization of black people has laid the foundation for state-sanctioned violence and unequal health outcomes. In this unprecedented year, Juneteenth will serve as a rallying cry to end police brutality, but it is also an important moment to reckon with another prevailing form of violence: racial wealth inequality. Racial wealth inequality is a defining American issue — and a painful generational setback. Between 1983 and 2016, the wealth of a typical black family decreased by more than 50%, compared to a 33% increase for the typical white household. The median Latinx family saw its wealth rise marginally, but it hasn’t topped $10,000. Recent data show that nearly 20% of black people missed a mortgage payment because they simply didn’t have the means to pay it due to continuous economic strain. The COVID-19 pandemic revealed how persistent racial wealth inequality exacerbates the everyday economic marginalization of lack and Latinx families in times of national emergency. In these times, these families draw on whatever savings and assets they have to support themselves, while turning to kin networks who, themselves, have been disproportionately impacted by cut hours, job loss and small-business closures. More than one in six black workers lost their jobs between February and April. Additionally, recent analysis reveals that businesses owned by black, Latinx, and Asian entrepreneurs have closed at alarming rates during the pandemic. Long before the coronavirus, racial wealth disparities were among the highest they have been in more than 25 years. Saying “we’re all in this together” ignores the reality of what these inequities mean for black and brown people during economic downturns when we all have less. Black and Latinx communities have yet to fully recover from the Great Recession, which resulted in the greatest striping of wealth from communities of color in modern American history. Notably, younger and middle-aged black and Latinx families were especially hard-hit. As a result of the last recession, black Americans had nearly half of their wealth ripped from their grasp. Since 2010, however, white and Asian families have seen their wealth begin to grow again, while the wealth of black and Latinx households is still on a decline. COVID-19 has exposed the many structural flaws — and systemic racism — built into our society, including the criminal legal system, inadequate access to quality health care, and a skewed economy — all of which are mutually reinforcing and uphold the racial wealth gap. Taken together, they provide a clear warning sign of widening racial wealth inequities likely to come in the months and years ahead. They also show the systems and institutions we need to rebuild or dismantle to uproot the racial wealth gap entirely. Small, temporary policy changes that don’t build toward long-term transformative change will not fix this deep-seeded issue. The question for us going forward is: How do we begin to address the racial wealth inequities that were in place long before COVID-19 and have been aggravated since? Over the past several months, along with a group of economists, historians, and other scholars, as part of the National Council on Eliminating the Black-White Wealth Gap, I’ve been looking at the types of big, structural changes that would get at the underlying cause of the disparities and implement targeted policies that uplift black people. We believe that one way to get at the deepest root of racial wealth inequality — the enslavement of black people — is for Congress to convene a study for a reparations program and follow through with its recommendations. We cannot overcome such massive wealth inequality through wishful thinking and a handful of policies. It will take a comprehensive, direct reparations program to begin to eradicate centuries-old wealth disparities. As Sandy Darity and A. Kirsten Mullen wrote, “Today’s black-white wealth gap originated with that unfulfilled promise of 40 acres. The payment of this debt is feasible and at least 155 years overdue.” We must also eradicate the flawed and harmful assumption of individualism. For the last 20 years, policy makers have heavily invested in “solutions” that focus on individual savings, financial technology, or financial coaching as vehicles to address racial wealth inequities. For too long, we’ve promoted approaches that rely on outdated notions of individual responsibility or that address the symptoms of racial wealth inequality instead of their root causes. We should invest in the youngest generation and establish a trust for all young adults, providing them with seed capital to build wealth. Research shows that this type of program would narrow the racial wealth gap, while benefitting young people of every race. In addition to channeling money away from the police into community violence prevention programs and public goods, we must also address civil and criminal fines and fees and other wealth-stripping financial schemes within the criminal legal system and civil courts. Ultimately, Juneteenth reinvigorates the push for structural reform—and in some cases, abolition. It may seem like a lot. But a lot is what is required provide true liberation, including freedom from violence and economic insecurity, to black people and to us all. Anne Price is president of the Insight Center, a national research and economic justice organization working to ensure that all people become and remain economically secure."}]}