{"article": [{"url": "https://www.marketwatch.com/story/we-want-a-stable-dollar-says-u-s-treasury-secretary-mnuchin-it-is-the-reserve-currency-of-the-world-and-were-going-to-protect-that-11595512747", "published": 1595505920.0, "headline": "â\u0080\u0098We want a stable dollar,â\u0080\u0099 says U.S. Treasury Secretary Mnuchin: â\u0080\u0098It is the reserve currency of the world and weâ\u0080\u0099re going to protect thatâ\u0080\u0099", "body": "Treasury Secretary Steven Mnuchin says that a stable U.S. dollar is the goal of the Trump administration, while, separately, noting that some froth was percolating in the stock market that has surged since its coronavirus lows seen in late March. “ â\u0080\u0098There clearly are some individuals stocksâ\u0080\u0093Iâ\u0080\u0099m not going to mention their namesâ\u0080\u0093where valuations are a questionÂ .â\u0080\u0099 ” â\u0080\u0094 U.S. Treasury Secretary Steven Mnuchin Speaking on CNBC on Thursday morning, responding to questions about the recent trend of weakness in the dollar, Mnuchin noted the nearly unceasing climb in benchmark stock indexes even as the economy continues to reel from the COVID-19 pandemic. The Nasdaq Composite Index COMP, +1.39% has seen 48 consecutive trading days without back-to-back losses. The Nasdaq has climbed more than 56% from its March 23 low on the back of rallies in the shares of companies including Tesla Inc. TSLA, +1.89%, Apple AAPL, +1.74%, Microsoft MSFT, +2.48%, Amazon.com, Netflix and Google parent Alphabet GOOGL, +1.82% GOOG, +1.97%. The S&P 500 index and the Dow Jones Industrial Average DJIA, +0.56% have both risen by at least 45% . â\u0080\u009cWe want a stable dollar,â\u0080\u009d Mnuchin says. â\u0080\u009cThe dollar reflects lots of money coming back into the United Statesâ\u0080¦Â it is the reserve currency of the world and weâ\u0080\u0099re going to protect that,â\u0080\u009d he said. The dollar has declined by more than 5% against a basket of six major currencies over the past three months, as measured by the U.S. ICE Dollar Index DXY, -0.58%, which is heavily weighted against the euro EURUSD, +0.60%. Mnuchinâ\u0080\u0099s comments come as Senate Republicans reached a deal with the White House to provide additional fiscal for individuals and businesses still hurting from the measures to curtail the spread of the pandemic. The Senate Republican proposal for some $1 trillion in funds will serve as a basis for negotiations with Democrats as the $600 weekly unemployment benefit top up assistance expires at the end of the month. Mnuchin told CNBC that the Republican coronavirus relief plan will extend enhanced unemployment insuranceÂ â\u0080\u009cbased on approximately 70% wage replacement.â\u0080\u009d He also said that there would be no payroll tax cut in the Senate Republicanâ\u0080\u0099s proposal. Read: The decline of the U.S. dollar could happen at â\u0080\u0098warp speedâ\u0080\u0099 in the era of coronavirus, warns prominent economist Stephen Roach Also read: The U.S. dollar is getting punched in the mouth, and its outlook amid coronavirus doesnâ\u0080\u0099t look great, some experts say"}]}