{"article": [{"url": "https://www.marketwatch.com/story/last-chance-saloon-for-uk-eu-trade-talks-as-johnson-threatens-to-walk-out-on-deal-2020-09-08", "published": 1599569180.0, "headline": "Last chance saloon for U.K.-EU trade talks, as Johnson threatens to walk out on deal. But is he serious?", "body": "Negotiations between the European Union and the U.K. about their future trade relations enter the last chance saloon on Tuesday, as both sides meet for yet another round of talks one day after U.K. Prime Minister Boris Johnson threatened to walk out if a deal isn’t struck by October 15. - The two sides failed to make any progress over the summer and remain stuck on the question of what type of “level playing field” the U.K. should accept, to reassure Europe it won’t undercut it on matters such as labor or environment regulations. The economically minor problem of fisheries, and who will be able to trawl in British waters, has also proven a serious bone of contention. - The U.K.’s top government lawyer, Jonathan Jones, quit on Tuesday over Johnson’s intention to renege on parts of the “political declaration” the country signed with the EU last year along with a “withdrawal agreement” in the run-up to Brexit. The deal, which has the legal strength of an international treaty, aimed at avoiding that a new border be erected between the U.K.’s Northern Ireland region and the Republic of Ireland. - British industrial lobbies have warned in recent weeks that the U.K. government has failed to take the necessary steps to avoid a massive logistical problem at the border if the two sides failed to clinch a deal. Major disruptions are also expected in industrial supply chains or food imports. - The long-term cost of a no-deal Brexit for the U.K. economy would amount to some 5.7% of the country’s gross domestic product, far higher than the coronavirus impact, which will cut gross domestic product by 2.1%, according to a recent London School of Economics paper. - The pound GBPUSD, +0.83% fell more than 1% against the dollar on Tuesday on fears about no-deal Brexit. The UK currencyis down by nearly 3% since the beginning of the month. Read: U.K. economy ‘quite likely’ headed for more monetary stimulus — Bank of England official The outlook: Europeans are still trying to decipher whether Johnson’s threats are serious or amount to more saber-rattling before the PM agrees on a compromise, as he did last year when signing the withdrawal agreement. But both sides are ramping up their preparations for the worst-case, no-deal Brexit scenario. Meanwhile, Johnson is facing another political crisis within his own camp, more divided than ever between the far-right Brexiteers and the more moderate Tories. Read:Europe is considering new sanctions against Russia after the Navalny poisoning. But will it bite or bark?"}]}