{"article": [{"url": "https://www.marketwatch.com/story/boomers-are-doing-retirement-their-own-way-11596471198", "published": 1596457280.0, "headline": "Boomers are doing retirement their own way", "body": "Ronald Grant Archive / Mary Evans Tie it up in a bow. In the new book, “What Retirees Want: A Holistic View of Life’s Third Age,” authors Ken Dychtwald and Robert Morison swing for the fences with a sweeping review of the conception and perception of retirement and pinpoints what lies ahead. The premise: Boomers are redefining retirement. Those of you who are hip to Dychtwald, founder and chief executive of Age Wave, a consulting and research company, will appreciate, as always, his deep research, statistics, and analysis. There’s commentary and insights from leading aging and work experts. Full disclosure: I was interviewed for the book. “What Retirees Want” is grounded on surveys of over 100,000 boomers. The authors round the bases tagging critical facets of retirement—family, financial security, health, housing, leisure, philanthropy, work, and yes, happiness. And, of course, they address the insidious culture of ageism that older adults typically confront on a daily basis. In one chapter, for example, the authors show how marketers routinely misjudge or parody retirees and other older Americans and discuss how they could remedy this problem. “Ageism continues to blind marketers and prevent them from seeing the growth potential of the retiree market,” they write. Longer and, hopefully, healthier lives, have and will continue to transform our last decades in myriad ways. While each of us have a unique set of circumstances, Dychtwald and Morison are realistically optimistic about what lies ahead. “The boomers have famously—or infamously—reshaped every stage of life they’ve inhabited,” they write. “Their early years caused a market boom in baby products. Their teenage years gave rise to the hippie movement. They activated sexual and gender revolutions. They reshaped the workforce with unprecedented numbers of women.” Their reasoning continues: “Interested from the start in discovering themselves and finding purpose, they grew up with major causes—civil rights, women’s rights, gay rights, opposition to war—and defining events—the assassinations of two Kennedys and Dr. Martin Luther King, the rebellious freedom of Woodstock, and the wonder of the moon landing.” Little wonder then that boomers want their retirement to be “more interesting, active, passion-filled, and exciting…. the story of youth’s excitement was baked into them,” they write. “And now they really don’t want to become “old” people, certainly not by conventional definition.” While the book is a sweeping tutorial on the shifting sands of retirement, the overriding message that I was left with is one of possibilities for retirees. “Compared with previous generations of older adults, they are better educated, more high-spirited, more willing to experiment, more willing to change things,” they write. “Throughout their lives, boomers have had an ambitious appetite for breaking rules of all sorts and experimenting with a diverse range of lifestyles. We are convinced that these proclivities will be central to their retirements.” I was pleased to see the special nod to boomer women, a cohort that includes me. “It’s also critical to note that boomer women are more educated, skilled, ambitious, and confident than any previous generation of women,” they write. “They were the first generation to step out of the homemaker pattern, where the husband worked and eventually retired, and the wife managed the home and family. Instead, they pursued higher education and careers and were also willing to leave unsatisfying marriages. Boomer women’s experience in decision making and financial matters will most likely serve them well in retirement, because on average the married will outlive their husbands.” The authors are clear, however, that one-size does not fit all. There are “Ageless Explorers, who see retirement as a time of opportunity, adventure, exploration, and personal reinvention,” they write. And then there are the “Comfortably Contents,” who “approach retirement with a more traditional, less driven view that retirement is a reward for a life of conscientious work,” they write. “They tend to be well-educated and their work provided a good income. They are less likely to work in retirement. Their focus is on recreation, fun, and relaxation.” Next, the “Live for Todays” who “seek continued personal growth and want to keep reinventing themselves. They have the biggest list of things they’d like to do and would ideally like their retirement to be an extension of their free-spirited lives,” according to the authors. Finally, there are the ”Worried Strugglers,” who “have fewer financial resources and fewer hopes and dreams for what they’d like to do. They report being more worried, less active, less healthy, and less happy. Financially, they have done relatively little planning and preparation,” the authors write. Retirement is far from stepping back for many retirees in this new third age. “Increasingly, today’s retirees are exploring, not retreating,” they note. “More and more have renewed purpose and new, often higher ambitions in retirement.” One perfect example: the authors interview one of my go-to experts, Paul Irving, 68, Irving once led a major Los Angeles-based law and consulting firm. After 26 years there, he applied and was accepted as a 2010 fellow at Harvard’s Advanced Leadership Initiative for experienced leaders. “The latest act of his career, in his third age, includes chairing the Milken Institute Center for the Future of Aging,” the authors explain. When they asked Irving to elaborate on why he decided to step off and head back to school he told them: “While I loved my time as a lawyer, I felt that there was something else ahead. It was a sense that I wasn’t done. Part of it was love of learning and challenge.” He credits his year in Cambridge with helping him make that successful transition. “I couldn’t say the specific education was critical,” he once told me. “But it did get people thinking about me in a different way and me thinking about myself in a different way—instead of just being a lawyer.” Boomer retirees aren’t slowing falling off the merry-go-round. “Rather, they want to continue to become better versions of themselves,” they write. “That’s the new story of aging and retirement.” Retiring is a sequence of shifts over time, as Dychtwald, told me when we spoke about this topic last fall. “For most of the changes in our lives there is ritual,” he said. “In high school, when you contemplated college, you visited campuses. There’s counseling. When it comes to retirement, people are basically told ‘good luck, have a good time.’ ‘ I think it’s really a psychological metamorphosis. During this transitional period, some people still feel unsettled, anxious or bored, but eventually they realize that ‘I can be fresh. I can be new.’” Kerry Hannon is a leading expert and strategist on work and jobs, entrepreneurship, personal finance and retirement. Kerry is the author of more than a dozen books, including Great Pajama Jobs: Your Complete Guide to Working From Home, Never Too Old To Get Rich: The Entrepreneurs Guide To Starting a Business Mid-Life, Great Jobs for Everyone 50+, and Money Confidence. Her on Twitter @kerryhannon."}]}