{"article": [{"url": "https://www.marketwatch.com/story/coronavirus-aid-talks-to-continue-friday-in-congress-despite-gulf-between-offers-pelosi-says-11596820629", "published": 1596806720.0, "headline": "Coronavirus aid talks to continue Friday in Congress,  despite gulf between offers, Pelosi says", "body": "WASHINGTON, DC - AUGUST 06: U.S. House Speaker Nancy Pelosi (D-CA) (R) speaks to reporters alongside Senate Minority Leader Chuck Schumer (D-NY) (L) following continued negotiations with Treasury Secretary Steven Mnuchin and White House Chief of Staff Mark Meadows on a new economic relief bill in response to the coronavirus pandemic on Capitol Hill on August 6, 2020 in Washington, DC. (Photo by Samuel Corum/Getty Images) Trump administration and congressional Democratic leaders are set to meet again Friday in a potentially last-ditch effort to keep talks another a trillion dollar-plus package alive to help support an economy struggling to recover from the impact of the coronavirus pandemic. The two sides have said they remain far apart on key issues and the administration negotiators, Treasury Secretary Steven Mnuchin and White House Chief of Staff Mark Meadows, said President Donald Trump could instead take unilateral actions, like executive orders, to provide economic help if a deal can’t be reached. “Again, we’ll be meeting this afternoon,” House Speaker Nancy Pelosi said at Capitol Hill press conference. She said she and Schumer offered Thursday night to come down from the House Democratic bill’s $3.4 trillion price tag by a trillion if Republicans agreed to come up from their proposal’s total, which has been independently estimated at $1.1 trillion. “Yesterday I offered to them we’ll take down a trillion if you add a trillion in. They said ‘absolutely not,'” Pelosi said. In an interview on MSNBC earlier, Pelosi had pointed to money for schools and colleges and money for cash-strapped states as big two sticking points. Senate Republicans, with White House approval, had offered $105 billion to help reopen schools and colleges, slightly above the $100 billion House Democrats had proposed in May. But since then, Pelosi has said more money is needed than was the case in May. Pelosi also said the Mnuchin and Meadows had offered $150 billion in state aid, well below the $915 billion that Democrats sought. Additionally, she said Democrats wanted $67 billion for food assistance and help with water and utility bills while the White House had offered only $250,000 for food assistance."}]}