{"article": [{"url": "https://www.marketwatch.com/story/gold-prices-edge-back-as-markets-assess-trump-coronavirus-news-11601639640", "published": 1601648420.0, "headline": "Gold ends lower as markets assess Trump coronavirus news", "body": "Gold futures ended lower Friday even though President Donald Trump and his wife announced they had contracted the COVID-19 disease and would be quarantining in the White House for days. The unexpected news comes as the race for the U.S. presidency between Trump and former Vice President Joe Biden is heating up. Some strategists speculate that the news forces investors to come to terms with the front-runner status of Democratic challenger Biden, who was already leading in most national polls against Trump. “Gold picked up a bit overnight on the Trump diagnosis news” but turned back downward “as it has become clear that the news has not sparked a panic rush out of equities into defensive havens like gold,” Colin Cieszynski, chief market strategist at SIA Wealth Management, told MarketWatch. Equity markets were down Friday, but the Dow Jones Industrial Index DJIA, +0.56% was trading off the session’s worst levels. On Friday, December gold GCZ20, +2.17% fell $8.70, or nearly 0.5%, to settle at $1,907.60 an ounce on Comex, after gaining 1.1% on Thursday to finish at around a two-week peak. Silver for December delivery SIZ20, +5.96%, meanwhile, lost 23 cents, or 0.9%, to $24.029 an ounce, following a 3.2% rise in the previous session. Read: Silver, copper provide hints for the global economic outlook For the week, gold saw a weekly gain of 2.2%, while silver marked weekly rise of nearly 4.1%, based on the most-active contracts, FactSet data show. Prices for both precious metals had posted declines last month. “The lack of fresh stimulus from the Federal Reserve and political gridlock precluding fiscal aid have been dominant factors behind this gold retracement and associated dollar strength,” said Ryan Giannotto, director of research at GraniteShares, which offers the GraniteShares Gold Trust BAR, +1.88%. Still, “the halt on additional stimulus is not altogether bearish for gold, as stock prices require monetary and fiscal support to a far greater extent than gold,” he told MarketWatch. “Waning economic optimism and a growing second wave of mass layoffs from companies like Disney, American Airlines and others firmly underscore this point and the need for gold as a diversifying asset.” The U.S. presidential election, meanwhile, increases uncertainty and Trump’s COVID-19 diagnosis “emphasizes the realities of risk before us,” he said, adding that gold may be poised for further gains. The rise in prices for the precious metals on the week came as the U.S. dollar has receded somewhat after last week’s rally, providing more room for dollar-based assets to rise. The ICE U.S. Dollar Index DXY, -0.58% has declined 0.9% so far this week but was trading about 0.1% higher in Friday dealings, as gauged by the index which measures the buck’s strength against a half-dozen currencies. A weaker dollar can make asset’s priced in the monetary unit relatively more expensive to overseas buyers. Gold prices fell early Friday in the immediate wake of U.S. employment data that revealed 661,000 new jobs in September, but hiring was the smallest since businesses reopened from lockdowns imposed to combat the pandemic. The precious metal then briefly pared some losses shortly after data showed U.S. factory orders rose 0.7% in August, up for a fourth straight month, but the increase was below the 0.9% rise expected by economists surveyed by MarketWatch. “Employment data underwhelming and below consensus didn’t have much impact on gold,” Jeff Wright, executive vice president of GoldMining Inc., told MarketWatch. The market is looking for signs of progress between Treasury Secretary Steven Mnuchin and House Speaker Nancy Pelosi on another fiscal stimulus bill, he said. It’s “anyone’s guess if there is really a deal to be struck.” The U.S. dollar will provide direction for gold into next week and an agreement on fiscal stimulus would weaken the greenback, he said. Also on Nymex Friday, December copper HGZ20, +1.38% tacked on 3.9% to $2.9775 a pound, tallying a weekly rise of 0.2%. January platinum PLF21, +3.84% lost 1.6% to $891.40 an ounce, with most-active contract prices up 5.9% for the week. December palladium PAZ20, +2.31% fell 0.1% to $2,325 an ounce Friday for a weekly rise of 4.6%."}]}