{"article": [{"url": "https://www.marketwatch.com/story/new-home-sales-surged-in-may-as-buyers-scrambled-to-find-properties-for-purchase-2020-06-23", "published": 1592908400.0, "headline": "New home sales surged in May as buyers scrambled to find properties for purchase", "body": "The numbers: Sales of newly-built single-family houses occurred at a seasonally-adjusted annual rate of 676,000 in May, the government reported Tuesday. That represented a 16.6% increase from the downwardly-revised pace of 580,000 in April. Compared with the previous year, new home sales were up 12.7% in May. Analysts polled by MarketWatch had forecast new-home sales to occur at a seasonally-adjusted annual rate of 650,000 in May. The government uses a small sample size to produce the new-home sales report, which makes it prone to significant revisions, as in the case of April’s figure, which was readjusted to a pace of 580,000 from the originally reported 623,000. What happened: The Northeast experienced the most pronounced increase in sales, with a 45.5% jump, followed by the West (up 29%) and the South (up 15.2%). Sales fell by 6.4% in the Midwest. The median sales price for new homes sold in May was $317,900. At the end of the month, there were 318,000 new homes estimated to be up for sale, which equates to a 5.6-month supply. A 6-month supply of homes is generally considered to be indicative of a balanced market. The big picture: The new home sales figure for May increased, while the figure for existing home sales in May, reported yesterday, was down, in part because the two reports measure sales based on different stages of the home-buying process. The new home sales report captures sales based on when the contract is signed, which is in the early stages of the process. The existing sales report, on the other hand, reflects when sales are closed, which occurs one to two months after signing typically. Therefore, the May existing sales report really reflected what was happening across the country in March and April, while the new home sales report really reflects what went on in May. And last month was characterized by many states reducing restrictions on people’s movement due to the coronavirus pandemic and a consequential improvement in the labor market. Those two factors gave a boost to consumer confidence, which made home-buying seem more feasible to many Americans. Read more:Mortgage rates drop to another record low — here’s why Americans may not want to wait too much longer before locking rates in Although the pent-up demand to purchase a home was unleashed, the supply of previously-owned homes remained quite constrained. That’s partially because home sellers appear to be more apprehensive about the state of the economy than buyers. But even before the pandemic, the nation’s low housing inventory made for slim pickings for buyers. That’s good news for home builders, since they have a captive audience of people looking to buy who are finding few options amid existing homes. And as in April, the coronavirus has shifted buyers’ preferences. More people are looking in the suburbs and rural areas, in search of more space for their families than cities can provide. Builders who adapt to those preferences could see their sales grow notably. What they’re saying: “The jump in new home sales is a nice indicator of what’s to come because it’s based on contract signings, a somewhat early stage of the homebuying process,” said Danielle Hale, chief economist at Realtor.com. “A similar surge in next week’s pending home sales, which cover the much larger existing homes market, will be good confirmation that the low point in home sales is likely behind us.” Market reaction: The Dow Jones Industrial Average DJIA, +0.56% and the S&P 500 SPX, +0.87% both rose in Tuesday morning trading. However, shares of home-building firms PulteGroup PHM, +0.02%, LGI Homes LGIH, +1.59%, and Lennar Corp. LEN, +0.07% outpaced the two indexes due to the upbeat new-home sales report."}]}