{"article": [{"url": "https://www.marketwatch.com/story/coronavirus-update-us-case-tally-climbs-above-42-million-after-a-fifth-straight-day-of-more-than-1000-new-infections-2020-07-27", "published": 1595855900.0, "headline": "Coronavirus update: U.S. case tally climbs above 4.2 million after a fifth straight day of more than 1,000 deaths", "body": "A previous version of this report appeared under a headline stating that the U.S. had recorded 1,000 new COVID-19 cases for five straight days. It has, in fact, seen 1,000 deaths from the disease on each of those five days. The story has been corrected. Getty Images The U.S. case tally for the coronavirus illness COVID-19 rose above 4.2 million on Monday, after a fifth straight day of more than 1,000 deaths from the disease, as states in the South and West continue to struggle to contain the virus’s spread. Dr. Deborah Birx, lead coordinator of the White House task force set up to oversee the pandemic response, said Kentucky and some other states should reimpose shutdowns of bars and limit indoor gatherings. “We do believe that there are states that do need to close their bars, to decrease indoor gatherings to less than 10 and to decrease social gatherings to less than 10 to really make it possible to control the pandemic before it gets worse,” she told reporters at a news conference with Kentucky Gov. Andy Beshear. Birx named Indiana, Ohio, Tennessee and Virginia as states that should reintroduce restrictions on movement and said health officials are worried about the total number of new cases and the percentage testing positive. Florida surpassed New York, the early hot spot in the U.S. outbreak, by case tally over the weekend, as the Associated Press reported. Florida counted 9,344 new cases on Sunday, and 77 deaths, according to the Florida Department of Health. The Sunshine State now has had 423,855 cases, second only to California, which has had 453,659, according to the California Department of Health. New York’s case tally stands at 416,443, according to a New York Times tracker. States in the South and West continue to report rising rates of hospitalizations, taking the tally close to the peak hit on April 15, according to the COVID-19 Tracking Project. There were 58,614 COVID-19 patients in U.S. hospitals on Monday, compared with the April record of 59,940. See:Miami Marlins home opener has been canceled after 14 players and coaches test positive for the coronavirus The World Health Organization, which will meet this week to discuss COVID-19’s emergency status as it is required to do every six months, is expected to stick with that assessment, but may change some of its recommendations as to how the world should respond to the crisis. iframe.twitter-tweet { width: 100% !important; } The agency has only issued a public health emergency of international concern five times since rules were changed in 2007, for swine flu, polio, Zika and for two Ebola outbreaks in Africa. WHO Director-General Tedros Adhanom Ghebreyesus said COVID-19 “is easily the most severe” of those outbreaks. Arthur Laffer, an economist who served on President Ronald Reagan’s Economic Policy Advisory Board, told MSNBC the U.S. needs to step up testing to get the virus under control. “We need to take care of the disease first and foremost. And then prepare for re-entry into prosperity,” Laffer said. The economist added that he’s happy the stock market SPX, +0.87% is doing well but said it does not reflect the many independent small businesses that are suffering and failing. Austan Goolsbee, Robert P. Gwinn Professor of Economics at the University of Chicago’s Booth School of Business, agreed. “If we’d had paid sick leave, we could have prevented this,” he said on the same MSNBC segment, allowing infected people to stay home and not spread disease among co-workers. Tropical Storm Hanna, Hurricane Douglas Threaten Parts of U.S. Latest tallies There are now 16.3 million confirmed cases of COVID-19 worldwide, according to data aggregated by Johns Hopkins University, and at least 648,966 people have died. The data show 9.3 million people have recovered. The U.S. has the highest case tally and death toll, 146,968. Brazil is second to the U.S. with 2.4 million cases and 87,004 deaths. India is third measured by cases at 1.4 million, followed by Russia with 811,073 and South Africa with 445,433. The U.K. has 301,020 cases and 45,837 fatalities, the highest in Europe and third highest in the world. China, where the illness was first reported late last year, has 86,570 cases after adding more than 200 over the weekend, and 4,652 fatalities. See now:This is the biggest mistake people make while wearing a face mask Spain, an early hot spot in Europe, has seen a new cluster of cases and nightclubs, bars and beaches are facing new lockdowns, the AP reported. The northeastern region of Catalonia now hosts two of the most worrying virus hot spots in Spain, prompting authorities to tighten restrictions in Barcelona and a rural area around Lleida that were relaxed only a month ago when Spain had its devastating outbreak in check. See: Walmart, CVS, Lowe’s among the retailers that will start requiring face coverings on Monday U.K. travelers to Spain were alarmed to learn they will be asked to self-quarantine for 14 days when they return home. Norway also ordered a 10-day quarantine for Norwegians visiting the Iberian Peninsula. Vietnam, which had enjoyed a 100-day run without a COVID-19 case, ended that streak on Saturday, the New York Times reported. Officials will evacuate 80,000 people from the city of Danang, after four people there tested positive. What’s the latest medical news? Shares of Moderna Inc. MRNA, +0.09% rallied after the company said it started to dose participants in the Phase 3 trial for its experimental COVID-19 vaccine, MarketWatch’s Jaimy Lee reported. Moderna revealed Sunday that it will receive additional funding of up to $472 million of its vaccine candidate from the Biomedical Advanced Research and Development Authority to help fund the addition of more participants in the late-stage trial. (Moderna previously announced it had been awarded $483 million in federal funding to support clinical development of the vaccine.) The Phase 3 randomized, placebo-controlled trial, which is being conducted with the National Institute of Allergy and Infectious Diseases, is expected to enroll up to 30,000 people, who will receive a 100-microgram dose of the investigational vaccine. The primary endpoint is preventing symptomatic COVID-19 disease, and the secondary endpoints are preventing severe forms of COVID-19 that require hospitalization and preventing contracting the virus altogether. Separately, Emergent BioSolutions Inc. EBS, -0.81% said it will provide contract development manufacturing services for AstraZeneca’s AZN, +1.16% AZN, +0.63% COVID-19 vaccine candidate for $174 million. The companies had previously announced an $87 million manufacturing deal in June. AstraZeneca is developing the experimental vaccine with the University of Oxford; the first round of clinical data was released last week. Emergent, which has announced a number of manufacturing deals with other COVID-19 vaccine developers, said it will share additional financial details about this agreement and others when its second-quarter results are released on Thursday. What are companies saying? The earnings season is facing its busiest week thus far with four of the biggest company by market capitalization — Apple Inc. AAPL, +1.74%, Amazon.com Inc. AMZN, +3.01%, Google parent Alphabet Inc. GOOGL, +1.82% GOOG, +1.97% and Facebook Inc. FB, +0.26% — on the schedule for Thursday after hours. This week will see 184 companies, or about 36% of the S&P 500, report earnings. So far, 128 S&P 500 companies have posted earnings, equal to about 25% of the index. See also:Big Tech’s big test arrives in the busiest week of earnings season So far, the earnings season has seen companies exceed expectations at a decent clip, but the numbers are still grim. The current blended year-over-year growth estimate for earnings per share, which includes results that have already been reported and the average analyst estimates of coming results, is negative 42.4% through Friday, according to FactSet. That includes a 42.8% drop in already reported results. The decline is on track to be the biggest since the fourth quarter of 2008, in the midst of the financial crisis. For more, read:S&P 500 earnings have been as bad as feared, even as the beat rate has improved Google has told its employees that it will extend its work-from-home order until at least July 2021 in the face of the COVID-19 pandemic, according to a report by the Wall Street Journal, making the internet search giant the first to push back its back-to-normal plans that far. T he move will affect nearly all of its roughly 200,000 employees across Google’s parent, Alphabet, the report said. Google had previously told its staff to expect to return to the offices as early as the beginning of January. See also: Congress has a million-plus documents from Big Tech antitrust investigation, and are ready to grill big-name CEOs Here are the latest news stories about companies and COVID-19: • Albertsons Cos. Inc. ACI, +1.71% reported first-quarter earnings that beat expectations in its first earnings release since going public in June. Digital sales soared 276%. Same-store sales grew 26.5%. Albertsons attributed the revenue increase to the same-store-sales increase, but said it was offset by store closures and lower fuel sales. COVID-19-related investments totaled $615 million, including more than $275 million in additional pay for frontline workers. Albertsons did not provide financial guidance due to uncertainty related to the coronavirus pandemic. • American Airlines Group Inc. shares AAL, +0.34% moved higher after Raymond James analyst Savanthi Syth backed away from his bearish stance on the air carrier, citing a more balanced risk-reward scenario following the recent selloff. Syth raise his rating to market perform, after being at underperform since June 5. The stock has plunged 44% from its June 8 recovery peak of $20.31 through Friday, while the U.S. Global Jets ETF JETS, +0.16% has tumbled 27% over the same time. “Our view remains that bankruptcy is not in the cards for American in 2020 with Chapter 11 only a potential avenue if the earnings recovery stalls over multiple years,” Syth wrote in a note to clients. While the risk-reward scenario is more balanced, American’s is “the least appealing” of the U.S. airlines given the “materially higher debt burden,” which could leave American’s balance sheet “crippled for years to come,” he wrote. See now:Durable-goods orders climb 7.3% in June as auto maker surge offsets Boeing weakness • Hasbro Inc. HAS, +1.36% reported adjusted second-quarter earnings and revenue that missed expectations, as the pandemic has led to temporary store closures, product shortages and lower retail inventory. The company swung to a net loss of $33.9 million, or 25 cents a share, from net income of $13.4 million, or 11 cents a share, in the year-ago period. Franchise brands revenue fell 35% to $376.8 million, missing the FactSet consensus of $507.6 million, and partner brands revenue dropped 35% to $138.2 million to miss expectations of $174.2 million, but Hasbro brands revenue rose 11% to $137.0 million to beat expectations of $125.9 million. Within Hasbro brands, consumer point of sales increased in the high-single digits percentage range. Nearly all of its partner factories and warehouses are now open. • Papa John’s International Inc. PZZA, -1.18% will bring on another 10,000 workers due to the COVID-19-related surge in business. The pizza chain recently hired 20,000 new employees. Second-quarter same-store sales through the end of June were up 24.4%. The company has added two partners to its tuition-assistance program: Southern New Hampshire University and the University of Maryland Global Campus. Along with Purdue University Global, these schools offer higher education to Papa John’s workers and their family members at reduced tuition. Additional reporting by Tim Rostan, Tomi Kilgore and Tonya Garcia Read also: Here’s why Netflix stock, now below $500, is going to $1,000"}]}