{"article": [{"url": "https://www.marketwatch.com/story/private-sector-added-237-million-jobs-in-june-adp-says-2020-07-01", "published": 1593599180.0, "headline": "Private sector rehires 2.37 million workers in June, ADP says", "body": "The numbers: Private-sector employers added 2.37 million jobs in June, Automatic Data Processing Inc. reported Wednesday. Economists surveyed by Econoday expected a gain of 3.5 million. What happened: Small employers added 937,000 jobs in June. Midsize companies added 559,000 jobs. And large businesses added 873,000. The services sector experienced a large gain in June, adding 1.9 million jobs. Big picture: The ADP data hasn’t lined up with the government data since the pandemic began in March, though over a longer time frame the two data sets trend in the same direction. For instance, last month ADP reported 2.76 million job losses, while the government reported net gains of 3.1 million jobs. On Wednesday, ADP revised its May decline to show a gain of 3.1 million jobs. Economists surveyed by MarketWatch expect a gain of 3.9 million jobs in June, with the unemployment rate improving, slightly to 13% from 13.3% in May. There is some concern that June could be a high-water mark as many states were slowing down activity late in the month due to a resurgence in coronavirus cases. Overall, economists are struggling to understand trends in the job market. Suffice to say it remains weak. Even if there is a gain of 4 million payroll jobs in June, the level of employment will be over 16.5 million below its recent peak. Low-paying service sector jobs were decimated by the pandemic. What ADP says: “As the economy slowly continues to recover, we are seeing a significant rebound in industries that once experienced the greatest job losses,” including leisure, hospitality, trade and construction industries, said Ahu Yildirmaz, co-head of the ADP Research Institute. What private economists said: “Overall, a gain in private and total payrolls in June will be welcome news and will extend the gains in May. Even so, the unemployment rate will likely remain high, signaling that conditions in the labor market remain weak with a renewed threat to activity and jobs from a resurgence in virus infections,” said Rubeela Farooqi, chief U.S. economist at High Frequency Economics. Market reaction: There was not much market reaction to the data. U.S. equity benchmarks were set to open lower on Wednesday, the start of the third quarter. Stocks performed well in the April-June quarter with the S&P 500 index SPX, +0.87% up nearly 20%."}]}