{"article": [{"url": "https://www.marketwatch.com/story/treasury-yields-steady-ahead-of-powell-testimony-debt-supply-11600778864", "published": 1600793420.0, "headline": "10-year Treasury yield falls to 2Â½-week low", "body": "U.S. Treasury yields fell slightly Tuesday as traders watched the path of COVID-19 in Europe and parsed testimony from Federal Reserve Chairman Jerome Powell.How did Treasurys perform? The 10-year Treasury note yield TMUBMUSD10Y, 0.777% fell 0.7 basis point to 0.663%, its lowest since Sept. 3. The 2-year note rate TMUBMUSD02Y, 0.156% was virtually unchanged at 0.133%, while the 30-year bond yield TMUBMUSD30Y, 1.576% slid 1.3 basis points to 1.413%. Bond prices move inversely to yields.What drove the market? Markets continued to monitor the state of COVID-19 in Europe amid signs that the trajectory of the disease was picking up in Spain, France and the United Kingdom. It remains unclear if policy makers broadly are willing to put in place similar restrictions as those in March at the risk of stalling a fragile economic rebound but the U.K. has implemented some restrictions on bars and restaurants and encouraged those who could to work from home. Coronavirus update: U.S. death toll passes 200,000, as new cases rose by more than 50,000 in a day Meanwhile, Federal Reserve Chairman Jerome Powell testified before the House Financial Services Committee on Tuesday. He said it was important for Congress to deliver more aid to the economy through another round of fiscal stimulus. Read: Fedâ\u0080\u0099s Powell tells Congress itâ\u0080\u0099s up to them to provide aid to some troubled companies Investors also handled some U.S. economic data. Existing home sales increased for the third consecutive month in August, rising 2.4% from July to a seasonally adjusted, annual rate of 6 million. The Treasury Department auctioned off $52 billion of 2-year notes in the afternoon. Market participants managed to take down the sale without much indigestion, a reflection that investors have accepted the Fedâ\u0080\u0099s commitment to keep rates low for the next few years.What did market participantsâ\u0080\u0099 say? â\u0080\u009cThe bond market seems to still be committed to its skepticism about a number of things, except inflation and the Fedâ\u0080\u0099s desire to keep rates low. It does seem to still be concerned about the election, the economy, the virus, the potential for a stimulus package, and the growing fear of a second wave of COVID-19,â\u0080\u009d said Kevin Giddis, chief fixed-income strategist at Raymond James. â\u0080\u009c"}]}