{"article": [{"url": "https://www.marketwatch.com/story/race-for-a-covid-19-vaccine-has-drug-makers-scaling-up-manufacturing-before-one-is-developed-2020-06-25", "published": 1593440060.0, "headline": "Race for a COVID-19 vaccine has drug makers scaling up manufacturing - before one is developed", "body": "Inovio Pharmaceuticals Inc., which has yet to share results from the Phase 1 trial for its COVID-19 vaccine candidate, has already received millions of dollars in funding to scale up manufacturing capacity. An announcement Tuesday that the Department of Defense would pay $71 million to fund manufacturing of a device used to administer the Inovio INO, -1.36%  vaccine sent the company's stock soaring, to close at a record $21.57. Inovio is expected to release Phase 1 data in the next week. \"The pandemic response is different,\" said Joseph Kim, CEO of Inovio Pharmaceuticals Inc., which has said it plans to have a millions of doses of its vaccine candidate by the end of this year. \"We're doing all these things in parallel.\" Read:Why virus stocks are driving market volatility In many ways, the COVID-19 pandemic has upended the traditional drug development process, and now health officials and drugmakers are trying to hasten the time it takes to find a working vaccine, in part by moving forward with manufacturing plans even before the vaccine candidates prove their safety or efficacy. Making this kind of change is what enables government officials like Dr. Anthony Fauci, director of the National Institute of Allergy and Infectious Diseases, to say repeatedly that it's possible to have a viable COVID-19 vaccine within a year of the coronavirus first coming to the attention of the U.S. government. Trump administration officials have said they aim to have a vaccine by January as part of Operation Warp Speed. \"Although you can never guarantee at all the safety and efficacy of a vaccine until you actually test it in the field, we feel cautiously optimistic based on the concerted effort and the fact that we are taking financial risks,\" Fauci testified during a Committee on Energy and Commerce hearing on Tuesday, \"not risks to safety, not risk to the integrity of the science, but financial risks to be able to be ahead of the game.\" A COVID-19 vaccine would change the trajectory of the pandemic, which has sickened more than nine million people and killed nearly 500,000, allowing economies to fully reopen and people to return to work and school. This may be why government officials have said again and again that a year-long timeline to develop a working vaccine is possible. \"I think we're going to have it very soon,\" President Donald Trump said Wednesday at a news conference. But even PhRMA, the pharmaceutical industry's largest lobbying group, says vaccine development takes 10 years, and the chief executives of Novartis NVS, +0.97% and Johnson & Johnson JNJ, +1.39%  have said developing a COVID-19 vaccine will take longer than 12 months. At the same time, several companies developing COVID-19 vaccines have pledged millions and sometimes billions of doses of vaccines that have yet to prove their efficacy. This type of guarantee has worried some in the medical community. \"It's the timeline that's been promised,\" said Bunny Ellerin, director of the health care and pharmaceutical management program at Columbia Business School. \"Expectations have been set with the public now.\" \"There are immense public and political pressures to develop a new vaccine, a process that typically takes years, not months,\" three medical experts at NYU Langone Health wrote in an op-ed in JAMA last month. \"Proceeding stepwise through the phases of clinical trials is the ethical standard for investigations involving human research participants.\" See also: Hope dims for hydroxychloroquine even as medical study detailing the drug's failure is retracted Yet some officials and pharmaceutical executives have said that by building out manufacturing capacity before clinical trials have concluded may mean that it's possible to more quickly secure and dispense a working vaccine, as well as supply larger clinical trials that will need to have thousands of participants down the line. According to the World Health Organization, there are 16 vaccine candidates in clinical trials across the globe, four of which are being tested in the U.S. Those are Moderna Inc.'s MRNA, +0.09%  mRNA-1273, Inovio's INO-4800, Novavax Inc.'s NVAX, +0.18% NVXâ\u0080\u0091CoV2373, and BioNTech BNTX, +1.23%  and Pfizer Inc.'s PFE, -0.27%  BNT162. At least half a dozen other companies including Johnson & Johnson, ImmunityBio Inc. and NantKwest Inc. NK, +5.81%, and Sanofi SNY, +0.89%  plan to test their investigational vaccines in the U.S. if the candidates move past the preclinical stage. A lot of the development activity is being done in parallel, with clinical trial phases overlapping with manufacturing plans, according to Clement Lewin, the head of Sanofi's Biomedical Advanced Research and Development Authority (BARDA) office. \"A vaccine is going to be required to get back to normal,\" he said. \"It makes sense to invest at risk.\" Some relatively unknown companies that help manufacture pharmaceutical products have emerged as pandemic stock darlings. Emergent BioSolutions Inc. EBS, -0.81%, which has said it's doing vaccine manufacturing work for AstraZeneca AZN, +0.63%, J&J, Novavax, and Vaxart Inc. VXRT, +0.97%, has seen shares jump 36% this year. It has also already signed a $628 million agreement with U.S. health officials to produce COVID-19 vaccine candidates through 2021. Shares of Lonza Group LONN, +0.75%, Moderna's manufacturing partner for its COVID-19 vaccine candidate, have soared 43% year-to-date. \"People, companies are starting to plan to make doses even before, you know, the vaccine works,\" Fauci said Tuesday during the House hearing. \"So the risk of the speed is not risk to safety. It's not risk to scientific integrity. It's risk to money.\" See also: What we do know - and don't know - about the coronavirus at day 100 of the pandemic Still, all of this doesn't guarantee that these vaccines will work. The race to develop any vaccine is an uphill battle: it's notoriously difficult (\"The safety bar is much higher\" for vaccines because they are administered to healthy people, said Mizuho Securities biotech analyst Difei Yang), has traditionally taken years, and once-promising candidates can fail to be safe or efficacious in clinical trials. It took researchers a year and a half to develop a Zika vaccine, four years for a mumps vaccine, more than five years for an Ebola vaccine, and 10 years for a flu vaccine. Vaccines for HIV, herpes and hepatitis C have failed, some in Phase 3 trials. And, in some cases, experimental vaccines for SARS and dengue fever have triggered an enhanced version of the disease in people who have been vaccinated. That said, Bernstein analysts are bullish on the probability that this virus will be amenable to a vaccine. Their rationale? This coronavirus hasn't mutated much, convalescent serum indicates that some patients develop immunity, and we haven't seen significant spikes of re-infections. \"While we're optimistic in the eventual development of SARS-CoV-2 vaccines, we would not expect the initial crop of vaccines to be silver bullets that solve the pandemic,\" they wrote in a June 5 note to investors."}]}