{"article": [{"url": "https://www.marketwatch.com/story/profit-up-87-at-buffetts-berkshire-but-coronavirus-slows-businesses-2020-08-08", "published": 1596907100.0, "headline": "Profit up 87% at Buffett's Berkshire, but coronavirus slows businesses", "body": "Warren Buffett's company reported an 87% jump in its second-quarter profit as the paper value of its investment portfolio increased with the stock market, but it took a roughly $10 billion write down on the value of its aircraft parts manufacturing business because of the economic impact of the coronavirus pandemic. Berkshire Hathaway Inc. US:BRK  US:BRK  said Saturday that it earned $26.3 billion, or $16,314 per Class A share, during the second quarter. That's up from $14.1 billion, or $8,608 per share, a year ago. Berkshire said it cut the value of its Precision Castparts unit because of how much the pandemic has hurt air travel and businesses that support that airline industry. Precision Castparts cut about 10,000 jobs, or about 30% of its workforce, during the first half of the year as it responded to the reduced demand. Buffett has long said Berkshire's operating earnings offer a better view of quarterly performance because they exclude investments and derivatives, which can vary widely. By that measure, Berkshire's operating earnings declined 10% to $5.5 billion, or $3,420.48 per Class A share, as most of its businesses were hurt by restrictions related to the coronavirus pandemic. That's down from $6.1 billion, or $3,754.83 per share. The analysts surveyed by FactSet expected operating earnings per Class A share of $3,182.06. The pandemic's impact on Berkshire's businesses was significant, but Edward Jones analyst Jim Shanahan said it may not have been as bad as expected, partly because Geico insurance and BNSF railroad performed well during the quarter. Like all auto insurers, Geico benefited from lower claims because there were fewer accidents as people drove less with many people working from home. It reported a $2.1 billion underwriting profit in the quarter, up from $393 million a year ago. Also, a $2.5 billion in premium reductions Geico is offering customers because of the lower claims will be spread over the coming year as people renew policies instead of taking effect all in the second quarter when most other insurers sent refunds. BNSF's profit declined 15% to $1.1 billion during the quarter as the number of shipments it handled fell 18%. But the railroad was able to cut its operating expenses 26% to help offset the lower volume. Shanahan said BNSF performed better than most other major railroads. Berkshire was holding nearly $147 billion cash and short-term investments at the end of the second quarter, but Buffett did use $5.1 billion during the quarter to repurchase Berkshire shares, which is the biggest buyback since Berkshire relaxed its policy on repurchases in 2018. Buffett also found a way to use more of that cash after the quarter ended. First, he agreed to buy Dominion Energy's natural gas pipeline and storage business for $4 billion and take on $5.7 billion of Dominion debt. Then Buffett's company bought roughly $2.1 billion worth of Bank of America stock in late July and early August to give it control of 11.9% of the bank's stock. Berkshire Hathaway Inc. owns more than 90 companies, including the railroad and insurance, utility, furniture and jewelry businesses. The company also has major investments in such companies as Apple US:AAPL  , American Express US:AXP  , Coca-Cola US:KO  and Bank of America US:BAC "}]}