{"article": [{"url": "https://www.marketwatch.com/story/targets-holiday-toy-list-includes-barbie-nerf-and-an-exclusive-fao-schwarz-partnership-11602154983", "published": 1602141080.0, "headline": "Targetâ\u0080\u0099s holiday toy list includes Barbie, Nerf and an exclusive FAO Schwarz partnership", "body": "Target has exclusive toys from a number of brands this holiday season Getty Images Target Corp. has unveiled its Bullseyeâ\u0080\u0099s Top Toys of 2020, which includes big names like Barbie, Nerf and Lego. With retailers getting an earlier jump on the holiday shopping season than usual, Targetâ\u0080\u0099s TGT, +1.14% list follows others from Walmart Corp. WMT, +1.00%, Amazon.com Inc. AMZN, +3.01% and additional competitors. See: Here is Walmartâ\u0080\u0099s list of the hottest toys for the holidays The Barbie Dream House makes an appearance on Targetâ\u0080\u0099s list, with the Mattel Inc. MAT, -0.87% toy icon expected to be a bestseller this year. Nerf is also on the list with a toy based on the popular online game Fortnite. Nerf is a Hasbro Inc. HAS, +1.36% brand. And Target has partnered with Lego for a number of exclusive play sets, including Lego Star Wars Resistance I-TS Transport, Lego Friends Alpaca Mountain Jungle Rescue and Lego Harry Potter Attack on the Burrow. Read: Barbie could be queen of the holiday season with analysts upbeat about Mattel and Hasbro Target also has an exclusive partnership with FAO Schwarz that will launch later this month and include a collection of 70 toys, such as a Giant Piano Dance Mat. Items will be available in Target stores, online and at the FAO Schwarz location in New York City. Many of the items will be priced below $20. The New York City FAO Schwarz store will also carry 300 items from Targetâ\u0080\u0099s private labels, including Cat & Jack and Pillowfort. Target also announced an expanded partnership with Levi Strauss & Co. LEVI, -2.24% this week, with the retailer adding Leviâ\u0080\u0099s Red Tab items to 500 store locations by next fall, up from 140 stores. Levi Strauss stock soared after the denim company announced a surprise profit after hours on Tuesday. Shares continued upward, rising 5.6% on Wednesday. â\u0080\u009cOn the expansion front, the success of our partnership with Target is one of the important opportunities before us,â\u0080\u009d said Chip Bergh, Leviâ\u0080\u0099s chief executive, on the earnings call, according to FactSet. See: Disney launching â\u0080\u0098Mando Mondaysâ\u0080\u0099 for â\u0080\u0098Mandalorianâ\u0080\u0099 products as second season airs â\u0080\u009cParticularly encouraging is that in the doors open to date, weâ\u0080\u0099re seeing new consumers discovering our brand without cannibalizing our business with other wholesale accounts.â\u0080\u009d Raymond James analysts also applaud the expanded partnership. â\u0080\u009cWe believe it is increasingly apparent that Target has become one of the most attractive retail distribution points for good and better product of national brands,â\u0080\u009d Raymond Jamesâ\u0080\u0099 Matthew McClintock wrote. Raymond James rates Target stock strong buy. Target shares have rallied 25.3% for the year to date through Wednesday, while the S&P 500 index SPX, +0.87% has gained 5.8% for the period."}]}