{"article": [{"url": "https://www.marketwatch.com/story/i-am-beyond-hurt-i-took-care-of-my-mother-for-12-years-she-wants-my-sister-to-take-over-and-does-want-to-leave-me-her-house-2020-10-08", "published": 1602157580.0, "headline": "'I'm beyond hurt': I took care of my mom for 12 years. She wants my sister to take over and won't leave me her house", "body": "Dear Moneyist, I love my mother very much. I have been living with my elderly mom for the past 12 to 13 years, taking her to doctor's appointments and shopping for her. Over the last six to eight years she has been suffering with heart and breathing issues, so the care has been much more involved and serious. I also helped when my father was ill with cancer. My sister lived out of town and could not help with my dad or my disabled brother for all of these years. She visits once a month or so. My mom mentioned to my sister that she would like for me to have her house, but my sister thought it was not fair. The Moneyist:My wife had a baby in June. She has $160,000 in student loans - and just asked for my 'blessing' to work part time Our disabled brother receives Social Security. My sister said it would leave her and my brother nothing; however, my mom does have other money. I am beyond hurt. Mom said she would work something out for me. I know her and I know she will not follow through. I am just left waiting. I just know she won't take the initiative. Plus, she does whatever my sister and brother-in-law tell her to do. My sister and I share power of attorney. I took a lower-paying job close to home that has allowed me time off so I can be there for my mother. Also, over these last 12 years I have taken very little time off from caregiving because my mother doesn't want to \"bother\" my sister. I am 60 years of age and worried about my future. Perhaps it is time to move out and let my sister take over. This was not even my idea. It was my mother's idea. I love my mother very much, and it truly is not about the house or money. It's been a privilege to help her after losing my dad. GG The Moneyist: 'We bet on the wrong horse': I co-signed my nephew's $55K student loan: He has no degree and no job. What should we do? Dear GG, You are one of an invisible army of caregivers. You love your mother and your last line is, perhaps, the most important and moving of all. It has been a privilege to take care of your mother. In years to come, you will know that you had that time together, and I hope you will look back and see it as priceless. It has clearly been a challenge - especially without additional support from your siblings. You have sacrificed a lot, and you have given a lot. Those scales may never balance, and the time has come for you to make peace with that. I understand why you feel that devoting 12 years to your mother's care might lead her to leave you her home, but that is her decision to make - and, while it may not seem fair to you now or later, it's ultimately out of your control. You could suggest to your mother that she leave you a life estate where you remain in the house for the rest of your life, and then the house goes to your brother and sister, or your sister's children. That seems like a more equitable compromise to me. The Moneyist:'I feel very bitter': My late father gave my sister power of attorney. She kept $100K of his savings. Should I pursue legal action? Your story is familiar to millions of women. For the most part, this work is unseen. More than 25 million women in the U.S. - almost one in seven - provide care to family members or friends with the cost of that work estimated at $470 billion, according to the National Partnership for Women and Families, a nonprofit based in Washington, D.C. \"The average family caregiver is a 49-year-old woman caring for her mother. She typically works full-time as well as providing caregiving support,\" it says. \"The nation is approaching a tipping point: as the population ages and people live longer, the need for caregiving will increase,\" the organization says. \"Additionally, caregiving responsibilities are intensifying; family caregivers are increasingly performing complex medical/nursing tasks traditionally provided by health professionals in a hospital setting. ... Too often, family caregivers are faced with impossible choices because paid time off to provide care is far too rare.\" This can take a toll - not only on your career and finances, but also your own physical and mental health. Family caregivers are more likely to suffer from depression and anxiety, and forego social and romantic relationships in order to take care of their aging parents. And, yes, it can also lead to fractured family relationships where one person, often the single adult child, stays home to take care of their mother or father and feels like they've shouldered all the work. The Moneyist: My mom gave $250K to my aunt to buy a home. My aunt has a mild intellectual disability and I'm afraid someone will take advantage of her I also see why you are hurt. You have given so much of your life to your mother's care and it has given you a sense of purpose outside of your own job. For your mother to suggest your sister take over from here feels like a rejection and, on top of that, it seems easier for your sister to take over now, assuming your mother has fewer than 12 years left. Also, there may be an underlying worry that your sister will persuade your mother to take over the managing of her estate and inheritance. Hold a family meeting and make a plan for the years ahead that hopefully helps everyone involved. Trying to resolve these kinds of matters over phone or email or text message is less than ideal and can also leave perilous room open for misunderstanding, and more hurt feelings and resentments. Ultimately, your mother has given you a gift by suggesting her other daughter take over from here. If your sister is willing, embrace your mother and that opportunity she has given you. You can email The Moneyist with any financial and ethical questions at qfottrell@marketwatch.com. Want to read more?Follow Quentin Fottrell on Twitterand read more of his columns here. Hello there, MarketWatchers. Check out the Moneyist private Facebook FB, +0.26%  group where we look for answers to life's thorniest money issues. Readers write in to me with all sorts of dilemmas. Post your questions, tell me what you want to know more about, or weigh in on the latest Moneyist columns."}]}