{"article": [{"url": "https://www.marketwatch.com/story/amc-agrees-with-universal-to-shrink-theatrical-window-to-17-days-2020-07-28", "published": 1595967440.0, "headline": "AMC agrees with Universal to shrink theatrical window to 17 days", "body": "NEW YORK — In a sign of how the pandemic is remaking Hollywood traditions, AMC Theatres and Universal Studios on Tuesday announced an agreement to shorten the exclusive theatrical window to just 17 days for the studio’s films. The standard window of theatrical exclusivity typically runs about 90 days. Up until now, the largest chains have steadfastly refused to screen films that don’t give releases a lengthy and exclusive run in theaters before moving onto video-on-demand or streaming services. Studios, meanwhile, have increasingly sought to deliver new movies more quickly into the home. The new deal covers Universal films — which include the “Fast & Furious” franchise, “Jurassic Park” movies and the “Despicable Me” series — in the U.S. over the next three years. After a run of at least three weekends, Universal (and its specialty label, Focus Features) will have the option of steering a film to premium on-demand, including AMC’s own service. The shortened window only applies to premium video-on-demand — which often means digital rentals of $20 — not standard on-demand or other home platforms. The deal has potentially profound ramifications for an industry reeling from the coronavirus pandemic. It’s all but certain to lead other studios to press for similar terms from AMC and other exhibitors. Netflix, which hasn’t been able to previously agree with major chains over briefer runs for its premier releases, could now find deals more palatable. If widely embraced, a three-week window would also put further pressure on independent theaters which tend to rely on longer runs for films. Adam Aron, chief executive of AMC Entertainment AMC, -2.17% , called it “a historic, industry-changing agreement.” The deal repairs a rift between AMC, the world’s largest theater chain, and Universal, which is owned by Comcast Corp. CMCSA, -0.99% . In April, with theaters shuttered nationwide, Universal released the animated sequel “Trolls World Tour” by video on demand. NBCUniversal CEO Jeff Shell then trumpeted the digital release as a success and said the studio would, even once theaters reopened, “release movies on both formats.” That infuriated theater owners. Aron said the company would no longer play Universal releases and claimed he would do the same for any distributor that “unilaterally abandons current windowing practices absent good faith negotiations between us.” Terms of the deal weren’t disclosed, but AMC will get a share of the premium video-on-demand revenue. “The theatrical experience continues to be the cornerstone of our business,” said Donna Langley, chairman of Universal Filmed Entertainment Group. “The partnership we’ve forged with AMC is driven by our collective desire to ensure a thriving future for the film distribution ecosystem and to meet consumer demand with flexibility and optionality.” Defending the impact at the box office, Aron said that the first three weeks of ticket sales is when “a considerable majority of a movie’s theatrical box office revenue typically is generated.” The largest chains have been closed in the U.S. for more than four months, threatening their solvency. Exhibitors, including AMC, are currently planning on a large-scale reopening by late August, with Warner Bros.’ “Tenet” prepared to usher moviegoers back over the Labor Day weekend, after debuting a week earlier overseas. Universal has opted to postpone its largest upcoming films — including “F9” and “Minions” — into next year. The studio sent “The King of Staten Island” directly to homes. Its next scheduled release expected in theaters is “Candyman” on Oct. 16. The National Association of Theater Owners, the trade organization that represents the country’s theaters, declined to comment on the new deal."}]}