{"article": [{"url": "https://www.marketwatch.com/story/covid-19-has-revealed-this-trait-in-retired-americans-2020-08-11", "published": 1597145720.0, "headline": "COVID-19 has revealed this trait in retired Americans", "body": "Driven by social, health and demographic shifts and accelerated by COVID-19, the future of retirement is now taking into account a more holistic approach to well-being that goes beyond financial independence. Amid the painful truth that older individuals are more vulnerable to COVID-19’s health impact, a new research study from Edward Jones and Age Wave that coincided with the pandemic unveiled older generations’ resilience during these uncertain times and how they’re redefining retirement. Simply put, retirement means far more than the end of work. A majority of U.S. retirees feel they have embarked on a whole new chapter in life, one filled with new choices, freedoms and challenges. Finances matter in retirement, but so does maintaining one’s health, spending time with family and having a larger purpose. 80% of older Americans can't afford to retire - COVID-19 isn't helping Retirement today is a holistic process, which means it includes, but goes beyond the question of: Will there be enough money left to pay the bills? Read: Are you ready for your second act? How would you feel if nothing changed for five years?Mental health matters The ripple effect generated by the pandemic has brought many issues into sharp relief as people of all ages have had to wrestle with a series of challenges — including mental health. Despite COVID-19’s grave health risk, older adults in the U.S. are coping far better than younger ones during the pandemic. According to the study, 37% of respondents from Gen Z and 27% of millennials, and 25% of members of Generation X have suffered mental declines during the pandemic compared with only 15% of baby boomers and 8% of the silent generation. Older Americans recognize the value of a long-term view, and their life experiences have fostered the strength and confidence to see that we can weather the current storm, rather than submit to the constant barrage of negative headlines. Read: Health care will cost you this much in retirement — and probably even moreDisruption of financial security for retirees and those in peak savings years Based on survey responses and Census Bureau population estimates, nearly 68 million Americans say the pandemic has altered their retirement timing, and 20 million stopped making retirement savings contributions. While this is understandable, as many people have lost their jobs and others may fear they could be laid off, the skipped payments remains a concern. If we know anything about retirement savings it is that making steady contributions is critical to reaching your goal — regardless of amount. Read: Yes, you may still be able to retire one day Those already in retirement have felt the impact in other ways. According to calculations from survey findings and Census Bureau population estimates, about 24 million Americans have provided financial support to adult children during the pandemic. That generosity is admirable, but may also be worrisome. More than 70% of U.S. retirees said they are willing to offer financial support to family members even if it jeopardizes their own financial future. The behavior demonstrates clearly that many of the elements of retirement — in this case, family and finances — often overlap. People want to help their families, but they also don’t want to be a burden. If the pandemic has had a silver lining, it is this: families have drawn closer together, even though they have been forced apart physically. Some have used the time to have difficult, but important conversations around topics like planning and saving for unexpected disruptions. That said, almost half of Americans (45%) said they have yet to engage in an even more difficult conversation: the one about end of life preferences. Read: Boomers are doing retirement their own way Finances and health also blend together. Respondents said their top worry is not a recession but the cost of health care and long-term care. People approaching retirement share that concern. More than two-thirds of those who plan to stop working in the next 10 years said they did not know how they would pay for those two key expenses. Although Americans work hard to provide for their families and invest in their future, many do not have adequate protection if something unexpected occurs. Life’s goals, dreams and aspirations can be put at risk without warning, so an important component of a financial strategy is preparing for the unexpected. Read: How much more will you get if you delay Social Security until age 70?A holistic approach Given all the stresses the pandemic has triggered, financial professionals can help ensure you’re on track to achieve both your short- and long-term goals. Those conversations will be useful to those already retired as well as those saving for it. Some of the questions on the table might be: How can I make up ground for the retirement payments I missed during the pandemic? How can I help my children without straining my own finances? And is it too soon to start thinking and saving for long-term care? But as the research makes clear, the discussions should go beyond just dollars and cents. Retirement is a multifaceted process. Having enough to enjoy retirement is paramount, but family, purpose and health matter as well. Separating them into distinct buckets doesn’t make sense because they are all integral to getting you to that ideal retirement, where you have the security and freedom to live life the way you want. Retirement isn’t a stopping point. It is the next step in the journey, however you define it. Note: All data is from a new study by Edward Jones and Age Wave, a research firm specializing in understanding the effects of an aging population on the marketplace, the workplace and our lives, called “The Four Pillars of the New Retirement,” which was released in August of this year. Ken Cella is a principal in the client strategies group at Edward Jones."}]}