{"article": [{"url": "https://www.marketwatch.com/story/heres-how-uk-fund-managers-are-investing-based-on-where-they-think-inflation-will-go-2020-06-16", "published": 1592297360.0, "headline": "Hereâ\u0080\u0099s how U.K. fund managers are investing, based on where they think inflation will go", "body": "Inflation or deflation, what will it be? Both the U.K. and the U.S. have registered the lowest levels of inflation since 2016 and 2015 respectively. But fund managers are split on whether this will continue or whether government stimulus can lead to higher inflation in the long term. The Association of Investment Companies spoke to several U.K. fund managers to find out how they are investing their money in the current climate. Hereâ\u0080\u0099s what they had to say. Charles Luke, manager of Murray Income Trust:â\u0080\u009cHigher Inflation unlikelyâ\u0080\u009dLuke believes the pandemic will impact the U.K. and global economy in myriad areas, but higher inflation is unlikely and he sees the risk as more of a disinflationary threat. â\u0080\u009cAny pockets of price pressures that may have built up from supply constraints will be more than offset by weak demand,â\u0080\u009d he says. â\u0080\u009cFiscal and monetary policy stimulus should help cap some of these disinflationary forces, but are unlikely to fuel inflationary pressures over the next two years.â\u0080\u009d The Murray Income Trust MUT, +0.65% Â isnâ\u0080\u0099t invested based on top-down themes, Luke says, adding: â\u0080\u009cHowever, on the basis of our assessment of fundamentals, the portfolio has limited exposure to banks which would tend to benefit from an environment of higher interest rates and a more meaningful exposure to pharmaceuticals and consumer goods companies, such as AstraZeneca AZN, +0.63% Â and Diageo DEO, +0.26%, Â which should benefit from a relatively low inflation environment.â\u0080\u009d Read:Consumer prices drop again as pandemic cuts rate of inflation to near zero Peter Spiller, manager of Capital Gearing Trust: â\u0080\u009cAny demand shock is in the short term deflationaryâ\u0080\u009dSpiller, manger of Capital Gearing Trust CGT, , predicts that further fiscal stimulus remains likely, although whether it takes the shape of student debt forgiveness, a â\u0080\u0098Green New Deal,â\u0080\u0099 or helicopter money, remains unclear. â\u0080\u009cLow interest rates and elevated inflation means strongly negative real interest rates. The best performing asset class in this environment is likely to be index linked bonds. We favor U.S. TIPS [Treasury inflation-protected securities] but also hold index-linked bonds in Japan, Sweden and Australia,â\u0080\u009d he says. He adds: â\u0080\u009cGold could do well too, though of course it is rather harder to value. In such an environment any cash flow that is reasonably secure with good inflation correlation should become more highly valued by the market. To that end we have been buying property, particularly with long leases and good covenants.â\u0080\u009d Read:Gold ends with a loss as investors weigh on signs of a re-emergence of coronavirus cases Hamish Baillie, fund manager of Ruffer Investment Company:â\u0080\u009cBond yields will be nailed to the floorâ\u0080\u009dThe debt-financed promises from governments to protect jobs and the economy require negative real interest rates to be affordable, says Baillie, fund manager of Ruffer Investment Company RICA, +0.20%. â\u0080\u009cThis will result in bond yields being nailed to the floor and a relatively laissez-faire approach being taken to inflation running above target.â\u0080\u009d In such an environment, he doesnâ\u0080\u0099t own conventional bonds, cash other than for short-term tactical reasons and a large exposure to equities. In contrast, he is holding government-backed inflation-linked bonds in the U.K. and U.S., gold and a low weighting to equities. Simon Edelsten, fund manager of Mid Wynd International Investment Trust:â\u0080\u009cLarge stimulus measures tend to be inflationary and may make some currencies weakenâ\u0080\u009dWhile the current pandemic and lockdowns have resulted in a sharp decline in economic activity and higher unemployment, Edelsten argues these may moderate as lockdown measures end. But he also views large stimulus packages as inflationary and says it can cause concern for investors. As a result, he says: â\u0080\u009cMid Wynd MWY, +0.59% Â invests in companies which have very strong market positions and which, therefore, tend to be able to raise prices when there is modest inflation or deflation â\u0080\u0094 for instance Thermo Fisher TMO, +2.46%, the world leader in scientific equipment, faces little price competition, rather competes on quality of product.â\u0080\u009d He adds: â\u0080\u009cIndeed a long period of deflation, such as has been seen by global investors in Japan over the last 20 years, tends to favor growth stocks with world leading technology over other investments. Very high inflation, perhaps triggered by excess public spending, is a challenge for equity and bond investors so we have a modest allocation to gold mines in the fund which should offset part of this risk to capital value if it arises â\u0080\u0094 we do not expect it to happen, but we are prepared just in case.â\u0080\u009d"}]}