{"article": [{"url": "https://www.marketwatch.com/story/our-country-is-freedom-loving-boris-johnson-on-why-u-k-covid-19-rate-is-worse-than-italy-and-germany-11600856729", "published": 1601037440.0, "headline": "Italian president hits back at Boris Johnson over â\u0080\u0098freedom lovingâ\u0080\u0099 COVID-19 remarks", "body": "U.K. Prime Minister Boris Johnson announced to lawmakers on Tuesday the government's new restrictions relating to the COVID-19 pandemic. Jessica Taylor/Agence France-Presse/Getty Images Italian President Sergio Mattarella has hit back at Boris Johnson after the U.K.â\u0080\u0099s prime minister suggested his country has a worse COVID-19 rate than Italy and Germany because it is a â\u0080\u009cfreedom-loving country.â\u0080\u009d â\u0080\u009cWe Italians also love freedom, but we also care about seriousness,â\u0080\u009d Mattarella said in a private conversation during a visit to Sardinia. The comment was reported by local media and has since been confirmed by the presidentâ\u0080\u0099s office. Johnson was quizzed by U.K. lawmakers in the House of Commons on Tuesday after unveiling stricter restrictions in a bid to contain a renewed spread of the coronavirus that causes the disease COVID-19. The measures, including 10 p.m. pub and restaurant curfews and stricter rules on wearing masks, came as the U.K. recorded 4,926 new cases on Tuesday and a further 6,178 cases on Wednesday â\u0080\u0094 the highest daily figure in four months. Thursdayâ\u0080\u0099s figure of 6,634 is the countryâ\u0080\u0099s highest-ever daily figure. In contrast, Italy â\u0080\u0094 Europeâ\u0080\u0099s worst-hit country at the beginning of the pandemic â\u0080\u0094 reported 1,786 new daily cases on Thursday, and Germany recorded 2,143, according to the countriesâ\u0080\u0099 health officials. Both countries have so far avoided imposing fresh restrictions despite cases rising sharply in other European nations, including Spain.Â Â Â Ben Bradshaw, an MP for the opposition Labour Party, asked Johnson whether Germany and Italyâ\u0080\u0099s testing and tracing programs were behind their relative success in containing the virus this time around. â\u0080\u009cDoes he think that the reason Germany and Italy have far lower COVID rates than us, with life continuing more or less normally, might be because they have locally and publicly-run test-and-trace services that actually work?â\u0080\u009d he asked in Parliament on Tuesday. In response, the prime minister disagreed and said the â\u0080\u009ccontinual attacksâ\u0080\u009d on the National Health Serviceâ\u0080\u0099s test-and-trace service were â\u0080\u009cundermining and unnecessary.â\u0080\u009d â\u0080\u009cAnd actually there is an important difference between our country and many other countries around the world, and that is our country is a freedom-loving country.â\u0080\u009d Read: From lockdowns to Brexit, the U.K. economy is heading toward a rough winter â\u0080\u009cIf you look at the history of this country over the last 300 years, virtually every advance from free speech to democracy has come from this country. It is very difficult to ask the British population uniformly to obey guidelines in the way that it is necessary.â\u0080\u009d"}]}