{"article": [{"url": "https://www.marketwatch.com/story/your-adviser-missed-the-rally-now-what-2020-07-30", "published": 1596103760.0, "headline": "Your adviser missed the rally. Now what?", "body": "So you’re lagging the market; now what? Of course, I have no way of knowing your performance in particular. But I’m willing to bet that you’re lagging the market: The vast majority of investment advisers don’t do as well as they would by simply buying and holding index funds. And this is especially true in years like 2020, because the all-too-human tendency is to bail on equities at or near the bottom, and then not get back into the market is at or near a top. 80% of older Americans can't afford to retire - COVID-19 isn't helping If your adviser went to cash at the March bottom, you could be sitting on a year-to-date loss of nearly 30% — even with the overall market close to flat. If so, you may be asking whether it’s time to get rid of him. That’s what I want to focus on in this column: When is your adviser’s performance so bad that you’re on sound statistical ground in no longer following him? My answer: His performance has to be really, really awful before you can make a good statistical case that he has lost his touch. That’s because luck and randomness play an outsize role in performance over the short- and intermediate terms. So you have to have a long stretch of dismal performance before you can conclude that his poor returns were more than just bad luck. To illustrate, consider momentum strategies, which build on the well-documented tendency for the stock market’s best-performing stocks over the recent past to continue beating the market for a few months more. Numerous studies have found strong evidence of this tendency in not just the U.S. stock market back to the 1920s, but in other countries around the world as well. According to data from Dartmouth finance professor Ken French, for example, a portfolio constructed to always contain the 10% of stocks with the best trailing-year returns beat the market since 1927 by an annualized margin of 16.6% to 9.9%. This is before transaction costs, but still statistically significant. As is also widely known, however, momentum strategies have struggled in recent decades, especially the last one. Take a look at the accompanying chart, which plots the trailing 10-year annualized return of a high-momentum-stock portfolio relative to that of the overall market. Even without taking transaction costs into account, momentum strategies in recent years have barely kept even with the market. A decade of just keeping up with the market certainly seems significant. And as you can see from the chart, the last decade is not the only recent occasion in which momentum strategies failed to beat a buy-and-hold. Another occurred in the 1980s. The last four decades certainly seem to be statistically different than the previous ones. But they’re not, according to the statistical test to which I subjected the data. According to that test, you cannot (at the 95% confidence level that statisticians often use when determining if a pattern is due to more than just luck) conclude that the momentum portfolio’s performance in recent decades is worse than in prior ones. I imagine that many of you will object. Does this mean you have to simply grin and bear it for 10 or more years of mediocre performance? I’m afraid so, assuming you want to base your investment strategies on rigorous statistics. This is why picking an adviser is so momentous a decision. When you decide to follow an adviser, you need to be prepared to follow him through many years of both thick and thin. To be sure, no one says you have to base your investment strategies on rigorous statistics. But if you don’t you might as well flip a coin (or go to Las Vegas). The bottom line? Painful as it may be to sit on your hands and do nothing as your adviser loses 30% over a six-month period, that nevertheless in most cases is the best advice. Mark Hulbert is a regular contributor to MarketWatch. His Hulbert Ratings tracks investment newsletters that pay a flat fee to be audited. Hulbert can be reached at mark@hulbertratings.com."}]}