{"article": [{"url": "https://www.marketwatch.com/story/renters-face-financial-cliff-ahead-as-eviction-moratorium-ends-july-25-2020-07-08", "published": 1594222580.0, "headline": "Renters face financial cliff ahead as eviction moratorium ends July 25", "body": "Renters are nearing the end of their financial rope. Americans who rent their apartments or houses have largely been able to survive the initial months of the coronavirus pandemic helped by unemployment and federal relief checks, but the extra $600 in unemployment benefits ceases at the end of July and local eviction moratoriums are expiring. There is no agreement between the White House and Congress on a second federal relief package. More broadly, there are fewer supports in place for renters than for homeowners. And as a jump in virus cases in numerous states nationwide adds more uncertainty to the economy and job market, many who rent are facing a precarious future. “It’s an incredibly stressful situation for renters,” said Bruce McClary, spokesman for the National Foundation for Credit Counseling, a nonprofit that works directly with consumers. “I don’t know what lies in the road ahead.” Sam Moore knows this pressure all too well. Shortly after the stay-at-home orders hit in California, Moore and his four roommates who live in San Francisco’s Treasure Island found themselves with no regular income. Only two of them received relief checks from the federal government, one was receiving unemployment and two are still waiting on it. Ultimately, they had to decide whether to use the money they did have to cover rent or food; they chose to stop paying rent. The five eventually used a GoFundMe campaign to raise the roughly $10,000 needed to pay the back rent for April through June plus the $2,500 bill due for July. The group, all in their early 20s, are looking for work but will have to move in with their families if they aren’t able to find jobs and face eviction. ROUGH TIME TO RENT Renters already faced a dire situation before the pandemic hit, said Alexander Hermann, a researcher at the Harvard Joint Center for Housing Studies. The center reported in January that vacancy rates for rentals had hit the lowest level in decades, pushing up rent far faster than income. At last count, one in four renters spent more than half their income on housing. Then came the pandemic, which hit renters particularly hard financially. U.S. Census data shows about 19% of renters were late or deferred their rent payments in May. And about 31% of renters surveyed in June said they have little to no confidence they will be able to pay next month’s rent. Renters tend to have lower incomes and to be more economically vulnerable than their homeowner counterparts. They also cannot tap into the equity in their homes as a line of credit in case of an emergency. A disproportionate number of renters are black, Hispanic and other minorities. The COVID-19 Eviction Defense Project, a coalition of economic researchers and legal experts, estimates that 19 million to 23 million Americans are at risk for eviction by the end of September. FIRST STEPS If possible, tenants should continue to pay rent. Reach out to your landlord or property owner if you are having financial difficulties to see if an agreement can be made. Some are willing to negotiate discounted or deferred payments. If you live in federally-subsidized housing and your income has changed, you may qualify for a reduction in rent; contact your housing authority to talk about income recertification. Renters should be sure to take advantage of other relief programs as well to free up cash. If they qualify for unemployment, apply as soon as possible as the process takes time. Banks have been willing to make some accommodations for credit card and other loan payments for those financially hurt by coronavirus. PROTECTIONS A number of cities and states have put some assistance programs in place, as well as moratoriums on evictions amid the pandemic. See if you qualify for help. The National Low Income Housing Coalition has a list of state and local rent assistance programs on its website. United Way’s 211.org website also has links to local charitable assistance for housing, food and other essentials. Find out what local protections you have. The Eviction Lab maintains a list of local and regional actions to pause evictions of renters. It’s policy scorecard provides useful detail on actions in your state. There is also some protection for renters at the federal level. Congress put a temporary nationwide eviction moratorium in place for renters who live in a federally subsidized building or one with a federally backed mortgage through July 25. Landlords cannot charge fees or penalties for nonpayment during this time as well. Tenants can search the Fannie Mae website or the Freddie Mac site to find out if their building has a federally backed mortgage. The Consumer Financial Protection Bureau has helpful information on its website as well. NEXT STEPS While you may get temporary relief from eviction, rent is still due. Tenants may need to work out an arrangement to pay back rent or cope with potential eviction. They may want legal assistance through this process. The Stanford Legal Design Lab along with Pew Charitable Trusts, has created a user-friendly website for tenants with questions about their legal rights or facing other rent issues as well. Just Shelter, a tenant advocacy group, also offers information on local and national organizations that can provide advice to renters in distress. Renters can also find a certified housing counselor through the Department of Housing and Urban Development’s website to see if they qualify for housing assistance or eviction issues."}]}