{"article": [{"url": "https://www.marketwatch.com/story/trumps-vaccine-czar-says-the-first-vaccine-should-be-submitted-for-emergency-authorization-around-thanksgiving-2020-10-08", "published": 1602227720.0, "headline": "Trumpâ\u0080\u0099s vaccine czar says the first vaccine should be submitted for emergency authorization around Thanksgiving", "body": "This interview is part of a series of conversations MarketWatch is conducting with some of the leading voices in the U.S. on COVID-19 pandemic. Moncef Slaoui, an immunologist by training and a longtime pharmaceutical executive, is running the Trump administrationâ\u0080\u0099s Operation Warp Speed program to spur development of vaccines on the fastest ever timetable. While none of the four vaccine candidates to enter Phase 3 trials have publicly reported data from the mid-stage studies, Slaoui is hopeful that drug makers will file for emergency authorization with the Food and Drug Administration by late November, immunization in high-risk populations could begin this year, and that the vaccines may be more effective in clinical trials than previously assumed. â\u0080\u009cMy expectation is really something between 80% and 90% efficacy,â\u0080\u009d he said. Slaoui, the administrationâ\u0080\u0099s vaccine czar so to speak, spent three decades in GlaxoSmithKlineâ\u0080\u0099s GSK, +1.10% Â vaccines business before joining the boards of Moderna Inc. MRNA, +0.09% Â and Lonza Group AG LONN, +0.75%. He resigned from both roles when he joined the administration. (Moderna is developing one of the late-stage COVID-19 vaccines that is part of Operation Warp Speed, and Lonza is one of Modernaâ\u0080\u0099s manufacturing partners for its vaccine candidate.) Operation Warp Speed has been both lauded and criticized for its aggressive timeline. The project aims to bring to market a set of vaccines and treatments with a target of delivering 300 million doses of a vaccine starting in January. Like many scientists, however, Slaoui seems to prefer to focus on the data, and not the politics, even in the highly politicized environment surrounding vaccine development. President Donald Trump has referred to Slaoui as a â\u0080\u009cworld-renowned immunologistâ\u0080\u009d but also said he disagrees with his timeline for vaccine distribution, citing politics. However, Slaoui told Science in September he would resign if politics interfered with the vaccine development process. â\u0080\u009cI hope this never happens again, that such events are politicized,â\u0080\u009d he told MarketWatch on Wednesday. â\u0080\u009cWeâ\u0080\u0099re forgetting something, which is people are dying, and forgetting another thing, which is never ever before has an effort of this proportion been made and vaccines been developed in a period of less than a year.â\u0080\u009d MarketWatch: The first thing I wanted to ask you about was the FDA guidance this week. They want to the vaccine trials to include two months of monitoring of participants after their final dose and for there to be at least five cases of severe COVID within the placebo group. Can you tell me why this is needed? Moncef Slaoui: The safety follow-up is reasonable. The safety database of the FDA [shows] that most of the significant adverse events associated with immunization take place within 40 or so days from the last immunization. Therefore, requiring that 50% of the population included in the trial would have crossed that two-month time frame to have people have two months, three months, four months of follow-up after their second dose is a good takeaway. Itâ\u0080\u0099s going to give you a reasonable sampling of most of the adverse events of any one of these vaccines. That coupled with very strong active pharmacovigilance, upon introduction of the vaccine, should fully characterize the long-term safety of the vaccine. In terms of severe disease, itâ\u0080\u0099s really very important â\u0080\u0094 75% to 80% of deaths in the U.S. are in people over the age of 70 years old. [Editorâ\u0080\u0099s note: About 78% of the people in the U.S. who have died from COVID-19 are in three age groups (65 to 74, 75 to 84, and older than 85), according to the latest figures from the Centers for Disease Control and Prevention.] Having at least a trend embedded within the trial outcome showing that there are cases of severe disease clearly more in the placebo group than in the vaccine groupâ\u0080¦is important. Itâ\u0080\u0099s key to link the vaccine efficacy overall to the most relevant population and the most relevant outcomes in the population. MarketWatch: The FDA also wants to see vaccines that are at least 50% effective. Is the hope that later vaccines will be more effective than that? Slaoui: The FDA guidance of about 50% is really about how to power the clinical trial. Itâ\u0080\u0099s not about what the expectation from the vaccines is. We donâ\u0080\u0099t want to miss a vaccine that has 50% efficacy, if that was to be the reality. Because 50% efficacy in the setting of a pandemic may mean 500 deaths prevented every day â\u0080\u0094 thatâ\u0080\u0099s quite relevant. But my expectation is really something between 80% and 90% efficacy. I would be very negatively surprised if it was closer to 50%. Everything we see, including the recent data by Lilly LLY, +2.20% and Regeneron REGN, +0.36%, with monoclonal antibody transfer, suggested robust efficacy can be achieved. [Editorâ\u0080\u0099s note: Lilly and Regeneron both submitted their experimental antibody treatments to the FDA for authorization this week.] MarketWatch: So youâ\u0080\u0099re anticipating even that the first vaccine that will receive authorization will hit a significantly higher benchmark than 50%. Slaoui: Thatâ\u0080\u0099s my expectation. MarketWatch: A question on the RNA vaccines: they have some pretty intense refrigeration requirements. How are you thinking about the distribution for these types of vaccines that potentially millions of people will need to get? Slaoui: The two RNA vaccines, [which are being developed by BioNTech BNTX, +1.23% Â and Pfizer Inc. PFE, -0.27% Â and Moderna have different levels of requirements of refrigeration. The Moderna one requires [negative 4 degrees Fahrenheit], which is a reasonable level of refrigeration. There existed a vaccine called Zostavax that has been withdrawn recently, for reasons that have nothing to do with refrigeration. [Editorâ\u0080\u0099s note: Zostavax is a shingles vaccine marketed by Merck & Co. MRK, -0.14% Â that is no longer sold in the U.S., as of July.] The infrastructure exists. And whatâ\u0080\u0099s very important is once cold, this vaccine can be stable for a week, maybe more than a week. In real life, in terms of where it is administered to subjects, itâ\u0080\u0099s fully manageable. I think the other vaccine has a [negative 94 degrees Fahrenheit] requirement. That is exceptionally cold and requires access to dry ice. However, Pfizer, who is the sponsor of this vaccine, has done a superb job in creating a specific packaging system that allows the vaccine to be transported and stored close to the administration sites for a period of 15 days. And once the vaccine is stored, the vaccine must be used within the day. [This is], I would say, fully compatible with immunizing health care workers, first line workers. You can line up people and immunize them. It may be also compatible with immunizing in an elderly care center. It is less compatible with immunizing in CVS CVS, -1.76% Â and Walgreens WBA, -1.96%. Different vaccines may be best used in different circumstances because of the refrigeration. MarketWatch: Based on the FDA document that came out this week, with the two months of monitoring, when do you now expect to see the first EUA submission for a vaccine? Slaoui: We will know if a vaccine worksâ\u0080¦anytime late October, or November, or in December. But I expect the EUA filing to happen three [or] four weeks after that moment of when we know the vaccine is efficacious, maybe if we work like crazy we make it happen in two weeks. I think we need to look at this in different levels. The data safety monitoring board (DSMB) [is] going to be triggered by the number of [severe cases of COVID-19], and that number of events may happen prior to the window of two months or later than the window of two months. I just want to be clear that there is nothing that says the window of two months will happen after we have enough [severe] cases to do the first analysis. What is likely to happen is that the companies are going to first take a certain number of days from the time the number of cases are accrued to clean up the data. There are always clarifications on the case report form. You call the clinical trial sites, ask for questions that are called queries. This is all regulated in the [good clinical practice] requirements. That usually is going to take, frankly, easily a week to make sure every case is a real case, whether it corresponds to a primary endpoint definition or secondary endpoint definition. Otherwise youâ\u0080\u0099re going to be creating a mess. Letâ\u0080\u0099s say if the number of cases is obtained, Iâ\u0080\u0099m going to even say Oct. 29, [though] it may be until Nov. 10 or Nov. 7. And then it may be until the end of November when the file is actually fully completed and submitted to the FDA for emergency use. Itâ\u0080\u0099s important to factor in those periods of time. Things donâ\u0080\u0099t happen overnight; otherwise, you will be making mistakes. MarketWatch: You spoke this week at an event about scale and manufacturing for vaccines. What do you think Americans need to understand about the different steps of this process: receiving clinical data, filing for an EUA, getting one, and then when and how this vaccine will be rolled out? Slaoui: If I look at the two RNA vaccines, imagine approval happens during the month of November. We will be able to immunize the first populations that are most impacted by this virus, as of November, and then December, and then January. Within that period of time, between November and January, we will have enough vaccines to immunize, I would say, 80 to 100 million people, which represents all the elderly people, the health care workers, the first line workers. After that, we start to immunize the less risky populations. If you look at it over a period of six, seven months, between November and June, we will be immunizing a very large number of people, month on month, every month, starting with the most risky, the most impacted toward the least impacted people. Itâ\u0080\u0099s the right thing to do, because not only weâ\u0080\u0099re doing it because vaccine doses are available as we go, but also because we will [immunize] the people who have the most benefit to expect from the vaccine. And those people will help us further characterize the safety of the vaccine in larger numbers of people, before we start putting the vaccines into people that have less risk. This is really appropriate. Itâ\u0080\u0099s a responsible way to do it. If we had enough vaccines to [immunize] everybody at once, my personal recommendation would have been not to do it. Because these are new technologies, we need to start with people who have the highest therapeutic index, the most benefit, and then little by little change the move to the people with less risk. We may be able to accelerate the process from being seven months or six months to taking four months but not much more than that. MarketWatch: There have been some polls indicating waning trust in the vaccine process. Weâ\u0080\u0099ve seen safety holds, which are normal in trials, but those also have been a concern. How do you think the administration can address this? Slaoui: Iâ\u0080\u0099m sad, frankly. Iâ\u0080\u0099m disappointed that politicians have embarked into communication processes and media in a way that has created so much angst around this process. Weâ\u0080\u0099re forgetting something, which is people are dying, and forgetting another thing, which is never ever before has an effort of this proportion been made and vaccines been developed in a period of less than a year. Weâ\u0080\u0099re not running smaller trials; weâ\u0080\u0099re running bigger trials than usual. I hope this never happens again, that such events are politicized. Transparency, transparency, transparency is the name of the game. We are committed to make available every data. In a podcast I did a few days ago, I said, letâ\u0080\u0099s stop talking about consistent communication. What about transparent communication? We cannot be consistent because if we are being transparent, we may appear as inconsistent. Because today I tell you we have 10 million doses, and then tomorrow I mess it up and say, I will have 11 or we will have nine, because some events may have happened. We want to be fully transparent and explain every step. The FDA wants to be fully transparent and explain this step. We invite all the experts to not sit on the sideline and use their fingers to say why this was impossible six months ago and now say, Yeah, make sure itâ\u0080\u0099s transparent. Why only say something critical? Why not take 20% or 30% of your time, and sit with us around the table and help us alleviate the issue by being transparent. This Q&A has been edited for clarity and length. Read more A Word from the Experts interviews: â\u0080¢ Abbott exec: Why better COVID-19 tests may help the U.S. get back to normal â\u0080¢ Philadelphia pediatrician Paul Offit: Prepare to wear masks and socially distance even after getting COVID-19 vaccine â\u0080¢ To defeat COVID-19, â\u0080\u0098we need a unified national strategy,â\u0080\u0099 says public health expert Dr. Howard Koh"}]}