{"article": [{"url": "https://stocknews.com/news/abt-abbott-laboratories-set-to-rally-amid-interest-from-2-types/", "published": 1598875700.0, "headline": "Abbott Laboratories Set to Rally Amid Interest from 2 Types of Buyers", "body": "Abbott Laboratoriesis (ABT) kicking off the week with prospects to resume its gains after consolidating earlier. The US government’s purchase of Abbott’s coronavirus tests boosts confidence. Focus on COVID-19 has attracted younger investors. Abbott Laboratories’ impressive dividend record implies support from long-term investors as well. Five dollars and fifteen minutes – all that is needed to know if one has COVID-19 or not. Abbott Laboratories (ABT) coronavirus test has been attracting attention from speculators chasing the next coronavirus stock – and from Uncle Sam. The US government committed to purchasing 150 million of Abbot’s BinaxNow tests that are seen as a “game-changer.” Being able to quickly detect those infected with the contagious disease and isolate them would help stop the spread. According to the Chicago-based firm, the probe has high levels of specificity and sensitivity. Speculators looking for the next hot stocks have been piling into every company that has been reporting progress on anything coronavirus-related – from those advancing toward developing a vaccine, through those helping COVID-19 patients and to those producing testing kits. 7 Best ETFs for the NEXT Bull MarketThe rush of this type of headline-chasing traders can be attributed to the most recent rise in ABT’s price. ABT stock dividend Yet the veteran company – founded in 1888 – has more to offer to long-term investors. Its wide range of products already gave it a valuation above $180 billion before the recent rush, and it is now nearing $200 billion. More importantly for those sticking with Abbott for the long run is the company’s impressive dividend history – raising it for 48 consecutive years. That makes Abbott Laboratories a “Dividend Aristocrat” – putting it in an exclusive group of S&P 500 members that have been boosting their payouts for at least 25 years. Broader markets remain supported by the Federal Reserve’s dovish policy shift. The bank will prioritize reaching full employment at the expense of letting inflation overheat. That means allowing for lower rates for far longer, making stocks more attractive. ABT shares were trading at $110.01 per share on Monday afternoon, down $0.78 (-0.70%). Year-to-date, ABT has gained 28.22%, versus a 9.99% rise in the benchmark S&P 500 index during the same period."}]}