{"article": [{"url": "https://stocknews.com/news/chwy-cvna-etsy-3-e-commerce-stocks-outperforming-the-market/", "published": 1595592500.0, "headline": "3 E-Commerce Stocks Outperforming the Market", "body": "Even before the coronavirus era, e-commerce businesses were growing fast, while other parts of the retail industry were stagnating. E-commerce has some inherent advantages versus traditional brick-and-mortar stores because of their lower costs and the ability to reach a larger market. And because of the Covid-19 pandemic, e-commerce is seeing impressive growth. According to eMarketer.com, US e-commerce sales will surge 18.0% to $709.78 billion in 2020 and will reach an all-time high of 14.5% of total retail sales. Here are three e-commerce stocks that should benefit from this surge in e-commerce: 7 \"SAFE HAVEN\" Dividend Stocks for Turbulent TimesCarvana Co. (CVNA) CVNA, which is a second-hand online car dealing platform, has been rising since hitting its 52-week low of $22.16 on March 19th due to the coronavirus-led market crash and has gained more than 560% so far. This momentum can be attributed to CVNA’s proactive approach to capitalize on the social-distancing era. Amid the economic volatility and political turmoil, more people are turning to the used car dealership market to avoid public transport and CVNA’s online mechanism is benefitting from this trend. Ernie Garcia, CEO, and founder of CVNA said, “This quarter we implemented Touchless Delivery to offer the safest and easiest experience to buy a car. As the pioneers of online car buying, we’re proud to be leading our industry as shifts in customer behavior accelerate.” CVNA launched CarvanaACCESS which is a direct purchase platform that gives dealers a chance to buy vehicles. The site also has an auction portion developed in collaboration with Manheim Digital. In the first quarter, CVNA’s revenue increased by 45%, total gross profit increased 56% and vehicles purchased directly from customers increased 157% year over year. Moreover, CVNA’s consensus revenue estimate of $1.14 billion for the quarter ending June 2020 indicates a year-over-year increase of 23.6%. CVNA’s EPS is expected to grow 100% per annum in the next five years. How does CVNA stack up for the POWR Ratings? A for Trade Grade A for Buy & Hold Grade A for Peer Grade A for Industry Rank A for Overall POWR Rating You can’t ask for better. The stock is also ranked #3 out of 54 stocks in the Internet industry. Chewy, Inc. (CHWY) CHWY is a favored choice for pet parents and its recent price performance reflects its strong business momentum. The stock has gained about 130% since hitting its year-to-date low at the beginning of March. CHWY’s eCommerce platform has been benefiting from the surge in demand for pet-related products during the current period due to the increasing number of home stayers. The market expects the company to report EPS of negative $0.16 for the current quarter, representing an improvement over the year-ago EPS of negative $0.21. Moreover, CHWY’s consensus revenue estimate of $1.64 billion for the current quarter indicates a year-over-year increase of 41.9%. CHWY’s EPS is expected to grow 132.1% per annum in the next five years. In the fiscal first quarter ended May 3rd, net sales increased 46% and adjusted EBITDA increased 122% year over year. CHWY’s POWR Ratings reflect a promising outlook. It has an overall rating of “Buy” with an “A” for Trade Grade and Industry Rank and a “B” for Buy & Hold Grade. Among the 33 stocks in the Consumer Goods group, it’s ranked #11. Etsy, Inc. (ETSY) ETSY is a two-sided online marketplace based in Brooklyn, New York. It continues to innovate to grow market share. For example, Reverb, a subsidiary, recently announced the revision of its selling fee which will help the online marketplace make investments in marketing initiatives, customer support, and seller tools to attract buyers to the site and enhance the visibility of sellers. In the first quarter, total revenue was up 34.7% and gross profit was up 24.8% year over year. There was also a marked growth in the number of active buyers and sellers which increased 16.4% and 26.4% year over year, respectively. The market expects the company to report EPS of $0.39 for the quarter ended June, indicating a 178.6% increase over the year-ago number. Moreover, ETSY’s consensus revenue estimate of $326.67 million for the quarter indicates a year-over-year increase of 80.4%. ETSY’s stock has gained more than 240% since the March low that was triggered by the virus-led market crash. Thirteen out of sixteen Wall Street analysts have a ‘buy’ rating on the stock. It’s no surprise that ETSY is rated “Buy” in our POWR Ratings system. It also has an “A” for Industry Rank and a “B” for Trade Grade and Buy & Hold Grade. In the 54-stock Internet industry, it is ranked #17. Want More Great Investing Ideas? 9 “BUY THE DIP” Growth Stocks for 2020 Newly REVISED 2020 Stock Market Outlook 7 “Safe-Haven” Dividend Stocks for Turbulent Times CHWY shares were unchanged in after-hours trading Friday. Year-to-date, CHWY has gained 58.48%, versus a 0.61% rise in the benchmark S&P 500 index during the same period."}]}