{"article": [{"url": "https://stocknews.com/news/pm-phm-cai-3-value-stocks-to-scoop-up-as-money-moves-away/", "published": 1601467700.0, "headline": "3 Value Stocks to “Scoop Up” as Money Moves Away from Tech", "body": "Those who pay close attention to the stock market are well aware that tech stocks may have hit a ceiling. These overbought stocks may steer investors toward value companies. The question is, how high will value stocks go, and how quickly will the ascension occur? If tech stocks take a big tumble this fall, some of the money seemingly destined for value stocks will find its way back to the tech sector. However, in due time, a significant amount of money will segue to value stocks in the weeks ahead simply because there is no other attractive place for investors to park their money. Below, we provide a look at four value stocks that could rise as money shifts away from overvalued tech companies: Philip Morris International (PM), PulteGroup (PHM), and CAI International (CAI). 7 Best ETFs for the NEXT Bull MarketPhilip Morris International (PM) PM is quickly changing its reputation from a malevolent tobacco monolith to a provider of reduced-risk products. For example, PM now sells IQOS, a device meant to heat the tobacco and reduce resulting health risks. All in all, these reduced-risk products comprise more than one-quarter of PM’s products, a figure that will continue to grow as time progresses. PM’s gradual product line transition is helping the company garner that much more attention from investors. PM has solid POWR Ratings components with a grade of “A” for Peer Grade, a “B” for Trade Grade and Buy & Hold Grade and a top ranking in the Tobacco industry. Analysts are overwhelmingly bullish on the stock, setting an average price target of $92, which could provide a 22% upside. PM appears to be undervalued as its forward P/E ratio is a mere 15. PM’s dividend of 6.29% will undoubtedly attract more investor interest as money gradually shifts away from overvalued tech stocks. PulteGroup (PHM) When investors scramble away from tech stocks, they seek value stocks, many of which are in the homebuilding and financial services industries. PHM is one such stock. The vast majority of PHM’s business is in homebuilding, yet its financial services offerings are also worth noting. PHM builds a wide array of housing units, all of which are selling like gangbusters during the country’s blazing-hot housing market. PHM is a POWR Ratings stud with “A” grades in each component, but for its Peer Grade, which is a “B”. PHM is ranked in the top five of more than 20 Homebuilder stocks. The average analyst price target for PHM is $46.86. PHM has a forward P/E ratio of 10.75, indicating it is undervalued, especially considering the fact that the housing market is on fire. PHM’s summer year-over-year orders are up 50%. This growth is the result of the shift of urban dwellers to the suburbs. This transition is only beginning, meaning PHM should enjoy a significant uptick in business in the months ahead and possibly even for years to come. PHM’s first-time homebuyer metric is up 77% in June alone. It is clear young Americans are willing to take on the debt required for a massive mortgage rather than continue paying rent. PHM could blast through its 52-week high of $48 before winter begins. CAI International (CAI) As tech stocks gradually decline following their meteoric ascension, more investors will consider the merits of the world’s top transportation businesses. CAI is one of the global leaders in freight container management and leasing. CAI’s top customers are international steamship businesses that transport cargo. The company’s business is divided into container fleet management and container leasing. CAI has “A” grades in each POWR Component except its Industry Rank. CAI is ranked second of 46 stocks in the Shipping category. The stock’s forward P/E ratio is a measly 8.51, indicating it stands a good chance of climbing at least a couple dollars higher, possibly breaking through its 52-week high of $29.57 in the weeks to come. Want More Great Investing Ideas? Do NOT Buy Stocks Before the Election! 7 “Safe-Haven” Dividend Stocks for Turbulent Times Chart of the Day- See Christian Tharp’s Stocks Ready to Breakout PM shares were trading at $74.99 per share on Wednesday afternoon, up $0.65 (+0.87%). Year-to-date, PM has declined -7.42%, versus a 5.54% rise in the benchmark S&P 500 index during the same period."}]}