{"article": [{"url": "https://stocknews.com/news/amzn-googl-msft-3-stocks-in-the-robinhood-100-to-buy-now/", "published": 1593173300.0, "headline": "3 Stocks in the Robinhood 100 to Buy Now", "body": "The stock trading app Robinhood has been in the news quite a bit lately. When the market started flying high after its March lows, many professional investors wondered why people were so bullish when there was no clear end in sight to the Coronavirus. Well, part of that euphoria can be attributed to the Robinhood community. Robinhood serves over 10 million customers, with an average age of 31. While there has been some day-trading amongst some customers, most investors on the platform hold well-known stocks. We know this because Robinhood publishes a list containing the top 100 popular stocks held by their customers. I thought it would be interesting to run these 100 stocks by our POWR Ratings to find three stocks with a Strong Buy Rating. Amazon.com (AMZN) 7 Best ETFs for the NEXT Bull MarketThe first stock on this list is AMZN. There are currently 282,762 investors on Robinhood that hold this stock. Online shopping is growing each year, and AMZN maintains a dominant market share in the industry. The company can do this through its Amazon Prime Subscription. Subscribers receive free, fast shipping and better pricing. AMZN has over 150 million Prime members. AMZN has significantly benefited from the pandemic. Consumers can watch TV and movies, play video games and shop online. These revenue streams will continue to grow as we further enter the Digital Age. AMZN is also the leader in cloud computing. AMZN announced on Friday that it had agreed to acquire Zoox, a privately held company that is working on autonomous driving technology for ride-hailing services. This makes AMZN a severe threat to Uber Technologies (UBER) and Lyft (LYFT). AMZN could integrate ride-sharing into its Prime membership program. Revenue at AMZN should rise the remainder of this year due to strong growth in their Web Services unit (AWS) and continued growth in online shopping in North America and Internationally due to the pandemic. AMZN has Strong Buy POWR Rating and is ranked #1 out of 52 stocks in the Internet Industry. With high growth rates in the company’s various segments and the acquisition of Zoox, now could be the perfect time to buy. Alphabet Inc. (GOOGL) There are 83,781 investors holdings GOOGL on the Robinhood platform. GOOGL is the dominant player on the internet. It is the most popular search engine and holds a 93% market share in mobile search. If you want to search for something online, GOOGL is how you do it. The search engine provides massive revenue through advertisements that should provide cash for the company during the pandemic. The company will also benefit from higher ad revenue at YouTube, which has grown with more engagement on videos as people stay home. Search isn’t the only tool in GOOGL’s toolbox. GOOGL also manufactures laptops, is a significant player in cloud computing, and is investing in driverless technology. GOOGL’s cloud unit reported $2.8 billion in revenue for the first quarter, which was 52% more than the previous year. The company plans to invest $2 billion in a data center in Poland due to increased demand for cloud computing. The company has strong fundamentals. In the first quarter, it reported free cash flow of $5.4 billion, and currently has a Current Ratio of 3.7, so it should be able to withstand any downturn. GOOGL is on solid footing and should continue to grow its business units. GOOGL has Strong Buy POWR Rating and is ranked #2 out of 52 stocks in the Internet Industry. The average analyst price target is $1,514.13, so now may be an excellent time to get in. Microsoft Corp (MSFT) Robinhood has a whopping 491,997 investors holding MSFT stock. The company had a resurgence in 2014 under new leader Satya Nadella. The stock has gained 400% since then. MSFT has focused on cloud computing and artificial intelligence. The cloud computing unit generated $39 Billion for last year. That represents 31% of the company’s total revenue. Its cloud product, Azure Cloud, is the fastest-growing cloud business. Its revenue recently grew by 59%. MSFT is looking to catch up with the cloud leader, AMZN. The pandemic also accelerated the growth of its video meetings product, Microsoft Teams. MSFT continues to rake in huge profits from its software products. There are now more than one billion computers and devices using Windows 10. The company has switched its focus to a subscription-based model, Office 365. The software business has led to $71 billion in cash on MSFT’s balance sheet. A third of that goes to its shareholders in the form of a 1% dividend. The pandemic has created a perfect environment for the work at home model. MSFT is well-positioned to benefit from that model through its suite of online and software products. MSFT has Strong Buy POWR Rating and is ranked #1 out of 81 stocks in the Software-Application Industry. With twenty-four out of twenty-five analysts rating the company a Strong Buy, this stock could find a place in your portfolio. These three technology stocks are all in a great position to withstand the corona economy and beyond. Want More Great Investing Ideas? 9 “BUY THE DIP” Growth Stocks for 2020 Top 3 Investing Strategies for the Year Ahead 7 “Safe-Haven” Dividend Stocks for Turbulent Times AMZN shares . Year-to-date, AMZN has gained 45.73%, versus a -5.82% rise in the benchmark S&P 500 index during the same period."}]}