{"article": [{"url": "https://stocknews.com/news/penn-dkng-sgms-czr-will-shares-of-penn-national-gaming-continue-to-rally/", "published": 1600776500.0, "headline": "Will Shares of Penn National Gaming Continue to Rally?", "body": "Penn National Gaming, Inc. (PENN) is a diversified entertainment company that owns and operates several race tracks and casinos across the country. It recently expanded into sports media and betting by acquiring a 36% stake in Barstool digital media for $163 million in January 2020. Barstool’s app was the #1 sports betting app in the Apple store following its launch, due to the app’s ease of use and ubiquity of Barstool on social media. Currently just available in Pennsylvania, Barstool is soon expected to be available in all states. PENN has gained more than 130% since the app’s launch, and more than 180% year-to-date. PENN is well-positioned to gain significantly in the upcoming months despite its impressive gains so far, with the kick-off of the NFL season and launch of Barstool Sportsbook. This, combined with several other factors, has helped the stock earn a “Buy” rating in our proprietary rating system. 7 Best ETFs for the NEXT Bull Market Here’s how our proprietary POWR Ratings system evaluates PENN: Trade Grade: A PENN is currently trading above its 50-day and 200-day moving averages of $48.76 and $30.48 respectively, indicating a golden-cross bullishness. It has gained 118.1% in the past three months, which reflects a short-term uptrend in the stock. PENN recently entered into a strategic partnership with Sportsradar, which allows it to use official NFL data on its sports betting platforms. This allows the company to display real-time scores and in-game wagering options to 66 million barstool fans and 20 million casino customers. PENN has launched its debut Barstool Sportbook app in Pennsylvania on September 18th and plans to expand its reach across the country. Buy & Hold Grade: B In terms of proximity to the 52-week high, which is a key factor that our Buy & Hold Grade takes into account, PENN is well-positioned. It is currently trading just 9.3% below its 52-week high of $76.62. PENN has gained 210.6% in the past three years, which can be attributed to its solid revenue growth. Net revenue increased at a CAGR of 10.5% over the past three years, while total assets grew at a CAGR of 42.3% over the same period. PENN’s impressive performance in the past few years was backed by surplus cash flows and a thriving economy, which increased the popularity of casinos and online sports. Peer Grade: A PENN is ranked #3 out of 22 stocks in the Entertainment – Casinos/Gambling industry. Other stocks in this industry include Draftkings, Inc. (DKNG), Scientific Games Corp. (SGMS), and Caesars Entertainment Corporation (CZR). While DKNG beat PENN by returning 381% year-to-date, SGMS and CZR gained 26.8% and 12.6%, respectively, over the same period respectively. Industry Rank: C The Entertainment – Casinos/Gambling industry is ranked #81 out of 123 industries in the StockNews.com universe. This industry has been significantly affected by the pandemic, as organized sports remained suspended for months, and casinos across the country remained closed. However, the industry is recovering steadily, as most sports tournaments are rescheduled to take place in the upcoming months and casinos are reopening. Also, with people being accustomed to the social distancing and stay-at-home norms, the online sports betting industry has gained significant popularity in recent months. Overall POWR Rating: B (Buy) Overall, PENN has a “Buy” rating due to its short-and-long-term bullishness, impressive past performance, solid price momentum, and favorable analyst sentiment, as determined by the four components of our overall POWR Rating. Bottom Line PENN is well-positioned to soar further after impressive gains this year, due to its continued business growth and favorable analyst sentiment. PENN has an average broker rating of 1.36, reflecting favorable analyst sentiment. Out of 14 Wall Street Analysts that rated the stock, 10 rated its “Strong Buy.” The company’s EPS is expected to grow at 42.6% per year over the next five years. Want More Great Investing Ideas? 7 Best ETFs for the NEXT Bull Market Is the Stock Market Correction Over? Chart of the Day- See the Stocks Ready to Breakout PENN shares were trading at $74.43 per share on Tuesday afternoon, up $4.35 (+6.21%). Year-to-date, PENN has gained 191.20%, versus a 3.54% rise in the benchmark S&P 500 index during the same period."}]}