{"article": [{"url": "https://stocknews.com/news/apd-shares-of-air-products-chemicals-apd-are-setting-up/", "published": 1598962100.0, "headline": "Shares of Air Products & Chemicals (APD) are Setting Up for a STRONG MOVE", "body": "An ascending triangle pattern has formed on the chart of Air Products & Chemicals (APD). APD is one of the leading industrial gas suppliers globally, with operations in 50 countries and 19,000 employees. The company is also the largest supplier of hydrogen and helium in the world. Growth in the company for the remainder of the year will be driven by investments in high-return projects, acquisitions, cost-cutting actions, and new business deals. Take a look at the 1-year chart of APD below with added notations: 9 \"BUY THE DIP\" Growth Stocks For 2020 Chart of APD provided by TradingView Over the past two months, APD has hit the $300 resistance (red) on two separate occasions, while also climbing a trend line of support (green). Together, these two lines have formed an ascending triangle on APD. Eventually, the stock will break either the $300 resistance or the trendline support. A trader could buy APD if it exceeds $300 with the expectation of a breakout or short sell the stock if it falls below the trendline, with the expectation of a breakdown. Want to Discover More Great Trades? I have explored virtually every flavor of technical analysis and chart pattern known to mankind. The sad fact is that the vast majority of them don’t work at all. That is why I recently put together this special report to help investors focus on the only 5 chart patterns that matter…the ones that lead to the most timely and profitable stock trades. Click below to get your copy now! 5 WINNING Stock Chart Patterns Have a good trading day! Good luck! Christian Tharp, CMT @cmtstockcoach APD shares were trading at $293.33 per share on Tuesday morning, up $1.07 (+0.37%). Year-to-date, APD has gained 26.35%, versus a 10.02% rise in the benchmark S&P 500 index during the same period."}]}