{"article": [{"url": "https://stocknews.com/news/nke-panw-payc-sfix-4-upgraded-stocks-winning-the-shutdown/", "published": 1594296500.0, "headline": "4 Upgraded Stocks WINNING the Shutdown", "body": "The market is moving sideways after a major bull run which lifted the S&P 500 (SPY) 45% higher over the last couple of months. From June, the S&P 500 has been range-bound between 3,000 and 3,200, and it’s currently right in the middle of this range. Many sectors connected to the “reopening” story like cruises, airlines, and hotels have been moving lower during the market’s sideways move. Of course, the biggest cause is the soaring number of COVID-19 cases in many parts of the country. However, certain stocks remain in accumulation and are seeing improved fundamentals. Either their underlying momentum and business model is so strong or they are benefitting from these particular set of conditions. 7 \"SAFE HAVEN\" Dividend Stocks for Turbulent TimesHere are some stocks that have been upgraded in our exclusive POWR Ratings system: Nike (NKE) NKE’s business has been disrupted by several factors, but the biggest is the shuttering of its retail outlets, where it makes the most sales. This caused the stock to miss earnings, and the stock declined by 7%. One silver lining of this report was that digital sales accelerated. NKE hit its digital, quarterly sales target for 2023. NKE is betting its long-term future on its digital channel to sell directly to consumers. In anticipation, it has been building out its supply chain and looking to build smaller stores that can serve as pickup locations for online orders. Through this, NKE believes it can increase customer loyalty and the lifetime value of each customer. The POWR Ratings upgraded NKE to a Strong Buy. It has an “A” for Trade Grade and Buy & Hold Grade with a “B” for Peer Grade and Industry Rank. Among Athletics & Recreation stocks, it’s ranked #1 out of 32. Analysts have an average price target of $110.70 for NKE, which is 13% above the current price. Palo Alto Networks (PANW) Businesses and governments alike require top-notch network security solutions to safely run applications on networks. PANW provides solutions for enterprise, advanced firewalls, and cloud-based applications. Its clients include major corporations, governments, and institutions. Given the increased movement to remote work and the growing importance of cloud computing for corporations, spending on cybersecurity is increasing. It’s not a surprise that PANW was upgraded to a Strong Buy. It has an “A” for Trade Grade, Buy & Hold Grade with a “B” for Peer Grade and Industry Rank. It’s ranked 6th of 23 in the Software – Security industry. Analysts are also bullish on the stock, giving it an average price target of $261.57 which is 6% above the current price. Paycom Software (PAYC) Cloud computing was already one of the fastest-growing parts of the economy, however, the pandemic is resulting in acceleration as remote work becomes increasingly common. PAYC provides cloud-based HR software facilitating the hiring, training, management, and compensation of employees. PAYC has an “A” in all of its POWR Components except for a “B” in Peer Grade. PAYC is ranked in the top quarter of Software – Application stocks. PAYC is up 90% from the March lows. Over the past month, it’s consolidated between $335 and $290. Given its exposure to the cloud industry, an upside breakout could have a powerful follow-through. PAYC’s revenue increased by more than 20% on a year-over-year basis and earnings increased by 12% in the first quarter. Look for PAYC to add even more clients during the pandemic as the company’s database for HR functions consolidates responsibilities in one central space. Stitch Fix (SFIX) Fashion is not exactly of the utmost importance now that most people are staying at home and interacting with others by way of webcam. However, the pandemic will not last forever. SFIX allows people to sort through fashion offerings delivered directly to their homes. Customers simply select the items they desire and return the rest. This is an ingenious business model that will prove even more profitable once society returns to normal and the desire for new clothing increases. SFIX has been a big winner during the pandemic, as it’s more than doubled off its March lows and is challenging its 52-week highs. SFIX is faring quite well at the moment simply because many retail stores are closed, and its business is unaffected. This is leading to more people trying the service, and it will likely be able to retain some of them. The spike in case counts in recent days also increases their chances to grow their business. The POWR Ratings have SFIX ranked 9th of 34 stocks on the Internet – Services space with an “A” for Trade Grade and Buy & Hold Grade. Want More Great Investing Ideas? 9 “BUY THE DIP” Growth Stocks for 2020 Is the Bull S#*t Rally FINALLY Over? 7 “Safe-Haven” Dividend Stocks for Turbulent Times Top 3 Investing Strategies for 2020 NKE shares were trading at $96.98 per share on Thursday afternoon, down $1.86 (-1.88%). Year-to-date, NKE has declined -3.77%, versus a -1.77% rise in the benchmark S&P 500 index during the same period."}]}