{"article": [{"url": "https://stocknews.com/news/vz-pfe-pm-3-value-stocks-with-4-plus-yields/", "published": 1602245300.0, "headline": "3 Value Stocks with 4% PLUS Yields", "body": "The last decade was dominated by growth stocks, with the technology sector taking the lead. When 2020 started grinding the world to a halt, some thought the time had come for value stocks to get their deserved attention. However, that hasn’t happened, and even during 2020, investor’s bent towards growth stocks has been quite prominent. The record-setting rally of the stock market post mid-March, has made it difficult for investors to find undervalued stocks, as the market’s rally sent prices of most stocks higher. However, the sell-off in September, due to investors’ concerns over stalled fiscal stimulus talks, the upcoming election, and new coronavirus cases in Europe, has opened the door to find value. Even if the correction doesn’t last long, the market is expected to remain volatile over the coming months. So, only considering stocks trading at attractive prices could prove risky. Looking for value stocks that also have a dividend yield, can reduce some of your risk. While a value stock could provide solid price appreciation over the long run, a dividend can help ensure steady income. 9 \"BUY THE DIP\" Growth Stocks For 2020Verizon Communications Inc. (VZ), Philip Morris International Inc. (PM), and Pfizer Inc. (PFE) are three such stocks that could offer you both income and price appreciation in the long run. Verizon Communications Inc. (VZ) VZ is one of the largest communication technology companies in the world. It provides technology, communications, information and entertainment products and services. The company offers voice, data and video services and solutions on its award-winning networks and platforms, delivering on customers’ demand for mobility, reliable network connectivity, security, and control. Recently, the company joined hands with CISCO to bring 5G-Enabled, MEC Solutions to Sports and Entertainment Venues. VZ also announced a new partnership with the Clinton Foundation to help college students develop leadership skills and to inspire them to create innovative, high-quality social impact projects. In the second quarter ending June 2020, VZ’s total operating revenue declined 5.1% year-over-year. This was a result of a significant fall in wireless equipment revenue in the Consumer and Business segments, primarily due to limited in-store engagement and the impact of COVID-19 on customer behavior. The company also introduced a Push-to-Talk Responder, for efficiently sharing and receiving data, voice, and, in the future, video content to more comprehensively respond to a crisis. The company was also named the official 5G and wireless partner of the Prudential Center. However, there have been 72,000 retail postpaid net additions, including 97,000 phone net additions and 199,000 postpaid smartphone net additions for the consumer segment. There have been 280,000 retail postpaid net additions, including 76,000 phone net additions for the business segment. The market expects the company’s revenue to grow 3.5% in the next year. EPS for the quarter came in at $1.18, surpassing the street estimate by 2.6%. The market expects EPS to grow 3.4% next year and at a rate of 1.6% per annum over the next five years. The company has been consistently paying quarterly dividends since 2000. Most recently the company paid a dividend of $0.63 on October 8th, which cumulates to an annual dividend of $2.46 and yields 4.1%. The 5-year dividend CAGR stands at 2.5%. VZ recorded free cash flow of $2.07 million in the last reported quarter, generated $14.7 billion in cash flow from operations and returned $2.5 billion to its shareholders in the form of dividends. In terms of valuation, VZ has a forward P/E of12.5, 31.5% lower than the sector median. The stock gained almost 60% since hitting its 52-week low at the end of March. How does VZ stack up for the POWR Ratings? A for Trade Grade A for Buy & Hold Grade A for Peer Grade A for Industry Rank A for Overall POWR Rating You can’t ask for better. The stock is also ranked #1 out of 25 stocks in the Telecom-Domestic industry. Philip Morris International Inc. (PM) PM is engaged in the manufacture and sale of cigarettes, smoke-free products, and associated electronic devices and accessories, and other nicotine-containing products in more than 180 markets outside the United States. With 46 manufacturing facilities around the world, the company has a well-balanced factory footprint. In addition, PM has agreements with 25 third-party manufacturers across 23 markets and 38 third-party cigarette hand-rolling operators in Indonesia, the largest tobacco market outside of China. For the quarter ending June 2020, PM generated total revenues of $6.7 billion, down 13.6% year-over-year. Market expects revenue to grow by 7.7% next year. EPS for the quarter was $1.29, which surpassed the consensus estimate by 17.3%. The market expects PM’s EPS to grow 11.2% next year and at a rate of 5.2% per annum over the next five years. The company has been consistently paying quarterly dividends since 2008. Most recently the company paid a dividend of $1.2 for the third quarter ending September 2020, which cumulates to an annual dividend of $4.80, and yields 6.1%. The 5-year and 10-year divided CAGRs stand at 3.6% and 7.5%, respectively. In fact, over the past six years, PM has issued more dividends than 97.7% of other dividend-issuing US stocks in the StockNews.com universe. PM recorded free cash flow of $1.15 million in the last reported quarter, generated $1.9 billion in cash flow from operations and returned $1.8 billion to its shareholders in the form of dividends. PM has a forward P/E of 15.56, 22.7% lower than the sector median. PM hit its 52-week high of $89.64 in late February before the onset of the pandemic, but lost 46% since then, hitting its 52-week low of $61.09 in March. Since then, the stock bounced back and by mid-September it was trading at $81.94, gaining almost 33%. The stock has gained 10.2% over the past three months to close yesterday’s trading session at $78.33. PM’s POWR Ratings reflect its promising outlook. It has an overall rating of “Buy” with a grade of “A” in Peer Grade and a “B” in Trade Grade and Buy & Hold Grade. Among the 9 stocks in the Tobacco industry, it’s ranked #1. Pfizer Inc. (PFE) PFE develops, manufactures, and sells healthcare products worldwide. It offers medicines and vaccines in various therapeutic areas, including cardiovascular metabolic, biologics, small molecules, immunotherapies, and biosimilars under the Ibrance, Sutent, Xtandi, Xalkori, Inlyta, Braftovi + Mektovi brands; and sterile injectable and anti-infective medicines under the Sulperazon, Medrol, Vfend, and Zithromax brands. PFE currently has 89 pipeline projects across six targeted therapeutic areas. Four of its programs are currently in the registration process, while 23 programs are in the phase 3 clinical trials. The company has initiated four different registration-enabling vaccine candidate programs since May 2020, including for pneumococcal 20-valent in infants, Meningococcal pentavalent, and respiratory syncytial virus for COVID-19. On October 7th, PFE and its Germany-based partner BioNTech SE (BNTX) began rolling submission of their mRNA-based coronavirus vaccine candidate BNT162b2 to the European Medicines Agency (EMA) to speed up its review process. On October 8th, PFE and OPKO Health Inc. (OPK) announced that C0311002, a Phase 3, randomized, multicenter, open-label, crossover study evaluating somatrogon dosed once-weekly in children 3 to <18 years of age with growth hormone deficiency (GHD), met its primary endpoint of improved treatment burden compared to GENOTROPIN® (somatropin) for injection administered once-daily. Top-line results from the study demonstrated that treatment with somatrogon once-weekly improved the mean overall Life Interference total score after 12 weeks of treatment, compared to treatment with somatropin administered once-daily. For the fiscal second quarter ending June 2020, the company reported total revenue of $11.8 billion, down 11% year-over-year. However, the company’s biopharma revenue increased 6% year-over-year. The market expects revenues to grow 4.1% next quarter and 9.5% next year. PFE reported EPS of $0.78 for the quarter, exceeding the street estimate by 18.2%. The market expects EPS to grow 10.9% next quarter, 11.3% next year, and at a rate of 5.4% per annum over the next five years. PFE has been consistently paying quarterly dividends since 1989. Most recently the company declared a dividend of $0.38, which cumulates to an annual dividend of $1.52, and yields 4.1%. The company’s 5-year and 10-year divided CAGRs stand at 6.7% and 6.1%, respectively. PFE recorded free cash flow of $0.55 million in the last reported quarter, generated $3.6 billion in cash flow from operations, and returned $2.1 billion to its shareholders in the form of dividends. PFE currently has a forward P/E of 12.8, 52.2% lower than the sector median. PFE’s POWR Ratings reflect its promising outlook. It has an overall rating of “Buy” with an “A” for Trade Grade and Peer Grade, and a “B” for Buy & Hold Grade and Industry Rank. Among the 239 stocks in the Medical – Pharmaceuticals industry, it’s ranked #12. Want More Great Investing Ideas? 7 Best ETFs for the NEXT Bull Market What is the Cure for Stock Market Volatility? Chart of the Day- See Christian Tharp’s Stocks Ready to Breakout VZ shares were trading at $59.20 per share on Friday afternoon, up $0.01 (+0.02%). Year-to-date, VZ has gained 0.63%, versus a 9.30% rise in the benchmark S&P 500 index during the same period."}]}