{"article": [{"url": "https://stocknews.com/news/cgen-cers-mrsn-ptgx-4-biotech-stocks-under-20-analysts-love/", "published": 1597752500.0, "headline": "4 Biotech Stocks Under $20 Analysts Love", "body": "Wall Street analysts keep a close eye on price movement, performance, valuation, and recent developments of the stocks they cover. So, many investors follow what the majority analysts recommend. This is actually a good strategy as the consensus usually isn’t wrong. If you want to pick a few stocks following consensus recommendations of Wall Street analysts, you may take a look at the Biotech industry. That’s because the ongoing health crisis is expected to keep boosting the already-high demand for biotech products. The industry is currently in a recovery phase as evident from the SPDR Series Trust SPDR S&P Biotech ETF’s (XBI) year-to-date gain of 19.9%. This compares to 6.1% gain of SPDR S&P 500 (SPY), over the same time period. 9 \"BUY THE DIP\" Growth Stocks For 2020While the ever-increasing demand for biotech products will keep driving the industry’s growth, there are some stocks that are currently trading at reasonable prices and could offer intriguing upside. Wall Street analysts are in 100% agreement on the potential upside of Compugen Ltd. (CGEN), Cerus Corporation (CERS), Mersana Therapeutics, Inc. (MRSN) and Protagonist Therapeutics, Inc. (PTGX). Compugen Ltd. (CGEN) CGEN is a clinical-stage therapeutic discovery and development company, which is currently available at a price of $18, despite growing more than 160% since its March lows. The market expects the company to report a loss per share of $0.09 for the quarter ending September 2020, which represents a slight improvement over the year-ago loss per share $0.1.Three out of three Wall Street Analysts have a Buy rating on the stock. Evaluation of the company’s DNAM axis hypothesis is on-track for the second half of 2020, due to the initiation of a triple combination study. Patients are also getting enrolled in the COM701 Phase 1 monotherapy biomarker-driven expansion study. In the second quarter, net loss per share decreased to $0.08 from $0.10 per share a year ago. Moreover, cash, cash related accounts, and short-term and long-term bank deposits increased to $136 million from $44 million, as of December 31st 2019. How does CGEN stack up for the POWR Ratings? A for Trade Grade A for Buy & Hold Grade A for Peer Grade A for Overall POWR Rating You can’t ask for better. The stock is also ranked #13 out of 344 stocks in the Biotech industry. Cerus Corporation (CERS) CERS is a biomedical products company which is currently trading at $7.07 after returning more than 85% since its March lows. CERS has an average analyst price target of $9.50, which is 34.4% higher than its current price. Three out of three Wall Street analysts have a Buy rating on the stock. The CERS INTERCEPT Blood Systems disposable kit shipments have crossed 7.5 million treatable platelet and plasma doses globally since the commercial launch. The company has been awarded a five-year tender by the Hong Kong Red Cross Blood Transfusion Services (BTS) for INTERCEPT Blood Systems. Furthermore, earlier last month, CERS announced successful inactivation of Covid-19 with the INTERCEPT blood system for plasma. In the second quarter, total revenue increased 19.1% year-over-year, and net loss reduced to $14.9 million, as compared to $17.6 million in the year-ago quarter. CERS’s consensus revenue estimate of $28.55 million for the quarter ending September 2020 indicates a year-over-year increase of 25.2%. The market expects the company to report a loss per share of $0.1 for the quarter ending September 2020, which would indicate an improvement over the year-ago loss per share of $0.13. It’s no surprise that CERS is rated a Strong Buy in our POWR Ratings system. It also has a grade of A for Trade Grade, Buy & Hold Grade, and Peer Grade. In the 344-stock Biotech industry, it is ranked #14. Mersana Therapeutics, Inc. (MRSN) MRSN is a clinical-stage biopharmaceutical company that has grown more than 300% since its March lows, and is currently available at a price of $19.48. Five out of five Wall Street analysts have a Buy rating on the stock. The average analyst price target is $26.20, which is 34.5% higher than its current price. MRSN recently received FDA Fast Track Designation for XMT-1536 for treatment of Platinum-resistant ovarian cancer patients. Moreover, the company’s first-in-class ADC targeting B7-H4 is on track for candidate selection in the second half of 2020. MRSN has an impressive earnings surprise history with the company surpassing consensus EPS estimates in three of the trailing four quarters. The market expects the company to report a loss per share of $0.3 for the quarter ending September 2020. This represents an improvement over the year-ago loss per share of $0.35. MRSN’s consensus revenue estimate of $490,000 for the quarter ending September 2020 indicates a year-over-year increase of 69%. MRSN has a Peer Grade of B” in our POWR Ratings system. In the Biotech industry, it’s ranked #86 out of 344 stocks. Protagonist Therapeutics, Inc. (PTGX) PTGX is currently trading at $16.50 after gaining more than 140% since its March lows. Three out of three Wall Street analysts have a Buy rating on the stock. The average analyst price target is $28.33, which is 71.7% higher than its current price. Chief Executive Officer of PTGX, Dinesh V. Patel said, “We have succeeded in bringing three differentiated candidates from de novo discovery into Phase 2 development. Each of these candidates has unique attributes that address specific unmet needs in diverse diseases, such as blood disorders with PTG-300 and inflammatory bowel disease with PTG-200 and PN-943.” PTGX’s license and collaboration revenue was $6.2 million in the second quarter as compared to negative $8.2 million, in the previous year. The company also narrowed down its net loss in the quarter. The loss came in at $19.4 million, compared to $29.2 million a year ago. PTGX’s POWR Ratings reflect this promising outlook. It has an overall rating of Buy with a grade of A for Trade Grade, Peer Grade, and Industry Rank. Among the 215 stocks in the Medical-Pharmaceuticals industry, it’s ranked #32. Want More Great Investing Ideas? The Best of StockNews 3 Possible Directions for the Stock Market from Here 9 “BUY THE DIP” Growth Stocks for 2020 CGEN shares were trading at $17.66 per share on Tuesday afternoon, down $0.34 (-1.89%). Year-to-date, CGEN has gained 196.31%, versus a 6.36% rise in the benchmark S&P 500 index during the same period."}]}