{"article": [{"url": "https://stocknews.com/news/so-aep-duk-3-dividend-stocks-to-protect-your-portfolio-from-another-market/", "published": 1601294900.0, "headline": "3 Dividend Stocks to Protect Your Portfolio from Another Market Crash", "body": "The economy is in a recession after recent GDP numbers confirmed a drastic fall in consumer spending amid high employment rates. The COVID-19 pandemic has hit several sectors that include airline, hospitality, retail, tourism, and energy. While technology stocks have been somewhat immune to the pandemic these companies are already trading at a premium valuation. So, in case the market crashes again, there is a good chance for tech stocks to move significantly lower. In case you are looking to recession-proof your portfolio, you need to identify companies that are non-cyclical and that can generate a steady stream of cash flows across business cycles. Companies in the utility sector tick most of these boxes. Utility companies provide essential services, have a low beta, and are part of a regulated industry. This helps them generate predictable cash flows and sustain or even increase dividend payouts in a sluggish macro environment. 9 \"BUY THE DIP\" Growth Stocks For 2020Here we look at three dividend-paying utility giants that should be on the radar of investors who are worried about a market crash. Southern Company has a dividend yield of 4.8% Southern Company (SO) is one of the largest energy companies in the U.S. and serves 9 million customers. It has a portfolio of electric operating companies in three states, natural gas distribution companies in four states, a competitive generating company that serves wholesale customers, an energy infrastructure company, and a fiber optics network. Southern Company has increased dividends every year since 2001. It recently increased its payout by $0.08 per share which means its annual payout is $2.56 per share, indicating a forward yield of 4.8%. The company expects adjusted earnings between $3.10 and $3.22 which indicates a payout ratio between 79% and 82%. Southern Company has an investment-grade balance sheet. However, analysts are concerned over its Georgia Power subsidiary that has allocated $8.5 billion in capital expenditure to building two nuclear power units. However, the nuclear project has been delayed and the funding costs have increased higher over time. Southern Company is also investing heavily in clean energy which will increase capital costs going forward as well. Southern Company has been a top dividend growth stock in the last two decades. However, its high payout ratio, massive debt, and billion-dollar investments might not enable the company to grow dividends at an enviable rate in the upcoming decade. American Electric Power Company has a dividend yield of 3.45% The second stock on the list is American Electric Power (AEP) which is an electric utility holding company in the U.S. Its operating companies generate, transmit and distribute services to over 5.5 million retail customers in 11 states. The company’s subsidiaries operate an extensive portfolio of assets that include 221,000 miles of distribution lines, 40,000 circuit miles of transmission lines, and 22,000 megawatts of regulated generating capacity. In 2019, the company generated revenue of $15.6 billion with operating earnings of $2.1 billion indicating adjusted earnings per share of $4.24. Analysts expect the company to post revenue of $15.7 billion with earnings of $4.33 per share in 2020. Given AEP’s dividend per share of $2.8, its payout ratio stands at 65% which is in line with the industry average. Analysts expect AEP earnings to grow at an annual rate of 5.6% in the next five years, which will help the company increase dividends in the next few years. Further, it also adjusted it’s capital spending higher during its five-year capital forecast period to $35 billion, up from $33 billion. Analysts tracking AEP have a 12-month average target price of $92.4 which is 14% higher than the current trading price. If you account for its dividend yield of 3.5%, the total returns will be closer to 18% making it a top bet right now. Duke Energy has a forward yield of 4.7% Another utility stock for your portfolio is Duke Energy (DUK), a company that has paid dividends for 94 consecutive years. Similar to other utility companies, Duke enjoys a monopoly in several markets and 95% of its earnings are regulated. Duke Energy is one of the largest electric power holding companies in the U.S. and provides electricity to 7.7 million retail customers in six states. It has 51,000 megawatts of electric generating capacity in the Carolinas, the Midwest, and Florida, and natural gas distribution services that serve over 1.6 million customers in Ohio, Kentucky, Tennessee, and the Carolinas. Duke owns and operates power generation assets in North America that include a portfolio of renewable energy assets as well. The company has outlined a five-year capital program of $56 billion and expects utilities rate base growth rate of 6% as well as earnings growth between 4% and 6%. Duke pays $3.86 in annual dividends indicating a payout ratio of 76% given expected earnings of $5.08 in 2020. Analysts tracking the stock have a 12-month average target price of $92.29 which is 12% above its current trading price. The final takeaway The above three companies will not generate market-beating returns for investors. However, they provide a semblance of certainty and are defensive picks amid an environment that is highly uncertain and volatile. Utility stocks have survived multiple recessions and might be considered boring investments. However, in an economic slowdown, it is better to hold onto stocks with low volatility that are unlikely to cut dividends. Utility companies are also capital intensive which means they will have high debt on their balance sheet. So, investors should not expect dividends to rise at an exponential rate. Dividend growth will instead be slow and steady given the already high payout ratios. If you have a low risk appetite and are eying a steady stream of dividend income, investing in utility companies makes perfect sense. An investment of $5,000 in each of these companies will generate close to $650 in annual dividend income. Want More Great Investing Ideas? 7 “Safe-Haven” Dividend Stocks for Turbulent Times When Does the Next Bull Run Start? Chart of the Day- See the Stocks Ready to Breakout SO shares were trading at $54.38 per share on Monday morning, up $0.57 (+1.06%). Year-to-date, SO has declined -11.82%, versus a 5.13% rise in the benchmark S&P 500 index during the same period."}]}