{"article": [{"url": "https://stocknews.com/news/spy-qqq-stne-pags-2-under-the-radar-fintech-stocks/", "published": 1594382900.0, "headline": "2 Under-the-Radar Fintech Stocks", "body": "The “Nasdaq 100 (QQQ)” has been on fire with one of the hottest sectors being digital payment platforms. Shares of “Square (SQ)” and “Paypal (PYPL) are up 92% and 87%, respectively, since their March lows. While they still have a bright future, their story is well known and the stocks seem fully valued. Instead, I’m looking at 2 under-the-radar fintech stocks that operate outside the U.S. as overlooked gems offering a great way to play digital payment platforms. The growth of mobile payments is well documented and the choice of platforms for both users and investors is large. But, there’s a pair of Brazilian-based companies that present a largely untapped market. Overall, mobile payments, in which everything from pure-play credit card firms like SQ and PYPL to digital wallets like “Apple (AAPL)” Pay, had been growing by some 30% per year through 2019, have now accelerated in the wake of the pandemic. 7 \"SAFE HAVEN\" Dividend Stocks for Turbulent TimesBut, some areas are growing faster than others. Emerging economies have been growing at nearly double the rate of development thanks to several key factors; emerging economies have a large unbanked population, as banking services are either not available or unaffordable. In many regions, the adoption or reliance of smartphones is a fundamental necessity for communication and transactions. Mobile payments fulfill the demand for cheaper, faster, and convenient services, traditional payment service providers, such as banks and credit card companies, are facing major challenges. Traditionally, to accept credit cards, businesses needed the assistance of banks or landline telephone. Mobile payment systems have done away with this requirement, making them ideal for mobile market vendors. Furthermore, unlike bank credit cards, mobile payment does not have to ensure a fixed volume of transactions to qualify for an account, making it ideal for small businesses. My belief is that Brazil presents the greatest opportunity in this sector and two companies, “Stone Capital (STNE)” and “PagSeguro (PAGS)” are best positioned to benefit. Unlike SQ and PYPL which are now behemoths with market capitalizations of $56 billion and $220 billion STNE and PAGS are relatively small with market caps of just $6 billion and $12 billion respectively. Meaning as they grow and get discovered by money managers it will only take incrementally fewer investment dollars to move the stocks much higher. The fact that the current growth rate of Brazil’s mobile payments is below many markets such as China and India should be viewed as a positive is just now entering the acceleration or ‘curve in the hockey stick’ phase of adoption and penetration. Brazil is a geographically vast country, of continental proportions, composed of more than 5,500 cities and 200 million people to date. Its population skews young with a median age of just 34. According to Neoway, there are approximately nine million small and medium businesses (SMBs) in Brazil who are trying to grow in the context of a high-cost banking environment and overcome the infrastructure challenges that such vast geography imposes. Overall, the country is less penetrated and has greater growth upside than more mature economies. According to the World Bank and ABECS, electronic payments volume represented 28.4% of Brazil’s total household consumption in 2016. This penetration percentage is lower than comparable measures of 46.0% and 68.6%, respectively in the U.S. and the U.K. The growth rate for e-commerce is a relatively slow 8% — peer-to-peer payments are growing by some 18% annually. But, this just highlights the opportunity. StoneCo is a leading provider of financial technology solutions that empower merchants and integrated partners to conduct electronic commerce seamlessly across in-store, online, and mobile channels in Brazil. Its platform allows its clients to get paid quickly and easily. They also provide digital product enhancements such as split-payment processing, multi-payment processing, recurring payments for subscriptions, and one-click buy functionality for its clients. Its focus is on merchants who have larger businesses and it has a large support staff of sales and customer service personnel in order to provide a customer-oriented business model. By contrast, PagSeguro is focused on the micro business and the consumer side of the equation. Its platform provides day-to-day financial needs, including receiving and spending funds. Both companies had initial public offerings within the past two years. Stone can boast Warren Buffet’s Berkshire as a recent investor—and I think they both will prove to be good long-term investments. To learn more about Steve Smith’s unique trading approach, and access to his highly-acclaimed Options360 course, click here. Want More Great Investing Ideas? 9 “BUY THE DIP” Growth Stocks for 2020 Is the Bull S#*t Rally FINALLY Over? 7 “Safe-Haven” Dividend Stocks for Turbulent Times Top 3 Investing Strategies for 2020 SPY shares were trading at $315.35 per share on Friday afternoon, up $0.97 (+0.31%). Year-to-date, SPY has declined -1.01%, versus a % rise in the benchmark S&P 500 index during the same period."}]}