{"article": [{"url": "https://stocknews.com/news/nvda-pypl-dxcm-wst-the-4-best-performing-stocks-on-the-sp-500-year-to-date/", "published": 1596715700.0, "headline": "The 4 BEST Performing Stocks on the S&P 500 Year-to-Date", "body": "As the coronavirus’s spread began accelerating and economies were shutting down, stock markets collapsed, falling to multi-year lows. The S&P 500 plunged from a high of 3,393 on February 19th to a low of 2,191 on March 23rd, for a 35.4% loss in 33 days. From the March lows, the index has recovered the bulk of these losses and is less than 2% away from previous highs. Yet, there’s wide variance, in terms of individual performance. Sectors, like travel and financials, have barely recovered, while technology and healthcare are making new highs. The winning stocks share above-average growth rates that were unaffected by the pandemic’s disruptions. NVIDIA Corporation (NVDA), PayPal Holdings, Inc. (PYPL), DexCom, Inc. (DXCM), and West Pharmaceutical Services, Inc. (WST) are the best-performing stocks year to date in the S&P 500. 7 Best ETFs for the NEXT Bull MarketNVIDIA Corporation (NVDA) NVDA builds and sells chips for graphics processing, gaming, servers, AI, crypto, and other types of computing. It’s benefitted from the rapid growth of cloud computing. The company completed the acquisition of Mellanox Technologies Limited, a multinational supplier of end-to-end Ethernet and InfiniBand intelligent interconnect solutions, in the last quarter. The deal expanded NVDA’s cloud and data center opportunities. NVDA had an excellent first quarter for fiscal 2021. The top-line for the quarter ended April, was up 39% year over year to $3.08 billion and its Record Data Center business revenue of $1.14 billion was up 80% from the comparable quarter last year. The company also authorized a share repurchase program up to $7.24 billion. Hence, the street is optimistic about its second-quarter financial report, scheduled for later this month. Consensus EPS stands at $1.97, indicating a year-over-year increase of 58.9%. Moreover, the company has been consistently delivering earnings surprises for the trailing four quarters. Its 90% year to date gain compares favorably to the Nasdaq and S&P 500’s 21.9% and 3.3% respective YTD gains. How does NVDA stack up for the POWR Ratings? A for Trade Grade A for Buy & Hold Grade A for Peer Grade A for Industry Rank A for Overall POWR Rating You can’t ask for better. The stock is also ranked #2 out of 86 stocks in the Semiconductor & Wireless Chip industry. PayPal Holdings, Inc. (PYPL) PYPL is a digital payments platform. With over 346 million active users globally, PYPL is available in more than 200 markets around the world, enabling consumers and merchants to transact in more than 100 currencies, withdraw funds in 56 currencies, and hold balances in their PayPal accounts in 25 currencies. Consistent with the social distancing era, PYPL rolled out a QR code payment system. This new feature enabled touch-free, one-time scan, quick and safe transactions. Additionally, the company waived off its standard seller transaction fees in efforts to assist customers amid the pandemic. PYPL added more than 21.3 million new accounts in the second quarter of 2020. This is a 137% increase year over year. The company also witnessed a total payment volume (TPV) of $222 billion, the highest TPV generated in a quarter in the history of PYPL. Free cash flow stood $2.19 billion, or 42% of the revenue, which is a 112% increase from the comparable quarter last year. To strengthen its liquidity, the company issued $4 billion worth of senior notes in the preceding quarter. PYPL is expecting to grow its revenue by 22.7% in the current quarter and is expecting to add close to 70 million active users by the end of its financial year. Year to date, the stock has gained more than 87% and could witness further upside given changes in the economy, and the market’s appetite for Internet stocks. PYPL’s strong momentum is reflected in its POWR Ratings, it has a “Strong Buy” rating with an “A” in Trade Grade, Buy & Hold Grade, Peer Grade, and Industry Rank. Within the Consumer Financial Services group, it’s ranked #1 out of 45 stocks. DexCom, Inc. (DXCM) DXCM focuses on the design, development, and commercialization of continuous glucose monitoring (CGM) systems for patients with diabetes. A leader of diabetes care technology, DXCM turned challenges into an opportunity for growth. In April, the company announced a patient assistance program to aid U.S. customers who have lost insurance due to the COVID-19 pandemic. Moreover, it made its CGM systems available to hospitals during the emergency. Hence, the second quarter for the company witnessed strong patient volume growth. Constant currency revenues grew 34% year over year to $452 million because of new pharmacy channels and customer access initiatives. DXCM consistently beat earnings estimates in the trailing four quarters. It’s no surprise that DXCM is up more than 100% year to date compared to the 3.3% year-to-date gain of the S&P 500. DXCM’s POWR Ratings reflect this promising outlook. It has an overall rating of “Strong Buy” with an “A” for Trade Grade, Buy & Hold Grade, Peer Grade, and Industry Rank. It is ranked #4 of 132 stocks in the Medical – Devices & Equipment industry. West Pharmaceutical Services, Inc. (WST) WST is a global manufacturer in the design and production of technologically advanced, high quality, integrated containment, and delivery systems for injectable medicines. Based in Pennsylvania, the company distributes its products through its sales force and distribution network, as well as contract sales agents and regional distributors. The company apprehended a significant milestone with its inclusion in the S&P 500 index in May. WST has its footprint in over 50 locations worldwide including 25 manufacturing facilities. Based on its 2019 annual sales, the company utilized its capacity to manufacture over 100 million components per day. Moreover, the 2019 annual sales stood $1.84 billion. The company has four straight quarters of beating earnings. WST reported an EPS of $1.25 for the second quarter, beating the consensus estimate by 37.4%. The top-line grew 12.2% year over year to $527.2 million with a 14.3% improvement in organic sales. The company further plans to invest in its business with digital technology and automation, estimating the year’s sales to reach the $2 million mark. WST is currently trading at $274.65. It has returned more than 120% from its March lows and has gained more than 80% year to date. According to the POWR Ratings, WST is a “Strong Buy.” It also has an “A” for Trade Grade, Buy & Hold Grade, and Peer Grade. It’s ranked #8 out of 132 Medical – Devices & Equipment stocks. Want More Great Investing Ideas? 9 “BUY THE DIP” Growth Stocks for 2020 How to Trade THIS Stock Bubble? 7 “Safe-Haven” Dividend Stocks for Turbulent Times NVDA shares fell $0.42 (-0.09%) in after-hours trading Thursday. Year-to-date, NVDA has gained 92.90%, versus a 4.94% rise in the benchmark S&P 500 index during the same period."}]}