{"article": [{"url": "https://stocknews.com/news/pfe-mrk-pfizer-vs-merck-which-stock-is-a-better-buy/", "published": 1602072500.0, "headline": "Pfizer vs. Merck: Which Stock is a Better Buy?", "body": "Pfizer, Inc. (PFE) and Merck & Company, Inc. (MRK) are two of the leading pharmaceutical companies that are in the race for a coronavirus vaccine. With significant progress reported in the past few weeks, both companies have the enormous growth potential in the upcoming months. Both stocks have generated decent returns over the last five years. However, MRK is the clear winner with more than 57% gain over this period, versus PFE’s 10.9%. Yet, on a year-to-date basis, MRK lost 12.5% versus PFE’s 7.6%. So, which stock is the better buy now? Let’s find out. 9 \"BUY THE DIP\" Growth Stocks For 2020Latest Movements PFE currently has 89 pipeline projects across six targeted therapeutic areas. Four of its programs are currently in the registration process, while 23 programs are in its phase three clinical trials. The company aims to deliver 25 breakthrough medicines by 2025, which is expected to drive its revenue by more than $15 billion over this period. PFE also has vested interests in the development of a Covid-19 vaccine, with a strategic partnership with BioNTech SE. PFE and BioNTech jointly developed BNT162 mRNA-based vaccine, which is currently in Phase 3 clinical trials. PFE is also testing the efficacy of an investigational therapeutic for Covid-19, which is currently in Phase 1b of its clinical trials. The company aims to deliver 5 vaccines, three gene therapies and 14 oncology drugs within the next five years. MRK is one of the biggest names in the field of cancer drug research. It’s biggest drug invention to date is KEYTRUDA, which is used in immunotherapy for multiple cancer treatments. MRK applied its expertise to find a vaccine for Covid-19. Though the company appears to be lagging behind its competitors, it is pursuing a different strategy as it wants to offer a one-shot solution. It currently has two Covid-19 vaccines in its pipeline – V590 and V591, and the company is expected to commence clinical trials in the fiscal third quarter of 2020. MRK partnered with Ridgeback Biotherapeutics to develop an antiviral drug. MRK acquired Austrian company Themis Bioscience for COVID vaccine development and plans to roll out the product by April 2022. This vaccine could provide MRK a breakthrough to branch out to research and develop medications for a plethora of diseases in the future. MRK also partnered with the International AIDS Vaccine Initiative for this purpose. Recent Financial Results PFE was significantly affected by the coronavirus disruption, leading to decline in key financial metrics the second quarter ended June 2020. However, it managed to generate $11.80 billion in revenue and $0.78 adjusted EPS during this quarter. PFE’s revenue from the Biopharma sector increased 4% year-over-year to $9.80 billion. MRK’s sales from KEYTRUDA grew 29% year-over-year to $3.40 billion in the second quarter ended June 2020. Its net income increased 12% from the year-ago value to $3 billion, while EPS rose 15% from the prior year quarter to $1.18. Hence, MRK has an edge over FPE in terms of year-over-year improvement in financials. Past and Expected Financial Performance PFE’s EPS grew at a CAGR of 22.8% over the past three years. The market expects the company’s EPS and revenue to grow at 11.4% and 9.5% next year. Its EPS is expected to grow at 5.4% per annum over the next five years. MRK’s EPS grew at a CAGR of 30.5% over the past three years. The market expects MRK’s EPS and revenue to increase 10.9% and 7.5% next year. The company’s EPS is expected to grow at a rate of 6.3% per annum over the next five years. In terms of earnings and revenue outlook, PFE is in an advantageous position here. Profitability PFE’s trailing 12-month revenue is 1.04 times what MRK generates. PFE is also more profitable with a gross margin of 80.4% versus MRK’s 71.9%. However, MRK’s ROE and ROA of 37.9% and 11.2% compares favorably with PFE’s 22.8% and 5.5%, respectively. Valuation In terms of forward P/E, PFE is currently trading at 17.2x, 2.6% more expensive than MRK’s 16.77x. However, in terms of forward PEG, PFE is 16.4% less expensive than MRK (1.52x versus 1.77x). MRK’s trailing 12-month P/S of 4.29x is 5.1% higher than PFE’s 4.08x. Also, in terms of trailing 12-month price/ cash flow, MRK’s 15.38x is more expensive than PFE’s 13.43x. Thus, PFE is a more affordable option between the two stocks. POWR Ratings Both PFE and MRK are rated “Buy” in our proprietary POWR Ratings system. Here’s how the four components of overall POWR Rating are graded for both stocks: PFE has an “A” for Peer Grade, and “B” for Trade Grade, Buy & Hold grade and Industry Rank. It also is ranked #12 out of 239 stocks in the Medical- Pharmaceuticals sector. MRK has an “A” for Peer Grade, and “B” for Trade Grade, Buy & Hold grade and Industry Rank. In the 239-stock Medical- Pharmaceuticals industry, it is currently ranked #11. The Winner While both PFE and MRK are well positioned to gain substantially in the upcoming months owing to their underlying industry strength and favorable earnings and revenue outlook, PFE is the better buy based on the factors discussed here. Want More Great Investing Ideas? Do NOT Buy Stocks Before the Election! 7 “Safe-Haven” Dividend Stocks for Turbulent Times Chart of the Day- See Christian Tharp’s Stocks Ready to Breakout PFE shares were trading at $36.39 per share on Wednesday afternoon, up $0.22 (+0.61%). Year-to-date, PFE has declined -4.31%, versus a 7.50% rise in the benchmark S&P 500 index during the same period."}]}