{"article": [{"url": "https://stocknews.com/news/sap-nuan-dava-mjco-is-sap-a-good-stock-to-buy/", "published": 1600085300.0, "headline": "Is SAP a Good Stock to Buy?", "body": "SAP SE (SAP) develops and provides analytics and application software for enterprises worldwide. It also provides software-related services. Roughly 77% of the world’s transaction revenue goes through an SAP system. SAP’s forte is enterprise resource planning software or ERP. Companies of varying sizes in all sorts of niches use SAP’s software solutions to obtain insights and make prudent, well-informed decisions and run as an intelligent enterprise. With the robust growth in people going digital amid the pandemic, demand for SAP’s products and services increased exponentially. The stock gained 19% year-to-date and hit its 52-week high of $169.3 earlier this month. The company has recently announced that it has been named a leader in SaaS and Cloud Finance. In the second quarter, the top-line increased 2%, and the earnings per share were up 54%, year-over-year. Operating cash flow and free cash flow grew significantly and the company increased its dividend payout by 3.6% during the quarter. This impressive performance and the potential upside based on several factors have helped it earn a “Strong Buy” rating in our proprietary rating system. 7 Best ETFs for the NEXT Bull MarketHere is how our proprietary POWR Ratings system evaluates SAP: Trade Grade: A SAP is currently trading near its 50-day moving average of $159.62 but higher than its 200-day moving average of $134.72, indicating that the stock is in an uptrend. The stock’s 22.6% return over the past three months reflects a solid short-term bullishness. SAP has been witnessing continued high demand for its digital supply chain, e-commerce, cloud platform, and Qualtrics solutions, as the “new normal” way of working and learning are increasing dependence on its products and services. SAP’s last earnings report showed that the number of cloud deals orders, in transactions, increased 21.3% quarter-over-quarter. Cloud revenue grew 21% year-over-year. Buy & Hold Grade: A SAP is well-positioned in terms of proximity to its 52-week high, which is a key factor that our Buy & Hold Grade takes into account. The stock is currently trading just 6.1% below its 52-week high. The stock has gained close to 50% in the last three years due to its steady growth in user base and stable cash flows. It has an impressive long-term performance history, as its revenues grew at a CAGR of 6.6% over the past three years. In words of Christian Klein, CEO of SAP, “More than ever, the pandemic has proven that digitalization is no longer an option but a must-have to withstand challenging times and to achieve desired business outcomes.” Peer Grade: A SAP is currently rated #1 out of 92 stocks in the Software – Application industry. Other popular stocks in the industry are Nuance Communications, Inc. (NUAN), Endava plc (DAVA), and Majesco (MJCO). While NUAN and MJCO beat SAP year-to-date by gaining 72.7% and 93.8%, respectively, DAVA returned 13.3%, over this period. Industry Rank: A The Software – Application industry is ranked #10 out of the 123 StockNews.com industries. Since the onset of the health crisis, remote working, and learning culture amplified the dependence on digital infrastructure, resulting in an operational challenge for firms that were less dependent on technology. This situation has created enormous opportunities for the software industry. The major software companies rose to the occasion and are catering to the needs of all other industries. Overall POWR Rating: A (Strong Buy) Overall, SAP is rated a “Strong Buy” due to its impressive past performance, short-and-long-term developments, and solid price momentum, as determined by the four components of our overall POWR Rating. Bottom Line SAP has soared 19% so far this year and is a decent investment for investors looking for stable dividends along with growth in the long run. It was hit hard earlier this month in the rapid technology sell-off but has the potential to grow further based on its continued business growth and favorable earnings. Analyst sentiment, which gives a good sense of a stock’s future price movement, is pretty impressive for SAP. The average broker rating of 1.5 indicates a favorable analyst sentiment. Of the 13 Wall Street Analysts that rated the stock, 7 have given it a “Strong Buy” rating. The market expects EPS for the current year to rise 16.4% from the year-ago value. Want More Great Investing Ideas? 7 Best ETFs for the NEXT Bull Market Is the Stock Market Correction Over? Chart of the Day- See the Stocks Ready to Breakout SAP shares were trading at $160.75 per share on Monday afternoon, up $1.18 (+0.74%). Year-to-date, SAP has gained 21.23%, versus a 6.54% rise in the benchmark S&P 500 index during the same period."}]}