{"article": [{"url": "https://stocknews.com/news/spy-inx-dia-iwm-qqq-why-stocks-could-drop-20-in-september/", "published": 1598530100.0, "headline": "Why Stocks Could Drop 20% in September?", "body": "(Please enjoy this updated version of this week’s commentary from the Reitmeister Total Return newsletter). Our game plan to ride the stock bubble higher is going swimmingly well here in August. Investors merrily hit the buy button as stocks touched the all time record at 3,393 and now we are nearly 2% higher. The bulk of those gains are going to already inflated tech stocks. Gladly we are overweight the group allowing us to enjoy ample gains. Now the question is whether September will follow the script we discussed in our last weekly commentary. The short version is to see the bubble finally burst and stocks falling back to a more reasonable range (2,500 to 2,700) given the still scary economic outlook. Since we are now just a week away from September, then now is a good time to review our plans so we are ready to act when the time comes. 9 \"BUY THE DIP\" Growth Stocks For 2020Market Commentary Our August/September game plan was first, and most completely, explained in the 8/3/20 RTR Members Only webinar. Here is the bullet point section of the ground covered: * Why I call this market a “mini-bubble” * Why bubble not last 3+ years like late 1990’s? * What will bring this bubble to an end? And likely when? * Presidential Election pattern a negative for stocks * Delayed election results a serious concern which could cause MARKET MAYHEM This game plan explains why we loaded up on tech stocks as the group with clear leadership at this time. Sure there were days since then where the group saw some painful profit taking. But we never blinked as it was obvious that investors would eventually rotate back to the group to help lead the charge higher. That party continues this week with the Nasdaq way out in front of the pack. Last week’s commentary was also used to keep us all on track. That being to applaud the recent gains as we are handily beating the market averages. Yet to stay sober enough to realize that these delightful gains will become a fleeting fantasy as the bubble gets ready to burst. That is why I shared this 2 step plan for us getting back into a more defensive shell as the odds stack up against stocks in September. “First stage = take profits off the table of the most Risk On positions. Second stage = add inverse ETFs to profit from market downside. But no sense buying them until there is some sign that indeed other investors are willing to concede to the weak fundamentals. Or fall into the Presidential Election sell off pattern. So this move is contingent on seeing early signs of an actual sell off forming.” The problem with a bubble is that the gains come SO EASILY that we get seduced into a false belief that the good times will last forever. That is why I want to, once again, share the reasons why this stocks should head lower in September. * Why I call this market a “mini-bubble” * Why bubble not last 3+ years like late 1990’s? * What will bring this bubble to an end? And likely when? * Presidential Election pattern a negative for stocks * Delayed election results a serious concern which could cause MARKET MAYHEM Watch the full 8/3/20 webinar if you have not already: click here to watch. Yet here is one more reason for concern at this time that I did not mention on that webinar, but did bring up in last week’s commentary. That being how the return to school presented a serious increased risk of Covid-19 outbreaks. Well since then we find out that Notre Dame has closed all in person classes the same as University of North Carolina. And now the University of Alabama has over 500 cases since classes resumed Wednesday. And other universities are clamping down on the numerous parties taking place on campus with no regard for social distancing or mask wearing…cuz how can you wear a mask when you are drinking from a beer bong??? And that is just the colleges. Certainly a similar health risk is presented at all levels of education around the country. Yes, I may be a bit more sensitive to this then the average investor out there because tomorrow I am taking my youngest Mandy to start her freshman year at Augustana. And then in a week her older sister Sarah is going to begin her Junior year at Northwestern. My kids are fully aware that they may be back home in short order. But part of college is learning to be an independent adult, which my wife and I fully encourage. Yet if I were to lay a bet in Vegas I would wager HEAVILY that both are back home for online classes before Halloween (trick or treat?) Back to the big picture, which is the state of the economy which SHOULD be the primary determinant of market direction. The headline on CNBC following last Wednesday’s release of the Fed minutes was one of the bigger “duh” moments in a while. Fed Officials Expect That Coronavirus Will “Weigh Heavily” on the Economy Did this ominous message scare the market into a retreat? Of course not because at the moment virtually no one is basing their decisions on the fundamentals. This is all about runaway momentum which is why so many of us talk about the current environment as a bubble. However, more and more the evidence is emerging to remind folks that all is not well. And that a return to stock price sanity should be our next course of action. For example, Jobless Claims last Thursday continued to surprise people how persistently high it has been. Last week people were expecting the report to come at 925K. Thus a tad bit of such at the actual print 20% higher at 1.1 million. Let’s again remember that the worst week of the Great Recession was 695K initial claims. Then this morning we got the monthly Consumer Confidence report which is considered one of the best predictors of future consumer spending. That dropped from a sickly 91.7 to a downright anemic 84.8. Yet in the headlines we keep hearing about how things are getting better. But if that is true then why do consumers feel even worse now than they did before? And why does only 5% of small business owners believe that now is a good time to invest in the expansion of their business? The answer, dear friends, is that economic destruction of the Coronavirus recession is far from over. More and more companies will review the state of their business in coming weeks and months only to lay off more people. Or shutter their doors altogether. This will lead to less spending which begets lower profits which begets even more cost cutting and job loss. This is the very nature of the vicious cycle that is borne during recessions and does not go away quickly. That is why the average bear market lasts 13 months. In fact the previous two bears were actually much longer at 19 months and 36 months respectively. So, the bubble gains are fun for sure. And we have participated quite nicely the last few months. But these good times are not built to last as it is stacked on top of a faulty foundation. This market NEEDS to be right sized. To get stock prices down to better match with the still scary economic conditions. I believe that is likely a range of 2,500 to 2,700 with a retest of 2,200 as a possibility (not probability). I believe that party starts in September. And why I keep beating the drum on these themes that seem to be falling on deaf ears at the moment. So yes, many will not hear a bell as we get to the top…but given our current “sense and sensibility” on the fundamental state of the market, we will be one of the first to parachute out. Not just to lock in recent gains, but to also move to a hedged portfolio built to rise as the market sinks. The time to act will soon be at hand. So be prepared to make the necessary trades when the RTR alerts start coming your way. What To Do Next? Right now my Reitmeister Total Return portfolio is positioned based upon the theory that we are in the midst of a mini stock bubble that will likely end as soon as September Of the 11 stocks and ETFs on board I am overweight technology and precious metals. Plus 3 stocks that are uniquely positioned in both a Coronavirus fueled recession and when things get back to normal. Few stocks check both those boxes…but these 3 stocks certainly do which is why they are all serious outperformers of late. At this stage I am sleeping with one eye open awaiting for the party to be over with 20%+ correction quite likely in store. Why? For the key reasons shared earlier in this article from softening economic data to negative effects of the Presidential election cycle to likely spike in Coronavirus cases as students return to school. The plan is to bag gains on all the big stock winners and switch over to inverse ETFs as the best route to profits. Meaning if the market is going to tank then going to cash is nice…but inverse ETFs are going to be the best trade in town. But let’s be honest with ourselves. Its crazy out there! That’s why I am trying my best to help investors make sense of it all and profit from whatever scenario comes our way. The best way for me to do that is give you 30 days access to the Reitmeister Total Return. This is my newsletter service where I share more frequent commentaries on the market outlook, trading strategy, and yes, a portfolio of hand selected stocks and ETFs to produce profits whether we have a bull…a bear…or anywhere in between. As shared above, the unique portfolio I have constructed at this time leans into the stocks that are benefiting the most from the current bubble. That explains how we continue to top the market at this time. Yet we are FULLY prepared for when the rug gets pulled out and stock prices better reflect the still dire economic situation. Just click the link below to see all 11 stocks and ETFs in this uniquely successful portfolio. Plus get ongoing commentary and trades to adjust your strategy as 2020 continues to the wildest market in history. Gladly it can be tamed. About Reitmeister Total Return newsletter & 30 Day Trial Wishing you a world of investment success! Steve Reitmeister …but everyone calls me Reity (pronounced “Righty”) CEO, Stock News Network and Editor, Reitmeister Total Return SPY shares rose $1.18 (+0.34%) in premarket trading Thursday. Year-to-date, SPY has gained 8.96%, versus a % rise in the benchmark S&P 500 index during the same period."}]}