{"article": [{"url": "https://stocknews.com/news/iipr-innovative-industrial-properties-makes-another-splash-with-new-acquisition/", "published": 1601467700.0, "headline": "Innovative Industrial Properties Makes Another Splash with New Acquisition", "body": "Last week Innovative Industrial Properties (IIPR) announced an acquisition of a property in Lakeland, Florida. It was purchased from an affiliate of Parallel, one of the largest privately-held multi-state cannabis operators in the U.S. Parallel is the corporate parent to Surterra Wellness, a leading brand in the Florida market. IIPR has been on an acquisition spree over the past two years adding property after property with no end in sight. As part of their long-term plan to capitalize on the growth of the medical cannabis market, IIPR partners with experienced medical-use cannabis operators and serves as a source of capital by acquiring and leasing back their real estate assets, as well as offering other creative real estate-based capital solutions. The company paid approximately $19.6 million (excluding transaction costs) for the new Florida facility which consists of 65,000 square feet of industrial and greenhouse indoor cultivation and production space currently in operation. 7 Best ETFs for the NEXT Bull MarketParallel expects to develop an additional approximately 155,000 square feet, resulting in a total of approximately 220,000 square feet of industrial and indoor cultivation space. IIPR has agreed to provide reimbursement of up to approximately $36.8 million, assuming full reimbursement, which would make IIPR’s total investment in the property $56.4 million. Paul Smithers, President and Chief Executive Officer of IIPR stated, “We are pleased to expand our relationship with Beau and Parallel’s strong team of dedicated professionals with this newest long-term real estate partnership. With its footprint of 39 operating dispensaries in Florida, Parallel has established a presence of physical access for patients to the large majority of Florida residents.” Beau Wrigley Jr., Chairman and CEO of Parallel added, “We are thrilled to team once again with IIP as our long-term real estate partner, as we continue to significantly enhance our production capacity and product diversity in Lakeland to meet the tremendous demand from Florida patients throughout the state. This transaction opens up additional significant capital for us to reinvest in our growth and commercial expansion across our five markets.” As IIPR continues its expansion throughout the United States, they are further cementing themselves as the “go-to” company for real estate needs in the cannabis market. The company has also managed to pay out and grow its dividend substantially, rewarding shareholders who have stuck with them. I look forward to watching IIPR continue to execute on their long-term strategy and capitalize on the fast-growing medical cannabis market in the United States. Want More Great Investing Ideas? Do NOT Buy Stocks Before the Election! 7 “Safe-Haven” Dividend Stocks for Turbulent Times Chart of the Day- See Christian Tharp’s Stocks Ready to Breakout IIPR shares were trading at $124.11 per share on Wednesday afternoon, down $0.64 (-0.51%). Year-to-date, IIPR has gained 69.17%, versus a 5.36% rise in the benchmark S&P 500 index during the same period."}]}