{"article": [{"url": "https://stocknews.com/news/bx-kkr-cg-apo-mdt-4-private-equity-companies-to-invest-in-now/", "published": 1596110900.0, "headline": "4 Private Equity Companies to Invest In NOW", "body": "A diversified portfolio can include typical equity, fixed income, and cash allocations. But if you want to have a completely diversified portfolio, the addition of publicly-traded private equity firms can help spread the risk. Private equity refers to investments made into private companies. This can include venture capital that focuses on early-stage companies, growth capital, which helps established companies expand, or buyouts when a company is purchased outright. Investing in private equity is typically limited to accredited investors or very high net worth investors. One way for retail investors to gain exposure to private equity is through the stocks of private equity companies. Adding these stocks to your portfolio can provide diversification as the private equity business is less correlated to the general stock market. Blackstone Group Inc. (BX), KKR &Co. Inc. (KKR), The Carlyle Group Inc. (CG), and Apollo Global Management, Inc. (APO) are four of the best private equity stocks to consider. 7 \"SAFE HAVEN\" Dividend Stocks for Turbulent TimesThe Blackstone Group Inc. (BX) BX is the biggest alternate asset management firm investing in early-stage companies in real estate, private equity, hedge funds, credit companies, and alternative asset class strategies. BX recently increased its stake in Israel’s Navitas Petroleum’s Gulf of Mexico drilling project to 47%. This project is expected to generate a cash flow of $1.13 billion when the production begins in 2024. As most countries are slowly resuming their industrial operations, BX stands to gain substantially when the price of oil rises. As a major investor in real estate, BX generated $568 million in profits from its investment in logistics and life sciences infrastructure in the second quarter. This helped the firm offset its losses from its hotel and retail real estate investment, which accounted for 13% of the total real estate holdings. BX invested $337 million Medtronic Plc (MDT) for its expansion in the field of diabetes technologies. With a large proportion of the population being diabetic across the world, this investment can lead to profitable discoveries, helping BX to benefit. BX currently has $156 billion in ‘dry powder’ capital to be invested. BX’s revenues grew more than 75% year over year to $2.51 billion in the second quarter. Net income increased by over 100% to $1.4 billion during the quarter. After hitting its 52-week low of $33 on March 18th, BX gained more than 65%. How does BX stack up for the POWR Ratings? B for Trade Grade B for Buy & Hold Grade A for Peer Grade B for Overall POWR Rating The stock is also ranked #3 out of 55 stocks in the Private Equity industry. KKR &Co. Inc. (KKR) KKR is a leading investment firm engaged in direct private equity and fund of fund investments, as well as real estate investments. KKR’s portfolio companies operate in various sectors such as technology, consumer durables, B2B, B2C and B2G businesses, real estate in energy and infrastructure, and healthcare. It generally holds its stake in a company for three to five years before exiting through IPOs, secondary offerings, and strategic buyouts. KKR raised $950 million to invest in commercial mortgage-backed securities having a high associated risk, as announced on July 20th. As the demand for commercial real estate plummeted in the first half of 2020 due to the healthcare crisis, property prices also decreased. KKR stands to gain substantially when the prices recover, and offices reopen completely. KKR is currently planning to invest $4 billion in French clinic chain Elsan to gain exposure to the French healthcare industry. Elsan currently has over 120 private clinics and hospitals in France and has a dedicated R&D team involved in COVID vaccine trials. KKR has been the most active equity investment firm at the beginning of the pandemic, investing more than $12.7 billion across various sectors. It invested $4.2 billion in waste management business Viridor from Pennon Group, $4.3 billion in US cosmetics companies Wella and Clairol Beauty as well as $3.3 billion in Spanish phone carrier Masmovil Ibercom. KKR plans to amplify its capital gains by investing in companies having huge growth potential as the global economy recovers from this shock. The company surpassed the consensus EPS estimates in three of the trailing four quarters, which is impressive. The consensus revenue estimate of $844.02 million for the quarter ending June 2020 indicates an 8.3% year over year increase. KKR hit its 52-week low of $15.55 on March 18th and has since gained more than 130% to hit its 52-week high of $35.98 on July 29th. KKR’s strong fundamentals are reflected in its POWR Ratings. It has a “Strong Buy” rating with an “A” in Trade Grade, Buy & Hold Grade, and Peer Grade. Within the Private Equity industry, it’s ranked #1 out of 55 stocks. The Carlyle Group Inc. (CG) CG is an investment firm operating across four segments – Corporate Private Equity, Peal Assets, Global Market Strategies, and Solutions. It specializes in both direct and fund of fund investments across various sectors and holds them for three to six years for capital gains. CG recently generated more than 40% returns by investing in the Ant Group before its IPO. In 2018, CG had invested around $500 million in China’s biggest payment company, then valued at $150 billion, which gradually increased to $210 billion. Also, CG has several investments in the Indian subcontinent, primarily in healthcare and technology-oriented companies. CG acquired a 20% stake through an investment of $490 million in Ajay Piramal’s Pharmaceutical business, valued at $2.9 billion. It also invested $235 million in the leading telecommunication merchant Bharti Airtel for a stake in its data center business. CG has plans to raise and invest $2 billion in mid-size equity companies having huge growth potential. In the healthcare sector, CG backed Ortho Clinical Diagnostics received a $678,000 grant from BARDA for its COVID-19 antibody testing program, which can be profitable for the investment firm. CG has an impressive earnings history, as it has surpassed consensus EPS estimates in each of the trailing four quarters. CG has gained more than 90% since hitting its 52-week low in March due to the virus led market crash. It’s no surprise that CG is rated a “Buy” in our POWR Ratings system. It also has an “A” for Trade Grade and Peer Grade, and a “B” for Buy & Hold Grade. In the 51-stock Private Equity industry, it is ranked #4. Apollo Global Management, Inc. (APO) APO is an investment management firm that provides various financial management services such as managing hedge funds and sovereign endowment funds, and client-focused portfolios. It invests in fixed income and other alternate investment assets across the private equity and real estate markets. APO formed Apollo Strategic Origination Partners on July 6th to generate $12 billion for financing over the next three years. APO’s stake in Spartan Energy is expected to generate 71% return on an on-going bidding war for carmaker Fisker Inc. APO’s other holding company Rackspace is expected to be valued at $10 billion after its IPO is finalized, generating a 132.5% return on a $4.2 billion buyout. It is currently planning to expand its insurance asset management business by partnering with Athene Holding Ltd. And Jackson National Life Insurance company. APO’s consensus EPS estimates indicate a 5.1% growth annually over the next five years. APO gained more than 135% in just three months to hit its 52-week high of $55.39 since its March lows. APO’s POWR Ratings reflect this promising outlook. It has an overall rating of “Strong Buy” with an “A” for Trade Grade, Buy & Hold Grade, and Peer Grade. Among the 51 stocks in the Private Equity group, it’s ranked #2. Want More Great Investing Ideas? 9 “BUY THE DIP” Growth Stocks for 2020 How HIGH Can This Tech Bubble Fly? 7 “Safe-Haven” Dividend Stocks for Turbulent Times BX shares . Year-to-date, BX has declined -0.59%, versus a 1.69% rise in the benchmark S&P 500 index during the same period."}]}