{"article": [{"url": "https://stocknews.com/news/gwph-gw-pharma-paves-the-way-to-more-revenue/", "published": 1596542900.0, "headline": "GW Pharma Paves the Way to More Revenue", "body": "On Monday, GW Pharmaceuticals (GWPH) announced that the FDA had approved Epidiolex Oral Solution to treat seizures associated with Tuberous Sclerosis Complex. The age range for all Epidiolex treatment will be expanded to include patients one year and older. This is the third approval for Epidiolex, which is the first and only FDA-approved cannabidiol (CBD) medicine. Tuberous Sclerosis Complex (TSC) is a rare genetic disease that causes non-cancerous tumors to grow in the body. These tumors can be found in the brain and other parts of the body such as the eyes, heart, kidneys, lungs, and skin. TSC affects 1 in 6,000 people and can cause severe seizures. Epidiolex is already available to patients with a prescription which means people who are affected by TSC can access Epidiolex immediately. Epidiolex has previously been approved for the treatment of seizures associated with two rare and severe forms of epilepsy, Lennox-Gastaut syndrome (LGS) and Dravet syndrome (DS). Justin Gover, the Chief Executive Officer at GWPH said, “This label expansion, including the expansion of the age range in all approved indications, further demonstrates that the FDA process can continue to enable broader patient access to appropriately tested regulatory approved cannabinoid medicines.” The approval is yet another important milestone for EPIDIOLEX as a first-in-class antiepileptic drug. 7 Best ETFs for the NEXT Bull MarketElizabeth Thiele, M.D., Ph.D., Director of the Herscot Center for Tuberous Sclerosis Complex at Massachusetts General Hospital, Professor of Neurology at Harvard Medical School and clinical investigator said, “Based on previous positive trial results in TSC patients, EPIDIOLEX may become an important treatment option for patients. It is a new tool in the toolbox for physicians and could meet a significant unmet need.Nearly two-thirds of individuals with TSC develop treatment-resistant epilepsy and there is a need for new options that may benefit these patients who often try and fail existing treatments.” I believe that this is some of the best news GWPH has been able to deliver this year as the company continues to expand and create further opportunities to generate revenue. GWPH has a strong competitive advantage in the market with a high barrier of entry and should continue to generate strong revenues moving into 2021. Want More Great Investing Ideas? 9 “BUY THE DIP” Growth Stocks for 2020 How HIGH Can This Tech Bubble Fly? 7 “Safe-Haven” Dividend Stocks for Turbulent Times GWPH shares were unchanged in after-hours trading Tuesday. Year-to-date, GWPH has gained 29.47%, versus a 3.60% rise in the benchmark S&P 500 index during the same period."}]}