{"article": [{"url": "https://stocknews.com/news/dis-penn-dkng-sbux-4-stocks-to-buy-with-the-economy-reopening/", "published": 1600862900.0, "headline": "4 Stocks to Buy with the Economy Reopening", "body": "The unprecedented coronavirus pandemic has created a harsh environment for the global economy with dual repercussions on human health as well as business operations. The US economy contracted at an annual rate of 32.9% in the second quarter, confirming a recession. With losses piling up in an environment of very low business activity and widespread unemployment, the country slowly started reopening its economy with as many precautionary measures as possible. The CDC has affirmed a compulsory mask mandate and social distancing for most public spaces. Companies such as The Walt Disney Company (DIS) and Starbucks Corporation (SBUX) have reopened their business with proper precautions. This is allowing them to slowly recover from huge losses. On the other hand, companies such as Draftkings, Inc. (DKNG) and Penn National Gaming, Inc. (PENN) have focused on shifting their business online, thereby boosting their operations. Moreover, the return of live sports, increasing popularity of virtual sports betting and reopening of casinos should help these companies recover fast. 7 Best ETFs for the NEXT Bull MarketThe Walt Disney Company (DIS) As a diversified multinational entertainment company, DIS operates through four segments — Media Networks, Parks Experiences and Products, Studio Entertainment and Direct-to-Consumer and International. DIS has suffered tremendously since the onset of the pandemic, as most of its business remained closed for months. However, its recently launched online streaming service Disney + has gained significant traction during this time, as the social distancing norm has led many people to subscribe to online streaming services. Strictly from a price perspective, Disney+ premium charges are not sufficient to compensate for the pandemic driven losses. However, DIS is currently undertaking an aggressive pricing policy to expand its user base, and gradually emerge as a top streaming service provider internationally. Most of DIS theme parks and recreational resorts have reopened, and media houses have resumed production since July. This should support the company’s financial growth to some extent in the upcoming quarter. Though DIS has a negative earnings outlook for the upcoming quarter, the company has beat EPS estimates in three out of trailing four quarters, which bodes well for the stock. Its revenue grew at a CAGR of 7.9% over the past three years, while total assets increased at a CAGR of 30.8%, over the same time period. DIS has gained more than 60% since hitting its 52- week low of $79.07 in March. How does DIS stack up for the POWR Ratings? B for Trade Grade A for Peer Grade B for Overall POWR Rating. The stock is also ranked #1 out of 14 stocks in the Entertainment – Sports & Theme Parks industry. Starbucks Corporation (SBUX) SBUX reported negative year-to-date gains, as the virus driven lockdown has reduced customer traffic in its retail coffee shops across the world. However, with the gradual recovery of the world economy, most Starbucks establishments are now open. The speedy recovery of China and reopening of the United States were key in SBUX’s recovery, as most of its shops are concentrated in the United States and China. The company opened 130 new stores across the world, indicating a 5% year-over-year growth in net new stores in the third fiscal quarter. SBUX’s EPS is expected to rise at 2.7% per annum over the next five years. Its total assets grew at a CAGR of 26.1% over the past three years, while revenue increased at a CAGR of 2.4% over the same period. SBUX has gained more than 65% since hitting its 52-week low of $50.02 in March. It’s no surprise that SBUX is rated a “Buy” in our POWR Ratings system, with a grade of “A” in Trade Grade, Peer Grade, and Industry Rank, and “B” in Buy & Hold Grade. It is also ranked #3 out of 49 stocks in the Restaurants industry. Draftkings, Inc. (DKNG) DKNG is an online sports and betting company providing business to business (B2B) and business to customer (B2C) offerings. It made its stock market debut earlier this year through a special purpose acquisition of Diamond Eagle Corporation. On September 14th, DKNG signed a multi-year agreement with ESPN to be an exclusive daily fantasy sports provider and co-exclusive link out provider. DKNG also signed to be an exclusive sports betting, iGaming, and daily fantasy operator for the New York Giants. DKNG reported a 23.6% year-over-year increase in its revenues to $70.93 million in the second quarter that ended in June 2020. DKNG’s EPS is expected to grow at a rate of 40% per annum over the next five years. The stock has gained 417.7% to hit its 52-week high of $55.70 since hitting its year-to-date low of $10.65 in January. DKNG is rated a “Strong Buy” in our POWR Ratings system, consistent with its sound business model and impressive financials. It has a grade of “A” for Trade Grade, Buy & Hold Grade, and Peer Grade. In the 22-stock Entertainment – Casinos/ Gambling industry, DKNG is ranked #1. Penn National Gaming, Inc. (PENN) PENN owns and operates racing facilities and casinos across the country. It recently expanded into virtual gaming and sports betting, which bodes well for the stock in the “new normal”. PENN launched the Barstool Sportsbook app for online sports betting in multiple games, which quickly gained popularity among the masses and rose to the #1 app on App store. Currently only functioning in Pennsylvania, PENN is planning to expand the reach of its app across the country. It also partnered with Sportsradar to use real-time data of NFL games on its betting platforms. PENN’s revenues grew at a CAGR of 10.5% over the past three years, while its total assets increased 42.2% over the same time period. Its EPS is expected to grow at 42.6% per year over the next five years. PENN has gained more than 1900% since hitting its 52-week low of $3.75 in March. The stock hit its 52-week high of $76.62 in September. PENN’s strong fundamentals are reflected in its POWR Ratings. It is rated “Strong Buy” with a grade of “A” in Trade Grade, Buy & Hold Grade, and Peer Grade. It is also ranked #3 out of 22 stocks in the Entertainment – Casinos/ Gambling industry. Want More Great Investing Ideas? 7 “Safe-Haven” Dividend Stocks for Turbulent Times When Does the Next Bull Run Start? Chart of the Day- See the Stocks Ready to Breakout DIS shares were trading at $124.20 per share on Wednesday afternoon, down $3.01 (-2.37%). Year-to-date, DIS has declined -14.13%, versus a 2.48% rise in the benchmark S&P 500 index during the same period."}]}