{"article": [{"url": "https://stocknews.com/news/alb-sqm-lac-3-lithium-stocks-charging-to-new-highs/", "published": 1600690100.0, "headline": "3 LITHIUM Stocks CHARGING to NEW HIGHS", "body": "Although the U.S.-China trade war and ongoing pandemic have marred the growth of most non-tech sectors, increasing demand for batteries, particularly in the fast-growing electric vehicles market, have helped the lithium industry stand out. As Lithium is the key raw-material input, the industry has seen increasing demand. With this silvery-white alkali metal becoming increasingly valuable in the “electric-mobility revolution,” the industry holds immense upside potential. As Tesla (TSLA) has been leading the way in a shift to electric vehicles, this has provided a significant boost to the Lithium industry. According to a MarketWatch report, “Global Lithium-Ion Battery Market is estimated to reach $56 billion by 2024; growing at a CAGR of 10.6% from 2016 to 2024.” The rocketing performance of lithium stocks is evident from The Global X Lithium & Battery Tech ETF’s (LIT) 125% plus gain, compared to the S&P 500’s gain of 50%, since the market crash in mid-March. LIT represents the performance of the largest and most liquid listed companies active in the exploration and/or mining of Lithium, or the production of Lithium batteries. 7 \"SAFE HAVEN\" Dividend Stocks for Turbulent TimesThis provides us an interesting opportunity to find stocks that should benefit over the long-term. Albemarle Corporation (ALB), Sociedad Quimica y Minera (SQM), and Lithium Americas Corp. (LAC) are part of this high-growth industry and have continuously been moving higher. Albemarle Corporation (ALB) Founded in 1994, ALB is the world’s largest lithium producer, accounting for 21% of global production. The company operates in three segments — Lithium, Bromine Specialties, and Catalysts. ALB’s cost savings activities and productivity improvement strategy are expected to be beneficial amid this reduced global economic activity due to the pandemic. In recent years, ALB has started operating in China and Australia. According to Albemarle CEO Kent Masters, “We remain confident that we have the right strategy in place to deliver value to our stakeholders by investing in and growing our Lithium business. While our strategy has not materially changed, the environment in which we operate has changed dramatically. Our response must be to focus on operational discipline in terms of manufacturing, business, and capital project excellence.” The company has recently announced its selection by the U.S. Department of Energy (DOE) as a critical partner for two lithium research projects over three years through a Battery Manufacturing Lab Call. Albemarle will work in conjunction with two DOE labs on the company’s approved projects. For the second quarter that ended in June 2020, ALB’s net sales of $764 million decreased 14% year-over-year, but its lithium operations are continuing to expand. The market expects ALB’s EPS to grow 15% per annum over the next five years. The stock has gained 88% since hitting its 52-week low of $48.89 in March. The stock hit its 52-week high of $101.00 on September 18th, and has the potential to hit new highs soon. How does ALB stack up for the POWR Ratings? A for Trade Grade A for Buy & Hold Grade A for Peer Grade B for Industry Rank A for Overall POWR Rating. It is also ranked #6 out of 68 stocks in the Chemicals industry. Sociedad Quimica y Minera (SQM) SQM is another key lithium producer in Chile and accounts for 13% of global production. Due to SQM’s sheer dominance in the sector, no discussion about lithium stocks is complete without mentioning the company. The company went public 27 years ago, making it older than 76.7% of listed US stocks in the StockNews.com universe. During the second quarter of 2020, SQM’s lithium sales volumes exceeded 12,600 metric tons, almost 50% higher than sales volumes reported in the first quarter of the year. After hitting its year-to-date low in March, the stock gained momentum and has returned more than 80% to hit its 52-week high of $34.92 on September 18th. SQM is rated a “Strong Buy” in our POWR Ratings system, consistent with its sound business model and growth potential. It also has a grade of “A” in Trade Grade, Buy & Hold Grade and Peer Grade. It is currently ranked #7 out of 68 stocks in the Chemicals industry. Lithium Americas Corp. (LAC) Incorporated in 2007, this small-cap Canadian mining company operates as a resource company in the United States and has unique potential in this space. The company engages in the acquisition, exploration, and development of mineral properties in Nevada. LAC explores for lithium deposits. It primarily holds interests in the Cauchari-Olaroz Project located in Jujuy province of Argentina; and the Lithium Nevada Project covering approximately 15,233 hectares of area located in northwestern Nevada. These projects promise to help global production problems once they are up and running. There are rumors regarding the possibility of LAC being acquired by Elon Musk’s Tesla. This is one reason for the stock to move higher. The stock is up more than 380% since hitting its 52-week low of $1.92 in March. The stock has hit its 52-weeks high of $11.22 on September 18th. LAC’s POWR Ratings reflect this promising outlook. It has an overall rating of “Buy” with a grade of “A” in Trade Grade and a “B” in Buy & Hold Grade and Peer Grade. Among the 16 stocks in the Miners – Diversified industry, it’s ranked #5. Want More Great Investing Ideas? 7 Best ETFs for the NEXT Bull Market Stock Market Outlook: Before & After the Election Chart of the Day- See the Stocks Ready to Breakout ALB shares were trading at $91.53 per share on Monday morning, down $6.43 (-6.56%). Year-to-date, ALB has gained 27.09%, versus a 1.57% rise in the benchmark S&P 500 index during the same period."}]}