{"article": [{"url": "https://stocknews.com/news/qcom-eric-xlnx-qrvo-4-best-5g-stocks-to-own-into-2021/", "published": 1599653300.0, "headline": "4 Best 5G Stocks to Own into 2021", "body": "The 5G infrastructure market is expected to see a CAGR of 29% over the next six years. The increasing demand for 5G infrastructure can be attributed to its various applications such as healthcare, automotive, and the internet of things (IoT). 5G networks promise faster connectivity as well as greater reliability. 5G-enabled smartphones and communication devices are expected to be in consumers’ hands next year. Pent-up demand for this emerging technology should significantly benefit companies that are involved in the rollout of 5G services across the world. These companies are involved in the licensing of 5G enabled chip-sets, radio-frequency technology for allowing 5G communications, radio small cell solutions for 5G, and so on. This may be the best time to make investments in companies that are at the forefront of the 5G revolution. Companies such as Qualcomm, Inc. (QCOM), Ericsson ADS (ERIC), Xilinx, Inc. (XLNX), and Qorvo, Inc. (QRVO) are well-poised to benefit from the adoption of 5G technology. 7 \"SAFE HAVEN\" Dividend Stocks for Turbulent TimesQualcomm, Inc. (QCOM) QCOM designs, manufactures, and sells communication-related products in the United States, Taiwan, South Korea, and China. The company works in three segments — Qualcomm CDMA technologies, Qualcomm Strategic Initiatives, and Qualcomm Technology Licensing. QCOM has entered into an agreement with Samsung for manufacturing affordable 5G chipsets. The first batch of 5G Snapdragon chipsets are expected to hit the market in 2021. QCOM also entered into a long-term, global patent license agreement with the world’s largest smartphone brand Huawei. The company now has multi-year licensing deals with every major smartphone maker. QCOM’s shares have returned 24.4% year-to-date and are expected to gain momentum as the company starts realizing gains from its 5G technology investments. The company’s revenue is expected to grow 8.7% this year, and 31.6% in 2021. The company’s EPS is estimated to grow at a rate of 26.8% per annum over the next five years. How does QCOM stack up for the POWR Ratings? A for Trade Grade B for Buy & Hold Grade A for Peer Grade B for Industry Rank B for Overall POWR Rating The stock is also ranked #6 out of 86 stocks in the Semiconductor & Wireless Chip industry. Ericsson ADS (ERIC) ERIC offers communication services and technology for mobility, cloud, and broadband in the telecom industry. ERIC has already brought 5G operations to North America, Europe, Asia, South America, and Africa. The company has recently launched its 5G indoor radio small cell solution in a subway line in Shenyang, China. All commuters and travelers on the subway can access 5G connectivity across all 22 stations in the line. ERIC’s 5G solutions have been successfully deployed across Denmark in partnership with Danish communications provider TDC. The company is also planning to commercially release the 5G NR carrier aggregation in the fourth quarter of the year. ERIC’s stock has delivered a price return of 23.7% year-to-date. The company is expected to witness revenue growth of 6% this year, and 7% next year. ERIC’s EPS is estimated to rise 26.3% per year over the next five years. ERIC’s strong fundamentals are reflected in its POWR Ratings, it has a Buy rating with a grade of A for Trade Grade and Peer Grade. Within the Telecom – Foreign industry, it’s ranked #5 out of 35 stocks. Xilinx, Inc. (XLNX) XLNX manufactures and sells processing platforms. The company’s innovations include programmable system-on chips, field-programmable gate array (FPGA), and adaptive computer acceleration platforms (ACAP). The company’s FPGA and ACAP offerings are expected to enter a period of high demand with the growth in emerging technology such as 5G and AI. In the second quarter, the company’s wired and wireless business saw a sequential rise in revenue of 27% due to the increasing demand for 5G network build outs. The company is also expecting demand growth in North America, as one of XLNX’s customers plans to ramp up deployment of 5G radio applications. XLNX’s stock has gained more than 42% since its March lows. XLNX is estimated to generate 12% higher revenue next year. The company’s EPS is expected to grow 29.6 % next year, and 7.47% per annum over the next five years. It’s no surprise that XLNX is rated a Buy our POWR Ratings system, with a grade of A in Trade Grade and Peer Grade. In the 86-stock Semiconductor & Wireless Chip industry, it is ranked #14. Qorvo, Inc. (QRVO) QRVO is a market leader in core technologies and radio-frequency solutions for mobile and infrastructure applications. The company is involved in the deployment of 5G technology across the globe by providing a wide range of RF connectivity solutions such as phase shifters, switches, integrated modules, and so on. Due to higher than expected demand for the company’s 5G mobile products, the company has increased its financial guidance for the quarter ending September 2020. The demand for the company’s infrastructure is expected to grow thanks to products such as Wi-Fi 6, gallium nitride (a semiconductor component), and MMO technology that supports 5G networks. QRVO’s stock has recovered 61% from its mid-March low. The company’s revenue is expected to grow 5.1% in the current year and 10.10% next year. QRVO’s EPS is estimated to grow 11.4% per annum over the next 5 years. QRVO’s strong fundamentals are reflected in its POWR Ratings. It has a Buy rating with a grade of B in Trade Grade, Peer Grade, and Industry Rank. Within the Semiconductor & Wireless Chip industry, it’s ranked #17 out of 86 stocks. Want More Great Investing Ideas? 7 Best ETFs for the NEXT Bull Market Will Stocks Fall into Historical September Slump? 9 “BUY THE DIP” Growth Stocks for 2020 QCOM shares were trading at $114.53 per share on Wednesday afternoon, up $4.76 (+4.34%). Year-to-date, QCOM has gained 32.56%, versus a 7.29% rise in the benchmark S&P 500 index during the same period."}]}