{"article": [{"url": "https://stocknews.com/news/lb-fran-2-retail-stocks-that-soared-last-week/", "published": 1596456500.0, "headline": "2 Retail Stocks That SOARED Last Week", "body": "2020 has been a challenging year for most retail companies. Not only has the coronavirus pandemic led to an economic slowdown but it also has significantly reduced foot traffic in stores and malls, where people usually go to buy clothes and household goods. Despite these headwinds, shares of L Brands (LB) and Francesca’s Holdings (FRAN) soared last week. 9 \"BUY THE DIP\" Growth Stocks For 2020Though these two retail companies didn’t seen a sudden surge in sales, they announced ways in which they are saving money and reducing expenditures. L Brands, Inc. (LB) LB’s stock rallied about 26% last week on the announcement that it expects to deliver $400 million in annualized cost reductions through its profit improvement plan. The Ohio-based fashion retailer plans to reduce its home office headcount by about 850 associates and also close 250 Victoria Secret stores this year in order to achieve its cost containment target. Furthermore, LB aims to reduce operating losses and store selling costs through changes in their labor model and management structure. Andrew Meslow, the CEO of LB said, “The Board and management remain committed to separating the Bath & Body Works and Victoria’s Secret businesses, as well as improving the profitability of the Victoria’s Secret business. During the second quarter, we made meaningful progress toward these goals. Decisions relating to our workforce are incredibly difficult and not taken lightly, but these actions are necessary to best position our company for the long-term.” Matthew Boss, an analyst at JP Morgan, believes this cost savings plan implies an extra $1 in earnings-per-shares (EPS) and is accretive to their existing fiscal 2021 EPS base of $1.07. Boss upgraded LB from Neutral to Overweight and lifted his price target from $14 to $32. How does LB stack up for the POWR Ratings? A for Trade Grade B for Buy & Hold Grade A for Peer Grade B for Overall POWR Rating The stock is also ranked #5 out of 65 stocks in the Fashion & Luxury industry. Francesca’s Holdings Corporation (FRAN) FRAN, the Texas-based Specialty retailer, which operates nationwide boutiques, rallied about 23% last week after the company announced an encouraging business update and second quarter outlook. FRAN expects to receive a $10.7 million income tax refund which could be used to pay its outstanding debt and the company also substantially completed negotiations with its landlords to either abate or defer lease payments for the months of April, May and June. FRAN’s 674 boutiques out of total 702 have been reopened with reduced capacity and hours according to local regulations. For the second quarter ending on August 1st 2020, FRAN expects net sales to be in the range of $67.0 million to $71.0 million which would be a massive improvement over the first quarter net sales of $43.8 million. Moreover, loss from operations is expected to be between $21.0 million to $23.0 million which would be much lower than the first quarter loss from operations of $35.3 million. FRAN also expects to reduce gross margin pressure with more aggressive promotions. FRAN is ranked #34 out of 65 stocks on POWR Ratings in the Fashion & Luxury industry. Want More Great Investing Ideas? 9 “BUY THE DIP” Growth Stocks for 2020 How HIGH Can This Tech Bubble Fly? 7 “Safe-Haven” Dividend Stocks for Turbulent Times LB shares rose $0.02 (+0.08%) in after-hours trading Monday. Year-to-date, LB has gained 36.21%, versus a 3.21% rise in the benchmark S&P 500 index during the same period."}]}