{"article": [{"url": "https://stocknews.com/news/mrk-msft-hd-3-dow-jones-stocks-to-buy-and-hold-for-decades/", "published": 1602072500.0, "headline": "3 Dow Jones Stocks to “Buy and Hold” for Decades", "body": "As some investors fear uncertainty heading into the election, one way to stabilize your portfolio is with the addition of large and stable companies. Some of the largest companies can be found in the Dow Jones Industrial Average index, and I’ve selected three that I believe offer the best growth potential over the long run: Merck & Company (MRK), Microsoft (MSFT), and Home Depot (HD). When evaluating stocks for the long-term, one metric I focus on is return on invested capital (ROIC), which measures how well a company’s management allocates its funds. This gives me a true look at the profitability potential of a company. Not only do MRK, MSFT, and HD all have strong ROICs, but each one has a history of financial stability and are sure to benefit from current and future trends.The coronavirus pandemic has created opportunities for many companies in the pharmaceutical, technology, and home improvement industries. 9 \"BUY THE DIP\" Growth Stocks For 2020Merck & Company (MRK) When you think of a healthcare company in 2020, I bet the first thing that comes to mind is a vaccine or treatment for COVID-19. MRK was a late entry into the search for a vaccine, but through its buyout of biotech firm Themis, it has a chance to profit heavily. The one advantage the company has with its candidate is the delivery model. It is a single-dose oral delivery, meaning patients afraid of needles will likely consider it over more invasive options. In addition to working on a vaccine, MRK has plenty of products driving sales, such as Keytruda, Lynparza, and Bridion. The company is seeing an increase in Keytruda sales due to an uptick in lung cancer cases. This bodes well for the company as the drug’s patent doesn’t run out until 2028. There is also the potential for longer-term approvals in breast and colon cancer. The company has an ROIC of 20.5% and a profit margin of 26.6%. Add this to a dividend yield of 3.1% and stable earnings forecast, and you have a solid company worth considering. MRK is rated a “Buy” in our POWR Ratings system. It holds a grade of “A” in Peer Grade, and a “B” in Trade Grade, Buy & Hold Grade, and Industry Rank. These are the components that make up the POWR Ratings. The stock is also ranked #11 in the Medical Pharmaceutical industry. Microsoft (MSFT) MSFT is one company that has undoubtedly benefited from the ongoing pandemic. It is seeing momentum in its suite of cloud-based products, including SharePoint, Dynamics, Teams, and the 365 versions of its Office software. MSFT’s Azure cloud services product, LinkedIn, Bing, and Xbox Live products are also driving revenue. While most media coverage for video-conferencing has been focused on Zoom (ZM), Microsoft Teams offers strong growth potential due to its existing user base. MSFT is releasing its Xbox Series X console on Nov. 10. This should see strong sales into the holiday season. In terms of core growth, I’d be remiss without mentioning the Windows operating software, which has been a cash cow for the company for a long-time. I see the work and learn from home trends continuing for the foreseeable future, and that should benefit MSFT’s top line handsomely. In terms of future growth, the company’s entries into artificial intelligence and augmented/virtual reality should add more future revenue streams. The company has an ROIC of 25% and a profit margin of 31%, leading me to believe this is a well-managed company, especially since CEO Satya Nadella took over. MSFT is rated a “Buy” in our POWR Ratings system. It holds a grade of “B” across the board in Trade Grade, Buy & Hold Grade, Peer Grade, and Industry Rank. It is also the #19 ranked stock in the Software-Application industry. The stock may see a pop at the end of the month as it is expected to report earnings on the 28th. Home Depot (HD) HD has had a great year so far, up 31.8%, and I believe it still has plenty of upside. The company posted better than expected earnings and revenue last month, and I don’t see its growth catalysts disappearing anytime soon. The company has benefited from a double dose driver of the pandemic and the Fed’s low interest rate policy. As people have had plenty of time on their hands without a long commute disrupting their day, many have used that time to work on home improvement projects. It’s not just creating home offices or classrooms; people have been working on their yards and making changes to their kitchens and bathrooms. Low interest rates have led to increased home sales, which provides another reason for the need for home materials. Many people typically make improvements to their homes after purchase. HD has been there with all the materials that a do-it-yourself homeowner or a contractor would need. Plus, the company barely missed a beat when the pandemic hit. While most businesses were struggling with the shutdown, HD already had the digital infrastructure in place to handle orders. The stock has a decent 2.1% dividend yield and a very high ROIC of 32.6, both attractive figures for a long-term bet. HD is rated a “Strong Buy” in the POWR Ratings system, with grades of “A” for Trade Grade, Buy & Hold Grade, and Industry Rank. It is also the #1 stock in the Home Improvement & Goods industry. Want More Great Investing Ideas? 7 Best ETFs for the NEXT Bull Market What is the Cure for Stock Market Volatility? Chart of the Day- See Christian Tharp’s Stocks Ready to Breakout"}]}