{"article": [{"url": "https://stocknews.com/news/spy-qqq-cboe-how-to-profit-in-a-volatile-market/", "published": 1600949300.0, "headline": "How to Profit in a Volatile Market", "body": "Within the first trading hour on Thursday, both the “SPDR S&P 500 (SPY)” and “Nasdaq 100 (QQQ)” dropped 1.1%, rallied 2%, then declined 1.3% before settling around midday while attempting to stabilize, following yesterday’s steep sell-off. This is seemingly the new normal and very “2020” — a year best summed up as: “unprecedented,” presenting unique opportunities for nimble and opportunistic traders. To date this year, there have been 42 days where the SPY and QQQ have moved above 2%; more than quadrupling the average number of 2%+ sessions in the last five years. In fact, in 2017, there were only eight days that saw moves in excess of just 1% — one of the least volatile years on record. The SPY has now given back most of its year-to-date gains with both it and the QQQ’s still standing in the 10% correction territory. While I think we could see a short-term bounce, I maintain my stance from last week that the selling is not over. [SPECIAL Sale Extended] Learn about the One-Month $19 Trial Offer Our Market Experts Are Ranting & Raving About —the Options360 Service! Likewise, I think volatility will remain high well into 2021. My belief rests on several factors. First, it’s looking increasingly likely that the election will be contested without a resolution for weeks after November 3. Second, the coronavirus isn’t disappearing causing most of the world to keep retrenching in terms of reopening the economy. And finally, historical data has shown that volatility is cyclical, and when there’s a significant upswing it can take months or years for it to subside. Think of the crisis which ignited elevated volatility much like a bad ankle sprain, as it takes time for the swelling to subside with any inadvertent bang causing inflammation that will lead to continued caution. 7 \"SAFE HAVEN\" Dividend Stocks for Turbulent Times As always, we look to the CBOE Volatility Index (VIX) as the benchmark for market fear or uncertainty. In spite of a degree of outlook optimism for corporate profits and an improving economic backdrop, the VIX’s holding around 27. This is well above where it was exactly a year ago, being at 14.91 (the 20-year average of 16). The Nasdaq Volatility Index (VXN) which measures the QQQ options, has been running even higher. And as you’ll see, there was an increase in August even as the market rallied due to the chase into call options creating the unusual skew. As a frame of reference, 2020 is set to become the most volatile since the darkest days of the 2008-2009 financial crisis. DataTrek analysts drew a comparison with the behavior of the VIX towards the financial crisis’ end when the index traded at a 24.9 average level. The Final quarter’s average for that year was 23.1, compared with a 28.84 average so far in September of this year. Volatility tends to trade in cycles, like any other asset class. It periodically “runs hot” – such as it did from 1997-2003 and 2007-2012, as well as in 2015-2019 when it is very subdued. It appears that we’re starting a new phase of high-volume market activity. DO NOT Miss Out! Click here and try Options360 for just $19 — Before It’s Too Late This is all taking place as we head into what’s seasonally the most volatile time of the year. A “Goldman Sachs (GS)” study indicates that in the past 30 years, volatility tends to be 25% higher in October than any other month. And of course, October’s notorious for black swan events, such as the 1987 crash, the 1991 mini-crash, the 1997 Asian contagion currency crisis, and the dot.com bust bottoming of 2002. For astute option traders, this is considered an opportunistic time, which should be embraced. As I always say, find the option strategy that best aligns with your thesis and the market environment. For the Option360 service, this has meant a distinctive shift from debit positions employing credit spreads — both bullish and bearish —to capitalize on the heightened volatility. Whereas in 2017-2019, the Option360 leaned heavily on debit positions. In 2020, nearly half of the trades have been credit spread. In fact, the last 4 trades this month (bull put spread in “Wal-Mart (WMT)”, bear call spread in “Best Buy (BBY)” an iron condor in “IBM (IBM) and a QQQ bear call have all been profitable. Year to date, Option360 now stands up 32%! This far outpaces the SPY’s 1% gain. As I stated above, I expect volatility to remain elevated and I plan on continuing to take advantage of the plumped up premiums. [Last Chance] Take Advantage of this Exclusive $19 Trial Offer to the Options 360 Service! Want More Great Investing Ideas? 7 “Safe-Haven” Dividend Stocks for Turbulent Times When Does the Next Bull Run Start? Chart of the Day- See the Stocks Ready to Breakout SPY shares were trading at $323.62 per share on Thursday afternoon, up $0.98 (+0.30%). Year-to-date, SPY has gained 1.99%, versus a % rise in the benchmark S&P 500 index during the same period."}]}