{"article": [{"url": "https://stocknews.com/news/hd-low-shw-3-home-improvement-stocks-to-buy-now/", "published": 1594037300.0, "headline": "3 Home Improvement Stocks to Buy Now", "body": "With the influx of social distancing and quarantine measures due to the pandemic, people are continuing to stay-at-home. The Fed’s strategy of keeping interest rates low has created favorable mortgage rates for home buyers. These two measures combined has allowed the home improvement industry to flourish during this period. The Dow Jones US Home Improvement Retailers Index has gained 13.4% year-to-date compared with the Dow Jones Industrial Average’s loss of 9.5%. This reflects the attention the industry has received from investors over this time period. Due to many people working from, people are looking to modernize their homes and upgrade home workspace for higher productivity. People have also been stocking up on essentials, cleaning supplies, and safety products. In addition, there has been a surge in demand for houses as people are moving away from the cities. Here are three home improvement stocks that could do well over the coming months. 7 Best ETFs for the NEXT Bull MarketHome Depot, Inc. (HD) HD is the largest home improvement retailer in the United States with a market cap of $267.27 billion. Even though HD could not go through with its Spring Black Friday sale (one of the prime sales seasons in March and April), its e-commerce sales more than compensated for the loss. HD’ e-commerce sales surged by 80% year-over-year in the first quarter. With the integration of e-commerce, HD offers store pick-up and delivery service. HD’s sales in the first quarter this year was $23.8 billion, a 7.1% increase from the previous year. The company has enhanced employee benefits and ensured that its employees are well compensated. In mid-March, HD introduced a number of operational changes for sanitation, customer safety, and replenishment of essential products. The company’s operating income declined 9% year over year due to these increased expenses. This pushed net profit down by 11% year over year in the first quarter. However, the company’s capabilities to adapt to the current situation is well-liked by both customers and investors. Fifteen out of twenty two Wall Street analysts have a ‘Buy’ rating for this stock. The stock has a dividend yield of 2.41% and a payout ratio of 59.6%. HD has gained 15.2% year to date and has returned 30.7% over the past 3 months. How does HD stack up for the POWR Ratings? A for Trade Grade A for Buy & Hold Grade A for Industry Rank A for Peer Grade A for overall POWR Rating You cannot ask for a better rating than that, including the fact that it is the #1 rated stock in a top industry, Home Improvement & Goods Stocks. Lowe’s Companies Inc. (LOW) LOW specializes in products for maintenance, repair and decoration of homes. The company’s adjusted diluted earnings per share in the first quarter was $1.77 compared with $1.22 in the previous year. As of May 1st 2020, the company’s operating income increased 40.5% year over year. In response to the Covid-19 outbreak, LOW also introduced operational changes which involved cleaning protocols and social distancing measures. The company’s main priority was to safeguard the healthcare of its employees as LOW invested $340 million in these measures. The company has also adapted well to the pandemic. The company has seen an 80% sales increase in the first quarter. LOW’s ability to manage its business strategy successfully and provide support to its employees, customers, and the community has been impressive. The high average analyst price target for the stock is $160, which represents a potential upside of 17.9% from its last closing price of $135.71. LOW has returned 32.9% over the past year and 53.8% over the past three months. The stock is approaching its 52-week high of $138.18 which could set a bullish path. So it shouldn’t surprise you that LOW is one of the top rated stocks in our momentum based POWR Ratings system. All 5 scores are an A for the stock. Overall, it is the #2 ranked stock in Home Improvement & Goods Stocks industry. Sherwin-Williams Company (SHW) SHW is a Fortune 500 company which manufactures and distributes general building materials. Sale of paints and coatings is one of the major segments for SHW. The price of Crude Oil, which is a vital raw material for paint, has dropped due to Covid-19. As a result, SHW should see a decline in input costs. During these uncertain times, a lot of people are shifting away from living in the city in search of homes in the suburbs. As a result, demand for products used in the remodeling of houses could surge. The net sales of SHW increased 2.6% year over year in the first quarter. The average analyst price target for SHW is $623.90. SHW stacks up well for the POWR Ratings. The company has a Grade of A for Trade Grade, Buy & Hold Grade, Industry Rank, and Peer Grade and an A for overall POWR Rating. The company is also the #3 rated stock in the in Home Improvement & Goods Stocks industry. Want More Great Investing Ideas? 9 “BUY THE DIP” Growth Stocks for 2020 Is the Bull S#*t Rally FINALLY Over? 7 “Safe-Haven” Dividend Stocks for Turbulent Times Top 3 Investing Strategies for 2020 HD shares were trading at $248.31 per share on Monday afternoon, up $0.16 (+0.06%). Year-to-date, HD has gained 15.15%, versus a -0.74% rise in the benchmark S&P 500 index during the same period."}]}