{"article": [{"url": "https://stocknews.com/news/work-msft-slack-files-antitrust-complaint-against-microsoft-in-eu/", "published": 1596456500.0, "headline": "Slack Files Antitrust Complaint Against Microsoft in EU", "body": "Slack had a 2019 IPO at $26 per share Slack remains near its IPO price and the earnings are weak Daniel and Goliath- Slack battles Microsoft 7 Best ETFs for the NEXT Bull MarketSlack Technologies, Inc. (WORK) is a business technology software platform in the United States and worldwide. The company’s platform brings people, applications, and data together. WORK sells its product under a software-as-service model. Since June 2019, the shares have traded in a range from $15.10 to $42.00. Slack’s main competitor is Microsoft (MSFT). The company filed a formal antitrust complaint in the European Union. WORK has accused MSFT of bundling teams in its Office software. The lawsuit has set up a Daniel versus Goliath legal battle as WORK’s market cap was at just over $16.65 billion at the end of last week with MSFT’s at over $1.55 trillion. Meanwhile, WORK’s earnings record has been less than impressive. The company has not reported a profit over the past four quarters and has consistently underperformed consensus EPS estimates. If Slack’s products are superior to Microsoft’s, it could become takeover bait for MSFT or another larger competitor in the space. A 2019 IPO at $26 per share In June 2019, Slack (WORK) had its initial public offering at $26 per share. At that level, the value of the company was around $15.70 billion. The demand for the shares caused it to move to $42 per share on June 20, 2019, which remains the all-time peak for WORK. In the wake of the offering, the stock dropped steadily. Source: Barchart As the chart shows, by late 2019, WORK shares reached a low of $19.53. A recovery took it back to just over the $30 level in early March 2020, but the global pandemic and risk-off period in the stock market pushed WORK to a low of $15.10 in mid-March. After an explosive move to a lower high at $40.07 in early June, the stock was back below the $30 per share level at the end of last week. Slack remains near its IPO price and the earnings are weak At $29.55 on July 31, WORK was trading just over the initial public offering price. Earnings have been problematic for the company over the past four quarters, but the company has consistently beat consensus analyst EPS projections. Source: Yahoo Finance As the chart shows, even though WORK has beaten the consensus estimates over the past four quarters, the best quarter resulted in a loss of two cents per share. In the challenging second quarter, the company beat the projections by four cents, but still posted a two cents per share loss. WORK had a market cap of just over $16.65 billion at the end of last week. The shares are active; an average of over 20 million change hands each day. Daniel and Goliath- Slack battles Microsoft Microsoft (MSFT) has a market cap that is almost one hundred times Slack’s. The company filed a complaint with the EU alleging that MSFT is violating competition laws by Teams bundling in its Office suite of products. MSFT is WORK’s leading competitor. Slack’s products have become more popular in recent years. The global pandemic that has increased the demand for home office services has only accelerated both the use of Slack products, but the company claims that MSFT’s bundling creates unfair competition. Slack’s communications and policy executive, Jonathan Prince, said, “We’re confident that we win on the merits of our product, but we can’t ignore illegal behavior that deprives customers of access to the tools and solutions they want.” Since Microsoft includes Teams with its Office software, it tends to launch when a work PC boots up. Slack has argued that this inflates Team users and other engagement metrics. In the late 1990s, as internet browsers emerged as a critical software application, MSFT leveraged its dominance of Windows to bundle Internet Explorer, which undermined Netscape and Navigator. The company lost one of the most substantial antitrust cases in US history during the browser war and was fined $730 million by the European Commission for the practice. WORK believes that the browser rulings are a precedent for the Teams bundling issue. If the EU commission rules in favor of WORK, the company’s profits, and shares are likely to rise, perhaps dramatically. Meanwhile, with an under $20 billion valuation, WORK could become a takeover target for either MSFT or other tech giants with massive market caps and enormous access to cash. Want More Great Investing Ideas? 9 “BUY THE DIP” Growth Stocks for 2020 How HIGH Can This Tech Bubble Fly? 7 “Safe-Haven” Dividend Stocks for Turbulent Times WORK shares were trading at $30.52 per share on Monday afternoon, up $0.97 (+3.28%). Year-to-date, WORK has gained 35.77%, versus a 3.30% rise in the benchmark S&P 500 index during the same period."}]}