{"article": [{"url": "https://stocknews.com/news/tsla-zm-shop-podd-4-overbought-stocks-trading-at-sky-high-multiples/", "published": 1594814900.0, "headline": "4 Overbought Stocks Trading at SKY HIGH Multiples", "body": "Since hitting lows on March 23rd, the stock market has been surging and many analysts believe that stock prices aren’t grounded in reality. That’s because were in a recession due the Coronavirus pandemic that could last for years. So, I figured I’d highlight a few overbought stocks trading at extremely high multiples. The term overbought refers to stocks that have a price higher than their actual value. One way to evaluate these stocks is by their price-to-earnings ratios (PEs). Here are four stocks with very high PEs. Though they are performing fantastically well, and their prices could even go higher, you may want to take some profits in these names as their valuations are sky-high: 7 \"SAFE HAVEN\" Dividend Stocks for Turbulent TimesTesla (TSLA) TSLA dominates the electric car market, with a 60% market share just attributed to their Model 3 vehicle. TSLA, which has a market cap that is almost double the size of General Motors and Ford (F), differs from other car manufactures as it takes a direct sales approach to reach consumers. TSLA also isn’t just a car company. It also develops various types of technology, such as batteries and self-driving software. The company can trace its success to its cars’ strong performance and sleek design. As the company ramps up Model 3 deliveries, it should help the company’s bottom line. In 2019, TSLA delivered 367,500 vehicles, which was an increase of 50% over the past year. TSLA is also ramping up production in China, which is the largest electric vehicle market. The stock has a trailing PE of 368.2, so it should surprise no one that TSLA is one of the top-rated stocks in our momentum-based POWR Ratings system . Overall, it is the #1 ranked stock in the Auto & Vehicle Manufacturers industry. Zoom Video Communications (ZM) ZM offers a cloud-based communications platform that incorporates audio, video, chat, and screen sharing functions. The company has significantly benefited from the shift to online learning and work from home. The company generates revenue from subscriptions to its premium features, including Zoom Video Webinars, Zoom Phone, and Zoom rooms. Zoom Video Webinars allows its users to conduct large online events that can support up to 10,000 attendees. In the company’s first-quarter fiscal 2021, it added a record number of new subscribers. The company is expanding its international presence, which should be a key growth catalyst going forward. The platform’s demand should continue to grow as social distancing, or some form of it should continue for the foreseeable future. The stock currently has a sky trailing PE of 500. How does ZM stack up for the POWR Ratings? A for Trade Grade A for Buy & Hold Grade B for Industry Rank A for Peer Grade A for overall POWR Rating And it is the #1 rated stock in the Technology – Services industry. Shopify (SHOP) SHOP provides a cloud-based, multi-channel commerce platform for small and mid-sized businesses. Merchants use the SHOP’s software to run their business across multiple sales, including a website, a mobile storefront, or even a physical location. The platform facilitates the business process through inventory management, order processing and payments, and managing customer relationships. SHOP is set to benefit from the growing market for e-commerce sales. The company’s platform provides the perfect solution for the ever-increasing needs of merchants. SHOP continues to add merchants through the additions of new features such as shipping partners and multiple payment processing. The company currently sports a ridiculous trailing PE of 1,094.8. All 4 scores of our exclusive POWR Ratings system are an A for the stock. If that wasn’t good enough, it is also the #1 ranked stock in one of the top industries, Internet – Services. Insulet (PODD) PODD is a leading developer, manufacturer, and marketer of the Omnipod Insulin Management System. It provides continuous insulin delivery for insulin-dependent diabetes. Instead of daily injections, the system has a device worn on the body for 3 days at a time. This certainly makes the lives of people with diabetes easier. The company has also partnered with biotech and pharmaceutical companies to tailor the system to other drugs. Even with the pandemic hanging over its head, the company achieved a first-quarter revenue growth of 25%. The company has avoided any supply chain issues and has even provided financial assistance to people who have lost insurance coverage because of the pandemic. PODD has four key strategies to continue its growth, including expanding Omnipod’s market access, executing on its innovation roadmap, building a U.S. manufacturing facility, and implementing its plan to sell in Europe. The stock has the highest trailing PE ratio on this list at 1,226.1. The stock has a Buy rating in our POWR Ratings system. It is ranked #20 out of 132 stocks in the Medical – Devices & Equipment industry. Want More Great Investing Ideas? 9 “BUY THE DIP” Growth Stocks for 2020 Top 5 WINNING Stock Chart Patterns 7 “Safe-Haven” Dividend Stocks for Turbulent Times TSLA shares . Year-to-date, TSLA has gained 269.57%, versus a 1.03% rise in the benchmark S&P 500 index during the same period."}]}