{"article": [{"url": "https://stocknews.com/news/ntes-pnr-wcn-sap-mxim-top-5-large-cap-dividend-stocks-for-july-9-2020/", "published": 1594296500.0, "headline": "Top 5 Large Cap Dividend Stocks for July 9, 2020", "body": "The top winners in the large cap US dividend space for Thursday, July 9, 2020 are NTES, PNR, WCN, SAP, and MXIM. Below is a recap of how they fared. NetEase Inc (NTES) Daily Price Recap NetEase Inc came into today up 6.31% ($28.7) from the open of the previous day, marking the 5th day in a row an upward move has occurred. The price move occurred on stronger volume; specifically, yesterday’s volume was up 122.86% from the day prior, and up 258.29% from the same day the week before. The daily price chart of NetEase Inc below illustrates. Its beta is lower than 91.37% of US dividend stocks. 7 Best ETFs for the NEXT Bull MarketWhat is the outlook for NTES? Use POWR Ratings for clearer insight into price direction. PENTAIR plc (PNR) Daily Price Recap PENTAIR plc is up 4.64% ($1.7) since yesterday, marking the 2nd day in a row it has gone up. As for how volume fared, yesterday’s volume was up 296.04% from the previous day (Tuesday), and up 168.78% from Wednesday of the week before. The daily price chart of PENTAIR plc below illustrates. As for PNR’s dividend discount model value score, it is currently higher than that of approximately 28.88% US dividend payers. Make investment decisions regarding PNR using the data that counts. Learn more about POWR Ratings. Waste Connections Inc (WCN) Daily Price Recap Waste Connections Inc is up 4.2% ($3.87) since the previous day, marking the 2nd day in a row an upward move has occurred. The price move occurred on stronger volume; specifically, yesterday’s volume was up 132.38% from the day prior, and up 107.31% from the same day the week before. Here is a daily price chart of Waste Connections Inc. Dividend investors may wish to pay attention to the annual compound dividend growth rate of dividend stocks, and for WCN, its higher than that of 75.65% of US dividend-issuing stocks. Make investment decisions regarding WCN using the data that counts. Learn more about POWR Ratings. Sap Se (SAP) Daily Price Recap Sap Se closed the previous day up 3.89% ($5.72); this denotes the 2nd day in a row it has gone up. The price move occurred on stronger volume; specifically, yesterday’s volume was up 297.38% from the day prior, and up 173.55% from the same day the week before. The daily price chart of Sap Se below illustrates. Dividend investors may wish to pay attention to the dividend yield of dividend stocks, and for SAP, its higher than that of 10.77% of US dividend-issuing stocks. What is the outlook for SAP? Use POWR Ratings for clearer insight into price direction. Maxim Integrated Products Inc (MXIM) Daily Price Recap Maxim Integrated Products Inc is up 3.85% ($2.39) since yesterday, marking the 2nd day in a row an upward move has occurred. The price move occurred on stronger volume; specifically, yesterday’s volume was up 38.04% from the day prior, and up 159.94% from the same day the week before. Here is a daily price chart of Maxim Integrated Products Inc. Dividend investors may wish to pay attention to the dividend discount model value score of dividend stocks, and for MXIM, its higher than that of 52.85% of US dividend-issuing stocks. Make investment decisions regarding MXIM using the data that counts. Learn more about POWR Ratings. To further your research on dividend stocks, check out our list of dividend stocks sorted by yield. Want More Great Investing Ideas? 9 “BUY THE DIP” Growth Stocks for 2020 Is the Bull S#*t Rally FINALLY Over? 7 “Safe-Haven” Dividend Stocks for Turbulent Times Top 3 Investing Strategies for 2020 NTES shares . Year-to-date, NTES has gained 58.53%, versus a -1.32% rise in the benchmark S&P 500 index during the same period."}]}