{"article": [{"url": "https://stocknews.com/news/nflx-dis-the-best-faang-stock-to-own-this-month/", "published": 1596629300.0, "headline": "The Best FAANG Stock to Own This Month", "body": "For the past two years, the streaming wars have heated up. What was once only Netflix (NFLX) is now an arena populated by the likes of Roku (ROKU), Facebook (FB), Disney (DIS), and countless others. So, which one should an investor target in the short-term? According to some seasonal quantitative data, heavyweights NFLX and DIS are on the opposite ends of a seasonality trend for August. Earlier this week, we profiled the 25 best stocks to own in August. One name that stood out on the list was streaming concern Netflix (NFLX). The FAANG name has taken advantage of the stay-at-home orders and social distancing, legging out a 75% gain in the last nine months. And if past is precedent, August should be more of the same for NFLX. More specifically, according to data from Schaeffer’s Senior Quantitative Analyst Rocky White, over the last 10 years, Netflix stock averages a monthly return of 4.8%, and was positive 70% of the time. That’s good for fifth best on the list, and the only FAANG name to be found on the top 25. 7 Best ETFs for the NEXT Bull MarketAt last check, NFLX was trading at $504.88, so a move higher of similar magnitude would put the stock at around $528, territory not seen since July 16. While the shares have taken a breather some in the last month, their 40-day moving average has stepped up as support, a trendline that in of itself also supports a historically bullish signal. The good news is that with earnings come and gone, options can be had for a pretty penny thanks to a volatility crush. The equity’s Schaeffer’s Volatility Index (SVI) of 39% stands higher than just 17% of annual readings. This means options players have been pricing in relatively low volatility expectations at the moment. Switching gears to Disney (DIS), the entertainment mogul is fresh off an upbeat post-earnings reaction of 8.8% from Wednesday, but is still down roughly 12% in 2020. However, according to White’s data, DIS is one of the 25 worst S&P 500 stocks to own in the last decade. More specifically, the blue-chip averages a monthly loss of -4.6% with only two of the returns positive in the last 10 years. And despite the shares’ big gains today, their 320-day moving average remains a stiff ceiling, an area that stymied a rally back in early June. Options are also an intriguing route for those betting on DIS, regardless of direction. The equity’s SVI of 39% sits in the 19th percentile of its annual range, so premium can be had for cheap. Subscribers to our free Schaeffer’s Market Recap newsletter receive a post-close analysis of the market delivered to their inboxes each day – including top news stories, big stock movers, earnings reports, and major index activity. See for yourself why Market Recap is one of our most popular news services. NFLX shares fell $0.42 (-0.08%) in after-hours trading Wednesday. Year-to-date, NFLX has gained 55.18%, versus a 4.25% rise in the benchmark S&P 500 index during the same period."}]}