{"article": [{"url": "https://stocknews.com/news/hd-fast-clx-chrw-4-growth-stocks-that-pay-dividends/", "published": 1598875700.0, "headline": "4 Growth Stocks that PAY Dividends Yielding at Least 2%", "body": "Growth stocks have been the most significant contributor to the strong performance of the S&P 500 index since its March lows. As the economists still expect a significant contraction of the global economy this year, there is a chance that the market will feel the impact sooner or later. However, stocks with solid earnings and revenue growth potential should keep attracting investors’ attention, and thus, supporting the market. The SPDR Portfolio S&P 500 Growth ETF (SPYG), which is an indicator of the performance of growth stocks, has gained close to 65% since hitting its low in mid-March. This compares to the S&P 500’s return of 51% over the same period. The SPDR Portfolio S&P 500 Value ETF (SPYV) has only gained 33% over the same period, so we can definitively conclude it’s a growth driven rally. Investing in high growth stocks in today’s market can possibly lead to significant returns over the long term. If we also limit our selections to stocks that pay high and consistent dividends, we can enjoy steady income along with capital appreciation. Home Depot, Inc. (HD), Fastenal Company (FAST), The Clorox Company (CLX), and C.H. Robinson Worldwide, Inc. (CHRW) exhibits both growth potential and dividend payouts. 7 Best ETFs for the NEXT Bull MarketHome Depot, Inc. (HD) HD is a retailer of home improvement products such as building materials, lawn and garden products, and home improvement tools. The company also provides home maintenance services. As of February, 2020, the company has been operating 2,291 stores in the US, but rather than relying on opening more stores to boost growth, the company is focusing on increasing the revenue and profit for each store. Over the last ten years, the revenue of the company has risen by 67%, while its profit has risen by 323%. The company generates a lot of cash flow compared to its capital expenditure, which allows it to periodically improve its dividend payouts. In the fiscal year 2019, the company reported a free cash flow of $13.7 billion compared to capital expenditures of $2.7 billion. Despite challenges posed by the spread of the coronavirus, the company managed a year-over-year growth in revenue of 7.1% for the quarter that ended on May 3rd. The company has significantly invested in its e-commerce capabilities which allowed it to retain customers despite lower footfall. The EPS of the company is expected to grow by 10.5% this year, along with revenue growth of 13.2%. HD has so far delivered a year-to-date return of 31.1%. The annual dividend of HD stands at $6.00, translating to a yield of 2.1%. How does HD stack up for the POWR Ratings? A for Trade Grade A for Buy & Hold Grade A for Peer Grade A for Industry Rank A for Overall POWR Rating You can’t ask for better. The stock is also ranked #1 out of 68 stocks in the Home Improvement & Goods industry. Fastenal Company (FAST) FAST focuses on the wholesale distribution of construction and industrial equipment in the US as well as internationally. In addition to selling parts for industrial equipment and construction, the company has diversified into selling safety equipment. The safety business of the company has paid off since demand for safety products more than doubled in April this year due to the spread of the coronavirus. FAST has partnered with the National Hockey League (NHL) for the 2023-2024 season to provide maintenance, repair, and operations services. The company has diversified into e-commerce which has ensured its resilience and growth amid the pandemic. FAST witnessed a growth in digital sales of 13.5% year-over-year for the quarter that ended on June 30th. FAST provides an annual dividend of $1.00 which translates into a yield of 2.05%. The EPS of the company is expected to grow by 5.8% this year and 6.8% next year. The revenue of FAST is estimated to grow by 4.9% this year and by 5.3% next year. FAST has delivered a year-to-date price return of 32.2%. It’s no surprise that FAST is rated a Strong Buy in our POWR Ratings system. It also has a grade of A for Trade Grade, Buy & Hold Grade, and Peer Grade. In the 57-stock Industrial – Equipment industry, it is ranked #1. The Clorox Company (CLX) CLX develops and sells goods in the cleaning, household, lifestyle segments both domestically and internationally. The company unveiled its IGNITE strategy last year that will drive growth for the company in the future. This strategy revolves around investing its profits into innovation and marketing. The new strategy also puts customers-first by making environmental, social, and corporate governance a priority. With growing environmental consciousness among consumers, the new sustainability-based approach may result in strong returns in the future. In addition to its growth prospects, CLX is also a dividend stock as it has increased its dividend payout four times over the last five years. CLX currently has an annual dividend of $4.4, which translates into a yield of 2.04%. CLX is expected to witness an EPS growth of 45.3% for the current quarter and 13.7% in the next quarter. The company is estimated to have revenue growth of 3.4% in the current year and 2.6%, the following year. The company has delivered a year-to-date return of 41.4% so far. CLX’s strong fundamentals are reflected in its POWR Ratings, with a Buy rating. It also has a grade of A for Trade Grade and Industry Rank. Within the Consumer Goods industry, it’s ranked #14 out of 34 stocks. C.H. Robinson Worldwide, Inc. (CHRW) CHRW engages in freight transportation and logistics for global industries. The company has recently launched a significant upgrade on its logistics platform Navisphere. The platform will now be able to integrate with 19 transportation management systems along with ERP systems. This will help shippers and transporters pull real-time data and pricing through existing platforms. This move makes it significantly easier for businesses to book and manage their logistics through CRHW’s platform. For the quarter that ended on June 30th, the company returned $68.4 million to shareholders through cash dividends and share repurchases. The company’s cash from operations totaled $447.1 million, which was a 124% increase from the same period last year. The company has an annual dividend of $2.04, which translates into a yield of 2.07%. CHRW’s EPS is estimated to grow by 26% over the next quarter and by 18.1% in the next year. The revenue of the company is expected to grow by 6.2%. The company has delivered a year-to-date return of 26.25% so far. It’s no surprise that CHRW is rated a Strong Buy in our POWR Ratings system. It also has a grade of A for Trade Grade, Buy & Hold Grade, and Industry Rank. In the 19-stock Trucking Freight industry, it is ranked #3. Want More Great Investing Ideas? 7 Best ETFs for the NEXT Bull Market Beware Stocks in September? 9 “BUY THE DIP” Growth Stocks for 2020 HD shares were trading at $285.04 per share on Monday afternoon, down $1.25 (-0.44%). Year-to-date, HD has gained 32.18%, versus a 9.65% rise in the benchmark S&P 500 index during the same period."}]}