{"article": [{"url": "https://stocknews.com/news/wmt-aci-sfm-imkta-supermarket-stocks-to-consider-as-pandemic-is-worsening/", "published": 1593691700.0, "headline": "Supermarket Stocks to Consider as Pandemic is Worsening", "body": "The coronavirus’s return is undoubtedly bad for the economy and social life, yet it is a boom to supermarket stocks. Continued fear of the virus will likely send the masses into supermarkets rather than restaurants, malls, and movie theaters. Let’s take a look at two large grocery stores likely to benefit from the uptick in supermarket shopping, and two smaller grocery stores poised to enjoy a revenue boost amidst the seemingly never-ending pandemic. Walmart (WMT) 9 \"BUY THE DIP\" Growth Stocks For 2020Consumer psychology during a pandemic favors large businesses with bargain basement prices and a seemingly endless inventory. WMT fits the bill. Though WMT has long lines and a gloomy shopping atmosphere, its prices cannot be beaten. Furthermore, WMT seems to have everything in stock, even amidst the pandemic. From groceries to home furnishings, cosmetics, school supplies, and beyond, WMT has everything in considerable supply. The coronavirus has been lingering in the United States much longer than other nations, meaning people will make likely make fewer trips to the supermarket. Instead, they will load up on supplies to hold them over for the next couple of weeks. This type of consumer behavior plays to WMT’s strengths. Plus, WMT online sales were up nearly 75% in the first quarter alone. WMT has a “Buy” rating in the StockNews.com POWR Ratings. The stock is ranked #7 out of 17 companies in the Grocers/Big Box Retail industry. Analysts have set a price target of $138.15 on the stock. Albertsons Companies (ACI) Every shopper would love the quick and easy access to an elite supermarket such as Wegmans or Whole Foods; unfortunately those chains are not located everywhere in the country. ACI is one step below those supermarket titans. While the ACI shopping experience is not on the same level as Wegmans, ACI shoppers are more than happy with the supermarket’s atmosphere and prices. ACI has more than 2,250 stores, employing nearly 300,000 people. The company is North America’s second-largest grocer. Aside from Albertsons supermarkets, ACI also owns and operates stores such as Vons, Safeway, Acme, and Jewel-Osco. The company recently went public after two botched attempts five years ago. A grocer of ACI’s size going public amidst a pandemic has the potential to pay off simply because people are flocking to grocery stores and not restaurants. Sprouts Farmers Market (SFM) The grocery sector is not exactly a growth industry, yet its stocks have garnered considerable attention as consumers bypass potentially virus-laden restaurants in favor of supermarket runs. This change in behavior is the primary reason SFM went from trading around $18 before the pandemic to its 52-week high of $26.84 in recent weeks. SFM puts the focus squarely on fresh produce, positioning the greens in the middle of its stores. The company is also known for its extensive vitamin and health food offerings. Take a walk through SFM stores, and you will find an abundance of plant-based, grass-fed, and keto-friendly products. SFM has a Strong Buy rating in the POWR Ratings. The stock is ranked 4th out of 17 companies in the Grocery/Big Box Retailer industry. Ingles Markets (IMKTA) The pandemic is shifting investor attention to businesses that sell essentials. It might be several months or several years until life returns back to normal in the United States as there is no clear plan for mitigating the spread of COVID-19. IMKTA is a regional grocer worth your attention. The stock is rated a Buy by POWR Ratings. It also has a Trade Grade of B. Trade Grade represents the short-term bullish or bearishness of a stock. Want More Great Investing Ideas? 9 “BUY THE DIP” Growth Stocks for 2020 Is the Bull S#*t Rally FINALLY Over? 7 “Safe-Haven” Dividend Stocks for Turbulent Times Top 3 Investing Strategies for 2020 WMT shares were trading at $119.79 per share on Thursday afternoon, up $0.10 (+0.08%). Year-to-date, WMT has gained 1.69%, versus a -1.40% rise in the benchmark S&P 500 index during the same period."}]}