{"article": [{"url": "https://stocknews.com/news/dxcm-yy-slab-bce-5-recently-upgraded-stocks/", "published": 1598616500.0, "headline": "5 Recently UPGRADED STOCKS", "body": "Our exclusive POWR Ratings system identifies the best and worst stocks based on quantitative data, fundamentals, and other factors. This system is updated daily to update ratings as appropriate. If you are on the prowl for a couple of new stocks to add to your portfolio, look no further than the latest POWR Ratings. There are thousands of stocks, and the POWR Ratings can help you identify the highest-quality stocks. Let’s take a look at five of the latest POWR Ratings upgrades: DexCom (DXCM), BCE (BCE), Insulet (PODD), YY (YY) and Silicon Laboratories (SLAB). DexCom (DXCM) 9 \"BUY THE DIP\" Growth Stocks For 2020Glucose monitoring systems are becoming that much more important as the number of diabetics continues to soar. DXCM makes, develops, and brings to market such monitoring systems. DXCM’s glucose monitoring systems continuously measure the blood glucose levels, transmitting the data to a diminutive receiver no larger than a smartphone. This transmission occurs in real-time. The POWR Ratings reveal DXCM has A grades in each POWR Component. DXCM is ranked third of 138 stocks in the Medical – Devices & Equipment category. The top analysts have set a price target of $473.40 on DXCM, meaning it likely has a 10% upside remaining. DXCM has soared 98% in value this year alone. All in all, only two socks in the S&P 500 have performed better than DXCM this year. DXCM revenue growth is up 44% despite the pandemic. As long as DXCM’s glucose monitors control glucose levels better than the competition’s devices, DXCM will continue to rake in the cash. BCE (BCE) You have the opportunity to invest in Canada’s top communications service provider in BCE. BCE provides phone service to nearly three-quarters of Canada. From phone service to satellite TV and additional data communications, BCE provides myriad telecom services. The POWR Ratings reveal BCE has A grades in each POWR Component but for its Industry Rank which is a B. BCE is ranked second of 35 stocks in the Telecom – Foreign category. Furthermore, BCE’s price returns are in the green in nearly every period, highlighted by a ’19 price return of nearly 24%. Take a look at TipRanks’ analysts’ predictions for the stock and you will find there is an average price target of $46.94, indicating the stock has a 7% upside. Furthermore, BCE has a fairly low forward P/E ratio of 19.72 considering it is a telecom. Add in the fact that BCE provides a dividend over 5% and you have every reason to own this stock. Insulet (PODD) Diabetes stocks have caught the attention of the investing community. Diabetes will likely threaten human health for decades to come, making the likes of PODD that much more attractive. PODD makes and markets an insulin management system that functions with a tubeless and disposable Omnipod device and a wireless handheld device. This simple and intuitive insulin delivery system is perfect for diabetics who desire a pain-free means of monitoring their glucose levels. PODD has A POWR Rating grades in each component but for its Peer Grade of B. PODD is ranked in the top 10 of more than 130 stocks in the Medical – Devices & Equipment category. Furthermore, PODD has price returns in the green going back to 2017. PODD had a ’19 price return of 115.83%. The analysts are quite bullish on PODD, setting a price target of $239.69, indicating the stock has more than 11% upside. YY (YY) Social communication on the web is quickly replacing interpersonal communication that occurs face-to-face. YY is benefitting from this phenomenon. YY provides an intuitive social communication platform that empowers people to communicate on the web in real-time either through video or text. YY’s POWR Ratings are nearly perfect: A grades in all Components but for its Industry Rank grade of B. Furthermore, YY has a rank of 7 out of 115 China Stocks. YY’s year-to-date price return is 73.71%. YY has a reasonable forward P/E ratio of 25.63 for a tech stock. The analysts insist YY is currently undervalued at its price of $91.50, insisting it will move up to $113.80. Scoop up this Chinese social media stock, hold it for years and you are likely to double or triple your investment. Silicon Laboratories (SLAB – Rated “A” – Strong Buy) The Internet of Things (IoT) and the web as a whole will become even more important for daily living and conducting business in the years and decades ahead. SLAB designs and makes the circuits used in the IoT applications along with the web’s infrastructure, automotive industry, and industrial automation. SLAB had a ’19 price return of 47%. The stock also generated a three-year price return of nearly 39%. If SLAB reaches the analysts’ price target of $116.25, it will have increased in value by nearly 14%. Now that SLAB has completed its acquisition of Redpine Signals’ connectivity operations, the stock has a launching pad to reach new heights. Look for SLAB to return to its pre-COVID trading level of $105 to $120 before the final quarter of 2020. Want More Great Investing Ideas? 7 Best ETFs for the NEXT Bull Market Why Stocks Could Drop 20% in September? 9 “BUY THE DIP” Growth Stocks for 2020 DXCM shares were trading at $419.00 per share on Friday afternoon, down $8.75 (-2.05%). Year-to-date, DXCM has gained 91.55%, versus a 10.06% rise in the benchmark S&P 500 index during the same period."}]}