{"article": [{"url": "https://stocknews.com/news/jnj-mmm-dg-3-stocks-to-recession-proof-your-portfolio/", "published": 1601381300.0, "headline": "3 Stocks to “Recession-Proof” Your Portfolio", "body": "The US economy suffered a massive downturn at the start of the coronavirus pandemic, and the outlook is getting gloomier, despite reopening of major economic activities. There are several indicators of ongoing weakness in the economy, such as rising unemployment, weaker manufacturing data, subdued consumer confidence, and a weakness in the US dollar as compared to other currencies. Making investment decisions during a recession can be head-scratching and counterintuitive, however, they may prove to be rewarding as well. Companies that are resilient during a recession most likely perform better than the rest of the market when the economy starts recovering. Usually, companies providing essential products or services with an inelastic demand are considered recession proof. Consumers buy products and services that these companies offer even if they are forced to reduce their discretionary spending. So, it can be a good idea to invest in certain “recession-proof” stocks to provide some capital appreciation, or at the very least help protect your net worth during these uncertain times. 9 \"BUY THE DIP\" Growth Stocks For 2020Johnson & Johnson (JNJ), 3M Company (MMM), and Dollar General Corporation (DG) have performed well so far this year and are well positioned to show strength even if the recession deepens. The business models and corporate initiatives of these companies ensure their continued relevance. Johnson & Johnson (JNJ) JNJ researches, develops, manufactures, and markets healthcare products worldwide. The company operates in the consumer, pharmaceutical, and medical devices markets. The stock has delivered approximately 32.4% since hitting its low in mid-March. The company is involved in developing a COVID-19 vaccine, which has shown promise in early trials. JNJ has also recently launched the “My Health Can’t Wait” platform in an effort to provide resources and education to people and healthcare professionals. This move could help the company gain more goodwill and trust in the market. Given the essential nature of JNJ’s products, the company is not likely to see a decline in its revenues, despite the weakness in the overall economy. The company’s work on a coronavirus vaccine could provide a period of high gains as well. The company’s revenue is expected to grow 3.2% next quarter and 8.5% next year. JNJ’s EPS is estimated to rise 14.9% next year and at a rate of 5% per annum over the next five years. How does JNJ stack up for the POWR Ratings? B for Trade Grade A for Buy & Hold Grade A for Peer Grade B for Industry Grade B for Overall POWR Rating The stock is also ranked #10 out of 239 stocks in the Medical – Pharmaceuticals industry. 3M Company (MMM) MMM manufactures, develops, and markets products in the electronics, telecommunications, health care, safety sectors. The company’s products include adhesive and tapes for the aerospace and aircraft maintenance industry, OEMs for the UAV industry, and more. MMM’s stock has gained around 29.4% since hitting its low in mid-March. MMM is considering the sale of its food safety business at a valuation of $3.5 billion. Moreover, the company has been developing and selling coronavirus-related products such as N95 masks, hand sanitizers, disinfectants, and air filtration devices to meet the market demand for these products. The company’s highly diverse product portfolio and involvement in several key industries could help make it resilient against the oncoming recession. The company’s revenue is expected to grow 1.7% this quarter and 4.9% next year. MMM’s EPS is estimated to rise 10% next year and at a rate of 2.7% per annum over the next five years. It’s no surprise that MMM is rated a “Buy” in our POWR Ratings system, with a grade of “A” in Trade Grade and Industry Rank. In the 60-stock Industrial – Machinery industry, it is ranked #15. Dollar General Corporation (DG) DG has been operating as a discount retailer that offers a wide range of merchandise including apparels, home products, and consumables. The stock has gained 34.5% so far this year. DG is another recession-proof company since consumers look to shop at the cheapest rates possible during a downturn. The company operates stores across America, and around 75% of Americans live within five miles of a DG store. In the last quarter, the company reported a 19% year-over-year increase in sales, despite the ongoing pandemic. The company is still opening up new stores across America and plans to hire 50,000 new employees. DG’s revenue is expected to grow 19.7% this year and 1.3% next year. The company’s EPS is estimated to rise 51.4% this year and at a rate of 14.8% per annum over the next five years. DG’s strong fundamentals are reflected in its POWR Ratings, it has a “Strong Buy” rating with a “A” in Trade Grade, Buy & Hold Grade, Peer Grade, and Industry Rank. In the 18-stock Grocery/Big-Box Retailer industry, it is ranked #3. Want More Great Investing Ideas? 7 “Safe-Haven” Dividend Stocks for Turbulent Times When Does the Next Bull Run Start? Chart of the Day- See the Stocks Ready to Breakout JNJ shares were trading at $146.53 per share on Tuesday afternoon, down $0.58 (-0.39%). Year-to-date, JNJ has gained 2.47%, versus a 5.06% rise in the benchmark S&P 500 index during the same period."}]}