{"article": [{"url": "https://stocknews.com/news/odfl-knx-sndr-3-trucking-stocks-for-a-pandemic-proof-portfolio/", "published": 1594382900.0, "headline": "3 Trucking Stocks for a Pandemic \"Proof\" Portfolio", "body": "The Covid-19 outbreak has made the freight environment challenging. A sharp decline in discretionary consumer spending reduced shipments of non-essential goods, which resulted in carriers taking a hit when the pandemic started. However, the industry started experiencing an increase of shipments in May due to increased demand for shipping small packages — less than truckload (LTL) freight. The changes in consumer shopping habits and increased dependence on online orders, have helped trucks get back on the road. This, along with lower gas prices and an increase in demand for auto parts, helps trucking stocks move higher. As the demand for essential consumer goods keeps increasing, the industry’s prospects look bright. 9 \"BUY THE DIP\" Growth Stocks For 2020Here are three trucking stocks that could add value to your portfolio: Old Dominion Freight Inc. (ODFL) ODFL is an American motor carrier that focuses on LTL freight services. The company has been able to cope with the economic downturn and has been trying to minimize its variable costs. ODFL is well-positioned to accommodate an increase in customer demand if such a situation arises. In the first quarter, ODFL’s operating ratio improved to 81.4% from 82% in 2019, reflecting management’s efficiency in generating revenue while keeping costs low and demonstrating its capability to face adversity. ODFL reported a 0.9% year-over-year increase in earnings per share in the first quarter. The stock returned 39.7% year to date. ODFL is trading around its 52-week high of $178.90, which indicates a bullish trend. ODFL’s strong balance sheet could make it a worthwhile investment for the long term. How does ODFL stack up for the POWR Ratings? A for Trade Grade A for Buy & Hold Grade B for Peer Grade B for Industry Rank A for overall POWR Ratings It ranks #1 out of 19 in the Trucking Freight Industry Knight Swift Transportation Holdings Inc. (KNX) KNX is an Arizona based multiple truckload carrier and logistics service company that has been formed by the merger of Knight Transportations Inc. and Swift Transportation Company. KNX has an efficient cost management approach and a strong balance sheet with a significant amount of liquidity, which will help weather the storm during these turbulent times. KNX’s diverse operating model has enabled the company to meet customers’ demands and adapt to the “new normal” environment. KNX’s debt to equity ratio of 0.08 is a testament to its strong financial health and capability to sustain its business in the long term. In the first quarter of this year, the trucking segment of KNX had an adjusted operating ratio of 86.5%, which indicates a 20 basis points increase over the prior-year quarter. The stock is approaching its 52-week high of $44.71, which could mean a bullish trend. Our POWR Ratings system rates KNX as a Strong Buy. It has a grade of A in all POWR components except Industry Rank,which has a grade of B. In the Trucking Freight industry, it’s ranked #3. Schneider National, Inc. (SNDR) SNDR is a Wisconsin based transportation and logistics company that focuses on truckload, intermodal, and logistics services. SNDR launched Schneider Freight power last month, which provides flexible capacity network, storage, and qualified carriers to shippers. SNDR has a strong balance sheet and sufficient liquidity, which will help the company focus on safety and sustain it’s long-term business. The broad range of services available on SNDR’s quest technology platform satisfies customers’ dynamic supply chain needs. SNDR delivered a new carrier marketplace in collaboration with Blue Yonder, which provides higher efficiency and accessibility to shippers. In the first quarter, SNDR’s operating ratio improved 60 basis points year over year to 95.1%, and the company’s diluted earnings per share increased by 19% year over year. SNDR has a dividend yield of 1.03%, and the stock returned 50.1% over the past year. The proximity of the stock’s price to its 52-week high of $25.54 could mean a bullish trend. Our POWR Ratings system rates SNDR as a Strong Buy. It has a grade of A in all POWR components except Industry Rank, which is a grade of B. It is the ranked #4 stock in the Trucking Freight industry. Want More Great Investing Ideas? 9 “BUY THE DIP” Growth Stocks for 2020 Is the Bull S#*t Rally FINALLY Over? 7 “Safe-Haven” Dividend Stocks for Turbulent Times Top 3 Investing Strategies for 2020 ODFL shares were trading at $177.23 per share on Friday afternoon, up $0.81 (+0.46%). Year-to-date, ODFL has gained 40.31%, versus a -0.74% rise in the benchmark S&P 500 index during the same period."}]}