{"article": [{"url": "https://stocknews.com/news/dis-sq-v-sbux-4-stocks-to-buy-and-hold-for-the-next-decade/", "published": 1598270900.0, "headline": "4 Stocks to Buy and Hold for the Next Decade", "body": "Buying a high-quality company and then holding for the long-term is one of the best strategies for investors to build wealth in the stock market. It lets investors compound their investments for the long-term. Also, the advantages of this strategy include saving on taxes, simplicity, and efficiency. The problem with short-term trading strategies is that you are constantly battling against hard-wired emotions which compel you to sell at the bottom and buy at the top. Buying-and-holding lets you take advantage of the long-term growth of companies and the economy, Disney (DIS), Visa (V), Starbucks (SBUX) and Square (SQ) are four stocks which are ideal candidates to buy and hold for the next decade: 7 Best ETFs for the NEXT Bull MarketDisney (DIS) The best investors overlook short term hurdles with an overarching focus on returns in the years and decades to come. Society will eventually get past COVID-19, creating the opportunity for DIS to rake in dollars through customer admission to its theme parks. However, DIS revenue extends well beyond gate admissions at theme parks. DIS is an entertainment giant with revenue streams stemming from video games to streaming video, sports, movies, and more. From the popular video game series Kingdom Hearts to ESPN sports programming, Lucasfilm movies, the Disney Plus streaming service, ABC TV, and beyond, Disney has its hands in seemingly countless revenue pies. This means it is not that big of a deal if DIS theme parks have a considerable decline in attendance across the next year or two. DIS will hold strong as time progresses, gradually reaching new heights to the delight of patient investors. The DIS POWR Ratings reveal the company has A grades in the Peer Grade and Trade Grade Components along with a B Industry Rank. DIS is ranked above the other 13 stocks in the Entertainment – Sports & Theme Parks category. The top analysts rate DIS a Moderate Buy with 12 out of 22 insisting it is worthy of a Buy rating, 8 advising investors to hold, and only two recommending investors sell. Look for DIS to trend higher in the short-term as a result of its Disney Plus momentum that continues to strengthen thanks to a recent alliance with Verizon. Furthermore, DIS is likely to also trend upward in the years and decades to come as both children and adults alike are infatuated with DIS intellectual property. Visa (V) Electronic payments will continue to be processed even if the virus lingers and it takes the economy an entire decade to fully rebound. V’s transaction processing services are comprised of authorization, clearance, and subsequent settlement. However, the company also provides payment products under its Visa brand for financial institution clients. Add in the fact that V is hard at work on adding a digital currency based on the blockchain to its collection of offerings and it is easy to see why the top analysts recommend buying and holding this stock for years. If you have any doubt as to whether V is worthy of a position in your portfolio, consider its POWR Ratings. V has A grades in all POWR Components. The stock is ranked first of 45 in the Consumer Financial Services category. The top analysts have set a price target of just under $220 for V, insisting it will increase in value by at least 7%. V is likely to move past its 52-week high of $214.17 in the months ahead as that many more consumers and businesses forego cash in favor of electronic payments. Furthermore, if the federal government gives the green light for tangible cash to be replaced by digital currency in the years ahead, V has the potential to benefit as the company is working on its cryptocurrency based on the blockchain. The bottom line is V is worth buying and holding as our economy shifts away from cash transactions at brick-and-mortar establishments to digital transactions transmitted on the internet. Starbucks (SBUX) No matter how bad the economy gets, the masses hooked on caffeine will still shell out money for SBUX coffee and other caffeinated products. SBUX revenue stems from its retail stores, licensed stores, and packaged goods sold to consumers at stores across the globe. SBUX is closing a considerable number of stores and reformatting others to shift toward drive-thru and carry-out service as opposed to sit-down cafes. This is a wise move because the virus might linger for years or indefinitely. Furthermore, the coveted millennial and Generation Z age cohorts prefer on-the-go consumption rather than traditional sit-down coffee shops. The SBUX POWR Ratings show SBUX has an A grade in its Trade Grade, B grades in its Peer Grade and Industry Rank Components, and an industry rank of six out of nearly 50 restaurant stocks. The analysts insist SBUX will not be fairly priced until it increases 7% to $83 and change. Square (SQ) Jack Dorsey, the man behind Twitter (TWTR), is the CEO of SQ. Check out the investment message boards on the web and you will find SQ is frequently discussed as a buy and hold stock everyone should own. SQ makes it easy for businesses to process payments on the web. The company also provides the popular Cash App that empowers everyday people to transmit cash to one another. SQ is poised to steal market share from PayPal’s Venmo service in the years ahead. Look for SQ to move toward $200 as that many more businesses transition to online sales amidst the pandemic. If you are uncertain as to whether SQ is a solid investment, consider its POWR Ratings A grade in the Buy & Hold Component. The stock also has A grades in the remaining POWR Components but for its Industry Rank of B. Furthermore, SQ is ranked second of 160 Financial Services (Enterprise) stocks. This is a future superstar stock that could easily be priced above $500 by 2022 or even sooner. Want More Great Investing Ideas? The Best of StockNews 2 Step Process to Sell @ Market Top in September 9 “BUY THE DIP” Growth Stocks for 2020 DIS shares rose $0.02 (+0.02%) in after-hours trading Monday. Year-to-date, DIS has declined -9.64%, versus a 7.64% rise in the benchmark S&P 500 index during the same period."}]}