{"article": [{"url": "https://stocknews.com/news/eqix-psa-exp-iipr-4-strong-buy-reits-to-buy-in-october/", "published": 1601986100.0, "headline": "4 \"Strong Buy\" REITs to Buy in October", "body": "REITs were hit hard by the pandemic, as the demand for real estate spaces, primarily for commercial use, declined sharply in the first half of this year. According to the Nareit Total REIT Industry Tracker Series report, U.S. REIT earnings declined 9% year-over-year in the first quarter of 2020. However, the industry fared relatively well compared to S&P 500, whose earnings declined 13.8% from the year-ago value over the same period. Many REITs responded to this economic crisis tactfully to curtail their losses, especially through cash injections to drive their liquidity. As REITs are highly dependent on debt, the low interest rate environment is also working in their favor. Also, REITs operating in the technology and cloud computing industry fared relatively well, with a strong demand for high speed connectivity throughout the country under the new normal. Most REITs maintained low leverage ratios throughout the pandemic, allowing them to reduce their interest expense and debt repayment burden during this time. Lower debt burden allowed these REITs to stay in business even in the face of financial losses due to the pandemic. With the gradual reopening of the economy, the demand for REITs is increasing. REITs such as Equinix, Inc. (EQIX), Public Storage (PSA), Extra Space Storage, Inc. (EXR), and Innovative Industrial Properties, Inc. (IIPR) are well positioned to soar in the upcoming quarters. 7 Best ETFs for the NEXT Bull MarketEquinix, Inc. (EQIX) EQIX invests in interconnected International Business exchange (IBX) and data centers across North and South America, EMEA, and the Asia Pacific. Its data center offerings can be categorized into three segments – Equinix Data Hub, Equinix Performance Hub, and Equinix Cloud Exchange. The United States Environmental Protection Agency (EPA) gave EQIX a 2020 Green Power Leadership award for its commitment to voluntarily contributing to the green power market. On August 6th, EQIX entered into an agreement to become a Google Cloud Premier partner, ensuring more agile and scalable hybrid multi cloud services for digital transformation and enterprise growth. On August 11th, EQIX announced its expansion to India by acquiring GPX Global Systems for an all cash transaction of $161 million. It also acquired 13 Bell data centers in Canada for $780 million in October. EQIX became a strategic supplier of critical interconnection to mobile, IoT, and cloud ecosystems to Nokia’s Worldwide IoT Network Grid. It also collaborated with VMware to help companies accelerate their digital transformation globally. These strategic partnerships are expected to drive EQIX’s earnings and revenue in the upcoming quarters. The consensus FFO estimate of $1.66 for the third quarter that ended September 2020 indicates a 17.3% increase year-over-year. The consensus revenue estimate of $1.50 billion for the upcoming quarter indicates 7.6% growth from the same period last year. EQIX’s financial performance in the past quarter was impressive as well. EQIX’s revenue increased 6% year-over-year to $1.47 billion in the second quarter that ended June 2020, with a record 16% year-over-year growth in interconnection revenues. Gross profit increased 6.4% from the year-ago value to $730.78 million. EQIX has gained more than 65% since hitting its 52-week low of $477.87 in March. The stock hit its 52-week high of $805.81 in August. How does EQIX stack up for the POWR Ratings? A for Trade Grade A for Buy & Hold Grade A for Peer Grade B for Industry Rank A for Overall POWR Rating. It is also ranked #1 out of 6 stocks in the REITs- Data Centers group. Public Storage (PSA) PSA owns and operates storage facilities across the United States. It operates through three segments, namely self-storage operations, ancillary operations and investment in PS business parks (42% equity stake) and Shurgard Europe (35% equity stake). PSA offers storage spaces for personal and business use on a monthly lease basis. PSA’s FFO for the second quarter that ended June 2020 declined slightly to $2.28 per share due to COVID related losses. However, the company managed to generate $597.35 million in revenues despite the reduced demand and business disruptions. PSA recently announced the offering of cumulative preferred shares of beneficial interest in two series, which is estimated to raise approximately $550 million in gross proceeds. This is expected to help the company revive its operations and help in business development in the upcoming quarters. PSA’s FFO is expected to grow at 17% per annum over the next five years. PSA has gained more than 45% since hitting its 52-week low of 155.37 in March. The company is rated “Strong Buy” in our POWR Ratings system, consistent with its sound business model and growth momentum. It has an “A” for Trade Grade, Buy & Hold Grade, Peer Grade, and Industry Rank. It is also ranked #2 out of 21 stocks in the REITs- Industrial sector. Extra Space Storage, Inc. (EXR) EXR owns, operates and maintains self-storage properties across the United States. It’s operational segments include rental operations, tenant reinsurance and property acquisition, development and management. EXR’s core FFO increased marginally year-over-year to $1.23 per share in the second quarter that ended June 2020. Same store occupancy rose 100 basis points from the same period last year to 94.5%. It also added 31 stores to EXR’s third party management platform. Though the consensus FFO estimate of $0.78 per share for the third quarter that ended September 2020 indicates a slight decline, EXR beat the street FFO estimates in each of the trailing four quarters, which bodes well for the stock. Its FFO is expected to grow at a rate of 6% per annum over the next five years. EXR gained more than 55% to hit its year-to-date high of $113.19 in September since hitting its 52-week low of $72.70 in March. It’s no surprise that EXR is rated “strong Buy” in our POWR Ratings system. It has an “A” in Trade Grade, Buy & Hold Grade, and Peer Grade, and a “B” in Industry Rank. In the 21-stock REITs- Industrial group, EXR is ranked #3. Innovative Industrial Properties, Inc. (IIPR) IIPR engages in acquiring and managing specialized industrial properties and leases them to state licensed operators for cultivation, processing and distribution of cannabis for medical use. On October 2nd, IIPR entered into an agreement with Green Thumb industries to construct a cannabis cultivation facility as well as extend the lease tenure for existing medical cannabis processing facilities on the property. IIPR also acquired properties in Florida, Michigan, and Illinois over the past two months for business expansion purposes. IIPR’s revenues increased 183% year-over-year to $24.30 million in the second quarter that ended June 2020. Its AFFO grew 263% from the prior year quarter to $1.19 per share, while net income rose 322% from the same period last year to $13 million. The consensus FFO estimate of $0.78 for the third quarter that ended September 2020 indicates a 41.8% rise year-over-year. The consensus revenue estimate of $110.15 million for the current year indicates a 146.6% improvement from the year-ago value. IIPR has gained more than 220% since hitting its 52-week low of $40.21 in March. The stock hit its 52-week high of $130.25 in September. IIPR is rated “Strong Buy” in our POWR Ratings system, with an “A” for Trade Grade, Buy & Hold Grade, and Peer Grade, and “B” for Industry Rank. It is also ranked #7 out of 21 stocks in the REITs- Industrial group. Want More Great Investing Ideas? Do NOT Buy Stocks Before the Election! 7 “Safe-Haven” Dividend Stocks for Turbulent Times Chart of the Day- See Christian Tharp’s Stocks Ready to Breakout EQIX shares were trading at $786.37 per share on Tuesday afternoon, down $1.89 (-0.24%). Year-to-date, EQIX has gained 36.29%, versus a 5.66% rise in the benchmark S&P 500 index during the same period."}]}