{"article": [{"url": "https://stocknews.com/news/luv-aal-dal-ual-brk-a-is-the-airline-industry-on-the-road-to-recovery/", "published": 1598530100.0, "headline": "Is the Airline Industry on the Road to Recovery?", "body": "The airline sector was soaring high and reporting record profits at the start of 2020. Then the COVID-19 pandemic struck, decimating several industries. But the capital-intensive airline companies have been the worst hit. As governments shut down airports and grounded flights, airline companies burnt millions of dollars each day as travel came to a standstill. According to experts, this crisis is unprecedented and many companies have reported billions of dollars in losses for the June quarter. It might take three more years for air traffic and passenger capacity to reach pre-COVID levels which does not bode well for the sector. In 2019, the airline industry reported an average operating margin of 7% while net margins were about 5%. We can see that even an 8% drop in sales will push companies towards an operating loss. 7 Best ETFs for the NEXT Bull MarketAccording to a Bloomberg report, the International Air Transport Association (IATA), estimates air carriers to lose a cumulative $84 billion in 2020 and another $16 billion in 2021 due to the pandemic. Comparatively, the total losses in this sector during the financial crisis of 2008-09 stood at $31 billion. The outlook is grim and several airlines might reach out to governments for bailout packages. While lockdowns restrictions are lifted and air traffic has experienced an uptick, the airline industry is grappling with significant debt that stands at a massive $120 billion. As global travel was non-existent, several companies raised debt to pay their fixed costs and maintain operations. However, rising interest costs at a time when revenues have plummeted will burden company financials and increase the risk of default or bankruptcies. IATA warns of record loss for airlines In June, IATA said that the expected decline in passenger revenue has widened to $371 billion, up from its previous forecast of $314 billion in April. IATA CEO Alexandre de Juniac said, “Losses this year will be the biggest in aviation history. There is no comparison for the dimensions of this crisis.” It expects losses to account for between 15% and 30% of sales and airlines should brace for a period of extended losses even if there is no second wave of the dreaded virus. IATA also estimates the airline sector to end 2020 with $550 billion in total debt. It indicates debt will be 16 times earnings in 2021, above from just 4.6 times in 2019. The airline companies will find it difficult to raise fresh equity capital given the ongoing uncertainties and there is a strong possibility that governments will hold equity stakes in multiple airlines to keep them operational. Warren Buffett dumped airline stocks When the world’s most famous investor exits an industry, you know there are serious issues plaguing the sector. In April 2020, Warren Buffett-owned Berkshire Hathaway (BRK.A) exited the airline space earlier this year and sold off the entire stake in companies including United Airlines (UAL), Southwest Airlines (LUV), American Airlines (AAL), and Delta Air Lines (DAL) that was worth over $4 billion at the end of 2019. During Berkshire Hathaway’s annual shareholder meeting, Buffett warned, “The world has changed for the airlines. And I don’t know how it’s changed and I hope it corrects itself in a reasonably prompt way…….I think there are certain industries, and unfortunately, I think that the airline industry, among others, that are really hurt by a forced shutdown by events that are far beyond our control.” While the broader indexes have recovered from their March lows, the airline sector understandably is struggling to get on its feet. Shares of United Airlines, Southwest Airlines, American Airlines, and Delta Airlines are down 61%, 33%, 55%, and 49% respectively year-to-date. What next for the aviation industry? The U.S. government has already provided $25 billion as part of a bailout package to major U.S. airlines to avoid widespread employee layoffs. The economic stabilization package will help companies keep employees on their payroll while another $25 billion will be paid in loans which might be convertible. The airline companies who have accepted the bailout package will not be able to buy back shares or pay dividends till September 2021 and will limit executive pay till March 2022. The moratorium expires next month and airline companies will then downsize the workforce to meet falling demand. American Airlines ended Q2 with a debt of $40 billion and a cash balance of $9.8 billion. Analysts expect sales to fall by 62% year-over-year to $17.46 billion in 2020. Delta Airlines ended Q2 with a debt of $34.4 billion and a cash balance of $15.7 billion. Analysts expect sales to fall by 62% year-over-year to $17.85 billion in 2020. The debt balance for Southwest Airlines and United Airlines stands at $11.5 billion and $24.9 billion respectively. Southwest Airlines remains the best place among top airline companies given its cash balance of $14.6 billion and liquidity position. The final takeaway The sell-off in airline stocks has resulted in depressed valuations. While these stocks are trading at cheap multiples, it might take a long-time for them to rebound to pre-pandemic prices. Even though travel restrictions are lifted, the threat of COVID-19 looms large. People will delay travel plans and the global economic recession will further delay the industry’s recovery. In case you are looking to place a contrarian bet on airline stocks, investing in Southwest Airlines seems the most logical choice. Southwest has never filed for bankruptcy and has the cleanest balance sheet among top carriers. The company recently confirmed that it has enough cash for two years at its current burn rate which gives it considerable leeway to ride the downturn. Want More Great Investing Ideas? 7 Best ETFs for the NEXT Bull Market Why Stocks Could Drop 20% in September? 9 “BUY THE DIP” Growth Stocks for 2020 LUV shares were trading at $37.79 per share on Thursday afternoon, up $1.41 (+3.88%). Year-to-date, LUV has declined -29.72%, versus a 9.30% rise in the benchmark S&P 500 index during the same period."}]}