{"article": [{"url": "https://stocknews.com/news/atvi-grvy-ea-ttwo-why-this-video-game-stock-is-rated-buy/", "published": 1600430900.0, "headline": "Why This Video Game Stock is Rated “Buy”", "body": "Activision Blizzard, Inc (ATVI) is an interactive entertainment company that develops and distributes content on video game consoles, personal computers, and mobile devices worldwide through retail and digital channels. As one of the most popular gaming platforms worldwide, ATVI had a monthly active user base of 428 million as of June 30th. ATVI is benefiting from a range of massively successful titles well-known to gamers all over the world. The company boasts flagship franchises including Call of Duty, Overwatch, Diablo, StarCraft, and Candy Crush among others. New console releases are a prime catalyst for share price appreciation. Both Microsoft (MSFT) and Sony (SNE) will be releasing new consoles this fall. Microsoft’s Xbox Series X, and Sony’s PlayStation 5 next generation platforms will both be released in coming quarters. Gamers are expected to purchase plenty of ATVI titles which is sure to bolster its revenues. ATVI’s top-line increased 38% year-over-year to $1.93 billion in the second quarter. EPS for the quarter came in $0.75, growing 77% from the comparable quarter last year. Moreover, free cash flow for the firm increased 494% year-over-year to $755 million. This impressive performance and the potential upside based on a number of factors, has helped it earn a “Buy” rating in our proprietary rating system. 7 Best ETFs for the NEXT Bull MarketHere is how our proprietary POWR Ratings system evaluates ATVI: Trade Grade: B ATVI is currently trading near its 50-day moving average of $81.43, but higher than its 200-day moving average of $68.45, indicating that the stock is in an uptrend. In fact, the stock’s 52.3% return over the past six months reflects solid short-term bullishness. ATVI reported excellent second-quarter results. Digital revenue accounted for 82% of its total revenues. Operating metrics such as net bookings of $2.08 billion improved 72% from the comparable period last year. Moreover, the company issued $2 billion worth senior notes in August to improve its liquidity. Buy & Hold Grade: B ATVI is well positioned in terms of proximity to its 52-week high, which is a key factor that our Buy & Hold Grade takes into account. The stock is currently trading just 10.2% below its 52-week high. The stock has gained more than 44% over the last year. Strong execution of expanding audience reach, engagement, and player investment are enabling ATVI to serve fantastic experiences to an enlarged gaming audience, amid a high demand because of stay-at-home practices. Moreover, it has an impressive performance history, as its EPS grew at a CAGR of 16.5% over the past three years. Peer Grade: B ATVI is currently rated #2 out of 14 stocks in the Entertainment – Toys & Video Games industry. Other popular stocks in the industry are GRAVITY Co., Ltd (GRVY), Electronic Arts Inc. (EA) and Take-Two Interactive Software, Inc. (TTWO). ATVI has gained more than 33% year-to-date. While GRVY has performed better than ATVI by gaining 243.6% year-to-date, EA and TTWO returned 16.5% and 30.2%, respectively, over this period. Industry Rank: C The Entertainment – Toys & Video Games industry is ranked #84 out of the 123 StockNews.com industries. The sector was flourishing even before the pandemic, but the gaming industry is gaining more popularity each passing day, as people are turning toward online gaming for spending their leisure time while staying at home due to the pandemic. According to the Newzoo’s Global Games Market Report, the number of gamers worldwide is on a rise and will exceed three billion by 2023. Overall POWR Rating: B (Buy) ATVI is rated a “Buy” due to its valuable gaming franchises, steady growth in its user base, and short-and-long-term developments, as determined by the four components of our overall POWR Rating. Bottom Line ATVI has remained profitable and maintained its leadership position during the pandemic. It has the potential to grow further based on the rapid growth in demand for video games, a large global customer-base, and strong operational performance. Furthermore, the company expects to launch major new content into key franchises with meaningfully larger audiences in the coming quarters. Analyst sentiment, which gives a good sense of a stock’s future price movement, is pretty impressive for ATVI. An average broker rating of 1.2 indicates a favorable analyst sentiment. Of the 30 Wall Street analysts that rated the stock, 24 have given it a “Strong Buy” rating. The market expects EPS to grow 24.4% annually for the next five years. Want More Great Investing Ideas? 7 Best ETFs for the NEXT Bull Market Stock Market Outlook: Before & After the Election Chart of the Day- See the Stocks Ready to Breakout ATVI shares were trading at $78.72 per share on Friday afternoon, down $0.05 (-0.06%). Year-to-date, ATVI has gained 33.35%, versus a 3.48% rise in the benchmark S&P 500 index during the same period."}]}