{"article": [{"url": "https://stocknews.com/news/iipr-can-innovative-industrial-properties-keep-running/", "published": 1600344500.0, "headline": "Can Innovative Industrial Properties Keep Running?", "body": "Innovative Industrial Properties (IIPR) has had a terrific year since it bottomed in March. The stock went from $40 per share to hit a 52-week high at $130.25. The stock is now up 170.1% since its low on March 18th. The company recently announced a third-quarter dividend of $1.17 per share. This is 10% higher than its second-quarter dividend of $1.06, and a 50% increase from the third-quarter last year. This is the eighth dividend increase it’s the company went public in December 2016. Dividend increases are indicative of a company with healthy cash flow. Its free cash flow as of the end of June was $24 million. The company ended the quarter with cash and cash equivalents of $373 million. While this was slightly down from last quarter, it is up 100.5% year-over-year. The company has low debt, with a debt to equity ratio of 0.1. It currently has no secured debt and only a 12% debt to total gross assets ratio, which includes their exchangeable senior notes. IIPR generated revenues of $24.3 million this past quarter, a 183% increase year on year. The company’s funds from operations (FFO) for Q2 also increased 263% year over year. These growth figures are very encouraging for investors, especially since the company has a very healthy net profit margin of 55.7%. IIP’s stock performance has been driven by strong earnings and revenue growth, but the increased dividend payout adds another reason to consider the stock. 7 \"SAFE HAVEN\" Dividend Stocks for Turbulent TimesAccording to Archview and BDS Analytics, the global cannabis market hit $14.9 billion, primarily driven by the adult-use markets in Canada, California, and Massachusetts. The global market is expected to reach $42.7 billion by 2024. As more U.S. states legalize medical and recreational cannabis use, this opens up more doors for IIPR to acquire properties and grow revenue. IIPR should continue to attract shareholders through its growth story and its growing dividend yield. Overall, I believe that IIPR remains a solid cannabis investment based on a strong business model, consistent growth, and a favorable trend in new cannabis markets in the United States. Want More Great Investing Ideas? 7 Best ETFs for the NEXT Bull Market Stock Market Outlook: Before & After the Election Chart of the Day- See the Stocks Ready to Breakout IIPR shares were trading at $124.40 per share on Thursday afternoon, down $3.68 (-2.87%). Year-to-date, IIPR has gained 68.02%, versus a 4.71% rise in the benchmark S&P 500 index during the same period."}]}