{"article": [{"url": "https://stocknews.com/news/spy-fsly-seeing-a-credit-spread-in-action/", "published": 1597147700.0, "headline": "Seeing a Credit Spread in Action", "body": "I had the pleasure of joining Adam Mesh on our webinar last night to discuss the state of the market and what options strategies I’m employing now. My response was I’m looking at credit spreads. That is a strategy in which you sell a near-the-money open while simultaneously buying any further out-of-the-money options. The position collects a net credit of premium which you keep if the underlying shares don’t breach the strike price. I’ve written about the dynamics of credit spreads and how to calculate returns. Now let’s look at when in real-time. The following is part of Alert I sent out to Option360 members yesterday. It is still actionable today and my gift to loyal readers. Now you get to see and hopefully participate, in one of these trades in real-time. Fastly (FSLY) has been a hot fast stock. It provides edge computing (cloud) for businesses to run real-time remote. But it has a crazy valuation in that it is still a money-losing operationThe stock had been on a huge run but got slammed pot earnings not because the numbers were disappointing, they actually “beat and raised” but: 7 Best ETFs for the NEXT Bull Market1) It turns out 13% of revenue comes from TikTok and we know they are under the microscope and possibly will be acquired by Microsoft (MSFT). 2) They offered a secondary stock offering 3) simple and rational profit-taking. The stock has now come down to support near the $75-$78 level. ACTION:-Buy to open 2 contracts FSLY Sep (9/04) 65 Put-Sell to open 2 contracts FSLY Sep (9/04) 70 Put For a Net Credit of $1.70 (do not go below $1.55) All we want is for shares of FSLY to stay above $70 for the next 3 weeks and we collect $170 per contract per spread. This is a way in which application of the appropriate options strategy, especially one that benefits from time decay, can deliver solid profits. Click here to learn more about author Steve Smith’s unique and profitable approach to trading. Want More Great Investing Ideas? 3 Possible Directions for the Stock Market from Here How to Trade THIS Stock Bubble? 9 “BUY THE DIP” Growth Stocks for 2020 SPY shares were trading at $336.93 per share on Tuesday afternoon, up $1.36 (+0.41%). Year-to-date, SPY has gained 5.76%, versus a % rise in the benchmark S&P 500 index during the same period."}]}