{"article": [{"url": "https://stocknews.com/news/pvg-why-i-expect-a-big-move-in-shares-of-pretium/", "published": 1598616500.0, "headline": "Why I Expect a Big Move in Shares of Pretium Resources (PVG)", "body": "After releasing its earnings report just three weeks ago, Pretium Resources share prices surged. Since then, the stock has been consolidating and a symmetrical triangle pattern has formed on its chart. Pretium Resources Inc (PVG) is an exploration and development company engaged in the acquisition, exploration, and development of precious metal resource properties in the Americas. PVG was able to continue mining gold while many other companies suspended operations last quarter due to COVID-19. The company reported production of 90,419 ounces, and forecasts 325,000 ounces to 365,000 ounces for all of 2020. Take a look at the 1-year chart of PVG below with added notations: 9 \"BUY THE DIP\" Growth Stocks For 2020 Chart of PVG provided by TradingView PVG has formed a symmetrical triangle (green). As the support and resistance converge on each other, the pattern is created. Since there is no true way to know which way the stock will break, most traders will wait for the breakout or breakdown before entering a trade. A trader could enter a long position on a break above the down trending resistance. Or, if PVG were to break below the trend line support, a short trade could be entered. Want to Discover More Great Trades? I have explored virtually every flavor of technical analysis and chart pattern known to mankind. The sad fact is that the vast majority of them don’t work at all. That is why I recently put together this special report to help investors focus on the only 5 chart patterns that matter…the ones that lead to the most timely and profitable stock trades. Click below to get your copy now! 5 WINNING Stock Chart Patterns Have a good trading day! Good luck! Christian Tharp, CMT @cmtstockcoach PVG shares were trading at $12.30 per share on Friday morning, up $0.05 (+0.41%). Year-to-date, PVG has gained 10.51%, versus a 9.55% rise in the benchmark S&P 500 index during the same period."}]}