{"article": [{"url": "https://stocknews.com/news/grpn-zg-stmp-3-stocks-that-are-surging-today-after-surprising-wall-st/", "published": 1596802100.0, "headline": "3 Stocks That are Surging Today After Surprising Wall St.", "body": "Earnings surprises have been an unexpected trend in this quarter’s earnings season. While many analysts estimated lower earnings figures for companies this quarter due to the pandemic, many companies have come through with strong earnings instead. An earnings surprise occurs when a company reports earnings or revenue above analyst’s expectation. Analysts form their expectations based on current market conditions, previous reports, and company guidance. They typically speak with corporate management, visit a company’s headquarters, and learn everything they can about the company and its industry. That information forms the basis of his or her judgment of the company. That information is incorporated into a mathematical financial model to determine revenue and earnings estimates. When a company reports earnings or revenue above that estimate, it can significantly affect the stock price. It can lead to an immediate price jump after the report and that positive price appreciation can continue over the intermediate-term. Three stocks reported earnings surprises last night, which led to substantial price performance today: Groupon (GRPN), Zillow Group (ZG), and Stamps.com (STMP). 7 Best ETFs for the NEXT Bull MarketGroupon (GRPN) GRPN acts as a middleman between consumers and merchants by offering a variety of products and services at steep discounts through its online store. The company also publishes daily deals from local merchants in the form of online vouchers. For instance, a new gym might offer consumers a discounted membership rate for the first few months. The company generates revenue by taking a percentage of what the consumer purchases. The company reported earnings per share (EPS) of -$0.93 compared with the consensus estimate of -$2.97. It also reported revenue of $395 million compared with the average analyst estimate of $183.27 million. While its sales and earnings did decline year over year, its cost-cutting initiatives sustained its bottom line. The stock is up over 55% so far today due to the news. Service revenues (local merchant offerings) were down 59.5% year over year, but product revenues (goods) increased by 11.1%. The company’s interim CEO, Aaron Cooper, stated, “In the past four months, we have created significant operating leverage by taking substantial costs out of our business, leaned into categories to drive sales and free cash flow, and steadied the company during the pandemic.” Zillow Group (ZG) ZG is an online-based real estate company that provides access to services such as buying and selling homes and rental listings. The company also provides mortgage financing via mobile apps and websites such as Zillow.com, Trulia.com, and others. It operates through three units, Internet, Media & Technology, and Homes and Mortgages. The homes segment accounts for roughly half of its revenue which is generated through direct purchase and sale of homes The company reported EPS of -$0.17 compared with the consensus estimate of -$0.48. Revenue for the quarter was $768.35 million compared with the average estimate of $615.19 million. Revenue was a 28.2% increase year over year. The coronavirus pandemic and remote working policies are stirring people to think about moving. Consumers are shifting to the internet for real estate information. The traffic to ZG’s website returned to pre-pandemic levels at the end of April. Visits for the quarter were up 14% year over year. ZG stock is currently up over 13% for the day. Most of the growth was in the Homes segment, which has seen strong demand for Zillow Offers, a service that allows homeowners to sell their houses. The company’s acquisition of Trulia has increased its competitive advantage. ZG is rated a Strong Buy in our momentum-based POWR Ratings system. It holds grades of A in POWR components Trade Grade, Buy & Hold Grade, and Industry Rank. Today’s performance will only add to its momentum. The company is also the #9 ranked stock in the Internet industry. Stamps.com (STMP) STMP is a provider of internet-based mailing and shipping solutions. The company operates through two segments, Stamps.com and MetaPack. The Stamps.com unit drives more than 90% of the company’s revenue through online postage and shipping software solutions offered to consumers, small businesses, e-commerce shippers, and enterprise mailers. The company reported EPS of $3.11, compared with the consensus estimate of $1.26. The company reported earnings that were 147% above estimates. It reported revenue of $206.73 million vs. the average analyst estimate of $144.05 million. The company also raised its full-year 2020 sales guidance to $650 to $725 million compared to its previous forecast of $570 to $600 million. The stock is up almost 13% today due to the news. As the pandemic lowered foot traffic to retail stores, shopping from home has provided a boost to shipping. E-commerce has helped many companies in different industries stay afloat. STMP benefits through more robust e-commerce. The pandemic has also prevented people from going to the post office, so businesses and consumers rely on purchasing postage on the interest. Since there appears to be no end in sight for the pandemic, STMP should continue to benefit from the current environment. STMP was already in the news the past couple weeks as Citron Research tweeted that STMP could be acquired by Shopify (SHOP). The stock soared on that news as well. The company is rated a Buy in our exclusive POWR Ratings system. It holds grades of A in Trade Grade and Peer Grade. It is also the #11 ranked company in the Internet – Services industry. Want More Great Investing Ideas? 9 “BUY THE DIP” Growth Stocks for 2020 How to Trade THIS Stock Bubble? 7 “Safe-Haven” Dividend Stocks for Turbulent Times GRPN shares were trading at $25.77 per share on Friday afternoon, up $9.32 (+56.66%). Year-to-date, GRPN has declined -46.09%, versus a 5.02% rise in the benchmark S&P 500 index during the same period."}]}