{"article": [{"url": "https://stocknews.com/news/nke-skx-dbi-as-more-people-venture-outdoors-3-footwear-stocks-to-buy/", "published": 1595851700.0, "headline": "As More People Venture Outdoors, 3 Footwear Stocks to BUY", "body": "Life has dramatically changed in the past, few months. Going to sports games, movies, amusement parks, and large gatherings with friends and family are no longer options due to COVID-19. However, people are embracing other activities instead of camping, fishing, and boating. Instead of going to the gym, they are running and biking. The following footwear stocks are likely to increase in value as people continue to do more of these activities to enjoy the fresh air, sun, and nature’s beauty while socially distancing: Nike (NKE), Skechers (SKX) and Designer Brands (DBI). Nike (NKE) 7 Best ETFs for the NEXT Bull MarketWhen multiple companies offer a similar value proposition, the difference-maker is how the product is marketed. NKE has some of the best marketing in the world. Though NKE’s sneakers and other products are not superior to those of the competition, NKE’s advertisements certainly are. Plenty of consumers will choose NKE simply because the company’s commercials and ads are on TV, billboards, magazines, and beyond with regularity. Add in the fact that people are spending that much more time outdoors during the pandemic and it is easy to see why investors are becoming bullish on NKE. The POWR Ratings show NKE has an A Trade Grade and an A Buy & Hold Grade. The stock is ranked first of 32 in the Athletics & Recreation category. The top analysts have quite the rosy outlook for NKE: an average price target of $111.17 with 22 Buy ratings, 3 hold ratings, and one Sell rating. This is the perfect time to own NKE, as it seems likely to retest its 52-week high of $105.62 in the coming weeks. Skechers (SKX) When Skechers sneakers first hit the market back in the early 90s, they appeared to be a fad that kids would buy into for a couple of years and then subsequently fade away. Fast forward nearly three decades and it has become quite clear SKX sneakers are here to stay. SKX kicks are reliable, fairly stylish, and reasonably priced. Though SKX marketing is not on the level of NKE, SKX has captured a meaningful chunk of market share. The POWR Ratings show SKX has a B Industry Rank Grade along with a solid Buy & Hold Grade. Furthermore, SKX had an 88% price return in 2019. It appears as though SKX is currently undervalued at its trading price of $30. The top analysts have set a price target of $38.63 for the stock. All in all, eight analysts rate SKX a Buy while none rate it as a Hold or Sell. Though SKX endured a 42% sales drop in the second quarter, its e-commerce business growth exceeded 400%. In other words, SKX can hold strong if stores and malls are once again forced to close their doors should the outbreak worsen. Designer Brands (DBI) Just about everyone will think about picking up a new pair of sneakers after spending additional time outdoors during the pandemic. Some of those purchases will be made at DBI. DBI sells athletic, casual, and designer footwear for both men and women. The POWR Ratings show DBI has a respectable Industry Rank, a 5% three-month price return, and a ranking in the top two-thirds of all Fashion & Luxury Stocks. Though DBI is not the industry’s biggest name, it is certain to benefit from the fact that nearly everyone will be in the market for a new pair of sneakers in the months to come. The top analysts have set a $6.17 price target for DBI, indicating they believe it has more upside. Though DBI might not ascend to its 52-week high of $19.08 in the months to come, the stock should trend toward $7 as the summer continues. The vast majority of DBI stores are currently open. However, even if DBI stores are forced to close due to the virus, the company can continue selling its footwear online at DSW.com. Want More Great Investing Ideas? 9 “BUY THE DIP” Growth Stocks for 2020 Newly REVISED 2020 Stock Market Outlook 7 “Safe-Haven” Dividend Stocks for Turbulent Times NKE shares were trading at $97.73 per share on Monday morning, down $0.70 (-0.71%). Year-to-date, NKE has declined -3.02%, versus a 1.04% rise in the benchmark S&P 500 index during the same period."}]}