{"article": [{"url": "https://stocknews.com/news/spy-cboe-spi-how-big-financial-institutions-are-profiting-off-robinhood-traders/", "published": 1601035700.0, "headline": "How Big Financial Institutions are Profiting off Robinhood Traders", "body": "The retail trading surge over the past few months has been well documented as a confluence of forces such as the COVID-induced lockdown leaving people with a lot of time. However, limited entertainment choices, stimulus check cash, and the brokerage industry going to zero commissions all helped bring newbie traders into the market. The conventional wisdom has always been that most individuals who engage in active day trading ultimately lose money — signs of a market top. And while that may prove true — we’ve certainly seen activity similar to the dot.com days such as chat rooms, disregard for valuations, and irrational price moves — one still needs to recognize this is now part of the trading landscape and it can influence prices. For myself, I find the best way to deal with the new chat room phenomena such as Reddit and r/WallStreetbets, which have a preponderance of speculation in small-cap and penny stock names, is to simply avoid them in spite of their big price swing lure — which could theoretically deliver big profits. A recent example of just how nonsensical and irrational that part of the trading world has become is SPI Energy’s recent movement. They’re a Hong Kong-based company that hopped on the electric vehicle bandwagon by announcing Wednesday that it was opening a Silicon Valley EV subsidiary called EdisonFuture. [Labor Day SALE Extended] Learn about the One-Month $19 Trial Offer Our Market Experts Are Raving About —the Options360 Service! The stock surged from around $1 to a high of $42 (4,200%) before settling at $22. Equally absurd is that as it became evident that it was simply a press release, the stock continued to swing between $10 and $30 over the past two days. It doesn’t matter if the company’s prospects haven’t changed, as it’s now a trading sardine on people’s radar. 7 \"SAFE HAVEN\" Dividend Stocks for Turbulent TimesBut, what’s harder to ignore is that retail traders have become a force in mainstream names from “Apple (AAPL)” to “Tesla (TSLA),” especially with options activity. As I wrote two weeks ago, the aggregation of these small traders can largely influence the overall market. I believe that rampant call buying in a handful of tech names led to the late-August meltup and the subsequent unwind we’re now experiencing. Small options trades (10 contracts or less) now account for 12% of total options volume — more than double from prior years. And large institutional traders are now taking notice and trying to figure out a way to profit from this activity. As a Bloomberg article explains, they’re using big data-crunching programs to find an edge. Alternative data has been a buzzword for years, and demand has exploded in 2020. First, it was COVID-19 infection charts along with travel and dining trends. Now, it’s intel on how retail investors are spending their cash. DO NOT Miss Out! Click here to try Options360 for the SPECIAL PRICE of $19 — Before It’s Too Late The big firms and hedge funds are now canvassing Reddit threads like r/wallstreetbets and picks at retail brokerages. They’re also plugging data into programs to discover what amateur stock traders are doing, and jumping on board. For example, r/WallStreetbets has over 1.5 million users along with several influential aka unofficial moderators, that on any given day may target certain names and specific options, such as AAPL 110 calls, for followers to target as buys. The big options market-making firms, such as Citadel and Susquehanna, want this information because they’ll be facilitating order flow and need to hedge, and also to use as newfound pockets for profiteering. This has led to a cottage industry of sites or services dedicated to tracking trading and platform chats, such as Robinhood, and developing momentum trading strategies, creating a self-fulling feedback loop. My personal trading style isn’t focused on unusual trading activity or trying to jump on short term momentum. It’s now a dynamic force in the trading landscape that one must be aware of. Even if it’s just to avoid being run over. [Last Chance] PROFIT off this Exclusive $19 Trial Offer to the Options 360 Service! Want More Great Investing Ideas? 7 “Safe-Haven” Dividend Stocks for Turbulent Times When Does the Next Bull Run Start? Chart of the Day- See the Stocks Ready to Breakout SPY shares were trading at $326.14 per share on Friday afternoon, up $2.64 (+0.82%). Year-to-date, SPY has gained 2.78%, versus a % rise in the benchmark S&P 500 index during the same period."}]}