{"article": [{"url": "https://stocknews.com/news/spy-ndaq-dji-3-things-investors-need-to-know-about-the-pandemic/", "published": 1597234100.0, "headline": "3 Things Investors Need to Know About the Pandemic", "body": "If you just look at the stock market you’d think there was no recession and no pandemic at all. (Source: Ycharts) 7 \"SAFE HAVEN\" Dividend Stocks for Turbulent TimesThe S&P 500, Nasdaq, and Dow Jones Industrial Average have staged a classic V-shaped recovery even though the economy most certainly has not. (Source: Fundstrat) But while investors might be understandably giddy at stocks roaring higher for four consecutive months, we can’t forget what caused the fastest bear market in history, the worst recession in 75 years, and what still looms over us for what health experts believe to be the next two years. That would be the pandemic, and there are three particular things all prudent investors need to know to safeguard their hard-earned savings in these deeply uncertain times. Fact 1: America Has Made Some Progress In The Last Few Weeks At Containing The Virus While Goldman Sach’s (GS) recommendation of a national mask mandate is not likely to ever come to pass 34 states have taken it upon themselves to mandate masks, some even going so far as to make it a misdemeanor not to wear one in public. MIT, IHME, and various other medical experts believe that proper mask-wearing can reduce transmission of the virus by up to 92%. In late July 81% of Americans claimed to always be wearing masks in public and 94% claimed to wear them all the time or sometimes. US Average State Transmission Rates In Recent Weeks (Sources: Dividend Kings COVID-19 Tracking Tool, RTlive) The average state transmission rate has been falling for four consecutive weeks now, though it’s impossible to say with certainty that increased mask-wearing has been the primary cause of this. After all, 25 states have now paused or partially reversed their reopening plans, and that too has a strong effect on reducing viral transmission. (Source: NYT COVID-19 Tracking Tool) But isn’t that good news? That supports the market continuing to climb as America wins its war against the coronavirus? Not so fast, because the war is far from won and in fact, over the next few months, experts believe things could get worse. Fact 2: The Second Wave Is Still Expected In The Fall, And Results Could Be Truly Frightening Courtesy of the recent surge in cases the second wave many experts warned us about won’t appear as severe. BUT it’s still coming, courtesy of two factors. The first is many states fully or partially reopening schools, some of which have already done so. The second is that indoor is where the virus spreads fastest, especially when humidity falls and droplets people exhale dry out and let the virus float freely in the air (it’s estimated to spread 3X as far compared to more humid conditions). (Source: IHME) IHME estimates that the number of infections will remain relatively stable through mid-October and then start to ticker higher through December 1st. That is unless social distancing is relaxed in which case we could potentially see a major surge resulting in up to 900,000 daily infections translating to about 127,000 daily confirmed cases. That’s compared to a 36K confirmed case peak in April and a larger 78K peak in July. As long as the medical system isn’t overwhelmed these additional cases might not be so bad. But the risk is that the ramp-up in ICU and hospital bed capacity may not be sufficient for what’s coming next. In part two of this series, I’ll go into detail of how grisly the reaper’s bill might be but in this article I want to highlight another major concern investors should have about the state of the pandemic. For six weeks in a row people have become less comfortable with doing higher risk activities like going to eat, going shopping, or vacationing. Many Americans are telling Morning Consult they don’t believe it will be safe to perform these activities for six months or longer. This is horrible news for restaurants, 25% of which OpenDoor believes could close forever due to the pandemic. (Source: CNN economy tracker) It’s even worse for movie theaters that have seen a virtual complete collapse in business because no major studio wants to release expensive blockbusters during a pandemic when box office sales are likely to be severely impacted. (Source: Harvard/Brown University) Small businesses have seen a steady decline in revenues in recent weeks since the surge began. That’s not surprising given that half the country has halted its reopening plans and certain businesses, such as bars, have been forced to close again. But since the surge in cases is not expected to ease anytime soon, in fact, it’s expected to get worse in a few months, this could mean that suffering small businesses, who account for 50% to 60% of US jobs, might be in for a VERY tough fall/winter. In the next series in this article, I’ll explain just how bad things might get in the coming months, and most importantly the most effective way to protect your nest egg from the potential ravages for the pandemic, which is far from over and might be about to get worse. Want More Great Investing Ideas? 3 Possible Directions for the Stock Market from Here How to Trade THIS Stock Bubble? 9 “BUY THE DIP” Growth Stocks for 2020 SPY shares were trading at $336.56 per share on Wednesday morning, up $3.76 (+1.13%). Year-to-date, SPY has gained 5.64%, versus a % rise in the benchmark S&P 500 index during the same period."}]}