{"article": [{"url": "https://stocknews.com/news/azn-regn-mrna-3-high-flying-coronavirus-vaccine-stocks/", "published": 1595246900.0, "headline": "3 \"High-Flying\" Coronavirus Vaccine Stocks", "body": "Dr. Francis Collins, the Director of the National Institutes of Health, appeared on Meet the Press earlier this week, and stead that significant progress has been made in the development of several effective coronavirus vaccine candidates. If everything goes as planned, we will have a vaccine available by year’s end. A successful vaccine will be a monumental achievement in making the country healthier and will help the economy get back on track. Three companies that have demonstrated significant progress in the race to develop a vaccine are AstraZeneca (AZN), Regeneron (REGN), and Moderna (MRNA). 7 Best ETFs for the NEXT Bull MarketAstraZeneca (AZN) AZN is only partially focused on developing a coronavirus vaccine. The company’s focus also extends to the discovery, development, and manufacture of pharmaceuticals for the treatment of inflammation, gastrointestinal problems, cardiovascular challenges, and cancer. The POWR Ratings have AZN ranked in the top five of more than 200 Medical – Pharmaceutical stocks. It has an A grade in all of the POWR Components. It is interesting to note AZN did not jump into action right away when seemingly countless other pharmaceutical companies launched their vaccine creation efforts. Rather, AZN waited a month following the human trials of Moderna’s vaccine candidate. AZN has teamed up with the University of Oxford in its efforts. At this point, AZN and MRNA are considered the leaders and both have demonstrated impressive results in early-phase trials. Despite, its late start, AZN’s vaccine is a promising candidate and has been awarded $1.2 billion by Operation Warp Speed. Further, AZN has a number of high-quality prospects in its pipeline and an array of existing, profitable products that are growing. The top analysts have set a price target of $61.67 for AZN. This is 4% above the current market price. However, if AZN’s coronavirus vaccine proves effective before others, the stock will likely climb toward the triple-digit mark. Regeneron (REGN) REGN has a portfolio with more than half a dozen marketed drugs that treat conditions and diseases ranging from asthma to eye diseases and rheumatoid arthritis. REGN has created a dual antibody to prevent and treat the coronavirus. Dubbed REGN-COV2, this cocktail has moved through adaptive clinical trials. REGN launched the third phase of a study to determine if REGN-COV2 proves effective for those who had close exposure to the virus. As long as REGN-COV2 reduces the mortality rate for those afflicted by the coronavirus, it could supplant Gilead Sciences’ (GILD) much-hyped remdesivir. REGN-COV2 may become the go-to treatment for those afflicted with COVID-19. The POWR Ratings have REGN ranked third of more than 300 stocks in the Biotech sector. REGN has A grades in every single POWR Component and a Solid Buy rating. Out of 15 Wall Street analysts who have analyzed REGN, nine label it as a “Buy” while six recommend holding and none recommend selling. Though REGN is priced above $600, the stock has solid value. REGN’s forward P/E ratio is only 23. This is a reasonable P/E ratio for a pharmaceutical company making strides toward an effective coronavirus treatment with a pipeline of promising products and track record of bringing them to market. Moderna (MRNA) MRNA’s primary focus is on creating and discovering messenger RNA therapies. MRNA has numerous mid-stage candidates to treat cardiovascular conditions, cancer, and more. MRNA is also hard at work developing a coronavirus vaccine. The POWR Ratings show MRNA is ranked 6th of 338 Biotech stocks. MRNA aces every single POWR Ratings Component and has a Strong Buy rating. According to the top analysts, MRNA has a target price of $93.79, which is 9% above current prices. MRNA’s mRNA-1273 coronavirus vaccine candidate will enter a phase three study on July 27. The latest results of the vaccine candidate’s impact on the virus were recently published in The New England Journal of Medicine. The vaccine candidate generated antibodies that neutralized the virus in each study participant. These antibodies are essential as they have the potential to prevent a potentially life-threatening viral infection. If MRNA’s vaccine candidate wins approval, it might generate more than $5 billion in sales on an annual basis. However, MRNA has been in business for more than a decade and has not yet won regulatory approval for a single therapy or vaccine. Nor does the company have any therapies or vaccines in late-stage trials, therefore there is some understandable caution about its ability to be successful. MRNA’s specialty of mRNA vaccines has not yet proven effective so it is easy to see why some question whether the company can deliver an effective vaccine. However, the silver lining is if MRNA’s vaccine proves effective, it would completely reverse the company’s fortunes, helping the stock break through its 52-week high of $95.21, likely moving well into the triple digits and validating its mRNA approach to developing vaccines and treatments. Want More Great Investing Ideas? 9 “BUY THE DIP” Growth Stocks for 2020 Newly REVISED 2020 Stock Market Outlook 7 “Safe-Haven” Dividend Stocks for Turbulent Times AZN shares were trading at $58.88 per share on Monday afternoon, down $2.22 (-3.63%). Year-to-date, AZN has gained 20.45%, versus a 1.98% rise in the benchmark S&P 500 index during the same period."}]}