{"article": [{"url": "https://stocknews.com/news/ba-dxyn-hrtx-xec-avoid-these-downgraded-stocks/", "published": 1602245300.0, "headline": "AVOID These Downgraded Stocks", "body": "The POWR Ratings have been updated to reflect the status of stocks in all the major indexes. While plenty of stocks have been upgraded, there are some notable downgrades. If you check out the POWR Ratings downgrades/upgrades, you will find they are updated every 24 hours to reflect the dynamics of the market and individual stocks. There is a good chance many more stocks will be downgraded in the weeks to come as stimulus talks stall and investors grow weary of a potentially contested election. Without further ado, let’s take a look at some of the more notable downgrades: The Boeing Company (BA), The Dixie Group (DXYN), Heron Therapeutics (HRTX), and Cimarex Energy (XEC). 7 \"SAFE HAVEN\" Dividend Stocks for Turbulent TimesThe Boeing Company (BA) It should come as no surprise that BA has been downgraded. BA is the DOW’s largest component, regularly weighing down the index as air travel continues to stagnate amid the pandemic. Though BA also provides planes to defense contractors, its commercial business is clearly struggling. It will likely continue to falter for at least another year or two until a truly effective vaccine is available for the masses. BA is a POWR Ratings dud with “F” and “D” grades across the board. The stock is ranked in the bottom third of 65 Air/Defense Services companies. BA has a year-to-date price return of -49% and a three-year price return of -32%. Out of 17 analysts who cover BA, eight recommend buying, eight advise holding, and one suggests selling. BA’s internal projections show the demand for commercial airplanes declining 11% across the next decade. In short, it will take years for the aviation industry to return to its pre-COVID level. BA will either stagnate or decrease during this time. The Dixie Group (DXYN) Though this is a good time to be in the carpet business as homeowners are shelling out for home improvements and houses are being built all over the country, DXYN is not worthy of your investing dollars. The carpet and rug maker is poised to struggle as its customer base is quite narrow. DXYN provides carpet and rug to residential and commercial clients on the high end, meaning its products are costly and lack mass appeal. DXYN has “F” grades in three of the four POWR Rating components. The stock is ranked fourth out of five stocks in the Industrial – Textiles industry. DXYN has a year-to-date price return of -23%. The stock’s three-year price return is -26%. DXYN has not recovered from its late 2019 tumble. The stock was priced at $2 in the fourth quarter of 2019 and has subsequently slid down below $1. Heron Therapeutics (HRTX) Pharmaceutical companies certainly have their merits, yet those that are highly specialized are tougher sells. HRTX is one such stock. HRTX makes products with its unique Biochronomer drug delivery platform. The company’s product portfolio is highlighted by APF530 that treats acute chemotherapy-caused nausea, including vomiting. HRTX has “F” grades in the Buy & Hold Grade and Trade Grade components. Out of 376 stocks in the Biotech industry, HRTX is ranked 190th. HRTX’s year-to-date price return is -36%. The stock’s three-month price return is -4%. HRTX was priced in the low to mid-$20s before the coronavirus selloff. The stock jumped back up to $21 in July only to sell off back to $14 in the months since. Now that the Food and Drug Administration has rejected HRTX’s painkiller HTX-011, there is even less reason to invest in this stock. Cimarex Energy (XEC) Energy stocks are down across the board except those that provide renewable energy. XEC operates in the gas and oil space, meaning it will likely struggle for the foreseeable future as renewable energy sources take center stage. Add in the fact that a monster hurricane is headed toward XEC’s operations in the Gulf of Mexico, and this stock looks even worse. XEC has “F” grades in the Buy & Hold and Trade Grade POWR Rating components along with an Industry Rank of “D”. XEC is ranked in the bottom half of Energy – Oil & Gas stocks. The company’s year-to-date price return is -53%. Its 2019 price return was -13%. The stock has a three-year price return of -78%. In spite of XEC’s recent slide, the stock’s forward P/E ratio is still an egregiously high 43.08. Want More Great Investing Ideas? 7 Best ETFs for the NEXT Bull Market What is the Cure for Stock Market Volatility? Chart of the Day- See Christian Tharp’s Stocks Ready to Breakout BA shares were trading at $168.54 per share on Friday morning, up $0.54 (+0.32%). Year-to-date, BA has declined -47.95%, versus a 8.99% rise in the benchmark S&P 500 index during the same period."}]}