{"article": [{"url": "https://stocknews.com/news/amgn-mtum-spy-tmo-dhr-cost-adbe-5-momentum-stocks-to-power-through-2020/", "published": 1594987700.0, "headline": "5 Momentum Stocks to \"POWER\" Through 2020", "body": "Momentum investing is a strategy to take advantage of a market trend. Investors can buy stocks that have shown upward price movement, or short stocks that have demonstrated downward price movement. The theory of momentum investing is that these trends can continue for some time, so buying a stock that is trending upwards may reward you with continued upward price movement. There are numerous ways to approach momentum investing. Some traders follow a set of rules based on technical indicators such as moving averages, while other investors focus on price gains over a set period of time. While the strategy doesn’t work in all market environments, it has been proven to provide returns above the market. For instance, the iShares Edge MSCI USA Momentum Factor ETF (MTUM) has outperformed the SPDR 500 (SPY) over the past three months, the past year, and the past five years. The ETF, which has close to $10 Billion in assets, identifies the leaders in the MSCI USA market index over six and twelve-month periods. 9 \"BUY THE DIP\" Growth Stocks For 2020Here are five stocks in the MSCI USA market index that are rated a Strong Buy or Buy in the StockNews POWR Ratings system: Thermo Fisher Scientific (TMO) TMO sells scientific instruments and laboratory equipment, diagnostics consumables, and life science reagents. The company operates through four segments: Analytical Technologies, Specialty Diagnostic Products, Life Science Solutions, and Lab Products and Services. In its most recent earnings report, TMO reported revenue of $6.23, which was up 1.6% year over year. In March, TMO attained emergency use authorization from the FDA for its diagnostic test to be used by high-complexity laboratories in the U.S. The company’s $11.5-billion deal to acquire molecular diagnostics and sample preparation technologies firm QIAGEN should deliver considerable cash value to its shareholders. The stock is up 17% over the past six months and up 38% over the last twelve months. TMO is one of the top-rated stocks in our momentum-based POWR Ratings system. Overall, it is the #1 ranked stock in the Medical – Diagnostics/Research industry. The 22% return year to date on top of a 40% showing last year explains the kind of momentum taking place with TMO. Danaher (DHR) DHR focuses primarily on manufacturing scientific instruments and consumables in four segments: Life Sciences, Diagnostics, and Environmental and Applied Solutions. The life sciences unit offers a broad range of research tools to analyze a variety of critical areas. The diagnostic segment provides analytical instruments, software, and services used in hospitals, physicians’ offices, and other care settings. The environmental and applied solutions units provide products and services that keep food and water supplies safe. In DHR’s latest earnings report, the revenue in the Diagnostics unit increased 6% year over year to $1.6 billion. This was due to an 8% rise in core sales. The company forecasts increased demand for products related to acute care diagnostics and molecular diagnostics. DHR should also benefit from the need for certain products due to the pandemic. The stock is up 18% over the past six months and 36% over the last twelve months. If DHR had a report card, it would have all As. All 5 scores of our exclusive POWR Ratings system is an A for the stock. It is also the #1 ranked stock in the Industrial – Machinery industry. Costco Wholesale (COST) COST is the leading warehouse club with 787 stores worldwide. Most of its sales are derived in the U.S. The company sells memberships that allow customers to shop in its warehouses, which feature low prices on an assortment of products. This includes food, household and lifestyle products, appliances, and gasoline. The company generates revenue from two sources, store sales, and membership fees. In its most recent quarter ending in May, COST’s e-commerce sales rose 64.5% year over year, while its net sales grew 7.3% to $36,451 million. Membership fees increased 5% to $815 million. COST is a dominant wholesaler due to the quantity and quality of merchandise offered. Its strategy of selling products at massively discounted prices has bode well for the company as the newly unemployed need low-cost essential items. The stock is up 7% over the past six months and 15% over the last twelve months, which have outpaced its industry. How does COST stack up for the POWR Ratings? A for Trade Grade A for Buy & Hold Grade A for Industry Rank A for Peer Grade A for overall POWR Rating The stock is also the #2 ranked stock in the Grocery/Big Box Retailers industry. Adobe (ADBE) ADBE provides content creation, document management, and digital marketing and advertising software and services to creative professionals and businesses. It is one of the world’s largest software companies and the leader in the Digital Media market. The bulk of its revenue is from licensing fees from customers. The company is benefiting from strong demand for its creative products such as Creative Cloud, Document Cloud, and Adobe Experience Cloud. In the first quarter, it’s Digital Media recurring revenue grew to $8.73 billion. The company is also seeing rising subscription revenue in its mobile apps. The stock is up 25% over the past six months and 41% over the last twelve months. ADBE has a Buy rating in our POWR Ratings systems. It holds a grade of A for Trade Grade and Industry Rank, and a B for Buy & Hold Grade and Peer Grade. It is ranked #11 out of 82 stocks in the Software-Application industry. Amgen (AMGN) AMGN is a leader in biotechnology-based human therapeutics. The company has historical expertise in renal disease and cancer supportive care products. Its flagship drugs include red blood cell boosters Epogen and Aranesp, immune system boosters Neupogen and Neulasta, and Enbrel and Otezla for inflammatory diseases. The bulk of the company’s sales are in the U.S. The company has a robust portfolio of biosimilars, which are biological medical products. These products provide revenue of $1 billion annually and should drive future growth. AMGN also has several promising drugs in its pipeline. Tezepelumab treats severe asthma and is in phase 3 trials. Omecamtiv Mecarbil, which is also in phase 3 trials, treats chronic heart failure. The stock is up 7% over the past six months and 43% over the last twelve months. According to the POWR Ratings, AMGN has five As. It is also the #1 stock in the #9 ranked industry (Biotech). Want More Great Investing Ideas? 9 “BUY THE DIP” Growth Stocks for 2020 Newly REVISED 2020 Stock Market Outlook 7 “Safe-Haven” Dividend Stocks for Turbulent Times AMGN shares were unchanged in after-hours trading Friday. Year-to-date, AMGN has gained 8.71%, versus a 0.99% rise in the benchmark S&P 500 index during the same period."}]}