{"article": [{"url": "https://stocknews.com/news/zm-akam-dbx-3-work-from-home-stocks-for-the-second-half-of/", "published": 1593691700.0, "headline": "3 Work From Home Stocks for the Second Half of 2020", "body": "Due to the spread of the coronavirus, many companies are asking the majority of their employees to work remotely. It is the only viable option for some corporations to survive. The work from home trend is here to stay, even after the virus subsides. Companies have found that employees are more productive and efficient when working from home. Additionally, overhead costs have gone down for companies whose employees have shifted to remote working. There are several companies vying for the top spot in the work-from-home industry and their potential is reflected in their stock prices. Here are three work from home stocks that stand out and are expected to grow through the remainder of 2020. 7 Best ETFs for the NEXT Bull MarketZoom (ZM) Since the start of the pandemic, Zoom has become a household name. ZM is the go-to video conferencing software. It allows file sharing, video calls, and chat across several devices.The number of paying customers has tripled this year. Although the company experienced some growing pains in the form of security issues, the demand for its services should rise as remote working becomes more prevalent. ZM, which went public just last year, has returned 280.85% so far for the year. The company has a Strong Buy rating in the StockNews.com, POWR Ratings. It also has a Trade Grade of A. Trade Grade represents the short-term bullish or bearishness of a stock. Akamai (AKAM) Akamai is a cloud services company that focuses on delivering online content and business applications for domestic and international users. Services also include mobile and security solutions. Due to the rise in telecommuting, the long-term demand for its cybersecurity solutions and content-delivery networks (CDN) is expected to rise. AKAM has a Strong Buy rating in the POWR Ratings. It is ranked #2 out of 49 stocks in the Technology – Services industry. The stock also has a Buy and Hold Grade of A. This Grade measures the long-term bullish or bearishness of a stock. This stock has delivered 23.10% YTD.This momentum may continue well into the rest of the year. Dropbox (DBX) Dropbox is an online collaboration and file-hosting platform. It allows organizations, companies and individuals to create, access and share files online. DBX also provides cloud storage solutions. As more people work from home, the demand DBX has skyrocketed. Teams working from home need a quick and reliable way to share their files. DBX is well positioned to fulfil that need. DBX has a Buy rating in the POWR Ratings. It also has Trade and Buy and Hold Grades of B. This stock has a YTD price return of 21.61%. Want More Great Investing Ideas? 9 “BUY THE DIP” Growth Stocks for 2020 Is the Bull S#*t Rally FINALLY Over? 7 “Safe-Haven” Dividend Stocks for Turbulent Times Top 3 Investing Strategies for 2020 ZM shares . Year-to-date, ZM has gained 284.69%, versus a -1.99% rise in the benchmark S&P 500 index during the same period."}]}