{"article": [{"url": "https://stocknews.com/news/sap-orcl-wday-docu-4-impressive-software-stocks-to-buy-now/", "published": 1599048500.0, "headline": "4 Impressive Software Stocks to BUY Now", "body": "Technology is the strongest part of the market. Within technology, software stocks are the best-performing group. It’s not hard to imagine why. They have the fastest growth rates and the highest margins. Demand has accelerated due to the coronavirus as software becomes increasingly important for corporate operations. The demand for cloud services and applications has expanded exponentially as companies around the world are resorting to digital transformation to combat the crisis. Software stocks may have significant upside left. SAP SE ADS (SAP), Oracle Corporation (ORCL), Workday, Inc. (WDAY), and DocuSign, Inc. (DOCU) are some of the top bets in this space. 7 Best ETFs for the NEXT Bull MarketSAP SE ADS (SAP) SAP develops and provides analytics and application software for enterprises worldwide along with software-related services. The company’s solutions span several business verticals including finance, human resources, sales, supply chain, manufacturing, asset management, commerce, and so on. The company has recently launched its X+O consulting service through SAP MaxAttention. This new service will be available to SAP Premium Engagement customers and could further solidify the company’s position as a leading analytics provider. SAP has also been performing pretty well in the “new normal,” and it has added close to 76.7% to its stock price since this year’s low of $90.9 hit on March 19th due to the virus-driven market crash. The company’s growth prospects also look solid with the expectations that its EPS could grow by 17.4% in the current year and 14.5% the next year. Along with EPS, SAP’s revenues are also expected to grow by 7.3% in the current year and 7.8% next year. How does SAP stack up for the POWR Ratings? A for Trade Grade A for Buy & Hold Grade A for Peer Grade A for Industry Rank A for Overall POWR Rating You can’t ask for better. The stock is also ranked #3 out of 92 stocks in the Software – Application industry. Oracle Corporation (ORCL) ORCL is involved in a wide range of technology-related operations such as the development, design, manufacture, and sale of application software, cloud infrastructure, hardware systems, and related services for global customers. The company is looking to expand further by buying the US operations of TikTok. If the deal is realized, it could mean a significant expansion of market cap for the company. The automaker Nissan has also agreed with ORCL to use ORCL’s cloud infrastructure for its high-performance computing requirements. Despite a significant drop in the stock price of the company in mid-March due to the virus-driven market crash, ORCL has recovered admirably and has set new year-to-date records. The stock is currently trading at 28.9% higher than mid-March lows. ORCL’s revenue is expected to see an increase of 4.3% next year. Similarly, the market expects the company’s EPS to grow by 4.9% this year and 9.4% next year. It’s no surprise that ORCL is rated a “Strong Buy” in our POWR Ratings system, with a grade of “A” in Trade Grade, Buy & Hold Grade, Peer Grade, and Industry Rank. In the 92-stock Software – Application industry, it is ranked #4. Workday, Inc. (WDAY) WDAY provides enterprise cloud solutions for human resources as well as finance. The company’s offerings are used by the largest corporations, governmental agencies, and educational institutions in the world. WDAY has recently expanded its operations to Mexico. It has also launched an expansion of Workday Launch to select enterprise customers to enable them to use a pre-configured approach for faster use of Workday’s application. For the quarter ended July 31st, the company’s total revenues increased by 19,6% when compared to the same quarter last year. It is estimated that the company’s revenues will continue to rise by 17.6% in the current year and by 17.4% next year. The EPS of the company is also expected to grow at an annual rate of 25% over the next five years. On the back of exceptional performance in the cloud services sector, WDAY’s stock has seen a significant upside. The stock price of the company is up 47% year-to-date. WDAY’s strong fundamentals are reflected in its POWR Ratings, it has a “Strong Buy” rating with an “A” in Trade Grade, Buy & Hold Grade, Peer Grade, and Industry Rank. Within the Software – Application industry, it’s ranked #5 out of 92 stocks. DocuSign, Inc. (DOCU) DOCU is a provider of cloud-based transaction products and services. The company’s e-signature solutions are used widely by enterprises to prepare, execute, and act on legal agreements. DOCU has agreed with Facebook (FB) to integrate its e-signature feature into Workplace by Facebook’s platform. The company has witnessed an explosion in demand for its services due to the spread of the coronavirus and the resultant lockdowns and remote working. For the quarter ended April 30th, 2020, the company reported an increase in subscription revenue of 39% year-over-year while the number of customers of the company grew by 30% year-over-year. DOCU’s year-to-date performance has been nothing short of stellar with the stock price rising by 262.7%. The company is expected to witness double-digit revenue growth of 35.2% in the current year and 28.3% next year. The company’s EPS is also expected to grow by 31.2% per annum over the next five years. It’s no surprise that DOCU is rated a “Strong Buy” in our POWR Ratings system. It also has an “A” for Trade Grade, Buy & Hold Grade, and Industry Rank. In the 92-stock Software – Application industry, it is ranked #6. Want More Great Investing Ideas? 7 Best ETFs for the NEXT Bull Market Beware Stocks in September? 9 “BUY THE DIP” Growth Stocks for 2020 SAP shares were trading at $168.81 per share on Wednesday afternoon, up $2.45 (+1.47%). Year-to-date, SAP has gained 27.31%, versus a 11.86% rise in the benchmark S&P 500 index during the same period."}]}