{"article": [{"url": "https://stocknews.com/news/nio-edu-htht-sogo-is-electric-vehicle-maker-nio-a-buy-under-20/", "published": 1601381300.0, "headline": "Is Electric Vehicle Maker Nio a Buy at $20?", "body": "NIO Inc. (NIO) is a Shanghai-based electric vehicle (EV) producer, commonly referred to as the “Tesla of China.” The company designs, manufactures, and sells premium cars under the ES8, EVE, and EP9 brand names. It is also involved in the provision of energy and service packages for its users developing e-powertrains and battery packs. NIO has a strategic collaboration with Mobileye N.V. for the development of automated and autonomous vehicles. Moreover, the company launched the innovative Battery as a Service (BaaS) subscription model in August and announced the establishment of Wuhan Weineng Battery Asset Co., Ltd. With the growing excitement among investors about the world gradually going electric, demand for NIO’s products is increasing exponentially. The stock gained 368% year-to-date and hit its 52-week high of $21.05 earlier this month. However, the stock stumbled this month due to profit bookings and is currently trading 10.6% below the recently achieved high. NIO achieved record quarterly revenue of $526 million in its second quarter of the fiscal year 2020, which represents 139% year-over-year growth. Vehicle sales grew 146% year-over-year to $493.4 million in the quarter. However, the company is still not making a profit. It reported a loss of $0.16 per share for the quarter, but this is a significant improvement from the quarter-ago loss of $0.23 per share. This impressive performance and the potential upside based on several factors have helped it earn a “Buy” rating in our proprietary rating system. 7 \"SAFE HAVEN\" Dividend Stocks for Turbulent TimesHere is how our proprietary POWR Ratings system evaluates NIO: Trade Grade: A NIO is currently trading higher than its 50-day and 200-day moving averages of $15.87 and $7.43, respectively, indicating that the stock is in an uptrend. The stock’s 137.8% return over the past three months reflects a solid short-term bullishness. NIO has recently announced that it has officially begun deliveries of the EC6, its five-seater premium electric coupe SUV. NIO delivered 3,965 vehicles in August alone, recording a fresh monthly high with an increase of 104% year-over-year. The company has delivered a total of 21,667 vehicles till August, accounting for a 110% increase year-over-year. Buy & Hold Grade: B NIO is well positioned in terms of proximity to its 52-week high, which is a key factor that our Buy & Hold Grade takes into account. The stock is currently trading 10.6% below its 52-week high. The stock has gained more than 169% over the past two years. The company was facing a liquidity crunch earlier this year. Hence, at the end of April, NIO entered into an agreement with strategic investors into its business and announced substantial completion of cash injections in June. The company has also raised $1.73 billion through a series of follow-on public offerings of its common share. In words of Wei Feng, NIO’s chief financial officer, “We have demonstrated our capabilities to generate positive cash flow from operations, through the continuous improvement of our operational efficiency and our significantly optimized cash flow management.” Peer Grade: A NIO is currently rated #13 out of 115 stocks in the China group. Other popular stocks in the industry are New Oriental Education & Technology Group, Inc. (EDU), Huazhu Group Limited (HTHT), and Sogou Inc. (SOGO). NIO comfortably beat the year-to-date gains of the three industry participants. EDU, HTHT, and SOGO returned 23.4%, 11.3%, and 90.6%, respectively, over this period. Industry Rank: B The China group is ranked #17 out of the 123 StockNews.com industries. The companies in this group are headquartered in China. Despite the persistent trade war between the United States and China, the companies in the group are on an incredible run — going too high, too fast. Key industries in China have recovered sharply after the pandemic. Overall POWR Rating: B (Buy) Overall, NIO is rated a “Buy” due to its impressive past performance, improving liquidity position, short-and-long-term developments, and solid price momentum, as determined by the four components of our overall POWR Rating. Bottom Line NIO has soared so far this year and is a decent investment for investors looking to benefit from the clean energy and electrification trend. NIO is the cheapest of the multitude of electric vehicle stocks. The company has the potential to grow further based on its expanding sales network, user community support, and competitive products. Analyst sentiment, which gives a good sense of a stock’s future price movement, is pretty impressive for NIO. The average broker rating of 1.63 indicates a favorable analyst sentiment. Of the 15 Wall Street analysts that rated the stock, 7 have given it a “Strong Buy” rating. Moreover, the market expects EPS for the current year to rise 92.9% from the year-ago value. Want More Great Investing Ideas? 7 “Safe-Haven” Dividend Stocks for Turbulent Times When Does the Next Bull Run Start? Chart of the Day- See the Stocks Ready to Breakout NIO shares were trading at $20.35 per share on Tuesday afternoon, up $1.54 (+8.18%). Year-to-date, NIO has gained 406.22%, versus a 5.08% rise in the benchmark S&P 500 index during the same period."}]}