{"article": [{"url": "https://stocknews.com/news/snow-tsla-aapl-crm-the-snowflake-ipo/", "published": 1601294900.0, "headline": "Should You Buy Shares of Snowflake a Week After its IPO?", "body": "The technology cloud is critical for the future Snowflake (SNOW) comes to the market with a bang A highly speculative stock- Look to buy on weakness after a wild IPO Buffett had always been wary of tech stocks- But he bought SNOW Marc Benioff and Salesforce (CRM)- another high-profile supporter A snowstorm that was more like a financial blizzard hit the stock market on Wednesday, September 16. Snowflake Inc (SNOW) is a company that provides a cloud-based data platform in the United States and worldwide. The company’s platform enables customers to consolidate data into a “single source of truth to drive meaningful business insights, build data-driven applications, and share data,” according to SNOW’s company profile. Snowflake Inc has been in business since 2012 with its headquarters in San Mateo, California. It became a public company on September 16, and its arrival on the New York Stock Exchange was greeted with great enthusiasm. A high-profile investor and the founder of a leading technology company have been supporters of Snowflake. Early investors experienced a blizzard of profits on the day the shares began trading in the market. The technology cloud is critical for the future 7 Best ETFs for the NEXT Bull MarketCloud computing is the on-demand availability of computer system resources when it comes to data storage and computing power without direct active management by users. The cloud is a massive data center available to many users over the internet. Technology has evolved at a breakneck pace over the past half-century. When I was in college, the computer center was a refrigerated room with humming machines running on tubes. Today, a single iPhone has more computing power than those rooms. It is hard to imagine life without computers and technology. During the global pandemic, technology has saved the global economy, allowing people to continue to work from home, communicate with friends and relatives, and keep in touch with daily events. Storing massive amounts of data became an increasing problem as technology evolved. The cloud solves the problem. The founders of SNOW built a platform to harness the immense power of the cloud. SNOW’s products allow thousands of organizations to explore, share, and unlock the value of their data. Snowflake (SNOW) comes to the market with a bang Shares of Snowflake Inc. began trading at an initial public offering price of $120. The demand for the stock was so intense that it opened trading at more than double the IPO price. The first trade was at an incredible $245 per share. On Friday, September 25, the stock closed at the $229.01 level. SNOW has a market cap of just above $63.5 billion. During the early days of trading, an average of over 10 million shares has changed hand each day. Source: CQG As the chart shows, the shares traded up to a high of $319 on the first day of trading on September 16. Weakness in the technology sector sent them to a low of $208.55 on September 24. At almost $90 above the IPO price at the end of last week, the initial frenzy for the company continues to keep the stock at an extremely high valuation. As of September 20, SNOW shares were expensive compared to all the other high-flying technology stocks. Source: @leadlagreport The chart shows that the IPO frenzy lifted SNOW shares to an unsustainable level from a fundamental perspective. A highly speculative stock- Look to buy on weakness after a wild IPO The trend is always your best friend when it comes to asset prices. Stock prices can move far higher or lower than rational levels. Tesla shares (TSLA) are an example of how irrational exuberance can drive the price of a stock to levels that are far higher than logic dictates. Source: Barchart TSLA closed 2019 at a split-adjusted $83.67 per share and climbed to a high of $502.49 on September 1. The shares were still trading at a lofty level at over $407 at the end of last week. Energy-related stocks that pay dividends that are far higher than the market’s average are trading at the lowest levels in decades, even though the stock market is close to all-time highs. When it comes to SNOW, new listings often return to their IPO levels, which is far below the price level at the end of last week. The prospects for the company are exceptional. However, SNOW needs to establish an earnings record. Gravity in the stock market can be a powerful force. The price action in the shares created the potential for a substantial correction to a level that would offer value for investors. I would not buy SNOW at almost $230 per share but would consider adding it to my portfolio if it were to decline back to the $120 level over the coming months. Meanwhile, the company has two very influential supporters, but they got in cheap. Buffett had always been wary of tech stocks- But he bought SNOW Warren Buffett has never been an aggressive investor in technology stocks, and he rarely buys companies during initial public offerings. Berkshire Hathaway purchased around a 2.5% stake in SNOW for roughly $570 million at a valuation of around $24 billion. Typically, Mr. Buffett has invested in utilities, manufacturers, retailers, and insurance companies. The leading companies in Berkshire’s portfolio have been American Express, Coca-Cola, Bank of America, and Kraft Heinz. However, the most valuable holding is Apple (AAPL). Mr. Buffett invested in the world’s most valuable company came only a few years ago. Berkshire Hathaway has not only avoided investing in IPOs but warned investors from participation. In 2019, Buffett told CNBC, “In 54 years, I don’t think Berkshire’s ever bought a new issue.” The only exception was StoneCo, a Brazilian digital payment group it backed during its IPO in 2018. Buffett’s attitude to most IPOs is, “How can it be the best single thing to use your money for in a given day is something that you’ve got everyone in the world out pushing it? It just doesn’t make any sense.” In its 2004 annual report, Mr. Buffett said that the timing of an IPO tends to favor the company, not its new investors. “The seller decides when to come to market in most cases. They don’t pick a time that’s necessarily good for you.” Buffett and his lieutenants made a high-profile exception in SNOW’s case putting $570 million of capital at risk. So far, the bet has paid off handsomely, but time will tell if his stance on IPOs is a shift in strategy or a one-off investment in the cloud. Marc Benioff and Salesforce (CRM)- another high-profile supporter Marc Benioff is the founder, chairman, and CEO of Salesforce (CRM). CRM has a market cap of over $220 billion. The company develops enterprise cloud computing solutions with a focus on customer relationship management worldwide. Mr. Benioff was another investor who purchased SNOW shares in a private placement along with Mr. Buffett earlier this month. The investments by Warren Buffett and Marc Benioff likely drove the price of SNOW shares higher during its IPO. While the shares fell around $90 from the high on September 16, both investors still have substantial mark-to-market profits on the shares a few weeks later. Berkshire and Salesforce got into the cloud company at an attractive price. I will wait for the stock to come down to the levels they paid before investing in the company. Want More Great Investing Ideas? 7 “Safe-Haven” Dividend Stocks for Turbulent Times When Does the Next Bull Run Start? Chart of the Day- See the Stocks Ready to Breakout SNOW shares were trading at $244.42 per share on Monday morning, up $15.42 (+6.73%). Year-to-date, SNOW has declined -3.75%, versus a 5.15% rise in the benchmark S&P 500 index during the same period."}]}