{"article": [{"url": "https://stocknews.com/news/fb-med-pfsi-dks-dhi-a-investor-screening-strategies-to-profit-in-the-stock-market/", "published": 1599739700.0, "headline": "A+ Investor Screening Strategies to Profit in the Stock Market", "body": "Today, I look at the most popular screening strategies followed by AAII members. These are stock strategies that have been marked the most as “favorite” screens in A+ Investor at AAII.com, and they give an insight into the screening strategies that real investors are following right now. Read on for more on the favorite stock approaches and see a list of the top stocks that are passing these screens right now. Favorite A+ Investor Screening Strategies Of the more than 60 stock screening strategies that AAII tracks, some are more popular than others. A+ Investor subscribers can tag approaches to follow and see which companies meet the criteria for their favorite strategies each day. 9 \"BUY THE DIP\" Growth Stocks For 2020A+ Investor.com is AAII’s new suite of tools that helps investors to monitor their investments, discover new opportunities and learn which strategies work (or don’t work). Taking all the screening strategies that members have tagged to follow, A+ Investor looks at the strategies with at least one passing company, tallies how often each screen has been favorited, then ranks those strategies by popularity. All of the screening strategies that AAII tracks have been developed and backtested using Stock Investor Pro, AAII’s fundamental stock screening and research database program. Many investors choose to follow screens based on specific guru and/or factor strategies. The most widely followed strategies offer a portrait of A+ Investor subscribers.The first table below summarizes the performance of the favorite guru and factor screening strategies that AAII tracks. Some of the strategies are based on the investment philosophies of such investing “gurus” as Warren Buffett, William O’Neil and James O’Shaughnessy. The screening strategies are also categorized based on the “factors” that underlie each strategy. A key at the bottom of the table explains the factor initials, such as value (V), growth (G) and momentum (M). Strategy Favorites (Ranked by Most Popular Strategy for A+ Investors With at Least One Passing Company) The two most popular screening strategies are O’Neil’s CAN SLIM Revised 3rd Edition and Stock Market Winners. O’Neil’s CAN SLIM Revised strategy is up 13.8% for the year through August 31, 2020, and has an average annual price gain of 22.7% over the last 10 years. The Stock Market Winners approach was developed by Marc Reinganum and stems from a publication by William O’Neil & Co. titled “The Greatest Stock Market Winners: 1970–1983.” The Stock Market Winners approach is down for the year but has an average annual price gain of 14.9% over the last 10 years. For those interested in learning more about the CAN SLIM strategy and seeing a model portfolio based on it, AAII’s Stock Superstars Report uses and writes in detail about O’Neil’s philosophy. You can learn more about the Stock Superstars Report here. All of the strategy favorites in the table above have strong five- and 10-year average annual performance track records. They all are up for the year through August 31, except for Stock Market Winners and O’Shaughnessy Tiny Titans. The Inve$tWare Quality Growth screening strategy seeks to identify growth companies that have been increasing sales by at least 7% a year over the last one-, three- and five-year periods, as well as fully diluted earnings per share from continuing operations of at least 15% over the same periods. The Inve$tWare Quality Growth approach has a one-year average annual return of 67.1% and is up 95.7% for 2020 as of August 31. Top Passing Companies From Strategy Favorites The second table shows 18 of the top passing companies based on the most popular screening strategies among A+ Investor members. The list includes two stocks from each strategy except for the O’Neil’s CAN SLIM Revised 3rd Edition and Foolish Small Cap 8 approaches, which only have one passing company each as of September 4, 2020. Most of the other strategies have several companies that pass the approach’s screening filters.The Buffett Hagstrom and Estimate Revisions Top 30 Up approaches each have at least 30 passing companies as of September 4. The companies in the table below were selected from the group of passing companies based on the highest A+ Stock Grades for a specific strategy’s most relevant investment factors. Top Passing Companies (Ranked by A+ Investor Strategy Favorites) Combining investment factors of value, growth and quality, the Buffett Hagstrom screen looks for stocks with, among other characteristics, a consistent operation history as measured by operating profits and return on equity (ROE) greater than 15% for the current period. The strategy also seeks stocks with operating margin and net profit margin greater than the respective industry medians to reflect Buffett’s preference for companies that have defensible market share.Two of the companies passing the Buffett Hagstrom screen are Facebook Inc. (FB), the online social media and social networking service, and Medifast Inc. (MED), a nutritional products company focused on health and wellness. Both companies have A+ Stock Grades of A’s and B’s for the quality and growth investment factors.PennyMac Financial Services Inc. (PFSI)—a U.S.-based financial services company—passed the Estimate Revisions Up 5% screen, which utilizes an approach to seek stocks with upward earnings estimate revisions. Of the passing companies in the table above, PennyMac Financial Services is among the top companies with the most investment factors with A+ Stock Grades of A’s or B’s. It has A’s for value, momentum, quality and earnings revisions and a B for growth.The earnings revisions grade takes into consideration the magnitude of a company’s latest two earnings surprises as well as the percentage change in the current year’s consensus estimate over both the last month and last three months.In addition to PennyMac Financial Services, two other top passing companies from members’ favorite screening strategies have at least five investment factor grades of A or B from A+ Stock Grades. One of the companies, Dicks Sporting Goods Inc. (DKS), an omni-channel sporting goods retailer, passes the Estimate Revisions Up 5% and Estimate Revisions Top 30 Up screens. The other company is homebuilder D.R. Horton Inc. (DHI), which passes the Inve$tWare Quality Growth screen.By keeping an eye on the screening strategies that AAII’s A+ Investors are following, you have one more piece of the investment puzzle that may help aid your investment search. The stocks meeting the criteria of the approach do not represent a “recommended” or “buy” list. It is important to perform due diligence. If you want an edge throughout this market volatility, become an AAII member. FB shares were trading at $275.82 per share on Thursday afternoon, up $2.10 (+0.77%). Year-to-date, FB has gained 34.38%, versus a 6.62% rise in the benchmark S&P 500 index during the same period."}]}