{"article": [{"url": "https://stocknews.com/news/caj-hpe-wdc-3-large-tech-stocks-to-avoid-this-year/", "published": 1600690100.0, "headline": "3 Large Tech Stocks to AVOID This Year", "body": "Tech stocks were the primary driver of the skyrocketing market performance during the COVID-19 pandemic. All software-as-a-service (SaaS) stocks that facilitated digitization surged to new highs. Semiconductor stocks supporting artificial intelligence (AI) surged to record valuations. But not all tech giants performed well. The traditional hardware industry has huge operating expenses and high capital requirements. Long before the economy took a major hit due to the pandemic, the industry started witnessing consolidation and restructuring due to the cyclical demand environment. Hardware is costly and demand is lower when the economy is down. Individuals and enterprises invest more in hardware when the economy is strong and cut investment when the economy falters. The pandemic and resulting recession have pulled down the hardware industry, which started to recover from a cyclical downturn just before the pandemic. Stocks of Canon, Inc. (CAJ), Hewlett Packard Enterprise Company (HPE), and Western Digital Corporation (WDC) have taken a beating of over 40% this year. These stocks are best avoided as they are unlikely to grow over the near-term in absence of any tangible internal or external drivers. 7 Best ETFs for the NEXT Bull MarketCanon, Inc. (CAJ) Canon, once a household name, is slowly losing its value. Being a Japanese company, CAJ gets little media coverage in the United States. Moreover, the company is operating in a mature industry. It manufactures printers, cameras, office multifunctional devices, diagnostic equipment, and lithography equipment. The printer OEM market has been contracting, with shipments down 7.5% year-over-year in the first quarter, according to International Data Corporation (IDC). In this declining market, CAJ faces huge competition from HP Inc. (HPQ), which is a market leader with a 42% share. CAJ comes in second with a 19% market share. In a mature stage, the industry sees reduced demand. Hence, companies cut costs to squeeze out maximum cash flow. This has happened with CAJ. Its revenue and net income have been reduced at a CAGR of negative 1.1% and negative 11%, respectively, between 2015 and 2019. CAJ’s sales volumes from the Office and Imaging Systems business segments, which contribute over 70% towards the company’s revenue, have been falling. The pandemic just accelerated the decline. CAJ reported a quarterly loss of around $83 million or 8.8 billion Yen in the second quarter, as its revenue fell 25.7% year-over-year. With offices closed and remote working becoming the new trend, the two segments’ sales are expected to fall by around 20% year-over-year this year. CAJ expects to report its first negative free cash flow in four years of $510 million in 2020. The business contraction pulled CAJ stock price down 40% year-to-date to its 2001 level. The stock is unlikely to recover over the near term due to its weak fundamentals. Hence, it comes as no surprise that CAJ is rated a “Sell” in our POWR Ratings . It holds a grade of “F” in Trade Grade, a “D” in Peer Grade and Buy & Hold Grade, and a “C” in Industry Rank. It is also the #17 ranked stock in the 28-stock Technology – Hardware industry. Hewlett Packard Enterprise Company (HPE) HPE is the enterprise business that was split from HP in 2015 to streamline operations and maximize returns to shareholders. Since then, restructuring has become a never-ending task for HPE. In 2017, the company launched the HPE Next program to boost organic growth and cut $1.5 billion in costs over the next three years. The program helped it improve its operating margin from 7.3% in the first quarter of 2018 to 10.2% in the fourth quarter of 2019. During this time, the stock surged 10%. After three years, HPE is planning to cut another $1 billion in annual expenses over the next three years due to the challenges presented by the pandemic. What should shareholders make of this constant restructuring? HPE offers servers, storage, networking, consulting and support, and financial services. In the server market, it faces strong competition from market leader Dell (DELL), which had a market share of 18.7% in the first quarter, according to IDC. HPE ranks second with a 15.5% market share. The enterprise storage market is cyclical. Companies spend more on server and networking storage when they are assured of the business growth, and less when business conditions are uncertain. HPE was hit by the uncertainty created by the pandemic. It saw slower orders and faced manufacturing challenges, which reduced its fiscal 2020 third-quarter revenue by 5.5% year-over-year to $6.8 billion. Gartner expects worldwide IT spending to fall 8% to $3.4 trillion in 2020 as the pandemic triggers the global recession. The spending on data center systems is expected to fall by 9.7%. Such weak forecast and fundamentals have pulled down HPE stock by 40% to its 2016 levels. Analysts expect HPE’s revenue and EPS to fall 8.4% and 24%, respectively, in 2020. This means the stock is unlikely to recover over the near term. According to the POWR Ratings, HPE is rated a “Sell”. It holds a grade of “F” in Trade Grade and a “D” in Peer Grade and Buy & Hold Grade. Within the 53-stocks Technology – Services industry, it is ranked #31. Western Digital Corporation (WDC) Like HPE, WDC also suffers from cyclicality. WDC operates in the NAND Flash storage solutions market, which is highly consolidated with five players commanding a 90% market share. Among them, WDC ranks third (with 15.2% market share) after Samsung and Kioxia, which was spun off from Toshiba. NAND is storage chips used in PCs, smartphones, servers, automotive, and other embedded devices. In this information age, data is king. Every device generates data, driving the need for more storage. The shift towards AI and 5G would increase NAND industry revenue at a CAGR of 11.27% over the 2020-2025 period, according to Mordor Intelligence. However, NAND chips are commoditized, which means WDC doesn’t have pricing power. Hence, when there is oversupply in the NAND market, demand and prices fall. At that time, industry players reduced production to bring supply in line with demand and increase NAND prices. They are also affected by end-consumer demand for PCs and smartphones. WDC’s earnings and stock price rises significantly in an upturn and falls significantly in a downturn. This is because manufacturing memory chips are capital intensive. The trade feud between the United States and China has severely affected the memory market. Hence, WDC stock fell more than 60% between March and December 2018. When the NAND market began to see a surge in demand, the COVID-19 pandemic disrupted the market and caused the stock to hit its bottom. The economic recession would keep end-demand subdued, pushing WDC deeer into the red. For a cyclical stock, high debt can lead to losses during a downturn. WDC has a debt of $9.7 billion, which increases the risk of losses if demand doesn’t recover. Its stock fell 43% and is unlikely to recover until end-consumer demand surges. WDC’s cyclical risk, huge debt, and trade tensions have resulted in a “Strong Sell” rating in our POWR Ratings system. It has a grade of “F” for Trade Grade and Buy & Hold Grade, and a “D” for Peer Grade and Industry Rank. In the 8-stock Technology – Storage industry, it is ranked #5. Want More Great Investing Ideas? 7 Best ETFs for the NEXT Bull Market Stock Market Outlook: Before & After the Election Chart of the Day- See the Stocks Ready to Breakout CAJ shares were trading at $16.00 per share on Monday morning, down $0.40 (-2.44%). Year-to-date, CAJ has declined -40.46%, versus a 1.54% rise in the benchmark S&P 500 index during the same period."}]}