{"article": [{"url": "https://stocknews.com/news/iep-ten-lng-3-stocks-that-carl-icahn-bought-in-the-second-quarter/", "published": 1597752500.0, "headline": "3 Stocks That Carl Icahn Bought in the Second Quarter", "body": "Carl Icahn is one of the most successful and savviest operators in the financial world. He has an estimated net worth of $15.7 billion. Investors are always paying attention to his public comments and transactions to get insight into his thinking. He made waves back in March for predicting a crash in the commercial real estate market in an interview with CNBC. He said the housing market bubble of 2008 has “happened all over again,” in the commercial real estate market. So far, he’s up more than $1 billion on this trade. During the first quarter, Icahn didn’t make any trades, instead, he was a net seller. However, he’s been quite active in the second quarter, as he’s been deploying capital into existing positions as the market and economy have been recovering. According to the latest 13F filings, Icahn added to Icahn Enterprises L.P. (IEP), Cheniere Energy, Inc. (LNG) and Tenneco Inc. (TEN). 9 \"BUY THE DIP\" Growth Stocks For 2020Icahn Enterprises L.P. (IEP) IEP is an American conglomerate owned and operated by Carl Icahn. It’s diversified between investing, automotive, energy, metals, railcar, gaming, food packaging, real estate, and home fashion businesses in the United States, Germany, and internationally. Its Investment segment operates various private investment funds. Icahn increased his stake by 4.07% in IEP during the preceding quarter. He currently holds more than 205 million shares of the company compared to his prior holding of 197 million shares. And, it accounts for 50.4% of his portfolio which makes it his largest holding. Currently, this position worth around $11.5 billion. IEP’s second-quarter results were impressive, with the company reporting a top-line $2.7 billion, a 23% increase year-over-year. Net income stood at $299 million compared to the year-ago loss of $498 million. Cash flow from operations was $235 million, while IEP generated a free cash flow of $26 million for the quarter. Moreover, IEP has a dividend yield of 14.32%. IEP reported an EPS of $1.36, beating the consensus estimate by 402.2%. The EPS is expected to grow by 92.4% in the current quarter. The stock is currently trading 20% below its 52-week high of $70.63. Additionally, the stock has gained more than 65% from its March lows. How does IEP stack up for the POWR Ratings? A for Trade Grade B for Buy & Hold Grade A for Peer Grade B for Overall POWR Rating. It is ranked #3 out of 55 stocks in the Private Equity industry. Cheniere Energy, Inc. (LNG) LNG is an energy infrastructure company that engages in the liquefied natural gas-related businesses. It operates through two segments — LNG Terminal Business and LNG and Natural Gas Marketing Business. Its energy products are marketed in five continents as demand for clean fuel is growing among economies around the world. LNG is the six-largest holding of Icahn forming 5.1% of the portfolio. He presently holds more than 20.8 million shares of LNG. He increased his stake in LNG by 3.3% in the last quarter from the previous holding of 20.2 million shares. The investment is worth $1.1 billion now. LNG’s top-line grew 5% year-over-over to $2.4 billion in the second quarter. Net income came in at $197 million compared to the year-ago loss of $144 million. The company generated a free cash flow of $27 million while the cash flow from operations increased 30% to $454 million. LNG has an impressive earnings surprise history with the company delivering positive surprises in three of the trailing four quarters. LNG reported an EPS of $0.78 for the second quarter, beating the consensus estimate by 30%. The EPS is expected to grow by 98% in the current quarter. LNG is currently trading at a 20% discount from its 52-week high of $67.49. The stock had hit a low of $27.06 in March but has already recovered more than 99% now. LNG is rated “Buy” in our POWR Ratings system, consistent with its strong growth estimates. It holds an “A” in Peer Grade and a “B” in Trade Grade. It is ranked #6 out of 97 stocks in the Energy – Oil & Gas industry. Tenneco Inc. (TEN) TEN designs, manufactures, and sells clean air, powertrain, and ride performance products and systems for light vehicle, commercial truck, off-highway, industrial, aftermarket customers and other vehicle applications worldwide. It is one of the leading global suppliers to original equipment manufacturers and the aftermarket. Icahn presently holds 9.13 million shares of TEN compared to the previous holding of 5.65 million shares. This cumulates to a 61.7% increase. TEN’s current weightage in the portfolio is 0.35%. The holding is worth $86 million now. The pandemic affected TEN’s business, although it’s showing signs of recovery. As a result, the company’s second-quarter revenue declined 41% year-over-year to $2.6 billion. The company had a gross margin of 5.3% for the quarter. Despite reporting a negative EPS, the company managed to beat the street estimates by 39%. The EPS is expected to grow by 158% next year. The stock had hit a 52-week low of $2.21 on March 4th but has gained more than 327% so far. Moreover, it is currently trading at a 42% discount from its 52-week high of $16.29. As per our POWR Ratings, TEN holds a “B” for Industry Rank. It is currently ranked #31 out of 50 stocks in the Auto Parts industry. Want More Great Investing Ideas? The Best of StockNews 3 Possible Directions for the Stock Market from Here 9 “BUY THE DIP” Growth Stocks for 2020 IEP shares were unchanged in after-hours trading Tuesday. Year-to-date, IEP has gained 0.59%, versus a 6.30% rise in the benchmark S&P 500 index during the same period."}]}