{"article": [{"url": "https://stocknews.com/news/tsla-kars-plug-nkla-nio-2-electric-vehicle-stocks-to-buy-2-to-avoid/", "published": 1602072500.0, "headline": "2 Electric Vehicle Stocks to Buy, 2 to Avoid", "body": "Electric vehicle (EV) stocks have been one of the best-performing groups of the year. On a YTD basis, the KraneShares Electric Vehicle and Mobility ETF (KARS) is up 25%, while the S&P 500 is just 5% higher. This outperformance has continued even in the short-term. In September, the S&P 500 was down nearly 5%. Yet KARS was flat for the month. Additionally, KARS is 11% above its pre-coronavirus highs, while the S&P 500 is around the same level. 9 \"BUY THE DIP\" Growth Stocks For 2020This is particularly impressive since KARS is composed of many high-beta stocks which tend to see bigger losses when the market is selling-off. KARS’ resilience is an indication that investors are using the market’s weakness as an opportunity to accumulate shares. It’s also a sign that its outperformance is likely to continue in 2020’s final quarter. Another development that is constructive for the sector is the strength in lithium. Lithium is a necessary component of batteries. Its rising price and the price action in lithium miners is further confirmation of the bullish thesis for the EV sector. Catalysts There are three major catalysts for the strength in the sector. The odds of a Biden win are increasing. Further, the odds of Democrats winning a majority in the Senate have risen to 65%. This has fueled gains in EV stocks as Biden’s energy plan proposes large tax credits for EV purchases, investments in charging infrastructure, and a cash for clunkers program centered around EVs. The quality and performance of EVs are improving at a rapid rate which is making them more competitive with gas-powered vehicles. Due to improvements in batteries, it’s expected by 2024 that electric-powered cars will have the same range and similar costs as gas-powered cars even without subsidies. In 2020, the premium for growth stocks has increased due to falling interest rates and economic growth expectations. EVs are one of the few industries with above-average growth prospects in the coming decades. Right now, there are 8 million electric vehicles on the road, and they account for 5% of all vehicle sales. Over the next decade, it’s expected that electric vehicle sales will surpass gas-powered vehicles, and total annual sales will exceed 100 million. 2 Stocks to Buy and 2 to Avoid Despite these positive catalysts and favorable trends, investors should still be judicious in picking the best stocks. It’s true that in a bull market, a “rising tide lifts all boats.” However, at a certain point, reality rears itself and punishes the stocks that are driven by hype rather than genuine improvements in their business. The opportunity in EVs is also attracting well-funded startups and legacy car companies. Weaker companies will struggle in a more competitive environment. In EVs, two companies with the strongest businesses are Tesla (TSLA) and Plug Power (PLUG), while investors should avoid NIO (NIO) and Nikola Motors (NKLA). Tesla (TSLA) Tesla is 15% off it’s all-time highs. Some of the catalysts for this decline are that it wasn’t chosen for inclusion in the S&P 500 and it underwhelmed investors on Battery Day. However, it’s one of the best-performing stocks in the market with a nearly 300% YTD gain and an 840% gain over the last 12 months. Despite these impressive gains, TSLA has further upside given that it’s the leading company in three trillion-dollar markets – EVs, autonomous driving, and batteries. In all of these industries, Tesla is likely to benefit from network effects and economies of scale that will increase the chances of its products being cheaper and more technologically advanced than its competitors. The POWR Ratings also have a constructive view on the stock as it’s rated a Buy with a “B” for Trade Grade, Peer Grade, and Industry Rank. Among Auto & Vehicle Manufacturers, it’s ranked #4 out of 29. Plug Power (PLUG) Among EV stocks, PLUG has been demonstrating the strongest price action, as it’s breaking out to new highs. PLUG is an attractive stock because it benefits from many of the same trends as other EV stocks, but it’s competing and dominating its own niche of the industry. PLUG is focused on developing hydrogen-powered forklifts and sells to companies that are looking to save on fuel expenses and reduce emissions. The global forklift market is a $30 billion market, and PLUG has a 1% market share which means it has considerable room to grow. The company’s products also have shorter charging times, take up less space, and are lighter than traditional forklifts. The shift away from physical retail to e-commerce has also resulted in an increase in warehouse space which is another positive catalyst for PLUG. These factors are resulting in PLUG expecting 40% annual revenue growth over the next five years. Another source of upside for PLUG is that it’s beginning to transition from being a forklift company to a hydrogen-fuel company. It’s applying its hydrogen technology for other uses including trucks, powering data centers, and delivery vehicles. This means that PLUG’s market opportunity is much bigger than just $30 billion. The POWR Ratings give PLUG a Strong Buy rating. It has an “A” for Trade Grade, Buy & Hold Grade, and Peer Grade with a “B” for Industry Rank. NIO (NIO) Like its peers, NIO has seen big gains in recent months. However, its outlook is much cloudier. Many are touting the stock as the Tesla of China. However, this metaphor is misleading, because Tesla is already selling cars in China and establishing a foothold in that market. NIO has a $30 billion market cap with a price-to-sales ratio of 21, so the stock is already pricing in future growth. However, NIO is about to embark on the most challenging endeavor for an upstart car company – ramp up production while maintaining quality. It’s already had some problems like a recall of nearly 5,000 batteries and reports of cars catching fire due to engine problems. The current price is assuming that NIO will be successful in this task. Another challenge for NIO is that it’s about to face increasing competition. It’s estimated that there are 400 Chinese electric car makers who are vying for a piece of the market. Further, legacy car companies are also expected to start selling EVs in China in the coming months. Over the next 12 months, Volkswagen and Ford (F) are starting production of electric cars in China. This competition will lead to lower prices. Given the strength in the EV market and its strong price momentum, there’s no reason to expect that NIO’s advance will be interrupted anytime soon. However, the market is underestimating the scope of NIO’s challenges. Even TSLA struggled to scale up production, it also had to face a much less competitive environment. Nikola Motors (NKLA) Since going public, controversy has followed NKLA. The company’s goal is to design and build electric and hydrogen-fueled trucks. Its stock got off to a strong start as its tech looked promising, and it had a massive market opportunity. Since peaking in early-June, the stock has steadily slid lower. Investors should avoid trying to pick a bottom with NKLA given the number of red flags. The company is years away from generating revenue, yet it still has an $8 billion market cap. Buying the stock is a bet that NKLA’s management will be able to turn its vision into reality. However, NKLA’s short public history undercuts this trust. The company staged a video of its truck rolling down a hill that purported to show its electric engine. Another controversy is that it claimed to develop the inverters used in its engines, but it turns out to be sourced from a third-party. Additionally, the designs for its trucks are also from another company. Given these warning signs, investors should avoid NKLA. Want More Great Investing Ideas? Do NOT Buy Stocks Before the Election! 7 “Safe-Haven” Dividend Stocks for Turbulent Times Chart of the Day- See Christian Tharp’s Stocks Ready to Breakout TSLA shares were trading at $419.59 per share on Wednesday morning, up $5.61 (+1.36%). Year-to-date, TSLA has gained 401.51%, versus a 7.00% rise in the benchmark S&P 500 index during the same period."}]}