{"article": [{"url": "https://stocknews.com/news/wmt-cost-bby-kr-4-stocks-that-will-benefit-from-a-second-stimulus-check/", "published": 1599739700.0, "headline": "4 Stocks That Will Benefit from a Second Stimulus Check", "body": "It is quite concerning that most Americans have only received a one-time $1,200 economic stimulus check amid a deep economic trough. After all, plenty of Canadians have received $2,000 per month throughout the pandemic. Though the economic picture in America looks quite grim, there is still a chance President Trump and Congress will pass another round of stimulus checks. Some conspiracy theorists even argue President Trump will push for a second round of stimulus checks during the month or even weeks leading up to the election to bolster his chances of prevailing over Joe Biden. Let’s assume a second stimulus check is passed into law before the start of November. The following four stocks stand a good chance of increasing in value as a result of the inevitable hike in consumer spending: Walmart (WMT), Costco (COST), Best Buy (BBY), and Kroger (KR). 7 \"SAFE HAVEN\" Dividend Stocks for Turbulent TimesWalmart (WMT) WMT’s most recent quarterly numbers exceeded analyst expectations, helping the stock climb significantly higher. Furthermore, the rumors of WMT making a run for TikTok have also helped the stock move upward. If a second stimulus check is issued, plenty of the money will be spent at WMT stores and WMT’s website simply because WMT’s inventory is affordable. There is a WMT store within a reasonable driving distance of most Americans. The POWR Ratings for WMT could not be better: a grade of “A” in every single POWR component and a #1 ranking of nearly 20 stocks in the Grocery/Big Box Retailers industry. Analysts have set a price target at $150, which is 7% higher than its current price. WMT’s subscription service, Walmart+, helps the company win the allegiance of more and more customers with each passing day. WMT’s recent alliance with Shopify (SHOP) has set the stage for more than a thousand Shopify merchants to sell products on WMT’s website. Costco (COST) Everyone is in search of the essentials in large quantities and at low prices. This is precisely what COST offers. Though COST requires a membership, its loyal members agree it is worth every penny and then some. The POWR Ratings reveal COST has “A” grades in each POWR component. COST is ranked above all but one stock in the nearly 20 publicly traded companies in the Grocery/Big Box Retailers industry. TipRanks reports the average analyst price target for COST is $364.61. COST sales increased a whopping 13% in August alone. This figure has the potential to soar even higher in the aftermath of a second stimulus payment. Best Buy (BBY) Use your mind’s eye to envision how the average person will spend their second stimulus check. Most people are inclined to purchase essentials such as food and household cleaning products, yet many will also spend it on electronics. After all, plenty of people have segued to home offices, meaning they need electronics sold by BBY. Furthermore, people have more time on their hands than ever before, so they are inclined to purchase video games and other entertainment-related items sold at BBY stores. BBY has an “A” Trade Grade and “B” grades in the remaining POWR components, except for Industry Rank. BBY is ranked third of 34 stocks in the Specialty Retailers segment. Though BBY has had a stellar run upward in recent months, analysts have set a price target of $122.17, which is 17% higher than its price. It is apparent BBY earnings growth and sales are holding firm amidst the pandemic. Kroger (KR) Food, drug, convenience, and department stores will be quite busy if a second economic stimulus check is passed into law. KR operates each of these stores throughout the country. Take a look at KR’s POWR Ratings, and you will find the stock is nearly flawless with “A” grades in each POWR component, except for Peer Grade, which is a “B.” KR is also ranked in the top five of nearly 20 stocks in the Grocery/Big Box Retailers industry. Analysts have set a price target of $36.43. KR has a somewhat surprisingly low forward P/E ratio of 12.48, indicating it might be undervalued at its current trading price of $34. Want More Great Investing Ideas? 7 Best ETFs for the NEXT Bull Market Will Stocks Fall into Historical September Slump? 9 “BUY THE DIP” Growth Stocks for 2020"}]}