{"article": [{"url": "https://stocknews.com/news/bxmx-aapl-msft-googl-jnj-pg-this-high-yield-cef-is-your-second-chance-to-buy-stocks/", "published": 1599134900.0, "headline": "This High-Yield CEF Is Your Second Chance to Buy Stocks Cheap", "body": "It’s the million-dollar question these days: how can this market be up double digits in an economy like this? And how can we dare hope for even a little more upside from here? S&P 500 Defies Gravity 9 \"BUY THE DIP\" Growth Stocks For 2020The truth is, there are plenty more gains to be made. But to get them, you need to look just a little beyond the big-name stocks most people limit themselves to. One overlooked place where there are still plenty of bargains (and outsized dividend yields!) to be had is in closed-end funds (CEFs). We’ll take a look at a high-yield CEF that offers you the perfect mix for today’s market—upside potential, downside protection and an outsized 7.2% dividend stream—in a bit. To set the table, let’s discuss why we should be optimistic that this bull has plenty more room to run. Low Expectations Fuel Future Gains The second quarter of 2020 will go down as one of the worst in US history, with GDP contracting 32.9%. But we are starting to see some “green shoots.” For one, economic growth has sprung back to life, with the Federal Reserve forecasting a 28.5% GDP increase in the third quarter, offsetting a lot of the second quarter’s losses. Further, companies and investors braced themselves for a collapse in the second quarter, setting expectations very low. That was a good thing, because the quarter, while obviously rough, wasn’t as apocalyptic as people expected in April. A Spike in Earnings Surprises Expectations were so low that actual earnings reported by companies were 23.1% above expectations, the largest gap we’ve ever seen. Plus, these surprises were across the market, which tells us how far out of step investor pessimism was with reality. When you drill down into the results, some of the figures are just silly. Weapons maker Raytheon (RTX) posted earnings 208% higher than expected, while profits at Amazon.com (AMZN) were 570% higher. The consumer-discretionary sector as a whole reported earnings that were 523% better than forecast. That leads us to another question: if the market was too pessimistic about the second quarter, has it now gotten too optimistic about the third quarter? That’s impossible to answer, since third-quarter earnings won’t start coming out for over a month, and expectations haven’t begun to be tallied. But there’s room for more surprise good news if a near-30% GDP jump becomes reality in the next quarter. Even so, you might still worry that, with the big stock-market gains we’ve seen, stocks won’t meet expectations and another crash is coming. This fear, that the most recent crash is about to repeat itself, is commonplace, and it can cost you serious gains (and dividends). Back in 2009, for example, many investors stayed on the sidelines because they feared a repeat of the subprime-mortgage meltdown. In less than five years, those investors missed out on doubling their money. The High Cost of Staying in Cash The takeaway here is clear: stay in cash and you’ll repeat the mistakes of history. And to be honest, there’s no reason to sit on the sidelines when you can invest in the market and manage your downside risk, too. The key to doing so is a CEF called the Nuveen S&P 500 BuyWrite Income Fund (BXMX). Even though it’s technically a CEF, BXMX is essentially a broad-based index fund that holds the stocks in the S&P 500, so you’re getting exposure to big tech names like Apple (AAPL), Microsoft (MSFT) and Alphabet (GOOGL), as well as non-tech giants such as Johnson & Johnson (JNJ) and Procter & Gamble (PG). But here’s where the added safety comes in, because BXMX sells call options on its portfolio. This functions as a kind of insurance, where the fund earns a cash income stream, even if the market goes down. BXMX then passes this cash to you in the form of its 7.2% dividend, so you can collect a bigger income stream on your investment while also getting upside if this bull run continues and companies continue to impress. That yield alone is in another universe from the return you’d get keeping your money in cash in a high-yield savings account, and that’s before you account for BXMX’s upside: as I write this, the fund trades at a 9.8% discount to net asset value (NAV, or the value of the stocks in its portfolio). So even if that discount were to revert to the 5.4% average we’ve seen over the last year, you’d get some nice price upside here, even if the portfolio itself simply trades sideways. Want More Great Investing Ideas? Your Early Retirement Portfolio: 7.7% Dividends—Every Month—Forever How to Retire on 10% Dividends Paid Monthly The Simple (and Safe) Way to Earn 15% Every Year from Stocks BXMX shares were unchanged in after-hours trading Thursday. Year-to-date, BXMX has declined N/A%, versus a 8.42% rise in the benchmark S&P 500 index during the same period."}]}