{"article": [{"url": "https://stocknews.com/news/fang-cnq-rds-a-3-undervalued-energy-stocks-to-buy-now/", "published": 1595506100.0, "headline": "3 Undervalued Energy Stocks to BUY NOW", "body": "The energy sector has been hammered since the pandemic started. The Energy Select Sector SPDR (XLE) is down 34% over the last six months, compared to a 2% decline in the SPDR 500 ETF (SPY). This is a result of the pandemic’s effect on the oil market. While many analysts expect disappointing second-quarter earnings from energy companies, the medium to long-term outlook is much better. Crude oil is up over 148% in the last three months, and we are still years away from electric cars supplanting gas-powered vehicles. With that in mind, I researched energy companies that the markets are undervaluing. To do this, I focused on Price-to-Book Ratio (P/B). This ratio compares a stock’s market value with its net assets. Stocks with low P/B ratios are considered undervalued. Most analysts focus on a P/B ratio of under 3. I went a step further to find companies with P/B ratios of under 1. 7 Best ETFs for the NEXT Bull MarketHere are three undervalued energy stocks that you should consider adding to your portfolio: Diamondback Energy (FANG) FANG is an independent oil and gas producer in the United States. Its primary focus is on the Permian Basin, which is located in western Texas and southeastern New Mexico covering 394,000 acres. In 2018, FANG bought out Energen Corp for $9.2 billion to expand its Permian presence. There are an estimated 60-70 billion barrels of crude oil in the Permian area. Energy companies have been transferring assets to a master limited partnership to monetize their properties. If FANG follows this path, it can transfer assets to its Viper Energy Partners subsidiary, which should provide the company with a steady revenue stream. FANG also has an interest in Rattler Midstream, which owns assets in Midland and Delaware Basin. The stock has a P/B ratio of 0.5, compared with the industry average of 1.0, and a P/B ratio of 3.9 for the S&P 500. Canadian Natural Resources (CNQ) CNQ is another oil and gas producer. The company is one of the largest in western Canada, with additional operations in the North Sea and Offshore Africa. The company’s portfolio includes crude oil, natural gas, bitumen, and synthetic crude oil. CNQ’s Horizon Oil Sands and Athabasca Oil Sands Project hold leases on approximately six billion barrels of synthetic crude oil reserves. The company’s broad and balanced portfolio translates into long term value and reduces its risk profile. CNQ has been able to generate free cash flow through lower capital expenditures, improved operational efficiencies, and acquisitions. This has led to twenty straight years of increased dividends. CNQ, which is trading around $18, has a P/B ratio of 0.9. The company’s $56.8 billion in assets greatly outweighs its $31.9 billion in liabilities. Royal Dutch Shell (RDS.A) RDS.A is an integrated oil and gas company that explores for, produces, and refines oil. Last year the company produced 2.0 million barrels of liquids and 11.4 billion cubic feet of natural gas per day. Its production and reserves are in Asia, Europe, Africa, and North and South America. The company is considered one of the oil supermajors, a group of U.S. and Europe based energy multinationals that cover most of the globe. The company bought Dutch firm BG Group for $50 billion in 2016 to become the largest LNG producer, a supercooled liquid form of natural case. The demand for LMG is expected to rise in Asia, which should benefit the company’s long-term cash flow. The company is also making inroads into a renewable future. RDS.A has acquired renewable companies such as First Utility, New Motion, IONITY, and Silicon Ranch to diversify beyond oil and gas. RDS.A has a price/book ratio of 0.7. The company also has a current ratio of 1.1, which means the company has enough cash to withstand any other potential headwinds. Want More Great Investing Ideas? 9 “BUY THE DIP” Growth Stocks for 2020 Newly REVISED 2020 Stock Market Outlook 7 “Safe-Haven” Dividend Stocks for Turbulent Times FANG shares rose $0.03 (+0.07%) in after-hours trading Thursday. Year-to-date, FANG has declined -55.09%, versus a 1.38% rise in the benchmark S&P 500 index during the same period."}]}