{"article": [{"url": "https://stocknews.com/news/fitb-cfg-bokf-3-sell-the-rip-regional-bank-stocks/", "published": 1594382900.0, "headline": "3 Weak Regional Bank Stocks to Avoid", "body": "Regional banks play an important role in the economy and their fortunes are connected to the health of small businesses and ordinary people. This is made clear with the long-term chart of the regional bank ETF (KRE) which is back to 2013 levels. In contrast, the S&P 500 (SPY) is up 113% since 2013. 7 Best ETFs for the NEXT Bull Market (source: finviz.com) Regional banks peaked in the fall of 2018 and have declined by nearly 50%. The S&P 500 is 6% higher over the same timeframe. Since the March bottom, the S&P 500 has gained 42% from its lows, while regional banks are 26% higher. This underperformance across multiple timeframes is worth noting. While the sector may have some appeal to contrarians and value investors, these stocks are likely to continue trending lower for the rest of 2020. While Wall Street banks have diversified, global businesses, regional banks are primarily focused on taking deposits and lending money. Simply put, lower interest rates make it harder to profit from banking. Additionally, a wave of defaults is likely given the increased unemployment rate, small businesses’ struggles, and the hampered recovery. The refinancing boom is also a negative development for earnings as higher-rate mortgages are replaced by lower-rate ones. Here are three regional bank stocks which will keep trending lower in 2020: Fifth Third Bancorp (FITB) At a glance, FITB looks appealing with its price to earnings ratio of 7.6, 6.2% dividend yield, and price to book value of 0.62. However, the company has some glaring issues due to its exposure to commercial real estate, the mortgage market, and small business loans. More defaults in these sectors seem likely given existing trends. The only way this outcome would be prevented is if the government steps up with more stimulus targeted towards these parts of the economy or the coronavirus situation improves, allowing the economy to return to normal. Otherwise, asset write-downs and a dividend cut would become necessary. Our POWR Ratings system is also negative on FITB, as it has a Sell rating. FITB has a “D” for Buy & Hold Grade and Peer Grade with an “F” for Trade Grade and Industry Rank. It’s ranked #10 out of 53 Midwest regional bank stocks. Citizens Financial Group (CFG) Another challenge for regional banks is the yield curve. Profits are at their peak when spreads are high between short and long-term interest rates. Short-term rates reflect the interest rates that banks payout on deposits and long-term rates are what they charge for loans. Currently, the 3-month Treasury bill is yielding 0.13%, while the 10-year Treasury rate is at 0.6%. Further, the Fed has been musing about yield curve caps as its next form of intervention if the economy continues to perform poorly. This would lead to lower long-term rates and lower profits for regional banks. CFG’s fundamentals reflect this reality. Backward-looking measures look attractive with a 6.9% dividend yield and a 7.8 price to earnings ratio. However, forward-looking indications are much less constructive as the company reduced its earnings forecast by 20% and increased its loss provisions. This was before the recent flare-ups in coronavirus case counts which make a V-shared recovery less likely. CFG’s POWR Ratings are consistent with this bleak outlook. It has a Sell rating and an “F” for Industry Rank and Trade Grade with a “D” for Trade Grade. Among mid-Atlantic regional banks, it’s ranked #6 out of 51. BOK Financial (BOKF) BOKF shares all the negative attributes of CFG and FITB, but it also has major exposure to the energy sector. Nearly 21% of the company’s loan book is energy-related debt with 80% of these loans to oil and gas producers in the shale patch. To give perspective, the amount of energy debt is equivalent to 108% of its tangible common equity. This means that if oil prices remain weak for a prolonged period which results in a wave of bankruptcies in the shale patch, BOKF could face the risk of insolvency. Oil prices have rebounded from their lows primarily due to supply cuts rather than demand resurrecting. BOKF’s outlook is reflected in its POWR Ratings, as it has a Sell rating with a “D” for Buy & Hold Grade, Peer Grade, and Industry Rank with an “F” for Trade Grade. Among Southwest Regional Banks, it’s ranked #6 out of 29. Want More Great Investing Ideas? 9 “BUY THE DIP” Growth Stocks for 2020 Is the Bull S#*t Rally FINALLY Over? 7 “Safe-Haven” Dividend Stocks for Turbulent Times Top 3 Investing Strategies for 2020 FITB shares were trading at $18.24 per share on Friday afternoon, up $0.85 (+4.89%). Year-to-date, FITB has declined -38.83%, versus a -0.70% rise in the benchmark S&P 500 index during the same period."}]}