{"article": [{"url": "https://stocknews.com/news/x-mt-clf-3-struggling-steel-stocks-to-avoid-in-the-second-half/", "published": 1594382900.0, "headline": "3 \"Struggling\" Steel Stocks to Avoid in the Second Half", "body": "At one time, steel stocks were the ultimate boom-and-bust industry. During periods of economic expansion, the demand for steel would increase, and companies would raise prices and rake in profits, leading to soaring stock prices. For example during the last bull market from 2003 to 2008, US Steel (X) gained 1,800%. Companies would also plow money into increasing production in order to meet this demand. When the economic cycle turned, prices would plunge due to overcapacity and decreased demand, and there would be a period of pain. At some point, there would be bankruptcies, consolidation, and production cuts which created the conditions for the next boom. 7 Best ETFs for the NEXT Bull MarketDuring the bear market from 2008 to 2009, US Steel dropped 90%. Since then, the story has changed, and there has been no ensuing boom in the steel industry. While the S&P 500 (SPY) is 378% higher from its 2009 low, US Steel is 51% lower. The primary reason is that steel production has not decreased despite lower prices, because Chinese producers continue to increase production levels. In part, it’s a jobs program for local governments to maintain employment levels. But more importantly, it’s China’s national strategy to become the dominant producer of steel. In 2005, China accounted for 25.8% of the world’s steel production and 12.8% of stainless steel; today, it accounts for 50.8% and 52.8%, respectively. Unlike publicly-traded companies, Chinese companies are not responsive to market signals. This makes the steel companies competing with them a poor investment. Here are three steel stocks to avoid: United States Steel (X) US Steel has higher costs than most of its competitors. It also invested in increasing production a couple of years ago following tariff announcements, however increased demand hasn’t materialized. So, the company was recently forced to raise $700 million at 12% interest rates. The one hope for the bulls is that the company can raise money through the CARES act. While this would result in a short-term pop for the stock, it would provide a great opportunity to sell. Similar to how the stock topped when tariffs were announced early in 2008 at $40 following a short-lived rally. Neither changes the long-term fact that it’s a high-cost producer in an oversupplied market. US Steel’s underperforming stock and POWR Ratings reflect its poor outlook. The company is rated a Strong Sell. It has an “F” for Trade Grade and Buy & Hold Grade in addition to a “D” for Peer Grade and Industry Rank. Among steel stocks, it’s ranked #19 out of 28. Cleveland Cliffs (CLF) Cleveland Cliffs was an iron ore producer which bought AK Steel to become a vertically integrated company. Unfortunately, the acquisition came at a terrible time given that the pandemic will likely negatively impact steel demand for the foreseeable future given weakness in autos, pipeline construction, airlines, and construction. The acquisition resulted in the company taking on debt, and it had to cut its dividend. It’s expected to lose $0.50 per share in 2020. CLF’s fortunes depend on demand coming back which would result in higher prices. It does have enough liquidity and cash to survive the next couple of years, but there’s little reason to believe that earnings will rise, or multiples will expand. According to the POWR Ratings, CLF is a Sell. It has a “F” for Trade Grade and Buy & Hold Grade and a “D” for Peer Grade. It’s ranked 16th out of 33 Industrial – Metals stocks. ArcelorMittal (MT) (source: finviz.com) ArcelorMittal is the largest steel producer in the world, as it produced 97 million tons of steel in 2019. It has operations all over the world. Despite its size and reach, its stock has been a laggard, because it’s basically competing with the Chinese government and their indifference to market signals. Another issue for MT is that iron ore , which is the main input into steel, has been quite strong. This will put negative pressure on margins. Currently, the company earns about $107 per ton. If demand remains weak, iron ore prices rise more, and Chinese supply continues to flood the market, MT’s stock will flounder. Iron ore prices rising is also a potential signal that China is again increasing steel production. MT is rated a Sell by POWR Ratings. It has a “D” for Trade Grade, Buy & Hold Grade, and Industry Rank with a “C” for Peer Grade. Among steel stocks, it’s ranked 7th out of 28 companies. Want More Great Investing Ideas? 9 “BUY THE DIP” Growth Stocks for 2020 Is the Bull S#*t Rally FINALLY Over? 7 “Safe-Haven” Dividend Stocks for Turbulent Times Top 3 Investing Strategies for 2020 X shares were unchanged in after-hours trading Friday. Year-to-date, X has declined -35.35%, versus a -0.31% rise in the benchmark S&P 500 index during the same period."}]}