{"article": [{"url": "https://stocknews.com/news/fcx-plenty-of-reasons-to-target-this-mining-stock/", "published": 1600344500.0, "headline": "Plenty of Reasons to Target This Mining Stock", "body": "It’s been quite the six-month stretch for copper mining stock Freeport-McMoRan Inc (FCX). Since breaching the $5 level on March 19, FCX has more than tripled, rising to the tune of a 216% six-month gain that culminated in a two-year high of $17.15 on Sept. 16. But the fun could be far from over, if past is precedent, with FCX flashing a bullish signal on the charts. Freeport-McMoRan stock’s recent torrid run up the charts has come amid historically low implied volatility (IV). According to data from Schaeffer’s Senior Quantitative Analyst Rocky White, there has been one other time in the past five years when the stock was trading within 2% of a 52-week high, while its Schaeffer’s Volatility Index (SVI) sat in the 20th percentile of its annual range or lower — as is the case with FCX’s current SVI of 49%, which sits just above the 8th percentile of its 12-month range. The data shows the security was higher a month later, with a return of 3.5% for that time period. From its current perch at $16.79, a move of similar magnitude would have FCX trading at its highest level since June 2018. Year-to-date, the shares are up 28%, with their 30-day moving average containing any severe pullbacks since mid-April. FCX also popped up on a list compiled by White that analyzed the efficacy of window dressing. The study determined the best performers over the previous six months to also outperform the last two weeks of the quarter, as institutions add them to their holdings. Sure enough, FCX popped up on the list of “window dressing buys,” boasting the fourth-best return and the only mining stock to appear on the list. 9 \"BUY THE DIP\" Growth Stocks For 2020 Analysts are mostly bullish on FCX, with nine of 14 in coverage doling out “strong buy” ratings and not a single “sell” rating to be found. However, the equity’s 12-month consensus price target sits at $16.44, a 2.1% discount from Wednesday’s closing perch at $16.78. This means that there is ample room for price-target hikes that could boost the equity in the short-term. Some brokerages are already coming aboard; Credit Suisse hiked its price target on FCX to $14.50 from $12 just this morning. The options pits are predominantly focused on calls. In the past 10 days, 37,391 calls have exchanged hands on the International Securities Exchange (ISE), Cboe Options Exchange (CBOE), and NASDAQ OMX PHLX (PHLX), compared to just 9,455 puts. The resultant call/put volume ratio of 3.95 sits in the elevated 77th percentile of its annual range, suggesting a healthier-than-usual appetite for bullish bets of late. Digging deeper, the January 2021 17-strike call is home to the largest increase in open interest during this time frame. This indicates LEAPS traders could be positioning for upside in the long term. What’s more, the stock’s Schaeffer’s Volatility Scorecard (SVS) sits high at 88 out of 100. This means FCX has tended to exceed option traders’ volatility expectations during the past year — a boon for option buyers. Keeping track of the week’s stock market activity is no easy feat. Our Schaeffer’s Market Mashup podcast gives you a quick 15-minute look at hot-button investing news and trends, as well as interviews with analysts and traders to help you craft a rock-solid options strategy. Tune into the latest episode of Market Mashup to up your investment game. FCX shares were trading at $16.94 per share on Thursday afternoon, up $0.16 (+0.95%). Year-to-date, FCX has gained 29.59%, versus a 4.76% rise in the benchmark S&P 500 index during the same period."}]}