{"article": [{"url": "https://stocknews.com/news/wba-cvs-rad-stay-away-from-these-3-drug-store-stocks/", "published": 1594642100.0, "headline": "Stay Away From These 3 Drug Store Stocks", "body": "Over the last couple of decades, national, drugstore chains have been aggressively expanding and putting local small-town pharmacies out of business. 40 years ago, 90% of pharmacies were locally-owned. Today, only 35% are locally-owned with the vast majority, owned by a handful of companies. And in a role-reversal of sorts, the national pharmacies are now threatened by the online companies and retailers like Walmart (WMT) and Costco (COST). In a way, it’s similar to Barnes & Noble putting many local bookstores out of business, but then Amazon (AMZN) came along and upended its business. 9 \"BUY THE DIP\" Growth Stocks For 2020Drugstores have two sources of revenue – there’s the retail part of the store which is similar to a convenience store, and the pharmacy part, where it fills prescriptions. The retail portion of their business is under assault by online sellers who can offer a wider variety of products at cheaper prices with even more convenience given same-day or next-day delivery. The pharmacy part of their business is threatened by deep-pocketed companies who are eager to gain market share and are offering cheaper prices. Therefore, the future of national drugstore chains is in question. Here are three drugstore stocks we think investors should avoid: Walgreens (WBA) The drug stores are not going to accept their fate without a fight. One example is WBA’s recent announcement that it will be opening doctors’ offices in many of its locations. Patients who go to these doctor’s offices will be more likely to get their prescriptions filled at Walgreens. WBA is also converting store space that is currently stocked with low-margin items into higher-margin services like eyeglasses, hearing aids, weight-loss consulting, and package shipping. Notably, these sources of revenue are less prone to disruption from the Internet and can benefit from the drug stores’ locations all over the country. Despite these steps, WBA’s profits have been flat over the past 5 years. Its latest moves will lead to a period of lower profits due to the upfront cost of remodeling its stores. WBA’s stock chart also reflects its challenges, as the company topped out in 2015 and has been making lower highs and lower lows. (source:finviz.com) WBA’s POWR Ratings are also negative on the stock as it has a Sell Rating. In terms of its POWR components, it has an “F” for Trade Grade, a “D” for Buy & Hold Grade, and Peer Grade with a “C” for Industry Rank. Among Drug Store stocks, it’s ranked #3 out of 3 stocks. CVS Health Corporation (CVS) Like WBA, CVS has been aware that the business model which worked so well over the last couple of decades will not work in the next couple of decades. It has heavily invested in its “Minute Clinics”, and it recently purchased Aetna. Both of these moves represent the company moving on from being a simple, drug store to a more diversified, healthcare company. However, the pharmacy business remains the company’s major profit center. Despite these major changes, investors are not very enthusiastic about CVS’s stock, as it’s down 40% over the last 5 years. The company has been very aggressive in pivoting from being a drug store into a healthcare company. In the long-term, it’s looking to turn its stores into “healthcare hubs” for patients with chronic diseases. According to the POWR Ratings, CVS is rated a Sell. It has a “C” for Trade Grade, Buy & Hold Grade, and Industry Rank and a “B” for Peer Grade. It’s ranked #1 out of 3 among Drug Store stocks. Rite Aid Corporation (RAD) RAD is the smallest of the three drug store stocks and doesn’t have the resources to pull off a major pivot to transform its business for the future. The company still faces the same secular headwinds as CVS and WBA. While CVA and WBA are flush with cash, RAD is bogged down by debt. Given its high debt load, nearly all its profits are going into servicing its debt. It’s also less profitable than its peers. Essentially, RAD is the weakest company in a sector that is becoming more competitive. Its best hope is to be acquired by another company, although its high debt load makes it unattractive. The POWR Ratings rate RAD a Sell. It has a “C” for Trade Grade, Buy & Hold Grade, and Industry Rank with a “D” for Peer Grade. Among Drug Store stocks, it’s ranked #2 out of 3. Want More Great Investing Ideas? 9 “BUY THE DIP” Growth Stocks for 2020 Top 5 WINNING Stock Chart Patterns 7 “Safe-Haven” Dividend Stocks for Turbulent Times WBA shares . Year-to-date, WBA has declined -31.52%, versus a -1.17% rise in the benchmark S&P 500 index during the same period."}]}