{"article": [{"url": "https://stocknews.com/news/crm-bmy-shop-roku-4-growth-stocks-to-buy-and-hold-for-the-next/", "published": 1598962100.0, "headline": "4 Growth Stocks to Buy and Hold for the Next Decade", "body": "Certain growth stocks can lead to large returns over a long period of time. The rise in the S&P 500 since March has been attributed to high-growth technology stocks and certain healthcare stocks. This is evident through the performance of the SPDR Portfolio S&P 500 Growth ETF (SPYG), which can be seen as a benchmark of the performance of growth stocks. The ETF has gained close to 65% since hitting its low in mid-March. The S&P 500 returned 52% returned over the same time period. As the coronavirus pandemic continues, stocks in the technology and healthcare industries should continue to move higher. Many workers are still working remotely and many children will spend at least part of the year learning from home. Consumers will likely shop more online even after the pandemic is over. The search for a vaccine and COVID treatments should continue to boost certain healthcare stocks. Salesforce.com, Inc. (CRM), Bristol-Myers Squibb Company (BMY), Shopify, Inc. (SHOP), and Roku, Inc. (ROKU) are growth stocks that could see significant gains for the foreseeable future. 7 Best ETFs for the NEXT Bull MarketSalesforce.com, Inc. (CRM) CRM focuses on providing enterprise cloud computing services with a specialty in customer relationship management across various sectors and industries. The company’s offerings consist of sales automation, marketing, customer service and support, analytics, community management, and a cloud platform that allows the development of cloud applications. Given 45.9% annual growth in EPS over the past 5 years, CRM may be a good bet for those looking for a company with high growth potential. The stock’s year-to-date performance is also noteworthy since it has returned 67.6%. The EPS growth of the company is estimated to be 19.5% per year over the next five years. The company’s revenue is expected to grow by 21.5% in the current year, and by 17.7% next year. The company’s growth is expected to be fueled by the increasing adoption of remote working and use of cloud-based services by enterprises. Further, CRM has entered into a partnership with PayPal (PYPL) which allows the company to use PYPL’s payment services on its cloud services. CRM has also launched its Salesforce Anywhere product with the purpose of allowing hassle-free remote working. CRM has also become the first Software-as-a-Service company to be included in the Dow Jones Industrial Average Index. How does CRM stack up for the POWR Ratings? A for Trade Grade A for Buy & Hold Grade A for Peer Grade B for Industry Rank A for Overall POWR Rating You can’t ask for better. The stock is also ranked #1 out of 47 stocks in the Software – Business industry. Bristol-Myers Squibb Company (BMY) BMY is a bio-pharmaceutical company that develops chemically synthesized drugs, and operates in various therapeutic areas, in addition to HIV, oncology, neuroscience, immunoscience, and cardiovascular conditions. The company has developed a range of innovative drugs that could position the company for several years of growth. These drugs include Eliquis, which is an anticoagulant, and Orencia, which is a treatment for rheumatoid arthritis. The company has also recently acquired Celgene in one of the largest mergers in the healthcare sector so far. This acquisition also adds a number of key drugs to BMY’s portfolio such as Revlimid (for multiple myeloma), Inrebic (for bone marrow disorder treatment), and Abraxane (a cancer treatment). BMY’s revenue is expected to grow by 60.3% this year and by 8.3% in the next year. The EPS growth of the company is estimated to be 18.4% per annum over the next five years. Over the past five years, the company’s EPS grew 21.6% per annum. Despite challenges from the spread of the coronavirus, the stock price of the company has recovered 34% since its mid-March lows. BMY is rated a Buy in our POWR Ratings system. It also has a grade of A for Trade Grade, Peer Grade, and Industry Rank. In the 231-stock Medical – Pharmaceutical industry, it is ranked #21. Shopify, Inc. (SHOP) SHOP develops and markets a software product that allows merchants and retailers to design, set-up, and manage their stores across multiple verticals such as e-commerce, mobile, social media, and physical locations. The company has witnessed stellar growth in its stock prices since its IPO five years ago. The stock price has seen growth of around 3,800% over the last five years. Year-to-date, SHOP’s stock price has gained 168%. It is estimated that SHOP’s EPS will grow 108.3% per annum over the next five years. The revenue of the company is expected to grow by 63.9% this year, and by 31.6% next year. Even though SHOP has already witnessed stellar growth, further growth over the next decade could be made possible by the company’s movement into fulfillment as the company builds a distribution network across the United States for storage and shipping of products. In the second quarter of 2020 alone, the number of merchants using Shopify grew by 71% and gross merchandise value grew 119% year-over-year. Such numbers are likely to continue due to more individuals starting businesses online. SHOP’s strong fundamentals are reflected in its POWR Ratings. The company has a Strong Buy rating with a grade of A in Trade Grade, Buy & Hold Grade, and Peer Grade. Within the Internet – Services industry, it’s ranked #1 out of 34 stocks. Roku, Inc. (ROKU) ROKU has a number of offerings in the entertainment sphere including streaming players, smart TVs, wireless speakers, and so on. The company’s digital media player allows users to stream video and music content from various online services. The firm is also a leader in the streaming device market. ROKU’s shares hit an all-time last Friday beating out a previous record that it held eleven months ago. ROKU has delivered a year-to-date price return of 29.6%, despite the market crash caused by the spread of the coronavirus. The company’s EPS is expected to grow by 25% next year while its revenue growth is estimated to be 34%. The growth of the stock is underpinned by the growth in active user base. In June, 43 million active users were on the platform, which was a year-over-year increase of 41%. The company is also finding new ways to monetize its user base. Its average revenue per user increased 18% year-over-year in the second quarter of 2020. ROKU is rated a Strong Buy in our POWR Ratings system. It also has a grade of A for Trade Grade, Buy & Hold Grade, and Industry Rank. In the 28-stock Technology – Hardware industry, it is ranked #5. Want More Great Investing Ideas? 7 Best ETFs for the NEXT Bull Market Beware Stocks in September? 9 “BUY THE DIP” Growth Stocks for 2020 CRM shares were trading at $279.54 per share on Tuesday afternoon, up $6.89 (+2.53%). Year-to-date, CRM has gained 71.88%, versus a 10.39% rise in the benchmark S&P 500 index during the same period."}]}