{"article": [{"url": "https://stocknews.com/news/regn-mrna-qdel-vxrt-4-coronavirus-vaccine-stocks-with-insider-selling/", "published": 1596197300.0, "headline": "4 Coronavirus Vaccine Stocks With Insider Selling", "body": "There’s an intense race to develop a coronavirus vaccine. The US government is also supporting these efforts with Operation Warp Speed. The winners will be remembered by history, be celebrated by the public, and improve humanity. Of course, there are material benefits in the form of windfall profits and a higher share price. Companies that are reporting good news about the vaccine are seeing huge gains in their stock price. For example, Vaxart (VXRT) is up 300% since it first announced progress on developing a vaccine in June. 7 Best ETFs for the NEXT Bull MarketSo, it’s interesting to note that some insiders at these companies are taking advantage of these gains by selling some shares. Regeneron Pharmaceuticals (REGN), Moderna, Inc. (MRNA), Quidel Corporation (QDEL), and Vaxart Inc. (VXRT) are four coronavirus vaccine stocks with insider selling. Regeneron Pharmaceuticals, Inc. (REGN) At the beginning of July, REGN announced the initiation of late-stage clinical trials of REGN-COV2 which is the company’s investigational double-antibody cocktail for the prevention and treatment of Covid-19. Earlier this month, Andrew Murphy, EVP Research of REGN, sold more than 11,900 shares of REGN for $7.5 million and Independent Director George Sing sold 10,500 shares at an average price of about $650. In the last three months, more than 1 million shares have been sold by insiders to take advantage of investors’ optimism. The stock has grown by about 85% since the start of February and could show bullish trends in the coming months. It is impressive to note that the company beat its consensus EPS estimates in each of the trailing four quarters. Moreover, REGN’s EPS is expected to grow by 8.9% per annum in the next five years. How does REGN stack up for the POWR Ratings? A for Trade Grade A for Buy & Hold Grade A for Peer Grade B for Industry Rank A for Overall POWR Rating You can’t ask for better. The stock is also ranked #1 out of 338 stocks in the Biotech industry. Moderna, Inc. (MRNA) Shares worth more than $200 million have been sold by insiders since MRNA announced that it would develop a Covid-19 vaccine candidate in collaboration with the National Institute of Health. In the last three months, about 16 million shares have been sold by the company’s insiders. The stock has been on its way up and has grown more than 310% since February end. Some of the key people at MRNA involved in the insider selling were CEO Stéphane Bancel, CFO Lorence Kim, and Chief Medical Officer Tal Zaks. Furthermore, Noubar Afeyan, who was the chairman of the company, sold shares worth $68 million from his venture capital fund Flagship Pioneering in May. MRNA’s earnings surprise history looks impressive with the company surpassing the consensus EPS estimates in three of the trailing four quarters. The market expects the company to report a loss per share of $0.35 for the quarter ended June, representing an improvement over the year-ago loss per share of $0.41. Moreover, MRNA’s consensus revenue estimate of $27.43 million indicates a year-over-year increase of 109.7%. MRNA’s POWR Ratings reflect this promising outlook. It has an overall rating of “Buy” with an “A” for Trade Grade and Peer Grade and a “B” for Industry Rank. Among the 338 stocks in the Biotech group, it’s ranked #16. Quidel Corporation (QDEL) QDEL received emergency use authorization for a number of its products such as Sofia SARS Antigen, Sofia 2 SARS Antigen FIA, and Lyra Direct SARS-CoV-2 Assay which could be used for direct sample processing as well as detection of Covid-19. These authorizations and the consequent surge in its stock price could be the reason for an increase in insider selling in the second quarter. In the last three months, more than 160,000 shares have been sold by insiders. QDEL demonstrated a strong quarterly performance in the second quarter which is reflected in a 86% year-over-year increase in revenue and an EPS of $1.86 as compared to $0.36 a year ago. Werner Kroll, the Senior Vice President, had the highest volume of insider sales this year with about 68,000 shares sold having a total transaction worth more than $11 million. Since its March lows, QDEL has increased by more than 250%. QDEL’s earnings surprise history looks impressive with the company surpassing the consensus EPS estimates in each of the trailing four quarters. The market expects the company to report an EPS of $2.39 for the current quarter, representing a significant improvement of 241.4% over the year-ago EPS. It’s no surprise that QDEL is rated “Strong Buy” in our POWR Ratings system. It also has an “A” for Trade Grade, Buy & Hold Grade and Peer Grade, and a “B” for Industry Rank. In the 58-stock Medical-Diagnostics/Research industry, it is ranked #7. Vaxart Inc. (VXRT) In the last three months, more than 33 million VXRT shares have been sold by insiders. The stock price of VXRT was low until February after which it gradually increased. This sudden increase could be attributed to VXRT’s potential oral Covid-19 candidate. The increase in price most likely had made insiders book hefty profits. There were significant insider sales in May and June. Since VXRT initiated a program to develop a Covid-19 vaccine in January, it selected its lead vaccine candidate for cGMP manufacturing and clinical testing. Besides, the company contracted with Emergent BioSolutions (EBS) and Kindred Biosciences (KIN) to step up manufacturing capacity to meet global demand. The company has been selected by Operation Warp Speed to evaluate the efficacy of VXRT’s oral Covid-19 vaccine. Moreover, VXRT has signed a Memorandum of Understanding with Attwill Medical Solutions Steriflow which will further bolster its large-scale manufacturing capacity of the oral Covid-19 candidate. The market expects the company to report a loss per share of $0.06 for the quarter ended June 2020, which represents an improvement from its year-ago loss per share of $0.39. Furthermore, VXRT’s consensus revenue estimate of $1.9 million for the quarter indicates a year-over-year increase of 2135.3%. VXRT’s POWR Ratings are consistent with this bleak outlook. It has an overall rating of “Sell” and a “D” for Trade Grade and Buy & Hold Grade with a “C” for Peer Grade and a “B” for Industry Rank. Within the Biotech group, it’s ranked #151 out of 338. Want More Great Investing Ideas? 9 “BUY THE DIP” Growth Stocks for 2020 How HIGH Can This Tech Bubble Fly? 7 “Safe-Haven” Dividend Stocks for Turbulent Times REGN shares were unchanged in after-hours trading Friday. Year-to-date, REGN has gained 68.34%, versus a 2.49% rise in the benchmark S&P 500 index during the same period."}]}