{"article": [{"url": "https://stocknews.com/news/infy-ctsh-can-3-buy-rated-tech-stocks-for-september/", "published": 1599826100.0, "headline": "3 \"Buy Rated\" Tech Stocks for September", "body": "The pandemic has significantly changed the way most businesses operate. This is particularly evident in the service industry, with increasing adoption of remote working and learning. For effective management and smooth workflow, many companies are planning to develop, or have already developed IT infrastructure to establish a cloud computing system. Tech outsourcing companies specialize in this domain, and thereby have announced partnership agreements with multiple companies in the first half of 2020. The 2020 Global Managed Services Report stated that 45% of the organizations will outsource in the next 18 months, based on a recent survey. Demand for expertise in cloud infrastructure is expected to rise by 77% during this time, with 48% of the business leaders acknowledging the need to build an optimized work environment. As most people are likely to continue working from home for the remainder of 2020, establishing a proper cloud-based infrastructure is key in the smooth functioning of businesses. Outsourcing companies such as Infosys, Ltd. (INFY), Cognizant Technology Solutions Corporation (CTSH) and Canaan, Inc. (CAN) have seen a surge in demand for their services over the past couple of months, as the global demand for outsourcing is on the rise. With most companies around the world adjusting to a permanent work from home regime, these companies are likely to witness continued increase in business volume and revenues. 7 \"SAFE HAVEN\" Dividend Stocks for Turbulent TimesInfosys, Ltd. (INFY) Headquartered in India, INFY is a global technology, outsourcing, and next generation digital services company. It develops products and platforms catering to the following segments: Financial Services and Insurance (FSI), Communication and Services (ECS), Manufacturing & High Tech (MFG & Hi- TECH), Life Sciences & Healthcare (LSH), Consumer Packaged goods & Logistics (RCL), Retail, and Energy & Utilities. As the services industry is gradually shifting online, INFY has been involved in recreating a digital infrastructure for many global companies. On July 20th, INFY entered into a strategic long-term partnership with Lanxess (OTCMKTS:LNXSF) to develop its IT Infrastructure Digitization Strategy, allowing its workforce to safely operate remotely from across the world. On July 27th, INFY entered into an agreement with Consolidated Edison Company (ED) to digitally transform its customer service experience over the next four years. On August 26th, it entered into a strategic agreement with Genesys to enhance and expand their respective customer service and contract center offerings. INFY has planned to acquire Kaleidoscope Innovation to strengthen its presence in the Medical and Consumer industry across the world. For the fiscal first quarter that ended in June 2020, INFY reported a 10.1% year-over-year increase in operating profit to $708 million. Net profit before minority interest increased 3.2% from the year-ago value to $564 million. Digital revenues grew 25.5% (in constant currency) from the same period last year to $1.38 billion. Operating margin rose 220 basis points year -over-year to 22.7%. Throughout the first quarter, INFY partnered with the state of Rhode Island, Global Foundries, FE credit, and a large cybersecurity company, which bolstered its quarterly performance. It launched an AI driven solution on August 26th to automate help desk operations for its clients. INFY’s EPS is expected to grow at 8% per annum over the next five years. has gained more than 90% since hitting its 52-week low of $6.76 in March. The stock hit its 52-week high of $13.03 in August. How does INFY stack up for the POWR Ratings? A for Trade Grade A for Buy & Hold Grade B for Peer Grade B for Industry Rank A for Overall POWR Rating. It is also ranked #2 out of 14 stocks in the Outsourcing – Tech Services industry. Cognizant Technology Solutions Corporation (CTSH) CTSH is a professional services company that specializes in consulting and technology. It operates through four segments: Financial Services, Healthcare, Manufacturing/Retail/ Logistics and Other. CTSH collaborated with Verily Life Sciences to facilitate coronavirus testing across the United States. Everest Group named it the Healthcare Payer Operations Leader on August 13th. On September 1st, CTSH announced its plans to acquire a cloud specialist company Magnitude, which is solely focused on Microsoft (MSFT) Azure cloud computing platform. This will allow CTSH to expand its Microsoft based business group in the United States, as well as increase its expertise in the domain. CTSH has also planned to acquire Tin Roof software to boost its digital product development expertise as well as expand its reach in the software engineering domain. CTSH bore the brunt of the pandemic during the second quarter that ended in June 2020, as evident by the decline in its financial metrics. However, its healthcare segment grew 2% year-over-year, and accounted for 28.9% of its net revenue. The company reported a net income of $361 million for the quarter. Though the consensus EPS estimate of $0.89 for the third quarter indicates a year-over-year decline, CTSH beat the street EPS estimates in each of the trailing four quarters, which bodes well for the stock. CTSH has gained more than 60% since hitting its 52-week low of $40.01 in March. It’s no surprise that in our POWR Ratings system, CTSH is rated a “Buy”, with a grade of “A” in Trade Grade, and a “B” in Buy & Hold Grade, Peer Grade, and Industry Rank. The stock is also ranked #4 out of 14 stocks in the Outsourcing – Tech Services industry. Canaan, Inc. (CAN) CAN’s proprietary Application Specific Integrated Circuit (ASIC) provides high-performance supercomputing solutions for bitcoin mining and other related services in China. Its holistic Artificial Intelligence backed solutions have facilitated algorithm development and optimization for multiple software solutions. CAN delivered impressive results for the second quarter that ended June 2020, with a 302.5% year-over-year increase in gross profit to $6.10 million. Gross margin rose 198 basis points from the year-ago value to 24.3%. On September 8th, CAN announced a $10 million share repurchase program, which has positive implications for the stock. CAN has gained more than 10% since hitting its 52-week low of $1.76 in June. Want More Great Investing Ideas? 7 Best ETFs for the NEXT Bull Market Will Stocks Fall into Historical September Slump? 9 “BUY THE DIP” Growth Stocks for 2020 INFY shares were trading at $12.69 per share on Friday afternoon, up $0.09 (+0.71%). Year-to-date, INFY has gained 24.36%, versus a 4.45% rise in the benchmark S&P 500 index during the same period."}]}