{"article": [{"url": "https://stocknews.com/news/vrsn-payc-sam-wkhs-4-stocks-upgraded-to-strong-buy/", "published": 1593691700.0, "headline": "4 Stocks Upgraded to Strong Buy", "body": "The exclusive POWR Ratings update recently identified dozens of stocks that have leaped from a Buy rating to Strong Buy. We are clearly in a bull market even amidst a once-in-a-century pandemic. It’s counterintuitive, but history shows that stocks have the biggest rallies during periods when the economy is bad but improving. Here are four of the more intriguing stocks recently upgraded to a Strong Buy rating. 9 \"BUY THE DIP\" Growth Stocks For 2020VeriSign (VRSN) Safeguarding the growing number of data and voice networks is only becoming more important as hackers get more sophisticated. It’s a cat and mouse game between security companies and criminals who are looking to make an easy buck. Therefore, the importance of companies like VRSN will only increase. VRSN provides intelligent infrastructure services that allow for secure interactions to occur on these networks. Its customers include banks, governments, and telecom companies. VRSN earned $1.232 billion in revenue in 2019 with nearly two-thirds of it coming from the United States. The company sees its next growth opportunity coming from overseas expansion. It also has gross margins of 85% which means that the bulk of future revenue growth will flow to the bottom-line. VRSN’s average analyst price target is $229.67, indicating a 10% upside. The POWR Ratings now have VRSN rated as a Strong Buy with an “A” for Trade Grade and Buy & Hold Grade. It has a “B” in Peer Grade and Industry Rank. Within the Internet – Services group, it’s ranked #2 out of 34. Paycom Software (PAYC) As many businesses move away from conventional offices, there is a massive opportunity for cloud-based HR software. In the same way, that spreadsheet software reduced the number of accountants and led to increased cost-savings and efficiencies, cloud-based HR software will lead to cost-savings and reduce a company’s headcount in the HR department. PAYC is one of the leading companies in this young but burgeoning industry. Its cloud services facilitate every aspect of the employment cycle from the point of initial recruitment to retirement. As of July 2020, PAYC has nearly 24,000 clients. The company has high margins and a high rate of recurring revenue as it becomes integral to the company’s day-to-day functioning. Due to these reasons, the stock has an impressive 2,000% gain from its IPO in late-2014. Therefore, it’s not surprising that PAYC was upgraded to a Strong Buy rating by POWR Ratings. It has an “A” in Trade Grade, Buy & Hold Grade, and Industry Rank with a “B” in Peer Grade. Boston Beer Company (SAM) When times get tough, people understandably turn to alcohol to take off the edge. SAM, a leading seller of alcoholic beverages, stands to benefit from the current environment. Alcohol sales have increased during the pandemic. SAM products are sold in the United States, Europe, Canada, South America, and Asia. It remains one of the fastest-growing beer brands. Craft beer continues to grow in popularity, while lower-end brands are seeing falling sales. However, beer is less popular among the younger generation. SAM has adjusted to this trend quite deftly, pivoting to add hard seltzers and comparably sweet beverages to its offerings. Aside from Sam Adams beer, SAM also sells Truly Hard Seltzer and Twisted Tea. Both of these are major growth categories for the alcohol industry. SAM should move toward its 52-week high of $587.85. The POWR Ratings reveal SAM is an exceptional stock with a Strong Buy Rating and an “A” in every category including Trade Grade, Buy & Hold Grade, Industry Rank, and Peer Grade. It’s ranked #2 out of 28 stocks in the Beverage category. Workhorse Group (WKHS) Those Amazon (AMZN), UPS (UPS), FedEx (FDX), and USPS trucks might someday be replaced by electric WKHS trucks. Though WKHS trucks can’t go faster than at 75 miles per hour and are not exactly aesthetically pleasing, they have serious potential. Electric delivery trucks have the potential for massive cost-savings in terms of fuel and tax credits. WKHS is also developing drones to use in tandem with its electric trucks. A couple of weeks ago, WKHS was trading around $5 per share. Today, it’s is trading just above $20. It is particularly interesting that an unidentified institutional investor recently agreed to buy $70 million of the company’s senior secured convertible notes. Now that WKHS C Series vans have been given the green light from the federal government, WKHS is a candidate for a USPS contract. It’s also benefitting from the current mania around EV stocks. WKHS was upgraded to Strong Buy. It also has an “A” for Trade Grade, Buy & Hold Grade, Peer Rank, and Industry Grade. It’s ranked #3 out of 26 companies in the Auto & Vehicle Manufacturers segment. Want More Great Investing Ideas? 9 “BUY THE DIP” Growth Stocks for 2020 Is the Bull S#*t Rally FINALLY Over? 7 “Safe-Haven” Dividend Stocks for Turbulent Times Top 3 Investing Strategies for 2020 VRSN shares . Year-to-date, VRSN has gained 9.41%, versus a -1.99% rise in the benchmark S&P 500 index during the same period."}]}