{"article": [{"url": "https://stocknews.com/news/bip-sjw-aep-3-utility-stocks-with-high-eps-growth/", "published": 1596197300.0, "headline": "3 Utility Stocks with HIGH EPS Growth", "body": "The utilities sector is comprised of companies that provide electricity, water, natural gas, sewage, and other services to homes and businesses. These companies are typically regulated by the state and federal government. These services are essential for everyday life, so utility stocks have historically provided stable earnings. Reliable earnings allow a company to pay above-average dividends. Utility stocks are defensive in nature since people need water, gas, and electricity. The sector should do well in the recession brought on by the novel coronavirus. One thing that investors typically don’t associate with utility stocks is very high earnings per share (EPS). But investing in growth stocks can help your portfolio. Growing businesses tend to rise in price. Investors can take advantage of both the share growth and income from dividends. Brookfield Infrastructure Partners (BIP), American Electric Power Company, Inc. (AEP), and SJW Group (SJW) are three utility companies with high earnings per share growth. 9 \"BUY THE DIP\" Growth Stocks For 2020Brookfield Infrastructure Partners Ltd. (BIP) BIP provides infrastructure services to companies operating in utility, transportation, energy, and data-center operations. With business in America, Asia, and Europe, BIP owns and operates 2000 km of gas pipes, 2200 km of electricity transmission lines, 6.7 million natural gas and electricity connections, etc. Though the infrastructure industry took a hit due to the healthcare crisis, BIP fared relatively well due to its diversified portfolio. While the energy segment incurred losses due to the historically low oil prices, increases in the demand for transportation and data-center helped offset this loss to an extent. BIP is one of the most promising stocks for the second half of 2020, owing to its EPS growth estimates. The consensus EPS estimate for the second quarter of $0.20 indicates year-over-year growth of 66.7%. As most countries are gradually resuming industrial operations, the consensus EPS estimate for the third quarter ending September 2020 indicates a 271.4% increase year over year. Moreover, the market expects BIP’s ESP to grow 93.8% over the next year. It is also expected that BIP’s EPS will grow 55.6% annually over the next five years. BIP recovered more than 80% since hitting its 52-week low of $23.01 on March 18th, due to the virus led market crash. How does BIP stack up for POWR Ratings? A for Trade Grade B for Buy & Hold Grade B for Peer Grade B for Overall POWR Rating. You can’t ask for better. It is ranked #2 out of 18 stocks in the MLPs- Other industry. American Electric Power Company, Inc. (AEP) AEP is a public utility holding company operating in generation, transmission and distribution of electricity through vertical integrated utility, transmission, and distribution utility, AEP transmission Holdco, generation, and marketing segment. It distributes electricity to both wholesale and retail customers across the United States. As one of the biggest electricity utility companies, AEP’s earnings are expected to grow substantially throughout the recovery period. The consensus EPS estimate for the quarter end June indicates a 6% year-over-year growth. Also, AEP surpassed the consensus estimates in three of the trailing four quarters, which is impressive. As the gradual economic recovery is expected to continue well into 2021, consensus EPS growth estimates for the upcoming year indicate an 8.2% rise year over year. The consensus EPS estimates indicate 5.8% growth annually for the next five years. AEP gained more than 30% in value since hitting its lows in March. AEP is rated as a “Buy” in our POWR Ratings system, with a “B” in Trade Grade, Peer Grade, and Industry Rank. Out of 61 stocks in the Utilities – Domestic industry, AEP is ranked #7. SJW Group (SJW) SJW provides purification, storage, wholesale and retail distribution of water and wastewater services. It also provides maintenance services, antenna site leases, and non-tariffed services. SJW is the second-largest investor-owned water and wastewater utility company in the United States, serving more than 1.5 million people. SJW is one of the best utility stocks to consider if you are looking to invest in companies with high EPS growth potential. Consensus EPS estimate for the second quarter of $0.68 indicates a 51.1% year-over-year rise. The estimate for the next quarter indicates a 163.6% rise year over year. Moreover, SJW’s EPS is expected to grow 14% annually over the next five years. Want More Great Investing Ideas? 9 “BUY THE DIP” Growth Stocks for 2020 How HIGH Can This Tech Bubble Fly? 7 “Safe-Haven” Dividend Stocks for Turbulent Times SJW hit its 52-week low of $45.60 on March 23rd due to the global market crash but has gained about 40% since then. SJW is rated “Buy” in our POWR Ratings system, consistent with its growth estimates. It is rated “A” in Trade Grade, and “B” in Buy & Hold Grade and Industry Rank. SJW is ranked #4 in the 13-stock Water industry. BIP shares were unchanged in after-hours trading Friday. Year-to-date, BIP has declined -4.08%, versus a 2.49% rise in the benchmark S&P 500 index during the same period."}]}