{"article": [{"url": "https://stocknews.com/news/nvda-should-you-buy-the-dip-in-nvda/", "published": 1599566900.0, "headline": "Should you Buy the Dip in NVDA?", "body": "NVIDIA Corporation (NVDA) deals in graphics processing units (GPU), PC gaming, Tegra processor, and artificial intelligence (AI). NVDA is well-positioned to grow, as gaming, AI, cloud computing and autonomous machines drive the next industrial revolution around the world. As one of the key suppliers of the steadily expanding global gaming industry, it makes graphic processing units. NVDA is one of the best stocks in 2020 with record revenue and income growth. In the second quarter ended July 2020, the top-line was up 50% year-over-year to $3.87 billion and its record Data Center business revenue of $1.75 billion was up 167% from the comparable quarter last year. EPS grew 10% year-over-year to $0.99. 7 Best ETFs for the NEXT Bull MarketNVDA announced a collaboration with Mercedes-Benz to develop a revolutionary in-vehicle computing system for autonomous cars. NVDA is also planning to collaborate with the University of Florida to build the world’s fastest AI supercomputer in academia. With the robust growth in its operating results, the stock gained 114.6% year-to-date. This impressive performance and the potential upside based on several factors have helped it earn a “Buy” rating in our proprietary rating system. The rating suggests it’s worth buying the stock on dips. Here is how our proprietary POWR Ratings system evaluates NVDA: Trade Grade: A NVDA is currently trading way above its 50-day and 200-day moving averages of $446.49 and $317.33, respectively, indicating that the stock is in an uptrend. The stock’s 41.5% return over the past three months reflects a solid short-term bullishness. NVDA is benefiting from booming demand for high-end gaming graphics cards as households across the globe have directed a significant portion of their entertainment spending into online gaming due to the stay-home normal. With the cult of cloud computing in the rising remote working culture, the company’s high-performance computing & cloud segment is also thriving. Buy & Hold Grade: B The primary contributor to the stock market’s solid momentum amid the pandemic-driven economic challenges has been the skyrocketing tech stocks. But some investors continue to sell off and book profits in fear of a tech bubble. However, the company has recently unveiled a new line of graphics cards that delivers up to 2x performance over Turing for real-time ray tracing and AI gaming. In terms of proximity to its 52-week high, which is a key factor that our Buy & Hold Grade takes into account, NVDA is fairly positioned. The stock is currently trading 14% below its 52-week high of $589.07. Looking at the past year, the stock has grown more than 182% due to the strong GPU demand, rising data center revenue, and strategic acquisitions. As part of the second-quarter results, NVDA mentioned, “Adoption of NVIDIA computing is accelerating, driving record revenue and exceptional growth. Growth in GeForce gaming accelerated as gamers increasingly immerse themselves in realistic virtual worlds created by NVIDIA RTX ray tracing and AI.” NVDA was able to sustain the pandemic-driven accelerated business growth and hence, it is well-positioned for long-term bullishness. Peer Grade: A NVDA is currently rated #7 out of 86 stocks in the Semiconductor & Wireless Chip industry. Other popular stocks in the group are Taiwan Semiconductor Manufacturing Company Ltd. (TSM), Broadcom Inc. (AVGO), and QUALCOMM Incorporated (QCOM). NVDA comfortably beat the year-to-date gains of these three industry participants. TSM, AVGO, and QCOM returned 35.8%, 14.8%, and 31.4%, respectively, over this period. Industry Rank: A The StockNews.com Semiconductor & Wireless Chip industry is currently ranked #12 out of the 123 industries. Like many other industries, the semiconductor industry also struggled to cope with the sudden market changes caused by the pandemic. But the demand is steadily rising, as evident from the 4.9% year-over-year increase in the global semiconductor sales in July. Some of the major semiconductor companies have been able to capitalize on the pandemic due to the increased dependence of individuals and companies on technology that require semiconductors to run. Overall POWR Rating: B (Buy) Overall, NVDA is rated a “Buy” due to its impressive quarterly performances, strength in its fundamentals, and solid price momentum, as determined by the four components of our overall POWR Rating. Bottom Line The stock has soared so far this year, despite instances of sell-offs and profit bookings. The next-generation GPUs together represent a foundation upon which all of tomorrow’s most important technologies — such as self-driving cars, AI, automation, and cloud computing — will be built. NVDA is one of the best-in-breed “picks and shovels” suppliers and has the potential to grow even further based on its continued business growth, favorable earnings, and price momentum. Analyst sentiment, which gives a good sense of a stock’s future price movement, is pretty impressive for NVDA. Of the 39 analysts that rated the stock, 27 have given it a “Strong Buy.” The street expects revenues for the third quarter ending September 2020 to grow 46.3% year-over-year. The consensus EPS estimate for the ongoing quarter indicates a 44.4% rise from the year-ago value. This outlook should keep NVDA’s price momentum alive in the near term. Want More Great Investing Ideas? 7 Best ETFs for the NEXT Bull Market Will Stocks Fall into Historical September Slump? 9 “BUY THE DIP” Growth Stocks for 2020 NVDA shares fell $2.52 (-0.53%) in after-hours trading Tuesday. Year-to-date, NVDA has gained 102.79%, versus a 4.59% rise in the benchmark S&P 500 index during the same period."}]}