{"article": [{"url": "https://stocknews.com/news/spy-iwm-inx-dia-qqq-heres-why-you-should-keep-buying-stocks-on-market-dips/", "published": 1600258100.0, "headline": "Here’s Why You Should Keep Buying Stocks on Market Dips", "body": "After a furious rally off the March lows, the stock market has backed off in recent weeks. Since early September, the S&P 500 is down 5% with the Nasdaq down 8%. This is a good time to step back and try to figure out where we are in the market cycle. Was this just an overzealous, bear market rally driven to extreme heights by the Fed and federal government’s largesse – that is now rolling over? 9 \"BUY THE DIP\" Growth Stocks For 2020It’s certainly true that the coronavirus and ensuing shutdowns have done significant damage to the economy. And, it may lead to long-term deterioration in earnings which will eventually be reflected in lower stock prices. For investors and traders in this bear camp, it’s a great opportunity to reduce exposure and even initiate short positions. However, I believe that there’s an increasing amount of evidence indicating that we are in the early stages of a new bull market. The rise in stock prices is anticipating an improvement in economic conditions that will lead to more earnings growth. A New Bull Market Bull markets tend to climb a “wall of worry”. They start with skepticism and unease and end with optimism about the future. Perversely, the coronavirus and the doubts about the economy reopening are fuel for the market’s gains over the coming months. Additionally, many fund managers are in the uncomfortable position of being underexposed and underperforming the market averages. They are facing a situation, where they have to weigh “portfolio risk” against “career risk.” This dynamic can lead to prices grinding higher in a relentless fashion as managers are either forced to buy to catch-up with the averages or end the year underperforming which can lead to outflows. (source: Goldman Sachs) The chart above shows that managers have been piling into safe assets. Extremes in the ratio between risky and safe assets have correlated to risk-on environments like 2009 and 2016. These factors should support equity prices in the intermediate-term and reward buying the dip. Variant Perception Rather than the coronavirus crash marking the beginning of a bear market and recession, it’s more likely that it marked the end of a risk-off environment which began from late-2018. From late-2018, global growth has slowed, manufacturing output has declined, and cyclical sectors have underperformed. We can see in the chart below that the Nasdaq 100 ETF (QQQ) is breaking out on a relative basis against risk-off assets like gold and Treasuries. (source: All Star Charts) Previous breakouts have correlated with multiyear, sustained advances in stocks. If the market is ready for a risk-on phase, expect the iShares Russell 2000 ETF (IWM) to outperform the SPDR S&P 500 ETF (SPY) or the Dow Jones Industrial Average ETF (DIA). Improving Economic Data Another constructive development has been the improvement in economic data from the lows in March. Due to the combination of fiscal stimulus and the Fed’s aggressive intervention, much of the coronavirus’s impact has been blunted. We can see this in retail and sales which is now 1.9% above pre-coronavirus levels in February and are at new, all-time highs. This is contrary to fears that the expiration of the enhanced unemployment insurance would result in the economy’s momentum dissipating. While certain segments of the economy remain depressed, it’s been offset by strength in other areas. To compare, during the previous recession, consumer spending didn’t hit new highs until 2011 which was two years after the bear market bottomed in March of 2009. This is another piece of evidence that is supportive of the V-shaped rebound in stock prices. Fed Policy While the economy is doing better than expected. The Fed has its foot on the accelerator with zero percent interest rates and several programs that were created to maintain abundant levels of liquidity in financial markets. In terms of forward guidance, the Fed has resolved that it won’t be raising interest rates until 2022. It’s also raised the criteria by which it would consider raising rates as well by targeting a “symmetrical” inflation target which means months of above-average inflation would be necessary before the Fed gets more hawkish. This is a departure from its previous policy in which the Fed would proactively hike in anticipation of inflationary pressures building. The Fed has also been clear that it’s ready to act if economic conditions do start deteriorating, or if there is a second wave of the virus. This is the “Fed put” in action, and it’s a powerful tool. The Fed can influence the market through its rhetoric. We saw an example of this in March. In March, the corporate bond market froze, and spreads were elevated due to the coronavirus. A freeze in corporate credit had the potential to start a negative spiral, and the Fed was determined to short circuit it. The Fed announced its intention to start buying certain types of corporate debt. As the chart shows. it resulted in a massive rally in corporate bonds. It’s interesting to note that the Fed didn’t buy corporate bonds until late-June and by that time, the iShares iBoxx $ Investment Grade Corporate Bond ETF (LQD) was higher than its pre-coronavirus levels. The Fed accomplished its goal by stating what it was going to do – before actually doing anything. This is an example of the Fed’s power, and it will have the same impact on equity markets with its changes in forward guidance and policy adjustments. Another departure between the last recession and the current one is that there is no dissension in terms of the Fed’s policy. Additionally, there’s less resistance to the Fed supporting the economy due to the coronavirus forcing the economy to be shut down for health reasons. Last time, there was considerable disagreement within the Fed and from outside that its policy would lead to disastrous outcomes. Over the last decade despite the Fed’s aggressive measures, worst-case scenarios in terms of market bubbles or hyperinflation simply haven’t materialized. Conclusion During the past decade, we’ve seen plenty of “buy the dip” markets. Weakness in stocks was short-lived and would immediately result in new highs. Overbought readings would be worked off through sideways consolidations in which new leadership would emerge. This is the type of environment, where stocks rally on bad economic news since it means that the Fed will be more dovish. And, it rallies on good economic news, since it means that earnings will rise. The biggest risk would be better-than-expected economic growth and inflation which would lead the Fed to be more hawkish, however, the Fed has taken these risks off the table in the short-term. The common factor in these environments was a dovish Fed in combination with improving economic data. Currently, both of those factors are in play. The data is improving from the coronavirus-induced lows in March on an aggregate basis and across a variety of sectors – manufacturing, housing, and consumer spending. Even parts of the economy that remain impaired due to the coronavirus like travel, restaurants, and hotels are improving on a month-to-month basis. Want More Great Investing Ideas? 7 Best ETFs for the NEXT Bull Market Is the Stock Market Correction Over? Chart of the Day- See the Stocks Ready to Breakout SPY shares were trading at $342.39 per share on Wednesday afternoon, up $2.22 (+0.65%). Year-to-date, SPY has gained 7.47%, versus a % rise in the benchmark S&P 500 index during the same period."}]}