{"article": [{"url": "https://stocknews.com/news/aapl-bst-msft-amzn-ma-buy-apple-get-a-5-5-dividend-heres-how/", "published": 1597406900.0, "headline": "Buy Apple, Get a 5.5%+ Dividend, Here’s How", "body": "Maybe you’ve had to face one dividend cut in the crisis—maybe more than one. Maybe you’re like many folks, scanning the headlines daily to try to get a jump on the next cut before it slices your income steam. I get it. It’s part of the anxiety we’re all feeling. And there is good reason to be wary: this pandemic has forced the biggest dividend “sacred cows” to slash payouts—names like Wells Fargo (WFC), Ford (F), Ventas (VTR) and Disney (DIS). If you’d said any of these companies would cut their dividends back in January, you’d have been laughed out of the room! It just shows why we need to diversify and be very critical of the dividend-payers we buy—and the cash flows that back their payouts. 7 \"SAFE HAVEN\" Dividend Stocks for Turbulent TimesThe obvious question now is, what lies ahead for the dividends that many of us rely on to fund our lifestyles? Today we’re going to dive into that, and I’ll show you a group of unloved high-yield funds to buy for steady payouts of 5.5%, 7% and even higher that hold up no matter what happens. Earnings: the Lifeblood of Dividends The rash of dividend cuts we’ve seen comes as no surprise when you look at the economy—and profits—that backstop our payouts. In the second quarter, US GDP fell 32.9% on an annualized basis, a figure that brings to mind the Great Depression (though it’s not quite as bad as the numbers seen back then). The S&P 500, in turn, saw revenue fall 9.8%, the second-worst quarter on record (beating out the 11.5% drop in the third quarter of 2009). That’s translated, as you’d expect, into a large number of companies reporting losses: With earnings plunging in energy, industrials, consumer discretionary and financials, we saw a lot of reliable dividend stocks suddenly fail to produce enough profit to fund their payouts. In all, we’ve seen a 33.8% decline in profits so far for the quarter, after over 400 companies have reported earnings, mirroring the GDP decline. So where does this leave us? The good news is that the third and fourth quarters will undoubtedly be better, but for dividend-payers, the challenges will remain, so we have to be extra cautious about the names we pick—and ruthless about selling wobbly payers. (My colleague Brett Owens recently published a handy checklist you can use to gauge the safety of the dividend payers you own.) Safe Dividends: Look Beyond the Big Names One way to keep passive income rolling in if you’re worried about the stability of the payouts on blue-chip stocks is to, well, find another source of dividends! Fortunately, there are a lot of other dividend-rich corners of the market, and almost all are overlooked. They include real estate investment trusts (REITs), preferred stocks, municipal bonds and my own personal favorite, closed-end funds (CEFs). CEFs are the perfect tool now because they let us squeeze high payouts from high-growth stocks that pay little or no dividends. I know that sounds a little off the wall, but I assure you it’s true. Better still, we get the same price upside we’d have gotten by purchasing these stocks individually. To see what I mean, consider the BlackRock Science and Technology Trust (BST), which I recommended to my CEF Insider members on August 23, 2019. The fund holds strong tech leaders like Microsoft (MSFT), Apple (AAPL), Amazon (AMZN) and Mastercard (MA). I think you’ll agree that these companies aren’t known for rich payouts. The highest yielder among them, Microsoft, yields just 1%! But by purchasing these names through BST, which was yielding 5.5% when we bought it, we grabbed a payout 5.5 times bigger than Microsoft’s current dividend. How is this possible? It’s embedded in the fund’s portfolio-management strategy: BST holds a variety of tech stocks such as these, then buys and sells them as they go up and down, passing the profits to investors as dividends. In other words, BST transforms tech profits into steady income. We sold BST a couple months ago, on June 26. But not before it handed us a market-crushing total return (which, due to its high payout, was mostly in cash): BST Obliterates the Market Bear in mind, too, that BST’s yield (which stands at 5.8% today) is on the lower end of the CEF spectrum; the typical CEF yields 7.2%, and many pay more than 10%, providing us with a lot of opportunities to bolster our income streams as this crisis plays out. Want More Great Investing Ideas? Free Report: 5 Bargain Funds with Safe 11% Dividends A “1-Click” Way to Grab Safe 8% Dividends The $43,000 “dividend secret” Wall Street hides from you AAPL shares fell $0.13 (-0.03%) in after-hours trading Friday. Year-to-date, AAPL has gained 57.60%, versus a 5.73% rise in the benchmark S&P 500 index during the same period."}]}