{"article": [{"url": "https://stocknews.com/news/amzn-pg-unp-tgt-4-stocks-that-will-make-new-highs-in-october/", "published": 1602245300.0, "headline": "4 Stocks that Will Make New HIGHS in October", "body": "The upcoming earnings season is crucial for many stocks, as they will have to show that investors were correct in bidding their shares higher. Several companies are flirting with new highs and have posted significant gains since the mid-March market crash. Companies that can deliver strong earnings are likely to see further gains given the drop in interest rates. In any case, stocks of companies that provide essential services with a strong underlying business should be the best choice amid the current uncertainty. Amazon.com, Inc (AMZN), The Procter & Gamble Company (PG), Union Pacific Corporation (UNP), and Target Corporation (TGT), have performed well so far this year despite the challenges posed by the pandemic. These companies are expected to report strong numbers in their upcoming earnings results, which could help their stocks hit new highs. 9 \"BUY THE DIP\" Growth Stocks For 2020Amazon.com, Inc (AMZN) AMZN has significantly benefited from the spread of the coronavirus and it is expected to continue to do so. The company’s e-commerce services have become essential for consumers in the United States and worldwide. Further, companies around the world are now using Amazon Web Services to power their business operations. AMZN’s stock has gained 72.6% so far this year. AMZN is slated to release a slate of new products such as Eero Wi-Fi routers and the latest instalment of Echo smart speakers. The company’s Prime Day is taking place on October 13th and 14th, which usually translates to high sales for the company. For the third quarter, the company expects year-over-year growth in net sales between 24% to 33%. The company’s revenue is expected to grow 32.1% in the third quarter, 31.5% in 2020, and 18.3% in 2021. AMZN’s EPS is estimated to rise 71.4% in this quarter, 37.8% this year, and at a rate of 36% per annum over the next five years. How does AMZN stack up for the POWR Ratings? A for Trade Grade B for Buy & Hold Grade B for Peer Grade B for Industry Grade B for Overall POWR Rating The stock is also ranked #9 out of 57 stocks in the Internet industry. The Procter & Gamble Company (PG) PG owns several brands in the consumer-packaged goods industry. The company primarily operates in the beauty, self-care, health care, home care, and fabric care sectors. PG’s stock has gained 13.4% so far this year. PG has recently released a slew of new products to bolster its product portfolio. The company’s Oral-B iO which has a linear magnetic drive has recently received approval from the ADA. The company has also started marketing Pampers Preemie Swaddlers which is a diaper meant to help the development of premature babies. The company’s revenue is expected to grow by 2.8% in the quarter ended in September 2020 and 3.5% in the next quarter. PG’s EPS is estimated to rise by 2.9% for the recently completed quarter, 5.5% this year, and at a rate of 7.2% per annum over the next five years. It’s no surprise that PG is rated a “Strong Buy” in our POWR Ratings system, with a grade of “A” in Trade Grade, Buy & Hold Grade, Peer Grade, and Industry Rank. In the 34-stock Consumer Goods industry, it is ranked #1. Union Pacific Corporation (UNP) UNP provides freight transportation services for agricultural goods, food and beverage products, automotive products, along with a variety of other types of goods. UNP’s stock has returned 12.7% so far this year. Demand for UNP’s freight services has suffered due to the spread of the coronavirus, however, the company should recuperate its revenues once the economy returns to functioning at full capacity. During the second quarter, UNP has increased its productivity and efficiency. The company’s quarterly locomotive productivity increased by 12% as compared to the same period last year. The quarterly freight car velocity also marked an 11% improvement. The company’s revenue is expected to grow by 8.5% in 2021. UNP’s EPS is estimated to rise 17.9% next year and at a rate of 6.8% per annum over the next five years. UNP’s strong fundamentals are reflected in its POWR Ratings. It has a “Strong Buy” rating with an “A” in Trade Grade, Buy & Hold Grade, and Industry Rank. In the 14-stock Railroads industry, it is ranked #1. Target Corporation (TGT) TGT is a large-scale retailer that has operations across the United States and Canada. The company sells a wide range of goods and products including apparel, consumables, home products, and so on. TGT’s stock has gained 26.3% so far this year. The company has agreed with Shipt to provide customers with same-day delivery services. This move could help the company stay more relevant and expand its operations in the “new normal”. The company is planning for the holiday season and has partnered with FAO Schwarz for an exclusive 70-piece toy collection. The company’s revenue is expected to grow by 10.8% in the current quarter and 13% in 2021. TGT’s EPS is estimated to rise 11.8% for the recently completed quarter, 12.5% this year, and at a rate of 7% per annum over the next five years. It’s no surprise that TGT is rated a “Strong Buy” in our POWR Ratings system, with a grade of “A” in Trade Grade, Buy & Hold Grade, Peer Grade, and Industry Rank. In the 18-stock Grocery/Big Box Retailers industry, it is ranked #2. Want More Great Investing Ideas? 7 Best ETFs for the NEXT Bull Market What is the Cure for Stock Market Volatility? Chart of the Day- See Christian Tharp’s Stocks Ready to Breakout AMZN shares rose $2.35 (+0.07%) in after-hours trading Friday. Year-to-date, AMZN has gained 77.86%, versus a 9.31% rise in the benchmark S&P 500 index during the same period."}]}