{"article": [{"url": "https://stocknews.com/news/tsla-zm-shop-3-stocks-that-are-up-more-than-100-this-year/", "published": 1593778100.0, "headline": "3 Stocks That Are Up More Than 100% This Year", "body": "Although the Covid-19 pandemic has wreaked havoc for some stocks in the market, there are companies whose stocks have been soaring during this volatile period. For these companies,the pandemic has turned out to be a blessing in disguise. These companies were well positioned to adopt to the new normal. These stocks have more than doubled so far for the year, and could run even higher going forward. Tesla, Inc. (TSLA) 9 \"BUY THE DIP\" Growth Stocks For 2020Tesla’s stock increased 8% after the company reported better-than-expected vehicle deliveries for the second quarter. TSLA surpassed all expectations by delivering 90,650 vehicles. The stock, which is currently trading around $1200 a share, has come a long way from its IPO price of $17. Even though TSLA’s main factory in California was shut down at the beginning of the second quarter, the company managed to step up its production. Production in TSLA’s Shanghai car plant also helped the company. Tesla cut vehicle prices in China and North America during the second quarter in order to increase demand. TSLA has a Strong Buy Rating in the POWR Ratings. The company is also ranked #1 of out of 26 companies in the Auto & Vehicle Manufacturers industry The stock currently has a YTD return of 188.93%. Zoom Video Communications, Inc. (ZM) Amid the Covid-19 pandemic, most countries imposed lock downs to slow the spread of the virus. As a result, online video chatting became very popular among friends, families and in corporate and education sectors. A rising demand for this type of software platform has resulted in a surge in ZM’s stock price. The company did experience some negative headlines as questions were raised with regard to Zoom’s privacy and security issues. The company accepted the criticisms and presented a 90-day plan to solve the problems associated with the platform. The 90-day plan has just concluded with ZM having strengthened the security and privacy framework of the app. In addition, over a 100 new features have been launched including end to end encryption, UI updates, a bug bounty program, waiting rooms, and default passwords. Although making the app more secure is an ongoing process, the candid nature of the company to accept responsibility and update features to solve the problem has assured customers and investors alike. The company’s total revenue for the first quarter of this year was $328.2 million, which was a 169% year-over-year increase.The stock which has returned 284.69% year to date, is approaching its 52-week high of $263.80. ZM has a Strong Buy rating in the POWR Ratings. The company also ranks #1 out of 49 stocks in the Technology-Services industry. Shopify Inc. (SHOP) Shopify is a Canadian e-commerce company with a market cap of $120.78 billion. SHOP recently announced a deal with Chipotle Mexican Grill to help farmers during this pandemic by creating a virtual market. SHOP’s stock was up 6.9% after the deal was announced. The company’s partnership with a multinational retail corporation in mid-June also resulted in a surge in the stock’s price. SHOP has a current ratio of 9.45, indicating it has enough cash on hand to weather any storm. The company’s gross profit in US dollars grew by 43% at the end of the first quarter. SHOP has a Strong Buy in the POWR Ratings. It also ranks #1 out of 34 stocks in the Technology-Services industry. The stock is up 159.06% year to date. Want More Great Investing Ideas? 9 “BUY THE DIP” Growth Stocks for 2020 Is the Bull S#*t Rally FINALLY Over? 7 “Safe-Haven” Dividend Stocks for Turbulent Times Top 3 Investing Strategies for 2020 TSLA shares were trading at $1,208.66 per share on Friday afternoon, up $89.03 (+7.95%). Year-to-date, TSLA has gained 188.93%, versus a -1.99% rise in the benchmark S&P 500 index during the same period."}]}