{"article": [{"url": "https://stocknews.com/news/gwph-iipr-apha-mj-3-cannabis-stocks-that-could-reach-highs-in-2020/", "published": 1595419700.0, "headline": "3 Cannabis Stocks that Could Reach HIGHS in 2020", "body": "The cannabis industry as a whole has performed horrendously in 2019 and 2020. The ETFMG Alternative Harvest ETF (MJ) is down about 55% in just the past 52-weeks. However, investors shouldn’t turn their backs on all of the cannabis stocks . As with all industries, there are winners and losers. And in challenging economic times like these, you can more easily spot the winners. Here are three cannabis stocks that could reach new 52-week highs in 2020: 7 \"SAFE HAVEN\" Dividend Stocks for Turbulent TimesGW Pharmaceuticals Plc (GWPH) GWPH is a biopharmaceutical company that develops therapeutics for a wide range of diseases from its proprietary cannabinoid product platform. The growing demand of Epidiolex, the first FDA approved CBD used for the treatment of seizures associated with Dravet syndrome and Lennox-Gastaut syndrome in younger patients of age two or above, has driven GWPH’S revenue growth. In the first quarter, total revenue increased 207.7% year over year and total net product sales of Epidiolex was $116.1 million, which are pretty impressive. Moreover, the recent schedule reclassification reduces costs and increases the drug’s accessibility. GWPH also recently provided a clinical development strategy for bringing its product nabiximols into the US market, which should encourage investors. The stock has been rising since hitting its 52-week low of $67.98 on March 17th due to the coronavirus-led market crash and has gained about more than 101% so far. GWPH’s earnings surprise history looks impressive with the company beating consensus EPS estimates in three of the trailing four quarters. Moreover, GWPH’s consensus revenue estimate of $120.31 million for the quarter ending June 2020 indicates a year-over-year increase of 155.7% GWPH’s POWR Ratings reflect a promising outlook. It has an overall rating of “Buy” with an “A” for Industry Rank and a “B” for Trade Grade and Peer Grade. Among the 213 stocks in the Medical-Pharmaceuticals group, it’s ranked #27. Innovative Industrial Properties, Inc. (IIPR) IIPR focuses on development, acquisition and disposition of industrial facilities leased to tenants in the medical use cannabis industry. IIPR’s stock has gained about 136% from the 52-week low it hit in mid-March due to the overall dip in the market. In the first quarter, total revenues increased 210% and net income increased 249% year over year. IIPR recently announced a close on sale-leaseback transaction with subsidiaries of Columbia Care for two properties in New Jersey. IIPR’s earnings surprise history also looks impressive, with the company surpassing the consensus EPS estimates in three of the trailing four quarters. The market also expects the company to report EPS of $0.75 for the quarter ended June 2020, which represents a 150% growth over the year-ago number. Moreover, IIPR’s consensus revenue estimate of $23.91 million for the quarter indicates a year-over-year increase of 177.5%. IIPR pays an annual dividend of $4.24, which yields 4.47% The stock has a “B” grade in Industry Rank. It ranks #16 out of 21 stocks in the REITs – Industrial industry. Aphria Inc. (APHA) APHA is a leading global cannabis company that cultivates and sells cannabis-derived extracts, derivative cannabis products, medical and adult-use cannabis. APHA has also been performing well in this “new normal,” and has added approximately 168% to its stock price since this year’s low of $1.95 on March 18th. . In the fiscal third quarter ended February 29th, net revenue increased 96.3% and gross profit increased 244.5% year over year. The analyst average price target of APHA is $6.84 which represents a potential upside of about 33.3% from its current price. The stock has an “A” grade in Industry Rank and a “B” grade in Peer Grade. It ranks #64 out of 213 stocks in the Medical-Pharmaceutical industry. Want More Great Investing Ideas? 9 “BUY THE DIP” Growth Stocks for 2020 Newly REVISED 2020 Stock Market Outlook 7 “Safe-Haven” Dividend Stocks for Turbulent Times GWPH shares were unchanged in after-hours trading Wednesday. Year-to-date, GWPH has gained 28.10%, versus a 2.60% rise in the benchmark S&P 500 index during the same period."}]}