{"article": [{"url": "https://stocknews.com/news/nflx-ntes-grvy-inx-3-entertainment-stocks-outperforming-the-sp-500/", "published": 1596110900.0, "headline": "3 Entertainment Stocks OUTPERFORMING the S&P 500", "body": "As people sheltered-in-place when the coronavirus rapidly started to spread, this created a problem for many entertainment companies that relied on foot traffic, such as AMC Entertainment Holdings (AMC) and Live Nation Entertainment (LYV). However, it also created an opportunity for companies that offer entertainment to people from the comfort of their couch. Companies involved in streaming online video content or producing video games have actually grown in the past 5-months despite the challenging economic environment that exists. One way to find companies outperforming the market is to compare performance to a market benchmark such as the S&P 500. Netflix Inc. (NFLX), NetEase Inc. (NTES), and Gravity Co Ltd (GRVY) are three companies outperforming the S&P 500 so far for the year. 7 \"SAFE HAVEN\" Dividend Stocks for Turbulent TimesNetflix Inc. (NFLX) Even though NFLX’s content creation and production processes have been hampered due to the pandemic, the company has a large archive of content ready to satiate entertainment hungry customers. NFLX’s focus on creating niche region-based content in a bid to expand its global reach has been successful. NFLX has gained close to 50% year to date, compared to the S&P 500’s year-to-date loss of 0.4%. The market also expects the company to report EPS of $2.11 for the current quarter, which represents a 43.5% improvement over the year-ago number. Moreover, NFLX’s consensus revenue estimate of $6.36 billion for the current quarter indicates a year-over-year increase of 21.3%. In the second quarter, revenue increased 25% year over year, and earnings per share was $1.59 compared to $0.60 a year ago. The company added 10.1 million paid memberships in the quarter as compared to 2.7 million a year ago. Although growth has slowed down after economies around the world reopened, NFLX’s ability to churn out exciting content verticals could result in positive customer sentiment. The streaming powerhouse recently secured 160 Emmy nominations, which is a tally for the history books. According to our POWR Ratings system, NFLX has an “A” in Industry Rank and a “B” in Trade Grade. It ranks #24 out of 54 stocks in the Internet group. NetEase Inc. (NTES) NTES is an interactive online Internet Services company that focuses on the following segments: E-commerce, online game services, advertisement services, E-mail, and others. NTES has gained more than 45% year to date. In the first quarter, net revenue increased 18.3% and gross profit increased 21.2% year over year. The market also expects the company to report EPS of $4.52 for the quarter ended June, representing a 14.1% improvement over the year-ago number. NetEase’s earnings surprise history looks impressive, with the company surpassing the consensus EPS estimates in each of the trailing four quarters. NTES has an annual dividend of $4.63, which yields 1.02% and the company’s shareholder yield, which is a measure of how much capital is returned to stockholders via dividends and buybacks, is 21.05%, greater than the shareholder yield of 89.32% of stocks in the StockNews.com universe. NTES’s POWR Ratings reflect this promising outlook. It has an overall rating of “Buy” with an “A” for Trade Grade and Peer Grade and a “B” for Buy & Hold Grade, and Industry Rank. Among the 115 stocks in the China industry, it’s ranked #11. Gravity Co Ltd (GRVY) GRVY is a South Korea-based developer and publisher of online and mobile games. GRVY has gained 76.5% year to date. Within a week of the launch of Ragnarok Origin in Korea earlier this month, the game ranked fourth in the Apple App store and Google Play. GRVY recently announced an inked publishing contract with ByteDance Ltd. for publishing the new MMORPG mobile game, Ragnarok X: Next Generation in Hong Kong, Macau, Taiwan, and Southeast Asia. GRVY’s first-quarter 2020 revenues of $60.1 million increased 2.2% quarter over quarter. Operating profit for the quarter increased 475.7% quarter over quarter. Subscription revenues for the quarter came in at $8.1 million, up 37.7% quarter over quarter. This increase over the prior quarter was mainly attributable to increased revenues from Ragnarok Online and Ragnarok Prequel in Taiwan. It’s no surprise that GRVY is rated a “Strong Buy” in our POWR Ratings system. It also has an “A” for Trade Grade and Buy & Hold Grade, and a “B” for Peer Grade and Industry Rank. In the 13-stock Entertainment Toys & Video Games industry, it is ranked #4. Want More Great Investing Ideas? 9 “BUY THE DIP” Growth Stocks for 2020 How HIGH Can This Tech Bubble Fly? 7 “Safe-Haven” Dividend Stocks for Turbulent Times NFLX shares . Year-to-date, NFLX has gained 50.14%, versus a 1.69% rise in the benchmark S&P 500 index during the same period."}]}