{"article": [{"url": "https://stocknews.com/news/dhr-rop-rok-3-industrial-stocks-that-to-have-outperformed-the-sp-500/", "published": 1593605300.0, "headline": "3 Industrial Stocks That Have Outperformed the S&P 500 YTD", "body": "The Industrials sector has seen lackluster performance in 2020. The Industrial Select Sector SPDR ETF (XLI) is down 14.6% for the year, considerably lower than the 3.1% drop for the S&P 500. COVID-19 has had a terrible impact on the industrial manufacturing sector. Many jobs are on-site and cannot be carried out remotely. The pandemic has also reduced demand for industrial products. Some companies have closed facilities while others have turned to layoffs. However, there are three companies that have outperformed the S&P 500 for the year. Each of these companies is not only navigating the coronavirus economy successfully but their business strategies should help their long-term growth prospects. 9 \"BUY THE DIP\" Growth Stocks For 2020Danaher Corp (DHR) DHR was initially a real estate organization, but its founder transformed it into an industrial-focused manufacturing company. The company now focuses on manufacturing scientific instruments and consumables. The company’s stock was up 15.5% as of June 30th, compared to the S&P 500’s drop of 3.1%. DHR is one of the top performers in its industry. Its core markets of diagnostics and life sciences are benefiting from COVID-19. The pandemic is creating an emphasis on early diagnosis of diseases. Even after the pandemic, DHR should have excellent long-term growth prospects. The company’s diagnostic tests are critical tools in learning about and controlling future outbreaks. There will likely be more capital spending on research into diseases and vaccines. Also, DHR’s COVID test makes clinics more familiar with their products, so clinicians may start using their equipment on flu tests. The company has a 5-year EPS growth estimate of 10.3% and should see sales growth of 12% next year. DHR has a Strong Buy rating in the StockNews.com POWR Ratings. The company sports a Peer Grade of A. This is a metric that compares a security’s performance versus other stocks in its industry. Roper Technologies (ROP) ROP is a diversified technology company that operates out of four segments: application software, network software and systems, measurement and analytical solutions, and process technologies. The firm’s strategy emphasizes acquiring asset-light, cash-generative businesses. It reinvests excess cash in businesses that yield higher rates of return. The business model is somewhat similar to Berkshire Hathaway (BRK.A). The stock is up 9.9% for the year. Since the company has an asset-light strategy, it doesn’t require a lot of capital spending. ROP also doesn’t carry a lot of inventory. That can explain why they have $1 billion in cash on hand as of March 2020. This type of business model has resulted in a rapidly growing revenue stream. Their revenue has a compound annual growth rate of 10.6%. The stock has been great for shareholders as it has increased its dividend for more than 25 years in a row. ROP should do well in the long run. It relies on acquisitions for growth so it should be able to find companies on the cheap due to cash flow problems at companies affected by the pandemic. The company has a Strong Buy rating in the POWR Ratings. It has a Buy & Hold Grade of A. This metric measures the long-term bullish or bearishness of a stock. Rockwell Automation (ROK) Rockwell Automation is an automation company that operates through two segments–architecture and software and control products and solutions. The company should be a big winner if manufacturing activity is shifted back to the U.S. If production is moved back to a higher wage country like the U.S., companies will need to increase profitability. They can do that through automated processes and robotics. That’s where ROK comes in. There was already a trend to automation before the pandemic started, but COVID may advance that trend. Automation should help companies in the future avoid the drop in productivity that occurred over the last few months. This is one of the significant reasons that ROK has a higher year to date return than the S&P 500. The stock is up 6.2% for the year. ROK also has offerings in the Internet of Things (IoT) space. It was recently awarded the Industrial IoT Company of the Year by Compass Intelligence. ROK has a Buy Rating in the POWR Ratings. One of the components of the POWR Ratings is the Trade Grade. This metric represents the short-term bullish or bearishness of a stock. The company has a Trade Grade of A. Want More Great Investing Ideas? 9 “BUY THE DIP” Growth Stocks for 2020 Is the Bull S#*t Rally FINALLY Over? 7 “Safe-Haven” Dividend Stocks for Turbulent Times Top 3 Investing Strategies for 2020 DHR shares were trading at $177.76 per share on Wednesday afternoon, up $0.93 (+0.53%). Year-to-date, DHR has gained 16.10%, versus a -2.27% rise in the benchmark S&P 500 index during the same period."}]}