{"article": [{"url": "https://stocknews.com/news/orcl-sap-epam-nuan-is-oracle-a-buy-after-the-tiktok-deal/", "published": 1600690100.0, "headline": "Is Oracle a Buy After the TikTok Deal?", "body": "The Trump administration issued an executive order banning the video-sharing app, TikTok, citing a threat to national security amid escalating tensions between Beijing and Washington. The order allowed private sector entities to execute a commercial transaction, responsible for maintaining and operating the network. Microsoft (MSFT), Oracle (ORCL), and Walmart (WMT) were potential bidders for TikTok’s U.S. business. ORCL won the bid and it could take up to a 12.5% stake in TikTok’s parent company. ORCL struck the deal as it is confident in its ability to deliver a highly secure environment to TikTok and ensure data privacy to TikTok’s American users, and users throughout the world. Last Saturday, Trump approved the deal. Oracle Corporation (ORCL) develops, hosts, and supports database and middleware software, application software, cloud infrastructure, hardware systems, and related services worldwide. It operates via four segments – Cloud services and license support, Cloud license and on-premise license, Hardware, and Services. The company presently has 7,300 Fusion enterprise resource planning (ERP) customers and over 23,000 NetSuite ERP customers in the Oracle Cloud. 7 Best ETFs for the NEXT Bull MarketThere is apprehension about the deal considering the tensions between the two companies. Additionally, Oracle has never been a consumer-facing company. However, with roughly 100 million users in the United States and a potential IPO, Tiktok could significantly boost Oracle’s near-term performance and long-term prospects. For the fiscal first quarter ended August 2020, ORCL’s top-line increased 2% and the earnings per share were up 14% year-over-year. This impressive performance and the potential upside based on several factors have helped it earn a “Strong Buy” rating in our proprietary rating system. Here is how our proprietary POWR Ratings system evaluates ORCL: Trade Grade: A ORCL is currently trading higher than its 50-day and 200-day moving averages of $56.38 and $53.62, respectively, indicating that the stock is in an uptrend. The stock’s 8.3% return over the past month reflects a short-term bullishness. ORCL had an impressive first quarter. It reported a top-line of $9.4 billion, beating the company’s estimate by $150 million. The cloud applications businesses continued to witness rapid revenue growth, contributing 74% to the total revenues along with Fusion ERP growing 33% and NetSuite ERP increasing 23%, year-over-year. Buy & Hold Grade: A ORCL is well-positioned in terms of proximity to its 52-week high, which is a key factor that our Buy & Hold Grade takes into account. The stock is currently trading just 6.1% below its 52-week high. The stock has gained 30% over the past three years. Over this period, ORCL has transitioned from an antiquated business of on-premises database software licensing and maintenance to a subscription-based software model that taps the benefits of cloud computing. The Oracle Cloud is one of the best Infrastructure-as-a-Service (IaaS) technologies right now. Peer Grade: A ORCL is currently ranked #2 out of 92 stocks in the Software – Application industry. Other popular stocks in the industry are SAP SE ADS (SAP), EPAM Systems, Inc. (EPAM), and Nuance Communications, Inc. (NUAN). While ORCL gained 14.3% year-to-date, SAP, EPAM, and NUAN gained 20.8%, 49%, and 85.7%, respectively, over this period. However, ORCL is better positioned to move higher than many of its peers based on its recent developments. Industry Rank: B The Software – Application industry is ranked #6 out of the 123 StockNews.com industries. Since the onset of the health crisis, remote working, and learning culture amplified the dependence on edge computing and cloud infrastructure. Increased corporate spending on digital transformation is fueling the top-line of the software companies and thus, the industry is thriving. Overall POWR Rating: A (Strong Buy) Overall, ORCL is rated a “Strong Buy” due to its impressive past performance, short-and-long-term developments, and robust growth in its user base, as determined by the four components of our overall POWR Rating. Bottom Line ORCL has remained profitable and maintained its leadership position during the pandemic due to the rapid growth in the cloud applications business. The company is capitalizing on investment opportunities like TikTok and has the potential to grow further based on its continued business growth and favorable earnings. Analyst sentiment, which gives a good sense of a stock’s future price movement, is pretty impressive for ORCL. The average broker rating of 1.78 indicates a favorable analyst sentiment. Of the 29 Wall Street Analysts that rated the stock, 6 have given it a “Strong Buy” rating. The market expects EPS for the current year to rise 9.4% from the year-ago value. Want More Great Investing Ideas? 7 Best ETFs for the NEXT Bull Market Is the Stock Market Correction Over? Chart of the Day- See the Stocks Ready to Breakout ORCL shares were trading at $60.29 per share on Monday afternoon, up $0.54 (+0.90%). Year-to-date, ORCL has gained 15.33%, versus a 1.68% rise in the benchmark S&P 500 index during the same period."}]}