{"article": [{"url": "https://stocknews.com/news/nobl-psq-spdn-3-etfs-to-buy-if-you-expect-a-market-reversal/", "published": 1597406900.0, "headline": "3 ETFs to Buy if You Expect a Market Reversal", "body": "This week, the S&P 500 came within 0.5% of a new, all-time high. Despite the stock market’s optimism, many well-respected investors like Warren Buffett remain cautious. There are several risks like a flareup in coronavirus cases, failure of Congress to reach an agreement on extending the CARES Act, and a stock market that is hitting extremes in valuation. Below is the ratio of the Wilshire 5000 to GDP. In a 2001 interview, Buffett remarked, “it is probably the best single measure of where valuations stand at any given moment.” 9 \"BUY THE DIP\" Growth Stocks For 2020So, it’s reasonable for investors to be cautious at the moment. One strategy is to load up on stocks that have a long track record of paying and increasing dividends, as they tend to do well during bearish markets and generate a healthy income stream. More short-term, aggressive traders may even look to bet on a market reversal. One way to do so is by buying inverse ETFs which rise when their corresponding indexes decline. If the market were to reverse, ProShares Short QQQ (PSQ), Direxion Daily S&P 500 Bear 1X Shares (SPDN), and ProShares S&P 500 Dividend Aristocrats ETF (NOBL) are three ETFs that will outperform. ProShares Short QQQ (PSQ) PSQ is a passively managed ETF that seeks daily investment results that correspond to the inverse (-1x) of the daily performance of the Nasdaq 100 Index. The fund’s expense ratio is 0.95% and it has an AUM of $608.5 million. It also has an impressive 1.41% yield. The index holds 103 companies with an average market capitalization of $125.6 billion. It is heavily exposed to the information technology industry group. The top three holdings of the index are Apple, Inc. (AAPL), Microsoft Corporation (MSFT) and Amazon, Inc. (AMZN), with the weights of 12.1%, 11.8%, and 10.5%, respectively. PSQ is presently trading at $17.13. The ETF has lost 30.25% year-to-date. As per the POWR Ratings, PSQ is rated “B” for Peer Grade. It is also ranked #2 out of 48 ETFs in the Inverse Equities ETFs group. Direxion Daily S&P 500 Bear 1X Shares (SPDN) SPDN is an inverse equity ETF that seeks to offer the inverse of the daily return of the S&P 500 index. The fund’s objective is to seek a return that is -100% of the return of its benchmark index for a single day. The fund allows investors a tactical trading alternative to selling out of an existing position and creating a taxable event. The ETF has over $172 million in AUM and an expense ratio of 0.5%. Moreover, it has a good dividend history with a yield of 0.97%. The underlying index currently consists of 505 constituents with a total market capitalization ranging from $2.9 billion to $1.3 trillion. It is concentrated in the information technology sector with a 27.5% weight, followed by the healthcare sector with 14.6%. The index’s top three holdings are Microsoft Corp (MSFT), Apple, Inc., (AAPL), and Amazon, Inc. (AMZN) at 6%, 5.8%, and 4.5%, respectively. SPDN is rebalanced daily to ensure that it tracks the S&P 500. It generally uses derivatives like swap agreements and futures contracts to meet its objective. SPDN is currently trading near its 52-week low of $20.8. The year-to-date change for the ETF is -14.5% compared to the index’s year-to-date gain of 4.4%. As per our POWR Ratings system, SPDN has an “A” in Peer Grade. It is currently ranked #5 out of 48 ETFs in the Inverse Equities ETFs group. ProShares S&P 500 Dividend Aristocrats ETF (NOBL) NOBL is a passively managed ETF that invests in the S&P 500 companies that have increased dividends each year for at least 25 consecutive years. It seeks to generate investment results and track the performance of the S&P 500 Dividend Aristocrats Index. During weak economic conditions, there’s a risk that companies may have to cut dividends. This is reduced with this ETF as it consists of high-quality companies that have not just paid dividends but increased them for at least 25 consecutive years, with most doing so for 40 years or more. The ETF has an AUM of $6.3 million and an expense ratio of 0.35%. The fund has net assets of $5.78 billion and contains a total of 66 equally weighted companies. The index has a maximum sectoral weight of 25.8% in the industrials sector followed by an 18.5% weight in the consumer staples sector. The top 3 holdings of the fund are Lowe’s Companies. Inc. (LOW), Carrier Global Corporation (CARR), and Cintas Corporation (CTAS). Buying NOBL is one way to weather poor market conditions, as they tend to outperform and create a healthy 2.75% income stream for investors. The ETF is currently trading at $73.44, a 4% discount from its 52-week high of $76.58. NOBL is rated a “Strong Buy” ETF in our POWR Ratings system, based on its portfolio holdings and high dividend yield. It has an “A” in Trade Grade, Buy & Hold Grade, and Industry Rank. It is currently ranked #16 out of 173 ETFs in the Large Cap Blend ETFs group. Want More Great Investing Ideas? 9 “BUY THE DIP” Growth Stocks for 2020 How to Trade THIS Stock Bubble? 7 “Safe-Haven” Dividend Stocks for Turbulent Times NOBL shares . Year-to-date, NOBL has declined -1.51%, versus a 5.73% rise in the benchmark S&P 500 index during the same period."}]}