{"article": [{"url": "https://stocknews.com/news/nok-znga-gpro-3-buy-rated-stocks-on-the-robinhood-under-10/", "published": 1597147700.0, "headline": "3 \"Buy Rated\" Stocks on the Robinhood 100 Under $10", "body": "Robinhood is a popular trading app that lets investors trade stocks, options, ETFs, and cryptocurrencies without paying commissions. The trading app has seen skyrocketing growth since it launched in 2013 and currently has more than 13 million users. Robinhood publishes a list of their top 100 owned stocks that traders and investors pay a lot of attention to. That’s because the app is popular with millennials, who are considered more tech savvy than typical investors. Some stocks on the Robinhood 100, like Amazon (AMZN) and Tesla (TSLA), are trading over $1,000 per share, but there are others on this list that are much cheaper.. 7 Best ETFs for the NEXT Bull MarketJust because a stock is trading at lower prices does mean the stock is a worthwhile investment. But if you can find good stocks, that will grow over time, and are trading at cheaper prices, that’s beneficial because you can afford to buy more shares. Which is why I used the StockNews.com POWR Rating system to discover which Robinhood 100 stocks, trading under $10, are rated a “Buy.” I found that Nokia Corporation Inc. (NOK), Zynga Inc. (ZNGA) and GoPro, Inc. (GPRO) are three such stocks. Nokia Corporation Inc. (NOK) NOK is engaged in network and technology businesses worldwide. The company offers network infrastructure software, hardware and services, a location platform, and location experiences across different screens and operating systems. It also provides professional services for mobile networks. Moreover, the company has a strategic collaboration with Microsoft Corporation (MSFT). NOK is presently trading at $4.96. The stock hit a 52-week low of $2.34 due to the coronavirus-led crash on March 18th and NOK has a year-to-date gain of 32%. The company’s second quarter result did not fail to impress the street. NOK reported earnings surprise of 133.3% with an EPS of $0.07 versus the consensus estimate of $0.03. The enterprise grew year-on-year constant currency sales by 18% compared to the year-ago quarter. Free cash flow for the firm stood €244,000 compared to the negative cash flow of €1 million last year. NOK also reported €330,000 as cash flow from operations. NOK’s present dividend translates to a yield of 1.02%. Furthermore, EPS is expected to grow more than 21% next year while the revenues are estimated to be $25.4 billion for the current year. NOK has a 61% buy rating as per the Robinhood analyst ratings. How does NOK stack up for POWR Ratings? A for Trade Grade B for Buy & Hold Grade B for Peer Grade B for Industry Rank B for Overall POWR Rating. NOK is ranked #17 out of 51 stocks in the Technology – Communication/Networking industry. Zynga Inc. (ZNGA) ZNGA is a global leader in interactive entertainment that develops, markets, and operates online social games. ZNGA connects the world through its games available in over 150 countries. To date, more than one billion people have played Zynga’s franchises. Year-to-date, the stock has gained more than 70% and is presently trading at $9.01. ZNGA hit a 52-week low of $5.51 in August last year and has seen a recovery of about 70%. ZNGA recently announced the acquisition of an Istanbul-based mobile games developer, Rollic. With this acquisition, the company plans to enter the hyper-casual gaming market, one of the largest and fastest growing gaming categories on mobile. The company posted impressive second quarter results. ZNGA reported a record revenue of $452 million for the quarter, a 47% increase year-over-year. Revenue from advertisement bookings stood $518 million, up 38% year-over-year. It also recorded online game, or user pay, revenue of $388 million, which was up 61% year-over-year. ZNGA generated an operating cash flow of $145 million, its best performance since the fourth quarter of 2011, rising more than 47% year-over-year. Free cash flow for the firm stood $143 million, registering a 52% year-over-year growth. The company reported an EPS of $0.10 in the last quarter and earnings surprise of 25%. Furthermore, the EPS is anticipated to grow by 38% in the current year. ZNGA has a 79% buy rating as per the Robinhood analyst ratings. ZNGA is rated “Buy” in our POWR Ratings system, consistent with its current momentum. It also has an “A” for Trade Grade, and a “B” for Buy & Hold Grade and Industry Rank. It is also ranked #5 out of 13 stocks in the Entertainment – Toys & Video Games industry. GoPro, Inc. (GPRO) GPRO develops and sells devices, such as cameras, drones, premium wearable accessories, and mounts comprising equipment-based mounts. It has a wide range of products including 360-degree waterproof cameras. The company provides a cloud-based storage solution along with a desktop and smartphone editing applications. The stock is currently trading at $4.61 and its 52-week high is $5.79. With a year-to-date gain of about 15%, the stock is up more than 135% from its March lows. GPRO generated $134.2 million in revenue for its second quarter. The top-line surpassed the consensus estimate of $109 million by 23%. The company shipped a total of 448,000 cameras in the quarter in comparison to 341,000 cameras in the preceding quarter. Revenue based on channels witnessed a structural change this quarter. Revenue generated from its website contributed more than 44% to the overall revenue. Online sales contributed 9% and 21% in the year-ago quarter and the previous quarter, respectively. Despite reporting a negative EPS of $0.20 for the last quarter, GPRO’s revenue is estimated to be $366 million in the next quarter while the EPS is expected to grow more than 310% next year. GPRO’s POWR Ratings reflect this promising outlook. It has an overall rating of “Buy” with an “A” for Trade Grade and Industry Rank. Among the 28 stocks in the Technology – Hardware industry, it’s ranked #9. Want More Great Investing Ideas? 3 Possible Directions for the Stock Market from Here How to Trade THIS Stock Bubble? 9 “BUY THE DIP” Growth Stocks for 2020 NOK shares . Year-to-date, NOK has gained 33.69%, versus a 4.46% rise in the benchmark S&P 500 index during the same period."}]}