{"article": [{"url": "https://stocknews.com/news/rng-ui-entg-olli-4-upgraded-stocks-to-buy-for-the-rest-of-the/", "published": 1595506100.0, "headline": "4 Upgraded Stocks to BUY for the Rest of the Year", "body": "Our exclusive POWR Ratings have crunched the numbers to determine which stocks are most worthy of investors’ attention. The latest POWR Ratings calculations reveal RingCentral (RNG), Ubiquiti (UI), Entegris (ENTG), and Ollie’s Bargain Outlet (OLLI) have been upgraded to Strong Buys. Let’s take a look at each one to identify their specific strengths. Ringcentral (RNG) SaaS is all the rage these days for good reason. The COVID-19 outbreak has prevented workers from returning to the office, forcing them to resort to cloud solutions. RNG provides SaaS through the cloud. These solutions are available on multiple devices ranging from traditional PCs to smartphones, tablets, and desk phones. 9 \"BUY THE DIP\" Growth Stocks For 2020RNG’s offerings empower businesses to communicate across a wide array of channels. Examples of RNG solutions include intelligent call routing, flexible extension structure, voicemail boxes, and auto-receptionist functionality. Each RNG feature is directly integrated into smartphones and other devices seamlessly. Take a look at the POWR Ratings, and you will find RNG is now ranked in the top 5 of nearly 50 publicly traded companies in the Software – Business industry. RNG has an A Trade Grade and an A Buy & Hold Grade along with above-average marks in the remaining POWR Components. Analysts have set a price target of $297.67 for RNG. Ubiquiti (UI) Wireless networks will be widely used for the foreseeable future. UI’s wireless networking solutions are proprietary technologies that take the form of management tools and radio antennas. These antennas help transmit broadband internet to rural parts of the world. The UI’s POWR Ratings are as good as it gets. The stock has As in every POWR Component except for Industry Rank, which has a grade of B. UI is ranked #1 out of more than 50 stocks in the Technology -Communication/Networking industry. Though UI is a tech stock, it has a forward P/E ratio under 30, meaning it has solid value. UI is up nearly 500% over five years. It is particularly interesting to note that UI does not have sales execs or customer service engineers. Instead, the company relies on its online user community to assist one another in navigating the technology and the UI website. However, there is always the option of directly interacting with UI staff. There is a good chance UI returns to its 52-week high of $199 before summer’s end. Entegris (ENTG) Semiconductors, microelectronics, and data storage solutions require nuanced materials to function as intended. ENTG makes, develops, and supplies materials along with solutions for these industries. If you look at ENTG’s POWR Ratings, you will find an A grade in all POWR Components except for the Peer Grade. ENTG is ranked in the top 20 of 86 Semiconductor & Wireless Chip stocks. Last year, ENTG returned 80%. Over three years it is up nearly 150%. The average analyst price target is $65. Ollie’s Bargain Outlet (OLLI) Bargain shopping is back en vogue now that the economy has tanked. OLLI is benefiting from the rush to bargain-basement deals. This discount retail chain owns more than 300 stores across the eastern portion of the United States. Nearly 10 million customers proudly belong to the company’s loyalty program. OLLI has quite the impressive POWR Ratings with As in Trade Grade and Buy & Hold Grade. The stock is ranked in the top five out of nearly 35 companies in the Specialty Retailers segment. Over the last six months, the stock has returned 82% and is up 63% year-to-date. The average analyst price target for OLLI is $110.15. Want More Great Investing Ideas? 9 “BUY THE DIP” Growth Stocks for 2020 Newly REVISED 2020 Stock Market Outlook 7 “Safe-Haven” Dividend Stocks for Turbulent Times RNG shares were trading at $275.74 per share on Thursday afternoon, down $6.09 (-2.16%). Year-to-date, RNG has gained 63.48%, versus a 1.18% rise in the benchmark S&P 500 index during the same period."}]}