{"article": [{"url": "https://stocknews.com/news/pool-bc-yeti-3-outdoors-stocks-flourishing-during-the-pandemic/", "published": 1597320500.0, "headline": "3 Outdoors Stocks FLOURISHING During the Pandemic", "body": "Companies selling products that are essential for outdoor activity witnessed a slump in sales during the first quarter of 2020, due to the pandemic. With a countrywide lockdowns and stay-at-home policies, this close to $900-billion industry faced one of its worst periods since the 2008 recession. However, things started looking up in late April, when the nation started to resume its business again. As people started exploring outdoor activities after being cooped up in their homes for weeks, companies in the outdoor industry have saw a stunning recovery in the second quarter, surpassing all estimates. Stocks of companies that offer products and services related to outdoor leisure activities have gained more than 100% since the onset of the pandemic, and are expected to grow even further through the remainder of 2020. Here are three such companies: Pool Corporation (POOL), Brunswick Corporation (BC), and YETI Holdings, Inc. (YETI). 9 \"BUY THE DIP\" Growth Stocks For 2020Pool Corporation (POOL) POOL distributes swimming pool supplies, equipment, and related leisure products in North America, Europe, South America, and Australia. As the world’s largest distributor of swimming pool supplies, POOL’s net revenues rose 14% year-over-year to $1.28 billion in the second quarter ending June 2020. This increase can be attributed to a higher demand for residential pool usage due to warmer weather and closed schools. POOL’s quarterly gross profit increased 13% to a record value of $373.50 million. Its operating income reached $205.90 million during the second quarter, increasing 19% year-over-year. POOL’s cash flow from operations grew 227.1% since the first half of 2019 to $221.20 million. Such strong cash flow balance ensures sustained dividend payments to investors. In fact, POOL has increased its dividend for 22 quarters in a row. It currently pays an annual dividend of $2.32 per share, which yields 0.73%. Demand for construction and remodeling of swimming pools has helped POOL offset losses caused due to stay at home and social distancing norms. As the lockdown restrictions were eased in late April and early May, POOL’s sales skyrocketed. The consensus EPS estimate of $2.17 for the third quarter indicates an 11.2% improvement year-over-year. Moreover, POOL beat the street EPS estimates in each of the trailing four quarters, which is impressive. The consensus revenue estimate for the upcoming quarter is $996.43 million, indicating a 10.9% rise year-over-year. POOL hit its 52-week low of $160.35 in March due to an overall dip in the market. It gained more than 105% since then and hit its 52-week high of $331.12 in August. How does POOL stack up for the POWR Ratings? A for Trade Grade A for Buy & Hold Grade A for Peer Grade B for Industry Rank A for Overall POWR Rating You can’t ask for better. POOL is also ranked #2 out of 32 stocks in the Athletics and Recreation industry. Brunswick Corporation (BC) BC is globally known for its recreational marine products. The company is involved in designing, manufacturing, and supplying marine engines, boats, and various parts and accessories of marine electronics and control integration systems. The cash and marketable securities balance for the second quarter ending June of $553.90 million increased 66.5% from $332.7 million in the first two quarters of 2020. Its Freedom Boat club gained popularity during this time as well, as over 4,600 new members were added to the club, bringing the total to 33,000 memberships worldwide. The freedom fleet currently comprises over 3,000 boats. BC’s mid-season pipeline inventory hit its record low in 20 years this quarter, declining 34% from its year-ago value. BC currently pays $0.96 annually as dividend, which yields 1.51%. Its trailing twelve-month dividend has grown 11.5% annually over the last 5.5 years. With the recovery of demand, BC’s second quarter results surpassed the market expectations. In this regard, CEO David Foulkes said, “Our second quarter performance again demonstrated the power of our marine-focused portfolio despite the unprecedented disruption to the global economy resulting from the COVID-19 pandemic.” The consensus EPS estimate of $1.33 for the third quarter ending September 2020 indicates a 20.9% improvement year-over-year. BC has an impressive earnings surprise history as well, as the company beat the street EPS estimates in three of the trailing four quarters. The consensus revenue estimate of $1.07 billion indicates a 7.8% improvement year-over-year. BC gained more than 190% to hit its 52-week high of $73.99 in July since hitting its 52-week low in March. BC is rated a Buy in our POWR Ratings system, with a grade of B in Trade Grade, Buy & Hold Grade, and Industry Rank. It is also ranked #10 out of 32 stocks in the Athletics and Recreation industry. YETI Holdings, Inc. (YETI) YETI is one of the biggest retail producers and distributors of outdoor recreation products in the United States, Canada, Japan, and Australia. It also provides accessories for storage and transport facilitating outdoor living. YETI’s net sales increased 7% year-over-year to $246.90 million in the second quarter ending June 2020. The company’s gross profit of $137.50 million increased 18% from its year-ago value. YETI’s operating income improved 33% year-over-year to $46.50 million, while net income grew 51% year-over-year to $33.50 million during the same time. The consensus EPS estimate of $0.35 for the third quarter ended September 2020 indicates a 16.7% improvement year-over-year. Also, YETI surpassed street EPS estimates in each of the trailing four quarters, which is impressive. The consensus revenue estimate of $255.46 million indicates a 11.5% growth from its year-ago value. YETI hit its 52-week low of $15.28 in March due to the overall dip in the market. It gained more than 260% since then, hitting its 52-week high of $55.04 in August. YETI is rated a Buy in our POWR Ratings system, consistent with its robust recovery amid the pandemic crisis. It has grades of A in Trade Grade and Industry Rank, and a grade of B in Buy & Hold Grade and Peer Grade. Out of 34 stocks in the Consumer Goods industry, YETI is ranked #15. Want More Great Investing Ideas? 3 Possible Directions for the Stock Market from Here How to Trade THIS Stock Bubble? 9 “BUY THE DIP” Growth Stocks for 2020 POOL shares . Year-to-date, POOL has gained 51.79%, versus a 5.73% rise in the benchmark S&P 500 index during the same period."}]}