{"article": [{"url": "https://stocknews.com/news/cat-de-adm-bg-4-top-agricultural-stocks-that-pay-dividends/", "published": 1597838900.0, "headline": "4 Top Agricultural Stocks That Pay Dividends", "body": "Due to the coronavirus, the agricultural sector has faced quite a few headwinds such as supply chain disruptions, lower volume, and higher costs. This is evident from the Invesco DB Agriculture Fund’s (DBA) year-to-date loss of 13.5% as compared to SPDR S&P 500’s (SPY) year-to-date gain of 6.4% However, agricultural companies have gradually recovered and may have turned a new corner in the second quarter. A recent catalyst has been flooding in China which has led to severe crop losses and increasing its demand for exports. So, it’s worth exploring stocks from this industry that remains undervalued and could benefit from the recovery in agricultural products. Many of the higher-quality stocks in this space pay above-average dividends which make them a worthy candidate for your portfolio. 9 \"BUY THE DIP\" Growth Stocks For 2020Caterpillar, Inc. (CAT), Deere & Company (DE), Archer-Daniels-Midland Company (ADM) and Bunge Limited (BG) are the four such stocks with high dividend yields and capital appreciation potential. Caterpillar, Inc. (CAT) CAT manufactures and sells construction and mining equipment, diesel and natural gas engines, and industrial gas turbines. The stock has been rising since hitting its 52-week low of $87.50 on March 12th and has grown by more than 55%. CAT pays an annual dividend of $4.12 which yields 2.98%. CAT maintained its quarterly dividend of $1.03 which is payable to shareholders on August 20th, 2020. Over the past six years, CAT has issued more dividends than 94.46% of other dividend-issuing US stocks in the StockNews.com universe. CAT has paid a cash dividend every year since its inception and has paid a quarterly dividend since 1933. Moreover, CAT has paid higher dividends for 26 consecutive years and is a member of the S&P 500 Dividend Aristocrat Index. CAT has a strong financial position and ended the second quarter with $630 million in cash and $7.75 billion of available global credit facilities. Moreover, the company arranged $8 billion of supplemental liquidity facilities in April. How does CAT stack up for the POWR Ratings? A for Trade Grade A for Buy & Hold Grade A for Industry Rank A for Overall POWR Rating You can’t ask for better. The stock is also ranked #2 out of 59 stocks in the Industrial-Machinery industry. Deere & Company (DE) DE provides advanced technology, products, and services for agriculture and construction. DE pays an annual dividend of $3.04 which yields 1.58%. The stock has gained more than 70% since its March lows. DE has an impressive earnings surprise history with the company surpassing consensus EPS estimates in three of the trailing four quarters. DE’s EPS grew at an annualized rate of 11.8% over the past five years. Moreover, the market expects the company’s EPS to increase by 39.6% next year. DE expanded its frontier equipment line-up with the recent additions of new loader carrier adapters, pallet fork grapples, and tractor-mounted sprayers. It’s no surprise that DE is rated “Strong Buy” in our POWR Ratings system. It also has an “A” for Trade Grade, Buy & Hold Grade, and Peer Grade and Industry Rank. In the 59-stock Industrial-Machinery industry, it is ranked #4. Archer-Daniels-Midland Company (ADM) ADM is an agricultural origination and food processing company based in Chicago. ADM has returned more than 40% since its March lows. ADM pays an annual dividend of $1.44 which yields 3.25%. The company declared a cash dividend of 36 cents per share which will be paid on August 19th, 2020. This marks ADM’s 355th consecutive quarterly payment, a record of 88 years of uninterrupted dividends. ADM has a free cash/dividend ratio of 4.98 which is better than 95.4% of other US-listed dividend issuers. ADM has an impressive earnings surprise history with the company surpassing consensus EPS estimates in each of the trailing four quarters. In the second quarter, adjusted earnings per share increased 41.7% and the adjusted segment operating profit increased 17.9% year-over-year. ADM’s POWR Ratings reflect this promising outlook. It has an overall rating of “Strong Buy” with an “A” for Trade Grade, Buy & Hold Grade, and Peer Grade. Among the 27 stocks in the Agriculture industry, it’s ranked #1. Bunge Limited (BG) BG deals with oilseed, grain products, and ingredients and pays an annual dividend of $2 which yields 4.33%. BG declared a regular quarterly cash dividend of $0.50 per share which is payable to shareholders on December 2nd, 2020. Moreover, the company also declared a quarterly cash dividend of $1.21875 per share on its 4.875% cumulative convertible perpetual preference shares which are payable on December 1st, 2020. In the earnings report for the second quarter, BG’s CEO, Greg Heckman said, “Bunge had an outstanding second quarter, with strong performance across all of our core businesses while maintaining a sharp focus on the safety of our team. Our execution against committed crush capacity and coordination of trade flows was exceptional. We realized the benefit from our risk management decisions in the first half of this year and earned new business with our focus on innovation and our collaborative approach with customers. We generated strong cash flow while being disciplined in our approach to capital allocation, and continued to execute on our key priorities. These results would be strong in any environment, let alone a pandemic, and we couldn’t be more proud of the resilience and commitment of our team.” In the second quarter, net income available to shareholders increased 143.5% and gross profit increased 115.8% year-over-year. Furthermore, the core agribusiness and food & ingredients businesses did well. The stock has grown more than 50% since its March lows. BG’s earnings surprise history looks pretty good with the company surpassing consensus EPS estimates in three of the trailing four quarters. BG’s EPS is expected to grow 10.1% per annum in the next five years. BG is rated “Buy” in our POWR Ratings system. It also has an “A” for Trade Grade and Peer Grade and a “B” in Industry Rank. It is ranked #6 out of 27 stocks in the Agriculture industry. Want More Great Investing Ideas? The Best of StockNews 3 Possible Directions for the Stock Market from Here 9 “BUY THE DIP” Growth Stocks for 2020 CAT shares were trading at $137.94 per share on Wednesday afternoon, down $0.43 (-0.31%). Year-to-date, CAT has declined -4.37%, versus a 6.03% rise in the benchmark S&P 500 index during the same period."}]}