{"article": [{"url": "https://stocknews.com/news/fb-are-shares-of-facebook-a-buy-at-this-price/", "published": 1599566900.0, "headline": "Are Shares of Facebook a Buy at this Price?", "body": "Facebook, Inc. (FB) is one of the biggest social networking companies in the world, enabling people to connect, share, discover, and communicate with each other. FB has over 2.7 billion monthly active users. It also has a popular array of apps such as Instagram, WhatsApp, and Messenger which are used by more than a billion dollars in total. FB’s second-quarter earnings report reflects its robust growth amid the pandemic. The company’s net income increased by 98%, income from operations increased by 29%, and total revenue increased by 11% year-over-year during the quarter. With people spending more time on social media amid the pandemic and companies using them as the key advertisement platforms, the stock has gained close to 100% since its March low. This impressive performance and the potential upside based on several factors have helped it earn a “Buy” rating in our proprietary rating system. 7 Best ETFs for the NEXT Bull MarketHere is how our proprietary POWR Ratings system evaluates FB: Trade Grade: A FB is currently trading higher than its 50-day and 200-day moving averages of $254.85 and $215.04, respectively, indicating that the stock is in an uptrend. The stock’s 18.5% return over the past three months reflects a solid short-term bullishness. There has been a surge in user engagement due to increased social distancing and stay at home measures in light of the pandemic. FB’s daily and monthly active users were up 12% and the headcount increased 32% year-over-year in the second quarter. However, as restrictions ease and economies open up, the company expects the number of users to flatten out. Buy & Hold Grade: B In terms of proximity to its 52-week high, which is a key factor that our Buy & Hold Grade takes into account, FB is well-positioned. The stock is currently trading just 7.8% below its 52-week high of $304.67. FB currently has a price/sales ratio of 10.72, higher than 87.5% of US stock in the StockNews.com universe. FB’s efforts to foster the growth of small businesses through its platforms and growing user base have been reflected in its premium valuation. The company continuously adds new features that enhance user experience. For instance, the US launch of Facebook News, a news destination within the app, helps publishers cater to new audiences. FB has grown 65.4% over the past three years and its PEG ratio and cash/price ratio of 1.86 and 0.07 are both lower than the respective industry averages which indicate that it is not a bad time to enter the stock. Industry Rank: A FB is part of the StockNews.com Internet industry, which is ranked #9 out of the 123 industries. With the looming threat of the virus, the world is turning to digital options for education, work, or communication. Gradually, people are getting accustomed to the new normal way of functioning using online platforms or tools. The significance of avoiding physical contact and practicing social distancing has sparked a digital transformation which has led to the boom of the Internet industry. Peer Grade: A FB is currently rated #5 out of 57 stocks in the Internet industry. Other popular stocks in the internet industry are Amazon, Inc. (AMZN), Alphabet, Inc. (GOOG), and Netflix Inc. (NFLX). While AMZN and NFLX beat FB by gaining 78.3% and 59.5% year-to-date, GOOG returned 19% as compared to FB’s year-to-date gain of 37.8%. Overall POWR Rating: B (Buy) Overall, FB is rated a “Buy” due to its impressive past performance, short-and-long-term bullishness, and solid price momentum, as determined by the four components of our overall POWR Rating. Bottom Line Even though FB returned 50.8% over the past year it has the potential to grow even further based on its continued business growth, favorable earnings and revenue outlook, and price momentum. Analyst sentiment, which gives a good sense of a stock’s future price movement, is pretty impressive for FB. The average broker rating of 1.24 indicates a favorable analyst sentiment. Thirty-seven out of forty-nine Wall Street analysts have a ‘Strong Buy’ rating on FB. The company’s consensus revenue estimate of $19.69 billion for the quarter ending September indicates a year-over-year increase of 11.5%. FB’s earnings surprise history looks pretty good with the company beating the consensus EPS estimates in three of the trailing four quarters. Moreover, the company’s EPS is expected to grow by 17.1% per annum over the next five years. Want More Great Investing Ideas? 7 Best ETFs for the NEXT Bull Market Will Stocks Fall into Historical September Slump? 9 “BUY THE DIP” Growth Stocks for 2020 FB shares fell $0.16 (-0.06%) in after-hours trading Tuesday. Year-to-date, FB has gained 32.11%, versus a 4.59% rise in the benchmark S&P 500 index during the same period."}]}