{"article": [{"url": "https://stocknews.com/news/cmcsa-an-entertainment-stock-showing-strength-amid-market-weakness/", "published": 1600430900.0, "headline": "An Entertainment Stock Showing Strength Amid Market Weakness", "body": "Comcast Corporation (CMCSA) is one the leading cable communications providers in the United States, with diversified business operations in internet services and theme parks. The company is recently making headlines with NBCUniversal, which is owned by Comcast, launching its premium streaming service Peacock. NBCUniversal streaming service reported a 50% rise in sign-ups to 15 million in the past six weeks. NBCUniversal aims to reach 30-35 million active users by 2024. With the gradual shift from cable to streaming platforms, CMCSA has accustomed itself to meet the current market trends, which allowed it to grow even during the economic slowdown. Its broadband internet operation has been the best performing segment in the past couple of months, allowing the company to capture a sizable market share. CMCSA CEO Brian Roberts expects to add over 500,000 new broadband customers in the ongoing quarter, which will be the highest ever in a single reporting period. Its NBCUniversal segment is also recuperating post the lockdown period, as theme parks are slowly reopening and theatre releases are rebounding. With the organized sports industry coming back after the virus driven hiatus, NBCUniversal’s sports advertising revenue is also increasing from record lows. 9 \"BUY THE DIP\" Growth Stocks For 2020CMCSA has gained 1.8% year-to-date. The company’s growth opportunities, short-and-long term bullishness, and several other factors have helped it earn a “Strong Buy” rating in our proprietary ratings system. Here’s how our proprietary POWR Ratings system evaluates CMCSA: Trade Grade: A CMCSA is currently trading above its 50-day and 200-day moving averages of $43.42 and $41.31 respectively, indicating a golden cross bullish breakout pattern. It has gained 16.2% in the past three months, which reflects an uptrend in the stock. Washington Municipality recently partnered with CMCSA to facilitate remote working for its employees during the COVID-19 crisis. CMCSA also launched a new Xfinity package for schools and universities for affordable and reliable internet services. The company added 217,000 new clients and 323,000 additional high-speed internet users in the second quarter ending June 2020. Revenue from the high-speed internet segment increased 7.2% year-over-year to $5 billion, while wireless cable communications revenue grew 33.9% from the same period last year to $326 million. Cable communications adjusted EBITDA rose 5.5% from the year-ago value to $6.18 billion. Buy & Hold Grade: A In terms of proximity to 52-week high, which is a key factor that our Buy & Hold Grade takes into account, CMCSA is well-positioned. It is currently trading just 4.7% below its 52-week high of $47.74, which it hit on January 17th. The stock has gained 23.4% in the past three years, owing to its solid earnings and revenue growth. Both revenue and diluted EPS grew at a CAGR of 7.8% over the past three years, while net income rose at a CAGR of 6.2% over the same time period. Free cash flow increased at a CAGR of 22.1% over this period. CMCSA’s diversified business portfolio has allowed the company to register unprecedented growth in the last couple of years. Peer Grade: A CMCSA is currently ranked #1 out of 14 stocks in the Entertainment – TV & Internet Providers industry. Other popular stocks in the industry are Charter Communications, Inc. (CHTR), Liberty Broadband Corporation (LBRDK) and GCI Liberty, Inc. (GLIBA). CHTR, LBRDK and GLIBA gained 27.9%, 12% and 14.3% year-to-date, respectively, surpassing CMCSA’s 3.1% return over the same time period. However, CMCSA’s high market share and diversified business model is expected to bolster its stock prices in the upcoming months. Industry Rank: B The Entertainment – TV & Providers industry ranks #5 out of 123 industries in the StockNews.com universe. The industry has gained significant traction in the past couple of months, with people adapting to staying at home for prolonged periods of time. The need for a fast yet stable internet connection, and affordable streaming platforms have become an essential for every household in this era of work-and-learn from home. With the rising cases of COVID-19 infected patients each day, people are becoming more apprehensive about attending schools/universities and offices. As such, this stay at home norm is expected to continue at least until an effective vaccine is available, fueling the industry’s demand. Overall POWR Rating: A (Strong Buy) CMCSA has a “Strong Buy” rating due to its short-and-long-term bullishness, impressive past performance, and underlying industry strength, as determined by the four components of our overall POWR Rating. Bottom Line CMCSA has the potential to gain significantly in the upcoming months, due to its continued business growth, short- and long-term bullishness and favorable analyst sentiment. Out of 32 Wall Street analysts that rated the stock, 22 rated it “Strong Buy”. The company’s EPS is expected to grow 5% per annum over the next five years. Also, CMCSA has an impressive earnings surprise history, as it beat the street EPS estimates in each of the trailing four quarters. Want More Great Investing Ideas? 7 Best ETFs for the NEXT Bull Market Stock Market Outlook: Before & After the Election Chart of the Day- See the Stocks Ready to Breakout CMCSA shares were unchanged in after-hours trading Friday. Year-to-date, CMCSA has gained 2.38%, versus a 3.79% rise in the benchmark S&P 500 index during the same period."}]}