{"article": [{"url": "https://stocknews.com/news/sdgr-onem-lmnd-nari-the-4-best-performing-ipos-in-2020/", "published": 1594987700.0, "headline": "The 4 Best Performing IPOs in 2020", "body": "An initial public offering (IPO) is the process of a private company offering shares to the public. This allows a company to raise money (or capital) from public investors. It also allows public investors to take part in the offering. The IPO provides the company an opportunity to grow and expand. While the main reason for an IPO is to raise capital, there are also other reasons for a company to consider. An IPO establishes a public value on a company that may want to be acquired at some point. It can also help a company get better credit terms due to the transparency that comes with quarterly reporting. A company can also attract better employees due to the prestige of being public. In the past year and a half we’ve seen a number of high-profile companies IPO, such as: UBER (UBER), LYFT (LYFT), Zoom Coomunications (ZM), and Moderna (MRNA). 7 Best ETFs for the NEXT Bull MarketMany IPOs have been performing very well. This is evident by looking at the Renaissance IPO ETF (IPO) which is up 31% over the past year. This ETF captures the returns from IPOs by adding them to their index at the end of their fifth day of trading and removing them after 500 trading days. Here are the 4 best performing IPOs so far in 2020: Schrondinger, Inc. (SDGR) SDGR is a material science and life sciences enterprise that focuses on developing software for computational chemistry. This software company, backed by Bill Gates and hedge fund legend David Shaw, went public earlier this year. SDGR is currently at the forefront of the fight against the coronavirus. It has partnered with Google Cloud, Takeda, Novartis, and others, to use its computational modeling systems to find a drug that can effectively target COVID-19 proteins. SDGR is disrupting traditional methods of drug discovery, which could lead to high gains for the stock in the future. In the quarter ended March 2020, the company recorded strong performance with a 26% year-over-year increase in revenue. The company also saw a 28% year-over-year increase in revenue from its software offering. SDGR has gained more than 175% since the stock started trading on February 6th. Investors’ optimism over the company’s growth potential helped the stock zoom more than 50% on its debut. 1Life Healthcare, Inc. (ONEM) ONEM runs a chain of primary healthcare clinics, supported by a proprietary mobile app. This direct primary-care provider operates membership-based medical offices in nine major markets, including New York, Chicago, and San Francisco. Due to the coronavirus pandemic, the company is expected to do well as it offers telemedicine options and virtual care. ONEM has recently announced a secondary offering of 8.3 million shares at a price that is more than double the IPO price on January 31, 2020. This could be a good indicator of the upside. The stock opened 29% higher on its debut. For the quarter ending March 2020, the company reported an admirable rise in revenue of 25% as compared to the same period last year. ONEM also saw a rise in membership of 25% year over year, taking the total membership of their services to 455,000 as of March 31st. ONEM’s stock is trading at near 52-week highs. In the mid-March crash, the stock hit its all-time low of $15.00 but gained more than 150%. ONEM has gained more than 70% since its listing. Lemonade, Inc. (LMND) Lemonade is a mobile-based insurance startup that focuses on property and casualty insurance. The company uses big data analytics and artificial intelligence to help ease the process of filing and claiming insurance. The company has also recently launched pet insurance and could see big gains from entering a mostly untapped market. The company went public on July 2nd at a higher than estimated price of $29 and skyrocketed as much as 144% on its first trading day. In terms of performance on its debut, this is the best US IPO so far this year. The stock is currently trading at more than 170% higher than its IPO price, which indicates the high expectations that investors have from this company. With the company looking at disrupting the traditional insurance business, LMND might be a good bet. Inari Medical, Inc. (NARI) NARI is a commercial-stage medical devices company that focuses on developing products to treat and transform the lives of patients suffering from venous diseases. The company has created two catheter-based mechanical thrombectomy devices that help remove large clots from blood vessels without any thrombolytic drugs. The stock soared more than 120% on its debut on May 22, 2020. In fact, NARI is currently trading at $50.53, which is more than 165% higher than its IPO price of $19. This reflects that investors are excited about the prospects of this company. The company recorded a revenue of $51.1 million in 2019, an impressive increase of around 651% from the previous year. Want More Great Investing Ideas? 9 “BUY THE DIP” Growth Stocks for 2020 Newly REVISED 2020 Stock Market Outlook 7 “Safe-Haven” Dividend Stocks for Turbulent Times SDGR shares were trading at $84.51 per share on Friday afternoon, up $5.51 (+6.97%). Year-to-date, SDGR has declined N/A%, versus a 0.90% rise in the benchmark S&P 500 index during the same period."}]}