{"article": [{"url": "https://stocknews.com/news/abt-should-you-buy-the-dip-in-abbott-laboratories/", "published": 1600258100.0, "headline": "Should You 'Buy the Dip' in Abbott Laboratories?", "body": "Abbott Laboratories (ABT) is one of the largest biotech and pharmaceutical companies in the world. Among the biopharmaceutical companies worldwide, it is ranked 6th based on market capitalization and 7th in terms of prescription sales. On August 26th, ABT launched BinaxNOW, a 15-minute COVID antigen testing kit, which is a game changer in the testing space. Priced at only $5, this portable and affordable testing solution has received Emergency Use Authorization from FDA. ABT is expected to sell 50 million units of these testing kits in the month of October. With most countries struggling to contain the spread of the virus as well as a second wave of outbreak in countries that previously flattened the curve, ABT’s kits could be very useful in quick and easy detection and thereby treatment. 7 Best ETFs for the NEXT Bull MarketThe recent dip in ABT’s prices came after it hit its 52-week high on August 28th. The stock gained 22.7% year-to-date. ABT’s growth prospects in the near term, impressive past performance and many other factors have helped it earn a “Strong Buy” rating under our proprietary rating system. Here’s how our proprietary POWR Ratings system evaluates ABT: Trade Grade: A ABT is currently trading above its 50-day and 200-day moving averages of $101.21 and $90.49, respectively, indicating an uptrend in the stock. It gained 19% in the past three months, reflecting short term bullishness of the stock. ABT’s recently launched COVID antigen testing tool with 97.1% sensitivity and 98.5% specificity for instant detection of coronavirus has been a key driver of its short-term performance. This affordable tech savvy test displays results in just 15 minutes. ABT sold $615 million worth COVID testing kits in the second quarter ended June 2020. It also started commercially supplying Libre 2 iCGM system for better control and management of diabetes, which helped the company generate net income of $537 million in the second quarter. Buy & Hold Grade: A In terms of proximity to its 52-week high, which is a key factor that our Buy & Hold Grade takes into account, ABT is well positioned. It is currently trading just 7.1% below its 52-week high of $114.20. ABT has gained 105.9% over the past three years. This is backed by its solid earnings and revenue growth during this time period. Revenue grew at a CAGR of 10% in the past three years and net income increased at a CAGR of 38.5% over this period. ABT’s diluted EPS rose at a CAGR of 38.3% over the same period. Peer Grade: A ABT is ranked #4 out of 232 stocks in the Medical – Pharmaceuticals industry. Other popular stocks in this industry are Johnson & Johnson (JNJ), Merck & Company, Inc. (MRK) and Novartis AG (NVS). JNJ, MRK and NVS returned 2.1%, negative 7.4% and negative 3.9% year-to-date respectively, which are significantly lower than ABT’s gains of 22.7% over this period. Industry Rank: B The Medical – Pharmaceuticals industry is currently ranked #5 out of 123 industries in the StockNews.com universe. With the pandemic raging across the country, the industry is currently under pressure to develop an effective vaccine for treatment and cure for coronavirus. Pharmaceutical giants such as ABT have gained popularity in the recent months for developing a quick and efficient testing kit, while many companies are currently in phase three and four of clinical trials for their vaccine candidates. With most countries still struggling to bring the pandemic under control, the national and state governments are heavily reliant on the effectiveness of this industry in the months to come. Overall POWR Rating: A (Strong Buy) Overall, ABT is rated “Strong Buy” due to short-and long-term bullishness, impressive past performance and continued business growth, which make up the four components of POWR Ratings. Bottom Line As the manufacturer of one of the most efficient COVID testing tools, ABT has favorable revenue and earnings outlook for the upcoming quarters. Out of 20 analysts that rated the stock, 13 rated it a “Strong Buy.” The consensus EPS estimate of $0.89 for the third quarter ending September 2020 indicates a 6% improvement year-over-year. The street revenue estimate of $8.48 billion indicates a 5% growth from the same period last year. Want More Great Investing Ideas? 7 Best ETFs for the NEXT Bull Market Stock Market Outlook: Before & After the Election Chart of the Day- See the Stocks Ready to Breakout ABT shares were unchanged in after-hours trading Wednesday. Year-to-date, ABT has gained 23.20%, versus a 6.35% rise in the benchmark S&P 500 index during the same period."}]}