{"article": [{"url": "https://stocknews.com/news/spy-what-does-quadruple-witching-mean-for-stocks-today/", "published": 1600430900.0, "headline": "What Does Quadruple Witching Mean for Stocks Today", "body": "Today is the quarterly event known as quadruple witching where S&P 500 (SPY) futures, options on those futures, options on individual equities, and single stock futures all expire. In the past, these ‘witching’ days have been characterized by above-average trading volume and increased volatility. But, in the current environment, those are relative terms as both have been elevated for the past few months. Still, expect some wild gyrations, especially as we head into the close today, which could carry over into Monday’s opening as positions get squared away, hedges get established and positions are rebalanced. Data suggests that there are some 90 million options contracts likely to settle in-the-money and approximately $32 billion in index rebalancing, which needs to occur. [Labor Day Sale Extended] Claim your SPECIAL One-Month $19 Trial Offer to the service that our experts ranting & raving about —the Options360 But don’t worry, it’s not as scary as it sounds. While there will likely be higher-than-normal trading volume, the ‘witching’ days tend to be less volatile than when the term was first coined some 30 years ago, and back then, it was merely a ‘triple” witch. A few reasons for the lower volatility include a staggering amount of expiration periods, a plethora of new products — such as ETFs and the addition of weekly, monthly, and quarterly option expirations — have diffused the impact of the quarterly contract rollovers. First off, we can dismiss Single Stock Futures which launched in 2002, but never really gained traction. There are just over 100 issues listed — down from over 400 10 years ago, and open interest is minimal with none having more than 6,000 contracts open. So, I think it’s safe to say this dog has too short of a tail to wag. 9 \"BUY THE DIP\" Growth Stocks For 2020This brings us back to the original, and I think a more ominous-sounding, triple witching. But, this adjustment to settlement and cessation of trading has had the starch taken out of its ability to cause unsettling volatility. It was well over a decade ago that the exchanges shifted the trading cessation of index products to occur on Thursday and created a settlement based on Friday’s opening. While it has done much to dampen some of the final hour volatility, it comes with its own quirks and complications. Here’s what you need to know: Taken from the “Chicago Mercantile Exchange (CME)” website, “The Standard & Poor’s 500 Index futures (SP) will cease trading on Thursday and then use a settlement price is the Special Opening Quotation (SOQ) of the S&P 500 Index in the morning of the third Friday of the contract month. The S&P 500 Index SOQ is calculated using the official opening prices of the index’s component stocks on that day.” To understand the Special Opening Quotation look here. CLICK HERE to capitalize on a one-month trial to the Options360 Service for just $19! Likewise, trading in SPX options also ceases Thursday and also has its own settlement value calculated similarly. But, given the acronym SET. This process is also in place for a host of other index products such as the “Russell 2000 (IWM),” the VIX, and even the Gold Volatility Index (GVZ). The reason I’ve written 100 words on these special settlements is that they can have a very wide price differential from both Thursday’s closing price and the “real” opening price of the index on Friday morning. For example, August’s expiration SET was 285.70 while the official opening print in the S&P was 290.30, a five-point difference that determines whether an option will be in-the-money or not. So, in essence, the market opened unchanged but the options were settled on a price five points lower. This is not an unusual occurrence and there have been numerous times over the years that the SET and SAQ have posted a price nearly 1% deviation from the Thursday close, and the “official” Friday opening. The take-away is that if you’re trading index options, S&P VIX or others, be very careful not to assume based on Thursday’s close that anything will be worthless or of value come Friday. An added twist to this is that yesterday was the quarterly ex-dividend for the “SPDR Trust (SPY)”, meaning if you wanted to collect the $1.13 per share, you needed to be an owner of the record at yesterday’s close. In other words, those that were long in-the-money calls would be exercising their options a day before expiration. Many short those calls were aware, and to avoid being assigned covered or bought shares right at the close. Bring in the ETFs, Weeklies, Monthlies, Quarterlies… Oh My A bigger factor in the dampening of the witching effect is the explosion of new products and the expansion of expirations offered. We’re all pretty familiar with the success of the major index products such as the SPY, iShares Russell 2000 IWM, and some of the sub-sector ETFs. The volume and open interest on these products, even when adjusted for the 1/10th notional value, is nearly equal to the major index products. Now, both futures and these ETFs have options listed with weekly, monthly, and quarterly expirations and there’s a further diffusion of the witching hour. In fact, many money managers, and increasingly, individual investors, have realized it makes sense to start rolling positions on Wednesday prior to expiration to avoid such quirks. And this in itself has helped dampen the Friday effect. The upshot is that quarterly witching days can cause swift gyrations, especially near the close. But, they shouldn’t be too scary. CLICK HERE to take advantage of Options 360 for the monthly trial price of just $19! Want More Great Investing Ideas? 7 Best ETFs for the NEXT Bull Market Stock Market Outlook: Before & After the Election Chart of the Day- See the Stocks Ready to Breakout SPY shares were trading at $333.24 per share on Friday afternoon, down $2.60 (-0.77%). Year-to-date, SPY has gained 4.60%, versus a % rise in the benchmark S&P 500 index during the same period."}]}