{"article": [{"url": "https://stocknews.com/news/dkng-penn-byd-3-gambling-stocks-on-a-winning-streak/", "published": 1600171700.0, "headline": "3 Gambling Stocks on a Winning Streak", "body": "Now that the economy is gradually getting back on track, Americans are gambling more especially as casinos reopen and lives sports have restarted. Even prior to the pandemic, the number of gambling options has exploded. &nbsp Whereas before, you had to go to Atlantic City or Las Vegas, now you can gamble on your phone, and most states have casinos as well. In hindsight, it’s clear that the dip in gambling stocks was a buying opportunity as some gambling stocks are already above their pre-COVID levels. &nbsp The following three stocks are worthy of closer analysis as Americans return to the casinos and turn on their TVs to take in all the sporting action: DraftKings (DKNG), Penn National Gaming (PENN), and Boyd Gaming (BYD). 9 \"BUY THE DIP\" Growth Stocks For 2020DraftKings (DKNG) Turn on your TV to watch sports this weekend and you are nearly guaranteed to catch an ad touting the fantasy sports opportunities provided by DKNG. DKNG offerings are considered games of skill rather than chance as the best fantasy players invest considerable time researching matchups, similar to how investors study stocks. DKNG recently inked deals with Michael Jordan and ESPN. The stock has A grades in the Trade Grade and Peer Grade POWR Components. Furthermore, DKNG has a B grade in the Buy & Hold Grade Component. Out of nearly two-dozen Entertainment – Casinos/Gambling stocks, DKNG is ranked first. Of the 14 analysts who have studied DKNG, 9 rate it as a Buy and 5 rate it as a Hold. No analysts advise selling DKNG. The sky is the limit for DKNG. As long as the top sports leagues are willing to play in bubble-like atmospheres until the pandemic ends, DKNG will thrive. This stock belongs in your portfolio for the next year as well as the next decade. Look for DKNG to hit $60 by year’s end. Penn National Gaming (PENN) Video gaming, horse racing, and lotteries are as American as apple pie. PENN specializes in each of these forms of gambling. Though there was some concern regarding PENN properties’ operations amidst the pandemic, casinos across the nation are now reopening, albeit at partial capacity in some cases. The POWR Ratings show PENN has A grades in its Trade Grade and Peer Grade POWR Components along with a B grade in its Buy & Hold POWR Component. PENN is only ranked behind DKNG in the Entertainment – Casinos/Gambling space. PENN has moved well beyond its COVID dip down to $6. The stock is rapidly ascending toward the $65 mark. PENN recently teamed up with Barstool Sports to provide web-based gambling. Wall Street is bullish on PENN to the point that Rosenblatt Securities has set a price target of $80 per share. Online gambling will be embraced by governments far and wide in the years ahead as states attempt to make up for their shortfall in funding resulting from the coronavirus pandemic. Now that PENN can rake in the cash both on and offline, investors have no reason to bypass this nearly flawless gaming stock. PENN is undoubtedly a solid play in both the short and long-term. Boyd Gaming (BYD) Gaming properties have struggled during the pandemic yet there is plenty of pent-up demand for gambling sure to help the likes of BYD bounce back surprisingly quickly. BYD properties are located in Nevada, Pennsylvania, Ohio, Missouri, and several other states. BYD owns nearly 30 properties, many of which have luxurious hotel and dining accommodations. However, one-quarter of BYD revenue stems from Las Vegas locals, a group and area particularly hard hit by the pandemic. The POWR Ratings show BYD has B grades in its Trade Grade and Peer Grade POWR Components. BYD is ranked 4th of 22 stocks in the Entertainment – Casinos/Gambling category. The top analysts have set a price target of $30 for BYD, indicating it has a 3% upside. Though BYD has not returned to its pre-COVID trading price of $35, the stock is gradually making its way back to the $30 level. Look for BYD to break through the $30 benchmark in the weeks ahead as long as casinos continue to gradually increase capacity. Want More Great Investing Ideas? 7 Best ETFs for the NEXT Bull Market Is the Stock Market Correction Over? Chart of the Day- See the Stocks Ready to Breakout DKNG shares were trading at $48.82 per share on Tuesday morning, up $0.20 (+0.41%). Year-to-date, DKNG has gained 356.26%, versus a 7.20% rise in the benchmark S&P 500 index during the same period."}]}