{"article": [{"url": "https://stocknews.com/news/jpm-frc-bac-pnc-are-shares-of-jpmorgan-a-bargain-at-this-price/", "published": 1599739700.0, "headline": "Are Shares of JPMorgan a Bargain at this Price?", "body": "JPMorgan Chase & Co. (JPM) is a leading global financial services firm with assets of $3.2 trillion. It operates under four segments – Consumer & Community Banking (CCB), Corporate & Investment Bank (CIB), Commercial Banking (CB), and Asset & Wealth Management (AWM). Although banks have been one of the weaker sectors this year, JPM is one of the best performing banks with record growth in revenues across diversified sources. In the second quarter ended June 2020, revenue increased 14.7% year-over-year to $32.98 billion while the EPS declined 51% year-over-year. The decline in EPS is primarily a result of low-interest income due to the low-interest-rate environment. However, the company managed to set aside $10.5 billion as provisions to cover credit losses. Despite the robust growth in its global business model, the stock lost 27% year-to-date due to the historically low-interest rates and reduced financial activities amid the pandemic. Based on several factors JPM has a “Neutral” rating in our proprietary rating system. 7 Best ETFs for the NEXT Bull MarketHere is how our proprietary POWR Ratings system evaluates JPM: Trade Grade: C JPM is currently trading higher than its 50-day moving average of $98.47 but below its 200-day moving average of $109.28. The stock’s 1.5% return over the past one month reflects a short-term bullishness. Average deposits in the last reported quarter grew 25% year-over-year to $1.9 trillion compared to the 4% year-over-year increase in average loans to $998 billion. JPM reported $14 billion as net interest income compared to the year-ago net interest loss of $0.6 billion. Moreover, the company expects net interest income for the current year to be $56 billion. Buy & Hold Grade: C In terms of proximity to its 52-week high, which is a key factor that our Buy & Hold Grade takes into account, JPM is not positioned favorably. The stock is currently trading 28.5% below its 52-week high of $141.1. Looking at the past three years, the stock has grown more than 22% due to its aggressive provisioning, steady growth in deposit rates, and diversified global business model. In the second-quarter earnings report, JPM mentioned, “We ended the quarter with massive loss-absorbing capacity – over $34 billion of credit reserves and total liquidity resources of $1.5 trillion, …with significant earnings power that would allow us to absorb even more credit reserves if needed. This is why we can continue to serve all of our stakeholders and to pay our dividend…” Peer Grade: A JPM is currently rated #2 out of 10 stocks in the Money Center Banks industry. Other popular stocks in the group are First Republic Bank (FRC), Bank of America Corporation (BAC), and PNC Financial Services Group, Inc. (PNC). While JPM lost more than 27% year-to-date, FRC lost 6.8% over this period. On the other hand, BAC and PNC lost 27.6% and 31.2%, respectively, over this period. Industry Rank: D The Money Center Banks Stocks industry is ranked #76 out of the 123 StockNews.com industries. Financials are the second-worst performing sector this year and the industry is still struggling to climb back from the coronavirus sell-off. As long as the long-term rates stay stationary, the industry will moderately move up. However, the sector will recover strongly as the interest rates start moving up. Overall POWR Rating: C (Neutral) Overall, JPM is rated a “Neutral” primarily due to the sluggishness in the industry, lack of price gains, and other factors as determined by the four components of our overall POWR Rating. Bottom Line Despite generating a negative return of 27% so far this year, JPM is one of the best managed and financially sound banks. It performed well in the pandemic and has the potential to grow further based on its earnings growth. JPM is also operating under the new Expected Credit Losses (CECL) accounting policy like all other banks but its ability to cover nearly 3% losses of its total loan book through a total provision of $34 billion sets it apart from other banks. Analyst sentiment, which gives a good sense of a stock’s future price movement, is pretty impressive for JPM. The average broker rating of 1.39 indicates a favorable analyst sentiment. Of the 27 Wall Street Analysts that rated the stock, 17 have given it a “Strong Buy” rating. The street estimates EPS to grow 53.4% next year and hence, JPM is a good bargain at the current price. Want More Great Investing Ideas? 7 Best ETFs for the NEXT Bull Market Will Stocks Fall into Historical September Slump? 9 “BUY THE DIP” Growth Stocks for 2020 JPM shares were trading at $100.10 per share on Thursday afternoon, down $0.77 (-0.76%). Year-to-date, JPM has declined -26.27%, versus a 5.04% rise in the benchmark S&P 500 index during the same period."}]}