{"article": [{"url": "https://stocknews.com/news/vnq-srvr-inds-rez-adc-gty-els-egp-fr-pld-iipr-7-reits-that-belong-in-your-portfolio/", "published": 1594296500.0, "headline": "7 REITs That Belong in Your Portfolio", "body": "Lockdowns have been tough on real estate investment trusts (REITs). When April 1 hit, the rent stopped getting paid across the world. That’s of course bad for landlords and, in turn, REITs and their investors. Now it hasn’t been all bad since then. Sure, old school retail and shopping malls are done—but we knew that already. Check this out—it’s the rent collected by the REIT sector for April, May and June. All of our newly completed “shutdown” and “re-opening” and “just kidding, we’re closing again” months. Would you believe that apartment landlords collected 97.5% of their typical rents in June? 7 Best ETFs for the NEXT Bull Market (Source: Nareit) Yes you read that right. Rent collections for apartments were higher than offices, free-standing retail, even healthcare properties. REIT price action also helps paint a more accurate picture—if we look past the popular Vanguard Real Estate ETF (VNQ), and toward smaller chunks of the market. And only if we understand what that price action is trying to tell us. This Is What Real Estate Really Looks Like Here you have Pacer’s Benchmark Data & Infrastructure Real Estate SCTR ETF (SRVR) and its Benchmark Industrial Real Estate SCTR ETF (INDS), as well as the iShares Residential Real Estate ETF (REZ). And what you see is actually roughly what you’d expect: Residential REITs are still lagging hard on worries about a dampened ability to raise rents and the fear of rents going unpaid Industrial REITs have faced logistical issues and some slowdowns, though they clearly play a role in maintaining stay-at-home habits And data-center REITs have been all the rage as companies fortify their remote-work capabilities. But this chart doesn’t just tell us what investors have and haven’t been confident in. It gives us a few hints about what to look for as we start to allocate new funds. For instance, high-quality residential REITs might be well off their highs right now, offering both value and slightly elevated yields. And data center plays? They might be ideally situated for the future, but they also might be overpriced and underpaying investors at current levels. Let me show you what I mean. I’m going to highlight seven REITs yielding between 2.1% and 5.0% right now. I view each and every one of these real estate plays as upper-tier operators that belong in an income portfolio at some point. But while the moment is right for some, others need time to ripen. Retail REITs Let’s start with Agree Realty (ADC, 3.6% yield), a net-lease retail REIT that owns 868 properties in 46 states. Again, I wince at the mention of “retail,” but Agree Realty is holding its own much better than its peers. It recently reported collecting 91% of April rents, and 88% for May and June—all far better than the retail average. Liquidity is strong at $148 million in cash, and it hasn’t touched its $500 million credit revolver. Better still, it announced a 2.6% dividend hike in May, extending a long string of semiannual payout increases. It’s expensive at 22 times 2020 AFFO estimates…but then, a lot of REITs are going to look pricey thanks to lowered expectations this year. Looking out to a more normalized 2021, ADC trades closer to 19x, which isn’t cheap, but certainly more reasonable. Getty Realty (GTY, 5.0% yield) is retail, but of a much different sort: gas stations and convenience stores. It owns, leases and provides financing to roughly 950 properties in 35 states and Washington, D.C., under brands such as Exxon Mobil (XOM), BP (BP) and Valero (VLO). Yes, those oil stocks have been slammed. Getty has too, and even after rebounding remains down 10% year-to-date. But this baby went out with the bathwater. The REIT has a 99% occupancy rate, and its AFFO is expected to continue a modest but steady climb this year and several years out. Why not? Gas stations might be selling less gas in the short term, but they’ve also acted as essential retailers in the pandemic, and the rents are still getting paid. Investors have a decent deal on their hands here. GTY yields a cool 5% on a payout that has grown 50% over the past four years. And shares trade at 16 times this year’s expected AFFO. Residential REITs Equity LifeStyle Properties (ELS, 2.1% yield) is an exciting dividend grower in the decidedly unexciting real estate business of manufactured-home communities. Payouts have shot up 83% over the past five years, and investors have been treated to a 2-for-1 stock split as well—its price was just running too darn hot. Equity LifeStyle Properties (ELS) “Follows the Dividend” The company’s collection update in June leaves little to worry about. RV collections were at 97.6% in the May quarter-to-date versus 98.6% in the year-ago quarter. For RVs, it was 97.7% versus 98.6%. COVID impact? Yes, but so far, it looks minimal. But it’s pricey. The trough was investors’ best chance in years to buy ELS at a discount. Even if Equity LifeStyle gets through the year with FFO similar to Q1, shares trade at nearly 27 times FFO, and the payout is barely above 2%. The flip side? It might continue to be a growth play as people are forced to downsize in the recession—but you’ll have to pay dearly for that growth. Industrial REITs Industrial properties have been among the most attractive corners of the real estate market for years. Mid-cap EastGroup Properties (EGP, 2.5% yield) is a regional industrial REIT mostly operating in the Sun Belt, from California to North Carolina, with most of the portfolio composed of business distribution buildings. That Sun Belt concentration is a boon to growth, and dividend-safety fans will love an extremely conservative FFO payout ratio below 60% for the past four years. It’s pushing things from a valuation standpoint, though, at 22.7 times this year’s FFO and a flat 22 times 2021. A dip would be ideal here, but not vital if you’re enticed by its geographical advantage. Then there’s First Industrial Realty Trust (FR), which I highlighted in April as a “backdoor play” on e-commerce. Its 100-plus properties are concentrated in eight major U.S. markets (think: NYC, Chicago, Silicon Valley) with high barriers to entry. First Realty has scorched the VNQ since then, returning more than 12% in a little more than two months. But it too is pushing the upper limits at nearly 23 times next year’s FFO projections. There’s no such ambiguity for Prologis (PLD, 2.4% yield), which is actually up about 7% this year and is priced for perfection: 30 times its 2020 FFO estimates, and 29 times 2021 targets. Prologis is a first-rate operator, and in fact is the largest industrial REIT in the world. It’s able to borrow at extremely low rates, and its balance sheet will let you rest easy at night. But it’s difficult to buy any stock at such frothy levels without handicapping your own upside. Even High-Quality Stocks Like PLD Go On Sale Every Now and Then “Other” REITs Innovative Industrial Properties (IIPR, 4.6%) isn’t your dad’s real estate investment trust. IIPR is a pioneer in the marijuana business, leasing out more than 40 specialized industrial and greenhouse buildings in 15 states to licensed medical-use cannabis growers. Its primary business is a sale-leaseback model in which it acquires land from cannabis companies that need upfront cash to bolster their operations, then lease them back through net-lease agreements. The marijuana industry might be oozing with potential, but ask solar longs how long it takes some bull cases to play out. The Marijuana Growth Story Is Missing a Few Pages And even in cannabis, price still matters. The last time I looked at IIPR, in August 2019, the company had simply outkicked its coverage and was wildly extended at a whopping 54.7 times FFO. That has come back to earth somewhat, at 31x, but things get really interesting when you look into Wall Street’s crystal ball. The pros see FFO rocketing 76% to $5.19 per share. At that rate, IIPR is trading at just 18 times estimates. And another 46% jump to $7.57 in 2021 works out to a 12x multiple. If Innovative Industrial Properties can live up to those growth prospects, the stock might be downright cheap at these levels. But given the state of the industry right now, that’s an “if” that deserves some consideration. Want More Great Investing Ideas? Your Early Retirement Portfolio: 7.7% Dividends—Every Month—Forever How to Retire on 10% Dividends Paid Monthly The Simple (and Safe) Way to Earn 15% Every Year from Stocks VNQ shares were trading at $76.87 per share on Thursday morning, down $1.50 (-1.91%). Year-to-date, VNQ has declined -15.68%, versus a -2.31% rise in the benchmark S&P 500 index during the same period."}]}