{"article": [{"url": "https://stocknews.com/news/cost-sfm-dg-lulu-4-best-retail-stocks-in-expansion-mode/", "published": 1597925300.0, "headline": "4 Best Retail Stocks in EXPANSION Mode", "body": "Physical retail has been struggling over the last decade. Part of the issue has been increasing competition from e-commerce. Another factor has been that many retail chains were geared towards the middle-class which has been shrinking. Despite the struggles of the industry, some retailers are still increasing sales and looking to add locations. I thought it’d be interesting to check in on them to see how they are faring. Remarkably, these places are still continuing to grow despite the coronavirus and haven’t altered their expansion plans. 7 Best ETFs for the NEXT Bull MarketThey are also among the few retail stocks which are making new highs. Costco Wholesale Corporation (COST), Dollar General Corporation (DG), Lululemon Athletica, Inc. (LULU), Sprouts Farmers Market, Inc. (SFM) are four retail stocks which are looking to add more locations in the coming years. Costco Wholesale Corporation (COST) As one of the biggest wholesale chains in the world, COST has operations in over 8 countries. COST is soaring amidst the pandemic, due to its sound business model and expansion efforts. The company managed to keep all 788 of its warehouses operational even during the lockdown period. COST’s operating income grew 5% and its e-commerce sales were up 32.3% year over year for the third quarter ended May 2020. COST has a relatively higher growth potential compared to other retail chains because of its global presence. It is currently expanding the business to 2 major cities in China, thereby tapping a vast market of over 1.8 billion people. COST’s sales grew 14.1% year-over-year to $13.04 billion in July alone. Comparable e-commerce sales grew 76.1% from its year-ago value during this time. The consensus EPS estimate of $2.77 for the fourth quarter ending August 2020 indicates an 8% increase year-over-year. Moreover, the company managed to surpass the consensus EPS estimates in three of the trailing four quarters, which is impressive. The consensus revenue estimate of $51.82 billion indicates a 9.1% rise from the year-ago value. COST gained more than 25% to hit its 52-week high of $345.12 in August since hitting its 52-week low of $271.28 in March. How does COST stack up for the POWR Ratings? A for Trade Grade A for Buy & Hold Grade B for Peer Rank A for Industry Rank A for Overall POWR Rating. You can’t ask for better. It is also ranked #2 out of 18 stocks in the Grocery/ Big Box Retailers industry. Dollar General Corporation (DG) DG is a discount retailer of a selection of merchandise, including consumables, seasonal goods, and home products and apparel. It is present in 45 states across the southern, midwestern, southwestern, and eastern regions of the country. Known for affordable prices, DG’s business operations skyrocketed during the crisis. As the unemployment in the United States reached record highs, DG’s cheap aggressive pricing strategy attracted more customers, creating a higher volume of business. For the first quarter ended in May 2020, net sales increased 27.6% year-over-year to $8.40 billion. Operating profit of $866.80 improved 69.2% from the year-ago value. Net Income increased by 68.8% to $650 million during this time. Analysts expect this growth momentum to continue well into the second quarter ended in August 2020. The consensus revenue estimate of $8.31 billion for the second quarter indicates a 19% rise year-over-year. The consensus EPS estimate of $2.41 indicates a 38.5% growth from the year-ago value. Moreover, DG has an impressive earnings surprise history, as it surpasses the street EPS estimates in each of the trailing four quarters. On August 5th, DG announced the expansion of its distribution center presence to build a sustainable supply chain network. DG plans to build two new distribution centers and 18 cold storage facilities in select states across the country. DG hit its 52-week low of $125 in march due to the virus-driven market crash. It gained more than 60% since then, hitting its 52-week high of $202.28 in mid-August. DG’s strong fundamentals are reflected in its POWR Ratings. It is rated “Strong Buy” in our POWR Ratings system, with an “A” in Trade Grade, Buy & Hold Grade, and Industry Rank. In the 18-stock Grocery/ Big Box Retailers industry, DG is ranked #4. Lululemon Athletica, Inc. (LULU) LULU designs, develops, and sells athletic apparel and accessories in North America, Asia, Europe, and Australia. It operates through two segments – Company-operated stores and direct to consumer sales. To benefit from the “stay at home” norm, LULU acquired Home Fitness MIRROR, an interactive workout platform featuring live and on-demand classes, for $500 million. LULU plans to fuel its ‘Power of Three’ growth plan through this acquisition. The global lockdown put a damper on LULU’s business operations throughout the first quarter, as most of the company’s stores were closed during the initial months of the quarter ended May 2020. The loss incurred due to closed company stores was partially offset by a 68% year-over-year increase in direct to customer sales. E-commerce revenue of $352 million increased by 67.7% from the year-ago value. As digital sales dominated the markets throughout the first quarter, e-commerce revenue accounted for 54% of the total revenue, as compared to 26.8% for the same period last year. With the gradual recovery of the world economy from this healthcare crisis and the rising demand for at-home work out products and accessories, LULU is expected to perform well over the next couple of years. LULU’s EPS is expected to grow at 16.1% per annum over the next five years. Moreover, LULU beat street EPS estimates in three out of trailing four quarters, which is impressive. LULU gained more than 180% since hitting its 52-week low of $128.85 in March to hit its 52-week high of $364.89 in August. LULU is rated a “Strong Buy” in our POWR Ratings system, consistent with its sound business model and growth potential in the upcoming years. It has an “A” in Trade Grade, Buy & Hold Grade and Peer Grade, and “B” in Industry Rank. It is also ranked #2 out of 65 in the Fashion & Luxury industry. Sprouts Farmers Market, Inc. (SFM) SFM operates healthy grocery stores specializing in fresh, organic, and natural food items. It provides both wholesale and retail services selling groceries, fresh food, meat, deli, vitamins, supplements, and other household products. As more and more people are shifting towards organic food to build immunity amid this health crisis, SFM witnessed a strong second-quarter performance. Net sales increased 16% year-over-year to $1.6 billion, while comparable same-store sales grew 9.1% during the same period. Net income grew 91.4% from its year-ago value to $67 million. SFM’s gross profit margin increased by 4.5% year-over-year to 37.3%. Gross profit of $613 million increased 32% year-over-year. The consensus EPS estimate of $0.37 for the third quarter indicates a 68.1% increase year-over-year. Moreover, SFM beat the street EPS estimates in each of the trailing four quarters, which is impressive. The consensus revenue estimate of $1.62 billion for the quarter ended September 2020 indicates a 12.8% improvement from its year-ago value. SFM gained more than 115% to hit its 52-week high in July since hitting its 52-week low of $13 in March. According to our POWR Ratings, SFM has an “A” in Industry Rank and a “B” in Buy & Hold Grade. It is also ranked #15 out of 18 stocks in the Grocery/ Big Box Retailers industry. Want More Great Investing Ideas? The Best of StockNews 2 Step Process to Sell @ Market Top in September 9 “BUY THE DIP” Growth Stocks for 2020 COST shares were trading at $339.43 per share on Thursday afternoon, down $1.47 (-0.43%). Year-to-date, COST has gained 16.24%, versus a 5.97% rise in the benchmark S&P 500 index during the same period."}]}