{"article": [{"url": "https://stocknews.com/news/baba-cat-eem-vale-meli-now-is-an-opportune-time-to-buy-these-3-emerging/", "published": 1599912500.0, "headline": "Now is an Opportune Time to Buy These 3 Emerging Market Stocks", "body": "Historically, emerging markets have outperformed developed markets. However, they’ve actually underperformed for the last 12 years. (source: MSCI) 9 \"BUY THE DIP\" Growth Stocks For 2020The primary reasons for underperformance were overvaluation, weakness in global growth, and the strong dollar. Over the last 4 years, this trend continued as emerging markets were flat, while the S&P 500 is 50% higher. There are a number of different ways that investors can get exposure to emerging markets. They can buy high-quality companies doing business in these regions, country-specific ETFs, or an emerging markets ETF. The iShares MSCI Emerging Markets Fund (EEM) is an ETF that tracks the emerging markets index. Emerging Markets’ Long-Term Outperformance Some reasons that emerging markets have historically outperformed are that they have higher growth rates, younger populations, and are the beneficiaries of globalization. Globalization, increased connectivity, and the rise of remote work have transformed the business landscape and opened up all types of opportunities to people all over the world. As a result, people and businesses in emerging markets can compete for work that was once only available in developed markets. On a more macro, long-term level, the chart from the IMF below shows that economic activity is shifting towards emerging markets. Currently, emerging markets have 60% of the world’s population but only 12% of the world’s global public equities. Catalysts Over the next decade, emerging markets will likely outperform. The major catalysts are attractive valuations, a weak dollar, and an acceleration in global growth. In terms of valuation, emerging markets have a price-to-earnings ratio of 15, while the S&P 500 has the most expensive valuation at any time in history other than the dotcom bubble. The chart below, from GMO, shows that valuations on a relative basis are the cheapest in history. (Source: GMO) It’s every investors’ dream to buy an asset with strong, intrinsic growth at a discount. Emerging markets are providing such an opportunity. Another supportive factor is that the dollar has significantly weakened in recent months. The dollar is trading at multi-year lows, following the Fed’s aggressive interest-rate cuts. And this trend is likely to persist as the Fed has pivoted to an extreme-dovish stance by raising the threshold at which it will consider hiking rates. The federal government’s deficit is also expected to exceed $2 trillion this year, and it’s willing to spend more if the economy shows further signs of deteriorating. This combination of rock-bottom rates and high deficits is bearish for the US dollar. Additionally, more evidence continues to pile up that global growth is going to surprise to the upside. We are seeing strength in cyclical commodities like lumber, iron ore, and copper prices. Stocks connected to global growth like Caterpillar (CAT) and Deere (DE) are making or close to new, all-time highs. Economic data has been pretty resilient despite the coronavirus. Governments, all over the world, have aggressively enacted fiscal stimulus which will boost aggregate demand. So much of global growth is linked to manufacturing, and it’s been weak since 2018. The chart above shows the ISM – New Orders Index which is sharply rising, however, inventories are at multi-year lows. This type of inventory restocking cycle will be a potent tailwind for global growth. 3 Emerging Market Stocks Emerging markets have lower valuations but more upside than developed markets. We see the same dynamic in many of the equities. Usually, higher growth potential means higher valuations. Investors should take advantage of this anomaly. Alibaba (BABA), Mercadolibre (MELI), and Vale (VALE) are three of the highest-quality emerging market stocks. Alibaba (BABA) Alibaba’s original business was an e-commerce platform, in which it helped Chinese businesses sell to other businesses. From these humble beginnings, it’s become a juggernaut and is now the leading e-commerce and cloud computing company in Asia. It also has a significant market share in other industries like fintech, logistics, AI, and food delivery. BABA beat estimates for the top and bottom-line in the first quarter and raised guidance above expectations. The most impressive was Alibaba’s cloud segment reporting 62% growth which was better than US-based cloud companies. Revenues increased by 34% to $21.76 billion. Mobile monthly active users increased by 3.3% quarter-over-quarter to 874 million. Income from operations increased 43% from the year-ago value to $4.91 billion, while adjusted EBITDA rose 30% during the same time to $7.22 billion. Non-GAAP net income rose 28% from the same period last year to $5.58 billion. Its net cash from operating activities increased 48% year-over-year to $7.09 billion. The company expects to grow earnings by 15% over the next 12 months and revenue by more than 40%. Given its dominance in a variety of segments and exposure to Asian countries, it’s going to be one of the biggest winners of emerging market outperformance. How does BABA stack up for the POWR Ratings? A for Trade Grade A for Buy & Hold Grade A for Peer Grade B for Industry Rank A for Overall POWR Rating. You can’t ask for better. It is also ranked #1 out of 115 stocks in the China industry. Mercadolibre (MELI) MELI is the largest e-commerce and fintech company in Latin America, operating in 18 different countries. While stock markets in that part of the world have been flat over the last decade, MELI has been a big winner with a more than 1,000% gain. MELI has been focused on growth rather than earnings over its history. It continues to exceed expectations, as it’s growing sales more than 60% on a year over year basis. About 60% of the company’s revenues come from its e-commerce platform with 30% coming from fintech. Another growing part of its business is helping small businesses sell online. The POWR Ratings are also constructive on MELI as it’s rated a Buy. It has an “A” for Industry Rank with a “B” for Trade Grade and Peer Grade. Among Internet stocks, it’s ranked 7th out of 57. Vale (VALE) Commodity stocks have underperformed along with emerging markets over the last few years. However, there are some good reasons to expect a turnaround. Valuations and sentiment are at rock-bottom. COVID-19 has resulted in record-amounts of fiscal stimulus, and a large chunk will go into infrastructure projects. The low prices of the last few years have led to production cuts and a drop in Capex which means that supply will be constricted in the next few years. VALE is one of the world’s leading producers of iron ore and other industrial metals. Iron ore prices are already higher than pre-coronavirus levels. VALE is also the world’s largest producer of nickel. Nickel prices are expected to rise given the key role they play in batteries that will be required for electric cars and solar energy. The stock is also very cheap with a forward price to earnings ratio of 6 and a dividend yield of 4.5%. The last time that iron ore prices were at current levels, Vale’s stock price was 50% higher. Want More Great Investing Ideas? 7 Best ETFs for the NEXT Bull Market Will Stocks Fall into Historical September Slump? 9 “BUY THE DIP” Growth Stocks for 2020 BABA shares closed at $271.61 on Friday, up $4.06 (+1.52%). Year-to-date, BABA has gained 28.06%, versus a 4.86% rise in the benchmark S&P 500 index during the same period."}]}