{"article": [{"url": "https://stocknews.com/news/jill-mark-aprn-3-vulnerable-retailers-to-avoid-like-the-plague/", "published": 1598616500.0, "headline": "3 Vulnerable Retailers to Avoid Like the Plague", "body": "The pandemic has forced most businesses, particularly retailers, to cease or reduce their operations, leading to lower revenues and bleak growth projections for the near future. With no definitive assurance from vaccine developers yet, the situation is expected to worsen further. Last month, the International Monetary Fund had predicted a deeper global recession in 2020 and a slower recovery in 2021. The fund expects global output to decline 4.9% in 2020. As such, it is difficult for small and mid-cap retailers with limited financial backing to stay afloat for such an extended period. That’s because these companies could not modify their business models to adapt to and survive to the “new normal.” Moreover, the consumer confidence has dropped to a six-year low in August, which will deal another blow to these retailers. J.Jill, Inc. (JILL), Remark Holdings, Inc. (MARK), and Blue Apron Holdings, Inc. (APRN) are four such retail stocks that delivered disappointing results in their last reported quarter, and have bleak growth projections. 9 \"BUY THE DIP\" Growth Stocks For 2020J.Jill, Inc. (JILL) JILL is an integrated omnichannel platform which sells women’s apparel, shoes, and accessories through retail stores and online platforms. The company is in troubled waters, as it entered into forbearance agreements in June to extend the deadline for payments to its lenders till August. With the pandemic causing a significant slowdown in business, JILL’s first-quarter reports were far from satisfactory. Net sales declined 48.4% year-over-year to $91 million, while gross profit fell 56.8% to $50.20 million. JILL incurred a loss from operations of $89.70 million, compared to a profit of $10.80 million in the prior-year quarter. JILL reported a net loss of $70.30 million in the quarter, compared to net income of $4.40 million in the year-ago quarter. JILL plans to close 11 stores in, which would likely reduce its net revenues even further. Analysts have a bearish outlook for the stock, with a negative consensus EPS estimate for the second quarter. Moreover, JILL’s EPS is expected to decline 45.5% per year over the next five years. JILL has lost more than 60% year-to-date, and hit its 52-week low of $0.31 in April. JILL’s poor prospects are also apparent in our POWR Ratings, which gives it a Strong Sell rating. It also has a grade of F for Trade Grade and Buy & Hold Grade, and a D for Peer Grade. The stock is ranked #55 out of 65 stocks in the Fashion & Luxury industry. Remark Holdings, Inc. (MARK) MARK develops and sells artificial intelligence (AI) based products and solutions for business and industry use worldwide. Its proprietary data intelligence platform KanKan provides AI-based vision products, software-as-a-service (SAAS) for retail businesses, and computing devices. Despite the strong performance of the technology sector during the pandemic, MARK’s disappointing second-quarter reports make it a weak stock. MARK’s revenues fell 20.6% from the prior-year quarter to $2.30 million. Operating loss fell to $9.8million from a loss of $1.3 million during the same period last year. MARK’s EPS for the quarter was -$0.11, missing the street estimates by 120%. Consensus EPS estimates for the third quarter ending September 2020 is -$0.04. MARK’s POWR Ratings are consistent with this bleak outlook. It has an overall rating of Sell and a grade of F for Trade Grade and Buy & Hold Grade, and a grade of D for Peer Grade. Within the Internet industry, it’s ranked #45 out of 57 stocks. Blue Apron Holdings, Inc. (APRN) APRN is a direct-to-consumer platform providing recipes and fresh and seasonal ingredients for home cooking. Its e-commerce platform Blue Apron market sells cooking tools, utensils, and pantry items among other products. APRN also services direct-to-consumer wine delivery service under Blue Apron Wine. Since the onset of coronavirus, eating out has become less popular among the masses, due to fear of catching the virus. Despite APRN’s strong performance in the second quarter, APRN has a bleak projected outlook, as the industry is adversely affected by the health crisis. The consensus EPS estimate for the third quarter, ending September 2020, is negative. Furthermore, the company missed the street estimates in three out of trailing four quarters. On August 5th, APRN announced its plans to raise $37 million in equity through a public offering of 4 million Class A shares, priced at $9.25 per share. However, this news failed to garner investor confidence and the share price kept on falling after this announcement. APRN hit its 52-week low of $2.01 on March 13th, and gained more than 865% in just 5 days to hit its year-to-date high of $19.49 on March 19th. However, the strong momentum didn’t last long, as APRN has lost more than 75% since then. According to the POWR Ratings, APRN is rated a Sell. It also has a grade of F for Trade Grade and Buy & Hold Grade and a grade of D for Peer Grade. It’s ranked #46 out of 57 stocks in the Internet industry. Want More Great Investing Ideas? 7 Best ETFs for the NEXT Bull Market Why Stocks Could Drop 20% in September? 9 “BUY THE DIP” Growth Stocks for 2020 JILL shares were trading at $0.41 per share on Friday afternoon, down $0.01 (-2.26%). Year-to-date, JILL has declined -63.72%, versus a 9.67% rise in the benchmark S&P 500 index during the same period."}]}