{"article": [{"url": "https://stocknews.com/news/mlco-wynn-mxim-cf-sjr-top-5-large-cap-dividend-stocks-for-july-13-2020/", "published": 1594642100.0, "headline": "Top 5 Large Cap Dividend Stocks for July 13, 2020", "body": "The top winners in the large cap US dividend space for Monday, July 13, 2020 are MLCO, WYNN, MXIM, CF, and SJR. Below is a recap of how they fared. Melco Resorts & Entertainment LTD (MLCO) Daily Price Recap Melco Resorts & Entertainment LTD came into today up 16.21% ($2.53) from the open of the previous day, marking the 2nd day in a row an upward move has occurred. The price move occurred on stronger volume; specifically, yesterday’s volume was up 384.05% from the day prior, and up 403.6% from the same day the week before. Here is a daily price chart of Melco Resorts & Entertainment LTD. Dividend investors may wish to pay attention to the dividend discount model value score of dividend stocks, and for MLCO, its higher than that of 81.16% of US dividend-issuing stocks. 7 Best ETFs for the NEXT Bull MarketMake investment decisions regarding MLCO using the data that counts. Learn more about POWR Ratings. Wynn Resorts Ltd (WYNN) Daily Price Recap Wynn Resorts Ltd is up 9.62% ($7.14) since the previous day, marking the 2nd day in a row an upward move has occurred. The price move occurred on stronger volume; specifically, yesterday’s volume was up 236.28% from the day prior, and up 199.47% from the same day the week before. Here is a daily price chart of Wynn Resorts Ltd. Its annual compound dividend growth rate is higher than 5.42% of US dividend stocks. Is WYNN a Buy, Hold or Sell? See the POWR Ratings now! Maxim Integrated Products Inc (MXIM) Daily Price Recap The back and forth price flow continues for Maxim Integrated Products Inc, which started today off at 69.29 US dollars, up 8.11% ($5.2) from the day prior. The price move occurred on stronger volume; specifically, yesterday’s volume was up 1027.02% from the day prior, and up 1820.95% from the same day the week before. Below is a daily price chart of Maxim Integrated Products Inc. As for MXIM’s dividend discount model value score, it is currently higher than that of approximately 71.32% US dividend payers. Make investment decisions regarding MXIM using the data that counts. Learn more about POWR Ratings. CF Industries Holdings Inc (CF) Daily Price Recap CF Industries Holdings Inc closed yesterday up 5.83% ($1.64); this denotes the 2nd day in a row an increase has occurred. The change in price came along side change in volume that was up 41.6% from previous day, but down 2.3% from the Sunday of last week. Below is a daily price chart of CF Industries Holdings Inc. Dividend investors may wish to pay attention to the dividend discount model value score of dividend stocks, and for CF, its higher than that of 64.72% of US dividend-issuing stocks. Is CF a Buy, Hold or Sell? See the POWR Ratings now! Shaw Communications Inc (SJR) Daily Price Recap Shaw Communications Inc closed the previous day up 5.63% ($0.93); this denotes the 2nd day in a row an increase has occurred. The price move occurred on stronger volume; specifically, yesterday’s volume was up 52.92% from the day prior, and up 334.31% from the same day the week before. Below is a daily price chart of Shaw Communications Inc. Its beta is lower than 66.84% of US dividend stocks. What is the outlook for SJR? Use POWR Ratings for clearer insight into price direction. To further your research on dividend stocks, check out our list of dividend stocks sorted by yield. Want More Great Investing Ideas? 9 “BUY THE DIP” Growth Stocks for 2020 Top 5 WINNING Stock Chart Patterns 7 “Safe-Haven” Dividend Stocks for Turbulent Times MLCO shares . Year-to-date, MLCO has declined -24.26%, versus a -1.17% rise in the benchmark S&P 500 index during the same period."}]}