{"article": [{"url": "https://stocknews.com/news/irtc-stag-ramp-iipr-yext-5-lesser-known-growth-stocks-rated-strong-buy/", "published": 1599134900.0, "headline": "5 Lesser-Known Growth Stocks Rated \"Strong Buy\"", "body": "Growth stocks seem to be getting all the attention, as many investors have all but forgotten value. In particular, growth stocks in the tech space are receiving an influx of money. The iShares Core S&P U.S Growth ETF (IUSG) is up 24.9% year to date, compared with the S&P 500’s gain of 9.5%. This ETF tracks the Russell 3000 Growth Index. The question isn’t whether growth stocks are a good investment, but which ones we should add to our portfolios. There are currently 525 stocks in IUSG’s portfolio, plus many more not in its portfolio. That’s a lot of stocks to choose from. One way to find growth stocks that are not trading at high valuations is to look at less known stocks. Here are three growth stocks rated a Strong Buy, yet have flown below-the-radar: iRythm Technologies (IRTC), Stag Industrial (STAG), LiveRamp Holdings (RAMP), Innovative Industrial Properties (IIPR), and Yext (YEXT). 9 \"BUY THE DIP\" Growth Stocks For 2020iRythm Technologies (IRTC) Healthcare stocks have held firm amidst the pandemic. In particular, digital healthcare stocks have proven quite reliable. However, the mainstream media and investors alike seem to have overlooked IRTC. IRTC provides monitoring and ambulatory electrocardiograms for those at risk for heart arrhythmia. IRTC’s ZIO Service consists of a biological sensor that transmits patient data to the cloud. IRTC’s POWR Ratings metrics are fantastic: A grades in each Component but for Industry Rank where the stocks grades out as a B. IRTC is ranked in the top 10 of 58 Medical – Diagnostics/Research stocks. Out of the eight analysts who have performed a deep dive into IRTC, seven recommend the stock as a Buy, one grades it as a Hold, and none insist on selling. It did not take long for IRTC to bounce back from its slight COVID dip, spiking back to its normal trading level in mere weeks and reaching new highs shortly after that. This is one of the more intriguing medical tech stocks that is likely to continue growing. IRTC could even higher as it brings new wearable devices to the market in the months and years ahead. Stag Industrial (STAG) Real estate is undeniably one of the better investments as it tends to appreciate as time progresses. STAG provides investors with the opportunity to invest in a real estate business that acquires an ownership stake in single-tenant properties. STAG has A grades in its Trade Grade and Buy & Hold Grade POWR components. Analysts rate STAG as undervalued at its current price of $34. They have set a price target of $34.50 for the stock, which is 6% higher than its current price. STAG has a fairly low forward P/E ratio of 17. Furthermore, the stock has only recently returned to its pre-COVID pricing. It is important to note STAG properties are industrial instead of residential, so there is less chance that clients will not be able to pay monthly rent during the pandemic. The company also has a dividend rate of 4.46%, a fantastic return rate that is likely to be paid even amidst the current recession. LiveRamp Holdings (RAMP) Technology stocks receive more than their fair share of attention from the mainstream media outlets, yet the marketing technology stocks are often neglected. RAMP provides online marketing, customer engagement, data, and other services related to marketing and technology. RAMP has nearly perfect POWR Ratings components with A grades in each once except Industry Rank, which has a B. RAMP is ranked second of 51 stocks in the Technology – Services sector. Analysts are bullish on RAMP, setting a price target of $64.50, which is 10% higher than its current price. RAMP’s revenue increased 35% in its most recent quarter. Furthermore, RAMP customers have increased by nearly 20% in one year’s time. Innovative Industrial Properties (IIPR) Most investors are unaware that the marijuana industry has a real estate investment trust available to the public in the form of IIPR. Instead of growing the green stuff and selling it, IIPR rents the space necessary to produce the plant and lets the growers compete against one another. IIPR is ranked 7th out of more than 20 REITs – Industrial stocks with A grades in each POWR Ratings component except Industry Rank, which has a grade of B. Though IIPR has been on a bull run of late, it has not yet reached the analysts’ average price target of $128.50. Yext (YEXT) Have you ever wondered if the search results you sort through are truly accurate? If so, you are not alone. YEXT verifies answers to commonly asked questions for both businesses and governments. Though this is not an essential service, it is becoming increasingly crucial as half-truths and lies spread like wildfire across social media and the web. YEXT has A grades in all POWR Ratings components. It is ranked in the top 20 of nearly 50 stocks in the Software – Business industry. Though there is no guarantee private companies and governments will continue paying for YEXT’s service, investors certainly believe in the stock. The price has gone from $8 to more than $20 over the past six months. Want More Great Investing Ideas? 7 Best ETFs for the NEXT Bull Market Beware Stocks in September? 9 “BUY THE DIP” Growth Stocks for 2020 IRTC shares were trading at $211.27 per share on Thursday morning, down $10.12 (-4.57%). Year-to-date, IRTC has gained 210.28%, versus a 10.69% rise in the benchmark S&P 500 index during the same period."}]}