{"article": [{"url": "https://stocknews.com/news/pton-ddog-net-3-soaring-recent-ipos-with-more-room-to-run/", "published": 1599048500.0, "headline": "3 Soaring Recent IPOs With More Room to Run", "body": "The IPO market is starting to pick up in the latter part of 2020. In the coming months and years, Airbnb, Stripe, and Robinhood are likely to go public. IPOs are an appealing opportunity simply because these initial offerings have the potential to pop immediately after they make their debut. In recent years, the IPO market has been very strong. From the March bottom, the Renaissance IPO ETF (IPO) is up 158%, while the S&P 500 is up 62%. 7 Best ETFs for the NEXT Bull MarketThis is not to say every single IPO is likely to increase in value. However, your odds of success are definitely higher in a bull market with a company that has double-digit earnings and revenue growth. Below, we provide a look at three fairly recent IPOs with significant potential: Datadog (DDOG), Peloton Interactive (PTON), and Cloudflare (NET). Datadog (DDOG) DDOG is regularly criticized as one of the most overvalued stocks yet its lofty trading price may be justified sooner rather than later. Investors who did not get in on DDOG in the immediate aftermath of its IPO should not fret. This stock could easily be trading above $100 by year’s end. The insatiable interest in DDOG stems from its monitoring services for cloud applications. This service is proving increasingly important as more companies rely on the cloud as a result of the pandemic. DDOG monitors servers as well as databases with a Software-as-a-Service (SaaS) analytics platform. DDOG has B grades in each POWR Component of the POWR Ratings but for its Peer Grade and Buy & Hold Grade which is average. DDOG is ranked in the top half of the Software – Business stocks. The best analysts in the business have set a price target of $95 and change for DDOG, indicating it has around 12% upside to go. If DDOG reaches this trading level, it will be a mere $3 short of its 52-week high of $98.99. However, there is a potential for a pullback as more investor dollars move toward DDOG competitor Sumo Logic, a company that will go public at some point within the next year. The arrival of Sumo Logic is worth monitoring yet it does not change the fact that DDOG’s top-line sales increased nearly 70% on a year-over-year basis in the second quarter alone. Furthermore, DDOG investors are quite happy with the fact that clients who renew their deals do so at an average of nearly one-third higher than the prior contract’s value. Peloton Interactive (PTON) Remaining slim and fit during quarantine has proven much easier thanks to the exercise bikes and other fitness equipment offered by PTON. PTON offerings are certainly expensive yet the company’s customers are quick to testify these fitness machines are worth every penny. PTON provides the opportunity to exercise in a communal setting (albeit digitally) to ramp up user motivation. Peloton Digital provides a litany of fitness offerings through Android and IOS, tablets and CPUs for superior accessibility and ease of use. If you are questioning whether PTON is worthy of an investment, look no further than its superior POWR Rating Components. PTON has A grades in each POWR Component category along with a rank of 6th out of 34 stocks in the Consumer Goods category. Out of the 14 analysts who have analyzed PTON, 13 rate it as a Buy, one rates it as a Hold, and none rate it as a Sell. PTON has already tripled from its IPO price of $25 and change yet there is still room for improvement as social distancing continues, gyms struggle to fully reopen and people look for new ways to shed the pounds gained during the quarantine. Cloudflare (NET) NET is one of the more intriguing IPOs as it provides web-based protection without requiring end-users to install software, pay for hardware, or deal with the complexities of code. NET routes web traffic through hundreds of data centers throughout the world to ensure websites are accessed safely and securely. Furthermore, NET protects against online attacks, making its services even more valuable for websites of every type. NET started at $18 a share and is now trading at more than two times that amount. The POWR Ratings show NET has B and C POWR Component grades. NET is ranked in the top half of Software – Security stocks. Check out NET’s analysis from the leading analysts and you will find a bullish picture is painted. NET has an average price target of $48.25, meaning it is likely to increase by 22%. NET revenue has doubled in less than three years. The bottom line is every website owner and webmaster wants his or her website to run more efficiently and securely, meaning NET revenue will likely continue to increase in the short-term and long-term. This is the type of stock you buy today, check in on a couple of times throughout the year, and hold for several decades. Want More Great Investing Ideas? 7 Best ETFs for the NEXT Bull Market Beware Stocks in September? 9 “BUY THE DIP” Growth Stocks for 2020 PTON shares were trading at $91.70 per share on Wednesday morning, up $8.03 (+9.60%). Year-to-date, PTON has gained 222.89%, versus a 11.41% rise in the benchmark S&P 500 index during the same period."}]}