{"article": [{"url": "https://stocknews.com/news/spy-inx-dia-iwm-qqq-bear-case-bull-case-trading-range/", "published": 1593086900.0, "headline": "Bear Case + Bull Case = Trading Range?", "body": "(Please enjoy this updated version of this week’s commentary from the Reitmeister Total Return newsletter). Home, home on the trading range Where investors and day traders must play 7 Best ETFs for the NEXT Bull MarketWhere nothings so lush, as a fresh round of stimulus But Reity refuses to put his bear suit away Copyright 2020- Reitmeister Musical Ventures LLC 😉 This was more than just whimsy. It actually defines the current trading range environment we are faced with. So this week we will talk more about why and next steps in our trading plan. Market Commentary Indeed I think we have emerged into a trading range as the bulls and bears seem to be fairly well deadlocked at this time. A good way to see that is to quickly review the bear case vs. bull case. Bear Case Worst financial event in our lifetimes Tremendous job loss that continues to get worse All vital economic indicators lower year over year with most not likely to show true growth til 2021 Virus cases surging in the US with new cases back above 30,000 per day for the first time since May 1st. Large states like California, Arizona, Florida and Texas are currently the hardest hit. In fact, Wednesday was a new record high for cases in the US at over 39,000. And yes, cases are also surging around the world. Stock valuations at bubbly levels like 26 PE Bear markets average 13 months. So 3 weeks for this one is a bit hard to swallow. Bull Case Yes to all of the above, but what else are you going to do with your money with interest rates this low??? This debate was overly simplified. But truly this is not a case of bulls and bears in major disagreement on the basic fundamental facts like the level of devastation to the economy. Just a difference of opinion on what it all means for current stock prices versus how it has worked historically. But even the staunchest bull would agree that they have already had their fun bouncing this far, this fast from the March lows. Most would have a hard time making a case for there to be much more upside until there is AMPLE proof that the economy is getting back on track and jobless rate going lower. (And yet again Thursday morning we see another 1.48 million filling for unemployment. That is still 2X the pace of the worst week of claims during the Great Recession) That is why I suspect we are in a trading range for now. Not much more upside. Perhaps tops out at 3,200 like the recent past. But hard to imagine anything above the previous high of 3,393 until we truly have an “all clear” signal on the state of the virus and the economy. As for downside, we continue to make moves to 3,000 and then bouncing. We are on the verge of that again this week, but you can see a lot of buyers coming in every time it dips to that level. So that kind of frames the current trading range. Inside this trading range I still like our hedged portfolio which actually produced a +2.8% return this week versus a -2.4% decline (more on that below). And beyond this current trading range period, stocks are more likely to break lower than higher. Why? Read the bear case arguments from above once again. And then review all my commentaries the last 3 months if you more depth on those concepts. (RTR Commentary Archive) And here is fresh ammo in the bonus material below to explain why we have not seen the end of stock market losses. Great new commentary from John Mauldin pointing out that recovering is not the same as “recovered”. And thus full extent of economic damage not truly understood by most market observers. And thus hard to substantiate current stock price levels. But you would be cheating yourself if you did not read the rest here: Where We Go From Here? And here is an interesting piece about Wolf Richter who admits that he hates shorting especially in the midst of bubbles. Yet there is no way he can look at this market and not believe it is bloated and ready to go lower. So yes, he is shorting the market again now: Read that article here. And in case you didn’t read it from my end of the week note on Friday, here is the recent memo from billionaire hedge fund manager Howard Marks of OakTree Capital. This is a quality read explaining in-depth why downside makes more sense than upside at this time: The Anatomy of a Rally. Portfolio Update Our hedge continues to hold up surprisingly well as stocks float higher in the range with a solid outperformance today thanks to big gains for 2 of our 9 positions (tickers reserved for subscribers of Reitmeister Total Return). But really going back the past week we have generated a healthy +2.8% return versus an almost equal drop of -2.4% for the S&P. This makes it all the easier to stay put in this defensive shell as we float around in a near term trading range where in the medium to longer term downside break below 3,000 makes more sense than upside above 3,200. What to Do Next? My portfolio strategy right now is based upon the belief that the downside risk of the market is significantly greater than the upside. As such I have constructed a portfolio that will actually produce profits when the market declines. The kind of portfolio that generated a solid +2.8% gain the past week as the market shed 2.4%. And the kind of strategy that I used to produce a +5.13% return the same week the S&P cratered -14.97% (March 16-20, 2020). The 4 stocks and 5 ETFs currently in my Reitmeister Total Return portfolio form an effective hedge allowing investors to enjoy gains while the market tumbles lower. And gladly it is not too late to get on board this strategy if you have not protected yourself already. Going forward I will look for spots to emerge from the hedge by buying more and more undervalued stocks for the eventual return to a bull market. I know its crazy out there. And I am trying my best to help investors make sense and profit from the situation. The best way for me to do that is give you 30 days access to the Reitmeister Total Return. This is my newsletter service where I share frequent commentaries on the market outlook, trading strategy, and yes, a portfolio of hand selected stocks and ETFs to produce profits whether we have a bull…a bear…or anywhere in between. Just click the link below to see 4 stocks and 5 ETFs in the portfolio now, and all the future trades as we find bottom on this bear and the new bull emerges. About Reitmeister Total Return newsletter & 30 Day Trial Wishing you a world of investment success! Steve Reitmeister …but everyone calls me Reity (pronounced “Righty”) CEO, Stock News Network and Editor, Reitmeister Total Return SPY shares fell $0.87 (-0.29%) in premarket trading Thursday. Year-to-date, SPY has declined -4.90%, versus a % rise in the benchmark S&P 500 index during the same period."}]}