{"article": [{"url": "https://stocknews.com/news/amzn-shop-kr-3-stocks-to-buy-if-you-think-the-coronavirus-will/", "published": 1600258100.0, "headline": "3 Stocks to Buy if You Think the Coronavirus Will Get Worse", "body": "There is no guarantee the coronavirus pandemic will reach a timely conclusion. In fact, the scientific community is adamant the pandemic will worsen this fall and winter as a second wave of the virus rears its ugly head across the globe. The only silver lining to a worsening of the coronavirus pandemic is it may present investment opportunities for creative money managers. Perform your due diligence now, and you will have a strategic game plan ready to implement, should the pandemic worsen. Let’s take a look at a few stocks that may increase in value in the event of the pandemic stretching through the fall, winter, and spring: Amazon (AMZN), Shopify (SHOP), and Kroger Company (KR). 9 \"BUY THE DIP\" Growth Stocks For 2020Amazon (AMZN) Use your mind’s eye to envision how people will react should the number of positive coronavirus tests and virus-related deaths increase. People will return to quarantine, choosing to shop from the comfort of home rather than risk exposure to the virus while out and about. AMZN would be the primary beneficiary in such a situation. The only way AMZN might decline should the pandemic worsen is if the virus washes through its warehouses, rendering staffers unable to work. However, AMZN has taken precautionary steps to minimize social interactions between employees while working at AMZN fulfillment centers. The POWR Ratings reveal AMZN is nearly flawless, highlighted by “A” grades in each POWR component, except “B” for Buy & Hold Grade. AMZN is ranked first of nearly 60 stocks in the Internet industry. Though AMZN is currently priced around $3,100, the analysts have set a price target of $3,725.59. If AMZN reaches this level, it will have increased in value by more than 20%. AMZN recently dipped from $3,531. Shopify (SHOP) Merchants of every type and size are turning to the web to establish an online presence. This phenomenon will prove even stronger if the pandemic worsens. SHOP facilitates the establishment of web-based storefronts, payments, fulfillment, shipping, and more. If you believe the pandemic will not be resolved by the end of the year or sooner, SHOP belongs in your portfolio. SHOP’s POWR Ratings are highlighted by a grade of “B” for Trade Grade. SHOP is ranked 13th out of more than 30 stocks in the Internet – Services industry. Analysts are bullish on SHOP, setting a price target of $1,111.19, which is 20% higher than its price. SHOP also dipped from its yearly high in recent weeks, falling from $1,134.32 to $931.83. All in all, SHOP’s revenue is up nearly 100% on a year-over-year basis. It is also particularly interesting to learn that more than 30,000 SHOP merchants have referred other merchants to the platform in the past year alone. SHOP is also in the lending business, doling out more than a billion dollars of loans to merchants needing funding to launch their operations on the web. SHOP’s recent expansion to the food delivery market will undoubtedly help the stock reach new heights should the pandemic worsen in the upcoming weeks and months, forcing that many more people to lean on food delivery instead of in-person dining service. Kroger Company (KR) Though the grocery industry is often criticized in the context of investing as low-reward and somewhat high-risk due to its narrow margins, the pandemic has changed things. The closure of traditional restaurants has led many more customers to KR, where they are stocking up on all sorts of different foods, beverages, and sundries. KR will sell more products if the pandemic worsens. The company recently expanded its boundaries with the acquisition of Home Chef, a meal kit provider. It also partnered with Ocado, a UK-based internet grocery delivery company, to facilitate online ordering. The POWR Ratings show KR has “A” grades in the Trade Grade and Industry Rank components and a “B” in Buy & Hold Grade. KR is ranked in the top third of nearly 20 stocks in the Grocery/Big Box Retailers industry. KR has steadily climbed higher during the pandemic, with analysts setting a price target of $36.69 for the stock. Want More Great Investing Ideas? 7 Best ETFs for the NEXT Bull Market Stock Market Outlook: Before & After the Election Chart of the Day- See the Stocks Ready to Breakout AMZN shares rose $19.87 (+0.63%) in premarket trading Wednesday. Year-to-date, AMZN has gained 72.20%, versus a 7.41% rise in the benchmark S&P 500 index during the same period."}]}