{"article": [{"url": "https://stocknews.com/news/acb-is-an-announcement-of-a-new-ceo-for-aurora-cannabis/", "published": 1592395700.0, "headline": "Is an Announcement of a New CEO at Aurora Cannabis Imminent?", "body": "On Tuesday of this week, Aurora Cannabis (ACB) announced that Co-Founder Steve Dobler will retire from his roles as President and Director of the Company, effective June 30, 2020. Dobler has been the President of ACB and a member of the Board of Directors since December 2014. Michael Singer, Executive Chairman and Interim CEO at ACB, said, “On behalf of our Board of Directors and management team, I would like to thank Steve for all his contributions to Aurora and for his tenure as a director on our board.” 9 \"BUY THE DIP\" Growth Stocks For 2020“His keen business insight and unparalleled passion for the company will be greatly missed. Steve’s decision to retire and help streamline our leadership team further supports the objectives of our business transformation plan as we remain focused on driving Aurora to become a profitable and robust global cannabis company.” Now that Dobler has retired, the board currently has nine directors, with seven remaining independent. ACB continues to eliminate old management. In my opinion, this is a positive step as the old guard was responsible for making bad choices, recklessly spending on overpriced acquisitions, and diluting shareholders to keep the company afloat. In December 2019 Cam Battley, ACB’s Chief Commercial Officer and the man widely viewed as the face of the company, was forced to step down from his role after Germany suspended sales of the company’s medical cannabis products in the country, due to permitting issues. And in February 2020, CEO Terry Booth was forced to vacate his role as ACB plunged to 52-week lows and 500 employees were let go to save costs. At that time, ACB announced a business transformation plan, which included finding a new permanent CEO. During their last quarterly report in May, the company stated that they plan to announce a permanent long term CEO in the “the next few months” Yesterday’s news about Dobler could potentially signal that a new CEO is finally on the way. Though we are hopeful that this is the case, we continue to urge caution when investing in ACB. It remains a highly volatile and speculative stock that has continued to lose ground over the past few weeks, even as the stock market has rallied. (Disclosure: The author is long ACB) Want More Great Investing Ideas? Do NOT Buy This Dip! Are you prepared for the bear market’s return? 7 “Safe-Haven” Dividend Stocks for Turbulent Times 9 “BUY THE DIP” Growth Stocks for 2020 ACB shares were trading at $12.83 per share on Wednesday afternoon, down $0.28 (-2.14%). Year-to-date, ACB has declined -50.50%, versus a -2.08% rise in the benchmark S&P 500 index during the same period."}]}