{"article": [{"url": "https://stocknews.com/news/acb-mj-ogi-iipr-cannabis-stock-weekly-recap/", "published": 1595592500.0, "headline": "Cannabis Stock Weekly Recap", "body": "It was a disappointing week for the cannabis sector with the ETFMG Alternative Harvest ETF (MJ) trading down more than 4%. Organigram (OGI) is to blame for this move lower, as the company released a disappointing earnings report on Tuesday, July 21st. Aurora Cannabis Continues to Fall After Aurora Cannabis (ACB) announced that it would be scaling back their European operations this week, the stock continued to decline. ACB trades just above $10. If the company does not deliver something positive soon, the stock could fall back into the single digits. 9 \"BUY THE DIP\" Growth Stocks For 2020As the momentum fades and reality sets in, investors are starting to realize that many of the problems ACB had in the past still exist. The company still carries over $2 billion in debt on its balance sheet and has not been able to materialize substantial international revenues. ACB needs to announce a new CEO, and furthermore, they need to write down more of their debt to get their SG&A expenses under control. Organigram Drags Down the Sector with Disappointing Earnings This week Organigram (OGI) posted third-quarter fiscal 2020 earnings. Due to weaker sales after the initial COVID-19 panic buying, sentiment in the cannabis sector is turning negative once again. The company reported net revenues of $18 million compared with $24.8 million in Q3 2019. Unfortunately, due to the -19 pandemic, the company had to reduce its workforce by 25% in order to better align with the needs of the business and prevailing market conditions. Despite shrinking revenues, the company still managed to deliver some positive news. OGI generated positive cash flow from operations of $8.5 million as a result of monetization and optimization of working capital. It ended the quarter with cash and short-term investments of $44.8 million. The company also launched its first offering of large sized dried flowers into the fast-growing value segment of the adult-use recreational market. Innovative Industrial Properties Adds Another Tenant Innovative Industrial Properties (IIPR) continued its rapid expansion in the cannabis sector. Early this week IIPR announced that they had added two more properties to their portfolio. The company closed on a sale-leaseback agreement with a subsidiary of Columbia Care for two cannabis facilities in New Jersey. The first facility is an industrial building roughly 50,000 square feet in size along with a retail location totaling roughly 4,000 square feet. IIPR paid approximately $12.4 million for both properties, excluding transaction costs. The company plans to continue to operate the retail property as a regulated medical-use cannabis dispensary. The industrial property will be used as a regulated medical-use cannabis cultivation and processing facility. IIPR has agreed to provide Columbia Care with up to $1.6 million in reimbursements for improvements to the property. If full reimbursements are drawn for the upgrade, IIPR’s total investment for both properties will be $14 million. Want More Great Investing Ideas? 9 “BUY THE DIP” Growth Stocks for 2020 Newly REVISED 2020 Stock Market Outlook 7 “Safe-Haven” Dividend Stocks for Turbulent Times ACB shares were unchanged in after-hours trading Friday. Year-to-date, ACB has declined -59.88%, versus a 0.61% rise in the benchmark S&P 500 index during the same period."}]}