{"article": [{"url": "https://stocknews.com/news/amzn-msft-fb-3-stocks-to-buy-during-a-market-crash/", "published": 1599739700.0, "headline": "3 Stocks to Buy During a Market Crash", "body": "Recently, the stock market had a correction, as investors cashed in on profits from their investments. Stocks that surged the most, saw the biggest dip. The Nasdaq Composite Index dropped 10% in three trading sessions, after reaching its all-time high of 12,056. The question is, was that a one-time occurrence, or is the beginning of a new bear market? The market bounced back yesterday, but is down again today. It’s too early to tell how long this will last, but we need to be prepared for another crash. The stock market’s returns are not in line with what is happening in the economy. People are still losing jobs and that leads to less consumer spending. So which stocks would hold up in a market crash? The COVID-19 pandemic has changed the way people live and work. The stay-at-home trend got a significant boost during the pandemic-driven lockdown as people started working remotely, and shopping and paying online. Many stocks benefited from this trend, but not all will be able to withstand a market crash. Only tech stocks with strong competitive advantages will be able to weather a steep correction. Three tech giants —Amazon (AMZN), Microsoft Corporation (MSFT), and Facebook (FB) — were surging before the pandemic and continued to surge during the pandemic. All three have competitive advantages that will enable them to weather any type of long-term downtrend. 9 \"BUY THE DIP\" Growth Stocks For 2020Amazon (AMZN) The e-commerce giant was one of, if not the biggest beneficiary of the pandemic. AMZN’s offerings are designed for the stay-at-home culture. Its core business of e-commerce was at the center of the online shopping wave. In the second quarter, AMZN’s revenue surged 40% year-over-year to $88.9 billion on the back of a huge surge in order volumes. AMZN’s biggest win was its entry in grocery. Grocers were reluctant to go online. But the lockdown forced people to buy almost everything online. AMZN increased its grocery delivery capacity by over 160% to cater to the threefold surge in online grocery demand. The e-commerce giant also saw a 29% year-over-year surge in Amazon Web Services (AWS), as companies shifted their work to the cloud to facilitate remote working. Moreover, it saw a 29% uptick in its subscription services like Amazon Prime videos. AMZN’s second-quarter EPS surged 97% to $10.3, surpassing the consensus estimate by 600%. This pandemic-driven demand boosted AMZN’s stock by 78% to its all-time high of $3,552.25. The online trend is here to stay. The company might see some pullback in demand, but the overall increase in revenue has become the new normal. AMZN is in the right business at the right time. It has the resources to tap the digital trend in e-commerce, video on demand, and cloud services. Plus, the company has a strong competitive advantage to withstand a crash. . How does AMZN stack up for the POWR Ratings? A for Trade Grade B for Buy & Hold Grade A for Industry Rank A for Peer Grade B for overall POWR Rating The stock is also ranked #2 out of 57 stocks in the Internet industry. Microsoft Corporation (MSFT) Everyone knows Microsoft for its Windows Operating System that powers your PCs, but, when Satya Nadella took the helm of MSFT in 2014, he adopted the “Mobile First, Cloud First” strategy. This approach has paid off. The company has grown beyond Windows to become the second-largest cloud company after AMZN’s AWS. While AWS is the cloud leader, it is growing at a slower pace than Azure. Last year, MSFT won a $10 billion Joint Enterprise Defense Infrastructure (JEDI) cloud contract while contending against AMZN. This contract win shows MSFT’s competitiveness against AWS. It could prove to be a stepping stone for more contracts. Like AMZN, even MSFT is at the core of the digital revolution as its offerings cater to the stay-at-home culture. It’s fiscal 2020 fourth-quarter revenue surged 13% year-over-year to $38 billion. MSFT’s cloud business, Office 365 product suite, and Windows facilitate remote working, while its Surface laptops and Xbox game console reached out to individual consumers. The company is launching its next-generation Xbox this year, which could significantly boost its gaming revenue. The only segment that suffered a blow was LinkedIn as transactional licensing slowed and advertising spending was reduced. MSFT is also looking to broaden its consumer offerings. It is in discussions to acquire video-based social media platform TikTok. If this deal goes through, MSFT’s stock could surge significantly. The stock surged 70% from its March low to all-time high of $232.86. It’s no surprise that MSFT is rated a “Buy” in our POWR Rating system. It also has a grade of “A” for Trade Grade, Peer Grade, and Industry Rank, and a “B” for Buy & Hold Grade. In the 92-stock Software – Application industry, it is ranked #7. Facebook (FB) While MSFT is eyeing to broaden its consumer outreach with TikTok, FB is already a leader in the social media space. With its four platforms — Facebook, Instagram, Messenger, and WhatsApp — FB reaches 2.45 billion active users. The company monetizes its customer outreach by helping advertisers reach their target audience. Like MSFT’s LinkedIn, even FB saw a slowdown in its ad revenue from small advertisers during the pandemic. But this slowdown had minimal impact on its revenue. In the second quarter, FB’s revenue surged 11% year-over-year to $18.69 billion, while EPS rose 98% to $1.80. The company is looking to further monetize its vast customer outreach by integrating it with e-commerce. It has integrated its Facebook and Instagram platforms with Shopify (SHOP). FB will get a share from all transactions that are processed through its platforms. Unlike AMZN and MSFT, FB is not a trillion-dollar valuation company, but it is moving closer. FB stock has doubled from its March low rising to its all-time high of $302.5. It’s no surprise that FB is rated a “Buy” in our POWR Rating system. It also has a grade of a “A” for Trade Grade, Peer Grade, and Industry Rank, and a “B” for Buy & Hold Grade. In the 57-stock Internet industry, it is ranked #5. Want More Great Investing Ideas? 7 Best ETFs for the NEXT Bull Market Will Stocks Fall into Historical September Slump? 9 “BUY THE DIP” Growth Stocks for 2020"}]}