{"article": [{"url": "https://stocknews.com/news/brk-a-jnj-pg-3-value-stocks-to-buy-now-for-the-remainder-of/", "published": 1599134900.0, "headline": "3 Value Stocks to BUY Now for the Remainder of 2020", "body": "By traditional measures, a number of stocks might look overvalued due to the market’s record momentum since the virus-led crash in mid-March. Many investors are jumping on the bandwagon and buying stocks, even though they look expensive. In a way, betting on a soaring stock is considered momentum investing. But in the absence of strong economic news, there is a chance these stocks will see a correction. Although I am not against momentum investing, investing in stocks that are available at relatively cheaper prices could increase the odds of success. For this strategy, just a low price is not enough. You need to choose low-priced stocks that have solid growth potential. Berkshire Hathaway Inc. (BRK.A), Johnson & Johnson (JNJ), and Procter & Gamble Company (PG) are three such stocks that are currently trading at reasonable valuations. Moreover, as these companies deal in a variety of business segments, investing in them could help you diversify your portfolio. 7 Best ETFs for the NEXT Bull MarketBerkshire Hathaway Inc. (BRK.A) BRK.A engages in diverse business activities including insurance and reinsurance, utilities and energy, freight rail transportation, manufacturing, retailing and services. BRK.A has a cash/price ratio of 0.07 and an EV/EBITDA of 4.20, both lower than their respective industry averages. BRK.A has grown more than 35% since its March lows and the company’s EPS is expected to grow by 18.4% next quarter. The company’s net earnings attributable to shareholders increased 86.8% year-over-year in the second quarter. BRK.A’s top five investment holdings are Apple Inc. (AAPL), Bank of America (BAC), Coca-Cola (KO), American Express (AXP), and The Kraft Heinz Company (KHC). Some notable recent developments with respect to the company’s portfolio is the addition of Barrick Gold (GOLD) and Bank of America (BAC) shares, and a reduction of its holdings in JPMorgan Chase (JPM), Wells Fargo & Company (WFC), and PNC Financial Services (PNC). In addition, the company also dropped its position in Goldman Sachs (GS) and US airline stocks, as well as trimmed its holdings in other bank stocks. BRK.A’s solid track record of generating long term returns for its shareholders, while investing in companies with strong fundamentals and reasonable valuations makes a strong case for potential investors. Berkshire Hathaway has acquired slightly more than 5% passive stakes in each of the five leading Japanese trading companies and intends to hold these investments for the long term. How does BRK.A stack up for the POWR Ratings? A for Trade Grade A for Buy & Hold Grade A for Peer Grade A for Industry Rank A for Overall POWR Rating You can’t ask for better. The stock is also ranked #1 out of 59 stocks in the Insurance-Property & Casualty industry. Johnson & Johnson (JNJ) JNJ is a New-Jersey based company that operates in three main segments — Consumer, Pharmaceutical and Medical Devices. JNJ has a debt/equity ratio of 0.40 and an earnings yield of 5.18%, both lower than their respective industry averages. Moreover, JNJ’s average analyst price target is $164.87 which represents an upside potential of 8.8%. Recently, JNJ entered into a definitive agreement to acquire Momenta Pharmaceuticals, Inc. (MNTA) in an all-cash transaction for approximately $6.5 billion, which will help drive its growth JNJ has been conducting the Phase 1/2a first-in-human clinical trial of its investigational SARS-CoV-2 vaccine, Ad26.COV2-S, recombinant in the United States and Belgium, and also planning its Phase 3 clinical trial with the National Institute of Allergy and Infectious Diseases (NIAID), contingent on regulatory approval of its previous trials. The collaboration between Janssen Pharmaceutical Companies of JNJ and Biomedical Advanced Research and Development Authority (BARDA) will help accelerate the process of this vaccine development. Furthermore, the company’s deal with Catalent Pharma Solutions (CTLT) will help ramp up its vaccine production infrastructure. Janssen Pharmaceutical Companies have entered into an agreement with the U.S. government for the large-scale domestic manufacturing and delivery of 100 million doses of its Covid-19 vaccine candidate, Ad26.COV2.S, for use in the US following approval. JNJ has an impressive earnings surprise history with the company beating consensus EPS estimates in each of the trailing four quarters. JNJ’s EPS is expected to grow 2.7% next quarter and 14.9% next year. The stock has grown more than 35% since its March lows. It’s no surprise that JNJ is rated a Strong Buy in our POWR Ratings system. It also has a grade of A for Trade Grade, Buy & Hold Grade, Peer Grade, and Industry Rank. In the 231-stock, Medical-Pharmaceuticals industry, it is ranked #1. Procter & Gamble Company (PG) PG sells products to consumers and operates through five main segments — Beauty, Grooming, Health Care, Fabric Care and Home Care, and Baby, Feminine and Family Care. The stock has gained more than 40% since its March lows and hit its 52-week high of $141.44 recently. PG has a debt/equity ratio of 0.51 and a PEG ratio of 3.45, both lower than their respective industry averages. PG’s net sales for the fourth quarter fiscal year 2020 that ended on June 30th increased 4% and core earnings per share increased 5% year-over-year. Moreover, the company returned $15.2 billion of value to shareholders in fiscal 2020. PG has an impressive earnings surprise history with the company surpassing consensus EPS estimates in each of the trailing four quarters. The company’s EPS is expected to grow 4.2% next quarter. PG also has an annual dividend of $3.16 which yields 2.25%. The market expects the company to report an EPS of $1.41 for the quarter ending September 2020, which represents an improvement of 2.9% over the year-ago number. PG’s consensus revenue estimate for the same quarter is $18.26, an increase of 2.6% from the previous year. PG’s POWR Ratings reflect this promising outlook. It has an overall rating of Strong Buy with a grade of A for Trade Grade, Buy & Hold Grade, Peer Grade, and Industry Rank. Among the 34 stocks in the Consumer Goods industry, it’s ranked #1. Want More Great Investing Ideas? 7 Best ETFs for the NEXT Bull Market Beware Stocks in September? 9 “BUY THE DIP” Growth Stocks for 2020 BRK.A shares were trading at $329,500.00 per share on Thursday afternoon, down $3.00 (-1.00%). Year-to-date, BRK.A has declined -2.97%, versus a 9.41% rise in the benchmark S&P 500 index during the same period."}]}