{"article": [{"url": "https://stocknews.com/news/spy-qqq-did-stocks-hit-a-peak-last-week/", "published": 1594987700.0, "headline": "Did Stocks Hit a Peak Last Week?", "body": "Stock market action this week has been characterized by rotation from the “Nasdaq (QQQ),” which as of midday, will have declined by 1.7% compared with gains in both the “S&P 500 (SPY)” and “Russell 2000 (IWM)” which increased 1.1% and 0.9% respectively for the week. Of course, the QQQ’s are still far outpacing the SPY and IWM for the year — some profit-taking and rebalancing out of the big tech winners like “Amazon (AMZN)” and “Apple (AAPL)” and into things like financials and consumer staples. But, given that the stock market has already been narrow, it can ill afford to lose the generals when the soldiers were already dragging and the broad economy is likely to face headwinds for months to come. Next week, we’ll get important earnings season reports from Microsoft (MSFT) and then AAPL and “Alphabet (GOOGL)” next week, which could determine whether they can regain their lead. But, in what might be seen as a shot across the bow “Netflix (NFLX)” is trading down almost 10% — following last night’s moderately-disappointing earnings report. This may indicate that some of the companies, which benefited from the COVID-19 lockdown, and whose stocks ran up some 50%-100% over the past few months, have now fully priced. 7 \"SAFE HAVEN\" Dividend Stocks for Turbulent TimesFrom a technical chart standpoint, last week’s major reversal could spell big trouble. Reversals are usually reliable signals for market turns, and last week was only the second time in 30 years we saw a 2% rally into new highs, only to reverse and close down over 1%. The only other instance was the peak of dot.com in 1999. This could definitely be a sign we just had a blow-off top after a near parabolic move. While sentiment indicators did not get too euphoric, there were some data points that hit some historical levels indicating complacency. The put/call ratio hit an all-time low of 0.39 which indicates nearly three times and calls were being purchased than puts. It’s a sign investors want to get additional upside exposure and are not worried about buying puts for portfolio protection against the downside. There has also been a surge in mutual funds that employ options strategies to boost returns. Many of them use volatility selling strategies, such as selling puts or selling VIX related products to add an income element to the stock portfolio. These strategies work until they don’t. If the stock market turns lower and volatility jumps, losses accumulate quickly. Sometimes well beyond what people expect or were prepared for. The next few weeks could be key in determining whether the market has peaked. Click here to learn more about Steve Smith’s unique-and-profitable approach to options trading. Want More Great Investing Ideas? 9 “BUY THE DIP” Growth Stocks for 2020 Newly REVISED 2020 Stock Market Outlook 7 “Safe-Haven” Dividend Stocks for Turbulent Times SPY shares were trading at $321.35 per share on Friday afternoon, up $0.56 (+0.17%). Year-to-date, SPY has gained 0.87%, versus a % rise in the benchmark S&P 500 index during the same period."}]}