{"article": [{"url": "https://stocknews.com/news/agi-gld-gdx-kl-btg-3-gold-miners-to-buy-on-the-dip/", "published": 1597320500.0, "headline": "3 Gold Miners to Buy on the Dip", "body": "It’s been a busy week for the precious metals market (GDX), and the relentless bid underneath the miners was finally pulled as the index had its worst day since March with a 7.9% decline. While this may have some investors worried, it was more than overdue, and a 4-8 week correction would be completely normal to shake some of the weak hands out of the sector. However, while I prefer to buy during sharp corrections, the key is to focus on quality, and many trading the sector have been hunting down the highest costs names as they’re finally profitable at $1,600/oz plus gold (GLD). While this strategy can work, it often comes at the expense of quality. Any management team that needs a $1,500/oz gold price to generate positive earnings is an organization worth avoiding. In this article, we’ll examine a few names with the best management teams and best growth to capitalize if this pullback in the sector continues. 9 \"BUY THE DIP\" Growth Stocks For 2020 (Source: TC2000.com) As I’ve noted in previous articles, the Gold Miners Index is an excellent way to get leverage to the gold price, but choosing stocks within the index is not easy. In nearly 15 years of trading this sector, I’ve learned that 80% of the stocks in the index are not worth owning as they consistently erode shareholder value through poorly timed acquisitions, poorly run operations, or share dilution. However, there are about ten names in the sector that have experienced management teams and world-class assets, and these are the names I prefer to focus on for core positions. Three of these miners are Alamos Gold (AGI), Kirkland Lake Gold (KL) and B2Gold (BTG), and we’ll examine them in a little more detail below: (Source: YCharts.com, Author’s Chart) Beginning with Alamos Gold, the company has the 2nd highest earnings growth rate in the sector and is on track for a compound annual earnings growth rate of 56% over the next three years. This is incredible growth even for a small-cap company, with this earnings growth coming as the company transitions from an investment phase to a growth phase with its projects. The company’s uninspiring growth rate the past few years has been due to lofty capital expenditures to optimize its flagship Young-Davidson Mine, but the gold price increase and improved margins going forward are targeting significant growth going forward. As we can see in the chart below, the company is on track for annual EPS growth of 76% in FY2020, with yearly EPS expected to jump from $0.21 to $0.37. While a $9.60 stock trading at 26x forward earnings may look expensive, the stock is much cheaper if we look at its long-term potential. Looking out to FY2022, Alamos Gold is projected to see annual EPS hit $0.80, which means that the stock is currently trading at just 12x FY2022 annual EPS with a 1% dividend. This is quite attractive from both a growth and value standpoint, especially considering that these estimates are based on $1,650/oz gold. Therefore, I believe that any pullbacks below $9.65 on Alamos Gold would provide relatively low-risk buying opportunities for long-term investors. Ultimately, I think the company should be able to transform itself from a 450,000-ounce producer to a 625,000-ounce producer in the next three years, one of the most impressive production growth rates in the sector. (Source: YCharts.com, Author’s Chart) Moving over to Kirkland Lake Gold, the company has grown significantly from its ultra-growth days in 2016 and 2017 and is now a 1.6 million-ounce producer after a massive $4 billion acquisition last year. While this led to some deceleration in annual EPS, this speed bump has bred opportunity, as KL trades at one of the lowest multiples in the sector. Based on FY2021 annual EPS estimates and a $49.50 share price, the stock is trading at only 12.3x forward earnings while its peers trade at over 16x forward earnings. It’s worth noting that Kirkland Lake Gold has some of the lowest costs among its peers, with margins above 60% at $1,800/oz. Based on a very reasonable valuation, a 1% dividend yield, and industry-leading margins, I believe that any sharp pullbacks in the stock below $48.50 are buying opportunities. I remain long the stock with an average cost just above $40.00~, but I would consider adding to my position if the weakness continues. It’s worth noting that the company has a massive buyback program in place and just bought back over 0.3% of its share float above $50.00 per share this month. (Source: TC2000.com) The last name on the list is B2Gold (BTG), and while the company’s mines are in less attractive jurisdictions, the company makes up for this with an industry-leading dividend yield and high margins. As we can see in the chart below, the company had the lowest all-in sustaining costs of $705/oz in the first half of 2020 among million-ounce gold producers, second to KL at $763/oz. However, the dividend yield dwarfs that of its peers as the company’s blow-out Q2 report prompted the company to double its dividend to $0.16 per share annually. This translates to a 2.46% forward yield at $6.50 per share, one of the top-5 dividend yields in the sector currently. The only issue I see with B2Gold is that the jurisdiction is less attractive than its peers, and the easy portion of this growth story has played out here. Based on this fact, the company will be relegated to high single-digit to low double-digit annual EPS growth after FY2020 barring an acquisition or a $2,100/oz plus gold price. However, even if neither occurs, the dividend yield and reasonable valuation make the stock a buy if we head below $6.15 per share. Therefore, for investors OK with low-growth but high value, B2Gold is a staple for a precious metals portfolio. (Source: Author’s Chart, Company Data) While there’s no guarantee that the correction in the GDX is anywhere near over, I believe the three names above are great ways to play the sector long-term as long as they’re bought on sharp pullbacks. I remain long 2 of the three names on the list for now (AGI and KL) and may look to start a new position in B2Gold if the pullback deepens. Quality is everything in the Gold Miners Index, and for investors searching for quality, they needn’t look any further than BTG, AGI, and KL. Ultimately, I believe all three will be 25% higher than current levels by the end of Q2 2021, and when combined with 1%+ dividend yields, they certainly command a spot in one’s portfolio. Disclosure: I am long GLD, KL, AGI Disclaimer: Taylor Dart is not a Registered Investment Advisor or Financial Planner. This writing is for informational purposes only. It does not constitute an offer to sell, a solicitation to buy, or a recommendation regarding any securities transaction. The information contained in this writing should not be construed as financial or investment advice on any subject matter. Taylor Dart expressly disclaims all liability in respect to actions taken based on any or all of the information on this writing. Want More Great Investing Ideas? 9 “BUY THE DIP” Growth Stocks for 2020 How to Trade THIS Stock Bubble? 7 “Safe-Haven” Dividend Stocks for Turbulent Times AGI shares were trading at $9.82 per share on Thursday afternoon, up $0.31 (+3.26%). Year-to-date, AGI has gained 64.07%, versus a 5.55% rise in the benchmark S&P 500 index during the same period."}]}