{"article": [{"url": "https://stocknews.com/news/omi-home-grwg-true-arlo-5-strong-small-cap-stocks-with-significant-growth-potential/", "published": 1597838900.0, "headline": "5 Strong Small-Cap Stocks with Significant Growth Potential", "body": "As savvy investors know, ignoring small-caps comes at your peril. Small-cap stocks are not featured on CNBC at the same frequency of their large-cap peers, yet they are just as worthy of your attention as mid-caps and large-caps. The challenge becomes sorting through the seemingly many small-cap stocks to pinpoint those worthy of a spot in your portfolio. StockNews.com is here to help with this challenge. We have sorted through small-cap stocks to pinpoint the strongest of the bunch for your review. The following five sizzling small-cap stocks are worth additional consideration even for investors who favor companies with sizable market caps: Owens & Minor (OMI), At Home Group (HOME), GrowGeneration Corp. (GRWG), TrueCar (TRUE), and Arlo Technologies (ARLO). 9 \"BUY THE DIP\" Growth Stocks For 2020Owens & Minor (OMI) Even if the economy continues to tank, medical and surgical supplies will still be in demand. OMI distributes these supplies, providing supply-chain management and testing/monitoring services and products for those saddled with diabetes. With a reasonably low forward P/E ratio of 15.17, the stock appears undervalued. OMI is garnering considerable attention in investing circles. The POWR Ratings have OMI ranked 23rd out of 130+ publicly traded companies in the Medical – Devices & Equipment category. If the pandemic continues, OMI’s N95 respirators, face coverings, gloves, and gowns will generate that much more revenue for the company’s bottom line. Make this PPE supplier a part of your portfolio today, and it should serve you well in the months to come. At Home Group (HOME) Now that people are spending an inordinate amount of time at home, companies selling home décor and other home-related products are raking money. HOME provides a litany of home products, including décor, housewares, rugs, mirrors, furniture, and more. The POWR Ratings reveal HOME has A ratings in each POWR component, but its Industry Rank, which has a grade of B. HOME is ranked 7th out of 33 Specialty Retailers stocks. Home is currently trading around $17. The stock has a low forward P/E ratio of 11.40, meaning it has plenty of room to move upward before it is considered overvalued. HOME has legitimate potential to move higher because its comp sales surged more than 40% on a year-over-year basis. The forecasted profit increase of 700% is the icing on HOME’s metaphorical cake. GrowGeneration Corp. (GRWG) Marijuana growers need a litany of supplies, including hydroponics, organic soils and nutrients, lighting, and more. GRWG sells these items to both commercial entities as well as at-home growers. GRWG stores are located in about half a dozen states, primarily along the West Coast of the United States. The POWR Ratings show GRWG is a superstar in each POWR Component. Aside from straight As in the POWR Ratings, GRWG also ranks high in its industry, landing 15th out of 67 Home Improvement & Goods stocks. GRWG’s second-quarter results are the company’s 10th straight quarter of record revenue. GRWG sales increased more than 120% on a year-over-year basis, breaking through the $43 million mark. If the United States’ marijuana market continues to expand, GRWG will grow in unison, likely breaking through $20 in the months ahead. TrueCar (TRUE) When it comes to buying and selling automobiles, information is the name of the game. TRUE provides such data in an easy-to-digest format on the web. This information, combined with the company’s expansive network of TrueCar certified dealers, makes the company a true power player in the automotive industry. Top analysts have set a $6.47 price target for TRUE, which is 25% higher than its current price. TRUE’s better than anticipated second-quarter earnings offset the fact that its year-over-year quarterly revenue dropped nearly 30%. This drop was expected because the United States’ automobile sales dropped by a third during the quarter. TRUE’s latest earnings report was highlighted by its announcement of a deal to sell its leasing data to J.D. Power for more than $130 million. More than $100 million of this money will be provided to TRUE in cash when the deal closes, ultimately laying the financial footing for a share repurchase totaling $75 million. Arlo Technologies (ARLO) The cloud, wireless connectivity, and artificial intelligence (AI) are the wave of the future. ARLO is an emerging superstar in each of these categories, using them to power the company’s overarching aim of providing an unparalleled smart home experience. ARLO’s connected devices include smart security lights, baby monitors, smart Wi-Fi, and more. The POWR Ratings reveal ARLO has an A grade in the Trade Grade and Industry Rank POWR components. ARLO has B grades in the remaining POWR components. Analysts have a price target of $7, which is nearly 20% higher than its current price. ARLO may break through its 52-week high of $6.58 as the year continues, and its quarterly earnings continue to impress. Want More Great Investing Ideas? The Best of StockNews 2 Step Process to Sell @ Market Top in September 9 “BUY THE DIP” Growth Stocks for 2020 OMI shares were trading at $17.17 per share on Wednesday morning, up $0.17 (+1.00%). Year-to-date, OMI has gained 232.36%, versus a 6.35% rise in the benchmark S&P 500 index during the same period."}]}