{"article": [{"url": "https://stocknews.com/news/ung-d-four-trillion-cubic-feet-of-natural-gas-is-on-the/", "published": 1601381300.0, "headline": "Four Trillion Cubic Feet of Natural Gas Is on The Horizon", "body": "Only eight weeks before the start of the peak season for demand Natural gas has a wild week Stockpiles are bearish; production is not The injection season in the natural gas market runs from March through November each year. Production of the energy commodity exceeds demand during the spring, summer, and early fall months so that stockpiles can build for the peak season of usage during the cold winter months. While more natural gas demand has emerged during the summer because of replacing coal with natural gas for power demand, the winter months remains the time when stockpiles in storage around the US decline. We have witnessed lots of volatility in the natural gas futures arena during the 2020 injection season. Rising stocks and weak demand pushed the price of nearby NYMEX futures to a quarter-of-a-century low of $1.432 per MMBtu in late June. News of Warren Buffett’s $10 bill acquisition of the transmission and pipeline assets from Dominion Energy (D) in early July came as the price began to rise. Hurricanes that threatened the states along the Gulf of Mexico pushed the price to a new high for 2020 at $2.743 in late August. Since then, natural gas fell below $2 per MMBtu once again. Last week, the price of October futures briefly traded below the $1.80 level for the first time since July. With the withdrawal season on the horizon in approximately two months, the price of natural gas remained at a depressed level at the end of last week. 7 Best ETFs for the NEXT Bull MarketMoreover, the November 3 election could bring changes in the regulatory environment and further policy changes in the energy sector. We are likely to see a continuation of price variance in the natural gas futures arena over the coming weeks. The United States Natural Gas Fund (UNG) reflects the price action in the NYMEX futures arena. Only eight weeks before the start of the peak season for demand Last Thursday, the Energy Information Administration reported that stockpiles of natural gas in storage rose by a less than expected 66 billion cubic feet for the week ending on September 18. As of mid-September, the amount of natural gas available for the upcoming peak season was only 52 billion cubic feet below the high in November 2019 at 3.732 tcf. The high level last year capped the price of the energy commodity at $2.905 per MMBtu. Ample stocks and demand destruction during the global financial crisis sent the price of the energy commodity to a twenty-five-year low in late June at $1.432. With only eight weeks to go before the beginning of the withdrawal season, stockpiles look like they are heading for the four trillion level for only the third time since the EIA began reporting data. Natural gas is heading into the winter months with plenty of supplies to satisfy demand, even if temperatures are below average and requirements increase. We are likely to see inventories rise above the 2019 peak for the week ending on September 25. An average injection of 40 bcf would put supplies at the 4.0 tcf level. Natural gas has a wild week Volatility in the natural gas futures market has been steadily rising since reaching a low of below 28% in mid-February 2020. Source: CQG As the weekly chart highlights, the price variance metric was at the 71% level at the end of last week. Natural gas moved 91.5% higher in two months, from late June through late August, as the price recovered from $1.432 to $2.743. The high was the peak price so far in 2020. Selling returned to the market, pushing the price of expiring October futures to a low of $1.795 on September 21. The price explosion led to an implosion that gave way to another explosion as nearby futures soared to over $2.30 on September 24. The energy commodity rolled from October to November futures. The November contract was trading at a significant premium to the expired contract. Source: CQG The chart of the new active November contract shows that the price rose to just over the $2.80 level at the end of last week as it was heading for a test of the recent high at $3.002 from September 4. The total number of open long and short positions in the futures market has been flatlining and stood at 1.253 million contracts at the end of last week. Price momentum and relative strength indicators moved from an overbought condition to an oversold reading, where they crossed higher and were both above neutral territory as of September 25. The technical position in the natural gas market shifted from bear to bull last week. Stockpiles are bearish; production is not Inventories in the natural gas market are a warning sign for the price of the energy commodity. However, the increasing demand for LNG for the export market and the decline in the number of natural gas rigs in operation support the price. As of September 25, Baker Hughes reported that 75 rigs were extracting natural gas from the earth’s crust, which was 146 lower on a year-on-year basis. Meanwhile, the first week of November is always critical for the natural gas market as it is typically the time of the year when injections end and withdrawals from storage commence. However, in 2020, November 3 has a special significance as it will determine the future of US energy policy. The election will decide if President Trump, an advocate for energy independence and supporter of fewer regulations, remains in the White House for another four years. Former vice president Joe Biden is leading in the polls. If he becomes the forty-sixth President, the environment for energy production could shift. Moreover, the majority in the House of Representatives and the Senate will determine the path of energy policy. A sweep by Democrats in the election would likely cause a decline in US output as they favor a far stricter regulatory environment. Inventories and production are pulling the price of natural gas in opposite directions. Still, politics could determine the path of least resistance for the energy commodity over the coming months and years. Meanwhile, the price volatility has created lots of opportunities for trading in the natural gas arena. The high level of price variance is likely to continue over the coming weeks. Want More Great Investing Ideas? 7 “Safe-Haven” Dividend Stocks for Turbulent Times When Does the Next Bull Run Start? Chart of the Day- See the Stocks Ready to Breakout UNG shares fell $0.50 (-4.01%) in premarket trading Tuesday. Year-to-date, UNG has declined -28.77%, versus a 5.28% rise in the benchmark S&P 500 index during the same period."}]}