{"article": [{"url": "https://stocknews.com/news/ostk-flws-leaf-3-small-cap-internet-stocks-to-own-for-the-rest-of/", "published": 1598875700.0, "headline": "3 Small-Cap Internet Stocks to Own for the Rest of 2020", "body": "Although there is always some risk associated with investing in small cap stocks, their potential to grow can help investors generate large returns. One of the better ways to find small cap stocks, is to consider an industry which is thriving amid the pandemic, such as internet stocks. Another factor to consider is if the market has overlooked the stock. The Internet industry has been gaining momentum as the world is adjusting to the “new normal” of working and learning remotely. This is clearly evident from the SPDR S&P Internet ETF’s (XWEB) year-to-date gain of 54.7% compared to the SPDR S&P 500’s (SPY) return of 10.1% over the same period. In fact, while the SPY has gained 50% since hitting its year-to-date low in March, XWEB has returned close to 130% over the same time period. Overstock.com, Inc. (OSTK), 1-800 FLOWERS.COM, Inc. (FLWS), and Leaf Group Ltd. (LEAF) are three small-cap internet stocks worth a look. 7 \"SAFE HAVEN\" Dividend Stocks for Turbulent TimesOverstock.com, Inc. (OSTK) This $3.91-billion online retail and technology company reported strong second-quarter results. OSTK’s gross retail sales doubled and the number of new customers tripled compared to the year-ago quarter. Total net revenue for the quarter increased by 109% and net income attributable to stockholders increased by $61 million on a year-over-year basis. In addition, the company improved its YTD free cash flow by $237 million year-over-year. tZero group, a majority-owned subsidiary of OSTK, which focuses on the development of Fintech based on Blockchain technologies, accounts for approximately 95% of security token trade volume and 80% of the total token dollar value. As stated in OSTK’s quarterly report, the total number of tZERO Crypto app users increased 42% from March 31, 2020 and 100% year-to-date. tZero ATS started trading the St.Regis Aspen Digital Security which makes it the first time a Tezos-based digital security is traded on a regulated platform. OSTK’s consensus revenue estimate of $512.18 million for the quarter ending September 2020 indicates a year-over-year increase of 47.6%. Also, the market expects the company to report a loss per share of $0.25 for the quarter, which represents a significant improvement over the year-ago loss per share of $0.87. The stock has grown by more than 2470% since its March lows. OSTK’s POWR Ratings reflect this promising outlook. It has an overall rating of Buy with a grade of A for Trade Grade and Industry Rank. Among the 57 stocks in the Internet industry, it’s ranked #21. 1-800 FLOWERS.COM, Inc. (FLWS) FLWS is a $1.96-billion Internet company that operates in three main segments — Consumer Floral, Gourmet Food, and Gift Baskets, and BloomNet Wire Service. The stock has returned more than 170% since its March lows. FLWS’s first three quarters of fiscal 2020, which were before the pandemic, exhibited strong performance and the fourth quarter accelerated this momentum, contributing to record top and bottom line results. In FLWS’ results for the fiscal 2020 fourth quarter which ended in June 2020, net revenues increased a record 61.1% year-over-year and adjusted net income was $15.1 million compared to a loss of $8.3 million in the prior-year period. The company has also expanded its credit facilities with the help of an amended credit agreement. The company’s acquisition of PersonalizationMall.com, a leading e-commerce provider of personalized products, will help the company grow and help customers stay connected. FLWS’s collaboration with Universal Pictures Home Entertainment gives customers a chance to purchase a digital movie as a complement to their gift and at the same time allow gift recipients to choose their preference from a diverse range of movie selections. FLWS has an impressive earnings surprise history with the company surpassing consensus EPS estimates in each of the trailing four quarters. The market expects the company to report a loss per share of $0.19 for the quarter ending September 2020, which represents significant growth over the year-ago loss per share of $0.24. The consensus revenue estimate of $247.05 million for the same quarter indicates a year-over-year increase of 36.6%. It’s no surprise that FLWS is rated a Strong Buy in our POWR Ratings system. It also has a grade of A for Trade Grade, Buy & Hold Grade, Peer Grade, and Industry Rank. In the 57-stock Internet industry, it is ranked #12. Leaf Group Ltd. (LEAF) LEAF is a $122.22-million diversified consumer internet company that builds enduring, creator-driven brands. In the second quarter, LEAF’s total revenue increased 42% year-over-year and its net income increased by $7.6 million from the year-ago period. LEAF announced the completion of the content migration contemplated by the Asset Sale & Services Agreement with Hearst Newspapers and receipt of final payment from Hearst of $5.5 million. Society6 announced Gross Transaction Value of $17.1 million for July 2020, which indicates a 144% increase year-over-year, recording the brand’s strongest month in the company’s history. The market expects the company to report a loss per share of $0.16 for the quarter ending September 2020, which represents a marginal improvement over the year-ago loss per share of $0.17. LEAF has a consensus revenue estimate of $48.67 million for the same quarter, which indicates a year-over-year increase of 21.6%. LEAF’s EPS is expected to grow 15% per annum over the next five years. The stock has gained more than 310% since its lows in April. LEAF has a grade of A for Industry Rank according to our POWR Ratings system. Want More Great Investing Ideas? 7 Best ETFs for the NEXT Bull Market Beware Stocks in September? 9 “BUY THE DIP” Growth Stocks for 2020 OSTK shares fell $1.75 (-2.00%) in after-hours trading Monday. Year-to-date, OSTK has gained 1,141.13%, versus a 9.65% rise in the benchmark S&P 500 index during the same period."}]}