{"article": [{"url": "https://stocknews.com/news/gold-fnv-aem-rgld-4-dividend-paying-gold-miners/", "published": 1597406900.0, "headline": "4 DIVIDEND PAYING Gold Miners", "body": "Gold prices have declined more than 4% so far this week due to rising Treasury yields. Before this decline, the precious metal has impressively rallied. Gold has been the perfect asset for the weak economy, uncertain political and economic environment, and considerable amounts of stimulus as it benefits from rising inflation expectations and lower rates. In recent days, there’s been increasing optimism that a credible vaccine will be available by year-end, and the economy is doing better than expectations. This has led to selling pressure in safe havens like gold. Still, gold has risen more than 28% so far this year. If the economy underperforms, and the government pushes out more stimulus, then prices will likely increase. A rise in gold prices directly benefits gold miners by helping them generate higher profits, especially as gold prices are above miners’ costs currently. Many gold miners also pay dividends, which will reward investors if gold trades sideways for an extended period before making new highs. 7 \"SAFE HAVEN\" Dividend Stocks for Turbulent TimesThe temporary setback for the precious metal could be a good opportunity to enter gold mining stocks like Barrick Gold (GOLD), Franco-Nevada Corporation (FNV), Agnico Eagle (AEM), and Royal Gold (RGLD). Barrick Gold Corporation (GOLD) GOLD mines and markets, both gold and copper. The company has exploration activities in Canada, Australia, the US, Peru, and other countries. Recently, the company entered into a joint venture with Newmont Goldcorp to develop eight gold assets in the Nevada region. Due to a stellar second quarter, the company has increased its dividend by 14%. It distributes an annual dividend of $0.28, which translates to a dividend yield of 1.1%. In the second quarter, net earnings have increased to $357 million from $194 million a year ago. Free cash flow has also been increased to $522 million compared to $55 million a year ago. GOLD’s earnings surprise history is impressive as well with the stock meeting or beating consensus EPS estimates in each of the trailing four quarters. GOLD has also been performing pretty well along with rising gold prices amid the uncertainties, and it has added close to 73% to its stock price since this year’s low of $15.1 hit in March due to the virus-driven market crash. How does GOLD stack up for the POWR Ratings? A for Trade Grade B for Buy & Hold Grade A for Industry Rank B for Overall POWR Rating You can’t ask for better. The stock is also ranked #2 out of 30 stocks in the Miners – Gold industry. Franco-Nevada Corporation (FNV) FNV is a gold-focused streaming and royalty company that operates in the US, Canada, Latin America, and other regions. The company reported that its operations were not significantly affected by the spread of the coronavirus, and they expect an increase in sales in the third quarter of the year. In the second quarter, the company reported revenues of $195.4 million as compared to $170.5 million during the same period last year. The earnings surprise history for FNV looks pretty good, as the company met or beat the consensus EPS estimates in each of the trailing four quarters. FNV distributes an annual dividend of $1.04 with a dividend yield of 0.7%. The company has also delivered an impressive price performance. FNV’s stock has recovered 54.8% from the year-to-date low it hit in mid-March. The company’s strong recovery could be part of a growth momentum that could last well for the rest of 2020. It’s no surprise that FNV is rated “Buy” in our POWR, an excellent system. It also has an “A” for Trade Grade and Industry Rank. In the 30-stock Miners – Gold industry, it is ranked #3. Agnico Eagle Mines (AEM) AEM focuses on the exploration, mining, and production of mineral assets in the US, Europe, Canada, and Latin America. The company is currently involved in expanding their operation in the Kittila mines in Finland. For the quarter ended June 2020, the company reported a revenue of $557 million compared to $526 million from the same period last year. Though AEM missed the consensus EPS estimate the previous quarter, it beat the estimates in the prior three quarters. The company has also declared a quarterly cash dividend of $0.2 per share. AEM paid a cash dividend every year since 1983. AEM has a dividend yield of 1.03%, and it pays an annual dividend of $0.8. The stock has also been performing pretty well amid the uncertainties. It has added close to 117% since hitting its low of $33.4 on March 19th. It’s no surprise that AEM is rated “Strong Buy” in our POWR Ratings system. It also has an “A” for Trade Grade, Buy & Hold Grade, Peer Grade, and Industry Rank. In the 30-stock Miners – Gold industry, it is ranked #4., Royal Gold (RGLD) Royal Gold acquires and manages metal streams and metal royalties in the US, Canada, Mexico, and Chile. The company’s decline in sales due to the coronavirus was partially compensated by the rise in gold prices. For the quarter ended June 30th, 2020, the company reported a rise in revenue of 3.7% along with an increase in cash flow of 26.7% from the same period in 2019. The dividends paid by the company also increased by 5.7% compared to the same period last year. RGLD has an impressive earnings surprise history with the company meeting or surpassing consensus EPS estimates in three of the trailing four quarters. RGLD’s stock has gained close to 85% from the year-to-date low it hit in mid-March. RGLD distributes an annual dividend of $1.12, which yields 0.86%. RGLD’s strong fundamentals are reflected in its POWR Ratings. It has a “Buy” rating with an “A” in Trade Grade and Industry Rank. Within the Miners – Gold industry, it’s ranked #8 out of 30 stocks. Want More Great Investing Ideas? 9 “BUY THE DIP” Growth Stocks for 2020 How to Trade THIS Stock Bubble? 7 “Safe-Haven” Dividend Stocks for Turbulent Times GOLD shares were trading at $26.87 per share on Friday afternoon, down $0.27 (-0.99%). Year-to-date, GOLD has gained 45.45%, versus a 5.70% rise in the benchmark S&P 500 index during the same period."}]}