{"article": [{"url": "https://stocknews.com/news/unh-amt-td-dks-4-companies-aggressively-raising-dividends/", "published": 1600171700.0, "headline": "4 Companies Aggressively RAISING Dividends", "body": "Equity income investing has gained enormous traction amid the pandemic as the average investor is trying to secure a steady income with interest rates being very low. However, the relentless pandemic induced recession has caught up with companies that typically pay dividends, many of which slashed or discontinued payouts altogether. Dividend payments fell by $42.5 billion in the second quarter, compared to the year-ago quarter. A dividend is essentially a way for companies to return capital to shareholders. Companies typically pay dividends from free cash flow that their businesses generate. While the pandemic has affected the dividend paying ability of many companies, strong fundamentals along with a pandemic-ready business model and robust financials have helped some companies increase shareholder returns. UnitedHealth Group Incorporated (UNH), American Tower Corporation (AMT), Toronto Dominion Bank (TD), and Dick’s Sporting Goods Inc (DKS) are four stocks that have not only raised their dividend payments amid the crisis, but have been returning more and more capital to their shareholders through dividends. 7 Best ETFs for the NEXT Bull MarketUnitedHealth Group Incorporated (UNH) UNH operates as a diversified health care company in the United States. It operates through four segments – UnitedHealthcare, OptumHealth, OptumInsight, and OptumRx. It has recently collaborated with Morehouse School of Medicine to help expand Covid-19 research and health equity for individuals with Sickle Cell. UNH has been uniformly paying dividends every quarter for the past decade. Over the past ten years, the average dividends per share growth rate for UNH was 63.7% per year. The company increased its payout during the second quarter by 15.7% to $1.25. The most recent dividend declared by the company is for its third quarter ending September 2020. The annual dividend cumulates to $5, which translates into a dividend yield of 1.66%. UNH generated free cash flow of $9.6 billion in its last reported quarter, registering a 75% growth from its comparable quarter last year. The company also generated $10 billion in cash flow from operating activities during the quarter, accounting for a 70% rise year-over-year. The company posted a top-line of $62.1 billion, an increase of 2.5% from the year-ago quarter, primarily due to growth at Optum and the UnitedHealthcare public-sector and senior businesses. EPS for the quarter came in $7.12, beating the consensus and company’s own estimates. UNH has recently expanded its shared portfolio with Canopy Health, an accountable care network, for delivering a new low-cost health care plan for consumers in Northern California. Moreover, UNH is planning to enter the Memphis health insurance marketplace in the succeeding year. The market expects EPS to grow 23.5% per year over the next five years and hence, the dividend payout is expected to rise further. How does UNH stack up for the POWR Ratings? A for Trade Grade A for Buy & Hold Grade B for Peer Grade B for Industry Rank A for Overall POWR Rating. It is also ranked #1 out of 9 stocks in the Medical – Health Insurance industry. American Tower Corporation (AMT) AMT is a real estate investment trust (REIT) which invests in the real estate markets across the globe. It is an independent owner, operator, and developer of multi-tenant communications real estate, with a portfolio of approximately 181,000 communications sites, including more than 41,000 properties in the United States and 140,000 properties internationally. The company has been increasing its dividends consistently every quarter over the last decade. Its dividend has grown at a CAGR of 22% over the last five years. The most recent dividend declared by the company was $1.14 for the current quarter, implying a 20% increase from the year-ago quarter. AMT reported free cash flow of $768 million for the second quarter that ended in June 2020. The company delivered $2.01 as adjusted funds from operations (AFFO) per share attributable to the common stockholders. Revenues grew 1.2% year-over-year to $1.9 billion, as total tenant billing grew 10% year-over-year to $146 million. The company also repurchased its common stock worth $11 million during the quarter. During the second quarter, the company spent approximately $128 million to acquire 350 communications sites, primarily in international markets. In addition, the company spent $55 million to purchase 102 towers under a sublease agreement with AT&T. In line with the expansion spree, the street expects AFFO to grow 18.7% next year. AMT is rated a “Buy” in our POWR Ratings system, consistent with its growth estimates. It also has a grade of “A” in Trade Grade and Peer Grade, and a “B” in Buy & Hold Grade. Within the REITs – Diversified industry, it’s ranked #1 out of 50 stocks. Toronto Dominion Bank (TD) TD provides across-the-board commercial and retail banking services and products, along with wealth management services. The company operates through Canadian Retail, U.S. Retail, and Wholesale Banking segments. It ranks among the world’s leading online financial services firms, with more than 14 million active accounts. TD has CDN$1.7 trillion in assets at the end of its third quarter that ended on July 31, 2020. The stock has been consistently paying dividends each quarter since 1996. Over the last three years, dividend payout for TD grew at a CAGR of 10.3%. The most recent dividend declared by the company was $0.79 for its fourth quarter ending October 2020. It accounts to a 42.3% year-over-year increase in the payout. TD has significantly improved from the extensive effect of the pandemic on the banks. Consequently, the company reported free cash flow of $21.4 compared to the quarter-ago negative free cash flow per share of $12.6. Net interest income remained relatively stable compared to the preceding quarter. Loan volumes increased 6.6% year-over-year, while the average deposit volumes increased 25%. EPS for the quarter came in $1.1, as TD improved its provision for credit losses by 234% during the quarter, compared to the year-ago quarter. Continued volume growth, and strong wealth and wholesale revenue is helping TD to offset margin pressures. The market expects EPS to grow 6% in the current year because of its customer-centric strategy. TD is rated a “Buy” in our POWR Ratings system. It also has a grade of “A” in Peer Grade, and a “B” in Trade Grade and Buy & Hold Grade. TD is ranked third out of 44 stocks in the Foreign Banks industry. Dick’s Sporting Goods Inc (DKS) DKS is a leading omni-channel sporting goods retailer with operations primarily in the eastern United States. The company offers an extensive assortment of sports equipment, apparel, footwear and accessories. As of August 1, 2020, the Company operated 726 DICK’S Sporting Goods stores across the United States along with its e-commerce website and mobile app. The company has been consistently paying quarterly dividends since 2012. WERN’s annual dividend yield stands at 0.84%. The company increased its dividend by 13.8% in March, despite the pandemic, to $0.313. The most recent dividend declared by the company was in September for the current quarter. Its dividend has grown at a CAGR of 22.1% over the last three years. Free cash flow, for the second quarter that ended on August 1, 2020, stood $1.05 billion. This represents a year-over-year growth of 708%. DKS delivered its highest quarterly sales and earnings in the company’s history. Total revenue increased 20% year-over-year to $2.7 billion, primarily due to the 194% increase in eCommerce sales during the second quarter. Moreover, the company issued a $575 million aggregate principal amount of 3.25% Convertible Senior Notes to improve its liquidity. EPS for the quarter came in $3.12, growing 147.6% year-over-year and beating the consensus estimate by 147%. There has been a greater shift toward athletic and active lifestyle products with people spending more time working and exercising at home. Hence, DKS’s EPS is expected to grow by 75% in the current quarter. It’s no surprise that DKS is rated a “Strong Buy” in our POWR Ratings system, with a grade of “A” in Trade Grade, Buy & Hold Grade, and Peer Grade, and a “B” in Industry Rank. It is ranked #2 out of 33 stocks in the Athletics & Recreation industry. Want More Great Investing Ideas? 7 Best ETFs for the NEXT Bull Market Is the Stock Market Correction Over? Chart of the Day- See the Stocks Ready to Breakout UNH shares were trading at $309.39 per share on Tuesday afternoon, up $0.82 (+0.27%). Year-to-date, UNH has gained 6.59%, versus a 7.20% rise in the benchmark S&P 500 index during the same period."}]}