{"article": [{"url": "https://stocknews.com/news/peix-gpl-mdwd-3-small-cap-stocks-with-huge-growth-potential/", "published": 1601467700.0, "headline": "3 Small-cap Stocks with Enormous Growth Potential", "body": "Growth has been outperforming value quite significantly this year. The SPDR Portfolio S&P 500 Growth ETF (SPYG)has gained 18.8% so far this year. In comparison, the S&P 500 has gained approximately 2% However, many growth stocks have become expensive, and there are increasing chances of a sector rotation out of tech and into small-caps. Finding high-growth small-caps with solid earnings could be a good idea now. Stocks like Pacific Ethanol, Inc. (PEIX), Great Panther Mining Limited (GPL), and MediWound Limited (MDWD) are expanding their operations and have already delivered significant returns this year. Based on their earnings and revenue growth, these stocks are expected to see further gains in the upcoming months. 7 \"SAFE HAVEN\" Dividend Stocks for Turbulent TimesPacific Ethanol, Inc. (PEIX) PEIX is a producer and marketer of low-carbon renewable fuels domestically and internationally. The company also distributes ethanol along with related products. PEIX’s stock has delivered an outstanding performance by gaining 1109% so far this year. A large part of the company’s gains this year has been caused by the spread of the coronavirus. That’s because the company has been involved in producing hand sanitizers and active ingredients for disinfectants. The company has been working on expanding its production capacity of USP-grade alcohol by 30 million gallons per year. The new capacity will be effective in the fourth quarter of the year. During the quarter ended June 30th, the company reported an operating income of $22.6 million. This was a significant increase from the loss of $2.7 million during the same period last year. The company’s revenue is expected to grow by 8.7% next year. PEIX’s EPS is estimated to rise 302.9% next year and at a rate of 20% per annum over the next five years. How does PEIX stack up for the POWR Ratings? A for Trade Grade B for Buy & Hold Grade A for Peer Grade B for Industry Grade B for Overall POWR Rating The stock is also ranked #9 out of 27 stocks in the Agriculture industry. Great Panther Mining Limited (GPL) GPL explores, develops, and mines silver. The company has operations in Brazil and Mexico. The company has three wholly-owned mines along with four exploration projects. GPL has largely benefited from the rising price of silver. GPL’s stock has gained 78.4% so far this year. During the second quarter of the year, the company witnessed a rise in revenue of 48% year-over-year. The company also closed a bought deal financing with proceeds of $16.1 million. GPL is working on expanding its drilling operations in the Tucano region. GPL has also entered into a new agreement with Nyrstar for the postponement of the company’s remediation bond obligations. This agreement allows GPL to lower its short-term funding obligations and helps it to advance the development of its mine in Coricancha. The company’s revenue grew at a CAGR of 64.8% over the past three years. The forward revenue growth is 79.1%. It’s no surprise that GPL is rated a “Buy” in our POWR Ratings system, with a grade of “A” in Peer Grade and a “B” in Trade Grade and Buy & Hold Grade. In the 11-stock Miners – Silver industry, it is ranked #3. MediWound Limited (MDWD) MDWD is a biotechnology company that focuses on the development of products that help with the treatment of burns, chronic wounds, connective tissue disorder, along with others. The company’s stock has delivered year-to-date returns of 23.8%. The FDA has recently accepted the company’s application for NexoBrid which would help with the treatment of severe burn victims. The company is also working on EscharEx which would help with the treatment of chronic wounds. Further, MDWD is in the process of developing MWPC003 for the treatment of connective tissue disorders. In the second quarter of 2020, the company witnessed a rise in product revenue of 17% as compared to the same period last year. The company’s revenue is expected to grow by 6.4% next quarter and 8.7% next year. MDWD’s EPS is estimated to rise 57% next year and at a rate of 100% per annum over the next five years. MDWD’s strong fundamentals are reflected in its POWR Ratings, it has a “Buy” rating with an “A” in Trade Grade and Peer Grade. In the 376-stock Biotech industry, it is ranked #55. Want More Great Investing Ideas? Do NOT Buy Stocks Before the Election! 7 “Safe-Haven” Dividend Stocks for Turbulent Times Chart of the Day- See Christian Tharp’s Stocks Ready to Breakout PEIX shares fell $0.03 (-0.41%) in after-hours trading Wednesday. Year-to-date, PEIX has gained 1,024.62%, versus a 5.54% rise in the benchmark S&P 500 index during the same period."}]}