{"article": [{"url": "https://stocknews.com/news/tsla-fdx-nkla-rcl-4-stocks-that-gained-more-than-10-last-week/", "published": 1597666100.0, "headline": "4 Stocks That Gained More Than 10% Last Week", "body": "All the major stock market indexes such as the S&P 500, the Nasdaq Composite, and the Dow Jones Industrial Average remained almost flat last week. While the S&P 500 posted a modest gain of 0.64% for the week, it struggled to break the 3,386-resistance level that it set during its peak in February. The market’s hesitance to cross this peak may be partially attributed to traders booking their profits at this resistance level. The market’s reluctant bullishness could also be due to rising tensions between the US and China as the latter placed sanctions on 11 U.S. citizens last week. However, there are some stocks that have significantly outperformed the rest of the market. This could be a sign of underlying strength in these companies. Stocks such as Tesla (TSLA), FedEx (FDX), Nikola (NKLA), and Royal Caribbean (RCL) managed to gain more than 10% last week, so they’re worth watching. 9 \"BUY THE DIP\" Growth Stocks For 2020Tesla, Inc. (TSLA) The electric car maker gained 16.4% last week, significantly outpacing the Nasdaq’s gain of 0.1%. TSLA’s surge in the middle of last week may be attributed to two major factors. The company is going to conduct Battery Day during which a slew of important announcements for the company are expected. TSLA also announced a 5 for 1 stock split which drove the stock higher. TSLA may announce its new Model S Plaid soon which could lead to further upside for the stock. TSLA also had a stellar second quarter during which it delivered an earning’s surprise of 7,166.7%. TSLA has beaten EPS estimates in each of the trailing four quarters. How does TSLA stack up for the POWR Ratings? A for Trade Grade B for Buy & Hold Grade B for Overall POWR Rating The stock is also ranked #11 out of 27 stocks in the Auto & Vehicle Manufacturers industry. FedEx Corporation (FDX) FDX delivered a price return of more than 13.8% last week. The stock has gained 24.2% so far in August. FDX is quickly becoming a favorite pick for investors thanks to the tailwinds caused by the coronavirus in the courier-services sector. FDX has also benefited from the need of individuals to make more of their purchases online, rather than in-person. Shares of FDX may also rise due to a large opportunity that lies ahead for the company. If there is a coronavirus vaccine, large shipments of the vaccine will need to be shipped to locations across the U.S. and the rest of the world. The capacity of the company is also running tight across its global supply chain, which could bode well. In the quarter ending May 30th, the company posted a positive earnings surprise of 66.4%, which could be an indicator of continued positive momentum for the company. It’s no surprise that FDX is rated a Strong Buy in our POWR Ratings system. It also has a grade of A for Trade Grade, Buy & Hold Grade, Peer Grade, and Industry Rank. In the 9-stock Air Freight & Shipping Services industry, it is ranked #2. Nikola Corporation (NKLA) NKLA is another electric vehicle manufacturer on this list, as it has delivered price returns of more than 25% last week. NKLA manufactures both hydrogen-electric and battery-electric vehicles along with energy storage systems and hydrogen fuel stations. NKLA’s stellar performance last week can be attributed to its announcement that it is considering partnering with Hyundai to work on Hydrogen fuel-cell technology. If this partnership comes to fruition, it could lead to further upside for the electric vehicle manufacturer. The company has also secured a purchase order of 2,500 electrified refuse trucks, which may be one of the biggest single orders in the refuse industry. A lot of NKLA’s valuation is based on potential, rather than proven track-record. The company’s focus on hydrogen powered vehicles could be a gamechanger in the future. It is estimated that NKLA will see a revenue growth of 120,483.3% next year. Royal Caribbean Cruises (RCL) RCL runs cruises under the brand names of Celebrity Cruises, Azamara Club Cruises, Royal Caribbean International, and more. Being a luxury cruise company, the firm is facing greater than average challenges due to the spread of the coronavirus. Cruise liners were shut for the better part of the second quarter of the year. However, despite the prevailing challenges, the company’s stock delivered a price return of 15.8% last week. The significant uptick in the stock took place after the company reported its quarterly results on Monday. The most noteworthy part of the earnings report was the outlook for 2021, which remains positive, and the number of bookings they are receiving for the next year, which look steady. The company is estimated to see a growth in revenue of 137.4% for 2021.RCL’s POWR Ratings reflect this promising outlook with a grade of A for Peer Grade. Among the 5 stocks in the Travel – Cruises industry, it’s ranked #1. Want More Great Investing Ideas? The Best of StockNews 3 Possible Directions for the Stock Market from Here 9 “BUY THE DIP” Growth Stocks for 2020 TSLA shares were trading at $1,820.61 per share on Monday afternoon, up $169.90 (+10.29%). Year-to-date, TSLA has gained 335.21%, versus a 6.02% rise in the benchmark S&P 500 index during the same period."}]}