{"article": [{"url": "https://stocknews.com/news/mrk-nvo-jnj-sny-why-you-should-add-this-vaccine-maker-to-your-portfolio/", "published": 1600344500.0, "headline": "Why You Should Add This Vaccine Maker to Your Portfolio Now", "body": "Merck & Co., Inc. (MRK) is one of the biggest names in the pharmaceutical industry, particularly in the field of cancer drug research. It’s biggest drug invention to date is KEYTRUDA, which is used in immunotherapy for multiple cancer treatments. During the pandemic, MRK applied its expertise to finding a vaccine for the coronavirus. Though the company appears to be lagging behind its competitors, it is pursuing a different strategy as it wants to offer a one-shot solution. As a result, it plans to acquire Austrian company Themis Bioscience for this purpose and plans to roll out the product by April 2022. This vaccine could provide MRK a breakthrough to branch out to research and develop medications for a plethora of diseases in the future. 9 \"BUY THE DIP\" Growth Stocks For 2020Though MRK has delivered a negative 4.7% year-to-date returns, the company’s unique approach to COVID-vaccine development is likely to generate substantial revenues in the upcoming years. It’s an impressive business outlook and several other factors have helped the stock earn a “Strong Buy” rating under our proprietary rating system. Here’s how our proprietary POWR Ratings system evaluates MRK: Trade Grade: A MRK is currently trading above its 50-day and 200-day moving averages of $82.09 and $81.90, respectively, indicating a golden-cross bullishness. It gained 11.2% in the past three months, which reflects a short-term uptrend in the stock. In the past couple of months, MRK has successfully rolled out approved medications for the treatment of plaque psoriasis, psoriatic arthritis, idiopathic arthritis, and esophageal carcinoma. MRK entered into a strategic oncology collaboration with Seattle genetics for a $1 billion equity stake. It also announced positive results from the phase three clinical trials of V114. It is one of the major companies aiming to develop a vaccine for coronavirus that requires just a one-time injection and is currently conducting human trials. MRK reported a 29% year-over-year increase in the sale of KEYTRUDA drugs in the second quarter ended June 2020, generating $3.39 billion in revenue. This bolstered GAAP net income 12.4% from the year-ago value to $3 billion. Diluted EPS increased 15% from the same period last year to $1.18. Buy & Hold Grade: A In terms of proximity to its 52-week high, which is a key factor that our Buy & Hold Grade takes into account, MRK is well-positioned. It is currently trading just 8.3% below its 52-week high of $92.64. MRK has gained 29.3% in the past three years, which can be attributed to its solid earnings and revenue growth. Net revenues increased at a CAGR of 5.7% in the past three years, while net income increased at a CAGR of 27.3% over the same time. EBITDA and diluted EPS increased at CAGR 12.9% and 30.5%, respectively, in the past three years. MRK’s diversified drug pipeline for the treatment of cancer and other critical ailments has contributed to the company’s long-term growth. Peer Grade: A MRK is ranked #2 out of 232 stocks in the Medical – Pharmaceuticals industry. Other popular stocks in this industry are Johnson & Johnson (JNJ), Novo Nordisk A/S (NVO), and Sanofi ADR (SNY). JNJ, NVO, and SNY have returned 1.7%, 17.4%, and 3.2% year-to-date, respectively, versus MRK’s negative returns. However, the company is better positioned than many of its peers in terms of product pipeline and growth in financials. Industry Rank: B The Medical – Pharmaceutical industry is ranked #5 out of 123 industries in the StockNews.com universe. Major pharmaceutical companies across the world are in the race to develop a proper vaccine for the treatment of coronavirus. With millions of people affected globally, the pharmaceutical industry is under immense pressure to deliver results in the upcoming months. These companies stand to gain substantially upon the development of a vaccine or medicine, owing to rising global demand. Overall POWR Rating: A (Strong Buy) MRK has a “Strong Buy” rating owing to its impressive past performance, short-and-long-term bullishness, price momentum, and industry strength, as determined by the four components of our overall POWR Rating. Bottom Line MRK has the potential to grow significantly in the upcoming months based on its business growth, solid past performance, and short- and long-term bullishness. The company has an impressive earnings surprise history, as it beat the street EPS estimates in each of the trailing four quarters. Want More Great Investing Ideas? 7 Best ETFs for the NEXT Bull Market Is the Stock Market Correction Over? Chart of the Day- See the Stocks Ready to Breakout MRK shares rose $0.10 (+0.12%) in after-hours trading Thursday. Year-to-date, MRK has declined -3.61%, versus a 5.42% rise in the benchmark S&P 500 index during the same period."}]}