{"article": [{"url": "https://stocknews.com/news/sap-otex-2-strong-buy-software-stocks-that-pay-dividends/", "published": 1598962100.0, "headline": "2 \"Strong Buy\" Software Stocks That Pay Dividends", "body": "There are high-quality, dividend-paying software stocks that are rated a Strong Buy. This group is attractive due to software being one of the fastest-growing sectors with juicy margins and high amounts of recurring revenue. &nbsp The dividends help them generate a healthy income stream that can deliver outperformance during rough market conditions. These stocks also have strong balance sheets which make their dividends more secure. &nbsp The best part about investing in software stocks that pay a dividend is there is still an annual return even if the stock dips down below the purchase price. Though there is no guarantee the dividend will completely offset a potential loss, it certainly softens the blow in the event of an unforeseen pullback. &nbsp SAP (SAP) and Open Text Corporation (OTEX) are two stocks that are rated a Strong Buy and pay above-average dividends. SAP (SAP) 9 \"BUY THE DIP\" Growth Stocks For 2020The development of software solutions for businesses is inherently challenging. SAP embraces this challenge and licenses its solutions for use by others. Furthermore, SAP also sells consulting, training, maintenance, and additional services for its software products. This Walldorf, Germany-based software industry superstar is one of the largest software vendors in existence. SAP’s forte is enterprise resource planning software or ERP for short. Companies of varying sizes in all sorts of niches use SAP’s software solutions to obtain insights and make prudent, well-informed decisions. The POWR Ratings reveal SAP has A grades in each POWR Component. Of 92 Software – Application stocks, SAP is ranked third. Of the eight analysts who have reviewed the stock, five recommend buying, three advise holding and none believe selling is a wise decision. SAP has a reasonable forward P/E ratio of 28, especially when contrasted with other high-flying, overvalued tech stocks. The question is how high will SAP go? The stock dipped down near $90 when the market headed south this past spring only to bounce right back up within a month and soaring to new heights in mid-summer. If SAP investors take some of their profits off the table in the days and weeks ahead, those who have been waiting on the sidelines will have a golden opportunity to swoop in and establish a position at a reasonable price point. Open Text Corporation (OTEX) Plenty of investors are unaware of the opportunity presented by OTEX. This company is an innovator in the extranet, intranet, and e-Business. OTEX started as a search engine builder and has held steady as a web trailblazer in the decades since. In short, OTEX solutions empower individuals, businesses, and teams to work in unison on projects, ramp up innovation, and share information as quickly as possible. These are important business solutions yet the mainstream media rarely shifts the spotlight in OTEX’s direction. The OTEX POWR Ratings show the stock has A grades in each POWR Component category but for its Peer Grade of B. OTEX is ranked 13th of 92 stocks in the Software – Application segment. The top analysts insist OTEX has a 5% upside, setting a price target of $47.60 for the stock. It is particularly interesting that OTEX has a forward P/E ratio of 15.46, meaning it is likely undervalued at its current trading price of $46. OTEX’s information management solutions will only become that much more important as the information age accelerates. OTEX acquired CARB, a data protection company last winter, making it the ninth business OTEX purchased since its inception. Look for OTEX to continue integrating new acquisitions, expanding its umbrella all the more as time progresses. Each successive acquisition makes OTEX that much better of a long-term investment. This is the type of tech stock you buy and hold for decades. Want More Great Investing Ideas? 7 Best ETFs for the NEXT Bull Market Beware Stocks in September? 9 “BUY THE DIP” Growth Stocks for 2020 SAP shares were trading at $166.11 per share on Tuesday morning, up $0.70 (+0.42%). Year-to-date, SAP has gained 25.27%, versus a 10.15% rise in the benchmark S&P 500 index during the same period."}]}