{"article": [{"url": "https://stocknews.com/news/aapl-goog-nvda-bidu-the-4-best-ai-stocks-to-boost-your-portfolio/", "published": 1594901300.0, "headline": "The 4 \"Best AI Stocks\" to Boost Your Portfolio", "body": "Artificial intelligence (AI) is becoming a great investment opportunity. It is one of the fastest-growing markets in the world. Grand View Research estimates that the AI market will grow by 46.2% between 2019 and 2024. Consulting firm Omdia Tractica expects revenues for 2025 to reach $126 billion. Millions of consumers already interact with AI on a day-to-day basis. AI powers Alexa and Siri, facial-recognition technology, chatbots, and gaming platforms. The technology should continue to improve through learning and solving problems. For instance, car companies investing heavily in self-driving technology. We are only beginning to test AIs capabilities. Here are four artificial intelligence stocks to take advantage of this exploding growth industry. Apple, Inc (AAPL) 9 \"BUY THE DIP\" Growth Stocks For 2020According to CB Insights, AAPL has been acquiring several promising AI startups. Since 2010, Apple has added 20 such startups to its portfolio, which is higher than other tech giants such as Facebook (FB), Amazon (AMZN), and Google (GOOGL). Apple is primarily using its AI acquisitions to power its hardware and software products. In the recent WorldWide Developers Conference, AAPL announced several features for its macOS, iPad, and iOS products that are powered by AI technology such as facial recognition, sleep tracking, handwashing countdown, and so on. As technology grows smarter and the market for smart products powered by AI grows, AAPLcould stand to gain significantly. The stock has also been performing pretty well in this “new normal”. It has added close to 80% to its stock price since its low of $212.6 on March 23rd.AAPL’s earnings surprise history looks impressive, with the company beating the consensus EPS estimates in each of the trailing four quarters. How does AAPL stack up for the POWR Ratings? A for Trade Grade A for Buy & Hold Grade A for Industry Rank A for Peer Grade A for overall POWR Rating You can’t ask for better. The stock is also ranked #1 out of 28 stocks in the Technology – Hardware Industry. Nvidia Corporation (NVDA) NVDA, long known as a graphics-chip maker for video gaming, has evolved into an accelerated computing company. It is more of a data-center company now with its increased focus on AI and machine learning. NVDA recently entered into a partnership with Google Cloud to power its cloud infrastructure for improving artificial intelligence workloads. This new chipset, called the A100, is powerful enough to power AI to tell the difference between scientific computing, 5 services, and more. The A100 could be a gamechanger for NVDA and firmly places it on the leaderboard for AI-focused companies. In another win for the company, NVDA announced its partnership with Mercedes-Benz to provide a software-defined computer network for its cars. NVDA’s recent price performance reflects its ability to capitalize on the recent trend to go digital. The stock has gained more than 65% since hitting a year-to-date low in mid-March. The consensus estimates for NVDA’s July-end quarter of $1.97 reflects a year-over-year improvement of 59%. Moreover, you should note that the company beat the consensus EPS estimates in each of the trailing four quarters. It’s no surprise that NVDA is rated a “Strong Buy” in our POWR Ratings system. It also has an “A” for Trade Grade, Buy & Hold Grade, Peer Grade, and Industry Rank. In the 86-stock Semiconductor – Wireless Chip industry, it is ranked #2. Alphabet Inc. (GOOGL) GOOGL is another heavyweight on the frontlines of the AI-revolution. Recently, the company entered into a partnership with Verizon to provide Contact Center AI service to power Verizon’s customer service. AI is powerful enough to understand customer queries through natural language recognition. GOOGL has also been working on disparate technologies, such as the cloud, artificial intelligence, and machine learning to create specific tools that empower users. Carmaker Renault has also partnered with Google Cloud to use its artificial intelligence, machine learning, and analytics capabilities to make their operations more efficient. GOOGL is working hard to stay on the frontlines in the development of AI capabilities, and these investments today could lead to big payoffs in the future. Like other tech giants, GOOGL capitalized on the rising demand for digital platforms and gained more than 40% since hitting this year’s low in March. GOOGL is rated “Strong Buy” in our POWR Rating system, consistent with the strength of its business model. It also has an “A” for Trade Grade, Buy & Hold Grade, and Industry Rank, and a “B” in Peer Grade. It is also ranked #2 out of 54 stocks in the Internet industry. Baidu, Inc. (BIDU) Baidu, the Google of China, also has big plans centered around AI. The company has announced plans to train around 5 million people in AI to charge its foray into a smart economy and society. The company has been partnering with several Chinese universities to help them develop courses on AI. Baidu is well-poised to become an AI-technology leader in China, as well as globally. BIDU’s stock has recovered 52.9% from the 52-week low in mid-March due to the overall dip in the market. The company’s strong recovery could be part of a growth momentum that could last well for the rest of 2020. BIDU’s earnings surprise history looks impressive, with the company consistently surpassing the consensus ESP estimates in the trailing four quarters. The market also expects the company to report EPS of $9.7 for the quarter ended June 2020, which represents significant growth over the number a year ago. BIDU’s strong fundamentals are reflected in its POWR Ratings. It has a “Buy” rating with an “A” in Trade Grade, Peer Grade, and Industry Rank along with a “B” grade in Buy & Hold. Within the China group, it’s ranked #19 out of 115 stocks. Want More Great Investing Ideas? 9 “BUY THE DIP” Growth Stocks for 2020 Newly REVISED 2020 Stock Market Outlook 7 “Safe-Haven” Dividend Stocks for Turbulent Times AAPL shares were trading at $386.09 per share on Thursday afternoon, down $4.81 (-1.23%). Year-to-date, AAPL has gained 32.15%, versus a 0.72% rise in the benchmark S&P 500 index during the same period."}]}