{"article": [{"url": "https://stocknews.com/news/msft-wmt-microsoft-buying-tiktok-will-vault-it-past-apple/", "published": 1598616500.0, "headline": "Microsoft Buying TikTok Will VAULT It Ahead of Apple", "body": "Currently, Apple (AAPL) is the largest company in the world with a market capitalization of $2.14 trillion. Microsoft (MSFT) is second, with a market cap of $1.71 trillion. If Microsoft can successfully close the TikTok deal, it could be the catalyst it needs to overtake AAPL. TikTok is a video-based social media platform where users create short videos. It has 800 million active users globally and is the fastest-growing social media company and is popular among teenagers and young adults. It has the potential to become as big as Instagram or YouTube. 7 Best ETFs for the NEXT Bull MarketDue to the format of TikTok, it’s also more conducive to delivering ads in a non-intrusive way. Over the years, Microsoft has become more of an enterprise-focused business with revenue growth coming from cloud computing, but TikTok could once again make it relevant to consumers. Recent Developments It seems that we are getting closer to a TikTok deal, with the September 15th deadline rapidly approaching. Yesterday, TikTok’s CEO, Kevin Mayer resigned which is another sign that an acquisition may be imminent. Currently, the lead horse in the race is Microsoft and Walmart (WMT), teaming up for a joint bid. Walmart would become TikTok’s e-commerce provider and handle payment processing. Oracle (ORCL) is also in the running but not seen as a favorite. Reportedly, Amazon (AMZN) and Google (GOOG) were sniffing around but didn’t think they had a good chance of getting regulatory approval. This high-level of interest among the top tech companies is one indication that TikTok is an attractive asset. TikTok’s price is rumored to be somewhere between $20 billion and $30 billion. This makes its value equivalent to a Twitter (TWTR) or Snap (SNAP) as both companies have around a $30 billion market cap. However, despite being a much younger company, TikTok has eclipsed both in terms of users and is set to pass them by in revenue next year. Forced Selling Some of the best opportunities in the market come due to forced selling. We see this dynamic at market bottoms when shares are liquidated due to margin calls. An adjacent situation is with spinoffs when companies are forced to divest and separate operations. Spinoffs tend to outperform the market, following an initial period of weakness. The situation with TikTok is similar. Its parent company, ByteDance is either going to have to sell the company or shut down operations in the US. ByteDance has been accused by President Trump of close ties with the Chinese Communist Party. It’s gone to great lengths to create separation with its subsidiary by headquartering it in a different country and storing user data separately. However, these efforts haven’t changed perceptions. For one, there have been many incidents of censorship of videos critical of China or the Chinese government. Second, reports show that there have been breaches of user data and the app is intrusive in terms of mining data from phones. These features are also remotely configurable to an unusual degree which means it can be turned on or off. Additionally, the company’s privacy policy states that it has the right to share any data with Chinese authorities if necessary. Many companies and branches of the government have banned TikTok from employees’ phones and computers due to these concerns. These issues have created an opportunity to buy TikTok, and Microsoft is ideally suited. Microsoft is a natural suitor because it has the resources to make a bid, the technical knowhow to guard user data, and no presence in social networking. This means there are no antitrust concerns unlike Google or Facebook (FB). TikTok’s Incredible Potential and Growth The initial reaction by many grizzled market veterans was to scoff at TikTok’s valuation. However, I don’t think this is correct. Both Instagram and YouTube have launched clones of TikTok in recent weeks in recognition of the app’s popularity and potential. Facebook’s stock shot up 13% upon announcing Instagram Reels, which is its version of TikTok. This was an increase of $100 billion in its market cap. This is another clue that TikTok’s current price is a bargain for Microsoft. Its product also appeals to teenagers and young adults which is the most coveted demographic for young adults. Its rapid-fire, algorithmic delivery of short videos is also perfectly calibrated for the shorter attention spans of a generation who has grown up with smartphones. Currently, the app has 800 million active monthly users worldwide. In the US, it has 100 million monthly active users, and 50 million daily active users. Its user numbers have grown by 800% since January 2018. The average user spends 52 minutes a day on the app and opens it eight times a day. Remarkably, the app is only a couple of years old. In 2020, it expects to earn $1 billion in revenue and is projecting $6 billion in revenue next year. In China, TikTok has been operating for a longer time and is generating more ad revenue than any other online media company including Alibaba (BABA) and TenCent despite being much younger. If current trends continue, TikTok could surpass YouTube and Instagram. Last year, YouTube generated $16 billion in revenue and Instagram’s ad sales were $20 billion. Closing Thoughts Many people still think of TikTok as a fad. But, I think it’s more likely that it’s become THE platform for Generation Z. It’s already reached a significant size and has a growth rate that is similar to Facebook or Instagram in the early days. However, it has done a better job of monetizing users. Given the premiums that are paid in public markets for growth stocks that have a “sticky” product, high margins, and a triple-digit revenue growth, TikTok at $20 billion to $30 billion is a bargain. It will give Microsoft a consumer-facing product that will complement its cloud computing division. In addition to its cash-cow software business, it will have two of the fastest-growing, high margin businesses in the world. This will vault it past Apple to become the most valuable company in the world. Microsoft’s POWR Ratings are also very bullish. It’s rated a “Strong Buy” with an “A” across all POWR components including Trade Grade, Buy & Hold Grade, Peer Grade, and Industry Rank. It’s ranked #1 out of 92 out of the Software – Applications group. Want More Great Investing Ideas? 7 Best ETFs for the NEXT Bull Market Why Stocks Could Drop 20% in September? 9 “BUY THE DIP” Growth Stocks for 2020 MSFT shares . Year-to-date, MSFT has gained 46.31%, versus a 10.05% rise in the benchmark S&P 500 index during the same period."}]}