{"article": [{"url": "https://stocknews.com/news/slv-how-to-earn-8-5-with-the-ishares-silver-trust-slv/", "published": 1594210100.0, "headline": "How To Earn 8.5% with the iShares Silver Trust (SLV)", "body": "When uncertainty grips the market, investors often turn to precious metals for safety. Well, at least they used to. These days, most of the action in precious metals is in gold. The price of gold has climbed nearly 19% in 2020 to date. Silver has been okay, up 4% so far this year. Platinum, on the other hand, is down 12%. Many investors like gold (and historically other precious metals) because it serves as a currency replacement not tied to any one central bank or government. As such, there are a variety of investment vehicles that can be used to gain exposure to gold. There is roughly the same amount of access to silver-related investments as well. 9 \"BUY THE DIP\" Growth Stocks For 2020Silver has outperformed stocks on a broad basis this year but is lagging far behind gold in terms of year-to-date performance. On the other hand, it is up nearly 57% from its low in March. As gold gets more expensive, some precious metal buyers have turned to silver as the more affordable precious metal. iShares Silver Trust (SLV) One of the most popular methods of trading silver is by using iShares Silver Trust (SLV). SLV is based on the price of silver bullion (as opposed to silver futures). The exchange-traded fund (ETF) currently has over $9 billion in assets under management and trades an average of over 25 million shares a day. At least one well-capitalized trader is bullish on SLV through January of 2021. This trade is using covered calls to express this bullish opinion. Remember, a covered call is when the stock is purchased and calls are sold against those shares at the same time (and generally at a higher strike than the stock price). In this case, two large covered call trades were made with SLV trading at $17.08. A total of 16,000 calls were sold (versus 1.6 million shares), 8,000 at the 21 strike expiring in January 2021, and 8,000 at the 22 strike, also in January 2021. The 21 calls were sold for 79 cents each, or $632,000 in premium collected. The 22 calls were sold for 66 cents each, or $528,000. Total premium collected on the trade was roughly $1.2 million. That means the yield on both trades together is 8.5% over the next six months (approximately). Considering that interest rates are close to zero and SLV doesn’t pay a dividend, that’s a heck of a yield. Moreover, because the strikes are set at 21 and 22, SLV can climb and average of $4.50 before capping out. If the price of silver skyrockets, there will be money left on the table, but I don’t think the trader will care too much after hitting max gain of nearly $6 million. Finally, because precious metals are popular in times of uncertainty (and low interest rates), there likely isn’t a lot of downside to this trade. It’s hard to imagine the price of silver plunging by next January (especially a prolonged drop in the price). In other words, this type of trade could be an excellent way to generate a solid yield and gain exposure to silver’s upside potential. Want More Great Investing Ideas? Top Dividend Stock to Own! Download Free Report Today Buy These 3 High-Yield Dividend Stocks All Under $15 Buy and Hold These 3 Dividend Stocks Forever SLV shares rose $0.02 (+0.11%) in after-hours trading Wednesday. Year-to-date, SLV has gained 4.86%, versus a -0.75% rise in the benchmark S&P 500 index during the same period."}]}