{"article": [{"url": "https://stocknews.com/news/dhr-itw-de-3-strong-buy-industrial-stocks-trading-above-their-moving-averages/", "published": 1598011700.0, "headline": "3 “Strong Buy” Industrial Stocks Trading Above Their Moving Averages", "body": "When a stock trades above its moving averages, it indicates that the stock is on a bullish path. This could be an encouraging sign for investors. A moving average, such as the 200-Day moving average, is a technical indicator that averages out price trends to show how a stock is performing compared to its recent trend. Traders look for stocks that are above their moving averages. Even though Covid-19 has wreaked havoc in the Industrial-Machinery industry, the industry has demonstrated a rapid v-shaped recovery and has been on an upward trend since its March lows. The Industrial Select Sector SPDR ETF (XLI) has lost 5.8% year-to-date, compared with a 6.2% gain for the SPDR S&P 500 ETF (SPY). However, XLI has gained more than 50% since its March lows. Danaher Corporation (DHR), Illinois Tool Works Inc. (ITW) and Deere & Company (DE) are three Industrial stocks that are currently trading above their moving averages and also have a Strong Buy rating in our proprietary POWR Rating system. 9 \"BUY THE DIP\" Growth Stocks For 2020Danaher Corporation (DHR) This global science, technology, and innovation company based in Washington, has gained more than 65% since its March lows. DHR’s closing price at the end of yesterday’s trading session was $205.66, higher than both its 50-day MA of $189.81, and its 200-day MA of $161.85. In the second quarter ending July 3rd 2020, adjusted earnings per share increased 32%, revenues increased 19%, and free cash flow increased 41% year-over-year. Nine out of eleven Wall Street Analysts have a Buy rating for the stock. DHR’s consensus revenue estimate of $5.49 billion for the quarter ending September 2020, indicates a year-over-year increase of 9.1%. Also, the market expects the company to report earnings per share of $1.36 for the current quarter, representing a 28.3% improvement over the year-ago EPS. How does DHR stack up for the POWR Ratings? A for Trade Grade A for Buy & Hold Grade A for Industry Rank B for Peer Grade A for Overall POWR Rating The stock is also ranked #1 out of 59 stocks in the Industrial-Machinery industry. Illinois Tool Works Inc. (ITW) This Fortune 200 global multi-industrial manufacturing leader closed yesterday’s trading session at $193.74, higher than both its 50-day MA of $180.89, and its 200-day MA of $171.80. The stock has grown more than 60% since it hit its 52-week low of $115.94 on March 23rd. ITW ended the second quarter with approximately $1.8 billion in cash and cash equivalents on hand, along with a revolving credit facility of $2.5 billion. Furthermore, ITW had no short-term debt and its free cash flow increased 12% year-over-year. Chairman and CEO of ITW E. Scott Santi said, “Despite the near-term challenges of the moment, we remain deeply committed to achieving and sustaining ITW’s full-potential performance, and we will utilize our financial strength and flexible cost structure to protect investments in areas of strategic importance to the execution of our long-term strategy. I am confident that the strength and resilience of the ITW Business Model, our high-quality diversified business portfolio, and our people put us in a strong position to deal decisively and effectively with the effects of the pandemic however it plays out from here while remaining focused on executing our long-term enterprise strategy.” ITW’s earnings surprise history looks pretty good with the company surpassing consensus EPS estimates in each of the trailing four quarters. ITW has an annual dividend of $4.28, which yields 2.21%. ITW’s POWR Ratings reflect this promising outlook. It has an overall rating of Strong Buy with a grade of A for Trade Grade, Buy & Hold Grade, Peer Grade, and Industry Rank. Among the 59 stocks in the Industrials – Machinery industry, it is ranked #4. Deere & Company (DE) DE provides advanced technology, products, and services for agriculture and construction. DE closed yesterday’s trading session at $191.90, higher than both its 50-day MA of $170.28, and its 200-day MA of $160.19. The stock has gained more than 70% since its March lows. DE has an impressive earnings surprise history with the company surpassing consensus EPS estimates in three of the trailing four quarters. DE’s EPS grew at an annualized rate of 11.8% over the past five years. Moreover, the market expects the company’s EPS to increase 39.3% next year. DE expanded its frontier equipment line-up with the recent additions of new loader carrier adapters, pallet fork grapples and tractor-mounted sprayers. DE also announced the availability of its Mulcher Hydraulics Conversion Kit for the 843L and 843L-II Wheeled Feller Bunchers in order to enhance versatility of its machines.DE has increased its yearly net income forecast to about $2.25 billion. Moreover, the company’s new smart-industrial operating model is already showing positive signs. It’s no surprise that DE is rated a Strong Buy in our POWR Ratings system. It also has a grade of A for Trade Grade, Buy & Hold Grade, Peer Grade, and Industry Rank. In the 59-stock Industrial-Machinery industry, it is ranked #3. Want More Great Investing Ideas? The Best of StockNews 2 Step Process to Sell @ Market Top in September 9 “BUY THE DIP” Growth Stocks for 2020 DHR shares were trading at $207.74 per share on Friday afternoon, up $2.08 (+1.01%). Year-to-date, DHR has gained 35.68%, versus a 6.56% rise in the benchmark S&P 500 index during the same period."}]}