{"article": [{"url": "https://stocknews.com/news/lvgo-fit-pton-3-popular-health-and-wellness-stocks-on-robinhood/", "published": 1594901300.0, "headline": "3 Popular Health and Wellness Stocks on Robinhood", "body": "As many Americans have been stuck at home watching Netflix (NFLX) and eating poorly, some have decided to revisit their New Year’s resolutions and get healthy again. The U.S. is known for its sky-high obesity rates, but according to Gallup, people have been exercising more regularly over the past few years. This has benefited the health and wellness industry as it has seen significant growth over the past couple of years. This is a great opportunity for investors to take advantage of this growing market. Many investors on the Robinhood platform are already investing in this industry. The platform even offers a list of the most popular stocks in that industry. Here are three popular stocks that are on the Robinhood Health and Wellness list. Livongo Health (LVGO) 7 Best ETFs for the NEXT Bull MarketLVGO is an applied health signals company that assists people affected by chronic health conditions. The platform provides personalized health signals and includes health conditions such as diabetes, hypertension, weight management, and behavioral health. LVGO has invested in building an integrated product experience with a whole-person approach to cater to multiple chronic conditions. The company has also added Covid-19 modules for support and made them available to all clients. LVGO did not perform well following its IPO in July 2019 until the coronavirus outbreak, but the stock skyrocketed since the pandemic hit the market hard in mid-March. The stock has gained more than 185% since then. In the first quarter this year, the company’s total revenue increased 115% year over year and Livongo for Diabetes members increased 100% year over year to more than 328,000. LVGO expects second-quarter revenue in the range of $86 million to $87 million, which is higher than its prior guidance of $73 million to $75 million. The consensus revenue estimate for the quarter indicates almost a 100% year-over-year increase. Moreover, LVGO has an impressive earnings surprise history with the company beating consensus EPS estimates in each of the trailing four quarters. How does LVGO stack up for the POWR Ratings? A for Trade Grade A for Buy & Hold Grade A for Peer Grade B for Industry Rank A for Overall POWR Rating You can’t ask for better. The stock is also ranked #5 out of 67 stocks in the Medical Services industry. Fitbit, Inc. (FIT) FIT provides a platform that combines wearable devices with software and services and helps customers accomplish their fitness goals. FIT made new additions in the first quarter, such as Fitbit Charge 4 and Active Zone Minutes. FIT also added content to Fitbit Premium, a paid subscription service that offers personalized health guidance, and over 200 workouts. FIT is keen on growing the Fitbit Health Solutions channel, which could be a key performance driver. Last year, Alphabet (GOOGL) announced that it would buy Fitbit for $2.1 billion, and the deal was expected to be closed sometime in 2020. But there could be a delay in closing this deal as the search engine giant is getting closer scrutiny from EU regulators regarding its increased access to sensitive data from Fitbit’s hardware. Alphabet (GOOGL) has recently said that it would not use health data of FIT to target ads and that the focus of the deal is hardware, not data, in an attempt to convince EU regulators. The closure of the deal could be good for FIT stock. The first news of Alphabet’s (GOOGL) acquisition of FIT caused a huge spike in price at the end of October in 2019. However, since then, there has not been a massive movement of FIT’s price. FIT’s POWR Ratings reflect this promising outlook. It has an overall rating of “Buy” with an “A” for Buy & Hold Grade and a “B” for Trade Grade and Industry Rank. Among the 32 stocks in the Athletics & Recreation group, it’s ranked #10. Peloton Interactive, Inc. (PTON) PTON is an interactive fitness platform that offers an array of classes in various fitness disciplines such as yoga, strength training, boot camp, meditation, and indoor cycling. PTON continues to sell its connected fitness products through e-commerce and inside sales channels. The company adopted curbside and threshold delivery early in the COVID- 19 crisis and currently provides live programming from instructors’ homes for its members. PTON is financially flexible, with a $250 million additional credit facility. PTON is focused on developing an affordable low priced tread that would attract subscribers as PTON’s existing internet-connected treadmills are rather expensive. This would help expand PTON’s customer network. PTON has gained more than 145% since it started trading in September 2019. In the fiscal quarter ended March 31st, the company’s connected subscribers grew 94% year over year, digital subscribers grew 64% year over year, and total revenue grew by 66%. The 12-month retention rate for connected fitness subscribers was 93%, which shows that most customers were happy with the service. Twenty out of Twenty-Two Wall Street analysts recommend a ‘Buy’ rating on the stock. Want More Great Investing Ideas? 9 “BUY THE DIP” Growth Stocks for 2020 Newly REVISED 2020 Stock Market Outlook 7 “Safe-Haven” Dividend Stocks for Turbulent Times LVGO shares were trading at $103.56 per share on Thursday afternoon, down $4.75 (-4.39%). Year-to-date, LVGO has gained 313.25%, versus a 0.69% rise in the benchmark S&P 500 index during the same period."}]}