{"article": [{"url": "https://stocknews.com/news/dks-foxf-alle-3-stocks-to-take-advantage-of-surging-bike-sales/", "published": 1595592500.0, "headline": "3 Stocks to Take Advantage of SURGING Bike Sales", "body": "The coronavirus has impaired most of the travel & leisure industry. However, certain activities, like biking, are booming. That’s because it can be done outside while maintaining social distancing guidelines. On bikes, people are able to explore their surroundings and get exercise even during the coronavirus pandemic. According to the Guardian, bike riding is up by 50 to 100% over the last couple of months in major US cities due to the coronavirus. Given the number of activities that have been canceled, it makes sense that the few activities that remain safe are seeing huge growth. 9 \"BUY THE DIP\" Growth Stocks For 2020Fox Factory Holding (FOXF), Allegion (ALLE), and Dick’s (DKS) are ready to take advantage of biking’s increased popularity: Fox Factory Holding Corp (FOXF) FOXF manufactures and markets products such as suspension systems for mountain bikes, road bikes, and e-bikes and powered vehicle accessories. It has three trademarks under which all products are sold —Fox, Fox Racing Shox, and Race Face. Despite the auto and vehicle manufacturers industry being hard hit by the ongoing healthcare crisis, FOXF managed to report a 14% year-over-year increase in its net sales at $184.40 million for the first quarter ended April 3rd. Powered vehicles group reported a quarterly sales growth of 24.6%, due to Ridetech and SCA acquisitions. FOXF raised a hefty amount of capital by issuing 2.4 million common stock in June. This will help the company reorganize around is growing bike business. This, coupled with the acquisition of SCA Performance Holding, should have positive implications for FOXF performance in the upcoming months. The company expects its annual revenues to increase $3 million from SCA. FOXF beat the consensus EPS estimates in three of the four trailing quarters, which is impressive. FOXF’s shares gained more than 145% since hitting its 52-week low in April due to an overall dip in the market. How does FOXF stack up for POWR Ratings? A in Trade Grade A in Buy & Hold Grade B in Peer Rank B in Industry Rank You can’t ask for better. FOXF is also ranked #4 out of 27 stocks in the Auto & Vehicle Manufacturers industry. Allegion plc (ALLE) ALLE manufactures security products for homes and bikes, with products ranging from hinges and window-door fitting to bike locks, chain guards, and lighting. Based in Ireland, ALLE’s supply chain includes e-commerce platforms and small specialty showroom outlets. ALLE reported a year-over-year decline in its net revenues and operating income in the second quarter, primarily due to the ongoing economic slump. However, the company is well-positioned to capitalize on strong bike sales. ALLE hit its 52-week low of $77.37 on March 23rd due to the market crash but gained more than 30% since then. Dick’s Sporting Goods, Inc. (DKS) DKS is one of the most popular stocks under the Athletic and Recreation industry. With a comprehensive product range of fitness machinery, clothes, and footwear, DKS has managed to gain market share in the first half of 2020, as most people are taking up biking and other outdoor activities as a replacement for crowded gyms. With a strong e-commerce presence, revenue lost due to closure of all physical outlets was compensated with a 210% rise in online sales during the lockdown period. With gradual upliftment of restrictions, almost 80% of DKS stores have reopened for business since May, which is estimated to boost its revenues. DKS opened 2 new concept stores in June, along with five warehouse sale locations across the country. Moreover, DKS has an impressive earnings surprise history with the company beating consensus EPS estimates in three of the last four quarters. The consensus revenue estimate of $2.29 billion for the quarter ending July indicates a 1.30% year-over-year growth. DKS’ dividend program is also reinstated after temporary suspension during the peak of lockdown. DKS has managed to gain more than 220% since hitting its 52-week low in mid-March. According to the POWR Ratings, DKS is a “Buy.” It has an “A” in Trade Grade, and “B” in Buy & Hold Grade and Industry Rank. It’s ranked #16 out of 32 Athletics & Recreation stocks. Want More Great Investing Ideas? 9 “BUY THE DIP” Growth Stocks for 2020 Newly REVISED 2020 Stock Market Outlook 7 “Safe-Haven” Dividend Stocks for Turbulent Times DKS shares were unchanged in after-hours trading Friday. Year-to-date, DKS has declined -7.47%, versus a 0.61% rise in the benchmark S&P 500 index during the same period."}]}