{"article": [{"url": "https://stocknews.com/news/hd-low-len-mth-mdc-5-stocks-benefiting-from-low-mortgage-rates/", "published": 1597752500.0, "headline": "5 Stocks Benefiting from Low Mortgage Rates", "body": "Even prior to the pandemic, mortgage rates were trending lower. However, their plummet accelerated as the Fed cut rates to zero and stated their intention to keep rates at zero for an extended period of time, once the virus’ impact on the economy became clear. Low mortgage rates lead to an increase in housing demand, since affordability increases. This is another contributor to the housing bull market in addition to increased demand from people moving out of cities and low supply. According to a LendingTree report, 53% of homebuyers are more likely to buy a home by 2021 due to the pandemic. 7 \"SAFE HAVEN\" Dividend Stocks for Turbulent TimesAs a result, home building and improvement companies such as The Home Depot, Inc. (HD), Lowe’s Companies (LOW), M.D.C. Holdings, Inc. (MDC), Lennar Corporation (LEN), and Meritage Homes Corporation (MTH) are proving to be enticing opportunities for investors. The Home Depot, Inc. (HD) Every household is familiar with HD. As one of the largest retailers of home improvement products in the United States, the company offers its products to both do-it-yourself customers and third-party installers. HD has thrived during the pandemic as spending on household items and home improvement has surged. Thus, it’s stock has gained more than 100% to hit a new high in August since making a 52-week low in March. To keep up with the rising demand for home improvement products amid lockdown, HD announced the opening of three new distribution centers in Georgia. This was part of its ongoing $1.2 billion investment plan to expand its operations and market presence across the country. HD also increased its investment in the outdoor power categories group, in response to surging demand for products across the country. HD reported a 23.4% year-over-year improvement in its net sales to $38.05 billion for the second quarter ended August 2020. Gross profit of $12.94 billion improved 24.1% from the same period last year. Operating income increased 23.9% over the year-ago period to $6.06 billion. Net earnings of $4.33 billion improved 24.5% from its year-ago value. Cash and cash equivalents balance of $14.32 billion increased 456.2% year-over-year. HD had an impressive asset turnover ratio (also known as sales to total assets ratio) of 1.46 at the end of the quarter. This implies HD generated $1.46 for every dollar held as assets in the second quarter this year. How does HD stack up for the POWR Ratings? A for Trade Grade A for Buy & Hold Grade A for Peer Grade A for Industry Rank A for Overall POWR Rating You can’t ask for better. It is ranked #1 out of 67 in the Home Improvement & Goods industry. Lowe’s Companies (LOW) LOW is a home improvement retailer operating in the United States, Canada, and Mexico. Its line of products caters to home construction, maintenance, repair, remodel, and decoration. LOW announced the expansion of its supply chain network on August 12th to support the growing demand of its products, as well as improve its home delivery system amid the healthcare crisis. In this regard, LOW plans to build 50 cross-dock delivery terminals, seven bulk distribution centers, and four e-commerce fulfillment centers in the next 18 months. This venture is a part of its $1.7-billion expansion plan, which began in 2018. On July 27th, LOW partnered with HomeAdvisor to promote its Pros Loyalty subscription program. Under the agreement, LOW’s Pro Loyalty members will get free year-long access to HomeAdvisor’s subscription program. It has also partnered with EGO to provide outdoor power equipment on Low’s websites and stores. LOW entered into a joint venture agreement with Highfield Investment group to open a 1,230,000 square feet distribution center in Calgary Canada worth $120 million. With such expansion plans in place, LOW expects to profit significantly from the rising demand for home improvement products. LOW’s consensus EPS estimate of $2.95 for the second quarter indicates a 37.2% improvement year-over-year. Moreover, LOW surpassed the street estimates in each of the trailing four quarters, which is impressive. The consensus revenue estimate of $24.27 billion for the about-to-be-reported quarter indicates a 15.6% increase year-over-year. LOW gained more than 150% since hitting its 52-week low of $60 in March to hit its 52-week high of $152.24 in August. LOW is rated a “Strong Buy” in our POWR Ratings system, consistent with its strong business model and expansion plans. It has an “A” for Trade Grade, Buy & Hold Grade, Peer Grade, and Industry Rank. It is also ranked #2 out of 67 stocks in the Home Improvement & Goods industry. M.D.C. Holdings, Inc. (MDC) MDC offers home construction and financing services to home buyers across the United States. It purchases finished plots for sale, as well as developing plots for construction and sale under its homebuilding operations. Its financial services operations include providing mortgage loans and insurance products to prospective customers. The low mortgage interest rates combined with higher demand for residential real estate allowed MDC to deliver impressive second-quarter results. Home sales revenue of $886.80 million improved 21% year-over-year. MDC delivered 1900 units in the second quarter, up 25% from the year-ago number. Net income improved 55% year-over-year to $84.40 million. Gross margin also increased by 70 basis points to 20.2% of revenue. The dollar value of net new orders of $1.04 billion increased 8% from $967.90 million for the same period last year. MDC’s unit net orders also increased 5% year-over-year to 2,390. MDC is expecting to deliver between 1,900 and 2,100 homes in the third quarter ending September 2020. The consensus EPS estimate of $1.13 indicates a 43% improvement year-over-year. The street revenue estimate of $944.46 million indicates a 22.2% growth from its year-ago value. MDC hit its 52-week low of $15.75 in March due to the pandemic driven market crash and gained more than 190% since then. It’s no surprise that MDC is rated “Strong Buy” in our POWR Ratings system. It also has an “A” for Trade Grade, Buy & Hold Grade, and Industry Rank. It is ranked #6 out of 21 stocks in the Homebuilders industry. Lennar Corporation (LEN) LEN is a home building and financial management company operating through Homebuilding East, Homebuilding West, Homebuilding Central, Homebuilding Texas, Financial Services, Multifamily, and Lenna other segments. It develops, constructs, and manages the property as well as provides mortgage financing, title insurance, and closing services. The Lennar other segment is involved in fund investment activities such as raising, investing, and managing third party capital and originating and selling into securitizations commercial loans. LEN expanded its business operations in the second quarter ended May 2020 through leasing agreements with various apartment communities across the United States. It also opened a luxury real estate community known as Vitri Apartments for both residential and commercial use on June 16th. LEN’s net earnings increased by 22.7% year-over-year to $517.40 million in the second quarter. Operating earnings from its financial segment reached an all-time high of $150.60 million, improving 140.9% year-over-year. This rise can be attributed to the improvement in the mortgage business as a result of an increase in volume and margin. Homebuilding operations margins of $636.20 million increased 4.5% from the year-ago value. Its homebuilding segment’s debt to capital fell to 31.2% from 38.3% for the same period last year. Gross margin on home sales improved slightly to 21.6% or $1.1 billion this quarter. LEN expects its new orders and deliveries to be in the range of 12,800-13,000 and 13,200-13,400, respectively, for the third quarter ending August 2020. LEN’s EPS is expected to grow 3.1% per annum over the next five years. It has an impressive earnings surprise history, as it beat the consensus EPS estimates in each of the trailing four quarters. LEN gained more than 200% to hit its 52-week high of $77.52 in August since hitting its 52-week low of $25.42 in March. LEN is rated a “Strong Buy” in our POWR Ratings system, consistent with its growth potential in the second half of 2020. It also has an “A” for Trade Grade, Buy & Hold Grade, Peer grade, and Industry Rank. In the 21-stock Homebuilders industry, LEN is ranked #2. Meritage Homes Corporation (MTH) MTH constructs markets and sells homes for the first time and first moves up buyers in the southern states of the United States. It also offers financial services such as title insurance and closing/ settlement services to prospective home buyers. MTH is the 7th largest homebuilder in the country. As a well-established name in the homebuilding industry, MTH won the Avid Diamond award, Avid Gold Award, and the Avid benchmark award across nine separate divisions. MTH has been awarded this honor for eight straight years, scoring among the top 25% of the home builders in the country for a positive homeowner and customer satisfaction experience. MTH undertook several business expansion operations by developing and opening several communities across the country. As a result, MTH reported a very profitable second quarter ended in June 2020, with a 32% increase in total orders. Though orders placed in April were 15% less compared to its previous year values, the 44% and 66% year-over-year rise in orders placed during May and June compensated for it. Home closing revenue increased 20% year-over-year to $1.03 billion. Home closing gross margin of 21.4% was up 3% from the year-ago value. Gross profit of $219 million improved 39.4% year-over-year. Net earnings from financial services improved 78.3% from the year-ago value to $90.67 million. The consensus EPS estimate of $2.33 for the third quarter ending September 2020 indicates a 30.1% improvement year-over-year. Moreover, MTH beat the street EPS estimates in each of the trailing four quarters, which is impressive. MTH gained more than 315% since hitting its 52-week low in March to hit its 52-week high in August. MTH is rated a “Strong Buy’ in our POWR Ratings system, consistent with its impressive performance in the last quarter. It also has an “A” in Trade Grade, Buy & Hold Grade, and Industry Rank. Within the Homebuilders industry, MTH is ranked #5 out of 21 stocks. Want More Great Investing Ideas? The Best of StockNews 3 Possible Directions for the Stock Market from Here 9 “BUY THE DIP” Growth Stocks for 2020 HD shares fell $0.44 (-0.15%) in after-hours trading Tuesday. Year-to-date, HD has gained 32.16%, versus a 6.30% rise in the benchmark S&P 500 index during the same period."}]}