{"article": [{"url": "https://stocknews.com/news/baba-ebay-cvna-w-ostk-5-online-retail-companies-within-striking-distance-of-52-week-highs/", "published": 1595419700.0, "headline": "5 Online Retail Companies Within STRIKING DISTANCE of 52-Week Highs", "body": "Brick-and-mortar real estate may never be gone, but it is certainly giving way to web-based retail. After all, it is cheaper for businesses to operate as e-tailers rather than conventional retailers. Furthermore, consumers would rather spend less of their limited time and money shopping from home than driving from one store to the next. Add in the spread of coronavirus, and it is easy to understand why internet retail companies are capturing more and more market share. Alibaba Group Holding (BABA), eBay Inc. (EBAY), Carvana Co. (CVNA), Wayfair (W), and Overstock.com (OSTK) are five e-tailers that have the potential to break through their 52-week highs before summer’s end. Alibaba Group Holding (BABA) 7 \"SAFE HAVEN\" Dividend Stocks for Turbulent TimesChina’s military might, massive population, and the seemingly endless number of private industry success stories help the country inch closer and closer to supplanting the United States as the global hegemon. BABA is one of China’s most intriguing businesses. This e-commerce giant provides a wide array of services and products, ranging from logistics to cloud computing. More than 50% of China’s web-based retail sales stem from BABA. In other words, BABA is China’s Amazon (AMZN) minus the comparably strict labor laws of the United States. The POWR Ratings reveal BABA has A grades in each component that makes up the POWR Ratings. BABA is ranked first out of more than 100 China stocks. The average analyst price target for BABA is $275.11. Out of 20 analysts who have reviewed BABA, 19 rates it as a Buy, one recommends holding, and none advise selling. eBay Inc. (EBAY) When the internet first penetrated the mainstream, it appeared as though EBAY would be a stock market darling. The company’s online marketplace was easy to use, polished, and efficient. However, eBay’s stock never took off. The company recently sold its classifieds section to a Norwegian company called Adevinta. EBAY’s POWR Ratings reveal the stock is ranked in the top 20 of more than 50 Internet stocks. EBAY has an A Trade Grade and above-average grades in the remaining POWR Components. Analysts have set a price target in excess of $57 for EBAY. EBAY trades at a forward P/E ratio of 16.28, meaning it is somewhat of a value internet play. Carvana Co. (CVNA) Buying and selling a vehicle online is quite appealing because human interaction is frowned upon during social distancing. CVNA facilitates vehicle sales and purchases on the web. The stock increased fourfold between ’17 and ’19 following its IPO. The POWR Ratings reveal CVNA is ranked in the top five Internet stocks with As in each POWR Ratings component. As the pandemic continues, word will spread about the merits of CVNA, possibly propelling the stock well beyond its 52-week high of $150. Wayfair (W) If you watch TV, there is a good chance you have seen W’s catchy jingle stuck in your head. This etailer sells home goods and furniture on the web. W is ranked second of 33 stocks in the Specialty Retailers segment. W has As in all POWR Components except for its Industry Rank, which has a B grade. It does not look like the United States’ economy will fully reopen anytime soon, which should send more customers in W’s direction. If the trend continues into the Fall, W could easily surpass its 52-week high of $234.37. Overstock.com (OSTK) Though unemployment is disturbingly high, wages are stagnating, and there is no end in sight for the recession, people still need and desire electronics, home décor, bath goods, apparel, and kitchenware. OSTK sells each of these items from its website. Take a look at OSTK’s POWR Ratings, and you will find the stock is ranked 12th of 54 publicly traded companies in the Internet space. The average analyst price target for OSTK is $66. OSTK recently won a federal government contract to build a platform that helps agencies purchase billions of dollars in equipment. Look for OSTK to move well past 52-week high of $55.29 in the months ahead. Want More Great Investing Ideas? 9 “BUY THE DIP” Growth Stocks for 2020 Newly REVISED 2020 Stock Market Outlook 7 “Safe-Haven” Dividend Stocks for Turbulent Times BABA shares were trading at $251.70 per share on Wednesday afternoon, down $6.20 (-2.40%). Year-to-date, BABA has gained 18.67%, versus a 2.60% rise in the benchmark S&P 500 index during the same period."}]}