{"article": [{"url": "https://stocknews.com/news/crm-tlnd-now-adsk-buy-this-software-stock-on-pullbacks/", "published": 1599739700.0, "headline": "Buy This Software Stock on Pullbacks", "body": "As one of the biggest cloud service providers in the country, Salesforce.com, Inc. (CRM) is a well-known stock in the tech industry. On May 22nd, CRM was named the #1 customer experience and relationship management provider and global leader by International Data Corporation and Worldwide Semiannual Software Tracker. It has the highest market share with 19.5%, according to Gartner, Inc. After a massive gain since the market crash in March, CRM witnessed a pullback due to the recent tech sell-off. The stock lost 16.5% in one week. While many investors are worried about a tech-stock bubble, which could lead to a dotcom 2.0 crisis, the majority of Wall Street analysts have classified the recent tech sell-off as a healthy market correction. The market showed signs of recovery on September 9th, as Dow Jones Industrial Average (DJIA) and S&P 500 gained slightly. As the market wiped off a portion of CRM’s gain, it could be a good time to enter the stock. CRM is currently rated “Buy” in our proprietary ratings system. CRM gained more than 50% year-to-date. It delivered strong financials in the fiscal second quarter ended July 2020 as the cloud computing industry gained prominence under the work-and-learn- from home normal. 7 \"SAFE HAVEN\" Dividend Stocks for Turbulent TimesHere’s how our proprietary POWR Ratings system evaluates CRM: Trade Grade: A CRM is currently trading way above its 50-day and 200-day moving averages of $210.31 and $178.83, respectively. The golden-cross price performance indicates bullishness. Moreover, CRM gained more than 43% in the last three months, signaling a solid short-term uptrend in the stock. CRM’s impressive performance in the last reported quarter positively influenced its Trade grade. Its revenues increased 29% year-over-year to $5.15 billion in the fiscal second quarter. Net income grew 278.4% from the same period last year to $2.62 billion, while gross profit rose 26.7% to $3.84 billion. CRM entered into a multi-year agreement with Humana, Inc. (HUM) to develop a new care management technology to power HUM’s tech-oriented Enterprise Clinical operating model. It also partnered with the Nevada Department of Health and Human Services to launch an inventory management application called Naloxone Virtual Dispensary. Peer Grade: A CRM is ranked #2 out of 47 stocks in the Software – Business industry. Other stocks in this industry are Talend S.A. (TLND), ServiceNow, Inc. (NOW), and AutoDesk, Inc. (ADSK). While NOW beat CRM by gaining more than 60% year-to-date, TLND and ADSK returned 9.6% and 27.67%, respectively, during this period. Buy & Hold Grade: B In terms of proximity to the 52-week high, which is a key factor the Buy & Hold grade takes into account, CRM is well-positioned. It is currently trading just 13.6% below its 52-week high of $284.50. Moreover, CRM hit its 52-week high recently, on September 2nd. CRM’s long-term gains can be attributed to the soaring tech industry and the expectation for the 5G boom. It has returned more than 155% in the past three years, owing to its solid growth momentum. Revenue grew at a CAGR of 27.2% over the past three years, while EBITDA grew at a CAGR of 48.9% during the same period. Industry Rank: B The Software – Business sector is ranked #35 out of 123 industries in the StockNews.com universe. It is one of the best performing industries with multiple new technologies and advancements in recent years, with increased focus during the rising popularity of a remote working environment. As the social-distancing norm has forced all activities online, the demand for cloud computing systems to sustain virtual working and learning environments has increased. Despite the current tech sell-off, the industry is expected to bounce back in no time. Also, the ongoing race for 5G should fuel the growth of companies operating in this industry. Overall POWR Rating: B (Buy) Overall, CRM is rated “Buy” under our POWR Ratings system, taking into account the strong price performance, short-and-long-term bullishness, impressive financial reports, and favorable analyst sentiment. Bottom Line Based on CRM’s upside potential, I recommend entering the stock at a discounted price. CRM has maintained favorable analyst sentiment even during the dip in the market, which is impressive. Out of the 42 Wall Street analysts that rated the stock, 38 recommended it as “Strong Buy.” The consensus revenue estimate of $5.25 billion for the fiscal third-quarter ending October 2020 indicates a 16.3% rise year-over-year. Though the consensus EPS estimate indicates no change from the same period last year, CRM beat the street EPS estimates in each of the trailing four quarters, which is impressive. Want More Great Investing Ideas? 7 Best ETFs for the NEXT Bull Market Will Stocks Fall into Historical September Slump? 9 “BUY THE DIP” Growth Stocks for 2020 CRM shares were trading at $248.04 per share on Thursday afternoon, down $2.39 (-0.95%). Year-to-date, CRM has gained 52.51%, versus a 5.04% rise in the benchmark S&P 500 index during the same period."}]}