{"article": [{"url": "https://stocknews.com/news/ogi-organigram-misses-on-earnings/", "published": 1595419700.0, "headline": "Organigram Misses on Earnings", "body": "On Tuesday, Organigram’s (OGI) posted third-quarter fiscal 2020 earnings. The company reported earnings per share of $-0.30, which was well below the average analyst estimate of $-0.02. The company generated $18 million in net revenue, which is lower than its reported revenue of $18.46 million during the same quarter last year. The company generated positive cash flow from its operations of $8.5 million, which resulted from monetization and optimization of working capital. As a result, shares of OGI are trading down about 9% since their earnings release on Tuesday: 9 \"BUY THE DIP\" Growth Stocks For 2020(Source: MarketWatch.com) Other highlights from the company’s earnings call include OGI’s first value offering of 28grams of dried flower in the fast-growing adult-use recreational market segment. OGI also secured the company’s largest international deal to date in June 2020 to supply one of Israel’s largest and most established medical cannabis producers, Canndoc Ltd., with up to 6,000kg of dried flower in a multi-year agreement. Greg Engel, CEO of OGI, noted, “Since the onset of the global pandemic, the priority for us has been protecting the health and safety of our employees. This prioritization led to a significantly reduced workforce, which contributed to a number of product launch delays, including our initial large format value offering, which affected opportunities to potentially capture significant market share and sales in dried flower, the largest product segment of the recreational market. Since then, we have launched a number of new products and line extensions with more to come. Furthermore, we believe we have right-sized our workforce, and even before doing so, we were able to generate positive cash flow from operations in Q3 2020 as we continue to remain focused on building a business that delivers an attractive return on investment for shareholders.” Though this was a disappointing quarter for OGI, I am cautiously optimistic about the company’s future because of their new production line dedicated to edible cannabis chocolates, which should allow them to further capitalize on the derivatives 2.0 market that is just getting started in Canada. With OGI continuing to launch products, this provides them the ability to generate revenue in the long run. Want More Great Investing Ideas? 9 “BUY THE DIP” Growth Stocks for 2020 Newly REVISED 2020 Stock Market Outlook 7 “Safe-Haven” Dividend Stocks for Turbulent Times OGI shares fell $0.01 (-0.73%) in after-hours trading Wednesday. Year-to-date, OGI has declined -44.08%, versus a 2.60% rise in the benchmark S&P 500 index during the same period."}]}