{"article": [{"url": "https://stocknews.com/news/xlk-arkw-igv-skyy-hack-5-tech-etfs-to-buy-on-dips/", "published": 1596110900.0, "headline": "5 Tech ETFs to Buy on Dips", "body": "The Nasdaq’s ascent from the March lows has been relentless. It’s been the strongest index in terms of its gains off the lows and it’s at new, all-time highs. In contrast, the Dow (DIA) and S&P 500 (SPY) haven’t yet made new, all-time highs. Given the rally’s steep incline, there have been few low-risk entry points. Therefore, the price action in July is noteworthy in that the index’s ascent has paused and formed a double bottom around 10,200. For anyone who thinks the rally still has legs, it’s creating an interesting, entry point. One of the best ways to get exposure to technology is through ETFs. There is a variety of ETFs that can give broad exposure to the sector or targeted for specific themes. The SPDR Select Technology Fund (XLK), ARK Next Generation ETF (ARKW), iShares Expanded Tech Software ETF (IGV), First Trust ISE Cloud Computing ETF (SKYY), and ETFMG Prime Cyber Security ETF (HACK) are five technology ETFs that investors should consider buying on this dip. 9 \"BUY THE DIP\" Growth Stocks For 2020SPDR Select Sector Fund – Technology (XLK) XLK is one of the most popular ETFs investing in large-cap tech companies based in the United States. This State Street ETF is one of the best-performing ones so far in 2020, as the growth pace of technology and telecom industry has accelerated during the pandemic. Microsoft (MSFT) is the biggest holding of this ETF, constituting 21.56% of the total portfolio. Apple Inc. (AAPL) is a close second, with a 21.38% weightage. XLK has an expense ratio of 0.13% compared to the category average of 0.51%. The fund has returned 16.2% year to date, and 15.9% in the past three months, as the underlying stocks fared well during the economic slump. XLK gained more than 45% after hitting its 52-week low of $68.10 on March 23rd. On July 21st, the ETF hit its 52-week high at $110.38, recovering in just three months. How does XLK stack up for our POWR Ratings? A in Trade Grade A in Buy & Hold Grade A in Industry Rank A in Overall POWR Rating You can’t ask for better. XLK is also ranked #2 out of 91 ETSs in the Technology Equities ETFs group. ARK Next Generation ETF (ARKW) ARKW is an actively-managed ETF with a portfolio of tech-oriented companies of all sizes. It is popular for its aggressive management techniques that allow the fund to surpass the market performance and capitalize on market fluctuations. ARKW’s top holdings include popular and well-performing stocks like Tesla Inc. (TSLA), Square Inc (SQ), and Roku Inc (ROKU). Though ARKW’s expense ratio of 0.76% is higher among its peers, it more than makes up for it through its higher returns. ARKW returned 44.8% to its investors in the last three months, and 65.2% year to date. Since hitting its 52-week low of $40.49 on March 18th, ARKW gained over 250%, hitting its 52-week high of $100.91 in July. AKRW is rated “Strong Buy” in our POWR Ratings system, with an “A” in Trade Grade, Buy & Hold Grade, and Industry Rank. Out of 91 ETFs in Technology Equities ETFs, ARKW is ranked #18. iShares Expanded Tech Software ETF (IGV) IGV is a passively-managed ETF with a medium risk profile. The ETF mitigates its risk factor by investing in both large and mid-cap companies, thereby achieving a balance between capital gains and dividend income. Approximately 25% of its total portfolio consists of blue-chip companies such as Adobe (ADBE), Microsoft, and Salesforce.com Inc (CRM). IGV aims to replicate the returns of the S&P North American Technology- Software Index. With an expense ratio of 0.46%, IGV returned over 19.5% in the last three months and 24.2% year to date. IGV gained more than 60% in value since hitting its 52-week low of $176.23 on March 18th. Due to its strong momentum, IGV hit its 52-week high of $300.94 on July 9th. It’s no surprise that IGV is rated as a “Strong Buy” stock in our POWR Ratings system. It also has an “A” in Trade Grade, Buy & Hold Grade, and Industry Rank. It is ranked #6 out of 91 ETFs in the Technology Equities ETFs group. First Trust ISE Cloud Computing Index Fund (SKYY) With the advancement of technology and its role in the modern world, cloud storage and computing are the fastest growing industries. The pandemic led “new normal” has given this industry an additional edge. That makes SKYY perform excellently, as it is one of the most targeted sector funds investing in companies offering cloud computing services. SKYY’s top holdings include several fortune 500 companies such as Amazon (AMZN), Microsoft, Alphabet (GOOGL), and Alibaba (BABA). SKYY has returned more than 20% to its investors in the last three months and close to 25% year to date. SKYY gained more than 60% since hitting its 52-week low of $45 on March 16th amid the economic slump. It recovered fairly quickly to hit its 52-week high of $78.92 on July 9th. SKYY has an expense ratio of 0.6%, slightly higher than its category average. But given its year-to-date performance, it’s worth spending a little higher on buying this fund. As per our POWR Ratings, SKYY is a “Strong buy” ETF. It holds an “A” in Trade Grade, Buy & Hold Grade, and Industry Rank. It is currently ranked #7 out of 91 ETFs in the Technology Equities ETFs. ETFMG Prime Cyber Security ETF (HACK) HACK was the first ETF to focus on the cybersecurity industry. The fund tracks an index that has companies providing hardware and software services. With an expense ratio of 0.6%, which is higher than the category average, HACK’s top holdings include Digital Arts Inc., Verisign Inc. (VRSN), and ManTech International Corp (MANT). HACK has returned 16.9% in the last three months and 14.9%year to date. Since hitting its 52-week low of $29.02 on March 18th, HACK gained more than 65% to hit its 52-week high of $47.90 on July 23rd. HACK is rated as a “Strong Buy” ETF as per our POWR Ratings, consistent with its impressive performance during the first half of 2020. HACK holds an “A” in Trade Grade, Buy & Hold Grade, Peer Grade, and Industry Rank. Out of 91 ETFs in the Technology Equities ETFs, it is rated #21. Want More Great Investing Ideas? 9 “BUY THE DIP” Growth Stocks for 2020 How HIGH Can This Tech Bubble Fly? 7 “Safe-Haven” Dividend Stocks for Turbulent Times XLK shares were trading at $106.45 per share on Thursday morning, down $0.69 (-0.64%). Year-to-date, XLK has gained 17.05%, versus a 1.04% rise in the benchmark S&P 500 index during the same period."}]}