{"article": [{"url": "https://stocknews.com/news/msft-fb-microsofts-plan-to-enter-video-chat-would-spur-rivalry-with/", "published": 1596802100.0, "headline": "Microsoft’s Plan to Enter Video Chat Would Spur Rivalry with Facebook", "body": "Microsoft (NASDAQ:MSFT) is looking like the favorite to acquire all or part of the TikTok video chat service that is owned by China’s ByteDance Ltd., but even a successful acquisition will pit the software giant against technology rival Facebook (NASDAQ:FB) and its new Reels service. Microsoft, the giant Redmond, Washington, computer software and systems company, announced slowing growth in its most recent quarterly results but its leaders voiced interest on Aug. 2 in buying part of the operations of the video-sharing TikTok app owned by ByteDance Ltd. Executive orders issued by President Trump late on Aug. 6 could help the deal happen as a way to avoid blocking China-owned TikTok and WeChat from operating in the United States due to claims of national security threats. The Trump administration warned that TikTok is vulnerable to pressure from China’s Communist government to share the personal data of American users of the video service. Specifically, President Trump’s executive order about TikTok stated such data collection allows the Chinese Communist Party access to Americans’ personal and proprietary information — potentially tracking the locations of federal employees and contractors, building dossiers of personal information for blackmail and conducting corporate espionage. 7 \"SAFE HAVEN\" Dividend Stocks for Turbulent TimesPresident Trump’s Executive Orders Cite TikTok Censuring Content for China “TikTok also reportedly censors content that the Chinese Communist Party deems politically sensitive… concerning protests in Hong Kong and China’s treatment of Uyghurs and other Muslim minorities,” according to President Trump’s executive order about the company. “This mobile application also may be used for disinformation campaigns that benefit the Chinese Communist Party, such as when TikTok videos spread debunked conspiracy theories about the origins of the 2019 Novel Coronavirus. “These risks are real. The Department of Homeland Security, Transportation Security Administration and the United States Armed Forces have already banned the use of TikTok on federal government phones. The government of India recently banned the use of TikTok and other Chinese mobile applications throughout the country; in a statement, India’s Ministry of Electronics and Information Technology asserted that they were ‘stealing and surreptitiously transmitting users’ data in an unauthorized manner to servers which have locations outside India.’” President Trump invoked the International Emergency Economic Powers Act to address what he described in the executive order as a “national emergency” with the information and communications technology and services supply chain. The order stated that the spread in the United States of mobile applications developed and owned by companies in the People’s Republic of China threatens U.S. national security, foreign policy and its economy. President Trump’s Second Executive Order Targets China’s WeChat A second executive order President Trump released on Aug. 6 similarly barred any transaction with China’s WeChat, a messaging, social media and electronic payment application, and its parent Tencent Holdings Ltd. by any person or any property subject to the jurisdiction of the United States. However, the order would exclude any contract agreed to during the next 45 days. “Like TikTok, WeChat automatically captures vast swaths of information from its users,” according to President Trump’s executive order. “This data collection threatens to allow the Chinese Communist Party access to Americans’ personal and proprietary information. In addition, the application captures the personal and proprietary information of Chinese nationals visiting the United States, thereby allowing the Chinese Communist Party a mechanism for keeping tabs on Chinese citizens who may be enjoying the benefits of a free society for the first time in their lives.” One example occurred in March 2019, when a researcher reportedly discovered a Chinese database containing billions of WeChat messages sent from users in not only China but also the United States, Taiwan, South Korea and Australia, according to the executive order. WeChat, similar to TikTok, also reportedly censors content that the Chinese Communist Party deems politically sensitive and also may be used for disinformation campaigns to benefit the Chinese Communist Party, the executive order continued. “These risks have led other countries, including Australia and India, to begin restricting or banning the use of WeChat,” President Trump declared in his executive order. “The United States must take aggressive action against the owner of WeChat to protect our national security.” Bolt-on Business Fits Microsoft’s Growth Plans The solution for TikTok could be to sell its operations to Microsoft or another U.S. technology company. “Microsoft always covets a robust new consumer-facing business it can bolt onto its existing platform and get in the way of its Big Tech rivals,” said Hilary Kramer, host of a national radio program called “Millionaire Maker” and head of the Value Authority and GameChangers advisory services. “That’s what makes TikTok interesting for them.” TikTok may create at most a one-time, 10% step up in revenue growth, but its integrated video messaging could help Microsoft’s Xbox, a commercial version for LinkedIn or even Windows Office, Kramer continued. Columnist and author Paul Dykewicz interviews money manager Hilary Kramer, whose premium advisory services included 2-Day Trader, IPO Edge, Turbo Trader, High Octane Trader and Inner Circle. TikTok May Propel Microsoft’s Plans to Enter Video Chat Videoconferencing has become a must-have workplace tool similar to a spreadsheet or document, Kramer said. Microsoft, which has the second-largest market capitalization of any U.S. company at $1.637 trillion, currently owns a Skype video-calling service but TikTok could be the key to a broader platform of video services that “outclasses everything else,” she added. Such a deal, if it can be forged to win approval from the U.S. and Chinese governments, could put Microsoft into the social media business like never before. But four existing technology behemoths involved in the social media business reported financial results after the close of trading on July 30, with Apple (NASDAQ:AAPL) and Amazon.com Inc. (NASDAQ:AMZN) notching better-than-expected performance, while Facebook and Google’s parent company Alphabet Inc. (NASDAQ:GOOG) showed softening growth. The next day, the share prices of three of the stocks jumped, as Apple surged 10.47%, Facebook soared 8.17% and Amazon climbed 3.70%, while Alphabet slipped 3.17%. But the prior day, a Congressional committee exploring “unfair” business practices questioned each chief executive of the four companies. Microsoft’s Plans to Enter Video Chat Would Be Best Helped by Buing TikTok as a Whole The proposed acquisition of TikTok would be a positive move for Microsoft, said Bob Carlson, leader of the Retirement Watch advisory service and chairman of the Board of Trustees of Virginia’s Fairfax County Employees’ Retirement System with more than $4 billion in assets. Such a deal would bring a very large group of young American TikTok users estimated at 80-100 million to supplement those Microsoft already serves with its gaming business, Carlson said. Microsoft has an excellent record of successful acquisitions, even though many of those transactions were not in the social media arena, he added. Microsoft once was viewed as “the villain” among technology companies, Carlson said. Now, the “negative attention” is going to other tech titans, he added. “Microsoft is under the radar and can focus on running its businesses,” Carlson continued. Pension fund Chairman Bob Carlson answers questions from Paul Dykewicz during an interview before social distancing became the norm after the outbreak of COVID-19. Microsoft reportedly is discussing an offer to buy all of TikTok’s operations but may be keeping a possible deal for its operations in the United States, Canada, Australia and New Zealand on the table. Facebook May Disrupt Microsoft’s Plans to Enter Video Chat Facebook announced plans to launch its rival Reels video service in the United States on the same day that President Trump released his executive orders. The Facebook service through Reels would aim to span the globe, putting a premium on Microsoft trying to buy all of TikTok to compete worldwide. Microsoft’s lofty price-to-earnings (P/E) valuation ratio of 37.54, compared to an estimated NASDAQ P/E of 22.3, will be difficult to maintain without finding new paths for growth that could come from acquiring businesses such as TikTok. Earnings per share (EPS) in Microsoft’s fiscal fourth quarter reached $1.46, beating analysts’ $1.34 consensus estimate, while the company’s revenues jumped to $38.03 billion, topping forecasts of $36.54 billion. However, Microsoft reported modest slowing in revenue growth of 50% in constant currency for its Azure product segment that offers a set of cloud services to help organizations build, manage and deploy applications on a global network. The company’s shortfall in meeting higher growth expectations of analysts led Oppenheimer analyst Timothy Horan to cut his rating on Microsoft to “perform” from “outperform” on July 23, the day after the software provider released its latest financial results. Horan warned that slowing growth in Microsoft’s cloud business would boost its competition and expenses. Chart Courtesy of www.StockCharts.com The consensus analysts’ average price target advanced 3.2% to $227.59 after Microsoft unveiled its most recent financial results. Even so, Microsoft’s reduced growth in its fiscal fourth quarter that ended on June 30 dimmed some of the stock’s appeal, despite reporting potent profits and revenues. In fact, Microsoft’s fiscal fourth-quarter financial results beat analysts’ consensus estimates for both earnings per share (EPS) and revenues amid the economic contraction caused by the COVID-19 crisis. Microsoft is all about the cloud,” said Jim Woods, who heads the Successful Investing, Intelligence Report and Bullseye Stock Trader advisory services. “The pandemic has created a work-from-home society, and that has created greater demand for safe and secure cloud computing services such as those offered by the software giant.” Woods recommends Microsoft, which offers a current dividend yield of 0.96%, in the Prime Movers portfolio in Successful Investing. He helped his subscribers gain a 16.3% return in the stock after putting it in his Intelligence Report Tactical Trends Portfolio. Paul Dykewicz meets with Jim Woods before COVID-19 to discuss new investment opportunities. Investors May View Microsoft as a Better Buy If Its Share Price Plunged “Results from Microsoft were baked into the stock, but results from Apple, Amazon, Google and Facebook obviously showed that one shouldn’t bet against the U.S. consumers and businesses,” said Bryan Perry, who heads the Cash Machine, Premium Income, Quick Income Trader, Hi-Tech Trader and Breakout Profits Alert advisory services. Microsoft is a trusted technology company, despite its cloud revenues coming in a “tad light,” Perry said. Microsoft’s other businesses, such as Outlook 365, LinkedIn, Surface, Xbox, TEAMS and the Windows 10 operating system, are strong, added Perry, who opined that a “decent entry point” for new investors would be $195 or less. Paul Dykewicz interviews investment guru Bryan Perry at the Orlando MoneyShow. COVID-19 Economic Contraction May Effect Microsoft’s Plans to Enter Video Chat The devastating effects of COVID-19, which originated in China, and complaints from western nations about a lack of transparency about the threat of the infections, cannot be overlooked. The COVID-19 crisis has caused 19,260,184 cases and 718,425 deaths globally, along with 4,926,184 cases and 160,976 deaths in the United States, as of Aug. 7. America has more cases and deaths than any other country, including China. Microsoft is a world class software leader that may view TikTok as a potential source of growth to step up its video chat capabilities. Investors willing to stay patient for Microsoft to acquire some or all of TikTok within the 45-day deadline set by President Trump may want to pounce if the software company’s shares fall to under $200 upon any sign of the negotiations unraveling. Microsoft is a technology heavyweight with or without TikTok. MSFT shares . Year-to-date, MSFT has gained 35.32%, versus a 5.02% rise in the benchmark S&P 500 index during the same period."}]}