{"article": [{"url": "https://stocknews.com/news/paa-epr-am-two-questions-you-must-ask-if-youre-worried-about-dividend/", "published": 1596802100.0, "headline": "Two Questions You Must Ask If You’re Worried About Dividend Cuts", "body": "The effects of the COVID-19 pandemic on the economy and business resulted in a stock market crash and severe business disruption for many companies. One impact of the economic slowdown/shut-in was that many companies were forced or chose to slash common stock dividends. For example, out of the 165 equity REITs tracked by Hoya Capital Real Estate, as of July 20, 58 of those REITs had reduced or suspended dividends. The 35% to 40% of companies cutting dividends also occurred in the other high-yield sectors such as finance REITs, Business Development Companies (BDCs), and energy midstream. 7 Best ETFs for the NEXT Bull MarketAs we look for a recovery that likely started in mid-June to July, income investors should have two questions about stocks in the various high-yield categories. Question 1: For those companies that cut dividends back in March and April, what are the prospects for dividends to come back? The answer from each company depends on the business generated cash flow available to be paid out as dividends. Some companies cut dividends out of caution, but still are generating enough free cash flow. Others have been severely affected by the COVID crisis, and it is tough to predict when dividends will recover. Here are a couple of examples. Plains All American Pipeline LP (PAA) In April, crude oil storage and pipeline company Plains All American Pipeline LP (PAA) cut the quarterly dividend rate by 50%, down to $0.18 per share from the previous $0.36 per share. When it released the 2020 second-quarter results, Plains reported distributable cash flow (DCF) of $0.41 per share. The free cash flow handily covers the lower dividend rate. As operations return to normal, the company should get back to producing DCF over $0.70 per share per quarter. Plains All American Pipeline is a company that should quickly start to increase its dividend rate. The current yield on the lower dividend is 8.9%. EPR Properties (EPR) In contrast, EPR Properties (EPR) is a REIT whose business has been significantly impaired by the COVID crisis. EPR primarily owns multiplex movie theaters and other entertainment-related properties. The EPR tenants are almost entirely shut down and not paying rent. In May, EPR suspended the monthly dividend on its common stock shares. Now in August, there is no visibility on when movie theaters and other entertainment venues will be able to reopen. Currently, this is not a stock for income-focused investors. Question 2: Will stocks that have not cut dividends, but continue to sport very high yields be forced to cut their dividends? The current yield is a function of the stock price and the annual dividend rate. If a stock price falls and stays low, the yield will remain elevated. It is a common belief that a very high yield indicates a high probability of a dividend cut. Even the Wall Street analysts will start to question whether a company should continue to pay dividends because that policy does not seem to help the share price. Most analysts focus very much on the share price. When a management team gets questioned about cutting a dividend, my thought is that I have never seen a stock price go up after a dividend cut. Fortunately, there are boards of directors that understand investors often count on dividend income as a significant portion of their investment returns. It is a comfort to know that dividends will be paid every quarter, no matter what happens with the share price. Now, as the COVID-19 crisis continues to put a strain on revenues and profits, we get to see which companies put a priority on taking care of common stock investors. Those are the companies that put a priority on paying the dividend as long as there is sufficient cash flow or the outlook that the business is sustainable while maintaining the dividend. Antero Midstream Corp. (AM) One outstanding example is Antero Midstream Corp. (AM), which continues to pay a quarterly dividend of $0.3075 ($1.23 per share per year). At the bottom of the stock market crash, AM traded for a low of $1.69, giving the shares a temporary 73% yield! The shares have languished below $7.00, keeping the yield around 20%. Each quarter, management repeats its belief that if the company can pay the dividend, they will pay the dividend to take care of investors. Want More Great Investing Ideas? Top Dividend Stock to Own! Download Free Report Today Buy These 3 High-Yield Dividend Stocks All Under $15 Buy and Hold These 3 Dividend Stocks Forever PAA shares were unchanged in after-hours trading Friday. Year-to-date, PAA has declined -52.78%, versus a 5.02% rise in the benchmark S&P 500 index during the same period."}]}