{"article": [{"url": "https://stocknews.com/news/gwph-analysts-remain-bullish-on-gw-pharmaceuticals/", "published": 1594296500.0, "headline": "Analysts Remain Bullish on GW Pharmaceuticals", "body": "Since hitting its low in March, G.W. Pharmaceuticals (GWPH) stock has climbed to about $130 per share. The company, which has a $4 billion valuation, generated close to $300 million in sales for its epilepsy drug Epidiolex after being launched in the United States last year. Due to the success of Epidiolex, the company recently announced its intention to bring its flagship product Nabiximols to the U.S. market. GWPH management plans to submit the drug to the U.S. Food and Drug Administration FDA, though the earliest this could occur is 2021. 7 \"SAFE HAVEN\" Dividend Stocks for Turbulent TimesThe company just hosted a webcast to provide investors some insight into its Phase 3 clinical program for Nabiximols. GWPH’s CEO, Justin Gover said, “We are excited to present the details of our clinical program and regulatory strategy for Nabiximols, which we believe support the potential for a substantial near-term commercial opportunity in the U.S. Following constructive meetings with the FDA, we are now commencing a Phase 3 clinical program that provides multiple opportunities for an NDA submission, including as early as 2021. Beyond the initial target indication of M.S. spasticity, our Phase 3 clinical program is designed to achieve a broad spasticity label over time. This development strategy, together with the long-term exclusivity potential of Nabiximols, provides G.W. with confidence that this product should represent a significant value driver for G.W.” Due to the news, H.C. Wainwright analyst Douglas Tsao recently affirmed his Buy rating on GWPH. Tsao set a price target of $161. Tsao said he expects the company to post earnings per share (EPS) of $0.00 for the third quarter of 2020. That would be GWPH’s first flat quarter as the company moves closer to profitability. Out of 7 analysts covering the stock, GWPH has a consensus analyst rating of Strong Buy with an average price target of $182.67. I remain bullish on GWPH as I feel that Epidiolex is an essential drug, and should continue to see sales growth. Want More Great Investing Ideas? 9 “BUY THE DIP” Growth Stocks for 2020 Is the Bull S#*t Rally FINALLY Over? 7 “Safe-Haven” Dividend Stocks for Turbulent Times Top 3 Investing Strategies for 2020 GWPH shares were trading at $127.34 per share on Thursday afternoon, down $1.66 (-1.29%). Year-to-date, GWPH has gained 21.79%, versus a -1.45% rise in the benchmark S&P 500 index during the same period."}]}