{"article": [{"url": "https://stocknews.com/news/amzn-fb-baba-pypl-4-best-stocks-in-the-robinhood-100-to-buy-now/", "published": 1598011700.0, "headline": "4 BEST Stocks in the Robinhood 100 to BUY NOW!", "body": "On August 10th, it was reported that Robinhood would no longer share its stock popularity data. This was a shock to hedge funds that used the data for sentiment analysis, and financial writers such as myself that are generally interested in what retail investors are buying. Previously, Robinhood would list how many accounts owned each stock. This provided us a list of the most popular stocks ranked by how many accounts. Lucky for us, they still provide the 100 most popular stocks for now, but we can no longer see the list in order. The list in its current form can still give us an idea of what Robinhood investors are buying. In terms of reliable companies, the top 100 list is a mixed bag. Some stocks reflect short-term news-based trades, while others are long term investments. I decided to find the top four stocks, in my opinion, that belong in your portfolio. I evaluated the stocks based on several factors, including growth, profitability, financial health, and momentum. If you’ve read any of my articles, you know I like to look at valuation metrics. Still, for analyzing stocks that many investors are currently buying, valuation needs to take a backseat. 9 \"BUY THE DIP\" Growth Stocks For 2020I ran a proprietary stock screen that entailed the factors I mentioned, and as expected, the top four stocks are all household names with strong business models. The companies exhibit strong growth, high-profit margins, and are showing strong momentum. Here are the top four stocks to buy in the Robinhood 100: Amazon.com (AMZN), Facebook (FB), Alibaba Group Holding (BABA), and PayPal Holdings (PYPL). Amazon.com (AMZN) AMZN is among the world’s highest-grossing online retailers, with $281 billion in net sales. Online products and digital media sales accounted for 50% of net revenue in 2019. This was followed by commissions, related fulfillment and shipping fees, and other third-party seller services at 19%. Amazon Web Services’ cloud computing, storage, and database offerings represented 13% of revenue. Prime membership fees and other subscription-based services and product sales at Whole Foods rounded out the list. The company reported great second-quarter results as both earnings and revenues topped consensus estimates. The figures were also up year over year. AMZN has certainly benefited from coronavirus-led demand in online shopping. Online shopping drove growth in the company’s sales. The firm also saw a jump in online grocery shopping. AMZN’s Prime subscriptions are growing due to speedy delivery and expanding product selection. Its Amazon Web Services unit (AWS) is seeing strong growth as well. Overall, AMZN continues to be a solid growth stock. The company’s average three-year sales growth rate is 28.8%, and its average three-year EPS growth rate is 39.9%. The next year’s sales growth is expected to be 17.9%, and EPS growth is expected to be 39.9%. AMZN also has a strong return on equity of 17.9%. The company is rated a Strong Buy in our POWR Ratings system. As per the components that make up the POWR Ratings, AMZN is all As. It is also the #1 ranked stock in the Internet industry. Facebook (FB) FB is the world’s largest online social network, with 2.5 billion monthly active users. The firm’s ecosystem consists mainly of the Facebook app, Instagram, Messenger, WhatsApp, and other features within the apps. Advertising revenue represents more than 90% of the company’s total revenue, half of which comes from the U.S. and Canada. The company has a gross margin above 90%, meaning that its revenue minus its cost is very high. The company saw steady growth for the second quarter. This was driven by steady user growth in all markets. FB benefited from increased engagement with its products as people were forced to stay home to avoid the virus. The company is looking to increase revenue through video advertising. Video has become very popular on its platforms and is the most lucrative form of digital advertising. The company launched Watch, a dedicated tab for video viewing, to increase video ad revenue. Ads on Instagram have also aided revenue growth. The stock has a three-sale year sales growth rate of 31.2% and projects a 23.9% growth rate next year. Its EPS growth rate over the past three years is 22.3%, with a one-year growth estimate of 26.5%. FB has a strong return on equity, reflecting its profitability and a high return on invested capital (ROIC) of 21%. The company also has a high current ratio of 6, which tells me that it has a healthy balance sheet. FB is rated a Strong Buy by our POWR Ratings system. Similar to AMZN, FB also has straight As across the board for all POWR components. The company is the #4 ranked stock in the Internet industry. Alibaba Group Holding (BABA) BABA is the world’s largest online and mobile commerce company. It operates two of China’s most-visited online marketplaces, Taobao, which is for the consumer to consumer market, and Tmall, which is for the traditional business to consumer retail model. The company’s China marketplaces accounted for 68% of revenue in fiscal 2019. Taobao generates revenue through advertising and merchant data services, while Tmall drives revenue through commission fees. BABA also owns Aliexpress, where businesses can sell products to international customers. The company serves approximately 80% of the Chinese e-commerce market, the world’s largest market. Telecommunication services are low-cost and widely available in China. This has led to increased purchases through online shopping. BABA reported earnings yesterday of $14.82 per share, which was way over analyst expectations. The EPS was 61% higher than its earnings last year, for the same quarter. Revenue also grew from $114.31 billion to $15.75 billion. Revenue was driven by China commerce retail, which saw an increase of 21% year over year. BABA’s growing cloud business and is also helping to drive performance. BABA growth figures are strong, with a three-year average sales growth rate of 26%. Its forecasted sales growth rate for next year is 26%. EPS is forecasted to grow 27.7% next year. The stock has a solid return on equity of 19.8% and a gross margin of 44.6%. The company is rated a Strong Buy by our POWR Ratings service. It holds grades of A for Trade Grade, Buy & Hold Grade, and Peer Grade and is the #1 ranked stock in the China industry. BABA is also one of the stocks currently in Steve Reitmeister’s Total Return portfolio. Learn more here. PayPal Holdings (PYPL) PYPL is now one of the largest online payment solutions providers in the world. It has grown due to its strong product portfolio and a platform that offers simple and secure solutions to merchants and customers. The company’s peer-to-peer service, Venmo, has been a critical driver of growth as of late. The service is responsible for PYPL’s growing user base. Over the second quarter, PYPL added 21.3 million net new active accounts, a year over year growth rate of 21%. The company reported its most recent financial results on July 29th with an EPS of $1.07, compared to the consensus estimate of $0.61. This was a 29% increase from the same quarter a year ago. Revenue was $5.26 billion, a 13.9% increase from the previous year. The increase in new accounts led to strong growth in total payment volume. Management expects to continue to see an uptrend in the digital payment market for the rest of 2020. The company’s One Touch solution is the company’s most rapidly adopted product. It allows customers to make purchases through a variety of merchant sites and apps without entering additional information. PYPL has a solid growth history with a three-year sales growth average of 17.7% and a three-year EPS growth average of 20.3%. Its forecasted growth numbers for next year are similar. The stock has a gross margin of 44.9% and a current ratio of 1.4. Not surprising, PYPL is rated a Strong Buy in our POWR Ratings system. Due to its strong recent momentum, it has grades of A in every POWR component. It is also the #3 ranked stock in the Consumer Financial Services industry. Want More Great Investing Ideas? The Best of StockNews 2 Step Process to Sell @ Market Top in September 9 “BUY THE DIP” Growth Stocks for 2020 AMZN shares fell $2.50 (-0.08%) in after-hours trading Friday. Year-to-date, AMZN has gained 77.76%, versus a 6.56% rise in the benchmark S&P 500 index during the same period."}]}