{"article": [{"url": "https://stocknews.com/news/ups-fdx-ksu-ups-gnrc-bah-top-5-industrial-stocks-to-own-for-the-remainder-of/", "published": 1597838900.0, "headline": "Top 5 Industrial Stocks to OWN for the Remainder of 2020", "body": "Industrial stocks have been one of the best-performing sectors over the last 30 days, and the Industrials Select SPDR (XLI) looks to be on the verge of a breakout. &nbsp Another encouraging sign is that industrial data has been very strong in the countries that are further along in beating the coronavirus. Additionally, forward-looking indicators like commodity prices and the ISM New Orders Index are also forecasting increased industrial activity in the coming months. &nbsp If you are not currently invested in the industrial sector, there is still time to get a slice of the pie. The industrials are likely to hold strong as the economy gradually emerges from a recession. Let’s take a quick look at five of the industrial sector’s most intriguing stocks: United Parcel Service (UPS), FedEx Corporation (FDX), Kansas City Southern (KSU), Generac Holdings (GNRC) and Booz Allen Hamilton Holding Corporation (BAH). 9 \"BUY THE DIP\" Growth Stocks For 2020United Parcel Service (UPS) Just about everyone relies on UPS for deliveries. If you have not personally used UPS’ services in recent months, there is a good chance your employer has. UPS shipments are on the rise as fewer people are flying and driving and instead, rely on UPS to transport items on their behalf. The increasing penetration of e-commerce and its sharp growth bodes well for UPS. The POWR Ratings show UPS has A grades in each POWR Component but for its Peer Grade which is a B. UPS is ranked first of nine stocks in the Air Freight & Shipping Services sector. Even if the pandemic ends in the months ahead, UPS will continue to hold steady simply because behaviors have changed. The increasing familiarity and comfort with UPS services set the stage for success across posterity. Though UPS margins dropped on a quarterly basis, the company’s adjusted net income grew by nearly 9% on a year-over-year basis. UPS revenue spiked more than 13% as a result of its record daily volume increasing more than 20%. Look for UPS to break through its 52-week high of $162, possibly touching $170+ in the months ahead. FedEx Corporation (FDX) FDX’s business portfolio consists of transportation, business services, and e-commerce. This company’s worldwide express delivery services are as fast as it gets. However, FDX also offers lower-cost ground and freight transportation services to boot. All in all, FDX provides delivery service extends to 220+ nations and territories. Out of 22 analysts who have reviewed FDX, 14 recommend buying the stock, 8 recommend holding and none advise selling. The POWR Ratings show FDX has A grades in each POWR Component. FDX is ranked 2nd of 9 stocks in the Shipping category. With an attractive forward P/E ratio of 20.45 and solid earnings, FDX has serious potential moving forward. FDX could easily break through its 52-week high of $211.56 before the end of summer. Kansas City Southern (KSU) Contrary to popular opinion, railroads still constitute a big business as evidenced by the rise of KSU. With railroad investments in three countries, a fantastic 5-year chart, and a POWR Rating ranking in the top half of Railroad stocks, KSU is worthy of your attention. Dig deeper into the stock’s POWR Ratings and you will find it has A grades in each POWR Component but for its Peer Grade of B. Takeover rumors are also fueling KSU’s ascension. All in all, KSU is up more than 16% since its prior earnings report. It is quite possible KSU will be trading above the $200 benchmark by the beginning of the fall season. Generac Holdings (GNRC) Rolling blackouts in California combined with a general feeling of uncertainty have sent consumers scrambling for generators. GNRC designs and makes generators along with other engine-powered products for use in homes, businesses and construction sites. The GNRC POWR Ratings are flawless: As in each POWR Component along with an overall industry rank of 15 out of 59 stocks. Out of the dozen analysts who have studied GNRC in-depth, nine recommend buying the stock and three recommend holding. Ride this momentum stock through the summer bull run, reevaluate it in the fall and you will likely be quite pleased with your short-term gain. Keep in mind rolling blackouts are likely to occur with regularity in the years ahead so the likes of GNRC are also solid long-term holds. Booz Allen Hamilton Holding Corporation (BAH) It is often said the best group to be in business with is the government simply because budgets are massive and less dependent on other factors. The money printing machine that is our federal government is just one group that pays for BAH’s tech consulting and management services. The POWR Ratings reveal BAH is ranked first of 65 stocks in the Air/Defense Services category. BAH has A grades in each POWR Component but for its Industry Rank which is a C. The top analysts insist BAH still has some room for upward growth with five recommending the stock as a buy, three advising investors to hold and none encouraging investors to sell. BAH’s recent quarterly earnings beat estimates, setting the stage for the stock to move beyond its 52-week high of $86.96, possibly breaking through $90 or even hitting triple digits as the year rounds out. Want More Great Investing Ideas? The Best of StockNews 3 Possible Directions for the Stock Market from Here 9 “BUY THE DIP” Growth Stocks for 2020 UPS shares rose $0.16 (+0.10%) in premarket trading Wednesday. Year-to-date, UPS has gained 39.62%, versus a 6.38% rise in the benchmark S&P 500 index during the same period."}]}