{"article": [{"url": "https://stocknews.com/news/pypl-clgx-lcahu-v-after-falling-10-will-paypal-resume-its-rally/", "published": 1599826100.0, "headline": "After Falling 10%, Will PayPal Resume Its Rally?", "body": "PayPal Holdings, Inc. (PYPL) is one of the most popular digital payment operating technology platforms. It has over 346 million active users globally and is available in more than 200 markets around the world, enabling consumers and merchants to receive money in more than 100 currencies, withdraw funds in 56 currencies and hold balances in their PayPal accounts in 25 currencies. PYPL is one of the best performing financial stocks in 2020, with record revenue and earnings growth. In the second quarter ended June 2020, revenue increased 22% to $5.26 billion and EPS grew 86% to $1.29 year-over-year. Cash flow from operations of $2.4 billion grew 103% year-over-year while free cash flow increased 112% to $2.2 billion. With the accelerated shift to e-commerce and digital payments, the stock has gained 75.7% year-to-date. This impressive performance and the potential upside based on several factors have helped it earn a “Buy” rating in our proprietary rating system. 9 \"BUY THE DIP\" Growth Stocks For 2020Here is how our proprietary POWR Ratings system evaluates PYPL: Trade Grade: A PYPL is currently trading higher than its 50-day and 200-day moving averages of $189.17 and $138.42, respectively, indicating that the stock is in an uptrend. The stock’s 18.9% return over the past three months reflects a solid short-term bullishness. PYPL added more than 21.3 million new accounts in the second quarter of 2020, up 137% year-over-year. The company also witnessed a total payment volume (TPV) of $222 billion, the highest TPV generated in any quarter in the company’s history. Moreover, it rolled out a QR code payment system into its point-of-sale systems in 28 markets globally, enabling touch-free, one-time scan, quick and safe transactions. In the second-quarter earnings report, PYPL mentioned, “In the midst of the COVID-19 pandemic, digital payments have become more important and essential than ever. Our record performance in the second quarter — our strongest quarter ever — reaffirms the relevance of PayPal in the unfolding digital future.” Buy & Hold Grade: B In terms of proximity to its 52-week high, which is a key factor that our Buy & Hold Grade takes into account, PYPL is well-positioned. The stock is currently trading just 10.5% below its 52-week high of $212.45. Looking at the past three years, the stock has grown more than 203% due to its accelerating real-time access for funding small businesses, steady growth in user base, and rapid international expansion. The company’s revenue grew at a CAGR of 17.8% and net income increased at a CAGR of 19.7% over the last three years. Peer Grade: A PYPL is currently rated #5 out of 45 stocks in the Consumer Financial Services industry. Other popular stocks in the group are CoreLogic, Inc. (CLGX), Landcadia Holdings II, Inc. (LCAHU), and Visa Inc. (V). While LCAHU beat PYPL by gaining 97.5% year-to-date, CLGX and V returned 51.1% and 7.3%, respectively, over this period. Industry Rank: A The Consumer Financial Services industry is ranked #14 out of the 123 StockNews.com industries. Under the new stay-at-home normal, everything is increasingly becoming digital, from working to paying for groceries or apparel. An online survey conducted in August 2020 concluded that 60% of US consumers plan on using digital/touchless payments instead of cash/coins in the future because of the pandemic. So, the industry is expected to keep performing well. Overall POWR Rating: B (Buy) Overall, PYPL is rated a “Buy” due to its impressive past performance, digital payments getting a pandemic push, and solid price momentum, as determined by the four components of our overall POWR Rating. Bottom Line PYPL has soared more than 75% so far this year and is a decent investment for investors looking for stability and growth in the long-run. It was recently hit hard primarily due to profit booking but no company-centric development has occurred in the last few days that is likely to alter the company’s long-term growth potential and price momentum. Analyst sentiment, which gives a good sense of a stock’s future price movement, is pretty impressive for PYPL. The average broker rating of 1.23 indicates a favorable analyst sentiment. Of the 44 Wall Street Analysts that rated the stock, 33 have given it a “Strong Buy” rating. The market expects EPS for the current year to rise 20.3% from the year-ago value. This outlook should keep PYPL’s price momentum alive in the near term. Want More Great Investing Ideas? 7 Best ETFs for the NEXT Bull Market Will Stocks Fall into Historical September Slump? 9 “BUY THE DIP” Growth Stocks for 2020 PYPL shares were trading at $184.00 per share on Friday afternoon, down $6.09 (-3.20%). Year-to-date, PYPL has gained 70.10%, versus a 4.86% rise in the benchmark S&P 500 index during the same period."}]}