{"article": [{"url": "https://stocknews.com/news/sail-ping-aten-3-lesser-known-cybersecurity-stocks-with-buy-ratings/", "published": 1598357300.0, "headline": "3 Lesser-Known CYBERSECURITY Stocks With 'Buy' Ratings", "body": "When it comes to cybersecurity stocks, most investors are squarely focused on big-names like Cloudflare (NET), CrowdStrike (CRWD), Zscaler (ZS), Palo Alto Networks (PANW) and Okta (OKTA). &nbsp The stocks listed above certainly have their merits. However, there are several opportunities in the smaller names. These stocks are doing well in their niches and have the capacity to scale higher. &nbsp Here is a quick look at three under-the-radar cybersecurity stocks that have potential to pop as we head into the final two quarters of the year: SailPoint Technologies (SAIL), Ping Identity Holding Corp. (PING) and A10 Networks (ATEN). &nbspSailPoint Technologies (SAIL) Identity governance solutions might not be the sexiest line of business yet it certainly makes money. SAIL provides such solutions. Examples of SAIL products include data access governance, its open identity platform, identity governance through the cloud, and identity analytics. The company’s overarching purpose is to make it easier for organizations to better manage access rights to services, data, and more. This Austin, TX-based company is a POWR Ratings stud with A grades in each POWR Component. The stock has a B grade in the final POWR Component of Industry Rank. Furthermore, SAIL is ranked 6th of 23 publicly traded companies in the Software – Security category. The analysts insist SAIL is a Strong Buy with 10 of the 13 who have analyzed the stock advising investors to buy, three recommending investors hold and none advising selling. SAIL’s post-COVID rebound has been a sight to behold. The stock has escalated well beyond its pre-COVID trading price of $25, steadily climbing upwards amidst the pandemic to the $40 mark. 7 Best ETFs for the NEXT Bull MarketA large part of SAIL’s ascent is the result of its better than anticipated second-quarter earnings. The Street anticipated a loss of four cents per share yet SAIL dazzled investors and analysts alike with adjusted earnings of +15 cents per share. The company’s revenue spiked nearly 50% on a year-over-year basis, coming in a little bit above $92 million, well beyond the Street’s expectation of $69 million. If SAIL’s subscription sails continue to increase, the stock just might move well beyond its 52-week high of $39.50, possibly moving toward the $50 mark before year’s end. Ping Identity Holding Corp. (PING) Identity-related cybersecurity companies are quickly becoming the center of attention as more operations shift online. PING will likely garner even close analysis in the weeks and months to come as its flexible identity-related cybersecurity services become that much more lucrative. PING’s services ramp up digital initiatives and advance hybridized IT environments through multi-factor authentication, intelligent API, access management, single sign-on, and more. PING even manages profile data and identity at scale to boot. The POWR Ratings reveal PING has B grades in each of its POWR Components but for its Peer Grade which is a C. PING is moving on up in its industry rank, currently slotted at 13th of 23 stocks in the Software – Security space. The top analysts are bullish on PING, setting a price target of $35, indicating the stock has 4.35% upside. PING has bounced back quite nicely since its coronavirus dip, rising from $16 in March to its current price of $33 and change. In short, PING is a recession-proof stock that will become even more valuable as additional businesses and services move online. More than 90% of PING’s first-quarter revenue stems from subscription services that most companies “set and forget”, helping the likes of PING rake in the cash month-after-month. If PING’s AI advances continue to improve its value proposition, the sky is the limit for this stock. PING could easily be a $50 stock by the end of the year. A10 Networks (ATEN) Improving the security and performance of networks and data center applications is ATEN’s specialty. This cybersecurity stock doesn’t receive much attention from the mainstream media yet that might change soon. ATEN customers include service providers, enterprises, web companies, governments, and more. The POWR Ratings reveal ATEN has B grades in each component but for one. The stock shines particularly bright in its Trade Grade Component where it has an A grade. ATEN slots in 13th out of more than 50 publicly traded companies in the Technology – Communication/Networking space. The top analysts insist ATEN is undervalued, setting a $13.50 price target for this stock. If ATEN reaches this level, it will have increased by more than 50%. ATEN has a relatively low forward P/E ratio for a cybersecurity stock, coming in at 21.95. ATEN’s one-year chart inspires confidence as the stock hovered around the $7 to $8 range until the pandemic when it slid below $4 only to pop right back up to $7 in less than a month. ATEN will boost spending on sales and marketing in the quarters to come, adding even more clients and possibly reaching the $13.50 price target recently set by BWS Financial. Want More Great Investing Ideas? The Best of StockNews 2 Step Process to Sell @ Market Top in September 9 “BUY THE DIP” Growth Stocks for 2020 SAIL shares were trading at $39.12 per share on Tuesday morning, up $0.33 (+0.85%). Year-to-date, SAIL has gained 65.76%, versus a 7.65% rise in the benchmark S&P 500 index during the same period."}]}