{"article": [{"url": "https://stocknews.com/news/ung-rrc-ar-cog-should-you-buy-the-breakout-in-natural-gas-stocks/", "published": 1597147700.0, "headline": "Should You Buy the Breakout in Natural Gas Stocks?", "body": "Natural gas’ price has been in a downtrend for more than a decade. Some of the best investments are when assets emerge out of long bear markets. The United States Natural Gas Fund (UNG) is an ETF that tracks the natural gas price. Natural gas stocks have been outperforming natural gas over the past few months and are breaking out to new 52-week highs. In contrast, natural gas is well-below its 52-week highs. 7 \"SAFE HAVEN\" Dividend Stocks for Turbulent TimesThe obvious question: Why are investors buying these stocks given the lackluster price of the commodity? The answer: It’s because of declining production, low capex, and strengthening demand. Due to these factors, investors should look to buy the breakout in natural gas stocks. Natural Gas Bear Market Going from bear to a bull is a major transition. And, there have been several false starts for natural gas prices. Normally, lower commodity prices result in decreased production. Over time, this causes prices to stop falling and eventually rise when demand starts increasing. This process never happened in natural gas due to it being a byproduct of shale production. As a result, despite natural gas falling by nearly 80% over the last 12 years, production was higher in the past couple of years. Economics of Shale The economics of shale production is mainly contingent on oil prices. From 2011 to 2014, as oil prices hovered around $100, significant amounts of money were invested into shale. The ensuing bear market in oil prices has meant that new investments in shale projects have ceased, although existing projects continue to keep running. As oil wells are exhausted, new wells are not being drilled. This is evident from the Baker-Hughes rig count data. Oil rigs are down to 176 from 764 a year ago, and gas rigs are down to 69 from 169 a year ago. Declining Gas Production New investments in shale projects are only viable when oil prices are above $70-$80. Due to this, most investments in shale have failed to yield a positive return over the last decade. It’s unlikely that new money will be put to work in shale unless oil can rise above these levels and stay there for an extended period. Therefore, the biggest headwind to natural gas prices – high levels of production despite rock-bottom prices – is being removed. While supply is going to decrease as shale production dwindles, investment in new projects has dried up. Capex for natural gas is at record-low levels due to the price being depressed for so long. Even if prices move higher, it will take time for supply to increase given the dearth of investment in new projects. Demand Picture is Strong In the short-term, natural gas demand has been hit due to decreased economic activity. However, these measures have been trending higher which means that demand should return to normal levels. The EIA is forecasting that demand will return to pre-coronavirus levels by the fall. Two long-term catalysts are signaling a secular shift towards increased natural gas demand – conversion of coal-fired plants and LNG exports. During the Obama administration, the US converted coal-fired power plants to natural gas to reduce emissions. In 2008, 21% of power generation came from natural gas, today it’s 35%. Now, many countries in Asia, like China and India, are doing the same as these countries grapple with extreme levels of pollution that are having health consequences for its population. And due to the construction of LNG export terminals, US-produced natural gas will be shipped to foreign countries which will make it more of a global commodity. So, natural gas is going to see increased demand, at the same time, that production will decrease, while capex in the sector has been depressed for many years. Natural Gas Stocks Rising Natural gas stocks are reflecting this positive outlook. While natural gas prices have only marginally increased from their recent, record lows, the stocks are breaking out to new 52-week highs. In contrast, natural gas is more than 30% below its 52-week highs. Range Resources (RRC), Antero Resource (AR), and Cabot Oil & Gas (COG) are three of the highest-quality natural gas stocks to take advantage of this new bull market. Range Resource (RRC) RRC has broken out to new, 52-week highs over the past couple of days. This breakout was preceded by a three-month consolidation. It’s also interesting that prices remained firm despite natural gas rolling over and retesting its lows. This is an indication that investors have already priced in bad news in the short-term and are focused on the long-term. RRC owns some of the highest-quality assets in the natural gas space, and it’s been able to increase production. It’s one of the lower-cost producers and its earnings will go from slightly negative to positive if natural gas prices can stay above $2 per mcf. Further, its costs are expected to continue to decline. The bear market has forced every natural gas producer to become more disciplined which will pay dividends when the bull market arrives. (source: RRC Investor Presentation) Consistent with this strong fundamental picture, RRC is rated a Strong Buy by POWR Ratings. It has an “A” for Trade Grade, Buy & Hold Grade, and Peer Grade. Among Oil & Gas stocks, it’s ranked #2 out of 96. Antero Resources (AR) AR is the sixth-largest producer of natural gas and the second-largest producer of natural gas liquids. Its chart looks identical to RRC, although it has slightly more leverage due to higher debt levels than its peers. AR’s main struggle has been that it has a large number of near-term debt maturities. The stock price fell as bankruptcy risk increased. However, it’s made strides in increasing free cash flow by selling off assets and repurchasing its debt at a discount. Of course, the biggest catalyst is the improving outlook for natural gas prices. However, AR’s long-term chart shows there is considerable upside for the stock if a natural gas bull market resumes. The POWR Ratings rates AR a Buy. It has an “A” for Trade Grade and Peer Grade with a “B” for Buy & Hold Grade. Among the Energy – Drilling group, it’s ranked #1 out of 20. Cabot Oil & Gas (COG) COG is probably the highest-quality company in the natural gas space. This is evident from its strong price action, as it’s the only natural gas stock that was profitable over the last few years despite low prices. Additionally, it’s one of the few energy stocks which is making new 52-week highs in the past month. In the first quarter, its production cost was $1.46 per thousand cubic feet inclusive of all costs. It sits on the largest, proven reserves in the US in the Marcellus Shale which puts it near the Northeast, where natural gas demand is highest. Cabot could easily increase production if prices Want More Great Investing Ideas? 9 “BUY THE DIP” Growth Stocks for 2020 How to Trade THIS Stock Bubble? 7 “Safe-Haven” Dividend Stocks for Turbulent Times The POWR Ratings are also bullish on COG as it’s rated a Buy. It has an “A” for Trade Grade and Peer Grade with a “B” for Buy & Hold Grade. Among Oil & Gas stocks, it’s ranked #4 out of 96. UNG shares . Year-to-date, UNG has declined -27.52%, versus a 4.46% rise in the benchmark S&P 500 index during the same period."}]}