{"article": [{"url": "https://stocknews.com/news/twtr-fb-snap-pins-3-social-media-stocks-benefitting-from-the-facebook-ad-boycott/", "published": 1594296500.0, "headline": "3 Social Media Stocks Benefitting from the Facebook Ad Boycott", "body": "Facebook (FB) makes almost all of its money from advertising, earning more than $70 billion last year. This could be an issue for the company as a coalition consisting of Color Of Change, NAACP, ADL, Sleeping Giants, Free Press, and Common Sense Media have called on Facebook’s advertisers to hit pause on ad spending with the company this month. The reason for this boycott is because the organizations believe FB isn’t doing enough to fight and prevent the hate speech that exists on Facebook’s social media platforms. The campaign has picked up steam with several major brands, including Coca-Cola (KO), Ford (F), and Microsoft (MSFT), pulling ads from the social platform. As the boycott continues to grow, some of that ad revenue will end up in rival networks’ coffers. Here are three social networks that stand to benefit from the Facebook boycott: 9 \"BUY THE DIP\" Growth Stocks For 2020Twitter (TWTR) TWTR has also had recent censorship issues, but started adding warning labels to posts that contain false information. They have even taken down posts that glorify violence. This stands in direct contrast to FB. TWTR is looking into taking advantage of the situation by exploring new features. The company recently posted a job listing for a “full-stack engineer to lead the Payment and Subscription client work.” This is significant news, as is said in the listing that TWTR is building a subscription platform. The company currently generates approximately 85% of its revenue from advertising. If TWTR adds a subscription product, it could further boost revenue. Any subscription product would likely contain breaking news, advanced analytics, and more information on what followers were tweeting about. The stock’s shares are up 18.7% for July, over only 5 trading days. Many people flock to TWTR in times of uncertainty. During the pandemic, the company saw its daily active user growth swell 24% year over year during the first quarter. With the way 2020 has gone so far, there’s probably more in store. If that’s the case, TWTR should continue to see increased user growth, which bodes well for its advertising revenue. Snap (SNAP) In 2013, FB made an offer to SNAP CEO Evan Spiegel to buy the company for $3 billion. He famously turned it down. He also turned down another offer from FB in 2016 before the company went public. Since then, FB has copied almost everything SNAP has done. Unfortunately for FB, that hasn’t pulled the teen demographic away from SNAP. The company will never be as big as FB, but executives at the company must be smiling as they watch FB’s drama unfold. While numbers were not very good last year, things started to come together as the company reported great first-quarter numbers. Its revenue of $462.48 million outpaced analyst’s estimates of $431.43. The company also said that daily active users surpassed 229 million, a 20% increase over the past year. Those numbers have contributed to a 196% return for the company since its low closing price of 8.37 on March 18. How does SNAP stack up for the POWR Ratings? A for Trade Grade A for Buy & Hold Grade A for Industry Rank A for Peer Grade A for overall POWR Rating That’s fantastic, especially when you consider the fact that it is the #8 rated stock in the top industry, Internet Stocks. Pinterest (PINS) PINS is another social network that is benefitting from the FB ad boycott. Out of all the platforms, it has the least amount of negative publicity. Its website is a positive place where people share inspiring quotes and fun images. There are no mean-spirited interactions that you often see on FB. The company doesn’t allow any political advertising and bans content that it deems violent or racist. The platform currently has a global user base of 300 million, which should see continued growth. The company’s advertising platform is similar to Google Search in that people are actively searching for something. They aren’t being annoyed with intrusive ads while scrolling through their feed. This provides high converting ads for advertisers. The company is only in the early stages of monetizing its user base. PINS has estimated revenue growth of 35.8% for next year and has a price to sales ratio of only 13.0. Want More Great Investing Ideas? 9 “BUY THE DIP” Growth Stocks for 2020 Is the Bull S#*t Rally FINALLY Over? 7 “Safe-Haven” Dividend Stocks for Turbulent Times Top 3 Investing Strategies for 2020 TWTR shares were trading at $35.36 per share on Thursday afternoon, down $0.05 (-0.14%). Year-to-date, TWTR has gained 10.33%, versus a -1.74% rise in the benchmark S&P 500 index during the same period."}]}