{"article": [{"url": "https://stocknews.com/news/dow-ibm-cvx-the-dow-jones-hidden-dividend-powerhouses/", "published": 1599134900.0, "headline": "The Dow Jones’ “Hidden” Dividend Powerhouses", "body": "I dig dividend stocks that keep a low profile. Forget the front-page financial headlines. I’d prefer to own a high paying stock as it’s making its way from page 16 up to page 1! That’s when the real money is made, and the highest yields are banked. These under-covered stocks give us a “two-fer” benefit. A lack of media and analyst coverage allows you and I to exploit dirt-cheap prices, unlocking far more potential than if we chased them once everyone else started to notice them. Better still, low prices in unexplored areas of the market equal juicy yields. Imagine squeezing 10.1% from the real estate biz. Or 10.9% from small business lenders! 7 Best ETFs for the NEXT Bull MarketBut once in a while, phenomenal yields will hide in plain sight. Case in point: Right now, you can generate nearly 6% in annual income from some of the bluest blue chips in the Dow Jones Industrial Average. But don’t buy the index for this dividend, because it doesn’t yield nearly this much: The Dow Jones Average Pays Just 2.1%… On Average But the average is just that: an average. And that average hasn’t just been driven down by improving prices. Two components—Boeing (BA) and Disney (DIS)—have dropped their dividends over the past few months. Plus, the Dow’s latest reorganization just plucked three of the industrial average’s top yielders, replacing them with two ho-hum payers and one stock—Salesforce (CRM)—that doesn’t pony up a single cent. IN Company Ticker Yield Amgen AMGN 2.50% Honeywell HON 2.10% Salesforce.com CRM N/A OUT Company Ticker Yield Exxon Mobil XOM 8.60% Pfizer PFE 4.01% Raytheon Tech. RTX 3.10% All of these factors are helping to mask a few truly underloved blue chips right now. Sure, Dow stocks usually deliver sleepy returns. In fact, the “Dogs of the Dow” strategy—cover your eyes, pinch your nose and buy the 10 highest-yielding Dow dividend payers at the start of the year—is 0-for-10 against the index in 2020. But occasionally, if you buy one of these blue chips at just the right time, and just the right price, you can secure a double whammy of price potential and high yield. These Two “Dogs” Returned Roughly 40%+ in 2019 Currently, three Dow stocks are flashing on my radar as potential opportunities because of their relatively sky-high yields: As a group, they yield a stunning 5.9% on average. Read on, and I’ll help you determine whether any of these stocks could be the next great “hidden” blue-chip opportunity. Dow (DOW) Dividend Yield: 6.2% Chemicals giant Dow (DOW), like many global industrial firms, has suffered from COVID’s financial fallout for longer than most. That’s because China—where Dow does brisk business—bore the brunt of things earlier than the rest of the world. While many stocks were still peaking in mid-February, Dow was in the midst of what would be a nearly 60% decline YTD decline through the March lows. And the stock is still hobbled, off by 15% thanks to a slow and uneven recovery here at home. Those declines helped plump up the yield to above 6%, sure. But Dow was a generous blue chip (~5%) to start the year. Dow CEO Jim Fitterling even went to bat for the yield in March when it jumped into the double digits, calling it “artificially high.” He pointed out the company’s improved financial position, saying they were “ready to go into a down cycle” after a decade-plus bull run. The good news for new buyers? For one, Dow is a natural fit to recover as the global economy heals. That’s reflected in analysts’ estimates for a 180% jump in profits in 2021 from this year’s depressed levels. Also, the payout appears safe. While Dow did announce job cuts in July to save about $300 million annually, the company’s Q2 results showed $1.3 billion in free cash flow against just $516 million spent on dividends. But shares are hardly cheap at 23 times still-sluggish forward estimates. I’d welcome a broad September slump to make DOW a bit more affordable. International Business Machines (IBM) Dividend Yield: 5.3% Any conversation about International Business Machines (IBM) needs to start by acknowledging that its business continues to dry up: IBM’s Business Is Perpetually Shrinking IBM’s revenues have declined in seven of the past eight years, and that outlier year (2018) was a marginal improvement. So, what does Big Blue have going for it? Well, for one, it replaced Ginni Rometty earlier this year with Arvind Krishna, who has an encouraging background. As SVP of IBM Hybrid Cloud, he pushed for the $34 billion acquisition of open-source software maker Red Hat, which has since put a jolt into IBM’s cloud business. He also helmed the IBM Research division. And COVID-19 has accelerated several trends affecting IBM, according to Wedbush’s Moshe Kashi. That includes the cannibalization of its legacy offerings but also the adoption of its cloud services, which now make up more than a third of overall revenues. IBM also is one of the cheapest blue chips on Wall Street right now, offering up a 5%-plus yield at a measly 10 times earnings. But the yield is all you might get. Despite its cloud progress, Big Blue is expected to notch another year of sales deterioration this year. And while Wall Street forecasts revenues growth in 2021, it’s a miserly 1.7% improvement that would still put sales below 2019 levels. IBM remains dead dividend money. Chevron (CVX) Dividend Yield: 6.2% You could argue that Chevron (CVX) has supplanted Exxon Mobil (XOM) as America’s premier energy firm. Exxon still might be larger (not by much), but Chevron has done a better job weathering the pair of energy crises of the past six years, it’s the only energy major left in the Dow after XOM’s recent expulsion, and it seems to be on better fundamental footing at the moment. Chevron Has Been Respectable Against Adversity That isn’t to say things are exactly rosy in Chevron’s world. The integrated oil major flipped from a $4.3 billion profit in Q2 2019 to an $8.3 billion loss in this year’s second quarter, with the nastiest losses coming from its upstream unit. And that bleeding came despite spending 40% less on capital expenditures. About the only thing that Chevron is spending cash on is its dividend, which CVX has pulled out all the stops on to maintain. Chevron didn’t even pull out its wallet to bid on Noble Energy in July. It offered up about $5 billion worth of stock to acquire more diversified assets, including a bolstered shale presence. That’s ultimately why it’s difficult to count Chevron out. It boasts numerous segments—E&P, refining, chemicals, transportation, and more—that can shoulder the load when one or two areas of the business fall flat. Want More Great Investing Ideas? Your Early Retirement Portfolio: 7.7% Dividends—Every Month—Forever How to Retire on 10% Dividends Paid Monthly The Simple (and Safe) Way to Earn 15% Every Year from Stocks DOW shares were unchanged in after-hours trading Thursday. Year-to-date, DOW has declined -7.11%, versus a 8.42% rise in the benchmark S&P 500 index during the same period."}]}