{"article": [{"url": "https://stocknews.com/news/snap-how-much-upside-is-left-in-snap-inc/", "published": 1599048500.0, "headline": "How Much Upside Is Left In Snap Inc.?", "body": "Despite the major stock indexes hitting record highs, this hasn’t been the easiest market to trade for many investors. For starters, value investors have been left in the dust. This is certainly a growth market; however, even growth stock investors may be struggling if they aren’t in the handful of outperforming industries. Most of the action has been in the “Big 5” tech companies; electric vehicle companies; and biotech (COVID-19 vaccine and testing) companies. Unfortunately, options in those groups can be so expensive that they aren’t worth taking a risk on for options traders. Of course, there are ways to use options spreads to lower your cost, but that requires a more advanced understanding of options trading. One industry that has experienced some growth but has not gone crazy is social media. Some of the largest social media companies (not including Facebook) could make very attractive covered call trades. 7 Best ETFs for the NEXT Bull MarketA covered call trade is when the investor buys shares of a stock in 100-lot increments and sells calls on those shares at a higher strike price. This gives the investor a chance to earn profits from upside potential up to the call strike, while also collecting income from selling the call. The reason covered calls are potentially suitable for the social media industry is that many of these companies have both reasonable growth potential and a floor. With remote working/schooling prevalent in this pandemic environment, social media has become an important communication source. Snap (SNAP) Take Snap (SNAP), for example, the social media video streaming service behind the popular Snapchat app. SNAP shares are up about 37% year-to-date. That’s a solid performance and certainly a more realistic gain to hold than some of the wild moves we see in other stocks. Snap can back up its performance with substantial user growth. At least one well-capitalized trader agrees that SNAP is a reliable, long-term covered call candidate. The trader purchased 1 million shares of SNAP at $22.42, while simultaneously selling 10,000 January 2022 30 strike calls for $3.05. The trader collects $3.1 million from selling the calls but also has upside potential in the stock up to $30 per share (until expiration in January of 2022). The yield on the calls alone is 13.6% over the life of the trade (about 1.5 years). Max gain on the trade is 47.4% if SNAP is at $30 or above at expiration. The position doesn’t start losing money until the stock drops below the breakeven point of $19.37. Usually, I’m not much of a fan of long-term covered calls, but in this case, I think it makes sense. There is still plenty of upside potential for the stock, while also generating a robust yield for a one and half-year period. I don’t think SNAP is an overly risky stock to own, but the call sale does provide some downside cushion there as well. Want more great investing ideas? Download free the “10-Step Options Trading Checklist” you need before making a trade. The Virtual Trading Pit Is Open: Trade Set-ups, Training, New Trading Ideas How to Try Out Options Without Risking a Penny SNAP shares fell $0.09 (-0.38%) in after-hours trading Wednesday. Year-to-date, SNAP has gained 44.09%, versus a 12.28% rise in the benchmark S&P 500 index during the same period."}]}