{"article": [{"url": "https://stocknews.com/news/iipr-gwph-smg-3-cannabis-stocks-to-buy-and-hold-for-the-next/", "published": 1600690100.0, "headline": "3 Cannabis Stocks to Buy and Hold for the Next Decade", "body": "Marijuana stocks have taken investors on a wild ride in the last two years. Cannabis stocks soared to record highs shortly after Canada legalized marijuana for recreational use in October 2018. However, most cannabis companies were then trading at expensive valuations which means a sell-off was on the cards. But the mayhem that followed has surprised investors and analysts alike. The cannabis sector has been impacted by several structural issues that include a thriving black market, oversupply, and the slow rollout of retail stores. These factors have led to widening losses and high inventory levels, driving stock prices to multi-year lows. While the cannabis market is still at a nascent stage and poised for robust growth in the upcoming decade, this high-growth industry has also attracted multiple players which means there is a good chance that several pot companies can go bust given their weak financials. 7 Best ETFs for the NEXT Bull MarketHere we look at three cannabis stocks that have a strong balance sheet and widening profit margins, making them solid long-term bets right now. A cannabis-focused REIT Innovative Industrial Properties (IIPR) is a REIT (real estate investment trust) that targets medical-use marijuana facilities for acquisitions via sale-leaseback transactions. IIPR has long-term, triple net lease agreements with tenants that are licensed growers. IIPR purchases real estate assets of companies that are part of the highly regulated medical-use cannabis sector. As cannabis is still illegal at the federal level in the U.S., it is difficult for licensed producers to raise capital via traditional means. IIPR’s business model helps cannabis growers to lower capital expenditure and focus on manufacturing expertise and core operations. IIPR’s sale-leaseback solutions offer an attractive alternative to licensed operators. The company has acquired facilities in states where medical-use cannabis is legal. In short, IIPR acquires industrial and retail properties from cannabis producers and leases it back to them under long-term net lease agreements. The company focuses on well-capitalized companies and acts as a source of capital to operators by acquiring their real estate. It now owns 62 properties in the U.S. totaling 4.7 million square feet of rentable area with a weighted-average remaining lease term of 16 years. A dividend yield of 3.8% IIPR stock is trading at $125 which is just below its all-time highs. While most marijuana stocks have lost over 50% this year, IIPR is up 71% in 2020. Despite its stellar growth year-to-date, IIPR also sports a forward dividend yield of 3.8%. As a REIT, IIPR distributes at least 90% of its taxable income to shareholders and the company has paid consecutive quarterly dividends since the second quarter of 2017. Its focus on inorganic growth will help IIPR increase sales and cash flows which in turn will allow it to increase dividends over time. Analysts expect IIPR sales to increase 146% to $109.1 million in 2020 and by 76% to $193.3 million in 2021. This means the stock is trading at a forward price to sales multiple of 25x. Comparatively, its forward price to earnings multiple is 38.5 which is not unreasonable given its expected earnings growth of 59.6% in 2020. A medical marijuana giant The second stock on the list is GW Pharmaceuticals (GWPH), one of the leaders in the development of plant-derived cannabinoid therapeutics. The company has established a huge presence in the medical marijuana space by its focus on drug discovery and a robust development process, combined with its intellectual property portfolio and manufacturing expertise. GW developed an oral formulation of purified cannabidiol (CBD), which has been approved as Epidiolex by the U.S. Food and Drug Administration. Epidiolex was launched in November 2018 for the treatment of seizures associated with Lennox-Gastaut syndrome (LGS) or Dravet syndrome for patients above the age of two. The FDA expanded the approval of Epidiolex for the treatment of seizures associated with tuberous sclerosis complex. In the second quarter of 2020, GW Pharma sales were up 68% year-over-year at $121 million and revenue is forecast to grow 64% to $511 million in 2020. GW might also be the first cannabis company to report $1 billion in annual sales. However, GW is heavily dependent on Epidiolex for revenue growth. In Q2, the drug accounted for 96.6% of total sales. Another reason that might concern investors is the company’s negative profit margins. While investors forecast earnings to decline from -$0.24 in 2019 to -$2.22 in 2020, it’s expected to improve to $2.05 in 2021. GW Pharma will have to expand its product line and profit margins to generate market-beating returns in the upcoming decade. The stock is already up 870% since it went public back in January 2012. An ancillary company Scotts Miracle-Gro (SMG) manufacturers and sells consumer lawn and pest control products. The company provides cannabis companies with essential supplies to aid hydroponic and indoor growing via its subsidiary Hawthorne Gardening. In the most recent quarter, Hawthorne sales were up 70% year-over-year and this business is forecast to grow sales between 30% and 35% in 2020. In 2020, Hawthorne is poised to report $1 billion given the first six months have already yielded $428 million. Hawthorne accounted for 17% of sales in Q2 and is expected to be a key driver of sales as the marijuana segment continues to grow at a rapid pace. The final takeaway We can see that the three stocks on the list are not traditional pot companies. One is primarily focused on developing medical marijuana products while the other two are ancillary or support companies. Pure play cannabis companies are risky bets right now given the issues discussed above. However, ancillary companies are well placed to gain from the rapidly growing marijuana market. These three companies continue to grow top-line at a fast clip which in turn will help them improve profit margins and reinvest in expansion efforts. Want More Great Investing Ideas? 7 Best ETFs for the NEXT Bull Market Stock Market Outlook: Before & After the Election Chart of the Day- See the Stocks Ready to Breakout IIPR shares were trading at $122.10 per share on Monday morning, down $2.69 (-2.16%). Year-to-date, IIPR has gained 64.91%, versus a 1.58% rise in the benchmark S&P 500 index during the same period."}]}