{"article": [{"url": "https://stocknews.com/news/acb-gwph-apha-cannabis-stock-weekly-recap/", "published": 1594382900.0, "headline": "Cannabis Stocks Weekly Recap", "body": "This has been a volatile week for the cannabis sector as COVID infections continue to hit records in the United States. The ETFMG Alternative Harvest ETF (MJ) has been going up and down all week. It was priced at $13.19 on Monday afternoon, then dropped to $12.64 on Thursday morning, and is now back up to $13 as of Friday afternoon. Aurora Cannabis (ACB) Appoints New CCO Aurora Cannabis (ACB) continues to execute on their business transformation plan. The company appointed Miguel Martin, President of Aurora USA, and head of Reliva to the chief commercial officer of Aurora. Mr. Martin replaces Darren Karasiuk, who has held this position at Aurora since February 2019. 7 \"SAFE HAVEN\" Dividend Stocks for Turbulent TimesMichael Singer, Executive Chairman and Interim CEO of Aurora, said, “This appointment allows us to take full advantage of Miguel’s depth of international CPG experience to drive Aurora’s revenues and brand strength in our global core markets.” Investors are still waiting for the company to announce a new CEO. Singer remains interim CEO for the time being. Despite the positive news, ACB stock continued to slide, falling below $12. Analysts Remain Bullish on GW Pharmaceuticals (GWPH) Despite the uncertainty surrounding a possible second wave of COVID-19, analysts covering GW Pharmaceuticals (GWPH) remain bullish. H.C. Wainwright analyst Douglas Tsao recently affirmed his Buy rating on the stock. Tsao set a price target of $161. Tsao also expects the company to post earnings per share (EPS) of $0.00 for the third quarter of 2020. That would be GWPH’s first flat quarter as the company moves closer to profitability. As Epidiolex sales ramp up across the globe, I believe there is nothing to stop GWPH from hitting $200 per share over the next 12 months. Aphria (APHA) Continues to Slide Despite being the number one cannabis pick among many analysts, Aphria (APHA) can’t find footing in this market. The stock has been trading around $4 per share over for the past month. As cannabis sales are forecasted to show weaker sales in the second quarter, I understand why investors are more bearish. Despite the low trading range, APHA was profitable well before its peers, which makes me a lot more confident about the stock. Keep your eyes on APHA over the next few weeks, especially if volatility picks up. Want More Great Investing Ideas? 9 “BUY THE DIP” Growth Stocks for 2020 Is the Bull S#*t Rally FINALLY Over? 7 “Safe-Haven” Dividend Stocks for Turbulent Times Top 3 Investing Strategies for 2020 ACB shares were trading at $11.91 per share on Friday afternoon, up $0.14 (+1.19%). Year-to-date, ACB has declined -54.05%, versus a -0.65% rise in the benchmark S&P 500 index during the same period."}]}