{"article": [{"url": "https://stocknews.com/news/spy-inx-dia-iwm-qqq-when-does-the-next-bull-run-start/", "published": 1600862900.0, "headline": "When Does the Next Bull Run Start?", "body": "(Please enjoy this updated version of my weekly commentary from the Reitmeister Total Return newsletter). Friday we broke below the 50 day moving average. And then Monday the floor dropped out with a broad based market sell off. The general theme in the media was about a recent spiking of Coronavirus cases in Europe. And yes, the groups most harmed by the virus saw the biggest red arrows (airlines, restaurants, banks, energy etc). But let’s be honest, the market has not reacted to a negative Coronavirus headline in 5 months. So I would say it has more to do with the typical way a bubble works. 7 \"SAFE HAVEN\" Dividend Stocks for Turbulent TimesWe talked about this consistently during the summer as we agreed to ride the bubble to its peak. That we were coming along with our eyes WIDE OPEN that it was a bubble so we could be amongst the first out the door when it was ready to fall apart. Meaning that we would not get caught up in the “irrational exuberance” or the false “buy the dip” notion that comes when you become deluded by the belief in the bubbles veracity or permanency. Then the stars lined up for the party to end in September which is why we made our first defensive moves the end of August. That being taking profits on some of our tech positions then adding inverse ETFs to profit from the market decline that was likely to follow. The real point is that the market should NEVER have been this high. So now prices are getting right sized having some misguided investors scrambling for an answer. Thus, the answer to its decline is simply that it should have never happened in the first place. That the market was filled with “irrational exuberance” that led to making new highs in the midst of a horrible recession. That rise was the hallmark of the insanity that comes hand in hand with a stock bubble. So the current decline from there is actually the return of sanity. So now the proper questions are: How low will stocks go? When will they rise again? We covered both of these topics in last week’s commentary. “Overall I expect a breakdown below the 50 day moving average at 3331 and likely test the 200 day moving average at 3100. That may be the full extent of the pain. But I suspect that once the momentum picks up to the downside that 3,000 is an important psychological level that may need to be tested to form a buyable bottom.” I believe the above is still quite sensible. But then I remembered that the market runs on 2 kinds of fuel: fear and greed. Both of which can push the market to extremes that are beyond logical limits. Meaning that greed is what pushed stocks all the way up to a bubblicous high of 3,588. And thus its counterpart, fear, can easily push stocks below a reasonable level. So for now I will say that the price on the bottom is less important than the time it happens. And that time is once the election is settled. That SHOULD be Wednesday November 4th. But the risk at this time is that the rise in write in ballots are likely to delay election results. Even worse, it could lead to a contested election given concerns over potential voter fraud. This topic made it to the cover of The Economist a couple weeks back and was the lead story on 60 Minutes this weekend. Meaning this is not a fringe theory. It has the real potential to take place which is why it is unwise to get long UNTIL the election is finalized. So right now my plan is not so much on calling the level that marks the bottom of this correction. It is more focused on buying back into stocks once the election is finalized. Let’s pray for our nation that does take place in orderly fashion on Wednesday November 4th. Now let me give you a quick roll call of the important economic events this past week. The sum total is supportive of the idea that the economy continues to mend bit by bit from the ails of the coronavirus. * Fed Meeting last week basically told investors that rates will stay low for a long, long time. Like maybe even being at zero through 2023. This continues to tilt the scales towards any investment with a chance of positive return like the stock market. But also of interest was their improved outlook for the economy where they now see the unemployment rate improving to 7.6% by the end of the year versus the previous expectation of 9.3%.That is a sizeable improvement in their forecast. * All 3 Regional Manufacturing reports had strong readings (Empire State, Philly Fed, Richmond Fed). They were in a range of +15 to 21 which is pretty impressive. Also of note is that the employment readings are improving which was not true in previous reports. That is supportive of the notion that businesses see sales and profits on the incline going forward thus making the hiring of more employees attractive once again. This is one of the best signs that the positive trends in the economy should continue forward. * Consumer Sentiment on Friday 9/18 was another low reading of 87.5. But directionally speaking this is nicely higher than last month’s reading of 82.9. The improvement in the economic data corresponds with the improvement in my market outlook explained in last week’s commentary. Certainly the economy is not in good shape. And certainly stock prices got WAY TOO high given conditions which is in the process of rightsizing now. However, what matters most is the direction of things…and that direction is pointing to improvement. As long as that is happening coupled with low rates, then it is hard not to want an allocation to the stock market. At this moment we just need to wring more of the excess from the bubble out of stock prices. Then get past the hurdle of the election (especially if it ends up being contested). From there stocks should continue to head higher as long as these improvements in the economy remain. So adding it all up, we are going to stay defensive through the end of the election. Then start to get long the market in the groups most likely to outperform. What To Do Next? Right now my Reitmeister Total Return portfolio has already taken steps to protect against the correction that likely will extend into the November election. All in all we have 8 positions that are just right for the times. 3 stocks that are uniquely built to excel during the Coronavirus recession. 2 precious metals ETFs because when the US government and Fed throw money out of a helicopter it devalues the dollar and makes precious metals all the more valuable. 3 inverse ETFs that rise as the market falls. This has been our saving grace in September as the market tumbled from recent highs. And likely will continue to rise in value as this correction has not yet run its course. But let’s be honest with ourselves. Its crazy out there! That’s why I am trying my best to help investors make sense of it all and profit from whatever scenario comes our way. The best way for me to do that is give you 30 days access to the Reitmeister Total Return. This is my newsletter service where I share more frequent commentaries on the market outlook, trading strategy, and yes, a portfolio of hand selected stocks and ETFs to produce profits whether we have a bull…a bear…or anywhere in between. As shared above, we properly called an end to the stock bubble in September and already aligned our portfolio to protect against the downside. That explains how we continue to handily top the market at this time while others are seeing dramatic losses. Just click the link below to see all 8 stocks and ETFs in this uniquely successful portfolio. Plus get ongoing commentary and trades to adjust your strategy as 2020 continues to the wildest market in history. Gladly it can be tamed. About Reitmeister Total Return newsletter & 30 Day Trial Wishing you a world of investment success! Steve Reitmeister …but everyone calls me Reity (pronounced “Righty”) CEO, Stock News Network and Editor, Reitmeister Total Return SPY shares rose $0.73 (+0.22%) in premarket trading Wednesday. Year-to-date, SPY has gained 4.28%, versus a % rise in the benchmark S&P 500 index during the same period."}]}