{"article": [{"url": "https://stocknews.com/news/amzn-wkhs-plug-baba-4-stocks-setting-up-for-big-moves-in-september/", "published": 1599134900.0, "headline": "4 Stocks Setting Up for BIG MOVES in September", "body": "The stock market has been scorching hot since it bottomed in late-March. Many are expecting a pullback due to the markets getting overbought, Congress’ inability to reach a deal on a second stimulus package, and the upcoming election. However, there are reasons to expect further gains. Many money managers are underinvested and underperforming. They may become “forced buyers”. Some of the stocks that could outperform are stocks with strong growth characteristics in expanding markets. Amazon.com, Inc. (AMZN), Alibaba Group Holdings Ltd. (BABA), Plug Power, Inc. (PLUG), Workhorse Group, Inc. (WKHS) are four stocks that are setting up for big moves in September and offer attractive entry points. 7 \"SAFE HAVEN\" Dividend Stocks for Turbulent TimesAmazon.com, Inc. (AMZN) AMZN has already had a big year. Its stock price has broken previous records and is trading near all-time highs. The stock has delivered a return of 91.1% so far this year, which is a considerable achievement considering how highly-priced the stock was, to begin with. However, the stock may still have significant upside left for this month. AMZN has recently received approval from the Federal Aviation Administration (FAA) which allows it to start testing its drones fleet for commercial delivery. If the move is successful, AMZN could experience far greater efficiencies in its delivery operations. AMZN has also been expanding into healthcare by acquiring PillPack, by investing in a COVID-19 testing lab, and the introduction of its Halo Band wearable device. Thanks to the boom in AMZN’s cloud services and e-commerce operations in the COVID-19 era, it is estimated that AMZN’s EPS will grow by 36.8% in the next quarter and by 39% next year. The company’s revenue may also grow by 32% in the quarter ended in September 2020. How does AMZN stack up for the POWR Ratings? A for Trade Grade A for Buy & Hold Grade A for Peer Grade A for Industry Rank A for Overall POWR Rating You can’t ask for better. The stock is also ranked #1 out of 57 stocks in the Internet industry. Alibaba Group Holdings Ltd. (BABA) BABA is known as China’s Amazon and for good reason. BABA has a market capitalization of $750 billion and is one of the largest e-commerce companies in the world. This e-commerce giant’s stock has delivered a return of 40% so far this year. Ant Financial is set for an IPO in the Hong Kong and Shanghai capital markets and the IPO could be one of the biggest in years with a potential valuation of $225 billion for Ant Financial. Reportedly, BABA has a 33% stake in the company. BABA’s investments in electric vehicle manufacturer XPeng also seems to have paid off with XPeng’s IPO being a massive success. XPeng’s stock price boomed by 40% upon its debut on the New York Stock Exchange. BABA is also expanding its footprint in the logistics network by investing $967 million in YTO Express. BABA is expected to witness a growth in EPS of 15.1% in the current quarter and 23% in the current year. BABA’s revenue growth is expected to be 53.7% for the current quarter and 35.6% for the current year. It’s no surprise that BABA is rated a “Strong Buy” in our POWR Ratings system, with a grade of “A” in Trade Grade, Buy & Hold Grade, and Peer Grade. In the 115-stock China industry, it is ranked #1. Plug Power, Inc. (PLUG) PLUG is focused on alternative energy technology and develops and markets fuel-cell systems for the industrial off-road vehicle market. Companies like Walmart Inc. (WMT) and Amazon power their warehouse and back-end operations through vehicles powered by PLUG’s systems. PLUG has been on an upward price momentum so far this year with its stock gaining 315.8%. This momentum may continue this month. The company has recently completed a delivery of a 25kW GenFuel electrolyzer to Nagasaki, Japan signaling the company’s entry into the Japanese green Hydrogen market. PLUG has also developed a new 1kW ProGen fuel system that can find application in small-scale robotics, drones, and other aerospace devices. PLUG’s revenue is expected to grow by 81.6% in the quarter ended in September 2020. The EPS of the company is also estimated to grow by 22.2% in the current quarter and 25% per annum over the next five years. PLUG’s strong fundamentals are reflected in its POWR Ratings, it has a “Buy” rating with an “A” in Trade Grade. Within the Industrial – Equipment industry, it’s ranked #17 out of 57 stocks. Workhorse Group, Inc. (WKHS) WKHS focuses on the development, manufacture, and sale of electric medium-duty trucks and unmanned aerial delivery systems. The company’s stock has delivered a stellar price performance so far this year with a gain of 523.2%. The recent rise in WKHS’s stock price has been attributed to various reasons such as the company’s potential to enter into a $6 billion deal with USPS and the company securing a $70 million investment from an institutional investor. The company has also made recent moves that could drive growth for the stock in September. WKHS has entered into a strategic partnership with Hitachi America for the latter to help WKHS scale up its supply chain capabilities, manufacturing, and operational efficiencies. Hitachi America will also help WKHS develop a national dealership network and will provide certain types of financing. The company has also acquired state and federal approvals that have positioned it as the only BEV OEM permitted to sell their vehicles in all 50 states in America. WKHS is expected to increase its EPS by 35.3% in the current quarter and by 66.7% in the next quarter. The company’s revenue is expected to grow 69,400% in the quarter ended in September 2020. It’s no surprise that WKHS is rated a “Buy” in our POWR Ratings system, with a grade of “B” in Trade Grade and Industry Rank. In the 28-stock Auto & Vehicle Manufacturers industry, it is ranked #15. Want More Great Investing Ideas? 7 Best ETFs for the NEXT Bull Market Beware Stocks in September? 9 “BUY THE DIP” Growth Stocks for 2020 AMZN shares were trading at $3,374.21 per share on Thursday afternoon, down $157.24 (-4.45%). Year-to-date, AMZN has gained 82.60%, versus a 9.36% rise in the benchmark S&P 500 index during the same period."}]}