{"article": [{"url": "https://stocknews.com/news/acn-virt-phi-nobl-3-dividend-stocks-outperforming-the-sp-500/", "published": 1598875700.0, "headline": "3 Dividend Stocks OUTPERFORMING the S&P 500", "body": "The coronavirus has left a trail of destruction in its wake including on the economy. However, it’s becoming increasingly clear that many companies are thriving in the post-coronavirus world, as they are positioned to take advantage of the changes in the world. There’s also a growing disconnect between the “real” economy and the stock market. One factor has been the plummet in interest rates which makes other assets more attractive on a relative basis especially dividend stocks. The S&P 500 index has gained more than 50% from its March low. While the ProShares S&P 500 Dividend Aristocrats ETF (NOBL) has underperformed the S&P 500, some dividend-paying stocks outperformed the index based on their strong revenue model and efforts to capitalize on the pandemic. 7 Best ETFs for the NEXT Bull MarketAccenture plc (ACN), PLDT Inc. (PHI), and Virtu Financial, Inc. (VIRT) are three dividend-payers that delivered better returns than the S&P 500. Accenture plc (ACN) ACN is an Ireland-based company that provides management consulting, technology, and business process outsourcing services worldwide. The company’s segments include Communications, Media & Technology, Financial Services, Health & Public Service, Products, and Resources. ACN closed Friday’s trading session at $242.99, gaining more than 15% year-to-date. The stock has already gained more than 77% from its March lows, significantly outperforming the S&P 500’s 52% return over the same period. The stock has been uniformly paying dividends semi-annually for the past decade and has recently shifted to a quarterly payout system. The most recent quarterly dividend declared by the company was $0.8 for its fiscal third quarter ended in May 2020. The annual dividend for the company cumulates to $3.2, translating into a yield of 1.35%. ACN generated a free cash flow of $2.6 million in its last reported quarter, registering a 31% growth from the comparable quarter last year. The cash dividend payouts totaled $509 million for the quarter. While the company reported a top-line of $11 billion, EPS for the quarter came in $1.9, beating the consensus estimate by 2.7%. With the growing need for cloud-based applications and software, the street expects ACN’s EPS to grow 6% next year. The recent acquisition of CreativeDrive, a tech-driven content production company, is expected to boost ACN’s content, digital-marketing, and commercial-service offerings. Another recent buyout of Organize Cloud Lab has helped the company’s user-experience consultancy services to expand. Additionally, the company repurchased 3.7 million shares worth $627 million in the previous quarter. How does ACN stack up for the POWR Ratings? A for Trade Grade A for Buy & Hold Grade A for Peer Grade A for Industry Rank A for Overall POWR Rating. You can’t ask for better. It is ranked #1 out of 14 stocks in the Outstanding – Tech Services industry. PLDT Inc. (PHI) PHI operates as a telecommunications company in the Philippines and deals in three segments – Wireless, Fixed Line, and Others. The company offers cellular mobile, Internet broadband distribution, operations support, software development, and satellite information and messaging services PHI closed Friday’s trading session at $29.71, gaining more than 48% year-to-date. The stock has already recovered more than 86% from its March lows, measurably beating the S&P 500. The stock has been consistently paying semi-annual dividends since 2006. The most recently announced dividend for the company amounts to $0.774. The dividend has grown 11.7% over the past year, cumulating to an annual dividend of $1.04 and translating to a yield of 3.5%. The company grew its revenue by 7.3% year-over-year in the last reported quarter to $866.3 million. The Consumer Wireless Individual Business Group continued to set the pace, growing 16% versus a year-ago quarter on the back of continued strong growth of wireless data usage. The payment volumes of its online payment platform PayMaya also surged sharply during the quarter, leaning consumers towards a cashless economy. EPS for the quarter came in $0.59, improving 18% year-over-year. The company announced the availability of the 5G mobile phone network of Smart Communications for commercial services last month. Through partnerships with device manufacturers, Smart will also launch its initial lineup of Smart 5G-certified devices from Huawei, Samsung, RealMe, and Vivo. Furthermore, the company has issued $600 million worth dual-tranche long-term senior notes to improve its liquidity. It’s no surprise that PHI is rated a “Strong Buy” in our POWR Ratings system. It also has an “A” for Trade Grade, Buy & Hold Grade and Peer Grade, and a “B” for Industry Rank. It is ranked #4 out of 35 stocks in the Telecom – Foreign industry. Virtu Financial, Inc. (VIRT) VIRT leverages cutting-edge technology to deliver market making and liquidity services through its proprietary, multi-asset, and multi-currency technology platform to the financial markets worldwide. It primarily operates through two segments – Market Making and Execution Services. VIRT closed Friday’s trading session at $24.9, gaining more than 55% year-to-date. The stock has gained more than 66% from its 52-week low, comfortably beating the S&P 500. The stock has been uniformly paying a fixed amount of quarterly dividends since 2015. The company declared a dividend of $0.24 for its second quarter ending June. The annual dividend for the company cumulates to $0.96, translating into a yield of 3.86%. VIRT generated a free cash flow of $705 million in its last reported quarter, compared to negative cash flow of $182 million in the year-ago quarter. The cash dividend payouts totaled $30.2 million. The top-line grew 141% year-over-year to $11 billion primarily because of the higher trading volumes across global asset classes and sustained levels of retail engagement. EPS for the quarter came in $1.73, beating the consensus estimate by 8.1%. The street expects VIRT’s EPS to grow 461.5% in the current year. VIRT’s Frontier execution algorithms took the top-ranking position amongst 31 other algo providers in The TRADE’s 2020 Algorithmic Trading Survey of Hedge Funds. The company has recently expanded its analytics platform by offering Transaction Cost Analytics (TCA) for FX Algos. Moreover, the company has prepaid a $100 million worth term loan that was due in 2026. VIRT’s POWR Ratings reflect a promising outlook. It has an overall rating of “Strong Buy” with an “A” for Trade Grade and Peer Grade, and a “B” in Buy & Hold Grade and Industry Rank. Among the 27 stocks in the Investment Brokerage industry, it’s ranked #3. Want More Great Investing Ideas? 7 Best ETFs for the NEXT Bull Market Why Stocks Could Drop 20% in September? 9 “BUY THE DIP” Growth Stocks for 2020 ACN shares fell $0.48 (-0.20%) in after-hours trading Monday. Year-to-date, ACN has gained 15.32%, versus a 9.65% rise in the benchmark S&P 500 index during the same period."}]}