{"article": [{"url": "https://stocknews.com/news/irm-viac-nyt-3-of-the-most-shorted-stocks-today-paying-dividends/", "published": 1601986100.0, "headline": "3 of the Most Shorted Stocks Today Paying Dividends", "body": "Short selling is a trading strategy to bet that a stock price will fall. However, if many traders all short the same stock and the trade turns against them, they can get caught in a money-losing short squeeze. For high-yield stocks, selling short is often a bet on a dividend cut. When that doesn’t happen, the shorts can, well, take it in the shorts. But if you know where to look, you can make significant gains by going long on stocks with high short interest. A short squeeze occurs when traders shorting a stock all jump in to buy back shares before the price moves even higher. That buying frenzy actually drives the share price up, multiplying the short seller 7 \"SAFE HAVEN\" Dividend Stocks for Turbulent TimesFor dividend-paying stocks with high short interest, two events could trigger a short squeeze. One is what happened with Bed Bath & Beyond: a positive earnings report when traders were expecting the opposite. A dividend announcement or ex-dividend date may also trigger buying by short-sellers. A trader who is short a stock on the ex-dividend date must pay the dividend on the borrowed shares out of their own pocket. Here are three more dividend-paying stocks with high short interest. The trade here is to go long on the shares to profit from a potential short squeeze. Iron Mountain Inc. (IRM) Iron Mountain Inc. (IRM) is a real estate investment trust (REIT) that provides document storage services. I’ve researched and written about this stock for my Dividend Hunter Insiders. With it’s 9.2% yield and 10 straight years of dividend increases it gets a lot of attention from income investors and generates quite a few emails from my readers. Financial data publishers show a 20.3% of the float short interest for Iron Mountain. The company will declare 2020 third-quarter earnings and its next dividend payment around the end of October. The Iron Mountain business should be recession-resistant, destroying short-sellers’ hopes. IRM currently yields 9.2%. ViacomCBS Inc. (VIAC) ViacomCBS Inc. (VIAC) short interest totals 19% of the total share float. It seems that short sellers are betting that COVID-19 infections could shut down NFL games, hurting a significant revenue source for CBS. ViacomCBS reported solid, above-expectation earnings in August. The company will report third-quarter results in mid-November. VIAC yields 3.5% and again goes ex-dividend at the end of December. The New York Times Company (NYT) The New York Times Company (NYT) is a top-10 shorted stock with 15.5% of the float reported sold short. The short thesis is that declining advertising revenue will hurt profits. The short danger is that a good earnings report could trigger a short squeeze. This stock may be a case where the shorts are right, but the short interest is too high, making the trade more dangerous. The next earnings release will be in early November. The New York Times Company pays a small quarterly dividend and yields 0.55%. Want More Great Investing Ideas? Top Dividend Stock to Own! Download Free Report Today Buy These 3 High-Yield Dividend Stocks All Under $15 Buy and Hold These 3 Dividend Stocks Forever IRM shares were unchanged in after-hours trading Tuesday. Year-to-date, IRM has declined -9.04%, versus a 5.55% rise in the benchmark S&P 500 index during the same period."}]}