{"article": [{"url": "https://stocknews.com/news/arna-fate-kura-stok-4-biotech-stocks-showing-strength-during-the-market-selloff-in/", "published": 1601381300.0, "headline": "4 Biotech Stocks Showing Strength During the Market Selloff in September", "body": "The biotech sector has received a lot of attention and hype lately thanks to the COVID-19 pandemic. The outbreak has highlighted the importance of science and technology in advancing the course of treating ailments. As a result, a large number of biotech, pharmaceutical, and medical technology stocks have done well so far this year. Consequently, short sellers came in to reap the rewards, but one area that they’re backing off from is biotech. The Managing Director of S3 Analytics’, Ihor Dusaniwsky, has recently highlighted in a report that, “Shorts may be exiting their positions as COVID-19 vaccines and antivirals are getting closer to fruition.” This indicates that short sellers may believe a vaccine is closer at hand. However, apart from working on COVID related issues, the industry has revolutionized treatment of several diseases through the integration of technology. As a result, the industry consistently outperformed the S&P 500. The SPDR Series Trust SPDR S&P Biotech ETF (XBI) has gained 16.8% so far this year compared to the broader market’s 3.7% return over the same period. 7 Best ETFs for the NEXT Bull MarketHere are four biotech stocks that have survived that market sell-off and are well poised to grow further, even without any coronavirus-related development: Arena Pharmaceuticals, Inc. (ARNA), Fate Therapeutics, Inc. (FATE), Kura Oncology, Inc. (KURA), and Stoke Therapeutics, Inc. (STOK). Arena Pharmaceuticals, Inc. (ARNA) ARNA focuses on providing novel medicines with pharmacology and pharmacokinetics to patients worldwide. The company has recently announced that it has dosed the first patient in a phase II study to evaluate its key pipeline candidate, Etrasimod, as a potential treatment for moderate-to-severe alopecia areata. The study will evaluate 2mg dose of the candidate for efficacy and safety over 24 weeks. Apart from alopecia areata, ARNA is also working on Etrasimod ELEVATE UC 52 phase 3 trial in ulcerative colitis (UC), the late-stage development being on track. Moreover, its ELEVATE UC 12 phase 3 trial is expected to initiate anytime soon. The company also reported that its Advise phase 2b clinical study evaluating etrasimod, in treating atopic dermatitis, has completed enrollment. Data from the study is expected later this year. Another phase 2b study of the investigational drug in treating Crohn’s disease is ongoing. Revenues for the second quarter were zero compared to $1 million in the year-ago quarter. Research and development (R&D) expenses for the quarter totaled $64.9 million compared to $51.2 million in the same period last year. This increase was primarily due to the advancing clinical studies, including the etrasimod Phase 3 program. ARNA closed yesterday’s trading session at $75.83, after hitting an all-time high of $76.11. The stock has gained huge momentum over the last six months and is up nearly 67% so far this year. How does ARNA stack up for the POWR Ratings? A for Trade Grade A for Buy & Hold Grade A for Peer Grade A for Overall POWR Rating You can’t ask for better. The stock is also ranked #11 out of 376 stocks in the Biotech industry. Fate Therapeutics, Inc. (FATE) FATE is a clinical-stage biopharmaceutical company that develops programmed cellular immunotherapies for cancer and immune disorders worldwide. The company’s proprietary induced pluripotent stem cell (iPSC) product platform enables mass production of off-the-shelf, engineered, homogeneous cell products. Early clinical data from FATE’s FT596 program are very encouraging, as the company observed a partial response in a heavily-pretreated patient with refractory diffuse large B-cell lymphoma at the first dose level without any reported events of cytokine release syndrome, neurotoxicity or graft-versus-host disease. Additionally, FATE initiated enrollment with FT596 in combination with Rituximab for B-cell Lymphoma. In the beginning of second quarter, the company announced that the FDA has cleared the Investigational New Drug (IND) applications for FT538, the first-ever CRISPR-edited iPSC-derived cell therapy, and for FT819, the first-ever iPSC-derived CAR T-cell therapy. This indicated the continued demonstration of FATE’s unique ability to rapidly bring multiplexed engineered, off-the-shelf NK cell and T-cell cancer immunotherapies to patients. Revenue for the last reported quarter was $5.5 million, up 96% year-over-year. This increase was derived from the company’s collaborations with Janssen and Ono Pharmaceutical. Research and development expenses were $26.7 million, up 23% compared to the year-ago quarter. FATE ended the quarter with $533 million in cash & short-term investments. Apart from completing a follow-on public offering worth $201 million during the quarter, JJDC Inc., the investment arm of Johnson & Johnson (JNJ), purchased an additional 1.8 million newly-issued shares of the FATE’s common stock worth $51 million in a private placement. FATE closed yesterday’s trading session at $40.50, after hitting an all-time high of $40.52. The stock has gained huge momentum and is up nearly 107% so far this year. FATE’s POWR Ratings reflect a promising outlook. It has an overall rating of “Strong Buy” with an “A” for Trade Grade, Buy & Hold Grade, and Peer Grade. Among the 376 stocks in the Biotech industry, it’s ranked #12. Kura Oncology, Inc. (KURA) KURA is a clinical-stage biopharmaceutical company focused on the discovery and development of precision medicines for the treatment of solid tumors and blood cancers. The company’s pipeline consists of two wholly owned small molecule drug candidates that target cancer signaling pathways where there is a strong scientific and clinical rationale. KURA implemented a number of strategic measures in the second quarter to focus on its two major development pillars – tipifarnib in HRAS-dependent head and neck squamous cell carcinoma (HNSCC) and KO-539 in acute myeloid leukemia (AML). The company’s lead product candidate is Tipifarnib, an orally bioavailable inhibitor of farnesyl transferase, is in Phase II clinical trials for the treatment of solid tumors, peripheral T-cell lymphomas, and other hematologic malignancies. It is also developing KO-539, a potent and small molecule inhibitor of the menin-mixed lineage leukemia protein-protein interaction. A Phase 1/2A clinical trial in patients with relapsed/refractory AML (KOMET-001) continues in dose escalation. KURA remains focused on its goal of reaching a recommended Phase II dose. Moreover, KURA is also working on KO-947, a small molecule inhibitor of extracellular signal related kinase used for the treatment of patients with tumors. KURA has not started generating revenues yet. The research and development expenses for the second quarter were $13.7 million, compared to $11.4 million in the year-ago quarter. The company reported a loss of $0.4 per share, slightly improving from the quarter-ago loss of $0.42. However, KURA has $339 million in cash and cash equivalents that the management believes is sufficient to fund operations until 2023. KURA closed yesterday’s trading session at $30.07 after hitting an all-time high of $30.49. The stock has gained huge momentum over the past six months and is up more than 118% so far this year. It’s no surprise that KURA is rated a “Strong Buy” in our POWR Ratings system, with a grade of “A” in Trade Grade, Buy & Hold Grade, and Peer Grade. It is also ranked #14 out of 376 stocks in the Biotech industry. Stoke Therapeutics, Inc. (STOK) STOK is an early-stage biopharmaceutical company that develops novel antisense oligonucleotide medicines to treat the underlying causes of severe genetic diseases. The firm’s primary focus is to increase gene expression to treat genetic conditions affecting the central nervous system, eye, ear, kidney, and liver. The company published the preclinical data from studies of STK-001 in August that demonstrated significant improvements in survival and reductions in seizure frequency in a mouse model of Dravet syndrome. The report also showed that STK-001 achieved target engagement, pharmacologic activity and efficacy by selectively increasing Scn1a gene and Nav1.1 protein expression. Part A of the study is designed to evaluate two dose cohorts of STK-001. However, the FDA has placed a partial clinical hold on Part B of the study, which is designed to evaluate higher doses. STOK is also on track to identify an additional preclinical candidate derived from its TANGO platform for the treatment of an additional genetic disease in the coming quarters. In June, the company presented additional data on the use of STOK’s TANGO technology to address OPA1 protein deficiency, the primary cause of autosomal dominant optic atrophy (ADOA), which is the most common inherited optic nerve disorder. STOK has not started generating revenues yet. The research and development expenses for the second quarter were $8 million, up 33% year-over-year. The company reported a loss of $0.39 per share, significantly improving from the year-ago loss of $1.54 per share. However, STOK has $202.1 million in cash and cash equivalents that the management expects to be sufficient to fund operations until 2023. STOK closed yesterday’s trading session at $34.93, gaining more than 23% year-to-date. Additionally, the stock is presently trading 7.8% below its all-time high of $37.88. According to our POWR Ratings, STOK is a “Buy.” It also has a grade of “A” in Trade Grade and Peer Grade, and a “B” in Buy & Hold Grade. In the 376-stock Biotech industry, it is ranked #33. Want More Great Investing Ideas? 7 “Safe-Haven” Dividend Stocks for Turbulent Times When Does the Next Bull Run Start? Chart of the Day- See the Stocks Ready to Breakout ARNA shares were trading at $75.73 per share on Tuesday afternoon, down $0.10 (-0.13%). Year-to-date, ARNA has gained 66.73%, versus a 5.01% rise in the benchmark S&P 500 index during the same period."}]}