{"article": [{"url": "https://stocknews.com/news/gld-agg-lqd-tip-4-etfs-to-protect-your-portfolio-from-a-market-crash/", "published": 1601554100.0, "headline": "4 ETFs to Protect Your Portfolio from a Market CRASH", "body": "The year 2020 has been extremely volatile so far for the stock market. From the Covid-19 crisis to the September sell off, investors are apprehensive regarding the future performance of even blue-chip companies. The current sluggish economy and uncertainty related to the upcoming presidential election have added to this increasing precariousness. Many analysts have also expressed fears regarding the development of a budding asset bubble over the past few months similar to the dot-com bubble. Also, many countries have shown inclination towards potential de-globalization, which casts a shadow over the future of multinational companies. All these factors combined have sparked fears of a potential market crash in the upcoming months. Precious metals and government issued bonds have gained traction amid the sparking fears, primarily because of their safety features. However, direct investment in these instruments can be taxing, as storing precious metals often becomes challenging, while government bonds have to be resold over the counter, making them relatively illiquid. ETFs such as the SPDR Gold Trust ETF (GLD), iShares Core U.S. Aggregate Bond ETF (AGG), iShares iBoxx $ Investment Grade Corporate Bond ETF (LQD), and the iShares TIPS Bond ETF (TIP) give investors the requisite exposure to these minimum-risk securities without any hassles. You may easily diversify your portfolio and hedge your investment risk by investing in these ETFs. 9 \"BUY THE DIP\" Growth Stocks For 2020SPDR Gold Trust ETF (GLD) GLD invests in physical gold bullions, which are stored in vaults. Issued by State Street Global Advisors, GLD closely tracks the LMBA Gold PM Price index. As it invests 100% of its assets in gold, GLD’s NAV moves in lockstep with the prevailing gold prices. It currently has $76.83 billion in assets under management (AUM). GLD’s expense ratio of 0.4% compares to the category average of 0.45%. The ETF has gained 24% year-to-date, and 15.8% over the past six months. GLD has gained more than 40% since hitting its 52-week low of $136.12 in March. The ETF hit its 52-week high of $194.45 in August. How does GLD stock up for the POWR Ratings? B for Trade Grade B for Buy & Hold Grade A for Peer Grade B for Overall POWR Rating. It is also ranked #1 out of 35 ETFs in the Precious Metals ETFs group. iShares Core U.S. Aggregate Bond ETF (AGG) AGG invests in investment grade US treasury bonds. It is a passively managed ETF that tracks the Bloomberg Barclays U.S. Aggregate Bond Index, and has an AUM of $80.92 billion. Its major holdings include bonds issued by the Federal National Mortgage Association, United States Treasury, and Government National Mortgage Association. AGG has an expenses ratio of 0.05% versus the category average of 0.42%. The fund has returned 5.1% year-to-date, and 2.1% over the past six months. It pays an annual dividend of $2.75, which yields 2.3%. Its dividend has grown at a CAGR of 5.5% over the past three years. AGG gained more than 10% to hit its 52-week high of $119.73 in August since hitting its 52-week low of $105.56 in March. AGG is rated a “Strong Buy” in our POWR Ratings system, with an “A” for Trade grade, Buy & Hold Grade, and Industry Rank. In the 46-ETF Intermediate-Term Bond ETFs group, AGG is ranked #1. iShares iBoxx $ Investment grade Corporate Bond (LQD) LQD primarily invests in long term investment grade corporate bonds having at least three years to maturity. It seeks to replicate the returns of its underlying index, the Markit iBoxx USD Liquid Investment Grade Index. LQD has an AUM of $55.31 million. LQD’s expense ratio of 0.15% is slightly lower than the category average of 0.19%. It has gained 5.3% year-to-date, and 8.7% over the past six months. The ETF currently pays an annual dividend of $3.90, which yields 2.9%. Its dividend grew at a CAGR of 2.4% over the past three years. LQD has gained more than 30% since hitting its 52-week low of $104.95 in march. The ETF hit its 52-week high of $139.38 in August. It’s no surprise that LQD is rated a “Strong Buy” in our POWR Ratings system, with a grade of “A” in Trade Grade, Buy & Hold Grade, and Industry Rank. It is also ranked #1 out of 81 ETFs in the Corporate Bonds ETFs group. iShares TIPS Bond ETF (TIP) TIP invests in inflation-hedged US treasury bonds with at least one year to maturity. It is a very liquid security, ideal for both medium- and long-term investments. With an AUM of $24.12 million, it closely tracks the Bloomberg Barclays U.S. Treasury Inflation Protected Securities Index. TIP has an expense ratio of 0.19% versus the category average of 0.22%. It returned 8.5% year-to-date, and 6.9% over the last six months. TIP pays an annual dividend of $1.03, yielding 0.81% on the current price. Moreover, its dividend increased at a CAGR of 7% over the last three years. TIP has gained more than 15% since hitting its 52-week low of $107.37 in March. The ETF hit its 52-week high of $127.28 in September. TIP is rated “Strong Buy” in our POWR Ratings system, with an “A” for Trade Grade, Buy & Hold Grade, and Industry Rank, and a “B” for Peer Grade. In the 18-ETF Inflation-Protected Bond ETFs group, TIP is ranked #1. Want More Great Investing Ideas? Do NOT Buy Stocks Before the Election! 7 “Safe-Haven” Dividend Stocks for Turbulent Times Chart of the Day- See Christian Tharp’s Stocks Ready to Breakout GLD shares were trading at $178.86 per share on Thursday afternoon, up $1.74 (+0.98%). Year-to-date, GLD has gained 25.16%, versus a 5.65% rise in the benchmark S&P 500 index during the same period."}]}