{"article": [{"url": "https://stocknews.com/news/iipr-oled-five-whr-4-solid-mid-cap-stocks-to-add-to-your-portfolio/", "published": 1594814900.0, "headline": "4 SOLID Mid-Cap Stocks to Add to Your Portfolio", "body": "Mid-cap stocks are companies worth between $2 billion and $10 billion. They offer a blend of small-cap growth potential and the financial stability of large-caps. Typically, small caps outperform during periods of accelerating economic growth, while large-caps do better during periods of slow growth and falling interest rates. Mid-caps also outperform when growth is accelerating, but they are more resilient when conditions deteriorate due to their larger size and stronger balance sheets. Whirlpool (WHR), Universal Display (OLED), Five Below (FIVE), and Innovative Industrial Properties Inc. (IIPR) are four mid-cap stocks worthy of your attention. Here’s why: Whirlpool (WHR) 9 \"BUY THE DIP\" Growth Stocks For 2020No matter how bad the economy gets, people will still need household appliances. Refrigerators, dishwashers, microwaves, and washing machines are essential to a halfway decent quality of life. WHR sells each of these appliances. Though WHR sales are declining in markets outside of the United States, the losses will be partially offset by the decrease in the cost of the raw materials necessary to manufacture appliances. Additionally, recent strength in the US housing market is a good leading indicator that appliance sales will increase. When people buy a home, they tend to buy new appliances. 2020 might end up as a down year for WHR given the disruption from the coronavirus yet the company should remain profitable. It’s also likely to maintain its dividend payout of 4.63%. The POWR Ratings show WHR is solid in all regards. WHR has an A Trade Grade and Industry Rank Grade. The remainder of WHR’s POWR Components is graded as Bs. The stock is ranked in the top 15 of 66 Home Improvement & Goods providers. Universal Display (OLED) People also tend to buy new TVs when they get a new home as well. Additionally, the composition of discretionary spending has changed, since many activities are no longer an option. Instead, people are choosing to upgrade their homes, and the items they use daily. Additionally, another round of stimulus checks is likely to go out later this year. For these reasons, the appetite for new TVs will be quite strong in the years ahead, helping the likes of OLED. The company has patents on ultra-high-definition OLED technology. The company also sells the materials necessary to make such screens. OLED management withdrew financial guidance for the remainder of the year yet its long-term prospects are still the same. OLED has plenty of room for growth because it has less than 10% of the worldwide display market. The POWR Ratings reveal OLED has an A industry rank, solid Peer Grades, and Buy & Hold Grades. OLED is ranked in the top half of 28 stocks in the Technology – Hardware space. The stock has an average analyst price target over $164 which is 7% above current prices. Five Below (FIVE) Discount retailers are raking in the cash now that the economy is stuck in a deep trough. FIVE has nearly 1,000 discount stores throughout the United States. FIVE reopened nearly all of these stores after closures stemming from the coronavirus in the first quarter. Comparable sales at the reopened stores are up nearly 10% on a year-over-year basis, indicating there is strong demand for the company’s offerings. FIVE is set to open 120 new stores this year alone. It is interesting to note that half of FIVE’s comparable sales increases stem from e-commerce. The company bought the e-commerce platform Hollar.com this past January. As e-commerce sales continue to make up a larger part of FIVE’s sales, the company will prove more capable of pivoting to the web should a second wave of the virus close its brick-and-mortar stores once again. Take a look at FIVE’s POWR Ratings and you will find the company has a B Industry Rank as well as a respectable Peer Grade and Buy & Hold Grade. FIVE is ranked in the top 10 of 33 Specialty Retailers. Innovative Industrial Properties Inc. (IIPR) There are plenty of players in the cannabis growing space, many of which will cannibalize one another in the years ahead. The safe money appears to be in leasing grow spaces to the growers. This is exactly what IIPR does. IIPR leases industrial properties to cannabis growers, ensuring a steady revenue stream that is likely to increase as cannabis continues to gain mainstream acceptance. IIPR has the best business model in the cannabis space, as it doesn’t have to deal with worry about fluctuations in the price of the crop. It merely rents property and equipment to companies in a growing industry. And, it’s easy to imagine that IIPR can upsell more products and services once their tenants become more mature. In a sense, it can become like the Shopify (SHOP) of the industry which helps companies start selling online and then offers them more premium marketing and financial services. IIPR has an anticipated earnings growth rate of nearly 65% for 2020. The POWR Ratings show IIPR has solid Trade and Buy & Hold grades and Wall St. analysts have an average price target of $113 for the stock. Want More Great Investing Ideas? 9 “BUY THE DIP” Growth Stocks for 2020 Top 5 WINNING Stock Chart Patterns 7 “Safe-Haven” Dividend Stocks for Turbulent Times IIPR shares were trading at $93.62 per share on Wednesday afternoon, up $2.12 (+2.32%). Year-to-date, IIPR has gained 26.44%, versus a 1.06% rise in the benchmark S&P 500 index during the same period."}]}