{"article": [{"url": "https://stocknews.com/news/lulu-nke-nike-vs-lululemon-which-stock-is-a-better-buy/", "published": 1601381300.0, "headline": "Nike vs. lululemon: Which Stock is a Better Buy?", "body": "Nike, Inc. (NKE) is the biggest and most valuable sports apparel manufacturer in the world, with a 25.1% global apparel market share in the April-June quarter. Its brand value was $34.8 billion as of January 1st, 2020. Lululemon Athletica, Inc. (LULU) on the other hand, is a prominent competitor of NKE, with a brand value of $9.67 billion. LULU is a leading sports apparel brand in Canada, and is currently ranked 4th most valuable company in the world in terms of brand value. Both the stocks have generated significant returns over the past five years. While NKE returned 103.6% over this period, LULU gained 532.8%. In terms of year-to-date performance as well, LULU is the clear winner with 37.6% returns versus NKE’s 22.7%. But which of these stocks is a better buy now? Let’s find out. Recent Updates 9 \"BUY THE DIP\" Growth Stocks For 2020On July 22nd, NKE announced several leadership changes to make the brand digitally empowered and support its Consumer Direct Acceleration (CDA) strategy. With digital sales becoming immensely popular in the current economic scenario, this move can help NKE branch out to untapped markets. LULU acquired a home fitness company named Mirror to provide a live interactive workout platform to its customers. This $500 million acquisition is a part of LULU’s Power of Three growth plan. It also resumed its share buyback program, which was previously halted due to the pandemic. The company is also planning on manufacturing footwear, as part of its omnichannel expansion program, which is expected to boost its profits in the upcoming months. Recent Financial Results NKE’s robust recovery as a result of its accelerating brand momentum and digital sales since the beginning of the pandemic was reflected in its fiscal first quarter (ended August 2020) results. Its direct sales improved 12% year-over-year to $10.60 billion, and brand digital sales increased 82% from the same period last year. EPS increased 10% from the year-ago value to $0.95. Its inventory increased 15% from the year-ago value to $6.70 billion. LULU reported a 2% year-over-year increase in its net revenue to $903 million in the second quarter ended June 2020. Direct-to-customer revenue increased 155% from the same period last year to $554.30 million. Gross profit increased 1% from the year-ago value to $485.90 million. Inventory increased 36% year-over-year to $672.80 million at the end of the quarter. Hence, NKE is in an advantageous position here. Past and Expected Financial Performance NKE’s revenue grew at a CAGR of 2.8% over the past 3 years, but the CAGR for its EPS over the same time period was negative 10.4%. The market expects the company’s revenue to increase 12.2% in the current year and 11.3% next year. NKE’s EPS is expected to grow 78.1% in the current year and 28.8% next year. Moreover, its EPS is expected to grow at a rate of 25.1% per annum over the next five years. On the other hand, LULU’s revenue and EPS grew at a CAGR of 16.7% and 25.8%, respectively, over the past 3 years. The CAGR of the company’s free cash flow has been 14.7%. The market expects LULU’s revenue to increase 4% in the current year and 26.7% next year. The company’s EPS is expected to grow 53.3% next year. Moreover, LULU’s EPS is expected to grow at a rate of 15.2% per annum over the next five years. In terms of expected growth is revenue and EPS, NKE has an edge over LULU. Profitability NKE’s trailing 12-month revenue is more than 9.6 times of what LULU generates. However, LULU is more profitable with a gross margin of 55.3% versus NKE’s 43.2%. Also, LULU’s ROE and ROA of 30.8% and 15.4% compare favorably with NKE’s 29.2% and 7%, respectively. Valuation In terms of forward P/E, LULU is currently trading at 76.32x, 75.4% more expensive than NKE which is currently trading at 43.50x. LULU is also more expensive in terms of trailing-12-month P/S (10.73x versus NKE’s 5.19x). It’s forward PEG of 3.73x is 37.6% higher than NKE’s 2.71x. However, in terms of trailing-12-month price/cash, NKE’s 78.04x is 27.6% higher than LULU’s 61.14x. Hence, NKE is relatively less expensive with a higher earnings growth potential. POWR Ratings While NKE is rated “strong Buy” under our proprietary POWR Ratings system, LULU is rated “Neutral”. Here’s how the four components of overall POWR Rating are graded for both NKE and LULU: NKE has an “A” for Trade grade, Buy & Hold Grade and Peer grade, and “B” for Industry Rank. It is also ranked #1 out of 33 stocks in the Athletics & Recreation Industry. LULU has a “B” for Industry Rank, and “C” for Trade Grade, Buy & Hold Grade and Peer Grade. In the 65-stock Fashion & Luxury industry, LULU is currently ranked #16. The Winner Though both the companies are major players in the sports apparel industry and their stocks have the potential to soar in the near future, NKE is clearly the better buy based on the factors discussed here. NKE’s impressive past performance, favorable future growth estimates, and lower valuation makes it an attractive investment option now. Want More Great Investing Ideas? 7 “Safe-Haven” Dividend Stocks for Turbulent Times When Does the Next Bull Run Start? Chart of the Day- See the Stocks Ready to Breakout LULU shares were unchanged in after-hours trading Tuesday. Year-to-date, LULU has gained 39.71%, versus a 4.75% rise in the benchmark S&P 500 index during the same period."}]}