{"article": [{"url": "https://stocknews.com/news/ccl-cuk-lind-rcl-nclh-is-now-a-good-time-to-buy-shares-of-carnival/", "published": 1601035700.0, "headline": "Is Now a Good Time to Buy Shares of Carnival Corp.?", "body": "Carnival Corporation & Plc (CCL) is primarily a cruise operator. With a fleet of over 100 ships, it visits approximately 700 ports worldwide under various brand names. It also provides vacations to various cruise destinations, as well as owning and operating hotels, lodges, glass-domed railcars, and motor coaches. CCL is one of the worst-performing stocks of 2020, with income consistently declining because of the pandemic. In the third quarter ended August 2020, CCL’s earnings fell 200% year-over-year. A total of 18 less efficient ships have left the fleet during the quarter. CCL’s portfolio includes many regional brands, causing the company’s operations to cease across different regions. With travel restrictions amid the rising coronavirus cases, the company is struggling to resume operations. The quarterly performance and the potential downside based on several factors have made our proprietary system to rate CCL as a “Strong Sell.” 9 \"BUY THE DIP\" Growth Stocks For 2020Here is how our proprietary POWR Ratings system evaluates CCL: Trade Grade: F CCL is currently trading below its 50-day and 200-day moving averages of $15.45 and $24.04, respectively, indicating that the stock is in a downtrend. The stock’s 13% loss over the past three months reflects a short-term bearishness. CCL has recently confirmed an extension to its pause in operations of P&O Cruises, with all sailings canceled until early 2021. However, the company completed its first seven-day cruise on the Italian brand Costa. Soon a second of its nine cruise brands will resume guest operations. CCL had $8.2 billion in cash and equivalents on its balance sheet at the end of August. The company is improving its monthly cash-burn rate. From $770 million in the fiscal third quarter, CCL projects an average $530 million monthly hole in the current quarter. Buy & Hold Grade: F In terms of proximity to its 52-week high, which is a key factor that our Buy & Hold Grade takes into account, CCL is not well-positioned. The stock is currently trading 73.5% below its 52-week high of $51.94. Looking at the past three years, the stock has lost nearly 77% due to its impaired earnings, and change in consumer and business behavior. Moreover, there have been instances of insider trading at CCL starting from Weisenburger Randall J, one of the board members, who purchased 1,250,000 shares at the price of $8 back in April 2020. Band Sir Jonathon, the Director of CCL, sold 5,000 shares at $40.83 during a trade that took place back in October 2019. Peer Grade: D CCL is currently rated #3 out of 5 stocks in the Travel – Cruises industry. Other popular stocks in the group are Lindblad Expeditions Holdings Inc. (LIND), Royal Caribbean Cruises Ltd. (RCL), and Norwegian Cruise Line Holdings Ltd. (NCLH). CCL is down 72.7% year-to-date. The sector has been heavily bleeding as LIND, RCL and NCLH have also lost 49.1%, 54.6%, and 75%, respectively, over this period. Industry Rank: F The StockNews.com Travel – Cruises industry is ranked #113 out of the 123 industries. The companies in this industry operate deep-sea cruise ships and inland/coastal cruise ships. Demand for cruises is driven by consumer disposable income and vacation preferences, and the industry has not been performing well amid the health crisis. Overall POWR Rating: F (Strong Sell) Overall, CCL is rated a “Strong Sell” due to its declining business, short-and-long-term bearishness, and weak price momentum, as determined by the four components of our overall POWR Rating. Bottom Line CCL’s fundamentals have massively deteriorated. The business is sitting on massive liabilities. The company has already completed the follow-on public offering of its common stock and the only remedy is laying-off more workers and/or selling ships. Additionally, CCL has to invest in refitting ships to drive digitization and shift to touchless travel, and improve cleaning standards, along with working with health experts on developing testing capabilities. Analyst sentiment, which gives a good sense of a stock’s future price movement, is not favorable for CCL. 6 out of 19 Wall Street analysts have rated the stock as either “Strong Sell” of “Sell.” The market expects revenues for the fourth quarter ending November 2020 to decline 92% year-over-year. The consensus EPS estimate for the ongoing year indicates a 266.6% fall from the year-ago value. This outlook should keep CCL’s price momentum sluggish in the near term. Want More Great Investing Ideas? 7 Best ETFs for the NEXT Bull Market Is the Stock Market Correction Over? Chart of the Day- See the Stocks Ready to Breakout CCL shares were trading at $14.99 per share on Friday afternoon, up $1.25 (+9.10%). Year-to-date, CCL has declined -70.17%, versus a 3.46% rise in the benchmark S&P 500 index during the same period."}]}