{"article": [{"url": "https://stocknews.com/news/hyg-pgf-ushy-pgx-4-strong-buy-etfs-with-yields-over-5/", "published": 1599653300.0, "headline": "4 “Strong Buy” ETFs With Yields Over 5%", "body": "The market is encountering its first significant bout of volatility since the March bottom. There’s increasing uncertainty with data showing the economy’s momentum is stalling and uncertainty with the upcoming election. Given these conditions, dividend-paying stocks are one interesting option, because they would outperform in a bear market. Additionally, they are attractive on a valuation level as the spreads between yields and treasuries are close to a historical extreme. 9 \"BUY THE DIP\" Growth Stocks For 2020However, the pandemic has caused many dividend-paying companies to cut their dividends. In the second quarter of 2020, the number of stocks cutting dividends increased by 931% year-over-year to 639. While many stocks will maintain their dividend payments, if your goal is to ensure a dividend income, you may explore some ETFs that offer high dividend yields. ETFs are composed of a basket of stocks so there’s much less risk. The iShares Broad USD High Yield Corporate Bond ETF (USHY), Invesco Financial Preferred ETF (PGF), iShares iBoxx $ High Yield Corporate Bond ETF (HYG), and Invesco Preferred ETF (PGX) are four ETFs paying above-average yields. iShares Broad USD High Yield Corporate Bond ETF (USHY) USHY’s goal is to track the investment results of ICE BofA US High Yield Constrained Index which is composed of U.S. dollar-denominated high yield corporate bonds. There may be a risk exposure attached to the corporate bonds in regions outside the U.S such as Japan, U.K., Canada, Australia, New Zealand, Switzerland, Norway, Sweden, and the eurozone. The fund is non-diversified and invests at least 90% of its assets in component securities of the index and up to 10% of its assets in futures, options and swap contracts, cash and cash equivalents, and securities outside the index. USHY can substantiate portfolios of investors focused on fixed incomes and solid performance. Some of its top holdings are BLK CSH FND TREASURY SL AGENCY, ALTICE FRANCE SA (FRANCE) 144A, SPRINT CORP, and TRANSDIGM INC 144A. USHY pays an annual dividend of $2.24 which yields 5.65%. The ETF has gained more than 20% since its March low. The fund has returned 8.6% over the past six months and 4.8% over the past three months. The expenses ratio for USHY of 0.15% is lower than its category average of 0.49%, which makes it a reasonable option to invest in. Moreover, the fund has $5.71 billion in Assets Under Management (AUM). How does USHY stack up for the POWR Ratings? A for Trade Grade A for Buy & Hold Grade A for Industry Rank A for Overall POWR Rating You can’t ask for better. The ETF is also ranked #4 out of 53 ETFs in the High Yield Bond ETFs group. Invesco Financial Preferred ETF (PGF) This ETF has an investment approach that corresponds to the Wells Fargo Hybrid and Preferred Securities Financial Index. It has preferred securities with either fixed or floating rate dividends issued by financial institutions that have a “financial” industrial sector classification from the Bloomberg Professional Service. The fund does not have a lot of diversification. PGF’s complete emphasis on financials gives investors a unique avenue to divert their investments. PGF pays an annual dividend of $0.94 which yields 5.02% and the fund has gained about 15% since its March low. The fund has returned 10.7% over the past six months and 5.6% over the past three months. Some of PGF’s top holdings are Wells Fargo & Co (WFC), JPMorgan Chase & Co (JPM), PNC Financial Services Group Inc. (PNC), and Bank of America Corp (BAC). The total number of holdings in the fund is 104. PGF’s expense ratio of 0.62% is slightly higher than its category average of 0.59% although its prospects do look positive due to the increasing need for finance and banking services once the economy recovers. The ETF has an AUM of $1.59 billion. It’s no surprise that PGF is rated a “Strong Buy” in our POWR Ratings system. It also has an “A” for Trade Grade, Buy & Hold Grade, and Industry Rank. In the 19-ETF Convertible Bond/Preferred Stock ETFs group, it is ranked #4. iShares iBoxx $ High Yield Corporate Bond ETF (HYG) This fund aims to mirror the results of an index composed of U.S. dollar-denominated, high yield liquid corporate bonds. HYG is a highly liquid ETF that monitors the junk bond market. The high returns are in place as a compensation for the high risk associated with the fund’s bonds. Although HYG does have international involvement, most of its assets are in the United States. HYG pays an annual dividend of $4.21 which yields almost 5%. Some of HYG’s top holdings are ALTICE FRANCE SA (FRANCE) 144A, SPRINT CORP, TRANSDIGM INC 144A, Centene Corp (CNC), and Ford Motor Company (F). HYG has also been performing pretty well. HYG has an AUM of $30.52 million and a NAV of $84.53. HYG has returned 7.7% over the past six months and 4.2% over the past three months. The fund’s expense ratio of 0.49% is the same as its category average. HYG’s portfolio includes a total of 1236 stocks. HYG has gained about 20% since its March lows. HYG is rated a “Strong Buy” in our POWR Ratings system, with a grade of “A” for Trade Grade, Buy & Hold Grade, and Industry Rank. It is also ranked #1 out of 53 ETFs in the High Yield Bond ETFs group. Invesco Preferred ETF (PGX) PGX follows the BofA Merrill Lynch Core Plus Fixed Rate Preferred Securities Index which tracks the performance of fixed-rate US dollar-denominated preferred securities issued in the US domestic market. Although PGX’s portfolio has less diversification and mostly deals with the financial sector, investing small amounts in this fund could accelerate gains. The holders of ‘preferred’ stock are preferred to other stockholders if the case of liquidation. PGX consists of a mix of traditional and foreign preferred securities. PGX pays an annual dividend of $0.76 which yields 5.15%. PGX has grown more than 15% since its March lows. PGX has 304 holdings in total and the fund has returned 11.3% over the six months and 5% over the past three months. Some of PGX’s major holdings are Citigroup Inc. (C), Wells Fargo & Co. (WFC), JPMorgan Chase & Co (JPM), PNC Financial Services Group Inc. (PNC), and Bank of America Corp (BAC). PGX has an AUM of $6.23 million. Furthermore, PGX’s expense ratio of 0.52% is lower than its category average of 0.59%, which makes the fund a reasonable investment in its category. PGX’s POWR Ratings reflect this promising outlook. It has an overall rating of “Strong Buy” with a grade of “A” in Trade Grade, Buy & Hold Grade, and Industry Rank. Among the 19 ETFs in the Convertible Bond/Preferred Stock ETFs group, it’s ranked #2. Want More Great Investing Ideas? 7 Best ETFs for the NEXT Bull Market Will Stocks Fall into Historical September Slump? 9 “BUY THE DIP” Growth Stocks for 2020 HYG shares were unchanged in after-hours trading Wednesday. Year-to-date, HYG has declined -0.34%, versus a 6.66% rise in the benchmark S&P 500 index during the same period."}]}