{"article": [{"url": "https://stocknews.com/news/tlry-kos-uber-3-worst-performing-robinhood-100-stocks-for-june/", "published": 1593518900.0, "headline": "3 Worst Performing Robinhood 100 Stocks for June", "body": "As June 2020 comes to a close, we look back and see that in the past month, the S&P 500 has been in a trading range between 3,002 and 3,232. This sideways action indicates indecision among traders. The bulls are betting that the economy’s rebound will continue, and if it falters, the Federal Reserve and the federal government will step up with another round of stimulus. 9 \"BUY THE DIP\" Growth Stocks For 2020And, the bears see a market that is overvalued by nearly every measure, exacerbated by an economy that is going to be running below full capacity for an extended period with the extraneous threat of more shutdowns and another wave of the coronavirus becoming more real. Despite the S&P 500’s (SPY) relatively tight range, underneath the surface, there has been much more volatility. Biotechnology stocks and electric vehicle stocks have been ripping higher, while marijuana and energy stocks have been selling off. This bifurcation is evident within the Robinhood 100, which is a list of the most popular stocks owned by investors that use the Robinhood app. Though many stocks on the list have seen impressive gains in the past 30 days, some have not. Here are the three worst-performing stocks on the Robinhood 100 for June: Tilray (TLRY) Cannabis stocks have been in a steady downtrend since October 2018. They’ve barely participated in the market’s big rebound over the past couple of months. This is despite the continued growth in the marijuana industry which is expected to be over a $100 billion market by 2027 from its current size of $16 billion this year. Many industries have seen overall growth, but the stocks have been poor investments like airlines and solar stocks. The same issues are plaguing cannabis. For one, it’s a commodity product, where it’s pretty cheap to produce after accounting for initial investment, so supply will always be plentiful which leads to falling profit margins over the long-term. Second, there are regulations which differ by states and countries and add to cost and complications. TLRY is down 29% in June. It’s stuck in a pattern of lower lows and lower highs. It’s also burning up cash – in the last quarter, it posted a net loss of $181 million. TLRY’s strategy for much of its existence has been to bet on growth through acquisitions and increasing production, however, it’s now suddenly shifting to cost-cutting. It’s also facing allegations of insider trading which decreases confidence in management. (source: finviz.com) The POWR Ratings for TLRY reflect these issues. It’s rated a “Sell” with an “F” in Trade Grade and Buy & Hold Grade. It has a “D” in Peer Grade and a “B” in Industry Rank. Kosmos Energy (KOS) KOS is a deepwater exploration and production company. It’s been devastated by the bear market in oil. It focuses on oil deposits in deep waters around the world. It IPO’d in 2011 when oil prices were over $100. Unfortunately, searching and drilling for oil in these parts of the world is only viable, when oil is above a certain price. Over the last few years, KOS has been hemorrhaging money. The outlook for oil looks tenuous especially as demand looks impaired with travel and industrial activity unlikely to return to full capacity anytime soon. Any increase in oil is dependent on production cuts which would not be sustained if the price does rebound. The POWR Ratings for KOS are consistent with these poor fundamentals and outlook. It is a “Strong Sell”. It has an “F” in Trade Grade and Buy & Hold Grade and a “D” in Industry Rank and Peer Grade. Uber (UBER) UBER had a strong recovery off the March lows, as traders were focusing on the marginal improvements in economic data and hoping that the economy would quickly return to its pre-coronavirus state. However, these hopes are being dashed as coronavirus case counts are increasing in many parts of the country. Interestingly, the most intense outbreaks are happening in places that reopened early. Further, many of the outbreaks are being traced to bars and restaurants. Already, high-frequency data showing restaurant traffic and credit card spending are flattening out in the most affected areas. The bull case for UBER has taken a massive hit. Without nightlife, activities, sports, concerts, or other events, a significant chunk of UBER’s revenue has disappeared. The coronavirus is also leading to a shift away from the “sharing” economy where people were not buying cars and using ride-sharing services. Instead, many people will opt to buy their vehicles for transportation rather than risk possible exposure. Uber’s POWR Ratings are also not encouraging. It’s rated a “Sell” and has a “D” in Buy & Hold Grade, Trade Grade, and Peer Grade. Want More Great Investing Ideas? 9 “BUY THE DIP” Growth Stocks for 2020 Is the Bull S#*t Rally FINALLY Over? 7 “Safe-Haven” Dividend Stocks for Turbulent Times Top 3 Investing Strategies for 2020 TLRY shares rose $0.05 (+0.70%) in after-hours trading Tuesday. Year-to-date, TLRY has declined -58.49%, versus a -3.21% rise in the benchmark S&P 500 index during the same period."}]}