{"article": [{"url": "https://stocknews.com/news/hd-amh-nvr-shw-4-stocks-to-play-the-red-hot-housing-market/", "published": 1597838900.0, "headline": "4 Stocks to Play the Red-Hot Housing Market", "body": "The coronavirus has been a massive catalyst for the housing market. According to the latest NAHB/Wells Fargo Housing Market Index (HMI), builder confidence in the market for newly-built single-family homes increased six points to 78 in August, bouncing to its highest level in 35 years. Low mortgage rates and low housing supply had been the primary drivers for the housing market boom over the past few years. However, the coronavirus has created an inflection point due to rising demand from people moving out of cities. Median single-family home prices have increased in 96% of markets across the country, with a 4.2% average price increase annually. Most home builders have also reported a shortage in inventory, owing to the robust sale of properties. 7 \"SAFE HAVEN\" Dividend Stocks for Turbulent TimesWith the increasing work-and-learn-from-home trend, the housing market should continue to gain in the upcoming years, as the demand for personal property may continue to rise. According to a LendingTree report, 53% of homebuyers are more likely to buy a home by 2021 due to the pandemic. Companies such as The Home Depot, Inc. (HD), American Homes 4 Rent (AMH), NVR, Inc. (NVR), and The Sherwin- Williams Company (SHW) operating in the housing sector are expected to ride the boom. The Home Depot, Inc. (HD) As one of the largest retailers of home improvement products in the United States, the company offers its products to both do-it-for-me customers and third-party installers. HD’s strong financial foundation and brand reputation allowed the stock to fare well even during the pandemic. It gained more than 100% to hit its 52-week high in August since hitting its 52-week low in March. To keep up with the rising demand for home improvement products amid lockdown, HD announced the opening of three new distribution centers in Georgia. This was part of its ongoing $1.2 billion investment plan to expand its operations and market presence across the country. HD also increased its investment in the outdoor power categories group, in response to surging demand for products across the country. HD reported a 23.4% year-over-year improvement in its net sales to $38.05 billion for the second quarter ended August 2020. Gross profit of $12.94 billion improved 24.1% from the same period last year. Operating income increased 23.9% over the year-ago period to $6.06 billion. Net earnings of $4.33 billion improved 24.5% from its year-ago value. Cash and cash equivalents balance of $14.32 billion increased 456.2% year-over-year. HD had an impressive asset turnover ratio (also known as sales to total assets ratio) of 1.46 at the end of the quarter. This implies HD generated $1.46 for every dollar held as assets in the second quarter this year. How does HD stack up for the POWR Ratings? A for Trade Grade A for Buy & Hold Grade A for Peer Grade A for Industry Rank A for Overall POWR Rating You can’t ask for better. It is ranked #1 out of 67 in the Home Improvement & Goods industry. American Homes 4 Rent (AMH) AMH is an internally managed Maryland real estate investment trust (REIT) and is a leader in the single-family home rental industry. It is known nationwide for its high quality, good value rental homes with high tenant satisfaction. AMH’s main aim is to generate risk-adjusted returns for its investors by acquiring, renovating, and leasing properties across the United States, and distribute the same as dividends. As the demand for residential real estate is rising around the country amid the pandemic, AMH opened several new apartment communities and housing units on rent in Florida, Arizona, Washington, and Utah in the past month. On August 17th, AMH announced an underwritten public offering of 11 million class A shares at $0.01 (par value). AMH plans to pay off its debt under the revolving credit facility through the capital raised. AMH’s expansionary business operations catering to the growing demand for affordable rental housing have reflected positively on its financials in the second quarter ended June 2020. Rental rates on new property leases grew 4.4% year-over-year, while net revenue increased slightly to $238.10 million. The same-home portfolio averaged occupied days percentage increased to 95.6% during this time. For July alone, the same-home portfolio averaged occupied days percentage reached a record high of 96.4%. AMH’s FFO is expected to grow at 61.7% per annum over the next five years. Its earnings surprise history is impressive as well, as it beat the street FFO estimates in each of the trailing four quarters. AMH gained more than 60% since hitting its 52-week low in March amid the virus-driven market crash. AMH is rated a “Strong Buy” in our POWR Ratings system, consistent with its sound business model and growth potential in this thriving sector. It also has an “A” in Trade Grade, Buy & Hold Grade, and Peer Grade. It is ranked #1 out of 20 stocks in the REITs- Residential industry. NVR, Inc. (NVR) NVR constructs and sells single-family detached homes, townhomes and condominium buildings under Ryan Homes, NV Homes, and Heartland homes. Ryan Homes attract first hand and first move-up buyers, while NV Homes and Heartland homes cater to move-up and luxury buyers. NVR operates through two segments, Homebuilding, and mortgage banking. Its mortgage banking unit offers title insurance and closing services to customers. As one of the largest home building companies operating in the United States, NVR’s new orders increased 13% year-over-year to 5,901 units in the second quarter ended June 2020. The average sales price of $365,400 on new orders improved 2% year-over-year. The gross profit margin of the home building segment increased 30 basis points year-over-year to 19.2%. On May 1st, 2020, NVR, announced an offering of senior notes, which will allow the company to raise $600 million. In the booming housing industry, such funds can help NVR expand its business operations to generate profits. The consensus EPS estimate of $59.75 for the third quarter ending September 2020 indicates a 6.5% rise year-over-year. Moreover, NVR surpassed the street EPS estimates in three out of trailing four quarters, which is impressive. NVR gained more than 105% to hit its 52-week high of $4,222.24 in August since hitting its 52-week low of $2,043.01 in March. It’s no surprise that NVR is rated “Strong Buy” in our POWR Ratings system. It also has an “A” in Trade Grade, Buy & Hold Grade, Peer Grade, and Industry Rank. In the 21-stock Homebuilders industry, it is ranked #3. The Sherwin- Williams Company (SHW) SHW manufactures, sells, and distributes paints, stains, supplies, equipment, and floor coverings under three main segments – America Group, Consumer brands group, and performance coating group. Its customer base includes retail, industrial, commercial, and professional buyers. As people spend more time at home, they are choosing to upgrade their surroundings. Most home improvement projects involve painting exteriors or interiors. SHW’s EBITDA of $979 million increased 6.2% year-over-year in the second quarter ended June 2020. Diluted income per share increased by 28.8% from the year-ago value to $6.48 per share. Net sales in the consumer brands group increased by 21.8% year-over-year to $980.20 million in the second quarter. Segment profit increased 68.7% from the year-ago value to $237.40 million. SHW’s operating cash balance of $1.07 billion increased by 42% year-over-year. The consensus EPS estimate of $7.18 for the third quarter ending September 2002 indicates a 7.9% improvement year-over-year. Moreover, SHW has an impressive earnings surprise history, as it beat street EPS estimates in three of the trailing four quarters. The consensus revenue estimate of $4.91 billion indicates a slight improvement from the year-ago value. SHW gained more than 105% since hitting its 52-week low of $325.43 in March to hit its 52-week high of $676.03 in August. SHW is rated a “Strong Buy” in our POWR Ratings system, with an “A” in Trade grade, Buy & Hold Grade, Peer Grade and Industry Rank. It is also ranked #3 out of 67 in the Home Improvement and Goods industry. Want More Great Investing Ideas? The Best of StockNews 3 Possible Directions for the Stock Market from Here 9 “BUY THE DIP” Growth Stocks for 2020 HD shares were trading at $282.42 per share on Wednesday afternoon, down $2.58 (-0.91%). Year-to-date, HD has gained 30.97%, versus a 6.49% rise in the benchmark S&P 500 index during the same period."}]}