{"article": [{"url": "https://stocknews.com/news/aapl-amzn-googl-xlk-spy-fb-the-3-most-important-stocks-reporting-earnings-this-week/", "published": 1595938100.0, "headline": "The 3 Most Important Stocks Reporting Earnings This Week", "body": "We are finally in the busiest week of earnings season. More than 900 companies have or are scheduled to report this week. Through Monday, 130 companies in the S&P 500 had reported, with 80% beating estimates. This is also in the midst of a Fed meeting this week. On Wednesday, Fed Chairman Jerome Powell will provide his thoughts on the economy, so make sure you keep an eye on that. There are three stocks reporting earnings on Thursday that I am most focused on. They are three of the most valuable companies in the world. Each stock is worth over a trillion dollars, and combined are worth almost $4 trillion. 7 Best ETFs for the NEXT Bull MarketAs you might have guessed, they are the “Triple As”: Apple (AAPL), Amazon (AMZN), and Alphabet (GOOGL). These big tech companies have dominated the market since their March lows. The Tech sector is up for the year, with the Technology Select Sector SPDR ETF (XLK) up more than 16%. This has outpaced the SPDR 500 ETF’s (SPY) slight gain of 0.3% The CEOs of all three companies will join Mark Zuckerberg, CEO of Facebook (FB), on Wednesday to be grilled by the House Judiciary subcommittee about the amount of control Silicon valleys has over the world. This will likely affect stock prices as well. Apple (AAPL) AAPL is expected to report revenue of $52 billion for the quarter. This would represent a 3% drop from a year ago. The company is also expected to report adjusted net income of $8.3 billion. The stock is up 28% so far year to date. AAPL currently has a market cap of $1.6 Trillion. AAPL has been benefiting from robust App Store sales and the adoption of Apple Music and Apple Pay. During the pandemic, there was a greater need for online services, so products like iPhone and iPads became an essential tool for consumers. AAPL also dominates the wearable market with strong sales from the Apple Watch and AirPods. AAPL is one of the top-rated stocks in our momentum-based POWR Ratings system. It holds grades of A in every component of the POWR Ratings. Overall it is the #1 ranked stock in the Technology – Hardware industry. The 28% return year to date on top of a whopping 88% return shows the momentum taking place with Apple. After Thursday night, we will have a better idea if the momentum will continue. Amazon.com (AMZN) The consensus for AMZN’s second-quarter revenue is $81 billion, which would be an increase of 28% from last year. Analysts also expect an adjusted net income of $2.6 billion. In the same quarter a year ago, AMZN posted earnings of $5.22 a share on sales of $63 billion. AMZN, which has a market cap of $1.5 trillion, is up almost 65% for the year. AMZN holds a dominant position in the cloud-computing space with Amazon Web Services (AWS), providing the company with a high margin business. The company can also rely on its AI-backed Alexa device to sell products and services. A current focus for the company is creating video content for Prime subscribers due to the growth potential of the streaming market. AMZN’s leading retail business continues to stay one step ahead with unbeatable prices and choices. AMZN is rated a Strong Buy in our POWR Ratings system. It holds grades of A for Trade Grade, Industry Rank, and B for Buy & Hold Grade and Peer Grade. It is the #14 ranked stock in the Internet industry. Alphabet (GOOGL) GOOGL is expected to post second-quarter revenue of $37 billion and GAAP EPS of $7.96 a share. The revenue would represent a 4% annual drop, and EPS would be 44% off from the previous year. The company is also expected to report adjusted net income of $6.7 billion. Its stock is up over 25% for the year. GOOGL’s market cap is just above $1 trillion. Not only does GOOGL control about 90% of web traffic, but its growing cloud unit is providing considerable revenue growth. The company entered the home assistant space in 2016 with the launch of Google Home and is looking to enter the wearable device market with a proposed agreement to buy Fitbit for $2.1 billion. How does GOOGL stack up for the POWR Ratings? A for Trade Grade A for Buy & Hold Grade A for Industry Rank A for Peer Grade A for overall POWR Rating That’s As across the board. It is also #1 ranked stock in the Internet industry. Want More Great Investing Ideas? 9 “BUY THE DIP” Growth Stocks for 2020 Newly REVISED 2020 Stock Market Outlook 7 “Safe-Haven” Dividend Stocks for Turbulent Times AAPL shares were trading at $375.82 per share on Tuesday afternoon, down $3.42 (-0.90%). Year-to-date, AAPL has gained 28.63%, versus a 1.39% rise in the benchmark S&P 500 index during the same period."}]}