{"article": [{"url": "https://stocknews.com/news/cmg-loco-yum-3-fast-food-stocks-outperforming-the-sp-500/", "published": 1597234100.0, "headline": "3 Fast-Food Stocks OUTPERFORMING the S&P 500", "body": "Restaurants across the globe have been hit hard due to the pandemic, with prolonged periods of shutdowns and reduced foot traffic upon partial reopenings. According to a National Restaurant Association report released on June 12th, the restaurant industry lost $120 billion in sales during March, April and May due to the impact of coronavirus in the United States. Restaurants are adopting the “new normal” rules to combat this slowdown in demand. About 80% of the restaurants operating in the United States have developed a home delivery and take out system. Among other actions, most of the restaurants are trying to maintain safe dining protocols by taking routine sanitation measures. However, according to a nationwide survey conducted by YouGov and SafetyCulture, 52% of American would feel uncomfortable returning to restaurants in the next three months. Despite a weak recovery outlook, the fast food segment has surprisingly witnessed a strong recovery. Contactless drive-thru and home delivery tactics have reduced the fear of catching the virus among customers, as fast food restaurants follow social distancing protocols. Companies have also undertaken widespread expansion projects to adjust their business model to the “new normal,” along with aggressive digital advertising and sales strategies. 9 \"BUY THE DIP\" Growth Stocks For 2020Successful efforts to survive the pandemic have allowed Chipotle Mexican Grill (CMG), El Pollo Loco Holdings, Inc. (LOCO) and Yum! Brands, Inc. (YUM) to gain at least 50% since their market lows in March, outperforming the S&P 500’s 54% gain. Chipotle Mexican Grill (CMG) CMG has managed to not only retain its business operations during the pandemic, but also undertook expansion projects. It opened 19 new restaurants in the first quarter of 2020 and its digital sales increased 80% quarter-over-quarter during lockdown. CMG’s drive-thru facility, known as Chipotlane, is present in 32 states, and has been introduced in 11 of the new restaurants opened in 2020. Out of its estimated new employee hiring of 10,000 this year, CMG has already appointed 8,000. Moreover, CMG recently launched a new avocado dyed clothing and accessories line, with first access given to 15 million Chipotle Rewards’ members. CMG’s second-quarter results were impressive. Digital revenue increased 216.3% year-over-year during the quarter, accounting for 60.7% of its total revenue. Net sales increased 6.4% month-to-date (till July 23rd). CMG opened 37 new restaurants, including relocations, during this quarter, while 3 restaurants were permanently closed. The company also has substantial cash holdings and credit facilities, which will help it brave the crisis. CMG’s EPS is expected to grow 22.2% annually for the next five years. The consensus revenue estimate of $1.58 billion for the third quarter indicates a 12.4% rise year-over-year. Since hitting its 52-week low of $415 on March 18th, CMG gained more than 185% to hit its 52-week high on August 7th. How does CMG stack up for POWR Ratings? A for Trade Grade A for Buy & Hold Grade A for Peer Grade B for Industry Rank A for Overall POWR Rating. You can’t ask for better. It is also ranked #2 out of 48 stocks in the Restaurants industry. El Pollo Loco Holdings, Inc. (LOCO) LOCO is a fast food restaurant specializing in Mexican cuisine, and is known for its signature citrus-marinated fire-grilled chicken. It is categorized as a limited services restaurant (LSR) operating under two segments – Full service and limited service. LOCO partnered with Postmates to make an extended commitment to free delivery on orders above $10. As home delivery is gaining significance each passing day, reducing the overall expenses can go a long way for LOCO. It also opened a new restaurant with a drive-thru facility in Arizona designed to seat 58 customers. LOCO currently has a $30 million budget for media planning and advertising. Its sales in the first half of 2020 tripled from its year-ago value, and is expected to grow even further in the current quarter. The consensus EPS estimate of $0.22 for the third quarter ending September 2020 indicates a 10% improvement year-over-year. Moreover, LOCO has managed to beat the street EPS estimates in each of the trailing four quarters, which is impressive. The consensus revenue estimate of $111.92 million for the upcoming quarter indicates a 1.4% improvement from its year-ago value. LOCO hit its 52-week high of $19.90 on August 3rd, thereby gaining more than 220% since hitting its 52-week low of $6.15 on March 18th. It’s no surprise that LOCO is rated “Buy” in our POWR Ratings system. It has an “A” in Trade Grade and Peer Grade and “B” in Buy & Hold Grade and Industry Rank. In the 48-stocked Restaurants industry, it is currently ranked #10. Yum! Brands, Inc. (YUM) YUM is the largest quick service restaurant company in the world, operating through development and licensing of franchise chain of restaurants. It has three main segments – KFC division, Pizza Hut division and Taco Bell division. It owns more than 50,000 restaurants in 150 countries. YUM’s digital sales reached an all-time high of $3.50 billion in the second quarter, increasing 40% year-over-year. Its net-unit grew 3% from its year-ago value. As the popularity of quick service restaurants are increasing worldwide, KFC opened 234 new restaurants in 26 countries, Pizza Hut opened restaurants in 14 countries and Taco Bell opened 22 new restaurants in 4 countries in the second quarter. The consensus EPS estimate of $0.81 for the third quarter ending September 2020 indicates a 1.3% improvement from its year-ago number. The street revenue estimate of $1.41 billion indicates a 5.1% growth year-over-year. YUM gained more than 65% since hitting its 52-week low of $54.95 on March 23rd. YUM’s POWR Ratings reflect this promising outlook. It has a “B” for Peer Grade and Industry Rank. Among the 48 stocks in the Restaurants industry, it’s ranked #14. Want More Great Investing Ideas? 3 Possible Directions for the Stock Market from Here How to Trade THIS Stock Bubble? 9 “BUY THE DIP” Growth Stocks for 2020 CMG shares were unchanged in after-hours trading Wednesday. Year-to-date, CMG has gained 38.68%, versus a 5.92% rise in the benchmark S&P 500 index during the same period."}]}