{"article": [{"url": "https://stocknews.com/news/tsm-avgo-umc-camt-4-buy-rated-semiconductor-stocks-that-pay-dividends/", "published": 1597320500.0, "headline": "4 BUY-RATED Semiconductor Stocks That Pay Dividends", "body": "The semiconductor industry remains a good bet despite the economic weakness stemming from the coronavirus. While there’s been lower demand in some segments, overall, demand for chips is higher due to the increased need for PCs and tablets as more people work from home and take classes online. There are also areas of secular growth like 5G, artificial intelligence, and cloud computing. Many stocks in the sector also pay dividends which makes them ideal for the current market environment given the uncertainties. However, most semiconductor companies have reported outstanding second-quarter results. This week, the VanEck Vectors Semiconductor ETF (SMH) made a new, all-time high. Taiwan Semiconductor Manufacturing Ltd. (TSM), Broadcom Inc. (AVGO), United Microelectronics Corporation (UMC), and Camtek Ltd. (CAMT) are four dividend-paying semiconductor stocks. 7 Best ETFs for the NEXT Bull MarketTaiwan Semiconductor Manufacturing Ltd. (TSM) TSM focuses on the design, manufacture, and sale of integrated circuits along with other types of semiconductor devices. TSM has recently reported capital appropriations of $5.27 billion for the expansion and installation of their technological capacity, advanced packaging capacity, along with fab construction. In the last six years, TSM has approved and issued more dividends than 99% other dividend-paying US stocks in the StockNews.com universe. The company has a dividend yield of 1.72%. For the quarter ended June 30th, TSM reported a 28.9% year-over-year rise in revenue. TSM’s earnings surprise history is impressive as well, with the stock beating consensus EPS estimates in three of the trailing four quarters. TSM has also been performing pretty well in the “new normal,” and it has added close to 81% to its stock price since this year’s low of $42.7 hit in March due to the virus-driven market crash. How does TSM stack up for the POWR Ratings? A for Trade Grade A for Buy & Hold Grade B for Peer Grade A for Industry Rank A for Overall POWR Rating You can’t ask for better. The stock is also ranked #1 out of 86 stocks in the Semiconductor & Wireless Chip industry. Broadcom Inc. (AVGO) AVGO designs, manufactures and sells a wide range of analog and digital semiconductor connectivity solutions. This includes wireless communication, enterprise and industrial storage, and wired connectivity. The demand for AVGO’s advanced semiconductor technology is expected to rise along with the growing demand for 5G technology. AVGO currently pays an annual dividend of $13, which works out to a dividend yield of 4.01%. The dividends paid by AVGO have steadily increased for 22 quarters in a row. For the quarter ended May, the company witnessed revenue of $5.7 billion, which was an increase of 4% year-over-year. Sales from its infrastructure software rose by 21% during the same period. The earnings surprise history for AVGO looks pretty good, as the company beat or met consensus EPS estimates in three of the trailing four quarters. AVGO’s stock has recovered more than 60% from the year-to-date low it hit in mid-March due to the overall crash in the market. The company’s strong recovery could be part of a growth momentum that could last well for the rest of 2020. It’s no surprise that AVGO is rated “Strong Buy” in our POWR Ratings system. It also has an “A” for Trade Grade, Peer Grade, Buy & Hold Grade, and Industry Rank. In the 86-stock Semiconductor & Wireless Chip industry, it is ranked #3. United Microelectronics Corporation (UMC) UMC develops and supplies IC production for applications used in almost every major electronics-based industry. The company has recently purchased machinery and equipment from a subsidiary of Applied Materials for $34.8 million in a bid to expand operations. UMC currently pays an annual dividend of $0.10, which amounts to a dividend yield of 2.4%. The company has an EBITDA to net debt ratio, which is better than 99.5% other stocks in the StockNews.com universe. For the second quarter of the year, UMC delivered an earnings surprise of 80%. The stock has also been performing pretty well in this “new normal.” It has added close to 93% to its stock price since its low of $2.10 on April 4th. UMC’s strong fundamentals are reflected in its POWR Ratings; it has a “Buy” rating with an “A” in Trade Grade and Industry Rank. Within the Semiconductor & Wireless Chip industry, it’s ranked #15 out of 86 stocks. Camtek Ltd. (CAMT) CAMT designs, manufactures and markets functional ink technology and automated optical inspection products. In a business update relating to the coronavirus, the company has stated that despite challenges, they are witnessing strong momentum. The company pays an annual dividend of $0.17, which translates to a dividend yield of 1.08%. For the second quarter, the company witnessed revenues of $37 million, which was a rise of 8% year-over-year. The company also reported strong operating cash flows of $11.1 million. In the same quarter, CAMT delivered a positive earnings surprise of 6.7%. The revenue of the company is expected to grow 19.1% year-over-year during the quarter ended in September 2020. CAMT’s stock has recovered 115.1% from the year-to-date low it hit in mid-March. The company’s strong recovery could be part of a growth momentum that could last well for the rest of 2020. It’s no surprise that CAMT is rated “Strong Buy” in our POWR Ratings system. It also has an “A” for Trade Grade, Buy & Hold, and Industry Rank. In the 86-stock Semiconductor & Wireless Chip industry, it is ranked #49. Want More Great Investing Ideas? 9 “BUY THE DIP” Growth Stocks for 2020 How to Trade THIS Stock Bubble? 7 “Safe-Haven” Dividend Stocks for Turbulent Times TSM shares rose $0.09 (+0.11%) in after-hours trading Thursday. Year-to-date, TSM has gained 36.58%, versus a 5.73% rise in the benchmark S&P 500 index during the same period."}]}