{"article": [{"url": "https://stocknews.com/news/apps-spt-par-igv-t-3-software-stocks-that-wall-street-analysts-love/", "published": 1597838900.0, "headline": "3 Software Stocks that Wall Street Analysts Love", "body": "The demand for software products and services has been steadily rising due to remote working, remote learning, and increasing digitization of business processes. The future of software companies also looks bright thanks to increasing development in cloud computing, artificial intelligence, and big data. The majority of software companies have reported significantly positive results during this earnings season. The software industry’s ability to capitalize on the pandemic-driven changes have been reflected in the stock market. The iShares Expanded Tech-Software Sector ETF (IGV) has gained more than 28% year-to-date while the S&P 500 has posted returns of just 5% over the same time period. With the huge proliferation of software stocks in the market, it can be difficult to choose the right stocks with the most potential. Three software stocks that Wall Street analysts recommend buying are Digital Turbine (APPS), Sprout Social, Inc. (SPT), and PAR Technology Corporation (PAR). 9 \"BUY THE DIP\" Growth Stocks For 2020Digital Turbine, Inc. (APPS) APPS is a mobile-ad company that focuses on delivery, tracking, recommendation, and simplification of mobile advertising. It also helps mobile apps with content development and delivers billing technology. The company is now looking to expand into the OTT market and is anticipating a launch of the software product across all major US operators such as AT&T (T), Verizon (VZ), and T-Mobile. Branching into the OTT space could be a driver of solid long-term growth for APPS. The ratings consensus for APP according to Wall Street analysts is a Strong Buy. The company delivered stellar results for the quarter ending June 30th. It reported net revenues of approximately $59 million as compared to $30 million during the same period last year. This indicates a nearly 100% rise year-over-year. APPS’s earnings surprise history is impressive as well with the stock meeting or beating consensus EPS estimates in each of the trailing four quarters. APPS stock has also been performing extremely well in the “new normal,” and it has added close to 273% to its stock price since this year’s low of $3.5 on March 18th. How does APPS stack up for the POWR Ratings? A for Trade Grade A for Buy & Hold Grade A for Peer Grade A for Industry Rank A for Overall POWR Rating You can’t ask for better. The stock is also ranked #16 out of 84 stocks in the Software – Application industry. Sprout Social, Inc. (SPT) SPT delivers social media management tools for enterprise customers. Its offerings include lead generation, analytics, contact management, and communication tools. The company went public in December of last year. It is one of the first publicly-traded social media management companies. With social media being one of the most effective and cost-efficient marketing tools in the market today, the future of SPT looks bright. Wall Street analysts have a rating of Strong Buy for the stock. The average price target of the stock is $35.14, which is 9.2% higher than its current price. The company’s total revenue was up 27% for the quarter ending June 30th, compared to the same period last year. The company has beaten the street EPS estimates in all three trailing quarters. The stock has gained more than 100% so far this year, and we may witness further rise as the company starts making profits. PAR Technology Corporation (PAR) PAR focuses on delivering technology solutions to enterprises in the global hospitality sector. It offers both hardware and software services which help restaurants and retail markets with their point-of-sale operations. The company has recently partnered with Tillster’s digital ordering platform in order to offer integrated online and mobile ordering capabilities. PAR has also partnered with Shogo, a cloud-based accounting system provider, to further boost the capabilities of its Brink POS platform. These partnerships have the potential to drive growth for the company as the value of its services increase. Wall Street analysts are highly optimistic about this stock with a consensus rating of Strong Buy. The average price target for the stock is $39.8, which is 14.1% higher than its current price. PAR’s stock has recovered around 225% from its year-to-date low in mid-March. The company’s strong recovery could be part of momentum that could last for the rest of 2020. It’s no surprise that PAR is rated a Strong Buy in our POWR Ratings system. It also has a grade of A for Trade Grade, Buy & Hold Grade, and Peer Grade. In the 49-stock Technology – Services industry, it is ranked #4. Want More Great Investing Ideas? The Best of StockNews 2 Step Process to Sell @ Market Top in September 9 “BUY THE DIP” Growth Stocks for 2020 APPS shares rose $0.26 (+0.94%) in after-hours trading Wednesday. Year-to-date, APPS has gained 289.06%, versus a 5.84% rise in the benchmark S&P 500 index during the same period."}]}