{"article": [{"url": "https://stocknews.com/news/aapl-tmus-nok-3-stocks-to-capitalize-on-the-5g-revolution/", "published": 1597061300.0, "headline": "3 Stocks to CAPITALIZE on the 5G Revolution", "body": "The transition to 5G will elevate dozens of stocks, potentially for years to come. Though the global pandemic delayed the introduction of 5G, it is now being implemented across the world. From wireless tower providers to phone component manufacturers and phone-makers, there are plenty of businesses that will benefit from the shift to 5G. However, most investors are unsure which 5G stocks are worth a closer look, considering that there are so many potential beneficiaries of this technological transition. The following three stocks stand a good chance of increasing in value as the 5G revolution plays out: Apple (AAPL), T-Mobile (TMUS), and Nokia (NOK). 9 \"BUY THE DIP\" Growth Stocks For 2020Apple (AAPL) When it comes to phones, none top the iPhone. AAPL’s phones are nearly flawless in every regard. Though AAPL charges a pretty penny for phones, its customers are fiercely loyal. Add in the fact that AAPL has a litany of other products, and it is easy to see why just about everyone is bullish about this company. The fact that phone data speeds will increase thanks to the arrival of 5G is the icing on AAPL’s cake. If everything goes according to plan, the implementation of 5G will likely boost AAPL’s value by 35%. In other words, it might not be long until AAPL is trading around $600 or more. Suppose you are still uncertain about whether AAPL is worth your money and consider the stock’s POWR Ratings. AAPL has grades of A in each POWR Component and an industry rank of 1 out of 28 stocks in the Technology – Hardware industry. Out of the 31 analysts who have analyzed AAPL, 23 recommend buying the stock. Furthermore, AAPL has a forward P/E ratio of 34.39, indicating it is reasonably priced at $450. Considering the fact that many other tech stocks have forward P/E ratios over 50 or 100, AAPL’s P/E proves the stock might even be undervalued compared to its peers. T-Mobile (TMUS) TMUS is the country’s first and sole nationwide 5G network. TMUS’s 5G network covers more locations and people than any other. This is by far the most reliable 5G signal in the United States. Though Verizon is pulling out all the stops to gain ground on TMUS, TMUS is the pack leader. TMUS started to roll out its 5G network back in December. Today, the network covers a quarter-billion people in the United States across nearly 8,000 cities, spanning more than a million square miles. All in all, TMUS is the second-largest wireless carrier in the United States, coming in just behind AT&T. The POWR Ratings reveal TMUS has A grades in all POWR components except Industry Rank. Furthermore, TMUS is ranked second of 24 stocks in the Telecom – Domestic industry. Analysts are quite bullish on TMUS, setting a price target of $121.18. Out of 16 analysts who have reviewed the stock, 13 rate it a Buy and three rate it a Hold. None of the 16 analysts advise selling the stock. TMUS is likely to break through its 52-week high of $118 as revenue spikes from the 5G transition. Nokia (NOK) It appears as though NOK finally has its 5G problems solved. The company’s original 5G components were supposedly technologically superior yet proved egregiously costly. NOK planned on using alternatives to application-specific integrated circuits dubbed field-programmable gate arrays or FPGAs for short. However, these components were not worth the cost. Now that the NOK 5G ship is in order, the stage is set for an autumn revival. The POWR Ratings show NOK has B grades in each POWR Component, but Trade Grade, which is an A. TipRanks’ review of analyst estimates, indicate NOK has a price target of $5.39. With a forward P/E ratio of merely 18.31, NOK might be undervalued. Furthermore, NOK beat analyst expectations for second-quarter earnings. Look for NOK’s foray into 5G to send the stock beyond its 52-week high of $5.39. Want More Great Investing Ideas? 3 Possible Directions for the Stock Market from Here How to Trade THIS Stock Bubble? 9 “BUY THE DIP” Growth Stocks for 2020 AAPL shares fell $0.06 (-0.01%) in after-hours trading Monday. Year-to-date, AAPL has gained 54.61%, versus a 5.27% rise in the benchmark S&P 500 index during the same period."}]}