{"article": [{"url": "https://stocknews.com/news/spy-inx-amzn-aapl-msft-fb-5-reasons-the-sp-500-will-hit-new-highs-in/", "published": 1596197300.0, "headline": "5 Reasons the S&P 500 Will Hit New Highs in August", "body": "Since early June, the S&P 500 (SPY) has been trading in a range between 3,000 and 3,270 and the SPDR S&P 500 ETF Trust (SPY) has remained between $300 and $326. (source: stockcharts.com) 7 \"SAFE HAVEN\" Dividend Stocks for Turbulent TimesOver the last two weeks, it’s been trading in an even tighter range on the S&P 500 between 3,200 and 3,260. (source: stockcharts.com) So far, breakout attempts have been rejected, but odds are high that the market will decisively move past these levels. From there, a rally is likely to exceed its previous, all-time highs of 3,393 set in February. The major reasons for continued strength in the S&P 500 are strong earnings reports, bullish technicals, a dovish Fed, strong market breadth, and declining case counts. Strong Earnings Report While many parts of the economy are struggling, this earnings season has made it clear that the market’s leading stocks – Apple (AAPL), Microsoft (MSFT), Amazon (AMZN), Google (GOOG), and Facebook (FB) remain in good shape. In total, these stocks account for 22% of the S&P 500. Except for Google, all of these companies reported revenue growth above 10% on a year over year basis in the last quarter. The companies that issued guidance came in above analysts’ expectations as well. It’s a positive sign for the S&P 500 that the momentum of the biggest companies remains unaltered by the coronavirus. Bullish Technicals The S&P 500 is also in a very healthy place in terms of technicals. Since the March lows, it’s formed a pattern of higher highs and higher lows. Its recent period of sideways trading over the last two months has also cooled excess, bullish sentiment. Some indications of this sentiment were traders piling into short-dated call options, the huge gains in stocks in speculative stocks, and short-term, overbought technical readings. The bulk of the call options have expired worthless due to the market’s range-bound price action. Many of the speculative stocks have given up their gains. Overbought technical readings have returned to neutral levels. All of these developments have primed the market for its next leg higher. While it’s easy to get caught up in the fluctuations, the situation is pretty clear if you take a step back. The S&P 500 broke out above 3,200 on July 15, and its upper resistance has now become support. Investors and traders should maintain a bullish stance above this level. (source: stockcharts.com) Dovish Fed At the latest FOMC meeting, Fed Chair Powell attempted to make his dovish stance clear by saying, “We aren’t even thinking about thinking about raising rates.” The Fed is willing to do anything and everything to support the economy. It’s keeping all its emergency programs in place despite the economy’s modest recovery from the worst of March and April. Based on the Fed’s statements regarding inflation targets and its negative outlook, it’s likely that they take additional steps to further stimulate which will boost asset prices. The previous, decade-long bull market, and even the past couple of months, have taught us that when the Fed is stimulating the economy, owning stocks is a wise and lucrative choice. Strong Market Breadth Another bullish feature is that market breadth has been remarkably strong from the March lows. Market breadth measures participation by tabulating the numbers of advancers and decliners. It can identify times when money is flowing into selective stocks or sectors which makes it vulnerable to a reversal. This should be a concern given the dominance of the mega-cap, tech stocks. However, the S&P 500’s breadth chart below shows no sign of distribution. Money continues to move into the market from a bottom-up level. In fact. breadth is at all-time highs which is a bullish omen for the market. (source: stockcharts.com) Case Counts Flattening Another potentially positive catalyst is that new coronavirus cases appear to be plateauing. In terms of states that are hotspots like Arizona, Florida, California, and Texas, there are also reasons to believe that the situation has peaked in terms of new cases. (source: worldometers.info) It’s still early but so far, new case counts seem to have peaked in mid-July. Improvements in the health situation are the ultimate solution to the economic crisis. Falling case counts from early-May to early-June powered the second leg higher for the S&P 500 from 2,800 to 3,200. While this bears watching and progress remains tenuous, it may be the most significant and bullish catalyst in August for the stock market. Want More Great Investing Ideas? 9 “BUY THE DIP” Growth Stocks for 2020 How HIGH Can This Tech Bubble Fly? 7 “Safe-Haven” Dividend Stocks for Turbulent Times SPY shares rose $0.52 (+0.16%) in after-hours trading Friday. Year-to-date, SPY has gained 2.49%, versus a % rise in the benchmark S&P 500 index during the same period."}]}