{"article": [{"url": "https://stocknews.com/news/wsm-sptn-tsco-can-these-3-retailers-punch-their-way-out-of-a/", "published": 1593691700.0, "headline": "Can These 3 Retailers Punch Their Way Out of a Recession?", "body": "Smart, innovative retail dividends are going to hold a special place in the hearts of many income investors when this pandemic is through. I recently mused about my springtime e-tailing adventures out of Puerto Backyarda. While I got my mister to stay cool, many opportunistic dividend buyers are going to enjoy hot payouts that double or better in the years ahead. Stores such as Best Buy (BBY) and Home Depot (HD) have kept people slapping away on their keyboards and occupied with home projects. Even more importantly, retailers like Walmart (WMT), Amazon.com (AMZN) and Kroger (KR) not only supplied Americans with the basics, but they also kept cranking out services and strategies to keep people safer as they gathered up what they needed. Curbside pickup, mask requirements, distancing stickers, home delivery. Clutch services for millions of Americans. The COVID-19 crisis is just the latest step in retail’s transformation. Amazon has long been forcing retailers to either get on the internet, or get a whole lot better at the brick-and-mortar level, or both. But the coronavirus has added additional wrinkles, new corners to think around. 9 \"BUY THE DIP\" Growth Stocks For 2020It’s a “winner take all” world in retail. And, contrary to popular belief, Amazon isn’t the only one innovating any longer. Here are three retailers that are taking business away from Bezos: Williams Sonoma (WSM) Dividend Yield: 2.3% Upscale homeware seller Williams-Sonoma (WSM) is quietly way ahead of the digital curve. W-S stopped breaking out its e-commerce revenues in 2019, but prior to that, the company already was deriving more than half of its sales from its online portals for the namesake Williams-Sonoma brand, as well as Pottery Barn, Pottery Barn Kids and Teen, and West Elm. (Usually when a company obscures its books, it’s a red flag. In W-S’s case, however, it’s provided a stealth competitive advantage!) The company’s Design Crew Room Planner uses 3D imaging to help people visualize what their homes would look like with all of its expensive baubles. Machine learning helps educate search results, a la Amazon. Meanwhile, a new order management and distribution platform is helping speed up orders and improve product tracking. Williams-Sonoma blew the doors off its fiscal Q1 earnings. Revenues of $1.24 billion and profits of 74 cents per share both walloped estimates of $1.09 billion and 5 cents per share, respectively. The firm did pull Q2 guidance, like most of its peers, but it kept its long-term targets intact, which is reassuring. WSM shares are up 12% this year, and that’s not too shocking considering the company’s clientele. Its upper-crust customers aren’t just economically weathering the storm–they’re using the extra time at home to build out home offices and improve the surroundings they’re stuck with until the pandemic passes. The stock might not be an appealing buy at this very moment, however. The fundamentals are great, and W-S is on the right side of technology. But shares have roughly “caught up” to the dividend—whose growth, by the way, was put on pause at 48 cents per share. It’s an understandable and likely short-term hiccup, but dividend growth is a necessary driver of long-term growth. Time is our friend here. A few more months during a likely volatile summer might give investors time to buy WSM at better prices (and better yields). WSM: On Trend, But Possibly Peaking Right Now SpartanNash (SPTN) Dividend Yield: 3.7% It’s not every year that a grocery name churns out a 50% return at the halfway point, but 2020 is that kind of year. And SpartanNash (SPTN) is that kind of stock. Let’s call SpartanNash a “grocer-plus.” It does own 155 supermarkets in nine states. But it’s also a wholesale grocery distributor that supplies more than 2,100 independent grocery retailers across the U.S., and it even runs distribution operations for the military. Other businesses include fresh produce distribution, fresh food processing and third-party logistics. SpartanNash has implemented dozens of measures over the past few months to keep people supplied and safe. Frequent (every 30 minutes) sanitizations of high-use surfaces, gels and wipes placed throughout stores, social distancing – not to mention contact-free temperature readings and other safety measures for those doing walk-up vaccinations in its pharmacies. It also beefed up its Fast Lane services with GPS technology. And its grocery business has been a stellar one in 2020. Q1 net sales climbed 12.4%, which is one big leap in this industry. Comparable-store sales popped 15.6%. Adjusted EPS of 67 cents per share were a remarkable 179% higher, and it raised its full-year outlook. Generally speaking, though, the grocery business is a challenging one. In fiscal 2019, the company took $8.5 billion in revenues and wrung out a $5.7 million profit. The year before that? $33.6 million in earnings on $8.1 billion in revenues. While SpartanNash is taking care of its customers and should continue to enjoy better comps for the next few quarters, a look at the past 10 years is probably a decent indication of what the next 10 will broadly look like. The plateauing dividend is a concern, too. Spartan Is Tough, But So Is the Grocery Biz Tractor Supply Co. (TSCO) Dividend Yield: 1.1% Tractor Supply Co. (TSCO), if you can ignore the thin dividend, isn’t just one of the most interesting plays of 2020—it’s arguably one of the top stories of the past decade. Tractor Supply Is Pulling Investors Into the Stratosphere Tractor Supply was founded in 1938 in Minot, North Dakota—a small city of fewer than 50,000 people that’s mostly known for its Air Force base—as a mail-order store for tractor parts. It opened its first store a year after. Fast-forward 80-plus years, and you can find one of Tractor Supply’s 1,863 stores in 49 states. Or, you might be familiar with its 180 Petsense stores. Tractor Supply serves rural America, which you might not view as a growth opportunity. But the numbers say otherwise: One Bumper Harvest After Another Tractor Supply has, like any good retailer, embraced technology and put together a competent omnichannel strategy. In this case, Tractor Supply’s ONETractor initiative includes utilizing Microsoft cloud technologies to personalize shopping experiences and better inform TSCO decisions via enterprise analytics. It also hopped on another trend with the 2016 acquisition of Petsense, which it’s leveraging currently by teaming up with Miranda Lambert on a new pet-care line to respond to the coronavirus “pet boom.” Stay-at-home trends are benefiting TSCO just like most other retailers, but Tractor Supply could be the beneficiary of another more specific consequence of the pandemic: a migration to less densely populated areas of the U.S. One Harris Poll survey suggests a third of Americans are mulling such a move. Like Williams-Sonoma, Tractor Supply halted a streak of (impressive) dividend hikes to focus on fiscally navigating the downturn. This too shall pass. But of more immediate consequence is a sharp 40% YTD run to all-time highs that has shares looking awfully frothy. The long-term narrative is a good one, but the risk-reward balance at these levels argues that TSCO should be on our shopping list, a potential buy to consider on a pullback. Want More Great Investing Ideas? Your Early Retirement Portfolio: 7.7% Dividends—Every Month—Forever How to Retire on 10% Dividends Paid Monthly The Simple (and Safe) Way to Earn 15% Every Year from Stocks WSM shares were trading at $83.32 per share on Thursday afternoon, down $1.50 (-1.77%). Year-to-date, WSM has gained 15.22%, versus a -1.43% rise in the benchmark S&P 500 index during the same period."}]}