{"article": [{"url": "https://stocknews.com/news/ctl-umc-nly-3-top-stocks-under-10-that-pay-at-least-a/", "published": 1594901300.0, "headline": "3 TOP Stocks Under $10 that Pay at Least a 3% Dividend", "body": "Low-priced stocks are often on many investors’ radar because they’re able to buy large quantities of shares in hopes of greater returns. For example, on the popular Robinhood 100 list, 3 of the stocks in their top 10 are below $10. However, investing in cheaper stocks isn’t always the smartest approach. Often low-priced stocks don’t have the same growth trajectory as more expensive equities. So if you are looking for cheaper priced stocks, it’s important to invest in companies that are not only growing in size but also paying healthy dividends to their shareholders. That way you can earn income in addition to hopefully seeing your stocks gain value over time. 9 \"BUY THE DIP\" Growth Stocks For 2020Here are 3 top stocks under $10 that pay at least a 3% dividend yield: United Microelectronics Corporation (UMC) Headquartered in Taiwan, UMC specializes in metal oxide semiconductors (CMOS), sophisticated system on-chip (SOC) designs, high voltage integrated circuits, etc. The company operates as a semiconductor wafer foundry in Taiwan, Singapore, China, Hong Kong, Japan, the United States, Europe, and internationally UMC has gained investor’s confidence through its relatively better performance during the pandemic. In fact, the company recently reported a 24.6% year-over-year increase in sales for June 2020. Also, sales for the January to June period increased 26.6%. This indicates that the pandemic has worked favorably for UMC. UMC pays an annual dividend of $0.10, which yields 3.68% based on the current price. The company has increased its dividend by 50.8% in July 2020 and should be able to sustain this level given its solid cash flow position. UMC’s trailing twelve-month cash flow is more than 97.76% of US dividend stocks. The consensus earnings-per-share (EPS) estimate of $0.05 for the second quarter indicates a year-over-year increase of 150%. The consensus revenue estimate also indicates a year-over-year improvement of 24%. So, things look pretty favorable for UMC. UMC has gained more than 28% since hitting this year’s low in the beginning of April. How does UMC stack up for the POWR Ratings? A for Trade Grade A for Buy & Hold Grade B for Peer Grade A for Industry Rank A for Overall POWR Rating You can’t ask for better. It is also ranked #17 out of 86 stocks in the Semiconductor and Wireless chip industry. CenturyLink, Inc. (CTL) This facilities-based communications company provides a wide range of internet, broadband, transportation and infrastructure services both within the country and internationally. With a global market presence, CTL’s data integration, legacy and strategic products and services are used by 4.9 million people including SME industry and state and national governments. CTL is one of the highest dividends paying stocks that are trading below $10.00. CTL pays an annual dividend of $1, which yields 10.3%. CTL has returned more capital to shareholders through its dividends than 93.8% of other dividend-paying US stocks over the past six years. Though the company cut its dividend by more than 50% in March 2019, it has been able to maintain the new level since then. Maintaining the dividend payments during these uncertain times indicates strength in CTL’s capital position. However, CTL’s business model hasn’t helped it survive the pandemic well. With CTL’s enterprise customers shifting to more cloud-based platforms amid the remote working trend and wireless becoming a broadband replacement, the company might continue to struggle. Consensus EPS and revenues estimates for the quarter ended June 2020 indicate a year-over-year decline, reflecting analysts’ concerns. So, you may bet on this stock for hefty dividend income if you have the appetite for capital loss. Annaly Capital Management, Inc. (NLY) NLY is a diversified mortgage REIT which primarily invests in residential and commercial properties. Apart from directly leasing properties, NLY diversifies their portfolio by investing in various mortgage backed securities and their derivative products. It is no surprise that NLY suffered a serious blow due to the lockdown similar to most REITs. With the majority of service-oriented companies adopting the work-from-home culture, the demand for commercial properties is declining. Also, similar to other mortgage REITs, NLY is facing a higher margin call liability during this time, having a detrimental effect on its growth potential. The consensus EPS and revenue estimate for NLY’s second quarter earnings indicate year-over-year decline. Though the outlook is bearish for NLY, the company offers a dividend yield of 17.09%, which falls in the top 1.36% of stock in our universe. Moreover, NLY has returned more capital to shareholders through its dividends than 92.9% of other dividend-paying US stocks over the past six years. Though the company cut its quarterly dividend by 12% in June 2020, the sustainability of this level will depend on how efficiently the company dodges the pandemic. Want More Great Investing Ideas? 9 “BUY THE DIP” Growth Stocks for 2020 Newly REVISED 2020 Stock Market Outlook 7 “Safe-Haven” Dividend Stocks for Turbulent Times CTL shares . Year-to-date, CTL has declined -21.37%, versus a 0.69% rise in the benchmark S&P 500 index during the same period."}]}