{"article": [{"url": "https://stocknews.com/news/ddog-xlk-fsly-twou-3-tech-stocks-to-consider-buying-after-last-weeks-sell-off/", "published": 1597061300.0, "headline": "3 Tech Stocks to Consider Buying After They Sold Off Last Week", "body": "To say that the tech sector has been doing well is an understatement. Since hitting 52-week lows on March 23rd, the Technology Select Sector SPDR ETF (XLK) is trading up 65% and it’s up about 23% year-to-date. &nbsp Tech stocks have dipped only occasionally throughout this rally. However, that’s what we’re seeing in DataDog (DDOG), Fastly (FSLY) and 2U (TWOU). &nbsp These three tech stocks have seen their shares pullback after releasing earnings last week. If they can stabilize and the tech sector continues to move higher, now could be an opportune time to invest in these names. &nbsp Let’s take a look at each of these stocks: 7 Best ETFs for the NEXT Bull Market&nbsp DataDog (DDOG) As more and more data moves to the cloud, companies that sort through this ever-growing information pool for important business insights will prove that much more important. DDOG does exactly that. DDOG also provides cloud-scale application monitoring, server monitoring, and additional services through its Software-as-a-Service platform. Though DDOG has sold off, its business is quite healthy. DDOG’s year-over-year revenue is up 68%. Furthermore, DDOG clients with contracts generating yearly recurring revenue of six figures or higher are up more than 70% on a year-over-year basis. Though DDOG’s second-quarter results were slightly disappointing, the numbers do not warrant the dramatic sell-off. DDOG has an overall POWR Rating of Buy with an A Trade Grade, a B Industry rank, and a ranking of 15 out of 47 stocks in the Software – Business sector. When in doubt, consult with the analysts. The analysts’ price target for DDOG is $91.92, meaning there is nearly 24% upside to go. Look for DDOG to move back toward its 52-week high of $98.99 as the year progresses. Fastly (FSLY) Think back to the last time you loaded a video on the internet. If it took more than a couple seconds to load, the host site could benefit from the services of FSLY. FSLY makes it easier for webpages to load quickly and efficiently. FSLY also enhances website security to boot. Though FSLY dipped as a result of President Trump’s potential ban on TikTok, this stock is still worth your consideration. After all, TikTok constitutes only about 12% of FSLY’s revenue. The bottom line is there are plenty of websites out there willing to pay for FSLY’s services as more people cut the cord on cable, instead, turning to the internet for video content. If you are still unsure as to whether FLSY is worthy of a position in your portfolio, consider the stock’s POWR Ratings. FSLY has an A Trade Grade and C grades across the remaining POWR Components. Furthermore, FSLY has an incredible 307.27% year-to-date price return. Wall St. analysts still believe in the company. The analysts have set a price target of $91.29 for FSLY, meaning it has around 10% upside. FSLY will continue to grow as the internet expands in size and the number of video uploads increases in an exponential manner. If you are still concerned about the potential loss of TikTok as a client, don’t fret. FSLY’s customer count increased by 114 between the prior two quarters, coming in just under 2,000. Buy and hold this tech winner for years to come and you will likely be more than pleased with the return. 2U (TWOU) The future of education is on the web. It is cheaper, safer, and more efficient to learn on the internet. TWOU recognized this fact years ago, establishing a cloud-based SaaS service that makes it easy for universities and colleges to educate students from afar. Aside from undergraduate degree programs, TWOU also offers services to colleges in terms of student acquisition, state authorization, and advising. The POWR Ratings reveal TWOU has an A Trade Grade, an A Peer Grade, a B Industry Rank Grade, and a ranking in the top half of 10 Software – SAAS stocks. The top analysts believe TWOU will rally, with an average price target of $49.75, indicating there is a 22.66% upside remaining. Look for TWOU to rebound as more and more colleges attempt to reopen only to endure a coronavirus outbreak that sends their students toward online learning. Want More Great Investing Ideas? 9 “BUY THE DIP” Growth Stocks for 2020 How to Trade THIS Stock Bubble? 7 “Safe-Haven” Dividend Stocks for Turbulent Times DDOG shares were trading at $76.01 per share on Monday afternoon, up $0.73 (+0.97%). Year-to-date, DDOG has gained 101.19%, versus a 5.20% rise in the benchmark S&P 500 index during the same period."}]}