{"article": [{"url": "https://stocknews.com/news/voo-xlk-xly-smh-4-strong-buy-etfs-that-pay-dividends/", "published": 1598962100.0, "headline": "4 \"Strong Buy\" ETFs that Pay Dividends", "body": "ETFs are funds that often hold a collection of securities, like stocks, that correspond to a particular industry or track an index with the intention of replicating its performance. An equities ETF offers investors the opportunity to invest in stocks handpicked by an experienced fund manager, thus, helping them to reduce their risk and diversify their portfolio. For example, if an investor wants to get own healthcare companies but isn’t sure which ones to buy, he/she could buy Health Care Select Sector SPDR ETF (XLV), which holds stocks such as Johnson & Johnson, (JNJ), UnitedHealth Group (UNH), and Merck (MRK). There are over 2,000 ETFs, so which are the ones should you choose? I suggest investors take a look at Vanguard S&P 500 ETF (VOO), SPDR Select Sector Fund – Technology (XLK), SPDR Select Sector Fund – Consumer Discretionary (XLY), and VanEck Vectors Semiconductor ETF (SMH). 9 \"BUY THE DIP\" Growth Stocks For 2020These four ETFs are not only rated “‘Strong Buy” on our proprietary POWR Ratings system but they also pay a dividend. Vanguard S&P 500 ETF (VOO) VOO’s goal is to track the performance of the S&P 500 index. This fund helps investing in diversified mega and large cap stocks. VOO is also a relatively safer fund as it consists of some well-known blue chip companies. As the technology-driven momentum has helped S&P 500 hit its all-time highs recently, VOO has generated significant returns since its March lows. VOO has a portfolio of 504 stocks. Some of its top holdings are Apple Inc. (AAPL), Microsoft Corporation (MSFT), Amazon.com, Inc. (AMZN) and Facebook, Inc. (FB). VOO pays an annual dividend of $5.34 which yields 1.66%. The EFT has gained more than 50% since its March lows. The fund has returned 21.9% over the past year and 12.4% over the past three months. The expenses ratio for VOO of 0.03% is lower than its category average of 0.41%, which makes it a reasonable option to invest in. Moreover, the fund has $165.81 million Assets Under Management (AUM). How does VOO stack up for the POWR Ratings? A for Trade Grade A for Buy & Hold Grade A for Peer Grade A for Industry Rank A for Overall POWR Rating You can’t ask for better. The ETF is also ranked #4 out of 199 ETFs in the Large Cap Blend ETFs group. SPDR Select Sector Fund – Technology (XLK) With an investment objective of reflecting results that correspond generally to the price and yield performance of the S&P Technology Select Sector Index, XLK gives exposure to various markets in the realm of the technology industry and usually invests in larger companies. The accelerated pace of digital transformation amid the pandemic has been a significant contributor to XLK’s price momentum and the ETF should keep riding on this trend. XLK pays an annual dividend of $1.20 which yields 0.97%. Since hitting its 52-week low of $68.10 in March due to the coronavirus-induced market crash, XLK has gained about 80%. XLK has 72 holdings in total and the fund has returned 57.6% over the past year and 35.9% year-to-date. Some of XLK’s major holdings are Apple Inc. (AAPL), Microsoft Corporation (MSFT), Visa Inc. (V), and NVIDIA Corporation (NVDA). XLK has an AUM of $37.28 million. Furthermore, XLK’s expense ratio of 0.13% is much lower than its category average of 0.51%, which makes the fund a reasonable investment in its category. XLK’s POWR Ratings reflect this promising outlook. It has an overall rating of “Strong Buy” with a grade of “A” in Trade Grade, Buy & Hold Grade, Peer Grade and Industry Rank. Among the 94 ETFs in the Technology Equities ETFs group, it’s ranked #2. SPDR Select Sector Fund – Consumer Discretionary (XLY) This ETF aims to provide investment results that correspond generally to the price and yield performance of the S&P Consumer Discretionary Select Sector Index. XLY pays an annual dividend of $1.53 which yields 1.02% and the fund has grown by about 70% since its March lows. XLY has exhibited a solid performance, surpassing the S&P 500 year-to-date. XLY has a year-to-date gain of 21.1% as compared to SPDR S&P 500’s (SPY) gain of 9.6%. The fund has returned 27.3% over the past year and 20.5% year-to-date. Some of XLY’s top holdings are Amazon.com, Inc. (AMZN), Home Depot, Inc. (HD), McDonald’s Corporation (MCD) and Nike Inc. (NKE). The total number of holdings in the fund is 64. XLY’s expense ratio of 0.13% is lower than its category average of 0.46%, making it a low-cost option to invest in the consumer discretionary sector. The ETF has an AUM of $16.18 million. It’s no surprise that XLY is rated a “Strong Buy” in our POWR Ratings system. It also has an “A” for Trade Grade, Buy & Hold Grade and Industry Rank, and a “B” for Peer Grade. In the 42-ETF Consumer-Focused ETFs group, it is ranked #1. VanEck Vectors Semiconductor ETF (SMH) SMH uses an investment approach that aims to replicate the price and yield performance of the Market Vectors US Listed Semiconductor 25. The fund tracks the performance of 25 largest US-listed semiconductor companies and has an equal distribution of investment in mid, large and giant cap companies. SMH has added more than 55% to its price since hitting lows in March. The semiconductor industry has been one of the major beneficiaries of pandemic-driven digital transformation. The industry is poised to benefit further from the developments in graphics processing, 5G networks, artificial intelligence as well as the Internet of Things which all require chips. As a result, SMH should keep moving higher. SMH pays an annual dividend of $2.12 which yields 1.21%. Some of SMH’s top holdings are Taiwan Semiconductor Mfg. Co. Ltd. (TSM), NVIDIA Corporation (NVDA), Intel Corporation (INTC) and Advanced Micro Devices, Inc. (AMD). SMH has also been performing pretty well amid the geopolitical and health uncertainties. SMH has an AUM of $2.82 million and a NAV of $175.73. SMH has returned 55.6% over the past year and 18.9% over the past three months. The fund’s expense ratio of 0.35% is lower than its category average of 0.51%, making it a low-cost option to bet on right now. SMH’s portfolio includes a total 26 stocks. SMH is rated “Strong Buy” in our POWR Ratings system, consistent with its well-balanced portfolio. It also has an “A” for Trade Grade, Buy & Hold Grade and Industry Rank. It is also ranked #14 out of 94 ETFs in the Technology Equities ETFs industry. Want More Great Investing Ideas? 7 Best ETFs for the NEXT Bull Market Beware Stocks in September? 9 “BUY THE DIP” Growth Stocks for 2020 VOO shares were trading at $323.19 per share on Tuesday afternoon, up $2.17 (+0.68%). Year-to-date, VOO has gained 10.34%, versus a 10.40% rise in the benchmark S&P 500 index during the same period."}]}