{"article": [{"url": "https://stocknews.com/news/rh-fnd-hvt-hoft-4-retailers-thriving-due-to-the-hot-housing-market/", "published": 1600085300.0, "headline": "4 Retailers THRIVING due to the HOT Housing Market", "body": "The pandemic has drastically changed the lifestyle of people. Working and learning have shifted online to comply with social distancing guidelines. Office meetings and classes are taking place virtually. It’s also resulted in economic activity dropping in so many areas of the economy like travel, restaurants, and nightlife. And some of this is spilling over into other parts of the economy. The two most noticeable impacts are an explosion in online spending and strength in the housing market. Housing has been strong as many people are choosing to leave urban areas for the suburbs. The trend has also been strengthened by historically low mortgage rates and low housing supply. The pandemic and rising home prices have also led to people spending on upgrading their homes. 7 \"SAFE HAVEN\" Dividend Stocks for Turbulent TimesConsequently, furniture and home improvement stocks like RH (RH), Floor & Décor Holdings, Inc. (FND), Haverty Furnitures Company, Inc. (HVT), and Hooker Furniture Corporation (HOFT) should keep witnessing revenue and earnings growth. RH (RH) RH, a luxury brand in the home furnishings marketplace, offers furniture, lighting, textiles, bath-ware, décor, outdoor and garden, as well as baby & child products. Formerly known as Restoration Hardware, RH operates through two segments – the RH segment and Waterworks. It distributes its products through physical stores, websites, and Source Books. RH has opened several galleries in the past couple of months, to boost physical sales across the country. As the demand for home furnishing products is rising amid the pandemic for comfortable indoor stays, RH managed to generate profits during the economic slowdown. RH CEO Gary Friedman expects the systemic shift in consumer spending towards home décor to last for the next 2 years or more. RH’s total demand increased 16% year-over-year in the second quarter ended August 2020, with RH’s core demand rising 24% year-over-year. Adjusted net revenues increased slightly from the year-ago value to $709.70 million, while adjusted net income rose 72% from the same period last year to $123 million. RH’s demand growth is expected to bolster earnings in the third quarter ending October 2020, as the work-and-learn from home culture is here to stay. The consensus EPS estimate of $4.71 indicates a 68.8% rise year-over-year. Moreover, the company beat the street EPS estimates in each of the trailing four quarters, which is impressive. The consensus revenue estimate of $808.42 million indicates a 19.3% rise from the same period last year. RH has gained more than 460% since hitting its 52-week low of $73.14 in March. The stock hit its 52-week high of $410.49 in September. How does RH stack up for the POWR Ratings? A for Trade Grade B for Buy & Hold Grade A for Peer Grade A for Industry Rank B for Overall POWR Rating. It is currently ranked #20 out of 68 stocks in the Home Improvement & Goods Industry. Floor & Décor Holdings, Inc. (FND) FND manufactures and sells hardware surface flooring and related accessories for do-it-yourself customers, commercial businesses, and professional installers. Apart from a retail chain of stores across the country, FND also sells its products through its website. The COVID-19 pandemic hampered FND’s sales significantly, as evident from its second-quarter earnings. However, the slowdown in business operations is expected to blow over by the third quarter, as analysts estimate EPS to grow 40.7% year-over-year to $0.38 for the quarter ending September 2020. Also, FND has an impressive earnings surprise history, as it beat the street EPS estimates in each of the trailing four quarters. FND’s revenue grew at a CAGR of 19.8% in the past three years, and diluted EPS increased at a CAGR 26.6% over the same period. Net income rose at a CAGR of 32.5% over the past three years as well. FND has gained more than 210% since hitting its 52-week low of $24.36 in March. The stock hit its 52-week high of $76.34 in September. FND strong fundamentals are reflected in its POWR Ratings. It is rated a “Strong Buy” with an “A” for Trade Grade, Buy & Hold Grade, Peer Grade, and Industry Rank. In the 68-stock Home Improvement & Goods industry, FND is ranked #9. Haverty Furnitures Company, Inc. (HVT) HVT is a specialty retailer of residential furniture and mattress assortment across the United States. It has numerous physical stores spread across the country as well as a company website for online sales. HVT’s net income rose 125.6% year-over-year to $13.64 million in the second quarter ended June 2020, as the demand for furniture increased during the stay-at-home norm. EPS grew 148.2% from the same period last year to $0.72. HVT’s capital turnover is better than almost 80% of the U.S. stocks in the StockNews.com universe. The consensus EPS estimate of $0.63 for the third quarter ending September 2020 indicates a 103.2% rise year-over-year. The consensus revenue estimate of $230.03 million indicates an 8.5% increase from the year-ago value. HVT gained more than 130% to hit its 52-week high of $22.76 in August since hitting its 52-week low of $9.81 in March. It’s no surprise that HVT is rated a “Strong Buy” in our POWR Ratings system, with a grade of “A” in Trade Grade, Peer Grade and Industry Rank, and a “B” in Buy & Hold Grade. It is also ranked #14 out of 68 stocks in the Home Improvement & Goods industry. Hooker Furniture Corporation (HOFT) HOFT is a retail manufacturer of residential and commercial furniture across North America. It operates through three main segments — Hooker Branded, Home Meridian, and Domestic Upholstery — and sells products under three categories, namely case goods furniture, upholstered furniture, and other products. HOFT reported a profitable second quarter. Net income grew 38.8% year-over-year to $1.60 million. Operating income rose 30.2% from the year-ago value to $7.51 million. The consensus EPS estimate of $0.62 for the third quarter ending October 2020 indicates an 87.8% improvement year-over-year. HOFT has gained more than 135% since hitting its 52-week low of $12.30 in March. The stock hit its 52-week high of $29.16 in September. HOFT is rated “Strong Buy” in our POWR Ratings system, with an “A” in Trade Grade, Buy & Hold Grade, Peer Grade, and Industry Rank. Out of 68 stocks in the Home Improvement & goods industry, it is ranked #16. Want More Great Investing Ideas? 7 Best ETFs for the Next Bull Market Is the Stock Market Correction Over? Chart of the Day- See the Stocks Ready to Breakout RH shares were trading at $372.54 per share on Monday afternoon, down $8.91 (-2.34%). Year-to-date, RH has gained 74.49%, versus a 6.28% rise in the benchmark S&P 500 index during the same period."}]}