{"article": [{"url": "https://stocknews.com/news/slv-paas-ag-silver-approaching-important-level/", "published": 1601381300.0, "headline": "Silver Approaching IMPORTANT Level", "body": "It’s been a nasty couple of weeks for silver investors (SLV) as the calls for $40.00/oz and $50.00/oz silver by year-end are now looking like a distant memory as the metal fights to reclaim the $25.00/oz level. While most markets finally rebounded from their post-FOMC meeting swoons last week, silver took another leg down, plunging by 15% to settle below $24.00/oz. This sharp drop put a significant dent in the short-term picture for silver, and the level of fear we’ve seen hasn’t been anywhere near proportionate to the decline. While I will remain bullish long-term for silver as long as $21.50/oz is defended on a monthly close, the bulls are going to need to start playing defense immediately. 9 \"BUY THE DIP\" Growth Stocks For 2020(Source: Daily Sentiment Index Data, Author’s Chart) As noted, a little over a month ago, things were getting far too frothy in the silver space with several of the usual suspects trotting out their $40.00/oz and $50.00/oz targets at precisely the wrong time. Elsewhere in the sector, First Majestic Silver (AG) even went as far as holding back much of its silver from sales in Q2, a bold move given that the silver price was up over nearly 70% in three months. While this turned out to be the right move, it said a lot about sentiment, as it’s very rare for producers to deviate from their business plan and speculative on metals prices at the expense of their quarterly results. Bullish sentiment readings corroborated this speculative frenzy in the metal we were seeing, with silver hitting a reading of 97% bulls in early August. Generally, parabolic rises do not end with shallow pullbacks, but usually, violent ones, precisely what we’ve seen since. However, despite the 27% correction from the highs, we still don’t have what I would consider a complete wash-out in sentiment. As we can see above, the past two 20% plus corrections in silver saw bullish sentiment fall below 15% bulls, and we’re currently sitting at 31%. While we don’t need to revisit these levels and it’s certainly possible last week’s correction was the low, sentiment remains mixed in terms of confirming a low. This is because we generally see bullish sentiment drop beneath 10% bulls after we’ve seen a 25%+ correction, and we haven’t seen bullish sentiment drop anywhere near this far yet. Bullish sentiment for gold (GLD) is lower than bullish sentiment for silver, even though it’s suffered a much less sharp correction (11% vs. 27%). Ideally, to confirm a bottom in silver, I would prefer to see sentiment head closer to single-digit levels. (Source: TC2000.com) From a technical standpoint, the good news is that the bulls managed to play defense at $21.50/oz support as the metal back-tested its multi-year breakout. Typically, breakouts of this magnitude rarely fall back inside the base, and this means that the $21.50/oz level should hold. However, we may need to re-test this low to completely wash-out sentiment before this correction has entirely run its course. Therefore, while a bounce is possible like we’re currently seeing, I wouldn’t get too excited unless the rally manages to get above $27.00/oz. As we can see, we have strong resistance now sits at $26.40/oz on a weekly close, and the bears should put up a fight here to keep a lid on the metal. (Source: TC2000.com) So, what’s the best course of action here? I believe that last week’s correction below $22.00/oz was an opportunity to selectively nibble on the best silver miners, and also the metal, but I wouldn’t be in a rush to pay more than $22.50/oz for silver and chase it here closer to $24.00/oz. Currently, bullish sentiment is suggesting a re-test of last week’s lows would not be surprising, and we rarely see a V-shaped bottom after a decline of this magnitude. This means that while the bulls control the big picture as long as $21.50/oz is defended, they’ve completely lost control of the intermediate picture with a strong resistance level stacked overhead where many trapped buyers are sitting. As long as silver remains above $21.50/oz, I will remain bullish long-term, but I have not started any new positions yet, other than increasing my cost basis in Pan American Silver (PAAS) to closer to $29.00. Disclosure: I am long GLD, PAAS Disclaimer: Taylor Dart is not a Registered Investment Advisor or Financial Planner. This writing is for informational purposes only. It does not constitute an offer to sell, a solicitation to buy, or a recommendation regarding any securities transaction. The information contained in this writing should not be construed as financial or investment advice on any subject matter. Taylor Dart expressly disclaims all liability in respect to actions taken based on any or all of the information on this writing. Want More Great Investing Ideas? 7 “Safe-Haven” Dividend Stocks for Turbulent Times When Does the Next Bull Run Start? Chart of the Day- See the Stocks Ready to Breakout SLV shares were trading at $22.38 per share on Tuesday afternoon, up $0.36 (+1.63%). Year-to-date, SLV has gained 34.17%, versus a 4.67% rise in the benchmark S&P 500 index during the same period."}]}