{"article": [{"url": "https://stocknews.com/news/ung-why-has-natural-gas-been-so-volatile-will-it-continue/", "published": 1600949300.0, "headline": "Why has Natural Gas Been So Volatile? Will it Continue?", "body": "The market expected an 84 bcf injection into storage Next week inventories should climb above the 2019 peak Natural gas falls like a knife after the late August high and then soars like an eagle- Volatility creates a trading paradise Since trading to a high of $2.743 per MMBtu in late August, natural gas moved back into bearish mode. This week, the price not only slipped below the $2 level but probed under $1.80 per MMBtu. The over 91.5% recovery evaporated. Hurricanes in the Gulf States and other factors pushed the price of the energy commodity to its highest price of the year at the end of the summer, but the high level of inventories caused selling to emerge and drove the price to this week’s low. After hitting the most recent low on September 21, the price turned around and exploded to over $2.20 just two days later on September 23. On Thursday, September 24, the Energy Information Administration reported stockpile data for the week ending on September 18. Stocks are now close to the peak from November 2019 at the beginning of the peak season for demand and could be heading for record territory. The United States Natural Gas Fund (UNG) is the ETF product that follows the price of the energy commodity higher and lower. The market expected an 84 bcf injection into storage 7 \"SAFE HAVEN\" Dividend Stocks for Turbulent TimesAccording to Estimize, a crowdsourcing website, the market’s consensus was for an 84 billion cubic feet injection into storage for the week ending on September 18. (Source: EIA) As the chart highlights, the injection was below the market’s expectations at 66 bcf. Total stocks stood at 3.680 trillion cubic feet as of September 18, 15.9% above last year’s level, and 12.4% over the five-year average. It was the twenty-fifth consecutive week where the percentage above last year declined. Next week inventories should climb above the 2019 peak There are only eight weeks left in the 2020 injection season. Last year, the peak in inventories going into the winter season was 3.732 tcf. An injection of more than 52 bcf next week would push stockpiles above last year’s high. Reaching the four trillion market requires an average rise of 40 bcf for the rest of the injection season, which appears likely. A rise to over four tcf would only be the third time stocks rose above that level since the EIA began reporting inventory data. Meanwhile, the price action in natural gas has been a wild ride over the past weeks. The energy commodity rose to a new high for 2020 in late August before the price fell off the side of another bearish cliff. Natural gas falls like a knife after the late August high and then soars like an eagle- Volatility creates a trading paradise After rising from $1.432 in late June to $2.743 in late August, it took only half that time for the price to drop back below the $1.80 per MMBtu level on the nearby October futures contract. (Source: CQG) After the over 91.5% rise in the price of the continuous futures contract, it took under one month for the price to drop to a low of $1.795 on September 21. The decline of 34.6% was short-lived as the price was back above the $2.20 per MMBtu level two days later. After the latest inventory data from the EIA, natural gas was probing above the $2.30 level. Increased demand for LNG exports and lower production as the rig count fell from 148 last year to 73 as of September 18 caused the price to stabilize and not revisit the lows from late June. Natural gas futures on NYMEX are rolling from October to November. The spread between the two contracts is a sign of both high levels of nearby supplies and bullish sentiment for the coming winter season. (Source: CQG) The chart of November minus October natural gas futures on NYMEX shows that the spread reached a high of 85.6 on September 21, the day that October futures traded below the $1.80 level. The rally in the expiring contract took the spread down to near the 60 cents level on September 24 after the release of the latest EIA data. Meanwhile, the spread remains at an elevated level with November futures trading around the $2.85 level. January is the peak of the heating season, and the first contract of 2021 was at the $3.38 level on Thursday. The high in natural gas in November 2019 was at $2.905 per MMBtu, which is the level of technical resistance for the nearby contract. With inventories heading for the four trillion cubic feet level, a price above $3 is at an elevated level. With stocks moving towards record levels going into the peak season, production declining, and demand for LNG rising, we will likely see price volatility continue. Moreover, the November 3 US election will determine the futures of US energy policy, which is the most significant macroeconomic factor for the price of the energy commodity over the coming months and years. Want More Great Investing Ideas? 7 “Safe-Haven” Dividend Stocks for Turbulent Times When Does the Next Bull Run Start? Chart of the Day- See the Stocks Ready to Breakout UNG shares were trading at $12.80 per share on Thursday morning, up $0.21 (+1.67%). Year-to-date, UNG has declined -24.08%, versus a 1.86% rise in the benchmark S&P 500 index during the same period."}]}