{"article": [{"url": "https://stocknews.com/news/gkos-kala-ocul-3-healthcare-stocks-you-should-keep-an-eye-on/", "published": 1596456500.0, "headline": "3 Healthcare Stocks You Should \"Keep an Eye\" On", "body": "If you are struggling to predict the course of the stock market, you’re not alone. We are living through one of the more tumultuous eras in human history, yet the market continues to inch upward in quite a surprisingly steady manner. There is much discussion as to which stock market sectors are relatively safe. Some point to precious metals as safe havens. Others insist the technology is the only current sure bet. However, it appears that healthcare is a relatively safe place to park hard-earned money as the pandemic pays out. If you are willing to tolerate the slight risk posed by healthcare stocks, you might emerge from this period of market undulation with a sizable profit. Savvy investors should give serious consideration to these three intriguing publicly-traded eye care companies: Glaukos Corporation (GKOS), Kala Pharmaceuticals (KALA), Ocular Therapeutix (OCUL), and EyePoint Pharmaceuticals (EYPT). 9 \"BUY THE DIP\" Growth Stocks For 2020Glaukos Corporation (GKOS) No matter what direction the economy goes in the near future and across posterity, ophthalmic medical technology will still be in significant demand. After all, we all need a pair of functioning eyes to enjoy life to the fullest. GKOS works to create and commercialize novel surgical devices along with therapies for the treatment of glaucoma. In our exclusive POWR Ratings, GKOS has an A for Industry Rank and is ranked near the top half of the Medical – Devices & Equipment industry. Currently, GKOS is priced at slightly more than half of its 52-week high of $79.97. However, the stock has steadily climbed upward since dipping to $25 in March. GKOS is likely to beat earnings in the quarter to come, setting the stage for a meaningful uptick as we transition to the end of summer. Kala Pharmaceuticals (KALA) Nanotechnology will make waves in the future as tiny computers delve into the human body to reveal health and wellness information. Diminutive computer chips will even be used for medical operations. KALA creates and commercializes therapeutics with nanoparticle technology. KALA’s drugs are delivered into mucosal tissue within the eyes and the lungs and other parts of the body. The POWR Ratings reveal KALA has an Industry Rank of A. The average analyst price target is $21.50, which 137% higher than its current price. Out of the half dozen analysts who have studied the stock, every one of them rates it as a Buy. KALA progressed upward since spring, reaching $13 at the start of summer only for profit-taking to bring the stock down below $10. Look for a potential bounce back in the weeks and months to come. Ocular Therapeutix (OCUL) A wide array of technologies are emerging to improve human health, including ophthalmology. OCUL relies on hydrogel technology to help those with ocular health challenges. This Bedford, MA based company has fantastic POWR Ratings grades. OCUL has a grade of A in Peer Grade and Trade Grade, and a B in Buy & Hold Grade and Industry Rank. OCUL is ranked #42 out of 338 Biotech stocks. Analysts remain bullish on OCUL, setting an average price target of $12.67. Over the last year, OCUL has had a relentless upward trend that is likely to continue for the rest of the year. OCUL’s Dextensza product that treats eye inflammation in the aftermath of eye surgery has proven to be quite the success story. This is meaningful as the existing market for treating pain stemming from eye surgery is sizable. OCUL’s Dextenza product may eventually rake in $500 million or possibly even a billion dollars. Want More Great Investing Ideas? 9 “BUY THE DIP” Growth Stocks for 2020 How HIGH Can This Tech Bubble Fly? 7 “Safe-Haven” Dividend Stocks for Turbulent Times GKOS shares were trading at $46.84 per share on Monday afternoon, up $3.14 (+7.19%). Year-to-date, GKOS has declined -14.01%, versus a 3.17% rise in the benchmark S&P 500 index during the same period."}]}