{"article": [{"url": "https://stocknews.com/news/ccxi-adus-uis-itri-4-small-caps-ready-to-surge/", "published": 1594814900.0, "headline": "4 Small Caps Ready to Surge", "body": "Over the past decade, small caps have underperformed large-cap stocks. Historically, asset class performance has been mean-reverting. This means that longer periods of underperformance are followed by equal amounts of outperformance. Thus, investors should examine the universe of small-cap stocks, if they are interested in finding the next big winner. Small-cap stocks have more potential for growth and upside. They are often neglected simply because most investors are focused on bigger stocks. But, this is disinterest also creates an opportunity to find strong companies. With market capitalizations between a couple hundred million and a couple billion, small caps might not make the headlines yet they are certainly worthy of your attention. 9 \"BUY THE DIP\" Growth Stocks For 2020Below, we provide a look at four intriguing small-cap stocks every investor should consider adding to his or her portfolio: ChemoCentryx (CCXI) Biopharma companies are somewhat of a safe haven as we move deeper into the current recession. CCXI is a biopharma small-cap making significant headway in the oral administration of small molecule therapies that treat inflammatory diseases, autoimmune disorders, and cancer. It has a number of products in clinical trials that could turn the stock into a mid-cap if they are successful. CCXI has seen a steady increase in institutional ownership and is held in size by a number of specialized biotech funds with a track record of success like RA Capital and Consonance Capital Management. The POWR Ratings show CCXI has a Buy rating with As in each POWR Component but for a B Buy & Hold grade. CCXI is ranked in the top 40 of all 338 stocks in the Biotech category. CCXI’s average analyst price target is $72.57, which is 24% above current prices. Itron (ITRI) Water is now a common topic of discussion in investing circles as the global population swells and access to potable water becomes that much more challenging.ITRI works in unison with water utilities to make the most of their water services. As an example, ITRI measures and analyzes water use to facilitate the most efficient use of this valuable commodity. The company does the same with electricity for electricity providers. ITRI’s services will only become that much more important as the world’s population continues to boom and finite resources dwindle. ITRI’s long-term growth rate of 17.5% outpaces that of the utility sector. Its revenues are stable since it services utilities. The POWR Ratings show ITRI has respectable Buy & Hold and Peer grades along with a top-10 industry rank out of 35 stocks in the Industrial – Services sector. The analysts have set a price target of $77.17 for ITRI, who are mostly bullish on the stock. Addus HomeCare (ADUS) In-home personal care is quickly becoming quite important as the baby boomer age cohort transitions to the golden years. Most baby boomers are hesitant to consider an assisted living facility or a nursing home. This means the in-home care services provided by ADUS will prove even more important in the months and years to come. ADUS has nearly 35,000 employees who care for seniors at their homes. ADUS has a long-term growth rate target of 15%, a figure that could move even higher as the aging population steadfastly refuses to enter assisted care living facilities in an effort to avoid contracting the virus. Staying in one’s home also helps maintain in-person contact with friends and family (while social distancing, of course). The POWR Ratings show ADUS has B grades in each POWR Component but for its Trade grade of C. The average analyst price target for ADUS is $104, indicating it has nearly 20% upside. All in all, five analysts recommend buying ADUS while none recommend holding or selling. Unisys Corp (UIS) It is not often you find a reasonably priced small-cap tech stock like UIS. UIS provides information technology consulting services including outsourcing, digital security, network solutions and data analytics. UIS has not yet returned to its pre-COVID trading level of $16 to $18. The stock bounced back to the $10 to $12 level after temporarily dipping down to $8 and change in mid-March. UIS is an interesting turn-around opportunity. It has a forward price to earnings of 5, indicating a very reasonable valuation. Want More Great Investing Ideas? 9 “BUY THE DIP” Growth Stocks for 2020 Top 5 WINNING Stock Chart Patterns 7 “Safe-Haven” Dividend Stocks for Turbulent Times CCXI shares were trading at $59.35 per share on Wednesday morning, up $0.75 (+1.28%). Year-to-date, CCXI has gained 50.06%, versus a 1.38% rise in the benchmark S&P 500 index during the same period."}]}