{"article": [{"url": "https://stocknews.com/news/spy-aapl-tsla-3-things-all-investors-need-to-know-about-the-election/", "published": 1597752500.0, "headline": "3 Things All Investors Need To Know About The Election", "body": "The S&P 500 is having the strongest 100-day rally in US market history. And could potentially smash the previous record of the fastest bear market recovery (just over 100 days vs 310 set in 1967-1967). In 94.4% of such 100-day rally such as this, coming off correction lows, the market has posted impressive 12-month forward returns. Does that mean that stocks have clear sailing to not just new record highs and beyond? Actually no, because we continue to face numerous short-term risks including the pandemic the potential for a double-dip recession an ongoing trade war the threat of an unexpected surge in inflation election uncertainty 9 \"BUY THE DIP\" Growth Stocks For 2020In this two-part series, I want to discuss the presidential election that is now less than 80 days away. Specifically, I wanted to highlight the three most important facts investors need to know, not just from the perspective of who is most likely to win and what that means for important corporate fundamentals like regulations and tax rates, but how to protect your portfolio from the potential chaotic uncertainty that might be coming in the next few months. Biden Is Favored to Win the White House The media loves to shower us with national head to head polls to show who, at any moment in time, is leading in the Presidential race. (Source: Real Clear Politics) While these are fun for political junkies to track, they don’t represent anything meaningful since the electoral college, not the popular vote decides who becomes president. In order to have a reasonable idea of who is actually leading, and more importantly, likely to win in November we need a far more advanced model that factors in individual swing states (Trump’s 2016 victory was due to 77K votes in 3 states) the stability of polls over time in each state how changes in one state might affect polls in other key states Fivethirtyeight.com has the most advanced and historically accurate election forecasting models available since 2008. For example, not only did they correctly predict Obama’s 2008 and 2012 wins, but they were the most accurate at forecasting the potential for President Trump’s 2016 upset. Where other forecasting models gave Trump a 2% to 10% chance of victory on the eve of the election, FiveThirtyEight’s gave him a 30% probability of an upset due to higher than normal amount of undecided middle-class swing state voters. Their model is updated daily as new state and national polls come in and use 40,000 daily simulated elections to estimate the probability of the victory of either Biden or Trump. (Source: Fivethirtyeight.com) Currently, Biden is the 72% probability favorite to win in November and his chances have ranged from 69% to 79% since June 1st. Of course, that doesn’t necessarily mean that he will win, any more than Trump’s 30% estimated chances in November 2016 meant he had no hope of pulling off a surprising victory. A 30% probability means just that. In 7/10 elections a candidate will lose but in 3/10 elections he’ll win. My role with any article is not to tell you whether or not it’s good that something is likely to happen but what that means for your portfolio and long-term plans. And while the media may understandably be obsessing over who becomes “the most powerful man in the world” in a few months, the simple fact is that who wins the White House is actually far less important than who wins the Senate. Who Controls Congress Matters Is Generally Far More Than Who Sits in the White House Every person running for President promises the sun, moon, and stars to get people to vote for them. Bernie Sanders, for example, in an effort to win the Democratic nomination, promised $97 trillion worth of “free” programs over the next decade. Candidate Trump in 2016 promised to build a border wall with Mexico and make that country pay for it, slash taxes and regulations, redo NAFTA, and threatened up to 45% tariffs on all Chinese goods if Beijing didn’t seriously change its trade practices with the US. With the exception of certain issues (like trade policy), Congress has to actually pass the legislation to fulfill campaign promises. For example, the Constitution grants the House the power of the purse and so any spending bills or tax changes must begin in the House. Here’s how the current House looks: (Source: House.gov) The Democrats currently hold a 34 seat majority. Every single election every house seat is up for grabs, and here’s how the consensus of the four leading political analyst firms thinks the 117th House election is looking. (Source: 270towin.com) Due to Gerrymandering and the power of incumbency, very few Congressional races are ever that competitive. Today 25 races look like they might go either way. That’s merely the consensus. Here’s how each of the leading political analysts believes the 2020 House races look. Sabato’s Crystal Ball: 13 competitive races Cook Political Report: 28 competitive races Politico: 27 competitive races Niskanen Center: 12 competitive races With the current Democratic majority at 34, and none of the leading political analysts thinking that these many races are up for grabs, it’s highly unlikely that the GOP has a chance to retake the House. This means that the Senate will be the firewall for GOP hopes of stopping Biden from enacting most of his proposed policies. How the Battle for the Senate Is Looking Currently, the Senate is 47 Democrats or Independents that caucus with them, and 53 Republicans. With the Vice President the tie-breaking vote in the event of a tie, 3 net pickups are required for the Senate to flip blue. (Source: 270towin.com) The consensus is that there are six competitive Senate races. Alabama is a very challenging state for the Democrats because it leans so heavily Republican. It’s expected to represent a loss for the Democrats who thus would need four picks out of the remaining six races to get 50 seats and thus control over the Senate if Biden wins as he’s currently favored to. How are those six races looking right now? Well unfortunately for those craving certainties, Senate races, especially in relatively smaller states like IA and MT, are not nearly as plentiful as Presidential polls. But, here are the latest polls from six Senate races that the analyst consensus considers competitive and most likely to decide who controls that legislative body. (Source: Real Clear Politics) If the election were today, and the average polling data proved to be the ultimate outcome then the GOP would end up controlling the Senate with a 51 seat majority, with the Democrats picking up a net two seats. However, Colorado hasn’t had any polls done, and thus should Cory Gardner lose, then that could be enough for the Democrats to win four of these six races and gain control of the chamber. That’s the state of the race today, very close, and a nailbiter that is likely to be potentially far more important for future federal policy than the Whitehouse itself. In part two of this series, I’ll explain precisely what the outcome of the election is likely to mean for the economy, corporate profits, and the stock market, no matter the final outcome. Most importantly I’ll show you the smartest way to protect your retirement portfolio from the election uncertainty that we’re facing over the coming months. Want More Great Investing Ideas? The Best of StockNews 3 Possible Directions for the Stock Market from Here 9 “BUY THE DIP” Growth Stocks for 2020 SPY shares were trading at $338.62 per share on Tuesday afternoon, up $0.71 (+0.21%). Year-to-date, SPY has gained 6.29%, versus a % rise in the benchmark S&P 500 index during the same period."}]}