{"article": [{"url": "https://stocknews.com/news/sedg-run-vslr-3-solar-stocks-making-all-time-highs/", "published": 1595333300.0, "headline": "3 Solar Stocks Making All-Time Highs", "body": "In recent years, when the price of oil plummeted, the price of solar stocks would follow. The premise is that if oil prices drop, there is less demand for investing in alternative energy. That’s not the case this year. Solar stocks have been performing well, even in the face of a construction slowdown. The growth in solar energy has been primarily driven by climate change groups and activists demanding an end to the use of fossil fuels for energy. In addition, financing costs are also providing a growth catalyst for solar stocks. With interest rates so low, consumers can buy solar installations without taking on too much debt. Here are three solar stocks that are making all-time highs. 9 \"BUY THE DIP\" Growth Stocks For 2020SolarEdge Technologies, Inc. (SEDG) After hitting its year-to-date low of $67.02 on March 23, 2020, SEDG, the global leader in solar energy technology, entered a momentum rally and hit an all-time high of $178.30 yesterday. The stock’s gain of more than 160% over this period trounces the S&P 500’s return of 40%. This solid momentum can be partly attributed to SEDG’s recent progress. The company, which has more than 1.3 million monitored solar systems in 130 countries, announced earlier this year that it received certification from Japan Electrical Safety and Environment Technology Laboratory for its award-winning single-phase inverter with HD-Wave technology. This will help SEDG grow its footprint in the Japanese PV market. The company also entered into a four-year pan-European contract to supply smart energy products and solutions, including inverters and power optimizers for 1 GW of solar projects with international solar investor, Enfindus. Over the past twelve months, SEDG has reported earnings growth of 79.1%, putting it ahead of 86.8% of US stocks in our universe. While the company missed the consensus EPS estimate in the first quarter of 2020, it surpassed the estimates of the prior three quarters. Moreover, SEDG’s earnings are expected to grow 20% per year over the next five years. While the stock is still hovering around its high, SEDG’s ability to attract investor attention based on its underlying strength should help it hit new highs. How does SEDG stack up for the POWR Ratings? A for Trade Grade A for Buy & Hold Grade B for Peer Grade B for Industry Rank A for Overall POWR Rating The stock is also ranked #1 out of 14 stocks in the Solar industry. Sunrun Inc. (RUN) RUN has also skyrocketed since the coronavirus-led sell-off. Since hitting its 52-week low of $7.84 in mid-March, shares of this leading US residential solar installer gained more than 375% to hit an all-time high of $39.83 yesterday. At the beginning of this month, Sunrun’s announcement to acquire its rival Vivint Solar (VSLR) in a $3.2 billion deal, with the expectation that the combined company will reach more American households is undoubtedly a catalyst. Moreover, in June 2020, RUN and Orange & Rockland (O&R) jointly received approval to deploy rooftop solar and battery systems as part of an innovative virtual power plant project supporting New York’s transition to clean, reliable, locally generated electricity. RUN’s launch of digital selling by making the process of going solar nearly contact-free for their customers, investments in technology platforms, and accelerated process improvements also made the stock more attractive. According to RUN’s Chief Executive Officer and co-founder Lynn Jurich, the company’s orders reached a single-day all-time high at the end of April. The consensus EPS estimate for RUN’s June’s quarter end of $0.06 is higher than its loss of $0.01 a year ago. Moreover, the company’s earnings are expected to grow 37.2% annually over the next five years. RUN has a “Strong Buy” rating in the StockNews.com POWR Ratings. Among the POWR components, it has also an “A” for Trade Grade, Buy & Hold Grade and Peer Rank, and a “B” in Industry Rank. The stock is ranked #2 in the Solar industry. Vivint Solar, Inc. (VSLR) VSLR has also gained solid momentum since the March sell off. Gaining more than 580% since hitting its 52-week low of $3.17, the shares of this leading residential solar panel and module manufacturer recorded an all-time high of $21.93 today. Much of this price gain can be attributed to RUN’s offer of $20.16 per-share. Under the terms of the agreement, VSLR shareholders will be entitled to receive 0.55 shares of RUN common stock for each VSLR share that they own. Once closed, the combined company will emerge as a mega player in the solar market. In addition to an increase in sales, the market expects the combined company to generate annual profits. VSLR is rated a “Strong Buy” in our POWR Ratings system. It also has an “A” for Trade Grade, Buy & Hold Grade and Peer Rank, and a “B” for Industry Rank. It is ranked #3 out of 14 stocks in the Solar industry. Want More Great Investing Ideas? 9 “BUY THE DIP” Growth Stocks for 2020 Newly REVISED 2020 Stock Market Outlook 7 “Safe-Haven” Dividend Stocks for Turbulent Times SEDG shares were unchanged in after-hours trading Tuesday. Year-to-date, SEDG has gained 79.18%, versus a 2.07% rise in the benchmark S&P 500 index during the same period."}]}