{"article": [{"url": "https://stocknews.com/news/hfro-ead-bit-3-safe-monthly-dividend-funds-that-pay-at-least-9-1/", "published": 1597320500.0, "headline": "3 Safe Monthly Dividend Funds That Pay at Least 9.1%", "body": "If your dividend portfolio is like that of most investors I know, you’re probably getting paid quarterly. That’s too slow, especially for dividend payments that are most likely too low. Why not up that frequency to a monthly payout, and increase the total yield while we’re at it? The secret to monthly payouts that add up to 9.1%, 9.4% and even 10.8% yields per year is a simple three-letter acronym: C-E-F. 7 \"SAFE HAVEN\" Dividend Stocks for Turbulent TimesFor whatever reason, closed-end funds (CEFs) don’t have nearly the following that popular dividend-paying stocks boast. This “secret” is one of the last great efficiencies in an otherwise tough-to-beat market. And we contrarian income hounds will gladly take this edge… After all, it doesn’t make much sense that we can trade in our “dumb” stocks, ETFs and mutual funds for superior tickers that: Yield 9% or more annually, Pay their investors every month, and Trade at a discount to the assets they each own. I’m an “old school” stock picker who doesn’t like to pay full price for anything. With the broader market (somehow) at or near all-time highs, there aren’t many equities on sale. However, there are still some deals to be had in CEF-land. I’m talking about funds (some that hold stocks, others that hold bonds) that are trading at a discount to their intrinsic values. They’re monthly dividend funds, with their 12 payouts per year adding up to 9.1% to 10.8% yields at their current depressed prices. We’ll discuss a few of these opportunities in a moment, but first, let me show you one more way monthly dividend payers rise above—a lesson that’s especially pertinent given what we’ve experienced in 2020. My biggest gripe with traditional dividend stocks is the “lumpy” nature of their payments. You spend decades of your life getting the same paycheck month in and month out—but if you have a lopsided “dividend calendar,” some months can get pretty lean. Consider this $1 million 60/40 portfolio. The bond portion (40%) is in a high-asset total-return bond fund. Half of the stock portion (30%) is in a mix of broad-market equity funds, while the remaining 30% is split among six popular blue chips: Apple (AAPL), Boeing (BA), BP (BP), Disney (DIS), Ford (F) and McDonald’s (MCD). Unfortunately, many of these stocks and funds pay on the same quarterly schedule, so most of the income is bunched towards the end of each quarter: Regular Dividend Calendar Jan Feb Mar Apr May Jun Dividends $1,863 $1,253 $4,837 $1,559 $1,253 $4,837 Jul Aug Sep Oct Nov Dec Total Dividends $1,863 $1,253 $4,837 $1,559 $1,253 $4,837 $31,204 That’s annoying enough, but consider that four of these stocks have been caught by 2020’s dividend hatchet: Boeing, Disney and Ford suspended their payouts, and BP recently cut its dividend in half. Check out the sudden income drop shareholders were saddled with once June rolled around: Reduced Regular Dividend Calendar Jan Feb Mar Apr May Jun Dividends $1,863 $1,253 $4,837 $1,559 $1,253 $3,717 Difference $0 $0 $0 $0 $0 $1,120 Jul Aug Sep Oct Nov Dec Total Dividends $1,559 $1,253 $3,295 $1,559 $1,253 $3,295 $26,696 Difference $304 $0 $1,542 $0 $0 $1,542 $4,508 Plus, this portfolio’s 3.1% yield was lame enough in the first place! Let’s replace this quarterly mess with a similar-yielding portfolio that paid out monthly and hit the same kind of turbulence: Regular Monthly Dividend Calendar Jan Feb Mar Apr May Jun Dividends $2,600 $2,600 $2,600 $2,600 $2,600 $2,600 Jul Aug Sep Oct Nov Dec Total Dividends $2,600 $2,600 $2,600 $2,600 $2,600 $2,600 $31,200 It’s a smoother ride with monthlies, and we can make that even better by cherry-picking the payers with secure dividends. The best monthly dividend funds are vehicles we can keep our capital in for years, even decades, without worrying about a dividend drop. Of course, it’s even better when we can find these funds trading at a discount to their NAV (net asset value). Let’s start with a fund paying 10.8% and trading for just 68 cents on the dollar (thanks to its incredible 32% discount): Highland Income Fund (HFRO) Dividend Yield: 10.8% Discount to NAV: -31.7% Bargains this big don’t come around often. The Highland Income Fund (HFRO) is a CEF that seeks out income anywhere it can find it. (Highland has the proverbial “wide mandate” with HFRO.) Here’s a look at some of the investments this fund is willing to chase: Equities (public and private) Corporate bonds Convertible and preferred securities Floating-rate securities Real estate securities Secured and unsecured fixed-rate loans Mezzanine securities Structured products As of Q2’s end, HFRO even had a nearly 16% weighting in timber, entirely via preferreds in a Texas timberland real estate joint venture called Creek Pine Holdings, LLC. Shouldn’t we be giddy to get this kind of highly diversified income exposure and a double-digit yield at roughly 68 cents on the dollar? Normally, yes. But HFRO is a nonstarter for me, for two reasons: Highland Capital Management has been engaged in a court battle with Credit Suisse for years that included a surprise Texas Supreme Court ruling in April that pulled the rug out of much of the damages awarded to Highland by a lower court. It could get more from a settlement, but that’s not the point. Legal drama clouds the waters and can make any holding much more difficult to evaluate. HFRO simply doesn’t have a stellar track record. We typically gravitate toward CEFs that are much more established and can provide investors with long periods of outperformance. But Highland Income, which converted to a closed-end structure in late 2017, has shown only occasional flashes since then. Highland Income Might Recover, But Don’t Expect Much After That Let’s move on to a couple more proven CEFs. Wells Fargo Income Opportunities Fund (EAD) Distribution Rate: 9.1% Discount to NAV: -12.4% The Wells Fargo Income Opportunities Fund (EAD), like HFRO, also tries to provide a high level of income, but it does so in a much more conventional way: It invests in junk. More specifically, EAD is about 95% invested in not just high-yield bonds, but also junk-rated loans and preferred stocks. It’s willing to invest internationally, but 95% of its portfolio is U.S. at the moment. I do appreciate the industry diversification, though: five sectors with double-digit asset weights, and another three with high single digits. That, and a boatload of leverage (~24%), gets you more than double the performance of the iShares Core US Aggregate Bond ETF (AGG) and significantly better returns than the SPDR Bloomberg Barclays High Yield Bond ETF (JNK) over the long haul. Wells Fargo EAD: Better Than the Boring Bond Indices Wells Fargo is also cheaper than your average closed-end fund, with management and other non-interest expenses of 0.99%. The CEF average is well above 1%, and it’s not uncommon to find CEF expenses of 2%-4%. EAD is a solid fund. But, its current discount to NAV of 12.4% isn’t very far off its five-year average. When buying a fund on sale, I prefer to target situations where the discount window is likely to slam shut at some point. EAD’s has a habit of staying open. BlackRock Multi-Sector Income Trust (BIT) Distribution Rate: 9.4% Discount to NAV: -7.0% I could say the same about the BlackRock Multi-Sector Income Trust (BIT), whose 7% discount to NAV is actually smaller than its five-year average 10% sale price. But tuck this name away for a rainy day. If BIT becomes cheap again, it could be worth a bite. Young BIT Isn’t Taking Any Prisoners BlackRock Multi-Sector Income Trust is a newer CEF that launched in 2013. But unlike HFRO, it has rewarded shareholders who put their faith in the fund early on. BIT provides some pretty well-rounded fixed-income exposure. Junk debt is tops at a third of assets, but you also get investment-grade bonds, securitized products, developed-market sovereigns, EM debt and more. Its corporates touch on most of the market’s sectors. More than 20% of the portfolio is international. Maturities run the spectrum, from less than 1 year to more than 20. This CEF has even delivered a relative rarity anymore: a dividend increase. BlackRock Multi-Sector’s management saw fit to boost the payout by about 6% earlier this year, to 12.37 cents per share, paid each and every month. Want More Great Investing Ideas? Your Early Retirement Portfolio: 7.7% Dividends—Every Month—Forever How to Retire on 10% Dividends Paid Monthly The Simple (and Safe) Way to Earn 15% Every Year from Stocks HFRO shares . Year-to-date, HFRO has declined N/A%, versus a 5.73% rise in the benchmark S&P 500 index during the same period."}]}