{"article": [{"url": "https://stocknews.com/news/slb-oih-hal-xle-are-schlumberger-and-halliburton-too-cheap/", "published": 1597061300.0, "headline": "Are Schlumberger and Halliburton Too Cheap?", "body": "Only the strong will survive in the oil patch Schlumberger- A first-class company should continue to lead Halliburton- A respectable result in Q2 2020 Three reasons why these oil service companies will rebound Oil-related companies have been the redheaded stepchildren of the stock market long before the global pandemic weighed on equities earlier this year. Within the sector, the oil services companies have been the weakest. The VanEck Oil Services Sector ETF (OIH) holds shares in the leading companies that provide support to oil exploration and production companies. The OIH has an over 31% exposure to Schlumberger Ltd. (SLB) and Halliburton Company (HAL), the two leaders in the sector. While SLB and HAL face tough times, they are likely to survive while other services companies could face bankruptcy. Both companies have recovered from the March lows, but they remain at the lowest levels in years. SLB and HAL could be able to scoop up valuable assets from other companies at bargain-basement prices over the coming months. Now could be the perfect time to consider buying these two stocks at levels where risk-reward favors the upside. A few short weeks ago, Warren Buffett made a $10 billion investment when be purchased the transmission and pipeline assets of Dominion Energy (D). Warren bought energy assets at a low price. In the energy sector, the two leading oil services companies are still trading at prices that are beyond cheap. 7 \"SAFE HAVEN\" Dividend Stocks for Turbulent TimesOnly the strong will survive in the oil patch This year has been a nightmare for oil companies. However, the writing was on the wall long before the coronavirus spread around the world. The S&P 500 Energy Sector SPDR (XLE) reached a high of $101.52 per share in June 2014. Source: Yahoo Finance The price action in the product that holds many of the leading energy-related companies has been declining over the past six years. During the height of the risk-off period in March, it dropped to a low of $22.88, which was less than one-quarter of the price in 2014. Since then, the XLE recovered to the $37.18 per share level at the end of last week. Many companies in the oil and gas sector found themselves victims of the era of low-interest rates. The availability of inexpensive money encouraged high levels of borrowing, building up debt levels. The decline in energy prices choked off the ability to service the debt for many companies. As bankruptcies rise, assets will be on sale for pennies on the dollar. The sector leaders that survive the debt crisis in the energy patch will be positioned to pick up assets that will improve their ability to survive and thrive in the future. In the oil services sector, the price action has been even uglier than in the XLE. Source: Yahoo Finance The chart of the OIH oil services ETF product shows that it reached a split-adjusted high of $1525 per share in 2008 when the price of crude oil peaked at over $147 per barrel. The low in March 2020 was at $66, just 4.3% of the price at the high. After recovery to the $134 per share level at the end of last week, the OIHN was trading at less than ten cents on the dollar compared to its high a dozen years ago. Source: Yahoo Finance As the charts show, the OIH holds 31.36% of its $475.06 million in net assets in shares of Schlumberger (SLB) and Halliburton (HAL). The two companies are the best in the breed in the oil services sector. Schlumberger- A first-class company should continue to lead Schlumberger (SLB) had a market cap of $27.248 billion for $19.63 per share at the end of last week. The company pays shareholders a 2.6% dividend at its current share price. SLB provides technology for reservoir characterization, drilling, production, and processing to the oil and gas industry worldwide. SLB has been around since 1926 with its headquarters in Houston, Texas. Source: Yahoo Finance Over the past four quarters, SLB consistently beat analyst EPS estimates. The company reported earnings in each quarter. In the troubled second quarter of 2020, SLB reported a profit of five cents per share. The consensus estimate for Q3 is currently for earnings of 12 cents per share. SLB is the leader in oil services, and it should survive the current challenging period. Moreover, the company is in a position to scoop up assets at the lowest valuations in years. Source: Barchart At below $20 per share, SLB risk-reward favors the upside for the stock over the coming years. Halliburton- A respectable result in Q2 2020 Halliburton Company (HAL) has a market cap of $13.08 billion at the $14.89 per share level as of the end of last week. The company pays shareholders a 1.21% dividend at the current share price. HAL provides a range of services and products to oil and gas companies around the globe. The company has been in business since 1919 and also has its headquarters in Houston, Texas. Source: Yahoo Finance HAL has met or beat consensus earnings estimates over the past four quarters. During the treacherous second quarter of 2020, analysts expected HAL to lose 11 cents per share, but the company delivered a profit of five cents. The consensus estimate for Q3 is for an eight cents per share profit. Source: Barchart At below $14.89 per share on August 7, HAL is at a bargain price. Moreover, the market cap of just over $13 billion could make the company a takeover candidate for one of the leaders in the oil patch. Three reasons why these oil service companies will rebound I see significant value in SLB and HAL shares for three reasons. First, the cure for low prices in commodity markets is typically low prices. Production cuts by OPEC, Russia, and other world producers, and declining US output because of the price of oil and gas have worked to balance the supply and demand fundamentals for the market and lift the prices of the energy commodities over the past weeks and months. Crude oil has been consolidating at over the $40 per barrel level since early June. As demand begins to return to the markets, the need for the oil services provided by SLB and HAL is likely to rise. The second reason is the potential to pick up assets at very inexpensive levels from other oil services companies that do not survive as they have a mountain of debt. SLB and HAL could follow Warren Buffett’s lead and pickup up logistical assets that would put the companies in a better position to earn profits over the coming years. Finally, the falling dollar and rising deficits are likely to foster a rally in the commodities sector. Oil and gas are still the energy products that power the world. SLB and HAL are companies that provide services, technology, and products necessary for extracting the products from the crust of the earth in the US and worldwide. I believe that SLB and HAL shares have the potential to move significantly higher over the coming years. Three reasons why these oil service companies will rebound I see significant value in SLB and HAL shares for three reasons. First, the cure for low prices in commodity markets is typically low prices. Production cuts by OPEC, Russia, and other world producers, and declining US output because of the price of oil and gas have worked to balance the supply and demand fundamentals for the market and lift the prices of the energy commodities over the past weeks and months. Crude oil has been consolidating at over the $40 per barrel level since early June. As demand begins to return to the markets, the need for the oil services provided by SLB and HAL is likely to rise. The second reason is the potential to pick up assets at very inexpensive levels from other oil services companies that do not survive as they have a mountain of debt. SLB and HAL could follow Warren Buffett’s lead and pickup up logistical assets that would put the companies in a better position to earn profits over the coming years. Finally, the falling dollar and rising deficits are likely to foster a rally in the commodities sector. Oil and gas are still the energy products that power the world. SLB and HAL are companies that provide services, technology, and products necessary for extracting the products from the crust of the earth in the US and worldwide. I believe that SLB and HAL shares have the potential to move significantly higher over the coming years. Want More Great Investing Ideas? 9 “BUY THE DIP” Growth Stocks for 2020 How to Trade THIS Stock Bubble? 7 “Safe-Haven” Dividend Stocks for Turbulent Times SLB shares were trading at $20.13 per share on Monday afternoon, up $0.50 (+2.55%). Year-to-date, SLB has declined -48.84%, versus a 5.21% rise in the benchmark S&P 500 index during the same period."}]}