{"article": [{"url": "https://stocknews.com/news/orcl-msft-oracle-buys-tiktoks-us-holdings-orcl-has-been-a-bullish/", "published": 1600690100.0, "headline": "Oracle Buys TikTok’s US Holdings- ORCL Has Been A Bullish Beast for Years", "body": "ORCL shares have been on a path higher for almost two decades The company has a good track record of beating analyst EPS projections Oracle wins the battle for TikTok- A highly political situation ORCL pays a dividend and offers a reasonable P/E Trading near the all-time peak at the end of last week Oracle Corporation (ORCL) has been around since 1977 with its headquarters in Redwood City, California, in Silicon Valley. Larry Ellison founded the company together with Bob Miner and Ed Oates in the late 1970s; Ellison remains the executive chairman and chief technology officer at ORCL. The company provides products and services that address enterprise information technology environments worldwide. The cloud and license business sells, markets, and delivers its applications and infrastructure technologies through cloud and on-premise deployment models. ORCL’s customers include businesses, government agencies, and educational institutions. The company is a leader in database software and technology, cloud engineered systems, and enterprise software products. Oracle is best known for its database software, a relational database management system, and computer systems and software, such as Solaris and Java, acquired from Sun Microsystems in 2010. Last week, ORCL made another acquisition as it purchased the US assets of the Chinese app TikTok. ORCL did not take over the company, only its US interests. 7 \"SAFE HAVEN\" Dividend Stocks for Turbulent TimesORCL shares have been on a path higher for almost two decades ORCL’s initial public offering was on March 12, 1986, at $15 per share. The first time the company split the stock was in July 1989, and it was the first of many. Source: Barchart The long-term chart of ORCL shares shows that the stock rose from a low of a split-adjusted 6 cents in 1987 to a high of $46.47 in 2000. At the turn of the century, the dot com bubble took it back down to a low of $7.25 in June 2002. Since then, the stock’s path has been steadily higher. After a dip to a low of $39.71 in March 2020 during the risk-off period caused by the global pandemic, ORCL share rose to the most recent record high of $61.86 this month and was trading just below that level on September 18 at $59.75. The company has a good track record of beating analyst EPS projections Over the past four quarters, ORCL has consistently beat analyst EPS projections. Source: Yahoo Finance The chart shows the impressive earnings performance of the company. During the challenging second quarter of 2020, the company earned 93 cents per share, beating estimates by seven cents. The current expectations for Q3 earnings are for ORCL to earn $1 per share. A survey of twenty-two analysts on Yahoo finance has an average target of $62.63 for the stock with a range of $50 to $70. Oracle wins the battle for TikTok- A highly political situation In August, President Trump signed an executive order insisting that the American holdings of Chinese app TikTok are sold to a US company, or he would ban the app in the United States. Microsoft (MSFT) had been a frontrunner in the bidding to purchase the assets, but at the last minute, ORCL swooped in and won the contest. Larry Ellison has been a supporter of the President, so ORCL wound up the winner and acquirer of the rights from ByteDance, TikTok’s parent company. TikTok is a video-based app that allows people to display their creativity. The app became extremely popular, like many technologies, during the COVID-19 quarantine. With the November 3 election only weeks away and the debates between President Trump and Joe Biden on the horizon, the ban on TikTok and winning bid by a supporter of the President could become political fodder. Meanwhile, the Trump administration explored the concept of a fee for the US government for a deal with the Chinese company. According to Reuters, ByteDance valued TikTok at $50 billion, which is fifty times its projected 2020 revenue of $1 billion. The valuation of TikTok is high compared to other companies in the sector. Going into last weekend, it looked like the US government would begin blocking TikTok on Sunday, September 20, which could jeopardize the deal with ORCL. ORCL pays a dividend and offers a reasonable P/E At $59.75 per share at the end of last week, ORCL has a market cap of just below $180 billion and trades an average of over 14.6 million shares each day. In a world where technology shares trade at a sky-high price to earnings ratios, ORCL’s was trading below 19 times earnings at the end of last week. The company pays shareholders a 96 cents per share dividend, which equates to a 1.6% yield at the current stock price. ORCL appears to have purchased the US assets of TikTok, but time will tell if the deal satisfies the President’s concerns and if it ever gets done. ByteDance would retain a majority stake in the app, which causes national security issues with the acquisition. The US Committee on Foreign Investment in the United States (CFIUS) was reviewing the deal last week. The President’s executive order from August 6 would ban business dealings with TikTok after September 20. The deal is likely to run into trouble given the majority ownership by a Chinese entity. Trading near the all-time peak at the end of last week Whether the deal goes through or now, ORCL shares have been a bullish beast over the past two decades. Source: Barchart The short-term chart of ORCL shares highlights that technical support is at $54.87, $53.99, $50.91, and the March low of $39.80 per share. The low P/E for a technology company, an attractive dividend, and the impressive earnings record for the technology company make ORCL an inexpensive stock in a sector where finding value is challenging. The TikTok situation is another in a long series of battles between the Trump administration and China. After the trade war that gave way to the “phase one” trade deal early this year, the spread of the coronavirus destroyed any goodwill between Washington and Beijing. President Xi is likely waiting patiently for the US election before making any decisions on trade or futures policy directions when it comes to the United States. TikTok is one of many issues when it comes to President Trump’s attempt to level the playing field on commerce between the world’s two leading economies. China had made direct investments in US businesses over the years that have given Beijing control. In 2013, a Chinese entity purchased Smithfield Foods, the leading pork-producing company in the US. Smithfield was a publicly traded company, and the acquisition of the Virginia-based business took it private. US companies are not permitted to own businesses in China under Chinese law. The TikTok deal could be only the beginning of a period of increasing tensions when it comes to business ownership and national security for the US and China. Want More Great Investing Ideas? 7 Best ETFs for the NEXT Bull Market Stock Market Outlook: Before & After the Election Chart of the Day- See the Stocks Ready to Breakout ORCL shares rose $2.60 (+4.35%) in premarket trading Monday. Year-to-date, ORCL has gained 17.93%, versus a 2.22% rise in the benchmark S&P 500 index during the same period."}]}