{"article": [{"url": "https://stocknews.com/news/grub-wtrh-aprn-3-meal-delivery-stocks-to-buy-now/", "published": 1594123700.0, "headline": "3 Meal Delivery Stocks to Buy Now", "body": "Due to the pandemic, most people are avoiding dining at indoor restaurants. It’s not even allowed in many states. Many people are also hesitant to get fast food or go to grocery stores as the virus may be transmitted through the air. As a result, food delivery stocks continue to benefit from the pandemic. Here are three food delivery stocks likely to trend upward until an effective vaccine is available. GrubHub (GRUB) 9 \"BUY THE DIP\" Growth Stocks For 2020Food delivery companies were gaining traction even before the pandemic. People get busy, and sometimes it makes more sense to rely on for food delivery instead of spending time shopping at the grocery store or going to a fast-food restaurant. GRUB is taking advantage of the current situation as trips to grocery stores and getting take out have turned into a dangerous endeavors. GRUB provides customers with food delivery from more than 300,000 restaurants. This figure is double from a year ago. GRUB’s customers can now enroll in loyalty programs for additional value. Now that GRUB has partnered with Chipotle, the sky could the limit. Chipotle is a favorite among Millennials and Generation Z; many of whom would prefer to avoid standing in line, elbow-to-elbow at the local Chipotle. How does GRUB stack up for the POWR Ratings? A for Trade Grade B for Buy & Hold Grade A for Industry Rank B for Peer Grade B for overall POWR Rating Waitr Holdings (WTRH) If you were watching the top-gaining stocks yesterday, you might have seen WTRH listed. Shares of the stock were soaring after the company announced partial results for its second quarter. Investors were surprised to find out that WTRH is profitable, which can’t be said for many of its peers. So far, the app delivery business model hasn’t become widely profitable. WTRH provides online food ordering and delivery services in the United States. It delivers from both national chains and local restaurants. The stock has an average analyst price target for WTRH of $5.50. The company has $66 million in cash-on-hand, so it has plenty of financial flexibility for strategic moves. Blue Apron Holdings (APRN) Wouldn’t it be nice if a service delivered all of the ingredients and recipes you need to cook a great meal? APRN does just that. The company also offers wine for its customers. APRN also supplies grass-fed premium beef and pasture-raised poultry. APRN executives expect second-quarter revenue to increase by nearly 30%. If APRN’s customer spending averages move even higher in the year to come, the company could become a takeover candidate. A takeover makes sense for APRN as it would keep the business alive with a cash infusion. For a buyer, such as a grocery chain, it could help expand its customer base. Although APRN was down more than 30% in 2019, this is shaping up to be an excellent year for the company. The stock is up 100% year to date. Want More Great Investing Ideas? 9 “BUY THE DIP” Growth Stocks for 2020 Is the Bull S#*t Rally FINALLY Over? 7 “Safe-Haven” Dividend Stocks for Turbulent Times Top 3 Investing Strategies for 2020 GRUB shares were trading at $71.43 per share on Tuesday afternoon, down $1.53 (-2.10%). Year-to-date, GRUB has gained 46.85%, versus a -1.19% rise in the benchmark S&P 500 index during the same period."}]}