{"article": [{"url": "https://stocknews.com/news/acb-can-aurora-cannabis-finally-turn-things-around/", "published": 1599653300.0, "headline": "Can Aurora Cannabis Finally Turn Things Around?", "body": "This week Aurora Cannabis (ACB) announced that it appointed a full-time permanent CEO. This is something that investors have been waiting months for. ACB appointed Miguel Martin as the new Chief Executive Office. He will replace Interim CEO Michael Singer, who will remain the Executive Chairman. Martin was formerly CEO of Reliva, a CBD retail company based in the U.S. He became the Chief Commercial Officer of ACB in July. Prior to Reliva, he was President of Logic Technology, a privately held company that makes e-cigarettes. Michael Singer remarked, “The first phase of our business transformation, which is now substantially complete, included the rationalization of our cost structure, reduced capital spending, and a more prudent and targeted approach to capital deployment. As a result, we now have a far more efficient asset base and infrastructure to supply our key global markets. I am delighted to now be transitioning the CEO responsibilities to Miguel and I am confident that Aurora is in a strong position to succeed under Miguel’s leadership.” As expected, Martin was very excited about his promotion and stated, “I am excited to step into the role of CEO at this inflection point in Aurora’s business. In my early days, I have seen the tremendous potential of this organization firsthand- a combination of deep industry knowledge, commitment to quality, great brands, and a passion for patients and consumers that is truly differentiated. I am confident that we have the infrastructure and capabilities for long term success in the global cannabinoid industry.” 7 Best ETFs for the NEXT Bull MarketIn addition to announcing a permanent CEO, ACB said that it plans to record up to C$1.8 billion in goodwill impairment chargers in the quarter. The charges relate to C$90 million fixed asset impairment charges, and a charge of about C$140 million in the value of inventory. The company is expected to announce earnings on September 22nd. Though the stock traded lower after this news was released, I see these announcements are positive steps in the right direction for ACB. Martin looks to be a great fit for the job, due to his extensive experience. I am also pleased to see the company writing down a substantial portion of their remaining goodwill. This is essential for the health of the company in the long run. With many of ACB’s problems now in the rearview mirror, the company may be an interesting opportunity for investors who remain bullish on the cannabis sector. Disclosure: The author is long ACB Want More Great Investing Ideas? 7 Best ETFs for the NEXT Bull Market Will Stocks Fall into Historical September Slump? 9 “BUY THE DIP” Growth Stocks for 2020 ACB shares were trading at $7.80 per share on Wednesday morning, up $0.28 (+3.72%). Year-to-date, ACB has declined -69.91%, versus a 6.75% rise in the benchmark S&P 500 index during the same period."}]}