{"article": [{"url": "https://stocknews.com/news/tkr-kgc-csiq-trtn-4-top-value-stocks-for-a-potential-market-crash/", "published": 1601813300.0, "headline": "4 Top Value Stocks for a Potential Market CRASH", "body": "Are we headed to another market crash? It tough to say, but we need to be prepared, and I’ve got a few value stocks that can protect your portfolio during tough times. These companies have crossed the T’s and checked the I’s in terms of my favorite value indicators, including cash flow yield. Each of these stocks can also be considered value momentum. In other words, they are undervalued, but still showing positive bullishness. To say the market looks murky is an understatement. Last month was rocky as the S&P 500 dropped 3.9%, and things only seem to be getting more volatile from here. We see more coronavirus outbreaks, highlighted by the recent news that President Trump tested positive for the virus. The virus has spread among his family, his staff, and other high-ranking officials in the government. That’s not to mention recent Senators and members of the White House press pool that have tested positive. The market dropped again on Friday due to investor uncertainty. This year has seen many ups and downs, making it hard to predict where the market will go from here. Adding a few value names to your portfolio may help you feel safer in these times of uncertainty. Here are four companies worth a look: The Timken Company (TKR), Kinross Gold (KGC), Canadian Solar (CSIQ), and Triton International Limited (TRTN). 9 \"BUY THE DIP\" Growth Stocks For 2020The Timken Company (TKR) TKR is a manufacturer of bearings, gear belts, and chain-related products. The company is known as a leader in ball bearings in the U.S. It sells its bearings portfolio through a network of authorized dealers to end-users or original equipment manufacturers. The company recently had a strong quarter, with both earnings and revenues surpassing estimates. Also, TKR declared a quarterly dividend of 28 cents per share, which makes it 393 straight quarters of paying dividends for the company. That is one of the longest-running dividend records on the NYSE. The company is expanding its portfolio across various markets through strategic acquisitions such as its acquisition of BEKA Lubrication, strengthening its leadership in the automatic lubrication systems market. TKR has healthy financials, a stable dividend, strong profitability, and is trading below its intrinsic value, making it a solid company worth considering in a volatile market. It is rated a “Strong Buy” in our POWR Ratings system. It holds grades of “A” in Trade Grade, Buy & Hold Grade, Peer Grade, and a “B” in Industry Rank. Those are four components that make up the POWR Ratings. The company is also ranked #5 out of 38 stocks in the Industrial-Manufacturing industry. Kinross Gold (KGC) As gold has benefitted this year due to economic uncertainties, KGC provides a nice balance of value and sentiment. The Canadian-based gold producer is one of the top 10 gold mining companies globally, as it produced roughly 2.5 million gold equivalent ounces last year. KGC had 24.3 million ounces of proven and probable gold reserves and 55.7 million ounces of silver reserves at the end of 2019. Market and economic downturns are a great time to be invested in gold, as it is considered a safe haven. Gold stocks have performed well, as the VanEck Vectors Gold Miners ETF (GDX) is up 33.1% for the year, and the price of gold is at $1908 an ounce, up 25% year to date. KGC has been a strong performer this year as the stock is up 87.6% so far, but still sports a 12.5 P/E. Its Tasiast expansion should continue to drive growth, and the Gilmore project is a low-cost brownfield expansion with limited risk. Even with value attributes, this company has had robust earnings growth and stable revenue growth. It also has a 1.4% dividend yield and a 24% profit margin making it another strong contender for a safe pick in a market downturn. GDX is rated a “Buy” in our POWR Ratings system with a grade of “B” in Buy & Hold Grade and Peer Grade. It is also the #3 ranked stock in the Miners – Gold industry. Canadian Solar (CSIQ) CSIQ is a Canadian solar power company that provides solar power products, services, and system solutions. Due to the long-term impacts of global warming, many leaders worldwide are looking towards renewable energy. Japan is looking to invest more than $100 billion in wind, and solar energy before 2030, and Europe wants renewable energy to make up at least 27% of energy consumption by 2030. Renewable energy consumption has grown at a rate of 13.7% over the past last decade, which makes CSIQ an attractive investment. It caters to a geographically-diverse customer base across Canada, the United States, Japan, U.K, and more. It has one of the largest utility-scale solar project development platforms in the world. CSIQ has a robust project pipeline and continues to look for development opportunities to consolidate its position leading solar company. CSIQ has shown strong earnings growth and is expected to grow revenues at a rate of 28.5% next year. While the company doesn’t pay dividends, it is profitable with a return on equity of 17.1% and is currently undervalued with a P/E of 8.5. The company is rated a “Strong Buy” in our POWR Ratings system with a grade of “A” in Trade Grade and Buy & Hold Grade, and a “B” in Industry Rank. Triton International Limited (TRTN) TRTN operates as a lessor of intermodal containers and leases chassis used for the transportation of containers. The company has a strong presence in Asia, Europe, North America, and South America. Some of the equipment the company leases include Dry freight, Refrigerated, Special, Chassis, and Tank containers. This company is an exciting stock, as it benefits from trends in shipping. With freight activity up, especially on the east coast, TRTN stands to gain. The company even rewarded shareholders this year with dividend payments and share buybacks. It currently sports a high 5.5% dividend yield with a 51.2% payout ratio. The company is on solid footing with a current ratio of 7.5, meaning it has plenty of cash to pay off short-term obligations if it had any. At the end of the second quarter, TRTN had no current debt obligations. It should grow its earnings 29% next year, yet it is undervalued at a P/E of 9.3. Keep an eye out on October 22nd as TRTN is expected to report its latest financial results. TRTN is rated a “Buy” in our POWR Ratings system, with a grade of “A” in Trade Grade and Peer Grade, and a “B” in Buy & Hold Grade. It is also ranked #4 out of 46 companies in the shipping industry. Want More Great Investing Ideas? Do NOT Buy Stocks Before the Election! 7 “Safe-Haven” Dividend Stocks for Turbulent Times Chart of the Day- See Christian Tharp’s Stocks Ready to Breakout TKR shares closed at $55.25 on Friday, up $1.37 (+2.54%). Year-to-date, TKR has declined -0.17%, versus a 5.21% rise in the benchmark S&P 500 index during the same period."}]}