{"article": [{"url": "https://stocknews.com/news/ebay-is-ebay-a-buy-at-52/", "published": 1601035700.0, "headline": "Is eBay a Buy at $52?", "body": "eBay, Inc. (EBAY) is one of the largest global e-commerce companies with focus on consumer-to-consumer (C2C) business. Its highest share of profits comes from advertising revenue and selling fees. Unlike most of its rivals, EBAY doesn’t physically own or account for the products sold, but merely acts as a marketplace for buyers and sellers to interact. EBAY has fared relatively well throughout the pandemic, and has gained almost 100% since its March low. The stock hit its 52-week high of $61.06 on July 13th. However, the recent sell-off in the market caused EBAY to lose almost 12%. EBEY’s dominating market share and global presence should keep driving its future performance with people across the globe changing their buying habits due to the pandemic. This, combined with several other factors, has helped EBAY earn a “Buy” rating in our proprietary rating system. 9 \"BUY THE DIP\" Growth Stocks For 2020Here’s how our proprietary POWR Ratings system evaluates EBAY: Buy & Hold Grade: B In terms of proximity to its 52-week high, which is a key factor that our Buy & Hold Grade takes into account, EBAY is well-positioned. It is currently trading 17.9% below its 52-week high of $61.06, which it hit on July 13th. The stock has gained 35.2% over the past three years owing to its solid revenue and earnings growth. The company’s revenues increased at a CAGR of 6.3% over the past three years, while EBIT increased at a CAGR of 6.5% over the same time period. It’s leveraged free cash flow increased at a CAGR 26.1% in the past three years. EBAY’s global market presence and huge demand has supported its long-term growth. However, several other companies have risen to provide stiff competition to EBAY, casting doubts over its future growth prospects. Peer Grade: B EBAY is currently ranked #18 out of 57 stocks in the Internet industry. Other popular stocks in this industry are Zillow Group Inc. (Z), Line Corporation (LN) and Booking Holdings Inc. (BKNG). While Z beat EBAY by gaining 112.9% year-to-date, LN returned 3.3% and BKNG lost 19.6% over this period. Trade Grade: C EBAY is currently trading above its 200-day moving average of $43.37, but below its 50-day moving average of $54.83. Moreover, EBAY has gained 6.2% over the past three months, which doesn’t indicate enough short-term bullishness. EBAY’s revenues grew 18% year-over-year to $2.90 billion in the second quarter that ended in June 2020. Annual active buyers increased 5% from the year-ago value to 182 million globally, while net income increased 34% from the same period last year to $770 million. Diluted EPS increased 63% year-over-year to $1.08. EBAY is currently expanding the management of its global payments system, as its operating agreement with PayPal (PYPL) expired earlier this year. Though the company ensures smooth and easy transition between the two payment systems, global acceptance of the new payments platform remains in question. Industry Rank: C The Internet industry is currently ranked #57 out of 123 industries in the StockNews.com universe. Despite one of the best performing industries during the pandemic, internet and tech companies have recently plummeted. Though most analysts estimate this to be part of a healthy and much required market correction, the duration of this bearish trend is unknown. However, the current geopolitical conflict with China can act as a major deterrent toward the future growth of Internet companies, as China is a major supplier of raw materials and intermediate products. Also, it is one of the biggest consumer market places for these companies. Overall POWR Rating: B (Buy) EBAY is rated “Buy” due to its long-term bullishness and financial strength, as determined by the four components of its overall POWR Ratings. Bottom Line EBAY has the potential to soar further based on its impressive earnings and revenue outlook, and favorable analyst sentiment. EBAY has an average broker rating of 1.66, indicating favorable analyst sentiment. Out of 34 Wall Street analysts that rated the stock, 11 rated it “Strong Buy.” The consensus EPS estimate of $0.86 for the third quarter ending September 2020 indicates a 28.4% growth year-over-year. The consensus revenue estimate of $2.70 billion for the ongoing quarter indicates a 1.8% increase from the year-ago value. Want More Great Investing Ideas? 7 “Safe-Haven” Dividend Stocks for Turbulent Times When Does the Next Bull Run Start? Chart of the Day- See the Stocks Ready to Breakout EBAY shares were trading at $52.15 per share on Friday afternoon, up $0.37 (+0.71%). Year-to-date, EBAY has gained 46.04%, versus a 2.88% rise in the benchmark S&P 500 index during the same period."}]}