{"article": [{"url": "https://stocknews.com/news/fcx-scco-copper-prices-are-about-to-explode-are-you-positioned-for/", "published": 1600776500.0, "headline": "Copper Prices Are About to Explode… Are You Positioned for It?", "body": "China’s demand for refined copper just hit an all-time high. This is just one more indicator that China’s economy is recovering quickly. But it’s not the only one. According to The Wall Street Journal, China’s official Manufacturing Purchasing Managers Index (PMI) — which shows economic activity in China’s manufacturing sector — rose to 51.1 in July. That’s up from 50.9 in June. 7 Best ETFs for the NEXT Bull MarketBelow 50, the PMI indicates economic contraction. Above 50, it signals economic expansion. According to Bloomberg’s Mark Burton and Libby Cherry, that could set up an historic supply squeeze. For a commodity like copper, the fundamental force of supply and demand dictates its price. The chart below illustrates demand coming from China over the past 10 years: China Monthly Copper Demand – Data from Bloomberg As you can see, China’s copper habit increased dramatically over the past decade. It’s up 84% from May 2010 to May 2020. The problem is that South America’s mines aren’t recovering as quickly as copper’s demand. You see, 45% of the world’s raw copper supply comes from Chile and Peru. So, as you can imagine, trouble in their mines has an impact on copper supply. We’re already seeing evidence of a supply problem forming. From January to May of this year, copper supply in London Metal Exchange (LME) warehouses grew 117%. It rose from 125,250 metric tons to 271,775 metric tons. However, since the peak in May, LME warehouse supply fell 73% to just 75,550 metric tons. That’s the lowest level since December 2005. You can see what I mean on this chart: While we expect some volatility in commodities, a 73% decline in just four months is steep. To put that into perspective, copper supply fell 70% during the big decline from March 2018 to March 2019. But that decline lasted a full year. We can lay this rapid decline squarely on China’s recovery. The question is: What will it ultimately do to copper’s price? George Daniel of Red Kite Capital Management told Bloomberg: “The market is starting to resemble that of the early 2000s, when a similar Chinese buying spree emptied the world’s warehouses of copper and sent prices vaulting to record highs.” Daniel’s comment refers to 2002 to 2011, when copper’s price rose 655% from $0.62 per pound to $4.57 per pound. While I doubt we’ll see a repeat of that massive gain, conditions are right for copper prices to make new highs. We already saw gold break through its previous record price. And copper could easily do the same if it rose over 50% from today’s level. That creates a great opportunity for us to profit from. Mining companies are the easiest way for most investors to get exposure to this bull market. Giant copper miner Southern Copper Corp. (SCCO) is a $30.7 billion behemoth that operates mines in Peru and Mexico. Not only does it produce copper, but it pays a healthy 3.5% dividend yield. In April 2018, Southern Copper’s share price peaked at $57.34. Today, it trades at just $45.17 per share. That means the stock price needs to go up 25% to match its 2018 high. Another option is buying giant gold and copper miner Freeport-McMoRan Inc. (FCX). The $22.7 billion company earned 69% of its revenue in 2019 from copper mines in North and South America. Freeport also owns 49% of the massive Grasberg mine in Indonesia, which accounted for the other 28% of its revenues. From 1990 to 2019, Grasberg produced 33 billion pounds of copper and 53 million ounces of gold. It’s easily one of the world’s greatest metal deposits. Today, Freeport’s share price is $15.65 per share. In 2011, at its peak, it traded for $60.92 per share. So it would have to go up 289% to match that high. Either of these miners gives us exposure to copper’s rising price — and would make a great addition to your portfolio. What More Great Investing Ideas? Free Report: The Right Investment at the Perfect Time The Shocking Truth Why You Don’t Make More Money in Stocks Discover the Strategy That’s Delivered Over a 90% Win Rate and Could Have Turned $10,000 Into $233,000 in Just One Year FCX shares were trading at $15.63 per share on Tuesday afternoon, down $0.02 (-0.13%). Year-to-date, FCX has gained 19.57%, versus a 2.90% rise in the benchmark S&P 500 index during the same period."}]}