{"article": [{"url": "https://stocknews.com/news/apha-mj-is-aphria-still-the-top-canadian-cannabis-stock/", "published": 1600171700.0, "headline": "Is Aphria Still the Top Canadian Cannabis Stock?", "body": "A canadian cannabis stock that stands above the rest is Aphria (APHA). Compared to its competitors, Canopy Growth (CGC) and Aurora Cannabis (ACB), APHA already has a track record of success. While CGC and ACB have been struggling to write down goodwill due to high-priced acquisitions, APHA has avoided pricey acquisitions and kept a healthy balance sheet and a substantial amount of cash. APHA has a strong record of sales growth. Its five-year revenue growth average is 206.2%. This is due to its portfolio of brands such as Aphria, Broken Coast, Solei, RIFF, and Good Supply. In its last reported results, net cannabis revenue was up 81% from the prior quarter. This is due to robust volume growth. The cost per dried gram remained low at CAD 0.88. This led to increased profitability for the company. Its adjusted EBITDA was up 49% from the third quarter, to CAD $8.6 million. APHA is currently the only Canadian cannabis producer that generates positive EBITDA. Unlike its competitors, which sell consumer packaged goods, APHA focuses on flower and vape products. The company also had an extensive international distribution business, which has primarily driven revenue. APHA has operations in ten countries outside Canada. The company’s German subsidiary, CC Pharma, which it acquired last year, has access to nearly 70% of pharmacies in Germany. 7 Best ETFs for the NEXT Bull MarketAPHA is No. 1 in terms of net revenue across all Canadian cannabis companies and it should continue to be for the foreseeable future. The company is going after the cannabis derivatives market. Derivatives are products such as edibles, cannabis-infused beverages, concentrates, topicals, and vapes. These were made legal in Canada late last year. Previously, only dried flower and cannabis oil were legal. The derivatives market is potentially more lucrative as margins are better. APHA is already the leading derivatives provider in Ontario. APHA also has one of the best management teams in the industry with CEO Irwin Simon leading the company. Simon has put an emphasis on core business in the Canadian marketplace. Though APHA’s performance year-to-date (YTD) is lackluster, -11%, it is significantly outperforming the ETFMG Alternative Harvest ETF (MJ), which is down more than 33% YTD. It is currently rated a “Strong Buy” by Wall St. analysts, with an average price target of $7.19, which represents a 53% increase from where it currently trades. As you can see, APHA stands atop the Canadian cannabis sector. If you are a long-term investor, you may want to consider adding this strong cannabis stock to your portfolio. Disclosure: The author is long APHA. Want More Great Investing Ideas? 7 Best ETFs for the NEXT Bull Market Is the Stock Market Correction Over? Chart of the Day- See the Stocks Ready to Breakout APHA shares were trading at $4.68 per share on Tuesday afternoon, up $0.03 (+0.65%). Year-to-date, APHA has declined -10.34%, versus a 7.21% rise in the benchmark S&P 500 index during the same period."}]}