{"article": [{"url": "https://stocknews.com/news/zm-lulu-pton-z-4-outperforming-growth-stocks-to-buy-in-october/", "published": 1602072500.0, "headline": "4 “Outperforming” Growth Stocks to Buy in October", "body": "There is a popular argument that growth stocks have become overvalued after an abundance of money flowed into them during the pandemic. That argument might be partially valid for some tech stocks, yet there are still some fantastic opportunities. It is becoming increasingly clear that the best investors never stop searching for growth stocks, particularly those with the potential to outperform the rest of the market. However, pinpointing such stocks requires extensive effort, time, and expertise. I have identified four of the best growth stocks to add to your portfolio: Zoom Video (ZM), Lululemon Athletica (LULU), Peloton Interactive (PTON), and Zillow Group (Z). 7 \"SAFE HAVEN\" Dividend Stocks for Turbulent TimesZoom Video Communications (ZM) When it comes to outperforming growth stocks, few compare to ZM. ZM is now used by companies of just about every size and niche, spanning all industries. ZM makes videoconferencing from distant locations easy. ZM’s basic service is free, yet the company makes money from its premier services. ZM has nearly flawless POWR Rating components highlighted by “A” grades in the Peer Grade and Trade Grade components. ZM is ranked in the top five out of more than 50 Technology – Services stocks. The stock is still about $50 below its 52-week high of $529, meaning it has some room to move upward should the pandemic worsen and people are forced to continue working from home. It appears as though a possible second wave of COVID-19 may help ZM reach new heights. ZM revenue has spiked 300% on a year-over-year basis, coming in just under $664 million. ZM’s net income skyrocketed from $5 million to nearly $190 million. Perhaps most important is the fact that ZM’s large customers that spend more than six figures per year have increased in number by more than 100% on a year-over-year basis. Recent partnerships with Oracle (ORCL) and Lumen Technologies (LUMN) will help ZM reach its true potential in the months ahead. At its Zoomtopia user conference on October 14, the company will display its latest tech innovations. Lululemon Athletica (LULU) Take a look at the tags on your girlfriend or wife’s athletic gear, and you will likely find at least one item made by LULU. Women have quickly gravitated toward LULU products. The company is now expanding its target customer base to men. In addition to athletic wear, LULU also sells socks, bags, pants, and jackets. LULU has “B” grades in each POWR Rating component but its Buy & Hold Grade. LULU is ranked 13th of 65 publicly traded companies in the Fashion & Luxury industry. Analysts are bullish on LULU, setting a price target of $380.52, representing a potential 13% upside. Of the 27 analysts who have analyzed LULU, 18 recommend buying, nine advise holding, and none suggest selling. Even though some LULU stores were closed last quarter, the company’s revenue grew by 2%. Peloton Interactive (PTON) Fitness products, particularly those that can be used at home without entering a potential virus-laden gym, are all the rage as the pandemic continues. PTON exercise machines have been selling like hotcakes. As one fitness center after another goes out of business, PTON becomes much more attractive to investors. In short, PTON makes it easy to exercise at home without feeling alone. The company’s products feature screens that make you feel like participating in a group exercise. PTON’s bikes and digital subscriptions are high margin products, meaning the company is raking in cash with each sale. PTON has perfect POWR Ratings with “A”s in each POWR component. PTON is ranked in the top five out of 30+ stocks in the Consumer Goods industry. Of the 23 analysts who cover PTON, 20 advise buying, two recommend holding, and one advises selling. Zillow Group (Z) Just about everyone agrees, Z is the go-to site for home buying and selling. Z certainly has chinks in its armor in the form of inaccurate statuses about homes that are sold/pending/available, and the occasional search flaw, yet it is still revered as the primary source of information for real estate. Z stands to benefit from the country’s blazing-hot housing market. Z makes money from website visits, sales stemming from the site, rentals, lender referrals, and more. Z has “A” grades in each POWR Rating component but for its Industry Rank, which has a grade of “B.” Z is ranked in the top five out of 57 Internet stocks. Interest rates are likely to remain at rock bottom levels in an attempt to stimulate a faltering economy. This means that more homes will likely be sold, benefitting Z for the foreseeable future. Want More Great Investing Ideas? 7 Best ETFs for the NEXT Bull Market What is the Cure for Stock Market Volatility? Chart of the Day- See Christian Tharp’s Stocks Ready to Breakout ZM shares rose $4.63 (+0.97%) in premarket trading Wednesday. Year-to-date, ZM has gained 609.83%, versus a 6.51% rise in the benchmark S&P 500 index during the same period."}]}