{"article": [{"url": "https://stocknews.com/news/auy-litb-fbio-3-stocks-under-10-with-high-earnings-growth-potential/", "published": 1597752500.0, "headline": "3 Stocks Under $10 with HIGH Earnings Growth Potential", "body": "August 14th marked 100th trading day since the stock market bottomed on March 23rd. Incredibly, this was the best 100 day performance for the stock market since 1933. Leading this rally were growth stocks. Growth stocks are companies that are expected to grow sales and earnings more quickly than stock market averages. So it’s not surprising that the SPDR S&P 500 Growth ETF (SPYG) was up 58.6% in the 100 trading days since March 23rd and the SPDR S&P 500 ETF Trust (SPY) was up “only” 51%. Growth stocks have a high P/E (price-to-earnings) ratio because they are expected to grow rapidly. Historically, the average P/E for the S&P 500 is about 15. But It’s common to see growth stocks often have a P/E ratio of 50, 100, or even higher. 7 \"SAFE HAVEN\" Dividend Stocks for Turbulent TimesHowever, currently, the P/E for many growth stocks are extremely high; Zoom Communication’s (ZM) P/E is 1,470, Tesla’s (TSLA) P/E is 944, and Freshpet’s (FRPT) P/E is 930. So which stocks should investors buy if they want to participate in growth? I’ve compiled a list of 3 stocks, under $10, that have significant earnings growth potential and lower P/E ratios. There are Yamana Gold Inc. (AUY), LightInTheBox Holding Co., Ltd. (LITB) and Fortress Biotech, Inc. (FBIO). Yamana Gold Inc. (AUY) AUY is a Canadian precious metals producer which explores for and produces gold and silver ores. AUY plans to continue to build on its operations through expansion and optimization initiatives at existing operating mines, development of new mines, the advancement of its exploration properties. The stock closed yesterday’s trading session at $6.31, gaining 60% year-to-date. AUY had hit its low of $2.55 in March, but has recovered more than 147% since then. A significant increase in gold prices amid the ongoing uncertainties is the key performance driver for AUY’s performance. The momentum in gold prices was reflected in AUY’s second quarter report as the free cash flow for the firm grew 50% year-over-year to $92.2 million. Moreover, the company increased its dividend pay-out by 23% to $0.016 during the quarter. AUY has recently announced its intention to get listed on the London Stock Exchange. This listing will allow the company to improve its liquidity and expand its accessibility to an enlarged investor base. AUY’s annual return on equity is 6.3%. The street expects the company’s EPS to grow 40% per year in the next five year and it’s P/E ratio is 23. How does AUY stack up for the POWR Ratings? A for Trade Grade B for Buy & Hold Grade B for Industry Rank B for Overall POWR Rating. It is ranked #13 out of 30 stocks in the Miners – Gold industry. LightInTheBox Holding Co., Ltd. (LITB) LITB engages in the online retailing of various products and services to consumers worldwide. It provides customized, special occasion, and fast fashion apparel products; and other general merchandise products, such as accessories and gadgets, home garden products, electronics and communication devices, and other products. The company offers its products primarily through its e-commerce website and mobile application. It also provides software development and information technology support services. The stock closed yesterday’s trading session at $2.77. With a year-to-date gain of 164%, LITB is making fresh highs every trading day. LITB is scheduled to report its second quarter results later this week. LITB’s fiscal first quarter results were impressive with the company’s revenue increasing 1.3% year-over-year to $51.5 million. Net income came in at $0.7 million compared to a net loss of $14.1 million in the same quarter last year. LITB’s annual return on equity is 362% which reflects management’s effectiveness. The company’s EPS is estimated to grow 45% per year for the next five years and it’s P/E ratio is 74. LITB is rated “Buy” in our POWR Ratings system, consistent with its strong momentum. It also holds an “A” in Trade Grade and Peer Grade. It is ranked #35 out of 115 stocks in the China industry. Fortress Biotech, Inc. (FBIO) FBIO develops and commercializes pharmaceutical and biotechnology products. It deals in dermatology products for acne and fungal conditions, gene therapy, prostate and pancreatic cancers, and various other terminal illnesses. It develops novel immunotherapy agents for the treatment of autoimmune diseases and cancer. It has a robust pipeline with 25+ development-stage biotech product candidates with a solid track of execution. The stock closed yesterday’s trading session at $3.17, gaining 23.4% year-to-date. Additionally, it has gained more than 204% from its March low and is making new highs every day. FBIO increased its revenue by 2.2% year-over-year to $9.5 million in its fiscal second quarter. The company reported gross profit of $6.3 million while the gross margins stood 67%. FBIO has an impressive earnings surprise history with the company delivering positive surprises in each of the trailing four quarters. It reported a negative EPS of $0.19 compared to the consensus estimate of negative $0.27. FBIO has recently been included in the Russell 3000 index, signifying its growing market share in the Biotech industry. FBIO’s EPS is expected to grow 43.4% per year in the next five years. As per our POWR Ratings, FBIO has an overall rating of “Buy.” It also holds an “A” for Trade Grade and Peer Grade. It is currently ranked #51 out of 344 stocks in the Biotech industry. Want More Great Investing Ideas? The Best of StockNews 3 Possible Directions for the Stock Market from Here 9 “BUY THE DIP” Growth Stocks for 2020 AUY shares were trading at $6.27 per share on Tuesday afternoon, down $0.04 (-0.63%). Year-to-date, AUY has gained 59.92%, versus a 6.34% rise in the benchmark S&P 500 index during the same period."}]}