{"article": [{"url": "https://stocknews.com/news/hsbc-wdc-kalu-dnow-ds-avoid-these-downgraded-stocks/", "published": 1599826100.0, "headline": "AVOID These Downgraded Stocks", "body": "The latest POWR Ratings reveal a handful of stocks have been downgraded to a “Strong Sell”. These exclusive ratings are calculated daily to provide investors with the insight necessary to make prudent and timely investment decisions. The stock market pulled back a bit following its summer bull run, as stocks dipped earlier this week, bounced back on Wednesday, then fell again on Thursday. The question is whether we are nearing the end of a bull market or if the market is poised to trade sideways. The bottom line is some stocks should not be in your portfolio regardless of where the market goes from here. Let’s take a look at some of the latest stocks recently downgraded to a “Strong Sell”: HSBC Holdings (HSBC), Western Digital (WDC), Kaiser Aluminum (KALU), NOW (DNOW), and Drive Shack (DS). 7 Best ETFs for the NEXT Bull MarketHSBC Holdings (HSBC) HSBC, a bank plagued by money laundering scandals, recently terminated thousands of employees. This financial services provider is struggling amidst the economic trough. Though interest rates are low, banks such as HSBC are hesitant to lend money to consumers unless they have the proper qualifications. The prospect of a seemingly inevitable spike in loan defaults makes HSBC that much less attractive as an investment. The POWR Ratings reveal HSBC has “F” grades in its Trade Grade and Buy & Hold Grade POWR components. HSBC also has a “D” Peer Grade. Furthermore, HSBC is ranked in the bottom 25% of publicly-traded companies in the Foreign Banks sector. HSBC has a forward P/E ratio of 15.16, which is somewhat high for a struggling bank with limited growth prospects. Add in the fact that HSBC’s price returns are primarily in the red, and you have absolutely no reason to buy this stock. HSBC’s year-to-date price return is an ugly -44%. Western Digital (WDC) The development, design, manufacture, and sale of hard drives used for data storage is no longer as important as in years past due to the cloud’s emergence. As a result, WDC’s stock has been downgraded in the POWR Ratings. WDC has “F” grades in the Buy & Hold Grade and Trade Grade POWR components. The rest of WDC’s Components are graded as a “D”. Furthermore, WDC is ranked in the bottom half of stocks in the Technology – Storage space. WDC price returns are in the red across the board. The stock has a year-to-date price return of -41%. WDC’s three-year price return is -53%. WDC’s murky growth outlook and declining sales make it clear that this company’s future could be quite gloomy. Kaiser Aluminum (KALU) KALU makes forged aluminum products of varying sorts for use in the industrial, aerospace, and automotive industries. The POWR Ratings have KALU ranked dead last out of five businesses in the Aluminum industry. KALU has “F” grades in its Trade Grade and Buy & Hold Grade POWR components. Furthermore, the remainder of KALU’s POWR components are a grade of “D.” KALU price returns are in the red year-to-date, across the past three years and the past half-decade. KALU is trending toward its 52-week low of $54. NOW (DNOW) The oil business is no longer worthy of your hard-earned dollars unless you are swing trading or considering a short or put option. DNOW, an oil drilling equipment distributor, is clearly struggling. DNOW has “F” grades in its Trade Grade and Buy & Hold Grade POWR components. The stock’s other two components are a “D.” Furthermore, DNOW is ranked in the bottom half of 60 Energy – Services stocks. DNOW’s price returns are -44% year-to-date, -18% across the past three months, and -48% in the prior three years. Though DNOW temporarily bounced back from its COVID selloff, the stock is moving right back down toward its low around the $5 mark. Drive Shack (DS) While most golf-related businesses have thrived during the pandemic, DS is the exception. DS also provides leisure and entertainment services and products in addition to its golf offerings. DS has “F” grades in the POWR Ratings components of Trade Grade and Buy & Hold Grade and a “D” Peer Grade. DS is ranked below all but one stock in the Entertainment – Sports & Theme Parks industry. Furthermore, DS has price returns in the red in over a long period of time. DS’s year-to-date price return is -63%. Want More Great Investing Ideas? 7 Best ETFs for the NEXT Bull Market Will Stocks Fall into Historical September Slump? 9 “BUY THE DIP” Growth Stocks for 2020 HSBC shares fell $0.10 (-0.48%) in premarket trading Friday. Year-to-date, HSBC has declined -45.68%, versus a 5.41% rise in the benchmark S&P 500 index during the same period."}]}