{"article": [{"url": "https://stocknews.com/news/chgg-twou-lrn-3-education-stocks-to-smarten-up-your-portfolio/", "published": 1594814900.0, "headline": "3 Education Stocks to \"Smarten Up\" Your Portfolio", "body": "There is much debate as to whether it is prudent to send our kids back to school while still amid a pandemic. Plenty of parents will keep their kids at home, opting to home-school them, hire a private instructor, or tap into online learning. Furthermore, plenty of college students will also choose to learn from home rather than venture back to a campus that could be a petri dish for the virus. Several stocks, including Chegg Inc. (CHGG), 2U (TWOU), and K12 Inc. (LRN), stand to benefit from the shift toward online learning in the months and possibly even years ahead. Chegg Inc. (CHGG) 7 \"SAFE HAVEN\" Dividend Stocks for Turbulent TimesCHGG does a little bit of everything related to education. This company brands itself as a platform for social learning. CHGG sells and rents print textbooks. The company also provides electronic books. CHGG even offers online tutoring, courses, and scholarship services. The POWR Ratings show CHGG has A grade in each POWR Component. The stock is ranked 15th out of 54 publicly traded companies in the Internet industry. Top analysts insist CHGG is worthy of your investing dollars. Out of 13 analysts who have reviewed the stock, 10 have CHGG as a Buy while three consider it a Hold. No analysts advise selling CHGG. It appears as though CHGG’s second-quarter subscriptions will increase by 45%. With no end in sight for the pandemic, CHGG’s growth rate could move even higher in the quarters to come. CHGG may approach its 52-week high of $77.43 in the months ahead. 2U (TWOU) Online education was once viewed as a service meant for the fringes of society. Now that the pandemic is playing out, online learning is going mainstream. TWOU will undoubtedly enjoy an uptick in business. TWOU provides online education through the cloud. The company’s software-as-a-service (SaaS) business is cloud-based, empowering universities and colleges to educate students regardless of their location. TWOU provides undergraduate and graduate degrees in a wide range of fields ranging from public administration to business administration, physical sciences, social work, education, and beyond. TWOU also provides tech-enabled services, including student support, faculty support, content development, and state authorization services. The POWR Ratings have TWOU rated as a Strong Buy with As in all four of the POWR Component categories. TWOU is ranked third out of 10 stocks in the Software – SAAS space. Out of 10 Wall Street analysts who have analyzed TWOU, seven insist the stock is worth buying while three recommend holding and none advise selling. The only question is whether TWOU is overvalued after surging more than 50% in May. If you believe the transition to online learning from home will prove lasting instead of temporary, TWOU may belong in your portfolio. K12 Inc. (LRN) A growing number of parents are considering the merits of K-12 learning due to the pandemic. Also of concern is bullying in traditional school systems, the rise in school shootings, and the comparable efficiency of online learning. Though children who learn from home lack opportunities to socialize with others, some of those interactions can occur with neighborhood friends and peers in local sports leagues and other community-based activities. The POWR Ratings have LRN ranked second out of 26 stocks in the Outsourcing – Education Services with an A grade in three out of four categories that make up the POWR Ratings. For LRN, what matters most is whether a significant number of parents will choose to keep their kids at home this year and in the years ahead. The coronavirus may linger for years as potential vaccines might not prove effective or the virus may mutate. If this turns out to be the case, LRN may approach the triple-digit mark within the next 12-18 months. Want More Great Investing Ideas? 9 “BUY THE DIP” Growth Stocks for 2020 Top 5 WINNING Stock Chart Patterns 7 “Safe-Haven” Dividend Stocks for Turbulent Times CHGG shares were trading at $70.67 per share on Wednesday afternoon, up $1.47 (+2.12%). Year-to-date, CHGG has gained 86.42%, versus a 0.43% rise in the benchmark S&P 500 index during the same period."}]}