{"article": [{"url": "https://stocknews.com/news/unp-cp-cni-3-rail-stocks-steaming-ahead-this-summer/", "published": 1595419700.0, "headline": "3 Rail Stocks STEAMING AHEAD This Summer", "body": "Railroad stocks are attractive to investors because their businesses are insulated from competition, they have pricing power, and pay dividends. Regardless of what new technologies emerge, physical goods will have to be transported, and railroads are the cheapest way to do this. Trucking is its major competitor, but railroads have significant cost and environmental advantages. In the short-term, railroads’ earnings fluctuate with economic growth and are linked to industries like manufacturing and housing. Railroads have been described as the arteries of the industrial economy. It’s not a coincidence that Warren Buffett owns the largest US railroad. 9 \"BUY THE DIP\" Growth Stocks For 2020Along with the broader market, railroads sold-off due to the coronavirus, however, they have been clawing back these losses. Rail traffic has improved from the lows in March and April, yet they remain off their pre-coronavirus levels. As optimism around a recovery increases, rail stocks’ upwards momentum will continue. Another positive for the sector is the increased chatter about an infrastructure bill. Finally, the strength in housing is another positive that should lead to increased rail traffic. Here are three rail stocks which are positioned for further gains this summer: Canadian Pacific Railway Ltd. (CP) CP has the ownership and control rights over transcontinental freight railways running across Canada and northeastern and midwestern USA. It is currently operational across 12,700 miles transferring food grains, bulk commodities, and merchandise freight. CP has managed to retain its position as a major railway company amid the pandemic when the travel industry is suffering a substantial loss due to restrictions on domestic and international travel. It reported a 16% year-over-year rise in revenues to $2.04 billion in the first quarter of 2020. CP’s operating income rose 54% year over year to $834 million. As the demand for food items and necessary utilities have risen in the second quarter, CP should be able to maintain its performance. The consensus EPS estimate for the second quarter shows a year-over-year decline, but revenue is expected to be close to the year-ago quarter. Moreover, CP beat the consensus ESP estimates in each of the trailing four quarters, which is impressive. CP recently increased its quarterly dividend by 15% to $0.95. Its dividend growth in the past 5 years is 171%. CP hit a year-to-date low of $180.12 on March 23rd due to an overall dip in the market and has recovered more than 50% since then. This speedy recovery is due to its resilient business as demonstrated in its Q1 results. How does CP stack up on our POWR Ratings? A for Trade Grade A for Buy & Hold Grade A in Peer Grade B in Industry Rank A in Overall POWR Rating CP is also ranked #3 out of 14 stocks in the Railroad industry. Canadian National Railway Company (CNI) CNI is a rail transportation company with 2,000 route miles across the United States, Canada, and the Gulf of Mexico. It engages in the transport of both perishable and non-perishable items, supply chain services, and trucking services. Despite lockdowns and travel limitations, CNI managed to continue essential transportation services. However, its overall business was severely affected, CNI reported a 19% year over year decrease in revenues for the second quarter ended June 30th. However, CNI’s free cash flow increased by C$495 million. Moody’s reaffirmed CNI’s investment-grade credit rating of A2 with a stable outlook. JJ Ruest, President and Chief Executive Officer of CNI, said, “I’m pleased to reaffirm our commitment in encouraging the economic recovery through our C$2.9B capital investment plan for 2020 as well as our new investment announcement of the purchase of approximately 1,500 new, efficient, high-capacity, covered hopper cars to expand our grain export business for delivery starting in January of 2021.” CNI shares hit a year-to-date low of $66.30 on March 16th due to the stock market crash but have gained more than 44% since then. CNI’s capital investment plan for 2020 coupled with improving market conditions might lead to solid momentum in the upcoming quarters. CNI is rated “Strong Buy” in our POWR Ratings system, consistent with the financial strength and growth potential of the company. It has an “A” rating in Trade Grade, Buy & Hold Grade and Peer rank, and “B” in Industry Rank. It is also ranked #2 out of 14 stocks in the Railroads industry. Union Pacific Corporation (UNP) UNP’s rail network comprises 32,340 route miles connecting Eastern regions of the country to the West coast. UNP reported a 7% year-over-year increase in net revenues in the first quarter ended March 31st. Industrial freight revenue rose by 3% during this period. UNP’s operating ratio was at an all-time high of 59%, depicting its financial strength. As a major freight transportation company, UNP is an important part of the US supply chain. Though it was affected by the economic slump, UNP’s revenues are expected to pick up once operations resume. Over the past six years, UNP has issued more dividends than 95.1% of other dividend-issuing US stocks. The company currently pays an annual dividend of $3.88 per share, which yields 2.17%. UNP produces more trailing twelve-month cash flow than 92.6% of US dividend stocks, so it should be able to sustain its dividend payments. UNP gained more than 70% in value since hitting its 52-week low on March 18th. UNP’s are rated Strong Buy” in our POWR Ratings system, with an “A” in Trade Grade, Buy & Hold Grade, Peer Grade, and “B” in Industry Rank. It has #1 rank out of 14 in the Railroads industry. Want More Great Investing Ideas? 9 “BUY THE DIP” Growth Stocks for 2020 Newly REVISED 2020 Stock Market Outlook 7 “Safe-Haven” Dividend Stocks for Turbulent Times UNP shares were unchanged in after-hours trading Wednesday. Year-to-date, UNP has gained 0.36%, versus a 2.60% rise in the benchmark S&P 500 index during the same period."}]}