{"article": [{"url": "https://stocknews.com/news/fb-pins-socl-twtr-snap-is-social-media-the-new-tobacco/", "published": 1599048500.0, "headline": "Is Social Media the New Tobacco?", "body": "Over the last 25 years, the world has changed in remarkable ways. To name a few – the world has become more connected, the Internet has become an integral part of our lives, and people carry around devices to stay tethered to the digital world. This has transformed how people communicate, socialize, do business, and live their lives. There have been benefits as it’s created new opportunities and lowered barriers for anyone who wants to share their ideas or sell products. But, we’re also starting to see that there are profound drawbacks. Rise of Social Media 9 \"BUY THE DIP\" Growth Stocks For 2020These same principles apply to social media. In theory, it’s a great idea to give people a platform and let them form digital bonds with their friends and family to keep each other updated about their lives. In reality, there’s increasing evidence that it’s creating more problems than it solves. It’s possible that our brains aren’t hard-wired to handle the stimulus of social media. There are increasing amounts of isolation, political polarization, and mental health issues that are being tracked back to social media usage. It’s making us more connected but lonelier, angrier, and more distrustful of each other. Despite users self-reporting that social media use makes them feel worse, they continue logging in more frequently and for longer periods. Removing the moral layer, social media is a fantastic business. There’s a little marginal cost of adding new users. Many users become addicted to the product and encourage people they know to join. The network’s value increases as more people join which creates a wider and deeper moat. The product is free, so rapid growth is possible. Users are monetized through advertising. Since social media companies have a considerable amount of information about their users through the content they consume and engage with, ads can be micro-targeted. In their short history, the dominant social media companies like Facebook (FB), Tencent, Snap (SNAP), Twitter (TWTR), and Pinterest (PINS) have grown bigger and have been able to increase average revenue per users. Great Business Model It’s hard to imagine what will displace social media. Established social media companies with large user numbers benefit from the network effects and addictive nature of its product. Social media is likely to become even more influential in the coming years as other advertising channels continue to lose relevance. Additionally, younger people are using social media to an even larger degree which means its influence and use are likely to continue growing in the coming years. Most businesses get disrupted due to competition. Social media companies are harder to disrupt because their main asset is their network which competitors can’t recreate. A valuable network attracts more users, which in turn, makes their network more valuable. Parallels to Tobacco Industry We can gain some potential insight into the long-term path of social media companies by looking at the tobacco industry which is similar in so many ways. Both have been great businesses solely in terms of delivering investment outperformance. Over the last decade, social media stocks have been one of the best performers in the market. The Global X Social Media ETF (SOCL) is up 310% since it IPO’d in late 2011, compared to the S&P 500’s 175% gain over this period. The tobacco industry’s gains are even more impressive. $1 invested in tobacco in 1900 was worth over $6 million in 2020. Since its IPO in 1968, Altria (MO) has returned 18% a year which is more than double the S&P 500’s average return. Both have negative externalities. Social media is affecting mental health and exacerbating political polarization. Similarly, tobacco use leads to negative, long-term health effects. Both also have an addictive product with high margins. For tobacco, their outperformance against other sectors only started abating due to a foe that it couldn’t beat – the government. Smoking rates also started coming down due to public health campaigns and increasing awareness about the health consequences of smoking. The business’ costs sharply rose due to lawsuits filed by the state and the federal government against the tobacco industry to hold them accountable for tobacco-related health costs. Another factor was increased regulation and taxes. Regulation Is the Only Threat I believe that the only thing that will halt social media’s power is the government in the form of increased oversight or regulations. Two potential actions could be limits on what kind of user information the companies can share with advertisers or increased accountability for what kind of content the platforms must moderate. The tobacco industry spent prodigious sums on lobbying state and federal governments to delay its reckoning. Likely, the social media companies will also pursue this strategy. However, the industry has adversaries on both sides of the aisle. On the Right, they are skeptical of so much power concentrated in Silicon Valley companies run by people who tend to lean to the left. So, there’s a concern of censorship and right-wing views being silenced. On the Left, there’s a focus on how social media companies will prevent the spread of “misinformation” and deter their platforms from being used by foreign governments or political organizations to sow chaos. POWR Ratings The POWR Ratings are also bullish on most social media stocks. Facebook (FB) has a Strong Buy rating with an “A” in all POWR components including Trade Grade, Buy & Hold Grade, Peer Grade, and Industry Rank. It’s ranked #4 out of 57 Internet stocks. Twitter (TWTR) is rated a Buy with an “A” for Trade Grade and Industry Rank with a “B” for Buy & Hold Grade and Peer Grade. Among Internet stocks, it’s ranked #17 out of 57. Pinterest (PINS) is rated a Strong Buy and has an “A” for Trade Grade, Peer Grade, and Industry Rank with a “B” for Buy & Hold Grade. Closing Thoughts For the past century, tobacco stocks have outperformed by a significant margin. In recent years, this outperformance has started to wane, as fewer people are smoking, and there is an increasing regulatory burden that eats into profit margins. It makes sense that social media stocks will follow a similar trajectory. They are going to continue growing bigger, more efficient at monetizing users, and effective in growing its app in terms of users and time spent. The only thing that can stop them will be the type of things that halted the tobacco company’s outperformance – government action. While this is a longer-term threat, there is going to be increasing scrutiny as they get more influential especially with the upcoming election. The tobacco industry’s experience also teaches that until this threat materializes, the stocks should continue trending higher. Even after it materializes, the bigger companies can gain more market share as they are best-equipped to handle the increased cost and complexity of more regulations. Want More Great Investing Ideas? 7 Best ETFs for the NEXT Bull Market Beware Stocks in September? 9 “BUY THE DIP” Growth Stocks for 2020 FB shares were trading at $298.55 per share on Wednesday afternoon, up $3.11 (+1.05%). Year-to-date, FB has gained 45.46%, versus a 11.63% rise in the benchmark S&P 500 index during the same period."}]}