{"article": [{"url": "https://stocknews.com/news/avav-aaxn-irdm-3-top-defense-stocks-to-protect-your-portfolio/", "published": 1594296500.0, "headline": "3 Top Defense Stocks to Protect Your Portfolio", "body": "Like many industries, the U.S. aerospace and defense sector has been hit hard by the pandemic. The industry has been pressured by delayed trade events, limitations on travel, and closure of facilities that have hampered production. This is evident from the SPDR S&P Aerospace and Defense Select Industry’s (XAR) 21.8% loss so far this year which is much steeper than the S&P 500’s loss of 3.5%. This is unusual because typically, defense stocks do well when economic conditions are poor since their revenues tend to be less connected to economic growth. They also pay above-average dividends which are more attractive when interest rates are falling. According to a Reuters report, eight defense companies, including Lockheed Martin Corp (LMT) and Raytheon Technologies (RTX), have requested the U.S. government to support firms hit by COVID-19. 7 \"SAFE HAVEN\" Dividend Stocks for Turbulent TimesThe industry’s efforts to support the workforce and make other coronavirus-related adjustments should help it recover over time. Moreover, the demand for the defense industry’s products and services will return to normal as defense spending in the US and globally continue to rise. Further, at some point, investors will be attracted to these stocks’ stable dividends and growth prospects. As the industry returns to its normal demand, the following three stocks should ride the recovery: AeroVironment, Inc. (AVAV) AVAV is an American defense contractor that specializes in Small Unmanned Aircraft Systems (UAS), basically drones. The company recently announced that the US army decided to exercise its first option worth 21 million under the Small Unmanned Aircraft Systems (UAS) contract in the Flight Control System (FCS) domain. AVAV also received orders worth 9.8 million which are a part of a three-year base contract from NATO Support and Procurement agency that involves services for Puma tactical, Wasp, and Raven UAS. The company’s idea of providing broadband services through solar-charged drones in collaboration with Softbank has also excited investors. The stock is an outlier in the sector as it’s approaching its 52-week high of $80.76. Further, it’s the only pure-play stock for drones that have a promising future and number of applications in terms of military, security, and commerce. AVAV has returned 40.8% over the past year and 25.5% year to date. It has an average analyst price target of $88.25 which represents a potential upside of 13.9%. For the fiscal fourth quarter, AVAV recorded a 54% year-over-year increase in revenue. How does AVAV stack up for the POWR Ratings? A for Trade Grade A for Buy & Hold Grade A for Peer Grade A for overall POWR Ratings D for Industry Rank It ranks #1 out of 65 in the Air/Defense Services Industry Axon Enterprise, Inc. (AAXN) AAXN, which was formerly known as Taser International, provides energy weapons and a cloud software segment. The protests in the US will lead to more law enforcement agencies using Axon’s products like body cameras, sensors, and docking systems as well as web services would increase. Also, officers will be trained to and encouraged to use non-lethal force which bodes well for taser sales. AAXN recently announced that the Baltimore police department has been using Axon Records Management Solution since the start of the second quarter this year. This platform will help quicken the reporting process and augment the department’s operational capacity. Many police departments are relying on antiquated systems. Axon is focused on upgrading and standardizing police IT systems across the US which would lead to more efficiency and better record-keeping. AAXN has returned 53.1% over the past year and 32.3% year to date. Five out of eight Wall Street analysts have a ‘Buy’ rating for the stock. In the first quarter this year, AAXN recorded a 28.6% year-over-year increase in gross profit and an 18.7% year-over-year increase in total assets. Our POWR Ratings system rates AAXN as a Buy. It has an “A” for Peer Grade, Trade Grade, and “B” for Buy & Hold Grade. In the Air/Defense services industry, it’s ranked #5 out of 65 stocks. Iridium Communication Inc. (IRDM) IRDM provides data communication and mobile voice services through its satellite system. IRDM signed a deal with Relativity Space, an aerospace manufacturer to launch six spare satellites to Low Earth Orbit. Relativity Space specializes in launch services and IRDM focuses on satellite constellation systems. Relativity’s Terran 1, a launch vehicle will launch six of IRDM’s manufactured Iridium ground spare satellites one at a time. This collaboration will help IRDM cost-effectively launch its satellite constellations. IRDM provides services to the Department of Defense which entails global coverage maintenance and communication. The company has a loyal customer base and its diverse, cost-effective services have fueled subscriber growth. The stock has returned 9.6% over the past year and has a 9.9% year to date. The stock has an average analyst price target of $29 which represents 11.3% upside. In the first quarter this year, IRDM reported a 9% year-over-year increase in total revenue and a 16% year-over-year increase in total billable subscribers. It also has 74.7% gross margins which means that it has big earnings potential if revenue growth continues. Our POWR Ratings system rates IRDM as a Buy. It has an “A” for Peer Grade and a “B” for Trade Grade. In the Air/Defense services industry, it’s ranked #6 out of 65 stocks. 9 “BUY THE DIP” Growth Stocks for 2020 Is the Bull S#*t Rally FINALLY Over? 7 “Safe-Haven” Dividend Stocks for Turbulent Times Top 3 Investing Strategies for 2020 AVAV shares were unchanged in after-hours trading Thursday. Year-to-date, AVAV has gained 22.98%, versus a -1.40% rise in the benchmark S&P 500 index during the same period."}]}