{"article": [{"url": "https://stocknews.com/news/low-cmg-brk-b-a-4-stocks-that-bill-ackman-loves/", "published": 1596802100.0, "headline": "4 Stocks That Bill Ackman Loves", "body": "Billionaire Bill Ackman is one of the most profitable investors of 2020, as his hedge fund Pershing Square Capital Management made a 100-Fold price return on his coronavirus hedge. He is one of the most sought-after hedge fund managers and is known for his contrarian investment straetgy. His coronavirus play will go down in history as he turned a $26-million position into $2.6 billion by late March. He primarily used credit protection on investment grade and high yield bond indices to make such a huge gain. He was apprehensive about the potential market crash since the onset of the disease in late February, and he contemplated liquidating his holdings. However, he ended up simply purchasing credit protection policies to limit his losses. 9 \"BUY THE DIP\" Growth Stocks For 2020Ackman even went on national television to warn investors about the disastrous effect the pandemic could have on the markets, as he predicted many equity companies to go bankrupt. Despite receiving widespread criticism for making such bold comments, his vision came true when the benchmark indices started nosediving in early March. By March 23rd, he cashed out his position in these credit contracts to reap a whopping $2.6 billion. After such a profitable hedge, Ackman’s next goal is to merge a $4 billion black check company Pershing Square Tontine Holdings Ltd. with a ‘unicorn’ with low risk and high cash flow. Currently, Lowe’s Companies (LOW), Berkshire Hathaway Inc. (BRK.B), Agilent Technologies (A), and Chipotle Mexican Grill (CMG) are some of the biggest holdings of Pershing Square. The combined year-to-date price return from these companies has been 158.5%. Lowe’s Companies (LOW) LOW is a home improvement retailer operating in the United States, Canada, and Mexico. Its line of products caters to home construction, maintenance, repair, remodel, and decoration. Bill Ackman has been investing in LOW since 2018 when his company Pershing Square invested roughly $1 billion in the company. As of June 2020, LOW had a 16% weightage in Pershing Square Capital management. LOW has returned 27.6% year-to-date. On July 27th, LOW partnered with HomeAdvisor to promote LOW’s Pros Loyalty subscription program. Under the agreement, LOW’s Pro Loyalty members will get free year-long access to HomeAdvisor’s subscription program. It has also partnered with EGO to provide outdoor power equipment on Low’s websites and stores. LOW entered into a joint venture agreement with the Highfield Investment group to open a 1,230,000 square feet distribution center in Calgary Canada worth $120 million. With such expansion plans in place, LOW expects to profit significantly from the rising demand for home improvement products during the pandemic. As most people are upgrading their homes due to prolonged indoor stay, LOW’s products are preferred as it is one of the biggest names in the retail segment. LOW’s consensus EPS estimate of $2.67 for the second quarter indicates a year-over-year improvement of 24.1%. Moreover, LOW surpassed the street estimates in each of the trailing four quarters, which is impressive. The consensus revenue estimate of $23.32 billion for the about-to-be-reported quarter indicates an 11.1% growth year-over-year. LOW gained more than 150% since hitting its 52-week low of $60 on March 19th to its 52-week high of $152.24 on August 6th. How does LOW stack up for POWR Ratings? A for Trade Grade A for Buy & Hold Grade A for Peer Grade A for Industry Rank A for Overall POWR Rating You can’t ask for better. It is also ranked #2 out of 66 in the Home Improvement & Goods group. Berkshire Hathaway Inc. (BRK.B) BRK.B is the brainchild of Warren Buffet, who has 30.7% of voting power and 16.4% of economic interest in the company. Berkshire Hathaway has gained 274,000% since Warren Buffet’s takeover in 1966. With exposure to companies engaged in insurance, utility, and energy and retail and manufacturing units, BRK.B’s weightage was 15.1% in Pershing Square Capital Management as of June 2020. Ackman is a long-time holder of Berkshire and has been very vocal over the last few years that shares are undervalued. In addition to owning BRK.B, he also owns many of the companies that Buffett owns. BRK.B’s EPS is expected to grow 23.3% annually over the next five years. Its shares gained more than 25% since hitting its 52-week low on March 23rd. BRK.B is rated “Buy” in our POWR Ratings system, with an “A” in Trade Grade, and “B” in Buy & Hold Grade, Peer Grade and Industry Rank. Out of 59 stocks in the Insurance- Property & Casualty group, BRK.B is ranked #6. Agilent Technologies (A) A provides application-oriented solutions to life sciences, diagnostics, and applied chemical markets around the globe. It operates in three segments – Agilent Crosslab, Diagnostics and Genomics, and Life Sciences and Applied Markets. The stock has gained widespread recognition during this time, as scientists and medical experts are actively trying to design a coronavirus cure. A provides access to the latest technology and medical equipment required for research and development and stands to gain significantly from the discovery of the cure. Bill Ackman’s Pershing Capital portfolio has this stock with 13.8% weightage. A has returned 14.7% year-to-date. Though the consensus EPS estimate for the third quarter ended July 2020 indicates a year-over-year decline, A has managed to surpass the market estimates in three of trailing four quarters, which is impressive. Agilent hit its 52-week high of $99.36, gaining more than 60% since hitting its 52-week low of $61.13 on March 16th. A is rated “Strong Buy’ in our POWR Ratings system, consistent with its sound business model and potential gain prospects. It has an “A” in Trade Grade, Buy & Hold Grade, and Peer Grade and “B” in Industry Rank. In the 58-stocked Medical – Diagnostics/Research industry, A is ranked #3. Chipotle Mexican Grill (CMG) CMG is one of the most profitable holdings of Pershing Square, as reflected by its 41.7% price return year-to-date. It currently has an 11.5% weightage in the hedge fund owned by Bill Ackman. In addition to managing its business operations during the pandemic, CMG undertook expansion projects. It opened 19 new restaurants in the first quarter of 2020 and its digital sales increased 80% year-over-year during the lockdown period. CMG’s drive-thru facility, known as Chipotlane is present in 32 states and has been introduced in 11 of the new restaurants opened in 2020. Out of its estimated new employee hiring of 10,000, CMG has already appointed 8,000. Moreover, CMG recently launched a new avocado dyed clothing and accessories line, with first access given to 15 million Chipotle Rewards’ members. CMG’s second-quarter results were impressive. Digital revenue increased 216.3% year-over-year during the quarter, accounting for 60.7% of its total revenue. CMG opened 37 new restaurants, including relocations, during this quarter, while 3 restaurants were permanently closed. The company also has substantial cash holdings and credit facilities, which will help it brave the crisis. CMG’s earnings history is impressive, as the stock managed to surpass the consensus estimates in each of the trailing four quarters. Its EPS is expected to grow 22.2% annually for the next five years. The consensus revenue estimate of $1.58 billion for the third quarter indicates a 12.4% rise year-over-year. Since hitting its 52-week low of $415 on March 18th, CMG gained more than 185% to hit its 52-week high on July 22nd. It’s no surprise that CMG is rated “Strong Buy” in our POWR Ratings system. It has an “A” in Trade Grade, Buy & Hold Grade and Peer Grade, and “B” in Industry Rank. It is also ranked #2 out of 48 stocks in the Restaurant industry. Want More Great Investing Ideas? 9 “BUY THE DIP” Growth Stocks for 2020 How to Trade THIS Stock Bubble? 7 “Safe-Haven” Dividend Stocks for Turbulent Times LOW shares rose $0.32 (+0.21%) in after-hours trading Friday. Year-to-date, LOW has gained 29.39%, versus a 5.02% rise in the benchmark S&P 500 index during the same period."}]}