{"article": [{"url": "https://stocknews.com/news/amzn-bkng-2-best-stocks-of-all-time-37974235/", "published": 1596197300.0, "headline": "2 Best Stocks of All Time!", "body": "Today I want to go back in the time machine all the way to 2001 when I purchased the two best stocks of my investing career. No…my intention is not to brag. Rather, I want to focus on what went right with these investments in the hopes of helping us all find more big winners in the future. And the 2 Stocks Are… 9 \"BUY THE DIP\" Growth Stocks For 2020Amazon bought @ $8.58 for a gain to date of 37,196%. Priceline (now Booking Holdings) bought @ $14.62 and up 11,439% in total. (Was looking much better before the Coronavirus clipped the wings of all travel stocks…but still not too shabby) It looks so obvious now. But what’s so funny is that back then these stocks were tumbling lower. Especially Amazon which many experts said would NEVER make a profit given the low margin business and competition from others. Oh how wrong they were! Let’s dig in further to figure out what each has in common. Most obvious is that it was the early days of the internet and these were two pioneers of ecommerce. So riding a big wave of innovation is certainly are part of the winning equation. Another similarity is that they were the early leaders in their respective categories. And often that early market share lead tells you who will dominate in the long run with lesser players falling by the wayside. This is where investing legends like Lynch, Cramer and Buffett agree. Meaning to concentrate your investments in the top industry players because quality and excellence are business advantages that can stay with a firm for many, many years. Both AMZN and BKNG invested heavily in R&D to keep innovating. Sometimes that led to underwhelming quarterly earnings. But in the long run it kept them a step ahead of the competition. Amazon more so than Booking in this case. The last point that stands out is that I didn’t buy them at peak valuations. I bought them after a big pullback. This is where growth and value combine to find the best long term winners. Where to Find the Next Big Winners? I would like to say it’s easy…but it’s not. Meaning far too many investors believe that the solution is just to look for stocks enjoying the biggest year over year growth rates. However, academic research clearly shows that these are some of the least profitable stocks. Why? Too often the lofty expectations are not met and the stocks implode. What is required is in-depth research into these growth areas like 5G, Blockchain, Medical Cannabis, Internet of Things, Cancer Drugs etc. And on top of that is a disciplined approach to the stock picking as not to chase overpriced stocks that are the next big losers. If this approach sounds appealing to you, then you should check out our very popular POWR Trends newsletter. This is where we blend phenomenal growth with the safety that comes from using the POWR Ratings system. And right now we are offering 4 bonus free reports on the top stocks in these exciting growth arenas: 5G Set to Turbocharge the Internet Space Exploration: $1 Trillion Opportunity Cloud Computing Coronavirus AFTERMATH…we all know what is happening now. But we need to explore the long term effects of the virus on the economy…and thus what are the best long term investment opportunities. These bonus reports are only available til Monday 8/3 @ Midnight. So be sure to click the link below to get them now! Discover POWR Trends now! Wishing you a world of investment success! Steve Reitmeister …but everyone calls me Reity (pronounced “Righty”) CEO, Stock News Network & Editor, Reitmeister Total Return AMZN shares were trading at $3,198.45 per share on Friday morning, up $146.57 (+4.80%). Year-to-date, AMZN has gained 73.09%, versus a 1.71% rise in the benchmark S&P 500 index during the same period."}]}