{"article": [{"url": "https://stocknews.com/news/amat-low-lrcx-3-undervalued-stocks-ready-to-run-in-september/", "published": 1598962100.0, "headline": "3 UNDERVALUED Stocks Ready to Run in September", "body": "Investors looking for investable equities may want to consider stocks that combine growth and value attributes. This strategy is called growth at a reasonable price, or GARP. The strategy involves finding stocks with the potential for growth that are also trading at discount prices. One metric to find these stocks is the price/earnings growth (PEG) ratio. This forward-looking ratio compares a company’s price to earnings ratio to its expected earnings growth rate over the next few years. A GARP stock typically has a PEG ratio of 1 or below. Finding stocks that fit this criterion can offer quick profits in the near term. These stocks offer the best of both worlds in terms of value and growth investing. I like to go a step further and filter out any stocks that don’t have a high ROIC. Return on invested capital (ROIC) is one of the best measures of performance for a company. It measures how much profit a company can generate for every dollar invested. I look for an ROIC over 20. The other metrics I use when screening stocks is a PEG of 1 or below, a five-year EPS growth estimate over 15%, a growth estimate for this quarter over 15%, and a return on equity over 20%. Here are three undervalued stocks that meet all of my criteria: Applied Materials (AMAT), Lowe’s Companies (LOW), and Lam Research (LRCX). 7 \"SAFE HAVEN\" Dividend Stocks for Turbulent TimesApplied Materials (AMAT) AMAT is one of the world’s largest suppliers of semiconductor manufacturing equipment, providing materials engineering solutions to help make nearly every chip in the world. The company’s systems are used in almost every major process step except lithography. The company’s key tools include chemical and physical vapor deposition, chemical mechanical polishing, critical dimension measurement, defect-inspection scanning electron microscopes, etching, and wafer reticle-inspection. The company met all the metrics on my screen. It has a five-year EPS growth estimate of 21% and a current quarter growth estimate of 56%. The stock has an ROIC of 22.9% and a return on equity of 33.3%. AMAT also has a PEG ratio of 0.7. The company reported strong fiscal third-quarter results with EPS of $1.06, compared to a consensus estimate of $1.06. This is a 43.2% increase over the same period last year. Revenue came in at $4.4 billion, an increase of 23.4%. This was driven by strength in semiconductor equipment demand. AMAT also saw strong growth across all revenue segments. Demand should continue to be driven by foundry/logic technology transitions. AMAT is rated a Buy in our POWR Ratings system. It has a grade of B in three out of the four components that make up the POWR Ratings, including Trade Grade, Buy & Hold Grade, and Peer Grade. The stock had a grade of A in the remaining component, Industry Rank. AMAT is ranked #18 out of 86 stocks in the Semiconductor & Wireless Chip industry. Lowe’s Companies (LOW) LOW is the second-largest home improvement retailer globally, operating 1,970 stores throughout the United States and Canada. Its stores offer products and services for home decorating, maintenance, repair, and remodeling. The company targets the do-it-yourself retail consumer and do-it-for-me customers, in addition to commercial business clients. The company provides a line of home improvement products in diverse categories, such as appliances, lumber, paint, flooring, etc. The company has a five-year EPS growth estimate of 21.8% and a current quarter growth estimate of 38.2%. The company is quite efficient with an ROIC of 23% and a whopping return on 130.9% equity. The stock makes the cut for GARP with a PEG ratio of 1.0. The company had a robust second-quarter, beating analyst estimates in both earnings and revenue. This was driven by the company’s retail-fundamentals strategy that focused on improved technology and operational channels. The company is benefitting from a secular shift in consumer spending in the home. As people spend more time at home due to the pandemic, they are inclined to invest more in their houses. LOW is rated a Strong Buy in our POWR Ratings. It holds straight As in every POWR component. The company is also the #2 ranked stock out 86 stocks in the Home Improvement & Goods industry. Lam Research (LRCX) LRCX manufactures equipment used to fabricate semiconductors. The company is focused on the etch, deposition, and clean markets, which are key steps in the semiconductor manufacturing process. This is especially true for 3D NAND flash storage, advanced DRAM, and leading-edge logic/foundry chipmakers. The company’s flagship Kiyo, Vector, and Sabre products are sold in all major geographies to customers such as Samsung Electronics and Taiwan Semiconductor Manufacturing (TSM). The company has a five-year EPS growth estimate of 17.2% and a current quarter EPS growth estimate of 68%. LRCX is a well-managed company with an ROIC of 24.5% and a return on equity of 43.4%. The company also has a PEG ratio of 0.9. Similar to AMAT, the company has been benefitting from the growth in demand for semiconductors. The company has high exposure to memory, which is poised to see very high growth over the next couple of years due to cloud computing, mobile devices, big data, and the internet of things (IoT). The firm should also benefit from the increased adoption of its atomic layer deposition (ALD) offerings. LRCX is rated a Buy in our POWR Ratings. It holds grades of B for Trade Grade and Buy & Hold Grade, and a grade of A for industry Rank. It is also the #19 ranked stock in the Semiconductor & Wireless Chip industry. Want More Great Investing Ideas? 7 Best ETFs for the NEXT Bull Market Beware Stocks in September? 9 “BUY THE DIP” Growth Stocks for 2020 AMAT shares . Year-to-date, AMAT has gained 2.46%, versus a 10.68% rise in the benchmark S&P 500 index during the same period."}]}