{"article": [{"url": "https://stocknews.com/news/isrg-tdoc-iqv-gh-lvgo-4-innovative-healthcare-stocks-that-will-continue-to-rally/", "published": 1599739700.0, "headline": "4 Innovative Healthcare Stocks That Will Continue to Rally", "body": "The coronavirus has shined a light on the healthcare industry. The Center for Disease Control (CDC) director Robert Redfield said COVID-19 is the greatest healthcare crisis in a century, as case counts continue to rise every day. Medicine’s best minds are focused on creating and distributing an effective vaccine and treatments. The US Government started Operation Wap Speed to give resources to companies showing progress. The winners in this race will not only get recognition but will also be entitled to royalties. 7 \"SAFE HAVEN\" Dividend Stocks for Turbulent TimesWith the medical industry facing such an unprecedented crisis, many healthcare companies which have pioneered innovation are also playing an important role. Some of these companies’ products have already become integral to modern-day medicine, while others stand to gain importance in the future. Nevertheless, investors should pay attention to innovative stocks in healthcare as they have the most long-term potential. Intuitive Surgical, Inc. (ISRG), Teladoc Health, Inc. (TDOC), IQVIA Holdings, Inc. (IQV), and Guardant Health (GH) are innovative healthcare stocks that investors should consider adding to their portfolios. Intuitive Surgical, Inc. (ISRG) ISRG manufactures and sells da Vinci Surgical Systems, for minimally invasive surgery procedures across the United States and worldwide. The robotic surgical system provides a wide range of motion to operating surgeons, along with tissue manipulation and three-dimensional HD vision. It also sells other medical accessories required during surgeries. The COVID-19 pandemic has shifted the focus of the healthcare industry to the more urgent issue at hand, affecting ISRG’s business adversely. In the second quarter ended in June 2020, ISRG’s financials reflected a year-over-year decline. However, the company managed to report positive earnings, with a net income of $70.20 million and a gross profit of $502.90 million. ISRG’s long-term performance is impressive, as its net revenue grew at a CAGR of 14.8% over the past three years, while net income and diluted EPS grew at a CAGR of 11.5% and 10.8%, respectively, during the same period. ISRG’s EPS is expected to grow at 5.5% per annum over the next five years. Moreover, ISRG beat the street EPS estimates in each of the trailing four quarters, which bodes well for the stock. ISRG has gained more than 115% since hitting its 52-week low of $360.50 in March. The stock hit its 52-week high of $778.83 in September. How does ISRG stack up for the POWR Ratings? A for Trade Grade B for Buy & hold Grade A for Peer Grade B for Industry Rank B for Overall POWR Rating. It is also ranked #21 out of 138 stocks in the Medical Devices & Equipment industry. Teladoc Health, Inc. (TDOC) TDOC is a business-to-business virtual healthcare services company covering various critical and non-emergent clinical conditions. It provides professional opinion through telehealth solutions as well as helps customers find the nearest most suitable medical center according to their requirements. The pandemic and social distancing norms have affected standard medical practices in the world, as most medical professionals are battling with coronavirus-related issues. The lockdown and ensuing social distancing policies have reduced the routine medical check-ups as well. As a result, virtual telehealth services have amassed popularity during this time, as people are seeking virtual medical help from professionals from the safety of their homes. As the biggest telehealth provider in the country, TDOC has gained significantly during this time. Net revenue for the second quarter ended June 2020 increased 83% year-over-year to $421.80 million. Subscription access fees revenue rose 64% from the year-ago value to $182 million during this time. Adjusted EBITDA grew 317.4% from the same period last year to $26.30 million. On August 5th, TDOC announced its merger with Livongo (LVGO) for stock and cash worth $18.50 billion. Through this merger, TDOC’s pro forma revenue for 2020 is expected to increase 85% year-over-year to $1.30 billion. The merged company is expected to have pro forma adjusted EBITDA worth $120 million this year. The consensus revenue estimate of $282.04 million for the third quarter indicates a 104.4% growth year-over-year, taking into account the effects of the merger. TDOC has gained more than 140% year-to-date. The stock hit its 52-week high of $253 on August 4th, immediately after the announcement of the merger with LVGO. In our POWR Ratings system, TDOC holds a grade of B in Trade Grade and Industry Rank. It is currently ranked #27 out of 69 in the Medical – Services industry. IQVIA Holdings, Inc. (IQV) IQV provides technology-enabled analytical healthcare solutions with integrated information internationally. It operates in three major segments – Contract Sales & Medical commercial solutions, Research and Development Solutions, and Integrated Engagement Technology and Analytics solutions. IQV won the Gold Stevie Award for technical innovation of the year and a Silver Stevie award for the most innovative company of the year in the 2020 American Business Awards. Despite the pandemic-driven disruption in operations. IQV’s revenues from the technology and analytics solutions segment grew 2% year-over-over to $1.10 billion in the second quarter ended June 2020. IQV’s chairman and CEO Ari Bousbib said, “Against the background of the ongoing COVID-19 situation, we delivered second-quarter results that exceeded our expectations. As we had assumed, the R&DS business saw a gradual increase in the accessibility of clinical research sites, exiting the quarter at 40 percent accessibility and currently at 53 percent, resulting in an improvement in the number of weekly onsite visits from the start of the quarter.” On July 23rd, IQV announced the Human Data Science Research Collaborative initiative against the backdrop of the COVID crisis. This has allowed licensed and approved academic researchers to use IQV platforms for conducting their medical research without any licensing and access fees. For the past three years, IQV’s revenues have grown at a CAGR of 11.9%, while net income and diluted EPS grew at a CAGR of 16.2% and 17.5%, respectively. Its EPS is expected to grow by 10.5% per annum over the next five years. Also, IQV has an impressive earnings surprise history, as it beat the street EPS estimates in each of the trailing four quarters. IQV hit its 52-week high of $170.51 in September, thereby gaining more than 105% since hitting its 52-week low of $81.79 in March. IQV is rated a Strong Buy in our POWR Ratings system, consistent with its sound business model and growth momentum. It also holds an A for Trade Grade, Buy & Hold Grade, and Peer Grade, and a B for Industry Rank. In the 58-stock Medical – Diagnostics/ Research industry, IQV is ranked #2. Guardant Health (GH) GH is a precision oncology company providing biopsy and molecular diagnostic tests, gene panels with immune-oncology applications, and analytical services around the world. It’s proprietary technologies for cancer detection and treatment include LUNAR-1, LUNAR-2, and Guardant 360. On August 24th, GH received emergency FDA authorization to use the Guardant-19 emergency testing kit for coronavirus detection testing. Before this, GH received FDA approval for Guardant 360 CDx for liquid biopsy and tumor mutation profiling. GH’s proprietary technology garnered attention in the second quarter ended in June 2020, allowing the company to generate significant profits. GH’s net revenues increased 23% year-over-year to $66.30 million during this time, with a 21% year-over-year in oncology revenue. Clinical customer testing increased 15% from the year-ago value. Gross profit increased by 18.3% from the same period last year to $43.90 million. GH’s liquidity position improved significantly with a $1.1 billion cash and cash equivalents balance. GH is expected to maintain this strong momentum in the upcoming quarters, as analysts estimate revenue to increase 8.2% year-over-year to $65.84 million in the third quarter ending September 2020. EPS is expected to grow 29.3% per year over the next five years. Also, GH beat the street EPS estimates in three out of trailing four quarters, which is impressive. GH has gained more than 65% since hitting its 52-week low of $55.90 in March. The stock is currently trading just 5% below its 52-week high. It’s no surprise that GH is rated a Strong Buy in our POWR Ratings system, with a grade of A in Trade Grade, Buy & Hold Grade and Peer Grade, and a B in Industry Rank. It is also ranked #8 out of 138 stocks in the Medical – Devices & Equipment industry. Want More Great Investing Ideas? 7 Best ETFs for the NEXT Bull Market Will Stocks Fall into Historical September Slump? 9 “BUY THE DIP” Growth Stocks for 2020 ISRG shares were trading at $704.81 per share on Thursday afternoon, down $14.67 (-2.04%). Year-to-date, ISRG has gained 19.23%, versus a 5.02% rise in the benchmark S&P 500 index during the same period."}]}