{"article": [{"url": "https://stocknews.com/news/wday-tal-tndm-tenb-four-upgraded-stocks-to-buy-now/", "published": 1597925300.0, "headline": "Four UPGRADED Stocks to Buy Now!", "body": "The POWR Ratings have been updated, pinpointing stocks worthy of your investing dollars and highlighting those who are no longer deserving of a Strong Buy or Buy rating. This exclusive system determines stock ratings based on a broad array of quantitative data. The numbers are crunched daily to ensure each POWR Rating reflects the stock’s merit (or lack thereof). Instead of sorting through the entirety of the POWR Ratings alterations on your own, rely on our team to highlight the most intriguing upgrades and downgrades. Consider adding the latest upgrades to your portfolio, removing those downgraded, and gradually expanding your nest egg. Below, we highlight four stocks recently upgraded in the POWR Ratings: Workday (WDAY), TAL Education Group (TAL), Tandem Diabetes Care (TNDM), and Tenable Holdings (TENB). 7 \"SAFE HAVEN\" Dividend Stocks for Turbulent TimesWorkday (WDAY) Software solutions are shaping human resources and financial management domains more and more with each passing day. WDAY provides such solutions, offering a cloud platform that joins HR and finance in a unified system facilitating analytical insights and prudent decision-making. WDAY solutions are used by Fortune 500 companies, medium-sized businesses, and more. The company also provides internet services, programming interfaces, and packaged connectors/integrations. Check out WDAY’s POWR Ratings, and you will find it has A grades in Trade Grade, Buy & Hold Grade, and Industry Rank, three components that make up the POWR Ratings. WDAY is ranked fifth of 84 stocks in the Software – Application space. Out of 22 analysts who have researched WDAY, 12 rate it a Buy, 9 rate it a Hold, and only one considers it a Sell. Though WDAY has not returned to its pre-COVID trading level, it is nearly there. The ever-growing push toward automation and efficiency (especially during the current recession) could help WDAY reach new heights, possibly before the end of the year. TAL Education Group (TAL) Tutoring services are becoming that much more important now that traditional in-school learning opportunities are limited due to the pandemic. TAL provides after-school tutoring services in a one-on-one format, online, and in small classes. The POWR Ratings show TAL has A grades in every POWR component except Industry Rank, which has a grade of B. TAL ranks 4th of 115 China stocks. Analysts have a price target of $85.03. TAL’s revenue is up 35% quarterly, indicating the company is hitting its stride and likely to trend even higher as the pandemic continues. Tandem Diabetes Care (TNDM) More than 10% of the United States population has diabetes. This health problem is likely to continue as the obesity rate trends upward, sedentary living becomes the norm, and people spend more time indoors, eating junk food while depressed due to the pandemic. TNDM stands to benefit from the spike in diabetes. This company provides diabetes-related products for people with diabetes. From insulin cartridges to insulin pumps and other forms of insulin delivery, TNDM’s products help countless diabetics enjoy a healthier and higher quality of life. The POWR Ratings show TNDM has A grades in each POWR Rating, but for its Peer Grade, which is a B. TNDM is ranked 15th out of 133 stocks in the Medical – Devices & Equipment category. Though TNDM is not yet in the black, its losses are decreasing. The company lost $24.8 million this past year, a considerable decrease from its $122.6 million loss in the prior year. Analysts have a price target of $118 for TNDM. If the stock reaches that price, it will have blown past its 52-week high of $110.80. Tenable Holdings (TENB) Mitigating cybersecurity risk is becoming increasingly important as many more businesses turn to the web for remote work. TENB helps companies understand and reduce internet risk. The company provides Cyber Exposure solutions enterprise software that offers a look into organizations’ cyber exposure, ultimately assisting businesses to translate technical information into valuable insights and significantly decrease cybersecurity risk. Analysts have set a price target of $37 for TENB. The stock’s POWR Ratings are nearly perfect with As in Trade Grade and Buy & Hold Grade, and Bs in Industry Rank and Peer Grade. TENB is ranked 5th of 23 stocks in the Software – Security space. TENB’s most recent earnings were much better than expected, surpassing Wall Street expectations. TENB might blast through its 52-week high of $36.51 by summer’s end. Want More Great Investing Ideas? The Best of StockNews 2 Step Process to Sell @ Market Top in September 9 “BUY THE DIP” Growth Stocks for 2020 WDAY shares were trading at $191.40 per share on Thursday morning, up $0.20 (+0.10%). Year-to-date, WDAY has gained 16.39%, versus a 5.64% rise in the benchmark S&P 500 index during the same period."}]}