{"article": [{"url": "https://stocknews.com/news/enph-azre-csiq-fslr-tan-4-solar-stocks-heating-up/", "published": 1597061300.0, "headline": "4 Solar Stocks HEATING Up", "body": "With the pandemic halting almost all business operations earlier this year, the solar energy industry suffered a major blow. The plummeting demand for solar energy in both residential and commercial properties led to widespread job losses, especially in the United States. With the gradual recovery of the global economy as businesses adjust their work environment under the “new normal,” the solar industry started recovering as well. In fact, since the overall market crash in March, solar stocks performed better than the rest of the clean energy sector as well as some of the technology players. This is evident from Invesco Solar ETF’s (TAN) gain of almost 90% since mid-March compared to the tech-heavy Nasdaq Composite’s gain of about 40% over the same time period. In addition to announcing several partnership agreements and expansion projects, most of the solar companies reported impressive financials for the second quarter. 7 Best ETFs for the NEXT Bull MarketWith rising stock prices and sound financials, investing in Enphase Energy, Inc. (ENPH), First Solar, Inc. (FSLR), Canadian Solar Inc. (CSIQ), and Azure Power Global Ltd. (AZRE) should help you make solid profits. Enphase Energy, Inc. (ENPH) ENPH designs, manufactures, and sells home energy solutions such as microinverter systems to the photovoltaic industry globally. Its semiconductor-based microinverter converts individual solar molecule energy and combines it with its patented networking and software technology for energy monitoring and control services. The company also provides AC battery storage systems, Envoy communications gateway, and Enlighten cloud-based monitoring services. Though ENPH’s revenue for the second quarter ending June 2020 indicates a year-over-year decline, the company reported a record non-GAAP gross margin of 39.6%. Its worldwide Net Promoter Score of 66% this quarter indicates a slight increase from 64% in the previous quarter. To compensate for the negatives caused by the pandemic, ENPH opened online stores in Europe and Australia and launched an online Enphase community. On June 1st, ENPH announced its expansion plan to Poland through a partnership with solar distributor SmartX Sp. z.o.o. Also, on July 15th, it collaborated with Maxeon Solar Technologies to manufacture a factory-integrated Enphase IQ microinverter by the fourth quarter for residential customers worldwide. ENPH expects its third quarter revenues to be within $160- 175 million and non-GAAP gross margin to be in the range of 37-40%, excluding stock-based compensation. Though the consensus EPS estimate for the third quarter ending September 2020 indicates a year-over-year decline, ENPH surpassed market estimates in each of the trailing four quarters, which is impressive. ENPH gained more than 255% to hit its 52-week high on August 6th after hitting its year-to-date low of $21.49 in March. How does ENPH stack up for the POWR Ratings? A for Trade Grade A for Buy & Hold Grade B for Industry Rank A for Overall POWR Rating You can’t ask for better. It is also ranked #6 out of 14 stocks in the Solar industry. First Solar, Inc. (FSLR) FSLR operates in two major segments — Modules and Systems — to provide photovoltaic solar energy solutions internationally. The Modules segment develops cadmium telluride solar modules to convert sunlight into electricity, while the Systems segment provides various power plant solutions. On August 6th, FSLR announced its commitment to power 100% of its global photovoltaic solar manufacturing operations renewable energy by 2028. It plans to transition its facilities located in the United States to carbon-free electricity by 2026. On July 23rd, FSLR entered into an agreement with Renewable Power Group of Goldman Sachs Asset Management to power American Kings Solar project with FSLR’s series 6 photovoltaic modules. FSLR also sold its North American Operations and Maintenance Business to NovaSource Power Services. FLSR’s second quarter results were impressive, as revenue increased 20.6% quarter-over-quarter and 9.8% year-over-year to $642 million. Its restricted cash flow balance increased $44 million to $1.64 billion in the second quarter. The consensus EPS estimate of $0.58 for the third quarter indicates a 100% rise year-over-year. The street revenue estimate of $683.73 million for the upcoming quarter indicates a 25% increase from the year-ago value. FSLR hit its 52-week low of $28.47 on March 18th amid the virus-driven market crash. It gained more than 175% to hit its 52-week high of $78.54 on August 7th. FSLR is rated a Buy in our POWR Ratings system, consistent with its impressive performance in the second quarter. It holds an A in Trade Grade, and a B in Buy & Hold Grade and Industry Rank. Out of 14 stocks in the Solar industry, FSLR is currently ranked #2. Canadian Solar Inc. (CSIQ) CSIQ develops and manufactures solar power products such as solar ingots, wafers, cells modules, etc. through two segments – module and Systems solutions (MSS) and Energy. Its MSS segment operates to design, develop, manufacture, and sell a range of solar power products, while the energy segment develops and sells solar power projects and electricity. CSIQ entered into two power purchase agreements to acquire 274 MWp solar power projects from Braskem S.A. and Copel Energia in Brazil. In exchange, CSIQ plans to build a 152 MWp project in the State of mine Gerais and a 122 MWp project in the State of Pernambuco. CSIQ started the construction of a 10 MWp Siemz solar power plant in Germany on August 4th. CSIQ plans to list its MSS business in China’s stock market, giving the company access to huge amounts of capital to fund its expansion projects and research and development departments. For the second quarter ending June 2020, CSIQ’s gross margin increased to 21.2% from 17.6% in the second quarter of 2019. Its total module shipments increased 35.5% year-over-year to 2,905 MW in this quarter. CSIQ’s operating expenses of $102 million for the second quarter indicates a year-over-year decrease of 17%. CSIQ has an impressive earnings surprise history, as it surpassed consensus EPS estimates in each of the trailing four quarters. The consensus revenue estimate of $894.19 million for the third quarter ending September 2020 indicates a 17.7% year-over-year increase. CSIQ gained more than 120% since hitting its 52-week low of $12 on March 18th to hit its 52-week high of $26.72 on August 7th. It’s no surprise that CSIQ is rated a Strong Buy in our POWR Ratings system. It has a grade of A in Trade Grade & Buy and Hold Grade, and a B for Industry Rank. In the 14-stock Solar industry, CSIQ is ranked #7. Azure Power Global Ltd. (AZRE) AZRE owns and operates solar power plants in India under long term contracts with government agencies, non-governmental energy distribution companies, and commercial customers. It has 43 utility-scale projects and multiple commercial rooftop projects with a combined capacity of 1,808 MWp. AZRE’s Operating Megawatts increased 25% year-over-year in the fourth quarter ending March 31st 2020. Operating and Committed Megawatts of 7115 MWs increased 112% from its year-ago number. AZRE’s revenues of $48.7 million increased 29% year-over-year. The street revenue estimate of $50.94 million for the first quarter ending June 2020 indicates a 9.9% growth year-over-year. AZRE’s EPS is expected to grow at 108% annually over the next 5 years. AZRE gained more than 75% since hitting its year-to-date low of $11.75 on January 21st amid the pandemic-driven economic slump. It’s no surprise that AZRE is rated a Strong Buy in our POWR Ratings system. It also has a grade of A for Trade Grade, Buy & Hold Grade and Peer Grade, and a B for Industry Rank. The stock is also ranked #5 out of 14 stocks in the Solar industry. Want More Great Investing Ideas? 3 Possible Directions for the Stock Market from Here How to Trade THIS Stock Bubble? 9 “BUY THE DIP” Growth Stocks for 2020 ENPH shares fell $0.02 (-0.03%) in after-hours trading Monday. Year-to-date, ENPH has gained 174.93%, versus a 5.33% rise in the benchmark S&P 500 index during the same period."}]}