{"article": [{"url": "https://stocknews.com/news/psx-ago-wttr-mrc-avoid-these-recently-downgraded-stocks/", "published": 1598616500.0, "headline": "AVOID These Recently Downgraded Stocks", "body": "Most investing gurus recommend a buy and hold strategy in which you pinpoint stocks with the best long-term prospects, buy and hold them for years. However, this strategy has the potential to backfire unless you reassess the merits of your portfolio holdings as time progresses. Some businesses lose their competitive advantage over time. Our exclusive POWR Ratings system identifies the stocks worthy of buying and those that should be sold. It is vital that you take a close look at the POWR Ratings downgrades just as often as you analyze the upgrades to determine which stocks should be removed from your portfolio. Below, we provide a look at four stocks recently downgraded to Strong Sell ratings: Phillips 66 (PSX), Assured Guaranty (AGO), Select Energy Services (WTTR), and MRC Global (MRC). 7 Best ETFs for the NEXT Bull MarketPhillips 66 (PSX) It was not long ago when PSX was a hot stock worthy of a nearly investor’s portfolio. However, fuel refined and sold by PSX is quickly being replaced by electricity. If PSX does not pivot to renewable energies before the competition, it will lose considerable market share. The POWR Ratings reveal PSX has F grades in its Trade Grade and Buy & Hold Grade POWR components. The stock’s best POWR Component Grades are Ds in its Industry Rank and Peer Grade. PSX is also ranked in the bottom half of all Energy – Oil & Gas stocks. PSX price returns are negative going back to 2017, except in 2019. PSX has a -33% one-year return and a -19% price return across the past three years. It might be best to avoid Stay PSX until it makes meaningful headway in the renewable energy space. Assured Guaranty (AGO) AGO is in the business of providing credit enhancement solutions for mortgages, structured financing, and public financing. AGO is ranked last out of all the publicly traded companies in the Insurance – Title industry. The stock has F grades in both Trade Grade and Buy & Hold Grade. Furthermore, AGO has D grades in Industry Rank and Peer Grade. Check out AGO’s price returns, and you will see an abundance of red. AGO has a three-month price return of -20.94%, a six-month price return of -46.04%, and a year-to-date price return of -55%. This is not a great time to be invested in the finance and credit industries. AGO has regressed right back down to its coronavirus sell-off price around $19 and will likely remain there until the economy picks up steam. Select Energy Services (WTTR) Water solutions will be money-makers as we head into a future where water is the equivalent of liquid gold. However, water solutions tailored to the oil and gas industries are less valuable as society gradually transitions away from fossil fuels. This is why WTTR has a murkier future. While WTTR’s services for hydraulic fracturing and other water-related services are important now, they might not prove as valuable in the years to come. The POWR Ratings reveal WTTR has F grades in Trade Grade and Buy & Hold Grade. The stock has D grades in Peer Grade and Industry Rank. WTTR has a year-to-date price return of -47%. The stock has a three-year price return of -65.51%. It might take some time for WTTR to return to its pre-covid trading price of $7-$8. MRC Global (MRC) Savvy investors understand that there might be better places to park their money than a company that distributes valves, pipes, and fittings. MRC might have qualified as a stock worth your attention a decade ago, but this company is no longer en vogue. MRC products are tailored to the needs of oil and gas businesses. These industries are losing market share to businesses that provide clean and renewable energy sources. MRC has F and D grades in its POWR Ratings components. Furthermore, MRC has price returns in the red. MRC’s year-to-date price return is -58%. The stock has a three-year price return of -64%. Take a look at the MRC news feed, and you will find nothing positive of note published regarding the company’s prospects over the past ten months. Want More Great Investing Ideas? 7 Best ETFs for the NEXT Bull Market Why Stocks Could Drop 20% in September? 9 “BUY THE DIP” Growth Stocks for 2020 PSX shares were trading at $61.54 per share on Friday morning, up $1.28 (+2.12%). Year-to-date, PSX has declined -42.69%, versus a 9.59% rise in the benchmark S&P 500 index during the same period."}]}