{"article": [{"url": "https://stocknews.com/news/baba-crm-work-nvda-4-growth-stocks-to-buy-as-the-market-continues-to/", "published": 1598616500.0, "headline": "4 Growth Stocks to Buy as the Market Continues to Rally", "body": "According to analysts and economists, the recession could be with us for a while. However, the stock markets have reached new highs in the past couple of weeks. A dovish monetary policy and booming tech industry have been the biggest drivers of the stock market. The S&P 500 gained more than 55% since its March lows, while the Nasdaq and the Dow Jones Industrial Average gained more than 80% and 55%, respectively, during this period. Though many analysts have raised concerns about an asset bubble, others believe that tech spending is going to continue increasing in the coming month and that the sector offers the best growth opportunities. Alibaba Group Holding Ltd. (BABA), NVIDIA Corporation (NVDA), Salesforce.com, Inc. (CRM), and Slack Technologies, Inc. (WORK) have reported record-high revenues and other financial metrics, and are expected to deliver even better results in the upcoming quarters. 7 \"SAFE HAVEN\" Dividend Stocks for Turbulent TimesAlibaba Group Holding Ltd. (BABA) BABA is one of the biggest e-commerce platforms in the world, with a market capitalization of over $750 billion. It has operations in four primary segments – Core Commerce, Cloud Computing, Digital Media and Entertainment, and Innovation Initiative, and others. BABA owns and manages both wholesale and retail marketplaces, third party online and mobile commerce platforms, monetization platforms as well as internet platforms for healthcare products among others. BABA’s digital technology and intelligence backbone Alibaba Cloud aim to be the world’s leading digital intelligence platform by 2023. On July 2nd, BABA announced that 38% of the Fortune 500 companies use Alibaba Cloud as their preferred cloud service provider. On August 11th, BABA signed a memorandum of understanding (MoU) with Total (China) Investment. The two companies agreed to a strategic collaboration to drive the digital transformation of their operations in China and globally. BABA has a significant stake in the electric vehicle maker XPeng, which spiked more than 40% in its debut on the New York Stock Exchange on Thursday. BABA reported impressive financials in the fiscal first quarter ended June 2020, stating that it completely recovered from the coronavirus shock. Revenues increased by 34% to $21.76 billion. Mobile monthly active users increased by 3.3% quarter-over-quarter to 874 million. Income from operations increased 43% from the year-ago value to $4.91 billion, while adjusted EBITDA rose 30% during the same time to $7.22 billion. Non-GAAP net income rose 28% from the same period last year to $5.58 billion. Its net cash from operating activities increased 48% year-over-year to $7.09 billion. The consensus EPS estimate of $2.11 for the second fiscal quarter ending September 2020 indicates a 14% rise year-over-year. Also, BABA has an impressive earnings surprise history, as it beat the street EPS estimates in each of the trailing four quarters. The consensus revenue estimate of $22.78 billion for the ongoing quarter indicates a 52.2% increase from the year-ago value. BABA gained more than 70% since hitting its year-to-date low of $169.95 in March. The stock hit its 52-week high in August. How does BABA stack up for the POWR Ratings? A for Trade Grade A for Buy & Hold Grade A for Peer Grade B for Industry Rank A for Overall POWR Rating. You can’t ask for better. It is also ranked #1 out of 115 stocks in the China industry. NVIDIA Corporation (NVDA) NVDA is a visual computing company developing computer graphics, artificial intelligence (AI), and graphics processing units. It operates through two segments – GPU and Tegra processor. Its main markets include Gaming, Professional Visualization, Data Center, and Automotive. On June 23rd, NVDA announced a collaboration with Mercedes Benz to develop a revolutionary in-vehicle computing system and AI-computing infrastructure. According to ML Perf benchmarks, NVDA broke 16 AI performance records and currently has the fastest AI training performance among commercially available products. With remarkable developments made in the technology sectors during the pandemic, NVDA generated record revenues for the second fiscal quarter ended in July 2020. Its net revenue increased 50% year-over-year to $3.87 billion, with data center revenue rising 167% from the year-ago value to $1.75 billion. Operating income rose 14% from the same period last year to $651 million while net income increased 13% year-over-year to $622 million. The consensus EPS estimate of $2.57 for the third quarter ending October 2020 indicates a 44.3% growth year-over-year. Furthermore, NVDA beat the street EPS estimates in each of the trailing four quarters, which is impressive. The consensus revenue estimate of $44.41 billion for the fiscal third quarter indicates a 46.2% improvement from the year-ago value. NVDA gained more than 185% to hit its 52-week high of $516.50 in August since hitting its year-to-date low of $180.68 in March. NVDA is rated a “Strong Buy” in our POWR Ratings system, consistent with its strong fundamentals and impressive performance in the prior quarter. It has an “A” in Trade Grade, Buy & Hold Grade, Peer Grade, and Industry Rank. In the 86 stock Semiconductor & Wireless Chip industry, it is ranked #2. Salesforce.com, Inc. (CRM) CRM provides enterprise cloud computing services for customer relationship management across the world. Its cloud services include Sales, Services, Marketing Cloud, and Commerce. It also provides a Customer 360 platform, MuleSoft Anypoint platform, Quip collaboration platform, and Tableau and Einstein analytics. CRM’s performance throughout the first half of 2020 is praiseworthy, despite the challenges imposed by the pandemic. On August 3rd, CRM was positioned as a leader by Gartner, Inc. (IT) in its 2020 magic Quadrants. As a result, S&P Dow Jones has announced that it would include CRM in the Dow Jones Industrial Average Index effective August 31st, 2020. CRM’s net revenue increased 29% year-over-year to $5.15 billion in the second fiscal quarter ended in July 2020. The remaining performance obligation of $30.60 billion increased by 21% from the year-ago value. Income from operations increased by 206.8% from the same period last year to $178 million. Gross profit rose 26.7% year-over-year to $3.84 billion, while net income improved 278.4% from the year-ago value to $2.62 billion. The consensus revenue estimate of $5.23 billion for the fiscal third-quarter ending October 2020 indicates a 16% improvement year-over-year. Though the consensus EPS estimate indicates no change from the year-ago value, CRM beat the street estimates in each of the trailing four quarters, which is impressive. CRM hit its 52-week low of $115.28 in march due to the pandemic drove market crash. The stock gained more than 140% since then, hitting its 52-week high of $278.28 in August. It’s no surprise that CRM is rated a “Strong Buy” in our POWR Ratings system, with an “A” in Trade Grade, Buy & Hold Grade, and Peer Grade and a “B” in Industry Rank. In the 47-stock Software – Business industry, CRM is ranked #1. Slack Technologies, Inc. (WORK) WORK is a documented application programming interface that acts as a team communication tool for businesses worldwide. It operates through software as a service (SaaS) model. With remote learning and working becoming the “new normal,” WORK has gained significant traction as a platform for virtual team collaboration. On July 23rd, WORK acquired Rimeto, which is a powerful cultural tool strengthening employee ties. It also collaborated with Amazon Web Services (AWS) on a multi-year deal to deliver solutions ensuring enhanced enterprise workforce collaboration. WORK is expected to announce its fiscal second-quarter results on September 8th. Though the consensus EPS estimate indicates negative earnings for the about-to-be-reported quarter, WORK beat the street EPS estimates in each of the trailing four quarters. WORK gained more than 165% since hitting its 52-week low of $15.10 in March. The stock hit its 52-week high of $40.07 in June. In our POWR Ratings system WORK holds a grade of “B” in Industry Rank. It is also ranked #28 out of 47 stocks in the Software – Business industry. Want More Great Investing Ideas? 7 Best ETFs for the NEXT Bull Market Why Stocks Could Drop 20% in September? 9 “BUY THE DIP” Growth Stocks for 2020 BABA shares were trading at $288.46 per share on Friday afternoon, up $4.29 (+1.51%). Year-to-date, BABA has gained 36.00%, versus a 9.73% rise in the benchmark S&P 500 index during the same period."}]}