{"article": [{"url": "https://stocknews.com/news/xlv-biv-vclt-cwb-4-strong-buy-etfs-with-dividends-yielding-more-than-2/", "published": 1597925300.0, "headline": "4 'Strong Buy' ETFs With Dividends Yielding More Than 2%", "body": "Many ETFs hold a basket of stocks that are in a particular sector or industry. This gives ETF investors an opportunity to reduce risk by diversifying their investments. In this current market environment, where there are many unknowns due to the global coronavirus pandemic, ETFs can help be useful for investors who are unsure of which individual stocks to buy. Today I have chosen to highlight four ETFs that have a “Strong Buy” rating according to our proprietary POWR Ratings system and also offer high quality dividends: Health Care Select Sector SPDR ETF (XLV), Vanguard Intermediate-Term Bond ETF (BIV), Vanguard Long-Term Corporate Bond ETF (VCLT), and SPDR Bloomberg Barclays Convertible Securities ETF (CWB). 7 Best ETFs for the NEXT Bull MarketHealth Care Select Sector SPDR ETF (XLV): XLV invests in a manner to attain price and yield performance results of the S&P Health Care Select Sector Index. This fund helps investors gain exposure to a variety of healthcare companies. Many of the holdings in XLV are front runners in the race for a Covid-19 vaccine. The returns could be significant if any of the stocks succeed with respect to finding a solution for the virus. Some of XLV’s main holdings are Johnson & Johnson (JNJ), UnitedHealth Group Inc. (UNH), Merck & Company Inc. (MRK) and Pfizer Inc. (PFE). XLV has an annual dividend of $2.52 which yields 2.34%. XLV has grown by more than 40% since it hit its 52-week low of $73.54 in March. The fund has returned 20.4% over the past year and 7.9% over the past three months. The expenses ratio for XLV of 0.13% is lower than its category average of 0.47%, which makes it a reasonable option to invest in health care. The fund has an AUM of $24.06 million. XLV is rated “Strong Buy” in our POWR Ratings system. It also has an “A” for Trade Grade, Buy & Hold Grade and Industry Rank. It is also ranked #1 out of 35 stocks in the Health & Biotech ETFs group. Vanguard Intermediate-Term Bond ETF (BIV) With an investment objective of reflecting returns of the Barclays U.S. 5–10 Year Government/Credit Float Adjusted Index which is a market-weighted bond index that covers investment-grade bonds with a dollar-weighted average maturity of 5 to 10 years, BIV aims to invest in a cost-efficient manner. BIV has an annual dividend of $2.28 which yields 2.44%. Since hitting its March lows due to the coronavirus induced market crash, BIV has gained more than 10%. The fund has returned 8.6% over the past year and 8.8% year to date. BIV has $14.06 billion in assets under management (AUM) and its expense ratio of 0.05% is much lower than its category average of 0.42%, which makes the fund a reasonable investment in its category. How does BIV stack up for the POWR Ratings? A for Trade Grade A for Buy & Hold Grade A for Industry Rank A for Overall POWR Rating You can’t ask for better. The stock is also ranked #3 out of 44 stocks in the Intermediate-Term Bond ETFs group. Vanguard Long-Term Corporate Bond ETF (VCLT) VCLT uses an indexing investment approach that tracks the performance of the Barclays U.S. 10+ Year Corporate Bond Index which has a long-term dollar-weighted average maturity. This ETF is used by investors to strengthen fixed income returns in their portfolios. VCLT has an annual dividend of $3.41 which yields 3.14%. Some of VCLT’s top holdings are GlaxoSmithKline PLC (GSK), Microsoft Corporation (MSFT), Johnson & Johnson (JNJ) and Northrop Grumman Corporation (NOC). VCLT has also been performing pretty well amid the geopolitical and health uncertainties. It has added more than 30% to its price since hitting lows in March. VCLT has an AUM of $5.23 billion. VCLT has returned 9.4% over the past year and 6.4% over the past three months. The fund’s expense ratio of 0.05% is lower than its category average of 0.19%, making it a low-cost option to bet on right now. It’s no surprise that VCLT is rated a “Strong Buy” in our POWR Ratings system. It also has an “A” for Trade Grade, Buy & Hold Grade and Industry Rank. In the 78-stock Corporate Bond ETFs group, it ranks #6. SPDR Bloomberg Barclays Convertible Securities ETF (CWB) This diversified fund aims to provide investment results that correspond generally to the price and yield performance of an index that tracks United States convertible securities markets with outstanding issue sizes greater than $500 million. CWB has an annual dividend of $1.69 which yields 2.49% and has grown by more than 50% since its March lows. The fund has returned 32.5% over the past year and 23.6% year-to-date. Two of CWB’s top holdings are Tesla Inc. (TSLA) and Wells Fargo & Company (WFC). The ETF has grown more than 60% since its March lows. CWB’s expense ratio of 0.4% is lower than its category average of 0.59%, making it a low-cost option to invest in convertible bonds. The ETF’s has $5.20 billion in AUM and a net asset value of $67.91. CWB’s POWR Ratings reflect this promising outlook. It has an overall rating of “Strong Buy” with an “A” for Trade Grade and Buy & Hold Grade and a “B” for Peer Grade and Industry Rank. Among the 19 stocks in the Convertible Bond/Preferred Stock ETFs group, it’s ranked #4. Want More Great Investing Ideas? The Best of StockNews 2 Step Process to Sell @ Market Top in September 9 “BUY THE DIP” Growth Stocks for 2020 XLV shares were unchanged in after-hours trading Thursday. Year-to-date, XLV has gained 5.72%, versus a 6.13% rise in the benchmark S&P 500 index during the same period."}]}