{"article": [{"url": "https://stocknews.com/news/sq-zs-wix-net-4-large-cap-software-stocks-surging-in-2020/", "published": 1597234100.0, "headline": "4 Large-Cap SOFTWARE Stocks SURGING in 2020", "body": "Software stocks have been one of the biggest beneficiaries of the “new normal.” Since the stock market bottom in March, the iShares North American Tech-Software ETF (IGV) is up 66%. In contrast, the S&P 500 is up 53% over the same timeframe. There is increased demand for software products with companies going remote and employees working from home. It’s turned out that many businesses can continue functioning with the right software tools even without offices. Many expect that this is going to mark a permanent shift as businesses can save money, and employees can enjoy a better quality of life without a daily commute. This will lead to increased sales and profits for software companies, as their products become integral to business operations. Square, Inc. (SQ), Zscaler, Inc. (ZS), Wix.com (WIX), and Cloudflare, Inc. (NET) are four large-cap software stocks that will thrive in the “new normal”. 7 Best ETFs for the NEXT Bull MarketSquare, Inc. (SQ) SQ develops and offers point-of-sale software for vendors across the globe. The company’s software services include inventory, sales reports, and receipts. In the second quarter, users of Square’s Cash App heavily traded Bitcoin, which led to significantly higher revenues in the second quarter. So far this year, SQ has delivered returns of more than 120%. If the second-quarter results of the company are any indicator, the momentum is likely to continue. For the quarter ended June 30th, the company reported a rise in gross profit of 167% from its Cash App compared to the same period last year. SQ’s revenue increased by 64% year-over-year during the quarter. SQ’s earnings surprise history is impressive as well, with the stock beating consensus EPS estimates in three of the trailing four quarters. How does SQ stack up for the POWR Ratings? A for Trade Grade B for Buy & Hold Grade A for Peer Grade B for Industry Rank B for Overall POWR Rating You can’t ask for better. The stock is also ranked #3 out of 141 shares in the Financial Services (Enterprise) industry. Zscaler, Inc. (ZS) ZS is a cloud security company that has operations worldwide. It operates in a diverse range of sectors, such as consumer goods, transportation, healthcare, media, and so on. In a significant win for the company, its ZIA platform became the first cloud security solution to earn a FedRAMP certification. The company has been working with Federal agencies and helping them move securely through the cloud. The earnings surprise history for ZS looks pretty good, as the company beat the consensus EPS estimates in each of the trailing four quarters. For the quarter ended April 29th, Zscaler delivered an earnings surprise of 250%. The consensus revenue estimate for the quarter ended in July 2020 indicates a year-over-year increase of 37.4% ZS’s recent price performance reflects its ability to capitalize on the current trend to go digital. The stock has gained more than 152% so far this year. It currently has a market capitalization of around $15.29 billion. It’s no surprise that ZS is rated “Buy” in our POWR Ratings system. It also has an “A” for Trade Grade. In the 23-stock Software – Security industry, it is ranked #3. Wix.com (WIX) WIX engages in helping companies and individuals create websites and develop their web pages. The company offers web design, web development, and management solutions to a range of global customers. The company has announced an offering of $500 million worth of senior convertible notes to qualified institutional buyers. This move will help WIX continue its growth. For the quarter ended June 30th, 2020, the company added over 9.3 million registered users to their platform, an increase of 64% year-over-year. Their revenue also increased 27% year-over-year. The overall stable performance of the company in the second quarter signals the strength of its business model in the “new normal.” Though WIX missed the consensus EPS estimate last quarter, it has beat estimates in the prior three quarters. The stock has gained around 119% year-to-date and currently has a market capitalization of $13.42 billion. WIX’s strong fundamentals are reflected in its POWR Ratings. It has an overall rating of “Buy” with an “A” in Trade Grade. Within the Internet – Services group, it’s ranked #3 out of 34 stocks. Cloudflare, Inc. (NET) NET offers several cloud-based services that focus on performance and reliability. The company’s services include video streaming and delivery, insights, advanced security, and so on. NET has announced a new offering called Workers Unbound, which is a cloud-computing platform that aims to be quicker and more cost-effective than existing alternatives. For the quarter ended June 30th, 2020, NET witnessed a rise in revenue of 48% year-over-year. NET has an impressive earnings surprise history with the company beating or meeting consensus EPS estimates in all of the trailing four quarters. NET has returned 124.6% year-to-date, and it has a market capitalization of approximately $11.63 billion. It’s no surprise that NET is rated “Buy” in our POWR Ratings system. It also has an “A” for Trade Grade. In the 23-stock Software – Security industry, it is ranked #5. Want More Great Investing Ideas? 9 “BUY THE DIP” Growth Stocks for 2020 How to Trade THIS Stock Bubble? 7 “Safe-Haven” Dividend Stocks for Turbulent Times SQ shares fell $0.03 (-0.02%) in after-hours trading Wednesday. Year-to-date, SQ has gained 122.22%, versus a 5.92% rise in the benchmark S&P 500 index during the same period."}]}