{"article": [{"url": "https://stocknews.com/news/hd-ko-ibm-gs-4-buy-rated-dividend-stocks-on-the-dow-jones/", "published": 1599739700.0, "headline": "4 \"Buy Rated\" Dividend Stocks on the Dow Jones", "body": "The Dow Jones Industrial Average (DJIA) is a price-weighted index that constitutes 30 blue-chip companies in the United States. While the stocks in the index have a long track record of outperformance, the overall index is underperforming the other two major indexes — the S&P 500 and the Nasdaq Composite — so far this year. The DJIA has a negative year-to-date return as the index’s components are primarily major industrial and financial stocks that were heavily affected by the COVID-led economic downturn. However, the DJIA has displayed a solid recovery since the market crash in mid-March, and investors now expect less fluctuation in the index after its recent reorganization. The SPDR Dow Jones Industrial Average ETF (DIA) presently has a dividend yield of 2.14% but it’s worth exploring top Dow dividend payers separately from the broader index. Home Depot, Inc. (HD), Coca-Cola Company (KO), International Business Machines Corporation (IBM), and Goldman Sachs Group, Inc. (GS) are four such fundamentally sound DJIA stocks that could be a steady source of income for you. 7 \"SAFE HAVEN\" Dividend Stocks for Turbulent TimesHome Depot, Inc. (HD) HD is a retailer of home improvement products such as building materials, lawn and garden products, and home improvement tools. The company also provides home maintenance services. HD has been operating a total of 2,293 retail stores in all 50 states and makes up 6.4% of the DJIA. While the four-year average dividend yield for HD is 2.21%, the current annual dividend of $6 translates into a 2.23% yield. During the past five years, the average dividend per share growth rate for HD was 23.7% per year. The most recent dividend declared by the company was $1.5 for its fiscal second quarter that ended in August 2020. Free cash flow for the firm increased 164.5% year-over-year to $8.65 billion in the last reported quarter. Despite challenges posed by the pandemic, HD had an excellent quarter. The company posted a top-line of $38.1 billion, growing 23.4% year-over-year. The company invested $480 million in additional benefits, including bonuses for associates in stores. The company also generated $9.1 billion cash flow from operations, a 237% improvement year-over-year. EPS for the quarter came in at $4.02, increasing 26.8% year-over-year and beating the consensus estimates by 8.4%. HD is focusing on supply chain management rather than relying on opening more stores to boost growth. It has recently announced the opening of three new distribution centers in Georgia to support the rising demand for flexible delivery and pick-up options. The street expects EPS to grow 10.5% in the current year. The stock closed yesterday’s trading session at $277.04, gaining more than 26% year-to-date. Additionally, HD is trading at a 5.4% discount to its all-time high of $292.95. How does HD stack up for the POWR Ratings? A for Trade Grade A for Buy & Hold Grade A for Peer Grade A for Industry Rank A for Overall POWR Rating You can’t ask for better. The stock is also ranked #1 out of 68 stocks in the Home Improvement & Goods industry. Coca-Cola Company (KO) KO is the world’s largest total beverage company that manufactures and markets various nonalcoholic beverages worldwide. The company offers over 500 brands in more than 200 countries and territories. KO has a 1.2% weightage in the DJIA. KO pays an annual dividend of $1.64, which translates into a yield of 3.27%. However, the company has a four-year average dividend yield of 3.36%. During the past ten years, the average dividend per share growth rate for KO was 6.9% per year. The most recent dividend declared by the company was $0.41 for its second quarter that ended in June 2020. It generated a free cash flow of $2 billion in its last reported quarter. The top-line declined 28% year-over-year to $7.2 billion, primarily driven by pressure in away-from-home channels. Moreover, the global unit case volume declined 16% during the quarter. Operating margins came in 30%, and remained relatively the same compared to the previous year. The company also generated $2.23 billion cash flow from operating activities during the quarter. EPS for the quarter came in at $0.42, beating the consensus estimate by 5%. The company is prioritizing a disciplined innovation framework, and increasing marketing and supply chain effectiveness. The street expects EPS to grow 3.4% next year. The stock closed yesterday’s trading session at $50.19, 16.5% below its all-time high of $60.13. Moreover, the stock has gained 5% over the past month. KO’s POWR Ratings reflect a promising outlook. It has an overall rating of “Buy” with a grade of “A” in Trade Grade, and a “B” in Peer Grade and Industry Rank. Among the 29 stocks in the Beverages industry, it’s ranked #8. International Business Machines Corporation (IBM) IBM operates as an integrated solutions company that provides information technology (IT) products and services worldwide. Its Cloud & Cognitive Software segment offers software for vertical and domain-specific solutions in health, financial services, and Internet of Things (IoT), and other services application areas. IBM has a 2.9% weightage in the index. While the four-year average dividend yield for IBM is 4.48%, the current annual dividend of $6.52 translates to a 5.33% yield. The stock has been consistently paying dividends each quarter for the last six decades. The most recent dividend declared by the company was $1.63 for the second quarter that ended in June 2020. IBM generated a free cash flow of $2.9 billion in the second quarter, a 14.7% increase year-over-year. It also reported a free cash flow margin of 16%. Despite the top-line declining 2% year-over-year in constant currency to $18.1 billion, the total cloud revenue was up 34% to $6.3 billion. Gross profit margin for the quarter stood at 48%. Operating cash flow for the quarter stood at $3.6 billion. Furthermore, IBM’s average cash flow over the past 5.75 years is greater than 96.5% of dividend paying stocks in the StockNews.com universe. EPS for the quarter came in $2.18, beating the consensus estimate by 5.3%. IBM entered into a strategic collaboration with Red Hat, Inc. (RHT), an open source solutions provider last year. The company has recently announced the availability of Red Hat Marketplace, a hybrid-cloud software marketplace deployed to manage enterprise applications across an organization’s IT infrastructure. Hence, the street anticipates EPS to grow 2.6% per year over the next five years. IBM is currently trading at $122.26, 23% below its 52-week high of $158.75. Additionally, the stock has gained more than 29% from its March lows. IBM is rated a “Buy” in our POWR Ratings system. It also has a grade of “A” for Industry Rank, and a “B” for Peer Grade. It is ranked #10 out of 28 stocks in the Technology – Hardware industry. Goldman Sachs Group, Inc. (GS) GS operates as an investment banking, securities, and investment management company worldwide. It functions through four segments: Investment Banking, Institutional Client Services, Investing & Lending, and Investment Management. GS occupies 4.84% of the index. GS’s annual dividend of $5 translates into a dividend yield of 2.37%. The company has a four-year average dividend yield of 1.57%. During the past 5 years, the average dividend per share growth rate for GS was 13% per year. The most recent dividend declared by GS was $1.25 for its second quarter that ended in June 2020. The company returned $626 million to its shareholders in the form of a dividend during the last reported quarter, despite generating a negative free cash flow of $12.3 billion. GS had an excellent second quarter as the company reported its second-highest quarterly revenue in history. Revenue for the quarter came in $13.3 billion, growing 41% year-over-year. The investment banking segment generated an all-time high revenue of $2.66 billion due to strong equity and debt underwriting. Fixed Income, Currency and Commodities (FICC) generated revenues of $4.24 billion, its highest quarterly performance in nine years, reflecting continued strong client activity in intermediation and financing. However, GS generated a negative cash flow from operations of $11.65 billion. EPS for the quarter came in at $6.26, beating the consensus estimate by 65.6%. Moreover, GS has put aside $650 million as provisions to make good for credit losses, if any. The company has recently launched its Marcus savings and lending platform with the Apple (AAPL) Card. Furthermore, in efforts to strengthen its consumer banking business, GS has placed a bid to invest in General Motors Company’s (GM) credit card unit. The street estimates EPS to grow 26.6% next year. GS ended yesterday’s trading session at $202.22, a 19% discount from its 52-week high of $250.46. The stock has gained more than 17% over the last six months. GS is rated a “Buy” in our POWR Ratings system, with a grade of “A” in Trade Grade and a “B” in Industry Rank. Out of 27 stocks in the Investment Brokerage industry, GS is ranked #7. Want More Great Investing Ideas? 7 Best ETFs for the NEXT Bull Market Will Stocks Fall into Historical September Slump? 9 “BUY THE DIP” Growth Stocks for 2020 HD shares were trading at $275.35 per share on Thursday afternoon, down $1.69 (-0.61%). Year-to-date, HD has gained 28.36%, versus a 6.34% rise in the benchmark S&P 500 index during the same period."}]}