{"article": [{"url": "https://stocknews.com/news/hd-shw-z-rh-rdfn-5-housing-stocks-that-recently-hit-new-highs/", "published": 1600949300.0, "headline": "5 Housing Stocks That Recently Hit New “Highs”", "body": "Home sales recently hit a 14-year record. Prices have also reached record highs. Investors who do not own housing stocks are missing an epic run. The question is how long the housing market will maintain its momentum. If the economy continues to rebound and another stimulus check is cut, there is a good chance that home prices will move even higher. As home building has resumed in full force, home building stocks have regained their momentum Here is a quick look at five housing stocks poised to climb even higher as the housing market continues to boom: Home Depot (HD), Sherwin-Williams Company (SHW), Zillow Group (Z), RH (RH), and Redfin Corporation (RDFN). 7 Best ETFs for the NEXT Bull MarketHome Depot (HD) Though HD does not build or sell houses, it directly benefits from building homes and the push to improve home value. HD has thousands of stores throughout the world. Everything you need to beautify and improve your home’s functionality is available at HD. The POWR Ratings show HD has “A” grades in each POWR component but for its Peer Grade, which is a “B.” HD is the top-ranked stock out of nearly 70 stocks in the Home Improvement & Goods industry. TipRanks reports the average analyst price target for HD is $310.89, which is 14.5% higher than its current price. HD has a reasonable forward P/E ratio of 24, yet it is near its 52-week high of $292.95, which means it may have some room to grow. Add in the fact that Congress is likely to pass a second stimulus check, and HD will benefit more as homeowners who have been stuck inside will undoubtedly consider spending the “Trump Bucks” on home improvements. Sherwin-Williams Company (SHW) New homeowners and those who build homes are willing to pay a premium for paint. SHW is clearly benefiting from the spike in home sales and home construction. SHW sells paint, coatings, and other similar products. Contrary to popular belief, SHW has operations outside of the United States. SHW also sells its paint and paint-related items in Asia, Europe, the Caribbean, and elsewhere. The POWR Ratings show SHW has “A” grades in each POWR component along with a top-5 ranking out of nearly 70 publicly traded companies in the Home Improvement & Goods industry. Out of 16 analysts who cover SHW, 11 rate it a “Buy,” four rate it a “Hold,” and only one rates it a “Sell.” Though SHW closed most of its retail locations amidst the pandemic, its retailing partners helped the company’s home projects sales segment spike more than 20% through June. SHW is climbing to new heights yet its forward P/E ratio is still under 30, meaning it has the potential to move even higher before investors consider it too steep of a price to pay considering the company’s actual value. Zillow Group (Z) When home-seekers search for properties, the vast majority turn to Z. Z provides the web’s best real estate listings along with other home-related services. Though Z’s customer service is a bit lacking, and the website does not always function as it should, most of those who use Z’s services are pleased with the experience. The POWR Ratings reveal Z has “A” grades in each POWR component but Industry Rank. Z is the top-ranked stock out of 57 stocks in the Internet industry. The stock returned to its pre-COVID trading range in June and has since approached triple digits. Powered by a spectacular second-quarter earnings report, Z’s momentum appears here to stay. RH (RH) The home furnishing space’s top luxury retailer is none other than RH. Though RH has somewhat of a low profile, it is gradually gaining more and more recognition with each passing day. From home décor to bath-ware, textiles, lighting, furniture, tableware, and beyond, RH sells a little bit of everything for homeowners. The RH POWR Ratings are nearly perfect: “A” grades in each POWR component but for its Buy & Hold Grade, which is a “B.” RH is ranked 10th out of nearly 70 stocks in the Home Improvement & Goods industry. Analysts have set an average price target of $412.40 on the stock. RH has a reasonably low forward P/E ratio of 22.46, even though it recently climbed from $320 to nearly $380. Redfin Corporation (RDFN) Ask anyone searching for a home on the web about the websites they venture to, and RDFN is bound to come up in conversation. RDFN’s web-based real estate marketplace facilitates the buying and selling of residential property. RDFN also provides settlement, title, and mortgage services. RDFN’s POWR Ratings are highlighted by “A” grades in Peer Grade and Trade Grade. RDFN is also ranked in the top 5 out of more than 40 Real Estate Services stocks. RDFN quarterly revenue is up by nearly 10% on a year-over-year basis thanks to the housing boom. The spike in homebuying just might help RDFN reach new heights in the year ahead. Want More Great Investing Ideas? 7 “Safe-Haven” Dividend Stocks for Turbulent Times When Does the Next Bull Run Start? Chart of the Day- See the Stocks Ready to Breakout HD shares were trading at $265.46 per share on Thursday morning, down $1.09 (-0.41%). Year-to-date, HD has gained 23.75%, versus a 1.07% rise in the benchmark S&P 500 index during the same period."}]}