{"article": [{"url": "https://stocknews.com/news/nvda-sq-pypl-cme-4-stocks-that-will-soar-if-bitcoin-makes-new-highs/", "published": 1594814900.0, "headline": "4 Stocks That Will SOAR if Bitcoin Makes New Highs", "body": "As exciting as the stock market has been this year, it’s nothing compared to the thrills of bitcoin. In 2017, Bitcoin rallied from $1,000 to $18,000… that’s a 1,800% increase! Since then, bitcoin has traded in a wide range, and public interest in it has diminished. However, the technology behind Bitcoin and its practical applications are increasing. 7 \"SAFE HAVEN\" Dividend Stocks for Turbulent Times(source: finviz.com) Think about the Internet and the dot-com bubble. Stocks zoomed higher as people became entranced by the possibilities of the Internet. The bubble popped when it became apparent that it was going to take a long time for companies to make profits. Flash forward 19 years and we look back at Amazon (AMZN), which was trading at $18 in 2001 and is now at $3,000. Apple (AAPL) was trading $1.38 and now is at $388. A similar case could be made for Bitcoin. Its bubble burst in late 2017. Its potential was and remains intoxicating, but there was a lack of commercial, real-world applications. This limited its appeal to the average person. This is now beginning to change as many businesses are integrating it into their products. Another positive development for bitcoin is that it can allow people in countries with poor financial systems a simple and convenient way to transfer and store money. In the US, we take a stable currency for granted, but in many countries, bitcoin is more reliable and trusted than their domestic currency. In a way, it has the potential to be a digital form of gold which is a store of value and accepted everywhere, except that it’s on the cloud. History shows that periods of economic instability, political unrest, and governments stimulating the economy are bullish for gold prices. It’ll be interesting to see if this will be a catalyst for bitcoin. These factors could result in the bitcoin bull market resuming again. Just like the aftermath of the dotcom bubble was an opportunity, history may be repeating. Another boom in bitcoin prices would also be a major catalyst for companies who are involved in the sector. Here are four stocks which would soar if bitcoin makes new highs: NVIDIA (NVDA) NVDA is the market leader in graphic processing units which is the primary component of mining cryptocurrency. Mining means processing transactions on the blockchain. At some point, a miner is then rewarded with newly-issued bitcoin. The demand and profitability of mining increase with bitcoin’s price. New highs in bitcoin would lead to surging demand for NVDA’s crypto-focused GPU chips. In 2017 during bitcoin’s last bubble, NVDA’s stock gained 150%. NVDA also has a strong position in other segments like servers, AI, and self-driving cars. The POWR Ratings is also positive on the stock, as it has a Strong Buy rating. It has an “A” across all categories including Trade Grade, Peer Grade, Buy & Hold Grade, and Industry Rank. It’s ranked #2 out of 86 semiconductor and wireless chip stocks. Square (SQ) SQ’s Cash app is quickly becoming the most popular way for people to buy and sell bitcoin. Before, someone would have to open an account on an unfamiliar, crypto exchange. In 2019, SQ had $500 million in bitcoin sales. It also has its division devoted to crypto that’s working on creating apps for consumers and merchants utilizing bitcoin. Founder and CEO Jack Dorsey is a big believer in bitcoin and sees it becoming the “native currency” of the Internet. POWR Ratings rates SQ a Strong Buy. It has an “A” for Trade Grade, Buy & Hold Grade, and Industry Rank with a “B” for Peer Grade. Among the Financial Services (Enterprise) group, it’s ranked #3 out of 137. Paypal (PYPL) PYPL is the largest payment processor online. It has 350 million users and had 3.6 billion transactions in its last quarter. Currently, it’s working on a solution so its users can buy and sell bitcoin within its app. PYPL wants to keep up with SQ which has grown in popularity due to this feature. It also sees bitcoin as being something that is increasingly being weaved into the fabric of the Internet. For bitcoin, the news is positive, as it will lead to increased demand. According to the POWR Ratings, PYPL is rated a Strong Buy. It has an “A” for Trade Grade, Buy & Hold Grade, and Peer Grade with a “B” for Industry Rank. Among Consumer Financial Services stocks, it’s ranked #1 out of 45. CME Group (CME) CME is the world’s largest exchange for futures, options, and derivatives. It has also created a market for bitcoin futures contracts. This makes bitcoin accessible to Wall Street and larger financial institutions. While SQ is the intermediary making it easy for the consumer to buy bitcoin, CME is doing the same for institutional investors. Many see crypto becoming an asset class like commodities or bonds that institutions will want exposure to. As trading volumes and interest in bitcoin increases, CME will see increased revenues. Want More Great Investing Ideas? 9 “BUY THE DIP” Growth Stocks for 2020 Top 5 WINNING Stock Chart Patterns 7 “Safe-Haven” Dividend Stocks for Turbulent Times NVDA shares . Year-to-date, NVDA has gained 74.04%, versus a 1.03% rise in the benchmark S&P 500 index during the same period."}]}