{"article": [{"url": "https://stocknews.com/news/se-history-suggests-this-red-hot-software-stock-could-soar/", "published": 1599739700.0, "headline": "History Suggests This Red-Hot Software Stock Could Soar", "body": "Software giant and internet platform provider Sea Ltd. (SE) has seen a relatively steady climb up the charts in 2020. In fact, not only has the equity surged 252% year-to-date, but it managed to be one of the few stocks to avoid a drastic selloff alongside the broader market in mid-March. A brief floor at the $36 level kept the shares intact during this time frame, while in more recent months, the 40-day moving average has captured multiple pullbacks of its own. In fact, more growth could be on the horizon for Sea’s stock — if the past is precedent. Specifically, according to a recent study from Schaeffer’s Senior Quantitative Analyst Rocky White, SE – in the midst of a 9.1% monthly deficit — has come within one standard deviation of its 40-day moving average after a lengthy stretch above the trendline, defined for this study as having traded north of the moving average 60% of the time in the past two months and in eight of the last 10 trading days. White’s modeling shows six similar signals occurring in the past three years. One month after these signals, Sea stock was higher 67% of the time, and averaged a 21-day return of 13.8%. Meanwhile, one week after these signals, SE was higher 83% of the time, and averaged a five-day gain of 6.9%. A move of similar magnitude from the security’s Wednesday close of $142.03 would put the equity at $161.63 one month from now, and $151.83 next week. That’s within a chip-shot of SE’s Sept. 2 record high of $165.23. 7 Best ETFs for the NEXT Bull MarketMeanwhile, analyst attention is leaning heavily optimistic on the security. Specifically, seven of the eight covering brokerage firms sport a “buy” or better rating heading into today, with zero “sells” on the books. Meanwhile the stock’s 12-month average price target comes in at $167.80, a nearly 20% premium to current levels. So while tailwinds stemming from shift in analyst attention is likely not imminent, a short squeeze could be. Short interest on Sea stock has been inching higher, up by nearly 2% during the most recent reporting period. Nevertheless, the 27.37 million shares sold short still accounts for 9.4% of the stock’s total available float. At SE’s average pace of daily trading, it would take short sellers just over one week to buy back their bearish bets. That’s an ample amount of pessimism that can hit the market and fuel an unwind. Looking toward options, a preference for calls looks evident. Within the past 10 days, 12,822 calls have been exchanged, compared to a slim 3,784 puts. In fact, Sea stock’s Schaeffer’s put/call open interest ratio (SOIR) of 0.81 ranks in the low 29th percentile of all other readings from the past year, implying short-term options traders have been more call-biased than usual during the last 12 months. It’s much the same when looking longer term on the security, with 77,259 calls compared to 18,420 puts having been traded in the last 50 days on SE. Further, the stock’s Schaeffer’s Volatility Scorecard (SVS) sits at 98 out of 100. In simpler terms, this means SE has tended to exceed option traders’ volatility expectations during the past year — a boon for option buyers. Keeping track of the week’s stock market activity is no easy feat. Our Schaeffer’s Market Mashup podcast gives you a quick 15-minute look at hot-button investing news and trends, as well as interviews with analysts and traders to help you craft a rock-solid options strategy. Tune into the latest episode of Market Mashup to up your investment game. SE shares rose $0.50 (+0.36%) in after-hours trading Thursday. Year-to-date, SE has gained 246.84%, versus a 4.81% rise in the benchmark S&P 500 index during the same period."}]}