{"article": [{"url": "https://stocknews.com/news/tsm-avgo-txn-3-hot-semiconductor-stocks-for-the-rest-of-the-year/", "published": 1600949300.0, "headline": "3 HOT Semiconductor Stocks for the Rest of the Year", "body": "The market is encountering its first, major correction since the March bottom. How prices react to these conditions will help determine whether the rally was the start of a new bull market or the beginning of a bear market. The semiconductors are one area to look for clues It’s outperforming and showing signs of turning higher. These companies have also shown continued earnings growth and increased guidance. Below, we provide a look at three of the semiconductor industry’s hottest stocks: Taiwan Semiconductor Manufacturing Company (TSM), Broadcom (AVGO), and Texas Instruments Incorporated (TXN). 7 Best ETFs for the NEXT Bull MarketTaiwan Semiconductor Manufacturing Company (TSM) You should feel quite confident investing in the largest integrated circuit foundry in the world, even if the stock market continues to dip daily. TSM’s overarching aim is to build itself into one of the top semiconductor businesses in the world – a goal it is likely to achieve at some point shortly. TSM has been on fire of late, jumping from $67 on July 21 up toward $85 by the month’s end and even breaking through this level in September. Some investors took their profit off the table, sending TSM down to $80 yet it appears as though this is the stock’s new floor. The POWR Ratings show TSM has A grades in each POWR Component but for its Industry Rank which is graded as a B. TSM is ranked 6th of nearly 90 publicly traded companies in the Semiconductor & Wireless Chip space. Out of the 10 analysts who have performed a deep dive into TSM, nine rates it a Buy, zero recommend holding, and the only one advises selling. Though TSM spiked in recent months, it still has a fairly low forward P/E ratio of 25, considering it is a high-flying tech stock. TSM’s expertise in advanced chip manufacturing should buoy its stock even if the rest of the market nosedives in the upcoming months. The bottom line is TSM’s chips are building blocks of the new economy, meaning the stock should hold strong regardless of the state of the economy and the stock market as a whole. Broadcom (AVGO) Mixed-signal and digital signal semiconductor devices are becoming increasingly important as our economy and society undergo a tech revolution. AVGO designs make and supply these devices. Furthermore, AVGO is making an effort to bolster its infrastructure software offerings. The POWR Ratings show AVGO has A grades in each POWR Component along with a B Industry Rank. AVGO is ranked first of 86 stocks in the Semiconductor & Wireless Chip category. TipRanks reports the average price target for AVGO is $405.48, meaning it has more than 14% upside. AVGO has a surprisingly low forward P/E ratio of 15.95. Check out AVGO’s chart since its coronavirus selloff down to $167 and you will be quite impressed. This stock has steadily climbed upward to $375 in early September. AVGO executives state the company’s fourth-quarter revenue will increase by more than 10% on a year-over-year basis. The analysts anticipate AVGO earnings and revenue will spike 3% and 6%, respectively. Furthermore, AVGO has a $15 agreement with Apple for chip orders across the next four years. The stars have aligned for AVGO to reach new heights. If this stock dips during the September selloff, scoop it up and hold it for the long haul. Texas Instruments Incorporated (TXN) TXN makes digital signal processing, mixed-signal, and analog integrated circuits in the United States, Europe, and Asia. The TXN Power Ratings are solid across the board: A grades in the Peer Grade and Trade Grade components and B grades in the remaining components. TXN is ranked second of 86 stocks in the Semiconductor & Wireless Chip category. TXN is one of the market’s hottest stocks yet it is still priced below the average analyst price target of $141.52. This means TXN has more than a 3.5% upside remaining. TXN’s latest quarterly reports indicate there is a rising demand for the company’s chips used in personal electronics and healthcare. TXN was priced at $147 less than a couple of weeks ago. Buy this stock on the temporary dip, hold it for at least a couple months, and reassess your position at that point. Want More Great Investing Ideas? 7 Best ETFs for the NEXT Bull Market Is the Stock Market Correction Over? Chart of the Day- See the Stocks Ready to Breakout TSM shares were trading at $78.84 per share on Thursday afternoon, up $0.92 (+1.18%). Year-to-date, TSM has gained 38.08%, versus a 2.44% rise in the benchmark S&P 500 index during the same period."}]}