{"article": [{"url": "https://stocknews.com/news/crwd-chkp-net-pfpt-4-top-cybersecurity-stocks-to-protect-your-portfolio/", "published": 1596024500.0, "headline": "4 Top Cybersecurity Stocks to PROTECT Your Portfolio", "body": "Business owners and managers have never been more concerned with cybersecurity. Fewer people are working in offices, more people are working from home, and the number of cyber attacks continues to increase with each passing day. Home networks are particularly vulnerable as they lack the fortifications of business networks, making cyber-security safeguards more critical. Though the increasingly dangerous cyber landscape is undoubtedly a negative for those reliant upon the internet to conduct business and make a living, this phenomenon is sure to benefit the following stocks: Crowdstrike (CRWD), Check Point Software Technologies (CHKP), Cloudflare (NET) and Proofpoint (PFPT). Crowdstrike (CRWD) 7 \"SAFE HAVEN\" Dividend Stocks for Turbulent TimesIt is hard to believe technology has reached the point where artificial intelligence (AI) facilitates the protection of internet endpoints against online attacks. CRWD’s brass is mainly responsible for this progression. Headquartered in Sunnyvale, California, CRWD is one of the world’s leading cloud-delivered cyber-security providers. Take a look at CRWD’s POWR Ratings, and you won’t find any weaknesses. CRWD has above average grades in all POWR Components. Top analysts have set a price target of $115.10 for CRWD, which is more than 10% above its current price. The society-wide shift to the internet has helped this stock rebound from its coronavirus outbreak low of around $30, ascending beyond the $100 mark. Look for CRWD to return to its 52-week high of $118 and change as the pandemic continues, and more businesses shift their operations to the web, making CRWD’s services that much more valuable. Check Point Software Technologies (CHKP) Information stored and transferred online is in the crosshairs of cyber miscreants located across the globe and here at home. CHKP works to thwart malicious web attacks, providing IT security, including network security and data security. The POWR Ratings reveal CHKP has an A Trade Grade and B grades in the remaining three POWR Components. CHKP is ranked in the top 10 of more than 20 Software – Security stocks. Top analysts have set a price target of $126.06 for CHKP. CHKP has a forward P/E ratio of 18.34, meaning it has solid value at its current trading price of $120. CHKP could easily surpass its 52-week high of $130.65 in the months to come. Cloudflare (NET) Load up your favorite websites, and you might catch the NET logo and name before the homepage appears. NET, based in Austin, TX, prevents DDoS attacks and other internet attacks for more and more customers with each passing day. NET’s services also speed up web applications without adding any hardware, altering code lines, or installing software. More than 27 million internet properties rely on NET for cyber-security protection. The POWR Ratings show NET has an A Trade Grade and B grades for Buy & Hold and Industry Rank. NET is ranked in the top half of all Software – Security stocks. Top analysts are bullish on NET, setting a $39.33 price target. In all, 10 analysts recommend investors buy the stock, two recommend holding it, and none recommend selling. Proofpoint (PFPT) Large and medium-sized businesses are the most coveted clients for obvious reasons. These big boys have plenty of money to spend and are likely to remain in business for years or decades. PFPT tailors its data protection services to these comparably large businesses. PFPT’s solutions safeguard data against attacks, ensuring full compliance with ever-evolving regulatory compliance standards. The POWR Ratings reveal PFPT has an A Trade Grade, and a B Buy & Hold Grade. Check out PFPT’s analyst forecasts, and you will find bullish support: nine analysts recommend buying the stock, three recommend holding it, and zero recommend selling. The average analyst price target for PFPT is $144.91. Look for PFPT to trend toward its 52-week high of $133.58 in the weeks and months ahead. Want More Great Investing Ideas? 9 “BUY THE DIP” Growth Stocks for 2020 Newly REVISED 2020 Stock Market Outlook 7 “Safe-Haven” Dividend Stocks for Turbulent Times CRWD shares rose $0.06 (+0.05%) in after-hours trading Wednesday. Year-to-date, CRWD has gained 126.43%, versus a 2.05% rise in the benchmark S&P 500 index during the same period."}]}