{"article": [{"url": "https://stocknews.com/news/fdx-amgn-sig-stz-sui-top-5-large-cap-dividend-stocks-for-july-1-2020/", "published": 1593605300.0, "headline": "Top 5 Large Cap Dividend Stocks for July 1, 2020", "body": "The top winners in the large cap US dividend space for Wednesday, July 1, 2020 are FDX, AMGN, SIG, STZ, and SUI. Below is a recap of how they fared. Fedex Corp (FDX) Daily Price Recap Fedex Corp closed yesterday up 11.72% ($16.44); this denotes the 3rd day in a row an upward move has occurred. The price move occurred on stronger volume; specifically, yesterday’s volume was up 188.8% from the day prior, and up 1134.6% from the same day the week before. Let’s take a look at the daily price chart of Fedex Corp. As for FDX’s beta, it is currently lower than that of approximately 41.04% US dividend payers. 7 \"SAFE HAVEN\" Dividend Stocks for Turbulent TimesMake investment decisions regarding FDX using the data that counts. Learn more about POWR Ratings. Amgen Inc (AMGN) Daily Price Recap Amgen Inc came into today up 8.17% ($19.26) from the open of the day prior, marking the 2nd day in a row it has gone up. As for how volume fared, yesterday’s volume was up 154.04% from the previous day (Monday), and up 180.22% from Tuesday of the week before. Let’s take a look at the daily price chart of Amgen Inc. As for AMGN’s equity discount rate, it is currently lower than that of approximately 93.95% US dividend payers. Is AMGN a Buy, Hold or Sell? See the POWR Ratings now! Signet Jewelers Ltd (SIG) Daily Price Recap 10.96 was the closing price of the day for Signet Jewelers Ltd, resulting in today being one in which price moved up 6.72% ($0.69) from yesterday. As for how volume fared, yesterday’s volume was up 50.63% from the previous day (Monday), and up 28.26% from Tuesday of the week before. Here is a daily price chart of Signet Jewelers Ltd. Its beta is lower than 0.59% of US dividend stocks. What is the outlook for SIG? Use POWR Ratings for clearer insight into price direction. Constellation Brands Inc (STZ) Daily Price Recap Constellation Brands Inc came into today up 6.27% ($10.97) from the open of yesterday, marking the 3rd day in a row an increase has occurred. As for how volume fared, yesterday’s volume was up 158.83% from the previous day (Monday), and up 196.78% from Tuesday of the week before. Below is a daily price chart of Constellation Brands Inc. As for STZ’s annual compound dividend growth rate, it is currently higher than that of approximately NA% US dividend payers. Make investment decisions regarding STZ using the data that counts. Learn more about POWR Ratings. Sun Communities Inc (SUI) Daily Price Recap Sun Communities Inc came into today up 5.56% ($7.54) from the open of the previous day, marking the 2nd day in a row an increase has occurred. The change in price came along side change in volume that was up 2.07% from previous day, but down 5.67% from the Tuesday of last week. The daily price chart of Sun Communities Inc below illustrates. As for SUI’s dividend discount model value score, it is currently higher than that of approximately 13.54% US dividend payers. Make investment decisions regarding SUI using the data that counts. Learn more about POWR Ratings. To further your research on dividend stocks, check out our list of dividend stocks sorted by yield. Want More Great Investing Ideas? 9 “BUY THE DIP” Growth Stocks for 2020 Is the Bull S#*t Rally FINALLY Over? 7 “Safe-Haven” Dividend Stocks for Turbulent Times Top 3 Investing Strategies for 2020 FDX shares . Year-to-date, FDX has gained 4.62%, versus a -2.53% rise in the benchmark S&P 500 index during the same period."}]}