{"article": [{"url": "https://stocknews.com/news/nee-es-has-3-esg-stocks-millennials-are-piling-into/", "published": 1596629300.0, "headline": "3 ESG Stocks Millennials are Piling Into", "body": "Some of the future top stocks are likely in the Environmental, Social, and Governance (ESG) category. The category refers to companies in which compassionate capitalism is conducted in a useful manner that benefits both the planet and its inhabitants. We are quickly transitioning away from an era of reckless capitalism that was hell-bent on destroying the environment and wildlife. The future economy will be centered on sustainability both for our increasingly sensitive surroundings as well as animals and, most importantly, people. Millennials and Generation Z are flocking to ESG stocks as they have the growth potential that does not come at the cost of irrevocably damaging the planet. 7 \"SAFE HAVEN\" Dividend Stocks for Turbulent TimesExamples of such ESG stocks include NextEra Energy (NEE), Eversource Energy (ES), and Hasbro (HAS). NextEra Energy (NEE) Wind and solar power are the wave of the future. NEE, one of the world’s largest energy producers, has committed to generating power through both wind and solar sources. The S&P Global Ratings grade NEE with an 86 ESG score, one of the highest marks in the energy sector. NEE executives plan on reducing the company’s carbon dioxide emissions by nearly 70% in the next half-decade. Park your money in this renewable energy superstar, check in on it a couple of times each year, and likely find steady progress. The POWR Ratings show NEE has As in each POWR Component except for Industry Rank, which has a grade of B. NEE is ranked first out of 61 stocks in the Utilities – Domestic industry. Eversource Energy (ES) You rarely find an energy company committed to saving the environment. ES is one such company. This climate leader is striving toward being carbon neutral within the next decade by reducing its energy use and decreasing vehicle emissions. ES is an energy efficiency leader, investing half a billion dollars each year to minimize the company’s strain on the environment. The POWR Ratings show ES has an A Trade Grade and an A Peer Grade. ES is ranked in the top 10 out of more than 60 Utilities – Domestic stocks. Hasbro (HAS) It is quite interesting to learn HAS is one of the top ESG stocks. Though younger investors don’t play with HAS’s child-oriented toys, the company’s environmentally-friendly ways have certainly caught millennial investors’ attention. HAS is committed to slowing climate change, conducting business in an environmentally sustainable manner, and promoting human rights. Ethisphere Institute has ranked HAS as one of the World’s Most Ethical Companies for eight straight years. Analysts have set a price target of $85.67 for HAS, which is 14% higher than its current price. The company provides a dividend of 3.74% that is likely to be paid across posterity even though births in the United States recently hit an all-time low. Want More Great Investing Ideas? 9 “BUY THE DIP” Growth Stocks for 2020 How to Trade THIS Stock Bubble? 7 “Safe-Haven” Dividend Stocks for Turbulent Times NEE shares were trading at $283.78 per share on Wednesday afternoon, down $1.27 (-0.45%). Year-to-date, NEE has gained 18.45%, versus a 4.25% rise in the benchmark S&P 500 index during the same period."}]}