{"article": [{"url": "https://stocknews.com/news/msft-adbe-sap-3-top-software-stocks-to-buy-during-the-market-correction/", "published": 1599826100.0, "headline": "3 Top Software Stocks to Buy During the Market Correction", "body": "The stock market is witnessing a significant sell-off this month. The Nasdaq Composite Index has dipped more than 10% to trade below its 50-day moving average. It is too early to say if this is short-term market correction or the beginning of a larger move lower. But this selling spree has created an opportunity to buy legacy software stocks at discounted prices. The COVID-19 pandemic has accelerated the adoption of digitization. Not all software companies will survive the pandemic, as companies are reducing their IT spend on non-essential software. But they are prioritizing their spending on cloud computing, digital transformation, and artificial intelligence. The software-as-a-service (SaaS) market is highly competitive with many companies offering similar products. Over time, the market will consolidate, and only the ones with a large customer base will survive. The big players in this space, like Microsoft Corporation (MSFT), Adobe Inc. (ADBE), and SAP SE ADS (SAP), have the advantage. They have been in the software market for over 40 years and created a large installed base that is generating stable recurring cash flow. 7 \"SAFE HAVEN\" Dividend Stocks for Turbulent TimesMicrosoft Corporation (MSFT) Founded in 1975 by Bill Gates, MSFT made Windows operating systems a household name. Like all legacy software companies, MSFT transitioned from the boxed and licensed software to cloud services. In 2014, Satya Nadella became the CEO and led the company to the cloud revolution, with his “Mobile First, Cloud First” strategy. The software giant has also tried its hands on the hardware with Surface Pro Laptops and Xbox game consoles. After 45 years, Microsoft Windows is the No. 1 PC operating system, Microsoft Azure is No. 2 cloud service provider, and Microsoft Xbox is No. 2 game console. Its cloud business and Office 365 product suite are leading the remote working trend. In the last five years, MSFT has increased its revenue and EPS at a CAGR of 9.4% and 16%, respectively. This growth was reflected in its stock price that surged 390% over this period. It’s no surprise that MSFT is rated a “Buy” in our the POWR Ratings system. It also has an “A” for Trade Grade, Peer Grade, and Industry Rank, and a “B” for Buy & Hold Grade. In the 92-stock Software – Application industry, it is ranked #9. Adobe Inc. (ADBE) When you say digital, the first name that pops up is Adobe. Its Photoshop and PDF tools have made it a market leader in creative cloud and document productivity. The company’s growth hinges on the technology shift towards ‘all things digital’ and the pandemic has provided it the perfect growth environment. Its product suite of Creative Cloud (Photoshop and Illustrator) and Document Cloud (Acrobat PDF, Scan, and Sign) meets the digital needs of companies. ADBE has grown with time and changed its products according to the digital needs of its clients. Founded in 1982, it started with boxed and licensed software for Photoshop. It later expanded its offerings to documents. With the advent of the cloud, the company transitioned to cloud services between 2007 and 2012 under the leadership of CEO Shantanu Narayen. Today, it earns 89% of its revenue from subscriptions, which are recurring in nature. ADBE is now expanding into the emerging market of marketing, e-commerce, engagement, and analytics. It has packaged these offerings under its Digital Experience segment. However, it faces intense competition from giants like Salesforce.com (CRM), Oracle (ORCL), and SAP, as well as small companies like Shopify (SHOP) and DocuSign (DOCU). In the past five years, ADBE increased its revenue and EPS at a CAGR of 18.5% and 31%, respectively, organically and through acquisitions. Such strong growth drove ADBE’s stock up more than 500% in five years. Analysts expect the company’s growth spree to continue in the coming years. They expect its revenue to surge 14% in fiscal 2020 and 15% in fiscal 2021. The pandemic triggered the digitization trend, driving ADBE stock up as much as 60% so far this year. However, the stock is trading 15% below its all-time high after the recent market correction. This is the right time to buy this stock before it returns to the rally ahead of its fiscal 2021 third-quarter earnings release on September 15. ADBE is rated a “Buy” in the POWR Ratings. It holds straight “A” in Trade Grade, Peer Grade, and Industry Rank and a “B” for Buy & Hold Grade. It is also the #10 ranked stock in the Software-Application industry. SAP SE ADS (SAP) While MSFT and ADBE’s office suites are leading the digital trend, SAP continues to lead the enterprise application software for two decades. The growth story of SAP is quite interesting. In the 70s, four IBM engineers had a novel idea of enterprise resource planning (ERP) software that could automate business operations like payroll, finance, invoice, and supply chain management. They founded SAP in 1972 and benefited from strong demand and little competition. After 47 years, SAP has 440,000 customers worldwide and 200 million subscribers in the cloud. Over the years, many companies like Oracle and Workday (WDAY) posed strong competition in the enterprise software market. But they were unable to beat SAP because it already had a massive installed base. The mission-critical nature of its software made switching to an alternative system expensive, time-consuming, and complicated. The sticky nature of its software has helped SAP earn stable cash flows and pay regular dividends. It is generating more cash flow than 90.1% of positive cash flow stocks in the StockNews.com technology universe. After years of strong growth, SAP is in the mature growth stage. Its revenue and EPS increased at a CAGR of 6.5% and 3.9%, respectively, between 2015 and 2019. According to a new report published by the Information Services Group, many enterprises may delay their move to SAP’s upgraded S/4HANA ERP system due to economic uncertainty. SAP stock surged 26% year to date, but the market correction lowered its price by 6% from its all-time high. SAP is looking to boost its stock price with IPOs. It is planning to launch an IPO of its Qualtrics business, which it acquired in 2018. If this IPO succeeds, it could also consider launching an IPO for its expense management business Concur, procurement business Ariba, and human capital management business SuccessFactors. SAP’s POWR Ratings reflect this promising outlook. It has an overall rating of “Strong Buy”, with straight “A” for all four POWR rating components of Trade Grade, Buy & Hold Grade, Peer Grade, and Industry Rank. It holds #1 rank in the Software-Application industry. Investor Takeaway The software industry is leading the charge in the digitization age. The three legacy software companies — MSFT, ADBE, and SAP — should continue to grow for the foreseeable future. If you had invested $2,500 in each of the three stocks just five years ago, it would be worth about $34,000 today. The market correction has created an opportunity to buy these stocks at a discount. It’s not too late to invest in these stocks before they return to making new highs. Want More Great Investing Ideas? 7 Best ETFs for the NEXT Bull Market Will Stocks Fall into Historical September Slump? 9 “BUY THE DIP” Growth Stocks for 2020 MSFT shares were trading at $204.92 per share on Friday afternoon, down $0.45 (-0.22%). Year-to-date, MSFT has gained 30.98%, versus a 5.20% rise in the benchmark S&P 500 index during the same period."}]}