{"article": [{"url": "https://stocknews.com/news/csiq-csco-sne-3-tech-stocks-that-are-extremely-cheap-right-now/", "published": 1599653300.0, "headline": "3 Tech Stocks That Are Extremely CHEAP Right Now", "body": "The market finally bounced back after a few rough days. The Nasdaq composite index finished the day up 2.7%, and the S&P 500 index gained 2%. However, the market is still a ways away from their all-time highs. The Nasdaq was actually in correction territory as it was down over 10% from the September 2nd close through yesterday’s close. On Thursday, the S&P 500 had its worst trading day in over five months. The four-day drop can be attributed to profit-taking after five months of soaring prices. Even after today’s gains, the drop in the market allows us to grab tech stocks at a better valuation. In fact, some tech stocks are trading at extremely attractive valuations. These companies have been overlooked by the market and provide more potential for capital appreciation. 7 Best ETFs for the NEXT Bull MarketThere are three metrics I use to evaluate stocks. The first is the well-known price- to-earnings ratio (P/E). I look for stocks with a P/E of around fifteen or below. The second metric is the enterprise multiple, or EV/EBITDA ratio. This valuation ratio compares a company’s enterprise value (EV) to its earnings before interest, taxes, depreciation, and amortization (EBITDA). I typically look for EV/EBITDA of around ten or under. The last metric, which is my favorite, is the free cash flow yield, which measures a company’s free cash flow to its price. I look for a free cash flow yield of over 7%. Here are three strong technology stocks that are trading at very attractive prices: Canadian Solar (CSIQ), Cisco Systems (CSCO), and Sony (SNE). Canadian Solar (CSIQ) CSIQ is a Canadian solar power company. The company is an integrated provider of solar power products, services, and system solutions. It engages in designing, developing, and manufacturing solar ingots, wafers, cells, modules, and other solar power products. CSIQ operates through two business segments: the MSS segment and the Energy segment. The MSS segment involves the design, development, manufacturing, and sale of solar power products, and its Energy segment consists of solar power project development. The majority of the company’s revenue comes from the MSS segment. The company caters to a geographically-diverse customer base spread across the United States, China, Japan, the U.K., and Canada. It has also established a footprint in emerging markets like Brazil and India and expanded its global late-stage project pipeline into nations like Argentina, Australia, and South Korea. CSIQ has a strong pipeline of projects and carries out various acquisitions to consolidate its position. CSIQ currently has a free cash flow yield of 16.4%, a P/E ratio of 7.3, and an EV/EBITDA of 10.4, all reflecting its low valuation. The stock is currently rated a “Strong Buy” in our POWR Ratings system. It has a grade of “A” for Trade Grade and Peer Grade, and a “B” for “Buy & Hold Grade.” These are three of the four components that make up the POWR Ratings. It is also the #1 ranked stock in the Solar industry. I believe the company is well-positioned to benefit in the years ahead. The company recently announced it would list its Module and Systems Solutions business on China’s stock market. This should provide more access to capital. It will also help the company become more of an energy provider. This will mean more recurring-based revenue. Cisco Systems (CSCO) CSCO is the world’s largest hardware and software supplier within the networking solutions sector. Its infrastructure platforms group includes hardware and software products for switching, routing, data center, and wireless applications. Its applications portfolio contains collaboration, analytics, and Internet of Things (IoT) products. The company’s security segment includes Cisco’s firewall and software-defined security products. CSCO’s fourth business segment is technical support and advanced services offerings. The company should benefit from the strong adoption of its identity and access, advanced threat, and unified threat management security solutions due to increased internet traffic. The pandemic-induced work-from-home trend bodes well for its Webex video conferencing and business productivity offerings. The company’s Catalyst 9000 family of switches are poised for strong demand as well. CSCO has a P/E ratio of 15.12, and EV/EBITDA of 9.4, and a free cash flow yield of 8.5%. CSCO passes all my valuation metrics. While the company has experienced supply-chain constraints due to the pandemic, I view the company as a long-term Buy due to rising bandwidth consumption, increasing demand for data center solutions, and the business migration to cloud networking. The company has a strong balance sheet with a return on equity of 29.6% and a $29 billion cash position at the end of July. This should allow the company to increase its dividend, offer share buybacks, and look into acquisitions. Sony (SNE) SNE is a consumer electronics conglomerate with well-known brands, such as the Walkman, Vaio PCs, Xperia smartphones, Cybershot and Alpha digital cameras, and PlayStation video game consoles. The company operates in seven main business segments, including operating electronic appliances, games, devices and semiconductors, entertainment content, and financial services. The company sees strong growth in the games segment due to game software sales and PlayStation Plus subscriptions. As adults, teenagers, and children have been forced to stay at home due to the pandemic, the industry has seen a rise in video gaming. Many gamers are looking forward to the launch of PlayStation 5, scheduled to launch later this year. The company has also benefited from its business’s realignment to make Sony Financial Holdings a wholly-owned subsidiary. SNE has a P/E ratio of 15.6, a EV/EBITDA of 5.2, and a free cash flow yield of 9.5%, making this tech stock a bargain. The company outperformed both its earnings and revenues in its latest financial results. Earnings jumped 61.1% year over year. The company is rated a “Buy” in our POWR Ratings system. It has a grade of “A” in “Trade Grade” and “B” for “Buy & Hold Grade,” “Peer Grade,” and “Industry Rank.” It is also the #3 ranked stock in the Entertainment – Media Producers industry. SNE should do well over the next few years due to PlayStation 5, its gaming platform, and PS5 game releases. The company has a 60% market share for video game consoles, according to Statista. The company should also see sustained growth for its image sensor due to the rising demand for triple camera phones. Want More Great Investing Ideas? 7 Best ETFs for the NEXT Bull Market Will Stocks Fall into Historical September Slump? 9 “BUY THE DIP” Growth Stocks for 2020"}]}