{"article": [{"url": "https://stocknews.com/news/twlo-dt-estc-3-saas-stocks-to-invest-in-now/", "published": 1598443700.0, "headline": "3 SAAS Stocks to Invest in NOW", "body": "The software-as-a-service (SAAS) industry has emerged as a favorite during the pandemic, as the demand for their services has increased across the globe to facilitate the work-and-learn-from-home culture. The key advantage of SAAS companies over the other software companies is their subscription-based services which require users shelling out less money compared to buying software. Investors also like this model, because it ensures steady growth. Once, users start using a software product, they are less likely to switch, because data and applications are stored on it. There’s also cost in terms of new training for new software. Additionally, software businesses have high margins. As the pace of digital transformation is expected to accelerate in the near term, the demand for SAAS should keep growing. According to Valuates Reports, the global SAAS industry is expected to grow at a CAGR of 11.7% between 2020 and 2026. 9 \"BUY THE DIP\" Growth Stocks For 2020Companies such as Twilio Inc. (TWLO), Dynatrace, Inc. (DT), and Elastic N.V. (ESTC) stand to gain significantly from this booming industry. With impressive and high growth projections for the upcoming quarter, the shares of these companies could be good investments now. Twilio Inc. (TWLO) TWLO is a cloud-based communications platform that facilitates developers in building, scaling, and operating real-time communications within software applications. It offers Programmable Communications Cloud, Super Network, and Business Model for Innovators to customers. TWLO delivered an impressive performance for the second quarter ended in June 2020. Its total revenue increased 46% year-over-year to $400.80 million. Non-GAAP income from operations increased 533.3% year-over-year to $9.50 million. Dollar-based expansion rate rose 132% from the year-ago value, while the number of active accounts increased 24% from the same period last year. TWLO raised $1.25 billion through a public offering of its Class A shares as of August 11th, ensuring sufficient capital availability to fund its expanding operations in the future. TWLO reported the intended use of proceeds to meet general corporate expenses, mergers and/or acquisitions, refinancing of debt and to meet operating and capital expenses. The company expects its revenues to be in the range of $401-406 million in the third quarter ending September 2020, which is a 36-38% increase year-over-year. Though the consensus EPS estimate for the third quarter indicates a year-over-year decline, TWLO has an impressive earnings surprise history. TWLO beat the street EPS estimates in each of the trailing four quarters. The company surpassed the market EPS estimates by over 200% in the last reported quarter. TWLO gained more than 320% to hit its 52-week high of $288.81in August, since hitting its 52-week low of $68.06 in March. How does TWLO stack up for the POWR Ratings? B for Trade Grade B for Buy & Hold Grade B for Peer Grade B for Overall POWR Rating. It is ranked #2 out of 10 stocks in the Software-SAAS industry. Dynatrace, Inc. (DT) DT is a software intelligence platform offering enterprise cloud solutions to modernize and automate IT operations and improve customer experiences. Its primary services include AppMon, Classic Real User Monitoring, Network Application Monitoring, and Synthetic Classic. DT benefitted from the gaining popularity of software-oriented companies in the first half of 2020. On July 21st, DT extended its Software Intelligence Platform to ingest metrics from all services supported by Microsoft Azure Monitor. On July 30th, it received FedRAMP authorization at the moderate impact level for its complete software intelligence platform. In the first fiscal quarter ended June 2020, DT reported total revenues of $155.50 million, indicating a 27% rise from the same period last year. Annualized recurring revenue (ARR) increased 37% year-over-year to $601.40 million, while subscription revenue increased 34% from the year-ago value to $144.40 million. Non-GAAP operating income increased 87.5% year-over-year to $50.82 million, and non-GAAP net income rose 297% from the same period last year to $36.93 million. Growing demand is expected to drive DT’s fiscal second-quarter ending September 2020 performance even higher, with expected net revenue in the range of $159-161 million. Non-GAAP operating and net income estimates are in the range of $43-45 million and $27-28.5 million, respectively. DT’s recently raised capital worth $1.02 billion through a public offering of 25 million common shares on August 5th is expected to boost its growth even further. The consensus EPS estimate of $0.1 for the second quarter indicates a 66.7% improvement year-over-year. Moreover, DT beat the consensus EPS estimates in each of the trailing four quarters, which is impressive. DT gained more than 160% to hit its 52-week high of $44.65 since hitting its year-to-date low of $17.10 in March. DT is rated “Buy” in our POWR Ratings system, consistent with its growth momentum and industry strength. It has a “B” in Trade Grade, Buy & hold Grade, and Peer Grade. In the 10-stock Software- SAAS industry, DT is ranked #3. Elastic N.V. (ESTC) ESTC is a tech-based search company that allows customers to search through structured and unstructured data for various enterprise and consumer applications. Its proprietary Elastic Stack technology ingests and stores data in different formats from multiple sources to perform a search, analysis, and visualization. On August 19th, ESTC announced an update across its platform to provide a unified agent and new integrations for higher efficiency and enhanced user experience. It also introduced free one-click malware prevention and out of the box cloud detection features to ensure the security of remote workspace. ESTC’s EPS is expected to grow by 2.8% per annum over the next five years. Also, ESTC has an impressive earnings surprise history, as it beat the street EPS estimates in each of the trailing four quarters. ESTC hit its 52-week low of $39.01 in March and has gained more than 180% since then. The stock hit its 52-week high of $109.55 in August. It’s no surprise that ESTC is rated “Strong Buy” in our POWR Ratings system. It has an “A” in Trade Grade, Buy & Hold Grade, and Peer Grade. It is ranked #1 out of 10 stocks in the Software – SAAS industry. Want More Great Investing Ideas? The Best of StockNews 2 Step Process to Sell @ Market Top in September 9 “BUY THE DIP” Growth Stocks for 2020 TWLO shares were trading at $266.20 per share on Wednesday afternoon, up $16.69 (+6.69%). Year-to-date, TWLO has gained 170.86%, versus a 8.84% rise in the benchmark S&P 500 index during the same period."}]}