{"article": [{"url": "https://stocknews.com/news/am-kmi-vtr-avb-these-four-high-yield-stocks-make-value-investing-attractive-to-investors/", "published": 1594987700.0, "headline": "These Four High-Yield Stocks Make Value Investing Attractive to Investors", "body": "The financial news focuses on the major stock market indexes. These are the Dow Jones Industrial Average (DJIA), the S&P 500, and the NASDAQ Composite Index (NASDAQ). However, the effects of the coronavirus pandemic on different sectors of the economy has these indexes painting an incomplete picture of what’s happening in the U.S. stock market. Digging deeper into the market sectors shows both which stocks are overvalued and which groups may be deeply undervalued. A couple of charts tell the tale about the U.S. stock market to date in 2020. First up is a graph showing a dozen sectors into which the S&P 500 stocks are categorized. It is interesting to note that as of July 15, the S&P 500 index was right at even for the year (down 0.1%). 7 Best ETFs for the NEXT Bull MarketLet’s break down winners and losers. At the top, with a 17.5% gain year-to-date, is Information Technology. The big loser has been the Energy sector, down 37.8% for the year. Note that only three of 12 sectors have meaningful positive returns, while five are down more than 10%. And here’s one more chart. This one shows the price ratio of growth stocks to value stocks. I received this from Maudlin Economics. The chart illustrates how investor money continues to chase growth while ignoring anything from the value side of stock market investing. (Coincidentally, my colleague Eddy Elfenbein wrote on a similar theme of growth beating value over the past decade just last Thursday. You can read his article here.) Also of interest is the previous peak in 2000, which occurred just before the tech bubble burst. My point with these charts is to show that value stocks and out-of-favor market sectors are tremendously undervalued. At the same time, it’s likely that tech stocks are overvalued and may not have the upside potential from here investors expect. I focus on income and dividend investing, so I get a little excited when I see value stocks, mainly dividend-paying value stocks, “on sale.” While our emotional side tells us to jump on the hot stocks that seem to go up every day, the logical part of our brain realizes the best way to make money is to buy low and sell high. Or, in my case, buy low and earn a high yield while waiting for share prices to go up. Here are a couple of ways to invest in the undervalued sectors. Antero Midstream (AM) Since it is down the most, the first place to look is the energy sector. Energy midstream, which transports and stores energy commodities, is more reliable for income investors than are must upstream and downstream focused stocks. For aggressive investors, consider Antero Midstream (AM). This natural gas gathering and transport stock trades for half of its 52-week high. Antero just declared another $0.3025 quarterly dividend, sustaining the 20% yield. Kinder Morgan, Inc. (KMI) For a more conservative energy midstream stock, look at Kinder Morgan, Inc. (KMI). The Kinder Morgan shares are off 33% from the 52-week peak. Kinder increased the dividend by 5% in April, and the current yield is 7.0%. Ventas, Inc. (VTR) The S&P Real Estate sector is down 10% for the year. In the subsectors, Healthcare real estate investment trusts (REITs), down 33.9%, and residential REITs, off 24%, are two groups that should sustain their dividend payments. Diversified healthcare REIT, Ventas, Inc. (VTR) trades for half of its 52-week high. The current Ventas yield is 7.8%. AvalonBay Communities, Inc. (AVB) For a residential sector REIT, AvalonBay Communities, Inc. (AVB) looks attractive. The AvalonBay share price is off 33% from the recent high, and the current yield is 4.1%. AvalonBay has a ten-year track record of annual dividend increases. Want More Great Investing Ideas? Top Dividend Stock to Own! Download Free Report Today Buy These 3 High-Yield Dividend Stocks All Under $15 Buy and Hold These 3 Dividend Stocks Forever AM shares . Year-to-date, AM has declined -11.96%, versus a 0.99% rise in the benchmark S&P 500 index during the same period."}]}