{"article": [{"url": "https://stocknews.com/news/abbv-ibm-mo-ip-gps-5-buy-rated-dividend-stocks-yielding-more-than-5/", "published": 1599826100.0, "headline": "5 “Buy-Rated” Dividend Stocks Yielding More than 5%", "body": "Global markets rebounded for a day before dropping again. During unpredictable movements in the markets, bonds can provide a “cushion.” But historically low-interest rates are keeping bond yields unattractive. Moreover, market volatility is anticipated to spike as the US presidential election approaches. Hence, high dividend-paying stocks appear to be a better investment now. Dividend payments fell by $42.5 billion in the second quarter compared to the year-ago quarter. Many companies were forced to cut or suspend their payouts because of weak sales and cash-flows. Consequently, for S&P 500 large-cap companies, dividends totaled $119 billion for the quarter, compared to the record $127 billion issued in the first quarter. However, some companies were able to survive this unprecedented time due to their robust financial and business strength, and are still yielding more than 5%, compared to S&P 500’s mere 1.63% yield. AbbVie Inc. (ABBV), International Business Machines Corporation (IBM), Altria Group, Inc. (MO), International Paper Company (IP), and The Gap, Inc. (GPS) are five stocks that could be a steady source of income for you due to their exceptional dividend yields and ability to sustain payments. 9 \"BUY THE DIP\" Growth Stocks For 2020AbbVie Inc. (ABBV) ABBV discovers, develops, and markets pharmaceutical therapies that address a range of diseases. It operates in the United States and internationally under seven segments – Immunology, Oncology, Aesthetics, Neuroscience, Eye Care, Women’s Health, and Other Key segments like Gastroenterology. ABBV pays an annual dividend of $4.72, which translates into a yield of 5.26%. The company has a four-year average dividend yield of 4.26%. During the past five years, the average dividends per share growth rate for ABBV was 20.9% per year. The company pays quarterly dividends and has been consistently increasing its dividend each year. The most recent payout was a cash dividend of $1.18 in July 2020. The company generated free cash flow of $2.9 billion in the last reported quarter, improving 24% year-over-year. It also reported $3.09 billion in cash flow from operations. It returned $1.75 billion back to its shareholders in the form of dividends. ABBV also delivered a solid top-line of $10.43 billion, increasing 26.3% year-over-year with a strong recovery in the aesthetics portfolio. Global net revenues from the neuroscience portfolio doubled year-over-year to $734 million. EPS for the quarter came in $2.34, beating the consensus estimate by 6.8%. The company completed its acquisition of Allergan in May, significantly expanding and diversifying its revenue base with new therapeutic areas, enhancing long-term growth potential, and enabling investment in innovation for each of its therapeutic categories. The street expects EPS to grow 31.2% in the next quarter to $2.9. ABBV closed yesterday’s trading session at $89.65, gaining 1.25% year-to-date. The stock has grown more than 30% since its March low. How does ABBV stack up for the POWR Ratings? B for Trade Grade B for Buy & Hold Grade A for Peer Grade B for Industry Rank B for Overall POWR Rating The stock is also ranked #17 out of 232 stocks in the Medical – Pharmaceuticals industry. International Business Machines Corporation (IBM) IBM operates as an integrated solutions company that provides information technology (IT) products and services worldwide. Its Cloud & Cognitive Software segment offers software for vertical and domain-specific solutions in health, financial services, and Internet of Things (IoT), and other services application areas. While the four-year average dividend yield for IBM is 4.48%, the current annual dividend of $6.52 translates to a 5.41% yield. The stock has been consistently paying dividends each quarter for the last six decades. The most recent dividend declared by the company was $1.63 for the second quarter that ended in June 2020. IBM generated free cash flow of $2.9 billion in the second quarter, a 14.7% increase year-over-year. It also reported a free cash flow margin of 16%. Despite the top-line declining 2% year-over-year to $18.1 billion, total cloud revenue was up 34% to $6.3 billion. The gross profit margin for the quarter stood at 48%. Operating cash flow for the quarter stood at $3.6 billion. Furthermore, IBM’s average cash flow over the past 5.75 years is greater than 96.5% of dividend paying stocks in the StockNews.com universe. EPS for the quarter came in $2.18, beating the consensus estimate by 5.3%. IBM entered into a strategic collaboration with Red Hat, Inc. (RHT), an open source solutions provider, last year. The company has recently announced the availability of Red Hat Marketplace, a hybrid-cloud software marketplace deployed to manage enterprise applications across an organization’s IT infrastructure. Hence, the street anticipates EPS to grow 2.6% per year in the next five years. IBM is currently trading at $120.56, 24% below its 52-week high of $158.75. Additionally, the stock has gained more than 27% from its March lows. In our POWR Ratings system, the company has a grade of “B” for Industry Rank. It is also ranked #10 out of 28 stocks in the Technology – Hardware industry. Altria Group, Inc. (MO) MO manufactures and sells cigarettes, smokeless products, and wine in the United States and internationally. It offers cigarettes primarily under the Marlboro brand and cigars principally under the Black & Mild brand. It operates through 3 segments – Smokable products, Oral tobacco products and Wine. MO pays an annual dividend of $3.36, which translates into a dividend yield of 7.67%. The four-year average dividend yield for the company is 5.76%. The company has grown its dividend at a CAGR of 10.4% over the last five years. The last dividend announced by the company was $0.86. Despite the adverse effect of the pandemic on its top-line, the company increased its dividend by 2.4% from its last quarterly payment of $0.84. MO increased its free cash flow by 2,743.6% in its second quarter to $1.76 billion. It also generated a cash net operating income of $1.82 billion during the quarter. Net revenues decreased 3.8% to $6.4 billion, primarily due to lower net revenues in the smokable products segment. The EPS for the quarter came in at $1.09, increasing 8.5%, and beating the consensus estimate by 2.8%. In May, MO issued long-term senior unsecured notes in an aggregate principal amount of $2 billion to improve its liquidity. For the coming quarters, the company expects to continue to maintain a higher cash balance than normal to preserve its financial flexibility. MO’s consensus EPS estimate for the next year indicates an increase of 5.8%. MO closed yesterday’s trading session at $43.35, which is 16.3% lower than its 52-week high of $51.78. The stock has already gained more than 26.5% from its March lows. MO’s POWR Ratings reflect a promising outlook. It has an overall rating of “Buy” with a grade of “A” for Trade Grade and a “B” for Buy & Hold Grade, Peer Grade, and Industry Rank. Among the 9 stocks in the Tobacco industry, it’s ranked #2. International Paper Company (IP) IP functions as a paper and packaging company primarily in the United States and internationally. The company sells its products directly to end users and converters, as well as through agents, resellers, and paper distributors. It operates through three segments – Industrial Packaging, Global Cellulose Fibers, and Printing Papers. The most recent dividend declared by IP was $0.513 for the second quarter that ended in June 2020. While the four-year average dividend yield for IP is 4.24%, the current annual dividend of $2.05 translates into a 5.4% yield. The stock has been consistently paying dividend every quarter since 1962. During the past 10 years, the average dividends per share growth rate for IP was 20.2% per year. The company has also been constantly increasing its dividend payout amount during the last quarter each year. Free cash flow for the firm came in $640 million in the last reported quarter. The company also generated $890 million in cash flow from operations. Revenues declined 14% year-over-year to $4.87 billion, primarily driven by lower sales volumes in printing papers and increased economic downtime. EPS for the quarter came in $0.77, delivering an earnings surprise of 97.4%. Moreover, IP has beaten EPS estimates in each of the trailing four quarters. In line with the company’s diverse customer base, and its manufacturing and supply chain capabilities, the street expects EPS to grow 11.3% per year over the next five years. IP closed yesterday’s trading session at $37.97, gaining more than 11% in the last six months. Additionally, the stock is trading at a 20.3% discount to its all-time high of $47.64. IP’s strong momentum is reflected in its POWR Ratings. It has a “Buy” rating with a grade of “A” in Trade Grade and a “B” in Peer Grade. Within the Industrial – Paper, it’s ranked #1 out of 8 stocks. The Gap, Inc. (GPS) GPS operates as an apparel retail company worldwide. The company offers apparel, accessories, and personal care products for men, women, and children through company-operated stores, franchise stores, e-commerce websites, and catalogs. As of August 1st, the company had 3,215 company-operated stores and 599 franchise stores. While the four-year average dividend yield for GPS is 4.51%, the current annual dividend of $0.97 translates into a 5.71% yield. The last dividend paid by the company was $0.2425 in April this year. Additionally, over the past ten years, the average dividends per share growth rate for GPS was 11% per year. The company reported impressive second quarter results with free cash flow growing 94% year-over-year to $767 million. Cash flow from operations also increased 54% compared to the year-ago quarter to $853 million. However, the top-line declined 18.2% year-over-year to $3.28 billion, driven by COVID-19 related store closures. GPS acquired 3.5 million new customers through its online channel, representing over 165% growth in new online customer acquisition year-over-year. Online sales increased 95% year-over-year. GPS reported a negative EPS of $0.17 for the quarter, improving significantly from the negative EPS of $2.51 in the preceding quarter. The purpose driven lifestyle brands, size and scale, and advantaged digital capabilities should help the company keep growing in the future. The market expects EPS to increase 152.4% next year. The stock closed yesterday’s trading session at $16.99, gaining more than 36% in the last six months. Moreover, it is currently trading at a 14% discount to its all-time of $19.76. It’s no surprise that GPS is rated a “Buy” in our POWR Ratings system. It also has a grade of “A” for Trade Grade and Peer Grade, and a “B” for Buy & Hold Grade and Industry Rank. It is ranked #9 out of 65 stocks in the Fashion & Luxury industry. Want More Great Investing Ideas? 7 Best ETFs for the NEXT Bull Market Will Stocks Fall into Historical September Slump? 9 “BUY THE DIP” Growth Stocks for 2020 ABBV shares were trading at $89.53 per share on Friday afternoon, down $0.12 (-0.13%). Year-to-date, ABBV has gained 5.28%, versus a 4.73% rise in the benchmark S&P 500 index during the same period."}]}