{"article": [{"url": "https://stocknews.com/news/amd-infy-eric-wit-anet-5-top-performing-large-cap-technology-stocks-in-july/", "published": 1596629300.0, "headline": "5 Top Performing Large-Cap TECHNOLOGY STOCKS in July", "body": "Investors are scrambling for low-risk investments should the market dip. Over the last few months, tech has proven itself to be the most resilient sector given that its immune to shutdowns. Take a close look at the large-cap tech stocks and you will find plenty have increased in value this summer. Zero in on July, and a handful of large-cap tech stocks have emerged from the pack. Below, we shine the spotlight on the following five large-cap tech stocks that exceeding expectations last month: Advanced Micro Devices (AMD), Infosys Limited American Depositary Shares (INFY), Ericsson (ERIC), Wipro Limited (WIT) and Arista Networks (ANET). 7 Best ETFs for the NEXT Bull MarketAdvanced Micro Devices (AMD) The semiconductor business has been hot since the coronavirus outbreak. The demand for computers increased as employees picked up one or a couple of extra computers to work from home. Furthermore, plenty of students will be learning from home, boosting the demand for computers all the more. AMD is benefitting form this increase in demand. Intel’s recent earnings debacle also confirmed what tech-insiders already know – AMD is now the most innovative chip-maker in the world. This is leading to multiple expansion and a mark-up in analysts’ expectations for future quarters. The POWR Ratings show AMD has A grades in every POWR Component. AMD has a ranking of six out of 86 stocks in the Semiconductor & Wireless Chip category. Take a look at the analysts’ forecast for AMD and you will find plenty of bulls. Out of the 26 analysts who reviewed AMD, 14 recommend buying, 11 recommend holding and one advises selling. Infosys Limited (INFY) Though consumers are saving their pennies, plenty of businesses are still spending. INFY tailors its services to these cash-rich corporations. INFY provides a wide array of business solutions ranging from systems integration to technical consulting, software re-engineering, and services related to infrastructure management. The POWR Ratings reveal INFY has A grades in all of the POWR Components but for its Industry Rank of B. INFY is ranked second of 14 stocks in the Outsourcing – Tech Services category. INFY recently popped after surpassing earnings expectations. If this stock dips in the days or weeks to come, investors should consider establishing a position. Ericsson (ERIC) It is hard to go wrong investing in the telecommunications sector. In particular, investing in mobile networks has the potential to prove quite profitable. ERIC is a large-cap tech stock with quite a bright future, largely due to the arrival of 5G. Carriers are heavily spending to upgrade infrastructure in anticipation of 5G, and ERIC has been one of the beneficiaries. The POWR Ratings show ERIC has A grades in each POWR Component. ERIC is ranked first of 35 stocks in the Telecom – Foreign sector. The stock is currently trading just below its average analyst price target of $11.80. Wipro Limited (WIT) IT services have never been more valuable. The transition to remote work has catalyzed demand for IT consulting and services across the globe. WIT provides such services to businesses throughout the world. The rise of remote work has also flattened the playing field between domestic and international workers. The POWR Ratings reveal WIT has A grades in each POWR Component but for its Industry Rank which is graded a B. WIT is ranked in the top five of 14 Outsourcing – Tech Services stocks. Unlike most other publicly traded companies that have struggled to return to their pre-COVID trading levels, WIT has surpassed its pre-COVID trading level of $4 and shows no signs of slowing down. Arista Networks (ANET) Cloud-based networking is undoubtedly the wave of the present and the future. Companies across the globe are shifting away from in-house servers toward cloud storage. ANET is a cloud-based networking business poised to benefit from this transition. The POWR Ratings reveal ANET has As in its Trade Grade and Buy & Hold Grade POWR Components. ANET is ranked first of more than 50 stocks in the Technology – Communication/Networking sector. ANET’s price returns are primarily in the green, highlighted by a 53% price return across the past three years and a year-to-date return of 29.80%. Though investors who hop on the ANET train will certainly pay a premium at its current trading price of $265, there is no guarantee the stock will pull back to present a better buying opportunity. Add ANET to your portfolio, hold it for the long haul and you will likely be quite pleased with the results. Want More Great Investing Ideas? 9 “BUY THE DIP” Growth Stocks for 2020 How HIGH Can This Tech Bubble Fly? 7 “Safe-Haven” Dividend Stocks for Turbulent Times AMD shares were trading at $85.62 per share on Wednesday morning, up $0.58 (+0.68%). Year-to-date, AMD has gained 86.70%, versus a 4.32% rise in the benchmark S&P 500 index during the same period."}]}