{"article": [{"url": "https://stocknews.com/news/cron-acb-cronos-group-makes-a-significant-change-to-its-leadership/", "published": 1599739700.0, "headline": "Cronos Group Makes a Significant Change to its Leadership", "body": "Following Aurora Cannabis’s (ACB) announcement this week of a new CEO, Cronos Group (CRON) announced their own CEO change. The company announced Tuesday that Kurt Schmidt is now the full-time CEO of CRON. Schmidt brings 30 years of consumer-packaged goods experience to the role. His prior experience includes leading and growing renowned global consumer-packaged goods brands such as Blue Buffalo Company, Nestlé S.A., Gerber, and Kraft Foods. Mike Gorenstein, who was CEO since CRON started, has been named Executive Chairman. Gorenstein said, “Kurt is a world-class executive with a long track record of outstanding performance. He has demonstrated tremendous success partnering with founders of late-stage start-ups to accelerate growth. He also has extensive operational and management experience at some of the largest global consumer goods companies. I’m excited to partner with Kurt to leverage Cronos Group’s strengths and deliver the best in class brands and products to our consumers.” Following Gorensteins’ comments, Schmidt added, “What Mike and the Cronos team have achieved in such a short period of time is truly impressive. I am passionate about brands and inspired by Cronos’. Joining as CEO is a unique opportunity to use my work building outstanding brands, high-performance teams and results-driven organizations. I look forward to working with Mike, the Board, and the Company’s dedicated employees to propel Cronos Group toward its full potential.” 9 \"BUY THE DIP\" Growth Stocks For 2020As the consolidation throughout the cannabis industry continues, I have seen company after company replace old management with new ones, in hopes of a fresh start. With cannabis companies fighting for market share, the industry need bright leaders finding innovative ways to grow revenues and increase profitability. Schmidt brings a lot of consumer-packaged goods experience to CRON. And I am hoping that the cannabis industry can continue to turn the corner with new management. Only time will tell how Schmidt performs, but for now, CRON might be on the right track. Want More Great Investing Ideas? 7 Best ETFs for the NEXT Bull Market Will Stocks Fall into Historical September Slump? 9 “BUY THE DIP” Growth Stocks for 2020 CRON shares were trading at $5.32 per share on Thursday afternoon, up $0.04 (+0.76%). Year-to-date, CRON has declined -30.64%, versus a 6.07% rise in the benchmark S&P 500 index during the same period."}]}