{"article": [{"url": "https://stocknews.com/news/goog-googl-qqq-is-google-a-buy-sell-or-hold/", "published": 1597925300.0, "headline": "Is Google a Buy, Sell, or Hold?", "body": "It’s been an uneventful year for Google (GOOG),(GOOGL) as it has significantly underperformed the Nasdaq-100 (QQQ) year-to-date, up just 16% vs. the index’s 32% return. However, this might finally be about to change as the stock is breaking out of a multi-month cup base and finally starting to show relative strength against the major averages. While the company had a tough Q2 as it was one of the only FAANG stocks with revenues down year-over-year, its earnings trend remains solid. Given that the stock is out of favor, and is a much less crowded pick among the FAANG names, I would expect any sharp pullbacks towards the $1,520.00 level to be low-risk buying opportunities. 9 \"BUY THE DIP\" Growth Stocks For 2020While most of the FAANG names have put up exceptional returns year-to-date, Google has lagged behind the group, unable to match the performance of the Nasdaq Composite. The reason for this soft performance is that the company is one of the few tech names that’s taken a hit from COVID-19, with sales down (-) 2% year-over-year in Q2. However, if we dig into the results a little deeper, we can see that Google Other (including Youtube Premium) and Google Cloud both saw an outstanding performance, growing 24% and 43%, respectively. Unfortunately, the softness came from Google Search, which is the most significant contributor to revenues. This shouldn’t be surprising amid a global pandemic. The reason for this is that travel makes up roughly 10% of search revenue, and no one has been in a hurry to do any traveling since March. However, if we look past Q2 and what’s likely to be a weaker FY2020, we should see much stronger revenue growth in FY2021 as things normalize if Youtube Premium and Google Cloud can maintain their double-digit growth rates. (Source: Company News Release) (Source: YCharts.com, Author’s Chart) If we take a look at Google’s earnings trend, the company has done an exceptional job growing annual earnings per share [EPS] as a mega-cap, with annual EPS growing from $19.82 in FY2014 to $48.94 last year. Obviously, this 19% compound annual EPS growth rate pales to some of the growth stocks out there in the market, but for a mega-cap like Google, these are very respectable figures. While FY2020 annual EPS is expected to decline year-over-year, which certainly isn’t what any investor wants to see, it’s important to point out that this is merely an aberration within the trend higher in annual EPS. If we look at FY2021 annual EPS, we should see a new all-time high at $57.20 based on estimates, and FY2022 is projected to see double-digit growth as well with forecasts of $69.55. Therefore, while we are seeing some material deceleration this year, a single year slowdown amid a global pandemic is nothing to lose any sleep over. In fact, if we run a calculation on the compound annual EPS growth rate out to FY2022, Google is growing at 17% per year, only a minor deceleration from the previous trend in FY2014 to FY2019. (Source: TC2000.com) Moving over to the valuation above, we can see that the stock is nowhere near the danger zone (red shaded area), and long-term breakouts that occur below the danger zone are generally considered safe. If we compare Google’s long-term breakouts in price (lower pane) with the above pane which is the price to sales ratio, it’s clear that breakouts from the undervaluation zone (green shaded area) have an exceptional success rate. Meanwhile, breakouts from the neutral area (no shading) also perform quite well. At the time of the recent breakout, Google was just outside of the undervaluation zone at a price to sales ratio of 6.5, meaning that this breakout from the $1,500 level is likely to be successful. For Google to head into the danger zone, the stock would have to trade up to $1,695 before its next earnings report, so there’s still some value here. However, the most attractive trade for those not long already would be catching any pullbacks towards the breakout area ($1,515). (Source: TC2000.com) As we can see from the weekly chart above, Google has built a gorgeous cup base, and the clear resistance zone was between $1,490 – $1,515 for this breakout. Thus far, we’ve seen impressive follow-through from this breakout, but the stock is now roughly 5% above its prior highs, suggesting that this is no longer a low-risk buy point. Therefore, while I see Google as a Hold at $1,570, I would view any pullbacks towards $1,515 as a buying opportunity. Obviously, there’s no guarantee that we get another pullback towards the base, but this would be the trade I’d be looking for to start a position in the stock. We currently have investors flooding into Apple (AAPL) and Amazon (AMZN) and bidding them up to record heights, and this shouldn’t be a huge surprise given their performance. The two companies have managed to get through the COVID-19 headwinds unscathed, with the latter on a near-record hiring spree to keep up with demand. However, these two trades are now beginning to get a little crowded, suggesting that it might be time to rotate towards the less-loved FAANG names. When it comes to a combination of momentum, future growth, and valuation, I believe GOOG is the best name worth looking at rotating into among the group. This is because the stock should be up against easy year-over-year comps next year (after sluggish growth in H1 2020), has just emerged from a multi-month breakout, and is trading at a reasonable valuation while most of its peers trade at near-record valuations. How does GOOG stack up in the StockNews POWR Ratings system? A for Trade Grade A for Buy & Hold Grade A for Industry Rank A for Peer Grade A for Overall POWR Rating You can’t ask for better. The stock is also ranked #2 out of 54 stocks in the Internet industry. While not all breakouts will work out, Google is sporting a nice setup, and I would expect any 5% plus pullbacks towards the breakout area to be buying opportunities. For now, I am not long GOOG as I already hold several tech names, but I would look to be a buyer on any weakness below the $1,520 level. Disclosure: I am long AMZN, DOCU, BILL, ZG, NVDA, NFLX Want More Great Investing Ideas? The Best of StockNews 2 Step Process to Sell @ Market Top in September 9 “BUY THE DIP” Growth Stocks for 2020 GOOG shares fell $0.65 (-0.04%) in after-hours trading Thursday. Year-to-date, GOOG has gained 18.30%, versus a 6.13% rise in the benchmark S&P 500 index during the same period."}]}