{"article": [{"url": "https://stocknews.com/news/tsla-ddog-teva-zm-4-stocks-with-p-e-ratios-over-1000/", "published": 1598357300.0, "headline": "4 Stocks With P/E Ratios Over 1,000!", "body": "Price-to-earnings is one of the most widely used metrics that investors and analysts use to determine a stock’s valuation. It essentially shows how much investors are willing to pay for each dollar of a company’s earnings, making it easy to compare a stock with its peers or a benchmark. Since the market crash in March, the market’s rally has primarily been supported by growth stocks. In part, it’s due to the virus leading to an acceleration in tech spending. Another factor was that the drop in interest rates makes growth stocks more attractive. The Vanguard Growth Index Fund ETF (VUG) gained 72% since its March lows versus the S&P 500’s close to 56% return over the same period. 7 Best ETFs for the NEXT Bull MarketStocks with P/E ratios higher than the peer-group average are often categorized as growth stocks with the assumption that investors are paying more today with the expectation of significant growth in earnings in the future. Tesla, Inc. (TSLA), Zoom Video Communications, Inc. (ZM), Datadog, Inc. (DDOG) and Teva Pharmaceutical Industries Limited (TEVA) are companies with P/E ratios above 1000 which means that investors are very optimistic about their prospects. If they don’t meet these expectations, they could face a steep decline. Tesla, Inc. (TSLA) TSLA designs, develops, manufactures, and sells electric vehicles, electric vehicle powertrain components, and stationary energy storage systems in the United States, China, Norway, and internationally. TSLA is currently trading with a P/E ratio of 1038.15 compared to the S&P 500’s 35.35. The stock has gained huge momentum due to its recent developments. The stock is hitting fresh highs every trading day. The company reported EPS of $2.18 in its second quarter, beating the consensus estimate by 7167%. Moreover, TSLA has beaten EPS estimates in each of the trailing four quarters. The street also expects TSLA’s inclusion in the S&P 500 index due to its strong earnings momentum. Strong Model 3 demand from China and the expectation of new battery developments are primarily contributing to the price growth. Additionally, TSLA announced a five-for-one stock split earlier this month. The forward P/E ratio of TSLA comes in 303.03 as the Wall Street analysts expect the share price to reach $1295 after the stock split. EPS for the current year is estimated to grow by 4250%. How does TSLA stack up for the POWR Ratings? A for Trade Grade A for Buy & Hold Grade A for Peer Grade B for Industry Rank A for Overall POWR Rating You can’t ask for better. The stock is also ranked #1 out of 27 stocks in the Auto & Vehicle Manufacturers industry. Zoom Video Communications, Inc. (ZM) ZM engages in the provision of video-first communications platforms. It connects people through frictionless video, voice, chat and content sharing, and enables face-to-face video experiences in a single meeting across disparate devices and locations. ZM’s current price/earnings ratio is 1666.35 compared to the Nasdaq 100 index’s 36.75. ZM’s P/E ratio is higher than 99.67% of US stocks with positive earnings in the StockNews.com Universe. The stock closed yesterday’s trading session at $282.28 with a year-to-date gain of 314.9%. With remote working becoming a necessity, ZM has gained huge market share within a short period because of its efficient platform that helps people meet remotely. The EPS for the first quarter came in at $0.2, beating the consensus estimate by 122.2%. ZM recently announced the New Global Select Plan as the company expanded its Zoom Phone Cloud Service to over 40 countries globally. ZM has an impressive earnings surprise history with the company beating consensus EPS estimates in each of the trailing four quarters. ZM has a forward P/E ratio of 227.27. The Wall Street analysts expect the stock’s price to fall 15.6% from its last closing price to $238.17 while EPS is estimated to grow 271.4% in the current year. It’s no surprise that ZM is rated “Strong Buy” in our POWR Ratings system. It also has an “A” for Trade Grade, Buy & Hold Grade, and Peer Grade. It is ranked #1 out of 51 stocks in the Technology – Services industry. Datadog, Inc. (DDOG) DDOG engages in the development of monitoring and analytics platforms for developers, IT operations teams, and business users. Its platform integrates and automates infrastructure monitoring, performance monitoring, and log management to provide real-time observability of its customers’ entire technology stack. DDOG’s current P/E ratio is 1230 compared to 23.22 for the tech-heavy Nasdaq Composite. With a year-to-date gain of 128%, DDOG closed yesterday’s trading session at $84.34. DDOG’s business is also booming because of the pandemic and the work from home culture. The company reported impressive second-quarter results with EPS of $0.05, beating the street estimates by 400%. The company recently completed the coveted Federal Risk and Authorization Management Program (FedRAMP) certification process for low-impact software-as-a-service. It means U.S. Federal government departments can now use DDOG’s analytics and monitoring services to watch over their cloud operations. DDOG has a forward P/E ratio of 714.29. The consensus analyst price target of $95.64 is 13.4% higher than its last closing price. Furthermore, EPS is estimated to grow 1300% for the current year. DDOG’s POWR Ratings reflect a promising outlook. It has an overall rating of “Buy” with a “B” for Trade Grade, Buy & Hold Grade, and Industry Rank. Among the 47 stocks in the Software – Business industry, it’s ranked #15. Teva Pharmaceutical Industries Limited (TEVA) TEVA is an Israel-based company that manufactures, markets, and distributes generic, specialty, and other pharmaceutical products worldwide. The company operates in two segments, Generic Medicines, and Specialty Medicines. TEVA’s present P/E ratio is 1010 compared to 35.35 for the S&P 500 index. The stock closed yesterday’s trading session at $9.63. The last financial result reported by TEVA was for the fiscal second quarter. EPS for the quarter came in $0.13, significantly improving from the year-ago negative EPS of $0.63. The company has recently announced a strategic partnership with Alvotech, a biopharmaceutical major, to expand its position in the biosimilar market. Moreover, the company’s Actavis Generics unit developed a pemetrexed chemotherapy treatment, which combats lung cancer and is waiting for FDA approval. TEVA has a forward P/E ratio of 4.1. The Wall Street analysts expect TEVA’s share price to rise 33.8% from its last closing price to $12.88 while EPS is estimated to grow 4.6% in the current year. As per our POWR Ratings, TEVA has an “A” for Industry Rank and is ranked #43 among the 228 stocks in the Medical – Pharmaceuticals industry. Want More Great Investing Ideas? The Best of StockNews 2 Step Process to Sell @ Market Top in September 9 “BUY THE DIP” Growth Stocks for 2020 TSLA shares fell $2.34 (-0.12%) in after-hours trading Tuesday. Year-to-date, TSLA has gained 383.67%, versus a 8.02% rise in the benchmark S&P 500 index during the same period."}]}