{"article": [{"url": "https://stocknews.com/news/gld-nugt-ring-iau-gdx-5-gold-funds-to-buy-for-astute-investors-after-recent/", "published": 1597493300.0, "headline": "5 Gold Funds to Buy for Astute Investors After Recent Retreat", "body": "Five gold and silver funds to buy let astute investors profit as technology stocks weaken after a strong rise as the COVID-19 crisis continues. The price of gold recently hit an all-time high and experts predict further gains remain ahead. The surge has been sparked by investors seeking a refuge from the falling U.S. dollar, inflationary federal spending and the growing threat of huge tax hikes if Democrats win the next election and take control of both the White House and Congress. Gold ended at $1,944.00 at the close of trading on Friday, Aug. 14, but could climb further soon, experts predict. Novice gold investors should remember that gold funds do not offer the 100% protection bank deposits provide through the Federal Deposit Insurance Corporation (FDIC), topping out at $250,000 for each person per bank. 7 Best ETFs for the NEXT Bull MarketPension Fund Chairman Chooses 1 of the 5 Gold Funds to Buy for Astute Investors Potent monetary stimulus from the Federal Reserve Bank will benefit the markets more than the economy, said Bob Carlson, leader of the Retirement Watch advisory service. As chairman of the Board of Trustees of Virginia’s Fairfax County Employees’ Retirement System with more than $4 billion in assets, Carlson aims to protect the money of investors. Carlson called gold as a hedge against future inflation and added he has been recommending it for about two years. Before the pandemic, the Federal Reserve made clear that it wasn’t going to tighten monetary policy for a while, since the U.S. central bank did not want to risk a recession by prematurely tightening and was willing to risk letting inflation develop. “Easy monetary policy generally is bullish for gold,” Carlson said. After pandemic reached the United States early this year, the Fed set a policy of ensuring the economy and markets would have all the money needed to function, Carlson said. There has been a historic expansion of the Fed’s balance sheet, and it likely will continue, he added. 1 of the 5 Gold Funds to Buy for Astute Investors Includes iShares Gold Trust Many other central banks around the world have adopted similar easy-money policies, spurring an interest in gold among investors, Carlson told me. Those central bank policies have caused the U.S. dollar to slide, he concluded. “Other currencies also are declining,” Carlson said. The trends will continue as long as the global economy needs easy monetary policy to avert a “deflationary spiral,” Carlson said. Carlson indicated he favors a “straightforward investment in gold bullion” through exchange-traded funds (ETFs). In particular, he recommended iShares Gold Trust (IAU), an ETF that allows gold to be bought or sold anytime the markets are open, deviates little from its net asset value and offers an efficient way to purchase and own gold due to its low fee. Some other bullion funds lend their gold or take other measures to increase cash flow or boost returns, he added. Chart courtesy of www.StockCharts.com Mining Companies Fit Within the 5 Gold Funds to Buy for Astute Investors Investors seeking to spark returns can invest in stocks of gold mining companies directly or with Carlson’s recommended method of using a mutual fund or an ETF that holds a diversified portfolio of equities. Remember that investing in the stocks carries additional risk, he opined. With stocks, investors make a bet on the management of a company and any labor problems it may incur, Carlson said. Some companies contract to sell their gold at fixed prices in advance. Such arrangements can reduce gains in the stock. Companies also can carry different levels of debt, either boosting returns or causing problems. For the short term, expect a softening of gold’s price, Carlson said. Some investors had been selling gold short and did not expect central banks to expand monetary policy as much as they did or successfully offset deflationary trends, he added. “Once the short sellers have covered their positions, gold buying will decline for a bit before resuming,” Carlson cautioned. Pension fund Chairman Bob Carlson answers questions from Paul Dykewicz before social distancing became standard after the outbreak of COVID-19. iShares Gold Trust (IAU) does not pay a dividend, but it is starting to rise after a recent pullback in the price of gold. The gold bull market should continue if central banks keep “pumping money” into the economy to offset the deflationary effects of the coronavirus, Carlson said. Trend-Follower Says Put a RING Among the 1 of the 5 Gold Funds to Buy for Astute Investors The powerful surge in gold and silver mining stocks is the result of several key drivers operating in the market today, said Jim Woods, editor of the Intelligence Report, Successful Investing and Bullseye Stock Trader advisory services. The confluence of bullish gold factors has probably never been this complete, he added. “We now have ultra-low interest rates nearly around the globe,” Woods said. “Then we have governments essentially flooding the world with stimulus. Low interest rates make owning gold more attractive for yield-seeking investors.” Woods cited mining stocks in the iShares MSCI Global Gold Miners ETF (NASDAQ:RING) as one of his favorite “safety trades.” Chart courtesy of www.StockCharts.com RING is an ETF that features an assortment of major gold stocks. Investors who buy shares in RING gain exposure throughout the sector by investing in just that fund. GLD Joins 5 Gold Funds to Buy for Astute Investors Among fund to consider is SPDR Gold Shares (GLD), an ETF pegged to the spot price of gold bullion. Woods told me he has recommended this fund, too. Chart courtesy of www.StockCharts.com GDX Mining ETF Ranks Among the 5 Gold Funds to Buy for Astute Investors Another fund Woods said he likes is VanEck Vectors Gold Miners ETF (NYSE: GDX). The mining stocks that compose this ETF have soared in the past 12 months. Chart courtesy of www.StockCharts.com Paul Dykewicz meets with Jim Woods before COVID-19 to discuss new investment opportunities. Gold traders expect the government stimulus and spending ultimately to boost consumer prices beyond any interest-rate increases that banks may pay depositors. That would cause inflation and hurt the U.S. dollar’s purchasing power. However, it would lift the value of gold because additional dollars would be needed to purchase bullion. The price of an ounce of gold bullion then would rise and boost the value of gold mining stocks, as shown with the jump in share price for mining ETFs the iShares MSCI Global Gold Miners ETF (RING) and the Direxion Daily Gold Miners Index Bull 2X Shares (NUGT). Double Leveraged Fund Wins Spot as 1 of the 5 Gold Funds to Buy for Astute Investors NUGT is double leveraged with the intent of rising twice as much as the gold miners index. NUGT had been triple leveraged but then scaled back to double leveraged as gold surged. The leverage turns NUGT into a volatile investment that can jump when gold prices rise. Chart courtesy of www.StockCharts.com Falling real interest rates, calculated by subtracting inflation from reported or expected interest rates, are supporting the inflationary expectations of investors, as steady bond yields give a fundamental tailwind for both gold and silver. If that stays intact, precious metals should keep increasing. Radio Show Host and Money Manager Kramer Sees Gold as a Winning Investment The “most remarkable” part of the precious metals boom is the way the miners have outperformed commodity prices, said Hilary Kramer, host of a national radio program called “Millionaire Maker.” Kramer, who also leads the Value Authority and GameChangers advisory services, said investors recognize both the defensive value in the reserves these companies have in the ground that remain to be mined and strong earnings growth when every ounce extracted is worth 20-25% more than during the previous year. “Forget for a moment that we’re talking about those beautiful shiny metals that serve as a reservoir of value when the world looks unsettled and central banks deliberately invite inflation,” Kramer said. “Gold miners are tracking at least 20% earnings growth this year. That’s spectacular.” Columnist and author Paul Dykewicz interviews money manager Hilary Kramer, whose premium advisory services included 2-Day Trader, IPO Edge, Turbo Trader, High Octane Trader and Inner Circle.. Investors looking for a new opportunity to buy gold can do so now after the precious metal’s recent retreat. Those who wait too long may find the yellow metal rise back to where it had been traded recently possibly regret missing out when gold ascents further from there. GDX shares closed at $40.35 on Friday, down $-0.28 (-0.69%). Year-to-date, GDX has gained 37.81%, versus a 5.73% rise in the benchmark S&P 500 index during the same period."}]}