{"article": [{"url": "https://stocknews.com/news/snow-frog-amwl-u-ptve-ipo-4-winning-ipos-and-1-loser/", "published": 1600776500.0, "headline": "4 WINNING IPOs and 1 LOSER", "body": "We haven’t seen such an appetite for IPOs since the dotcom bubble in 2000. Demand for IPOs tends to correlate with strong performance in growth stocks since they tend to be in the earliest stages of their growth curve. Another factor is an abundance of liquidity in an environment where these growth opportunities are scarce. Strong IPO Market In the coming weeks and months, private companies like Airbnb, Palantir, Airbnb, DoorDash, and Wish are expected to go public. In all of 2019, companies raised just over $60 billion in the IPO market. We’ve already eclipsed by that figure by a significant margin this year despite the year not being over and the heavy slate of upcoming IPOs. Additionally, the coronavirus put a freeze on IPOs for a couple of months. 7 \"SAFE HAVEN\" Dividend Stocks for Turbulent TimesIn 2020, IPOs have risen by an average of 23.7% on their first day of trading which is almost double the average gain of 12.8% in 2019 and 13.4% in 2018. The average one-week return in 2020 has been 25.4% which is also significantly higher than 2019’s 15.2% and 2018’s 11.9%. Beyond short-term performance, IPOs have also performed better on an intermediate time frame as well this year. The Renaissance IPO ETF (IPO) is higher 59% YTD, and it’s up a staggering 145% since the market bottom in March. To compare, the IPO was down 15% in 2018 and gained 31% in 2019. These types of strong returns are also reminiscent of the dotcom bubble. One major difference between the dotcom bubble is that companies are going public with much larger valuations and established operations. The IPO market’s momentum continued this week. Four of the biggest IPOs were Snowflake (SNOW), Unity Software (U), jFrog (FROG), and AmWell (AMWL). All of these companies saw big gains on their first day of trading indicating strong demand. Pactiv Evergreen (PTVE) was the exception, as it opened below its IPO range. Snowflake (SNOW) SNOW was the most high-profile IPO of the week. and it’s had the strongest performance. The stock was expected to go public between $100 and $110. It ultimately opened around $245 and hit an intraday high of $315 before closing around $250. This gave it a valuation of just over $70 billion. In February, the company was valued at $12 billion. Investors are excited by SNOW’s prospects due to its growth, high-margins, and expanding total addressable market. Its product is already used by 20% of the Fortune 500, and it’s growing sales by more than 100% on a year over year basis. Further, it’s outcompeting stalwarts like Microsoft (MSFT), Amazon (AMZN), and Google (GOOG) to help companies organize, manage, and process their data. SNOW looks primed to become the dominant company for managing cloud-based data. Unity Software U makes software to help video game developers create and monetize games. It has 1.5 million active creators on its platform, and there have been 3 billion downloads of games created by developers using its game engine tools. The stock was expected to open between $44 and $48 which was an increase from the original range of $32 to $36. However, the stock opened at $75 which exceeded even the most bullish expectations. Like SNOW, the company has tremendous growth opportunities given the growing popularity of gaming. Further, it believes that its platform can be used across all types of industries including manufacturing, self-driving, and education. Many video game studios are also switching to Unity’s platform, so they can focus on creating content rather than also building software. Another potential area of long-term growth is virtual reality and augmented reality. jFrog FROG also was a winner as its IPO opened 62% above its pre-IPO pricing. It opened at $85 but was indicated to open at $45 which was also above its earlier, expected range of $35 to $38. In total, the company was able to raise $352 million and has a valuation of nearly $6 billion. FROG is a full-scale end-to-end platform for developers. It shares many characteristics with U in that it’s a fast-growing, platform-based business that has its incentives aligned with its users. jFrog allows developers to update software with minimal disruptions and no time down. It also allows developers to test new features for a small portion of users before they are made available to everyone. These types of tools had been internally built by large companies for internal use, FROG makes them available to all developers. AmWell AMWL is a telehealth company. The stock opened at $25.5 which was significantly above its expected opening price of $18. In total, it raised $742 million. Currently, telehealth accounts for a small portion of total healthcare spending about 0.1%. But, it’s expected to account for 5-10% of spending over the next couple of decades to reach $250 billion. This means there’s a tremendous opportunity in this space. Once doctors, patients, and insurers are using the platform, there’s also an opportunity to sell higher-margin services. One theme among winning IPOs is that these are “platform as a service” businesses that increase in value as more users join the platform. Another catalyst is the coronavirus which has increased adoption and use of telehealth. Pactiv Evergreen PTVE is a food packaging company and was a loser among IPOs as it was priced at $14 but opened at $12.57 and closed at $10.93. This was also below the expected range of $18 to $21. In total, PTVE was able to raise $574 million and is currently valued at $2.4 billion. One reason for PTVE’s weak performance is that its revenue growth is slowing, the company is overvalued, and it’s in an industry with low margins. The food packaging industry is expected to grow at a 5% annual rate which means it will have limited opportunities for growth. It also has $10.6 billion in debt which adds to the stock’s unattractiveness. Conclusion The strong demand for growth-focused, technology IPOs tells us that risk appetites are strong in this market. These stocks are overvalued by traditional metrics, but they have growing revenues, high-margins, and are in markets that are rapidly expanding. Stocks with these characteristics have a decent chance of realizing their valuations. Many recent stock market winners of the past decade have shared these characteristics. It’s also not surprising that the lone loser among IPOs, PTVE, is in food packaging. That market is not expanding at a rapid rate and could face some short-term headwinds due to decreased spending at restaurants. However, it also has a lot of debt and a high valuation despite having low margins and being in an industry with limited growth prospects. Want More Great Investing Ideas? 7 Best ETFs for the NEXT Bull Market Is the Stock Market Correction Over? Chart of the Day- See the Stocks Ready to Breakout SNOW shares were trading at $233.11 per share on Tuesday afternoon, up $4.26 (+1.86%). Year-to-date, SNOW has declined -8.20%, versus a 3.37% rise in the benchmark S&P 500 index during the same period."}]}