{"article": [{"url": "https://stocknews.com/news/aapl-nflx-nvda-3-stocks-that-were-10-baggers-in-the-last-10-years/", "published": 1598530100.0, "headline": "3 Stocks That Were ‘10-Baggers’ in the Last 10 Years", "body": "A ten-bagger is a stock that goes up by ten times. These opportunities are rare, and it requires anticipating future changes. However, we can study past winners to learn lessons, so we can identify tomorrow’s ten-baggers. One common thread is a consistent track record of growth. At many times, it seemed that their growth was maxed out, however, their total addressable market kept expanding. Many didn’t anticipate that nearly every person on the planet would want a smartphone or household would be getting rid of cable in favor of streaming content. Three 10 baggers of the last decade are Apple Inc. (AAPL), NVIDIA Corporation (NVDA), and Netflix, Inc. (NFLX). These stocks have consistently surpassed expectations and could keep running higher into the end of the year. 7 Best ETFs for the NEXT Bull MarketApple Inc. (AAPL) AAPL was priced at near $35 per share 10 years ago while today it is priced at $506. The stock has delivered a return of more than 1300% over this period firmly placing it in the club of ten baggers. It doesn’t look like AAPL will stop this run anytime soon, as the company’s EPS is expected to grow at a rate of 12.5% annually over the next five years. Growth for the stock in the last ten years has largely been driven by revenues from its signature product — the iPhone. In hindsight, it’s obvious that the iPhone was a gamechanger but, many thought it was too expensive and would remain a niche product. With hindsight, it’s clear that the iPhone has become the world’s most successful consumer product in history. The majority of AAPL’s revenue still comes from the iPhone, however, the company has diversified into tablets, wearables, and services. There are several rumors regarding what we can expect from AAPL on a large scale going forward. These include virtual reality smart glasses and self-driving cars. In mid-May, AAPL acquired a virtual reality company called NEXTVR which signals its interest and investment in the area. How does AAPL stack up for the POWR Ratings? A for Trade Grade A for Buy & Hold Grade A for Peer Grade A for Industry Rank A for Overall POWR Rating You can’t ask for better. The stock is also ranked #1 out of 28 stocks in the Technology – Hardware industry. NVIDIA Corporation (NVDA) NVDA has had a stellar run in the last ten years. NVDA is famous for its gaming-oriented processors, however, the company’s graphics processing units are used in applications in several industries that require high-performance computing. NVDA’s EPS is expected to grow at an annual rate of 17.4% over the next five years. NVDA started the decade with major wins such as powering the world’s most powerful supercomputer the Tianhe-1A and it shipped its one billionth processor. NVDA entered into deep learning through the launch of its TEGRA X1 processor along with forays into artificial intelligence through PASCAL, DGX-1, and DRIVE PX 2. While gaming products have been the bread and butter of the company over the last decade, NVDA’s data center sales outpaced the sales of gaming products this quarter. The company is now heavily diversified and making headway into the software as well which is expected to drive greater profit margins in the future. The company’s software offerings can largely be categorized into artificial intelligence, self-driving cars, and data center networking. It’s no surprise that NVDA is rated a “Strong Buy” in our POWR Ratings system. It also has a grade of “A” in Trade Grade, Buy & Hold Grade, Peer Grade, and Industry Rank. In the 86-stock Semiconductor & Wireless Chip industry, it is ranked #2. Netflix, Inc. (NFLX) NFLX has revolutionized the entertainment industry and its stock has grown 2630% over the last ten years. NFLX’s streaming platform became a mainstream fixture over the last decade, and its name is now synonymous with the activity of streaming itself. In the last ten years, NFLX has grown its global subscriber base to 200 million. NFLX’s focus on original and new content has set it apart from competitors like Hulu. Netflix’s foray into original programming took place in 2013 when it launched House of Cards which was met with both critical and popular acclaim. Beginning 2016, NFLX’s shows became a common presence in TV award ceremonies including 54 nominations in the 68th Emmy Awards. In 2016, NFLX became a global giant with its launch in 130 countries. In 2017, the number of NFLX’s global subscribers outpaced the number of cable subscribers in the US. In 2020, NFLX is expected to invest around $17.3 billion in original content. The new original content could be a big driver for subscription growth for the company in the future. It is estimated that NFLX’s EPS will grow at an annual rate of 35.3% over the next five years. NFLX’s strong fundamentals are reflected in its POWR Ratings, it has a “Buy” rating with an “A” in Trade Grade, Buy & Hold, and Industry Rank. Within the Internet industry, it’s ranked #14 out of 57 stocks. Want More Great Investing Ideas? 7 Best ETFs for the NEXT Bull Market Why Stocks Could Drop 20% in September? 9 “BUY THE DIP” Growth Stocks for 2020 AAPL shares rose $0.05 (+0.01%) in after-hours trading Thursday. Year-to-date, AAPL has gained 71.51%, versus a 9.34% rise in the benchmark S&P 500 index during the same period."}]}