{"article": [{"url": "https://stocknews.com/news/podd-wmgi-silk-3-medical-device-stocks-with-high-growth-potential/", "published": 1598357300.0, "headline": "3 'Medical Device Stocks' with High Growth Potential", "body": "The Medical Devices Industry has recovered faster than many other industries since the coronavirus-led market crash in March. The iShares U.S. Medical Devices ETF (IHI) has a year-to-date gain of 11% compared to the SPDR S&P 500’s (SPY) gain of 7.6% and is up more than 45% since its March lows. The pandemic led to a short-term decrease in healthcare spending, however this is bouncing back as life is slowly returning to normal. While some demand is permanently lost due to the shutdowns, healthcare demand is only pushed back as people will have to undergo operations Thus, healthcare has been one of the most resilient areas. The aging population is another source of long-term demand growth. 7 Best ETFs for the NEXT Bull MarketBased on the current trends, Insulet Corporation (PODD), Wright Medical Group N.V. (WMGI), and Silk Road Medical, Inc. (SILK) are medical device stocks with significant earnings growth potential. Insulet Corporation (PODD) PODD is an innovative medical device company that helps people with diabetes and other conditions through the use of its Omnipod product platform. PODD launched the new Omnipod DASH™ in the U.S. which can automatically upload data cloud-to-cloud, push future software updates wirelessly to customers and also select Spanish language. The stock has gained 73.5% since it hit its 52-week low of $121 in March. In the second-quarter, PODD’s revenue increased 27.8%, net income increased 928.6% and adjusted EBITDA was up 101.8% year-over-year. PODD’s consensus revenue estimate of $220.31 million for the quarter ending September 2020 indicates a year-over-year increase of 14.7%. The market expects the company to report an EPS of $0.08 for the same quarter, which represents a 700% growth over the year-ago number. PODD’s EPS is expected to grow 171.5% per annum in the next five years. How does PODD stack up for the POWR Ratings? A for Trade Grade B for Buy & Hold Grade B for Peer Grade B for Industry Rank B for Overall POWR Rating The stock is also ranked #31 out of 138 stocks in the Medical-Devices & Equipment industry. Wright Medical Group N.V. – Ordinary Shares (WMGI) WMGI is a global medical device company focused on extremities and biologics products. The stock has gained more than 20% since its March lows. The recent update by the Centers for Medicare & Medicaid Services about reimbursement calculation will facilitate Medicare beneficiary access to WMGI’s AUGMENT technology by removing economic barriers. The company announced that the first Shoulder Arthroplasty Procedure was performed at Mayo clinic’s campus in Minnesota using its BLUEPRINT™ Mixed Reality Technology. The market expects the company to report a loss per share of $0.14 for the quarter ending September 2020, which represents a significant improvement over the year-ago loss per share of $0.19. WMGI’s EPS is expected to grow 259.5% per annum in the next five years. It’s no surprise that WMGI is rated “Strong Buy” in our POWR Ratings system. It also has an “A” for Trade Grade, Buy & Hold Grade and Peer Grade, and a “B” for Industry Rank. In the 138-stock Medical-Devices & Equipment industry, it is ranked #12. Silk Road Medical, Inc. (SILK) SILK is a medical device company focused on reducing the risk of stroke. The stock has returned more than 90% since its March lows. Five out of seven Wall Street analysts have a ‘Strong Buy’ rating on the stock. SILK announced that its early ROADSTER 2 study results exhibited compelling patient outcomes and a strong safety profile when utilizing TransCarotid Artery Revascularization. SILK’s consensus revenue estimate of $19.59 million for the quarter ending September 2020 indicates a year-over-year increase of 15.1%. SILK’s EPS is expected to grow by 99.4% per annum in the next five years. SILK’s POWR Ratings reflect this promising outlook. It has an overall rating of “Strong Buy” with an “A” for Trade Grade, Buy & Hold Grade and Peer Grade, and a “B” for Industry Rank. Among the 138 stocks in the Medical-Devices & Equipment industry, it’s ranked #17. Want More Great Investing Ideas? The Best of StockNews 2 Step Process to Sell @ Market Top in September 9 “BUY THE DIP” Growth Stocks for 2020 PODD shares were unchanged in after-hours trading Tuesday. Year-to-date, PODD has gained 27.20%, versus a 8.02% rise in the benchmark S&P 500 index during the same period."}]}