{"article": [{"url": "https://stocknews.com/news/spy-inx-dia-iwm-qqq-how-to-generate-a-8-income-stream/", "published": 1593518900.0, "headline": "How to Generate a 8% Income Stream", "body": "Let’s be honest: there are a ton of ways to collect passive income out there. But there’s only one that’s easy to get into (no matter how much money you have!), generates yearly cash payouts of 8% or more and is used by billionaire investment gurus on the regular. I’m talking about an often-overlooked investment called a closed end fund (CEF). And today I want to show you how to invest in CEFs in just three simple steps. CEFs are like mutual funds or ETFs in that they pool together money from investors, which the fund’s managers then use to buy a basket of stocks, bonds, real estate investment trusts (REITs) or other investments, depending on the CEF’s mandate. The fund managers then buy and sell over time, handing profits over to investors in the form of cash dividends. CEFs trade on public exchanges and can be bought and sold, just like a stock. 7 Best ETFs for the NEXT Bull MarketThis is great news for us, for two reasons. First, and most importantly, it means CEFs are heavily regulated. Just like big companies such as Apple (AAPL), Lowe’s (LOW) and Walmart (WMT), CEFs need to account for their operations and file financial statements to the Securities and Exchange Commission every quarter. Failure to act in investors’ best interests brings a stiff penalty, so fund managers have every incentive to behave responsibly. Even more reassuringly, most CEFs are managed by the biggest financial institutions in the world, like BlackRock and Eaton Vance. Secondly, being publicly traded means CEFs are extremely liquid. If you need cash, just sell your shares during market hours, Monday through Friday from 9:30 a.m. to 4 p.m. Eastern time. And buying CEFs has never been cheaper, now that many major brokerages offer low- (or no-) cost trading. That’s just the start of the great deal you get with CEFs. Take, for instance, the Gabelli Dividend and Income Fund (GDV), which hands out a huge 7.7% dividend. This fund has a lot of familiar names: MasterCard (MA), Microsoft (MSFT) and Pepsi (PEP) are top holdings. Normally, if you bought these stocks on an exchange, you’d have to pay the market price. But with GDV you’re getting these companies for 14.4% less than if you bought the shares directly. How is this possible? Because of a funny quirk with CEFs: they tend to trade for less than what their portfolios are actually worth. And their current portfolio value is quantified in a figure called net asset value, or NAV, which is easy to spot on most fund screeners. Some CEFs will go from having a deep discount to a narrow one, and even flip to a premium, many times through their lifetimes. Big Swings in Pricing This means that if you time your buys well, you can buy stocks through a CEF at a big discount and then sell at a narrower one, or even a premium, thus augmenting your returns. And that’s on top of the big yields, like GDV’s 7.7% annual payout. Put $100,000 in GDV, get $641 per month, then sell later at a profit? That’s why billionaires love CEFs. How to Buy In 3 Simple Steps With all this in mind, it’s no surprise that CEFs are a powerful tool the rich use to keep up their lavish lifestyles. But how can you get in? The first step is easy: open a brokerage account. Any brokerage that lets you buy and sell shares will also allow you to buy and sell CEFs. And now that many trading platforms require a low (or no) minimum to open an account, along with zero (or very cheap) brokerage fees, there’s really no barrier to anyone getting into trading CEFs. Also, the average price for a CEF is $11.83 as I write this, so don’t worry about the shares themselves being too expensive—they’re not. After you’ve opened your account, you’ll need to select the best CEF for you. There are a lot of things to consider in this step, so take your time and do your research. You’ll need to consider what asset class you want to buy into (stocks? municipal bonds? real estate?). Then you’ll need to decide what yield you want (is 6% enough? Want 8%? 10%?). Finally, you’ll ideally want to choose a fund that is well managed and trades at a big discount. Here too, research is the key. Finally, all you need to do is log into your brokerage account, enter the ticker for the fund you’ve chosen—like GDV above—and click “Buy.” Then you can sit back and let the dividends come to you. Want More Great Investing Ideas? Free Report: 5 Bargain Funds with Safe 11% Dividends A “1-Click” Way to Grab Safe 8% Dividends The $43,000 “dividend secret” Wall Street hides from you SPY shares rose $0.23 (+0.07%) in after-hours trading Tuesday. Year-to-date, SPY has declined -3.16%, versus a % rise in the benchmark S&P 500 index during the same period."}]}