{"article": [{"url": "https://stocknews.com/news/amzn-baba-two-e-commerce-stocks-busting-out-to-new-highs/", "published": 1594037300.0, "headline": "2 E-Commerce Stocks Busting Out to New Highs", "body": "One way to succeed in the stock market is by identifying changes in everyday life and finding the companies facilitating those changes. Consumer spending in the US and, around the world, continues to rise as the population grows and people get wealthier. And e-commerce stocks are taking a bigger piece of this growing pie every day. The coronavirus has accelerated this trend as retail foot traffic has plunged. In a low-growth world with zero interest rates, there’s going to be a premium for these fast-growing stocks. Since the stock market bottomed in March, they’ve retained their role as market leaders. Many are realizing two years of growth in two quarters due to these factors. While many stocks are dealing with declining sales, these stocks have the opposite problem – how to deal with the surge in demand. These stocks’ strong fundamentals and technicals are apparent in our POWR Ratings system. 7 \"SAFE HAVEN\" Dividend Stocks for Turbulent TimesWhat’s even more interesting is that many of these stocks have used the proceeds from their core, e-commerce business, and familiarity with the Internet to build adjacent businesses in other fast-growing segments. Here are two-commerce stocks that are busting out to new highs: Amazon.com, Inc. (AMZN) AMZN is a leader in online shopping and cloud computing. The company has been a big winner of the stay-at-home economy which is leading to growth in sales for all sorts of items. It’s also benefiting from the shift to remote work which is increasing demand for cloud computing. AMZN started its cloud computing division to meet its own needs and because it didn’t think any of the products on the market were good enough. The same thing happened with its logistics business as it was built from the ground-up to lower inventory and delivery costs. Both of these projects were so successful that they became their own entities and are valued more than $100 billion. The logistics business is now a backbone of the e-commerce economy, just like Amazon Web Services is a backbone of the Internet economy. Growth in online shopping and Internet use is inextricably linked to AMZN. Amazon’s leading position in multiple growing sectors is apparent in its POWR Ratings. AMZN is graded a “Strong Buy”. It also has an “A” in all categories including Trade Grade, Peer Grade, Buy & Hold Grade, and Industry Rank. Among Internet stocks, AMZN is ranked #1 out of 33. Alibaba Group Holdings (BABA) BABA started as a B2B marketplace. From there, it’s grown into a massive conglomerate with multiple growing subsidiaries including Taobao, a retail marketplace for consumers, Alipay, a Paypal-like product for China, cloud computing, and logistics and delivery business. Just like Amazon, these businesses were developed to meet BABA’s own needs. Along with the growth of the Chinese Internet, BABA has experienced extraordinary growth. In 2014, it had revenue of $10 billion. Its recent earnings report shows $70 billion in sales over the past 12 months. Despite its promising prospects and strong growth, Alibaba’s stock was range-bound between 2018 until its recent breakout. (Source: StockCharts.com) Due to this, BABA’s fundamentals are very attractive. It has a forward price to earnings ratio of 20 which is cheaper than the S&P 500’s forward p/e ratio of 22. It’s projecting sales growth of 22% next year and has gross margins of 44%. Both of these are significantly higher than the S&P 500. These strong fundamentals and technicals are reflected in BABA’s POWR Ratings. It has a Strong Buy Rating with an “A” in every category, and it’s ranked #1 out of 115 Chinese stocks. Want More Great Investing Ideas? 9 “BUY THE DIP” Growth Stocks for 2020 Is the Bull S#*t Rally FINALLY Over? 7 “Safe-Haven” Dividend Stocks for Turbulent Times Top 3 Investing Strategies for 2020"}]}