{"article": [{"url": "https://stocknews.com/news/tsm-zg-z-audc-3-tech-stocks-making-all-time-highs/", "published": 1595851700.0, "headline": "3 Tech Stocks Making All-Time Highs", "body": "Often, a recession leads to a reversal of market trends. Think about how the Nasdaq was crushed by 80% when the dotcom bubble popped in 2000, or how the oil market crashed in 2008 when the global economy started to slow. However, that isn’t the case with the technology sector in 2020. The coronavirus has turned out to be an accelerant of market trends. Technology was the strongest sector going into the coronavirus. And then it was down the least during the crash out of the major indices in March – the Dow was down 38.2%, the S&P 500 was down 35.4%, and the tech-heavy Nasdaq was down 32.5%. Typically during market crashes, higher-multiple stocks, which most technology stocks are, experience the biggest losses. However, its relative strength was a harbinger that institutions and investors continue to accumulate shares, and the virus wasn’t going to meaningfully affect their trajectories. 7 Best ETFs for the NEXT Bull MarketIn hindsight, it’s clear that the virus has led to an increase in tech spending. For example, the shift to remote work has led to more investments in cloud computing and another upturn in the semiconductor cycle. It turns out that for many companies, work can continue with the right technology even with no offices. Taiwan Semiconductor Manufacturing (TSM), Zillow Group (ZG), and AudioCodes (AUDC) are three of the tech companies whose technology is enabling companies and the economy to keep running. As a result, their shares are making new 52-week highs. Taiwan Semiconductor Manufacturing Company Ltd. (TSM) TSM designs and manufactures integrated circuits and semiconductors. It also supplies electronic spare parts, color filters, and engineering support services. TSM operates internationally, servicing North American, European, Asian, and African countries. It is the 12th most valuable stock in the world, with a market capitalization of almost $340 billion. TSM’s 5-nanometer technology is the most advanced in the market. TSM shares soared 10% as Intel Corporation (INTC) hinted on a possible partnership between the two companies as part of a contingency plan. As a manufacturer of the 7-nanometer transmitter, TMS could generate substantial profits and solidify its position as the world’s leading chip producer. TSM stands to benefit from the ongoing political tensions between the United States and China, as the United States is shifting its imports away from China. TSM entered into a partnership with NXP Semiconductors (NXPI) to combine the former’s 5- nanometer technology with NXPI’s automotive design expertise to create the next-generation, automotive processors. The consensus EPS estimate of $0.77 for the quarter ended September 2020 indicates a year-over-year increase of 24.2%. Moreover, TSM has surpassed consensus EPS estimates in three of the trailing four quarters, which is impressive. Consensus revenue estimate of $11.6 billion indicates a 23.5% increase year over year. TSM hit its year-to-date low of $42.70 on March 19th due to the pandemic-driven market crash and has gained more than 80% since then. How does TSM stack up for POWR Ratings? A in Trade Grade A in Buy & Hold Grade A in Peer Rank A in Industry rank A in overall POWR Rating You can’t ask for better. It’s also ranked #1 out of 86 in the Semiconductor & Wireless Chip industry. Zillow Group, Inc. (ZG) ZG is a real estate-oriented company that focuses on providing renting, buying, selling, and financing information about private and commercial properties through its website and mobile application. It also offers marketing, software technology, and advertising services. ZG is one of the best-performing companies in the COVID- 19 crisis, due to its unique business model. The company’s revenues for the first quarter increased 148% year over year to $1.1 billion. As work from home is increasingly becoming the “new normal,” many people are moving away from urban locations to the suburbs. This is evident in home prices which are rising in the suburbs. As of July, ZG has added 5 locations for real estate purchase and is currently purchasing a property in 20 out of the 24 markets. Zillow Offers, which allow users to buy and sell properties almost online with minimal physical contact, has gained popularity in recent months and contributed about 68.3% to its total revenues in the first quarter. Real estate brokerage RDFN stated that the demand for home purchases has increased 25% since the beginning of the pandemic, while new for-sale listing has increased by 5.2% as of July. The median list price and the median sale price of houses have increased by 5.3% and 1% year-over-year respectively, which bodes well for ZG. The consensus revenue estimate for the second quarter indicates a year-over-year increase of 3.1%. ZG hit its 52-week low of $18.65 on March 18th amid the pandemic-led market crash. It recovered 270% since then, subsequently hitting its 52-week high of $69.01 on July 23rd. ZG’s strong fundamentals are reflected in its POWR Ratings, it has a “Strong Buy” rating with an “A” in Trade Grade, Buy & Hold Grade, Peer Grade, and Industry Rank. It is also ranked #6 out of 54 stocks in the Internet sector. AudioCodes Ltd. (AUDC) AUDC provides voice over IP services, data networking solutions, unified communications, and cloud virtualized data centers. The company segregates its business into two categories – Network and Technology. Based in Israel, AUDC operates in the United States and European countries. AUDC generated $52 million in revenues in the first quarter, indicating an 11.7% rise year over year. Net income increased 76% year over year to $5.3 million during the quarter. AUDC raised $91 million in June through an underwritten public offering of 2.6 million shares, priced at $35 a share. This will help the company expand its business operations, and thereby will increase its potential to earn more. Omdia reported AUDC to be the fastest-growing company for the first quarter of 2020, as its SBC revenues grew 24% year over year. It is ranked 2nd among the SBC vendors list, as it contributes 17% to the total revenue. The consensus EPS estimate of $0.27 for the quarter ended June 2020 indicates a 22.7% increase year over year. Moreover, you should note that AUDC beat the consensus estimates in each of the trailing four quarters. AUDC gained more than 370% since hitting its 52-week low of $9 in mid-March due to the overall dip in the market. AUDU is rated “Buy” under our POWR Ratings system, due to its stable performance even during the pandemic. It has an “A” grade in Trade Grade and Peer Rank, and “B” in Buy & Hold Grade and Industry Rank. It is ranked #17 out of 51 stocks in the Technology – Communication/ Networking industry. Want More Great Investing Ideas? 9 “BUY THE DIP” Growth Stocks for 2020 Newly REVISED 2020 Stock Market Outlook 7 “Safe-Haven” Dividend Stocks for Turbulent Times TSM shares rose $0.90 (+1.08%) in after-hours trading Monday. Year-to-date, TSM has gained 45.21%, versus a 1.46% rise in the benchmark S&P 500 index during the same period."}]}