{"article": [{"url": "https://stocknews.com/news/pg-un-cl-3-stable-consumer-goods-stocks-that-pay-dividends/", "published": 1599566900.0, "headline": "3 Stable Consumer Goods Stocks that PAY Dividends", "body": "The consumer goods industry is one of the biggest industries in the world, with a steady flow of demand and sale of its products. Fast moving consumer goods are required for daily use by households all across the world, and are essential for maintaining basic hygiene and sanitation. The coronavirus pandemic and resultant lockdown led to a surge in the demand for these goods, as most people tried to stock up on the essentials. Also, the demand for sanitizers and soaps increased, as doctors advised frequently washing hands to avoid catching the virus. According to research expert Jan Conway, the demand for consumer packaged goods increased just under 10% in the United States. Though the demand for these goods have mostly remained stable, or have risen in the wake of the global health crisis, the mode of purchasing has changed. With the social distancing and extended norms, people have shifted to buying products from e-commerce sites. Due to this, most multinational consumer goods companies have reported a rise in their annual turnover. Companies such as Procter & Gamble Company (PG), Unilever NV (UN), and Colgate Palmolive Company (CL) have witnessed year-over-year growth in revenues. This has allowed them to maintain and even increase their quarterly dividend payouts this year. With an impressive dividend payout history of over 30 years, these companies can help income investors earn steady returns on their investments. 7 Best ETFs for the NEXT Bull MarketProcter & Gamble Company (PG) PG is one of the biggest fast-moving consumer goods (FMCG) manufacturers in the world, with operations in over 180 countries through five main segments – Beauty, Grooming, Healthcare, Fabric & Home Care, Baby, Feminine & Family Care. PG’s distributes its products through mass merchandisers, e-commerce sites, local grocery stores, professional channels and more. PG’s huge market presence and wide range of FMCG products have allowed it to remain profitable during the pandemic. Net sales increased 4% year-over-year to $17.69 billion in the fiscal fourth quarter that ended in June 2020. Gross profits rose 5% from the same period last year to $5.27 billion. PG pays an annual dividend of $3.16, which yields 2.29% based on its current price. It has a dividend payout ratio of 61.7%. PG’s cash flow balance has less variability than 98.2% of the stocks listed in the StockNews.com universe. PG has an impressive dividend payout history, as it not only issued dividends over the last 48 years, but has also incremented them every year. PG’s cumulative dividend payouts over the last six years are higher than 97.9% of other U.S. stocks. The consensus EPS estimate of $0.41 for the fiscal first quarter ending September 2020, indicates a slight increase year-over-year. PG beat the street EPS estimates in each of the trailing four quarters, which is impressive. The consensus revenue estimate of $18.68 billion for the ongoing quarter indicates a 2.9% increase year-over-year. PG has gained more than 50% since hitting its 52-week low of $94.34 in March. The stock hit its 52-week high of $141.70 in September. How does PG stack up for the POWR Ratings? A for Trade Grade A for Buy & Hold Grade A for Peer Grade A for Industry Rank A for Overall POWR Rating. You can’t ask for better. It is also ranked #1 out of 34 stocks in the Consumer Goods industry. Unilever NV (UN) UN is a multinational company specializing in FMCG products for over 120 years. It categorizes its products into three different segments – Beauty & personal Care, Foods & Refreshment, and Home Care. Its most popular products include Dove, Axe, Vaseline, Ben & Jerry’s, Lipton, and more. UN has a loyal customer base, allowing it to generate profits even during the recession. In the second quarter that ended in June 2020, the In-Home category’s underlying sales grew 17% year-over-year. Annual turnover in the first six months of 2020 amounted to €26 billion. UN pays an annual dividend of $1.84, which yields 3.18% on its prevailing price. It’s average cash flow over the past twelve months is higher than 94.7% of the stocks in our universe, which should allow the company to sustain its dividend payouts. UN has a dividend payout ratio of 61.6%. Over the trailing twelve months, UN has issued more dividends than 95.2% of other dividend paying stocks in the StockNews.com universe. UN’s dividend has grown at a 9% CAGR over the last three years. UN’s EPS is expected to grow at 9.3% per annum over the next five years. The stock has gained more than 35% since hitting its 52-week low of $42 in March. UN is rated a Strong Buy in our POWR Ratings system, consistent with its sound business model and financial stability. It has a grade of A in Trade Grade, Buy & Hold Grade, and Industry Rank, and a B in Peer Grade. It is ranked #2 out of 34 stocks in the Consumer Goods industry. Colgate Palmolive Company (CL) CL is one of the most popular brands of hygiene products across the world. Apart from its oral and home care products, CL also manufactures and supplies products pertaining to pet nutrition. It also has the highest market share in the global toothpaste and toothbrush market. CL’s strong consumer demand and brand loyalty has continued to drive CL’s growth amid the pandemic. CL’s organic net sales increased 5.5% year-over-year in the second quarter of 2020, leading to a 1% year-over-year rise in net sales to $3.89 billion. GAAP gross profit margin increased 110 basis points to 60.8%. Net income grew 8.3% from the year-ago value to $675 million. CL pays an annual dividend of $1.76 per share, which yields 2.28%. Its cash flow balance is less volatile than 99.3% of the U.S. stocks in the StockNews.com universe, which helps CL sustain its dividend payouts. CL has a dividend payout ratio of 59.2%. The company’s dividend grew at CAGR 2.35% in trailing twelve months. Even though the consensus EPS estimate for the third quarter ending September indicates a slight decline year-over-year, CL has an impressive earnings surprise history, as it beat the street EPS estimates in three out of the trailing four quarters. The consensus revenue estimate of $3.79 billion indicates a slight improvement year-over-year. CL has gained more than 35% since hitting its 52-week low of $58.49 in March. The stock hit its 52-week high of $80.10 in September. It’s no surprise that CL is rated a Strong Buy in our POWR Ratings system, with a grade of A in Trade Grade, Buy & Hold Grade, Peer Grade, and Industry Rank. Out of 34 stocks in the Consumer Goods industry, it is ranked #4. Want More Great Investing Ideas? 7 Best ETFs for the NEXT Bull Market Will Stocks Fall into Historical September Slump? 9 “BUY THE DIP” Growth Stocks for 2020 PG shares were trading at $136.03 per share on Tuesday afternoon, down $1.93 (-1.40%). Year-to-date, PG has gained 10.99%, versus a 5.89% rise in the benchmark S&P 500 index during the same period."}]}