{"article": [{"url": "https://stocknews.com/news/rcl-lind-ccl-nclh-should-you-buy-shares-of-royal-caribbean-as-we-head/", "published": 1601467700.0, "headline": "Should You Buy Shares of Royal Caribbean as We Head into 2021?", "body": "Controlling over 20% of the global cruise market, Royal Caribbean Cruises Ltd. (RCL) is the largest cruise line company by revenue in the world. The company is the owner of four global cruise vacation brands – Royal Caribbean International, Celebrity Cruises, Silversea, and Azamara. RCL is also a 50% owner of a joint venture that operates TUI Cruises and Hapag-Lloyd Cruises. Together, the brands operate 62 ships with an additional 16 on order. The company currently has nearly 20 million members in its loyalty program RCL is one of the worst-hit stocks of 2020, as lockdowns resulted in the cancellation of all of the company’s current year sailings. The top-line declined 94% year-over-year in the second quarter to $176 million. Passenger ticket revenues decreased 94.7% to $107 million, compared to $3 billion last year. The company reported a loss of $7.83 per share for the quarter. However, RCL stock jumped in August after the company announced “remarkable” bookings for its international cruises in 2021, noting that 60% of bookings are for entirely new cruises rather than rescheduled ones from this year. 9 \"BUY THE DIP\" Growth Stocks For 2020But with travel restrictions amid the rising coronavirus cases, the company is presently struggling to stay afloat. The quarterly performance and the potential downside based on a number of factors have led our proprietary system to rate RCL as a “Sell.” Here is how our proprietary POWR Ratings system evaluates RCL: Trade Grade: F RCL is currently trading higher than its 50-day moving average of $60.82, but below its 200-day moving average of $68.92, indicating that the stock is neither in an uptrend, nor in a downtrend. In fact, the stock’s 6.5% loss over the past month reflects short-term bearishness. RCL suspended its global cruise operation in March, voluntarily deferring the sails to at least October 31, which is a month beyond the “No Sail” order from the Centers for Disease Control and Prevention (CDC). RCL issued $1 billion worth priority guaranteed notes and $1.15 billion of convertible notes during the second quarter to keep liquidity in check. Buy & Hold Grade: F In terms of proximity to its 52-week high, which is a key factor that our Buy & Hold Grade takes into account, RCL is not well positioned. The stock is currently trading 52.4% below its 52-week high of $135.32. Looking at the past three years, the stock has lost nearly 42% due to its impaired earnings, and change in consumer and business behavior. EDITDA has deteriorated at a CAGR of 24% during the same period. Peer Grade: A RCL is currently rated #1 out of 5 stocks in the Travel – Cruises industry. Other popular stocks in the group are Lindblad Expeditions Holdings Inc. (LIND), Carnival Corporation (CCL) and Norwegian Cruise Line Holdings Ltd. (NCLH). RCL is down 51.3% year-to-date. The sector has been heavily bleeding and LIND, CCL and NCLH have also lost 47.5%, 70% and 71.7%, respectively, over this period. Industry Rank: F The StockNews.com Travel – Cruises industry is ranked #113 out of the 123 industries. The companies in this industry operate deep sea cruise ships and inland/coastal cruise ships. According to the research firm Tourism Economics, roughly eight million of the jobs lost in the United States this year have been in the travel industry, as the industry has not been performing well amid the health crisis. However, the industry is expected to roar back once there is a vaccine against the virus. Overall POWR Rating: D (Sell) Overall, RCL is rated a “Sell” due to its declining business, uncertain industry outlook, and short-term bearishness, as determined by the four components of our overall POWR Ratings. Bottom Line RCL’s fundamentals have massively weakened amid the pandemic. At the current price level, RCL stock is unlikely to be sustainable without stable revenue. Passengers from the U.S. and Europe comprise around 75% of cruise revenues. While these two regions are currently working hard to contain the spread of the second wave of COVID-19, domestic and international travel still remains at highly depressed levels. Moreover, experts recommend heightened protocols for the healthy return of sailing. Analyst sentiment, which gives a good sense of a stock’s future price movement, is not favorable for RCL. The market expects revenues for the current quarter to decline 99.5% year-over-year. The consensus EPS estimate for the ongoing year indicates a 284% fall from the year-ago value. This outlook should command a weak price momentum for RCL in the near term. Want More Great Investing Ideas? Do NOT Buy Stocks Before the Election! 7 “Safe-Haven” Dividend Stocks for Turbulent Times Chart of the Day- See Christian Tharp’s Stocks Ready to Breakout RCL shares fell $0.26 (-0.40%) in after-hours trading Wednesday. Year-to-date, RCL has declined -51.04%, versus a 5.54% rise in the benchmark S&P 500 index during the same period."}]}