{"article": [{"url": "https://stocknews.com/news/ms-uri-bery-3-large-cap-value-stocks-to-buy-and-hold-for-a/", "published": 1600171700.0, "headline": "3 Large-Cap Value Stocks to \"Buy and Hold\" for a Decade", "body": "Over the last thirteen years, growth stocks have beaten value stocks. The SPDR 500 Growth ETF (SPYG) has outperformed the SPDR 500 Value ETF (SPYV), 161.8% to 45.8%. While value has historically outperformed growth over the long-term, value has been extremely unpopular lately, especially over the past five years, where growth has driven market gains. Growth stocks have especially been on a tear over the last few years, primarily driven by large tech stocks. Who can blame investors wanting a piece of the pie? But in the last few months, growth stocks have exploded as people spending more time at home shopping online and working remotely. At the same time, value stocks in industries such as airlines, hotels, and retail, have seen some of the worst price dips in decades. Investors got an early wake-up call last week as the S&P 500 dropped 6.7% from September 3rd to September 11th. The Nasdaq composite went into correction territory with a 10% drop. It appears volatility is back on Wall Street. There is uncertainty stemming from concerns about tech stock valuations, the upcoming presidential election, and the ongoing pandemic. 7 Best ETFs for the NEXT Bull MarketAn Opening for Value Stocks This volatility may provide an opening for value stocks. In fact, in the September 3rd to September 11th period, SPYV was only down 3.5% compared to an 8.5% drop for SPYG. Growth stocks are at one of the most expensive levels in history, while value stocks are at one of the cheapest. Historically, when value is this cheap compared to growth, value has greatly outperformed growth. In fact, this gap between them has never been wider. In a sell-off, value has traditionally lost less than growth. Then in the recovery, value has vastly outperformed growth. This provides us an opportunity to consider a few top value stocks to add to our portfolios for the long-term: Morgan Stanley (MS), United Rentals (URI), and Berry Global Group (BERY). Morgan Stanley (MS) MS is a global investment bank with a history tracing back to 1924. The company has institutional securities, wealth management, and asset management segments. The company has over 60,600 employees and serves a diversified group of clients and customers, including individuals, corporations, governments, and financial institutions, with more than 1,200 offices across 41 countries. With talk of the pandemic destroying financial companies, MS had a very strong quarter, outperforming analyst estimates and increasing both its top line and bottom line growth. Earnings were up 59.3%, and revenues increased 31% year over year. MS’s plan to acquire E*Trade Financial (EFTC) should strengthen future growth. The company is also restructuring its operations to focus on less capital-dependent revenue sources such as wealth management and investment management. MS has a P/E of 9.2 and a free cash flow yield of 23.1%; both look very attractive in terms of valuation. The stock is rated a “Buy” in our POWR Ratings system. It holds a grade of “A” for Trade Grade, and a “B” for Buy & Hold Grade and Peer Grade. These are three out of the four components that make up the POWR Ratings. MS is also the #4 ranked stock in the Investment Brokerage industry. I view MS as a long-term buy due to the firm being a leader in equities and fixed income trading and investment banking. The company is also a leader in wealth management, which provides stable recurring revenue and cash flow. The company also has a profit margin of 22.7%, and a dividend yield of 2.8%. United Rentals (URI) URI is the world’s largest equipment rental company, with operations in the United States and Canada. It serves three end markets: general industrial, commercial construction, and residential construction. The company has historically provided its customers with equipment intermittently used, such as aerial equipment and portable generators, but now also offers a range of specialty equipment. In the first half of the year, equipment rentals represented nearly 83% of its revenues. The company initially faced setup backs during the pandemic, but the overall construction market has been rebounding. This has led to rising demand for specialty construction products, contributing to its trench, power, and fluid solutions segment’s revenues. The Trump administration proposed a $1-trillion infrastructure package in June, which would provide funding for roads and bridges, a 5G buildout, and rural broadband infrastructure. If this goes through, it would surely benefit URI. The company has a P/E of 12.0 and a free cash flow yield of 9.9%; both are favorable figures. The stock is rated a “Strong Buy” by our POWR Ratings system. It has a grade of “A” for Trade Grade and Buy & Hold Grade, and a “B” for Peer Grade. URI is also the #1 ranked stock in the Industrial – Services industry. I view the stock as a long-term buy due to its strong market position, growth in its specialty equipment segment, and the fact it has the most comprehensive fleet in the industry. Berry Global Group (BERY) BERY manufactures and sells plastic packaging products in three segments based on the product type. The consumer packaging segment, which generates the highest revenue, sells containers, plastic drink cups, prescription vials, and printed bags for food products. The health, hygiene, and specialties segment sells baby diapers, feminine hygiene products, and substrates for dryer sheets. The engineered materials segment sells tapes, retail trash bags, and shrink films. The company’s diversified non-discretionary product portfolio allows it to withstand a market downturn. The company expects revenue growth despite the pandemic due to the demand for healthcare, hygiene, and grocery products. BERY should see enhanced growth due to its acquisitions. For instance, last year, the company acquired RPC Group PLC. This expanded BERY’s presence in the plastic and recycled packaging industry. BERY has a P/E of 12.0 and a free cash flow yield of 15%, indicating that it is trading at an attractive price. The stock is rated a “Strong Buy” by our POWR Ratings system. It holds grades of “A” in Trade Grade and Buy & Hold Grade, and a “B” in Industry Rank. I view the stock as a long-term investment due to its valuation, history of growth, and vast product portfolio. The health, hygiene & specialty should see higher sales due to the pandemic, and its consumer packaging businesses will drive revenue once the pandemic is over. Want More Great Investing Ideas? 7 Best ETFs for the NEXT Bull Market Is the Stock Market Correction Over? Chart of the Day- See the Stocks Ready to Breakout MS shares rose $0.09 (+0.18%) in after-hours trading Tuesday. Year-to-date, MS has gained 0.79%, versus a 6.78% rise in the benchmark S&P 500 index during the same period."}]}