{"article": [{"url": "https://stocknews.com/news/cboe-txn-use-this-options-strategy-to-profit-ahead-of-earnings/", "published": 1594901300.0, "headline": "Use This Options Strategy to Profit Ahead of Earnings Season", "body": "Last week in this article, I discussed how options volatility and pricing behave surrounding earnings reports. Now that earnings season has officially kicked off, we can see that happen in real-time. I want to drill down into a strategy I use to profit prior to the earnings event. And I show the exact trade I made, which was “Texas Instruments (TXN),” in my Earnings360 service this week. The strategy is slightly complex, but it is also very conservative and delivers consistent 20%-30% profits in a matter of days without taking on the risk of holding through the actual event. The biggest mistake novices make is purchasing puts or calls outright as a means of directional “bet.” They are usually disappointed with the results as even if the stock moves in the predicted direction, the value of the option can actually decline and result in a loss despite being “right.” 9 \"BUY THE DIP\" Growth Stocks For 2020As the article discusses, the problem is that they failed to account for the Post Earnings Premium Crush (PEPC), which is how the implied volatility contracts sharply, immediately following the report — no matter what the stock does. It does a great job of explaining how to use the straddle to both assess expectations and give yourself the best possible chance to profit. The Pre-Earnings Trade Now. I want to focus on a reliable and conservative strategy for profiting on the expected increase in implied volatility. It avoids the earning event altogether. I call Pre-Earnings Premium Expansion predictable so is the pumping up of premium leading into the event; it’s just more subtle in that it occurs incrementally over the course of many days. One strategy for taking advantage of rising IV leading into earnings is what I’ll refer to as a double strangle. To set up this strategy, you sell an option that expires prior to the earnings while simultaneously purchasing one that expires after the event. Here is the exact trade-in, “Texas Instruments (TXN),” I initiated and sent to Earnings360 members on Monday. TXN doesn’t report earnings until next Tuesday, July 21st and the plan from the beginning was to close it out by this Friday. Here is what the initial trade was with an example of the order: ACTION:-Sell to open 2 contracts TXN July (7/17) 123 Puts-Sell to open 2 contracts TXN July (7/17) 134 Calls-Buy to open 2 contracts TXN July (7/24) 123 Puts-Buy to open 2 contracts TXN July (7/24) 134 CallsFor a Net Debit of $3.50 (do not go above $3.70) This will not only benefit from the accelerated decay of the nearer dated options sold short. But, this has the added tailwind of as earnings approach the option, will see it IV rise causing the value of the spread to increase. To keep the position delta neutral both put and call calendars should be established. Today with TXN trading still trading around $130 were we able to close the position for $4.20 credit or a solid 20% gain. If you look at the order ticket (which is simply reversing the buy/sell of each strike) below, you’ll note that the put and call we originally sold for a combined $0.92 of premium today was worth just $0.37. Meanwhile, the put and call we bought have retained their value. Theoretically, I could have held the position until tomorrow’s expiration and tried to squeeze out an additional $0.30 of premium. But, I’m not a greedy man. With most stocks offering weekly options and volatility at a heightened level, there should be plenty of opportunities for double strangles available. As always, do your research and confirm the reporting dates. But, this offers a great starting point. Or I’d be happy to have you join me in the Earnings 360 Service as we’re just getting started. Want More Great Investing Ideas? 9 “BUY THE DIP” Growth Stocks for 2020 Top 5 WINNING Stock Chart Patterns 7 “Safe-Haven” Dividend Stocks for Turbulent Times CBOE shares were trading at $92.88 per share on Thursday afternoon, down $1.16 (-1.23%). Year-to-date, CBOE has declined -22.10%, versus a 0.59% rise in the benchmark S&P 500 index during the same period."}]}