{"article": [{"url": "https://stocknews.com/news/adbe-docu-docusign-vs-adobe-which-is-a-better-buy/", "published": 1599653300.0, "headline": "Docusign vs. Adobe: Which is a Better Buy?", "body": "When it comes to document services providers, two stocks shine particularly bright: Adobe (ADBE) and DocuSign (DOCU). Both of these companies are expanding their customer bases amidst the COVID-19 pandemic. If you have not yet used ADBE or DOCU for document services, you may at some point in the future. More importantly, you stand a good chance of benefitting from both of these stocks in the context of investing. There is a common misconception that ADBE reigns supreme above DOCU and 99% of other tech stocks simply because it is an industry titan that has dominated since the 1990s. However, DOCU has plenty of merits worth recognizing from the consumers’ perspective and those in investing circles. Without further ado, let’s take a look at whether ADBE or DOCU is a better investment. 9 \"BUY THE DIP\" Growth Stocks For 2020Adobe (ADBE) ADBE does a little bit of everything, yet its document services have proven quite important. Chances are you have used ADBE’s PDFs for work-related documents. From contracts to reports and documents of other sorts, ADBE makes it easy to present a considerable amount of information clearly and cogently through the web. ADBE’s services and software are used by professionals across a litany of industries as well as consumers. ADBE generates the majority of its revenue from customers through licensing fees. ADBE also provides technical support and consulting/education services to boot. ADBE’s Digital Media solutions make it easy for businesses to generate engaging content, offer it through a wide array of electronic mediums, and ultimately grease business wheels. Check out ADBE’s POWR Ratings, and you will find A grades in each POWR component, but for its Buy & Hold Grade, which is a B. ADBE is ranked in the top 10 of more than 90 stocks in the Software – Application category. In terms of price returns, ADBE is in the green across every time period without exception. In particular, ADBE’s six-month price return is especially impressive, coming in at 62.15%. Analysts have set a price target of $437 for ADBE, indicating it might be slightly overpriced at its current trading level around $460. However, out of the 19 analysts who have studied ADBE, fourteen insist it is a Buy, five insist it is a Hold, and none advise selling. ADBE has a forward P/E of 50, indicating it is fairly priced at $460. However, there are plenty of other tech stocks with forward P/E ratios in the hundreds, so it can be argued ADBE might be underpriced compared to its peers. DocuSign (DOCU) E-signature and cloud-based services are becoming that much more popular during the pandemic. It is now possible to sign legal documents while a notary witnesses the signature through online video conferencing, transmitting those documents to the appropriate party and storing them on the cloud. This comparably efficient approach might end up being normative after the pandemic concludes. DOCU provides such e-signature services in addition to other electronic document solutions. From real estate to the legal realm, government, healthcare, and insurance industries, DOCU solutions are essential for various services. The DOCU portfolio includes e-notary, DocuSign payments, enterprise pro, business pro, real estate DocuSign transaction rooms, standards-based signatures, etc. The POWR Ratings show DOCU has A grades in its Trade Grade and Industry Rank POWR components. DOCU is ranked in the top 10% of the 90+ Software – Application stocks, coming in at number 10. DOCU has a comparably short price return history, yet the figures are in the green going back through the past couple of years. DOCU has a one-year price return over 250%. Though DOCU has a high forward P/E ratio of nearly 500, the analysts insist the stock still has room to move upward, setting a price target of $255.40 for the stock. The Verdict: You cannot go wrong with either of these document services providers. Both stocks recently pulled back as investors took profits off the table, providing a buying opportunity. Want More Great Investing Ideas? 7 Best ETFs for the NEXT Bull Market Will Stocks Fall into Historical September Slump? 9 “BUY THE DIP” Growth Stocks for 2020 ADBE shares were trading at $475.31 per share on Wednesday morning, up $13.18 (+2.85%). Year-to-date, ADBE has gained 44.12%, versus a 6.65% rise in the benchmark S&P 500 index during the same period."}]}