{"article": [{"url": "https://stocknews.com/news/spy-inx-dia-iwm-qqq-trading-plan-to-closeout-2020/", "published": 1600344500.0, "headline": "Trading Plan to Closeout 2020", "body": "Steve Reitmeister is a 40 year investment veteran who recently shared his most up to date market outlook and trading plan in this timely presentation: Trading Plan to Closeout 2020. Steve has been commended for reading the tea leaves correctly on the 2020 stock market. For example, he saw the bubble forming in tech stocks and took a large allocation to the group. And just when most other investors were celebrating the new highs he called for the bubble to pop in September. This was explained in recent articles including: 9 \"BUY THE DIP\" Growth Stocks For 2020Beware Stocks in September? Will Stocks Fall into Historical September Slump? For those short on time, here is the nutshell version of these commentaries. The market looks set to correct 10-20% for the following reasons: Stocks are overbought after gaining an astonishing 60% in just 5 months. Valuation is getting very stretched at a PE of nearly 30. Remember that the historical norm is more like a PE of 15-16. And at the end of a bull run you may see the PE peak over 20…but 30 seems far too rich at this juncture of the recovery. September is by far the worst month of the year for stocks as explained by Jeff Hirsh, author of the Stock Traders Almanac. Presidential election years are rough for stocks. Starting about September the market typically starts to crater into the election and investors are wise to take profits off the table and even consider trades to gain from that market downside. Adding all the above together you start to appreciate why the odds are stacked against the stock market from here through the election. Steve goes on to explain his specific game plan into November in this new on-demand presentation: Trading Plan to Closeout 2020. This presentation also goes on to describe the unique hurdle presented by the 2020 Presidential election. That being… The rise of the Coronavirus = many more write in ballots = greatly increased odds of a delayed election result. Even worse, this may be a contested election like we endured with Bush vs. Gore in 2000. You all remember the famed “dangling chad” concerns from the Florida election results that ended with the courts determining the winner of the election. 2020 could be even more troublesome as both political parties are “lawyering up” for a post election battle to make sure victory is not snatched from under them. As you could imagine the concept of a delayed or contested election results would be very bad for the stock market. In fact, the strategists at Goldman Sachs are saying it could quickly lead to an additional 10% sell off in the stock market. Steve covers this topic and more with his post-election trading plan. So if you want insights for how to trade the market before and after the election, then now is the time to watch Steve Reitmeister’s timely presentation. Trading Plan to Closeout 2020. Learn More About Steve Reitmeister SPY shares were trading at $335.84 per share on Thursday afternoon, down $2.98 (-0.88%). Year-to-date, SPY has gained 5.42%, versus a % rise in the benchmark S&P 500 index during the same period."}]}