{"article": [{"url": "https://stocknews.com/news/aapl-msft-amd-3-must-have-tech-stocks-for-the-second-half-of/", "published": 1593691700.0, "headline": "3 Must Have Tech Stocks for the Second Half of 2020", "body": "The coronavirus outbreak has had a significant impact on the economy. Some sectors have been hit harder than others. One sector that has weathered the storm well is the technology sector. The Technology Select Sector SPDR ETF (XLK) is up 15.8% for the year. That return is higher than the S&P 500’s 2% loss. Tech companies have been able to withstand the effects of the pandemic, but they are now benefiting as well. With people mainly working from home, there are far more growth opportunities for technology firms. For instance, there has been a significant shift in consumer preference for services over the internet. This leads to an increase in demand for cloud service, computers, and smartphones, leading to more demand for semiconductors. Here are three stocks that fit that demand: 9 \"BUY THE DIP\" Growth Stocks For 2020Apple (AAPL) AAPL is the dominant company in the smartphone space. The company designs everything that goes into a tablet or phone. Their customers are very loyal and continue to upgrade to a new iPhone with every release. This could add up to 350 million iPhone upgrades over the next 12 months. The company has also been diversifying its revenue stream. Its wearables, home, and accessories segment are the company’s fastest-growing business. It represents 11% of sales. This is due to it’s popular Apple Watch and Airpods lineup. AAPL continues to release new versions of these devices. The company holds a 29% market share in the wearable space. AAPL has also generated revenue through its services business, which includes the App Store, Apple Music, and Apple TV+. Revenue for this segment was $13 billion in the most recent quarter. The company should also benefit from a 5G iPhone that could generate even more sales. The stock is rated a Strong Buy in the StockNews.com POWR Ratings. It is ranked #1 out of 28 Technology and Hardware Stocks. It also has a Trade Grade of A, which tracks the short-term bullish or bearishness of a stock. Microsoft (MSFT) MSFT has lately been focusing on cloud computing and artificial intelligence. The cloud computing unit had sales of $39 billion last year. That’s 31% of the company’s total revenue. Its cloud product, Azure Cloud, is the fastest-growing cloud business in the market as the pandemic has accelerated the growth of its video meetings product, Microsoft Teams. MSFT also generates vast profits from its software products. There are now more than one billion computers and devices using Windows 10. Recently the company switched its focus to a subscription-based model called Office 365. This has led to $71 billion of cash on MSFT’s balance sheet. The company pays its shareholders with 1% dividend. The stock has outperformed the S&P 500 over the past year. It is up 31.5% for the year. As its physical stores were closed due to the pandemic, the company has been conducting online workshops via e-commerce operations. This has been so successful that MSFT announced that it is closing physical locations for good. MSFT recently agreed to purchase CyberX, a developer of cybersecurity solutions for the Internet of Things (IoT) market. The company will be able to integrate CyberX’s tools into its portfolio of IoT security services. This should strengthen Azure Sentinel, which is its cloud-native security platform. Advanced Micro Devices (AMD) AMD is a global semiconductor company that provides processing solutions for the computing, graphics and consumer electronics markets. Many analysts consider AMD’s CPU product line superior to its larger competitors NVIDIA (NVDA) and Intel (INTC). The chips the company creates are powering data centers and the cloud. The company currently has a $60 billion market cap. It has returned more than 40% since its low in March. AMD is poised to continue to do well for the second half of the year. Companies everywhere are migrating to cloud-based infrastructure, and there is high demand for chips. For instance, MSFT and Sony (SNE) are launching new gaming platforms. This should give AMD a considerable boost. In the first quarter, AMD reported 40% revenue growth year-over-year. AMD’s second-quarter sales are expected to rise more than 20%. AMD is rated a Buy in the StockNews.com POWR Ratings. It is ranked #19 out of 86 stocks in the Semiconductor & Wireless Chip industry. Want More Great Investing Ideas? 9 “BUY THE DIP” Growth Stocks for 2020 Is the Bull S#*t Rally FINALLY Over? 7 “Safe-Haven” Dividend Stocks for Turbulent Times Top 3 Investing Strategies for 2020 AAPL shares . Year-to-date, AAPL has gained 24.63%, versus a -1.99% rise in the benchmark S&P 500 index during the same period."}]}