{"article": [{"url": "https://stocknews.com/news/amzn-now-podd-chtr-4-high-growth-stocks-that-could-surge-for-the-rest-of/", "published": 1601986100.0, "headline": "4 High-Growth Stocks That Could SURGE for the Rest of 2020", "body": "If you’re looking for four stocks that could inject your portfolio with healthy gains for the remainder of the year, look no further. Amazon.com (AMZN), ServiceNow (NOW), Insulet (PODD), and Charter Communications (CHTR) are four stocks that passed my strict “high-growth” screener. These are companies with a history of strong growth and are forecasted to have robust growth in the upcoming quarters. They also have business models that are unlikely to be affected by the market’s current uncertainty. Heading into October, many investors feared another down month due to a view that the markets are historically down in October. The problem is, that isn’t true. There’s actually a name for that, called the “October Effect.” Aside from the infamous October 1987, stocks have typically done well in October. In addition to that, a strong third quarter is usually followed by a strong fourth quarter, according to LPL Financial’s Ryan Detrick. That’s not to say we won’t see volatility over the next few months, especially in a year that has been full of surprises. We are heading into the November 3rd presidential election, and the third-quarter earnings season kicked off this week. FactSet expects third-quarter earnings for companies in the S&P 500 to decline by an average of 21.8%. We could see a repeat of last quarter when many companies outperformed analyst expectations, or earnings could come in as expected. Either way, if you own a select group of high-growth companies with strong catalysts for growth, your portfolio should benefit. 7 Best ETFs for the NEXT Bull MarketAmazon.com (AMZN) AMZN certainly belongs on this list with a five-year average earnings growth rate of 106.5%. Earnings are expected to grow 40.2% next year, and revenues at 18%. To say AMZN has had a good year is an understatement. The stock is up 67.8% year to date, led by a spike in online orders due to the coronavirus. AMZN is the undisputed e-commerce heavyweight of the world, and the pandemic played right into its hands. The company has also seen a strong adoption rate of its AWS product, which is only reinforcing its case as the dominant cloud company. AMZN is also the leader in the $5.7 billion smart speaker market. It recently announced a ton of new hardware products, including a collection of 4th generation Echo smart speakers, new Fire TV Stick video streamers, Eero Wi-Fi routers, and new Ring security cameras. Adding to this, AMZN’s Prime Day, which is its biggest shopping event of the year, will be taking place on October 13 and 14. Last year’s Prime Day surpassed the company’s 2018 Black Friday and Cyber Monday combined. So, it’s no surprise AMZN is rated a “Buy” in our POWR Ratings system. It has an “A” Trade Grade, and grades of “B” for Buy & Hold Grade, Peer Grade, and Industry Rank. It is also ranked #9 in the Internet industry. ServiceNow (NOW) Another cloud company with very strong growth potential is NOW. The firm provides software solutions to structure and automate various business processes via a SaaS delivery model. The company primarily focuses on the IT function for enterprise customers and had one hell of a year with earnings growing 1944.4%. Its five-year revenue growth rate is 33.9%, and analysts expect the company to grow revenues 24.5% and earnings 24.2% next year. The company is poised to benefit from strong growth in subscription revenues. During the second quarter, the company announced that it closed 40 transactions that totaled more than $1 million in annual contract value. That was a 26% year-over-year increase in customers. Due to the strong adoption of its solutions, management raised its 2020 guidance for subscription revenues, gross margin, and operating margin. Growth should continue due to two compelling secular trends, digital transformation, and the migration to cloud computing. NOW says its platform is used by approximately 80% of Fortune 500 companies, and it’s looking to add the remaining 20%. The company is rated a “Strong Buy” in our POWR Ratings system, with a grade of “A” in Trade Grade, Buy & Hold Grade, and Peer Grade. It is also the #1 ranked stock in the Software – Business industry. Insulet (PODD) PODD was founded in 2000 with the goal of making continuous subcutaneous insulin infusion therapy for diabetes easier to use. That goal has certainly paid off with the company seeing sales grow an average of 33.4% over the past five years. Analysts expect earnings to soar 238.9% next year. The company’s main product, the Omnipod system, consists of a small disposable insulin infusion device and a wireless personal diabetes manager that controls the dosage. Companies that make diabetic devices have mostly been immune to the pandemic. It’s a matter of life and death if diabetic patients put off care. The rate of diabetes is increasing due to an aging and increasingly overweight population. Since the FDA approved the Omnipod in 2005, 140,000-145,000 insulin-dependent diabetics are using the device worldwide. PODD is planning additional geographic expansion and maintains its $1 billion revenue goal for 2021. PODD recently showcased its newest product, the Omnipod 5, which it hopes to bring to market early next year. The system dispenses small amounts of glucose regulated by a smartphone app and can also dispense other medications. The company is rated a “Strong Buy” by our POWR Ratings system, with grades of “A” in Trade Grade, Buy & Hold Grade, and Peer Grade. It is also ranked #5 out of 140 stocks in the Medical – Devices & Equipment stocks. Charter Communications (CHTR) My final stock is one where you might question where the growth will be, as it’s a cable stock. Most people think that streaming devices and cord-cutting means the end of cable. While that may be the case over the long-term, I don’t believe it hurts this company’s near and mid-term prospects. Plenty of people are still using cable to access live sports, plus cable providers also provide consumers internet access to watch streaming video. CHTR growth numbers support this. The company’s sales have risen an average of 37.1% per year over the last five years. Its earnings have grown at a rate of 52.7% over the past three years. Analysts expect earnings to grow 51.5% next year. CHTR is the second-largest cable operator in the United States, by subscribers, after Comcast (CMCSA). The company announced that net new customers grew from 203,000 a year ago to 753,000 in the second quarter this year. The company also benefits from local advertising, but the internet and mobile revenues are the main growth drivers over the near term as the company saw a massive spike in internet usage due to the work-from-home and online-learning trend. CHTR is rated a “Strong Buy” in our POWR Ratings system. It holds a grade of “A” for Trade Grade and Buy & Hold Grade, and a “B” for Peer Grade and Industry Rank. It is also ranked #2 in the Entertainment – TV & Internet Providers industry. Want More Great Investing Ideas? Do NOT Buy Stocks Before the Election! 7 “Safe-Haven” Dividend Stocks for Turbulent Times Chart of the Day- See Christian Tharp’s Stocks Ready to Breakout"}]}