{"article": [{"url": "https://stocknews.com/news/ibm-imos-xper-mndo-4-tech-stocks-with-high-dividend-yields/", "published": 1597666100.0, "headline": "4 Tech Stocks With HIGH Dividend Yields", "body": "It’s a tricky time for investors. Economic weakness persists with unemployment above 10% and small business bankruptcies on the rise. There are concerns that the worst effects economically haven’t been felt yet. However, the stock market is trading at all-time highs as it’s becoming increasingly optimistic that the economic recovery will continue and that the country’s health situation won’t take a turn for the worse. During these uncertain times, investors should consider tech stocks with high dividend yields. If the economy deteriorates, these dividend payments will be more attractive as interest rates will fall. Further, these companies have reasonable valuations and diversified sources of revenue. If the economy’s recovery continues, then it’s likely that technology will be one of the areas that will benefit. Here are four tech stocks that stand out for their exceptional dividend yield: International Business Machines Corporation (IBM), ChipMOS Technologies Inc. (IMOS), Xperi Holding Corporation (XPER), and MIND C.T.I. Limited (MNDO). 9 \"BUY THE DIP\" Growth Stocks For 2020International Business Machines Corporation (IBM) IBM operates as an integrated solutions company that provides information technology (IT) products and services worldwide. Its Cloud & Cognitive Software segment offers software for vertical and domain-specific solutions in health, financial services, and Internet of Things (IoT), and other services application areas. The stock has been consistently paying dividends each quarter for the last six decades. In the previous five years, dividend payout for IBM grew at a CAGR of 8.3%. While the four-year average dividend yield for IBM is 4.5%, the current dividend translates to a 5.2% yield. The most recent dividend declared by the company was $1.63 for the last reporting quarter, amounting to an annual dividend of $6.52. IBM has recently reported decent second-quarter results. The company generated a free cash flow of $2.9 billion, a 14.7% increase year-over-year. It also reported a free cash flow margin of 16%. Operating cash flow for the quarter stood $3.6 billion. Furthermore, IBM’s average cash flow over the past 5.75 years is higher than 96.46% of current dividend-paying stocks in the StockNews.com universe. Despite the top-line declining 2% year-over-year in constant currency to $18.1 billion, the total cloud revenue was up 34% to $6.3 billion. The gross profit margin for the quarter stood 48%. IBM has an impressive earnings surprise history with the company beating consensus EPS estimates in each of the trailing four quarters. Moreover, the company has recently entered into a multi-year agreement with Coca-Cola European Partners (CCEP), the world’s largest Coca-Cola bottler based on revenue, to accelerate its transformation to an open hybrid cloud environment using Red Hat OpenShift and Red Hat Enterprise Linux. IBM is currently trading 21% below its 52-week high. Additionally, the stock has gained more than 38% from its March lows. How does IBM stack up for the POWR Ratings? A for Trade Grade B for Peer Grade A for Industry Rank B for Overall POWR Rating. It is ranked #10 out of 28 stocks in the Technology – Hardware industry. ChipMOS Technologies Inc. (IMOS) IMOS is a Taiwan-based company that researches, develops, manufactures, and sells high integration and high precision integrated circuits and related assembly and testing services. It has a broad range of customers, including leading fabless semiconductor companies, integrated device manufacturers and independent semiconductor foundries. The stock currently has a dividend yield of 4.38%. IMOS declared a dividend of $0.95 in the last quarter, which was 63% higher than its previous quarterly dividend amount. The last financial result reported by IMOS was for the fiscal second quarter. Free cash flow for the firm increased 2314% year-over-year to $18.7 million. The company further generated a $70.3 million cash flow from operations, a 135% improvement year-over-year. IMOS has returned $29.65 million to its shareholders this quarter in the form of dividends. Revenue grew 10.7% year-over-year to $184.4 million, while the gross profit increased 34% compared to the year-ago quarter. Benefiting from the surge in demand for TV SoC (System on a Chip) and memory testing, the testing utilization level significantly increased to 81% during the period. Moreover, the company reported an EPS of $0.02. The top-line is expected to grow to $620 million in the current year, and the EPS is estimated to grow by 10% per year for the next five years. IMOS is currently trading at a 13% discount from its 52-week high of $24.83. Furthermore, the stock has gained more than 44% from its March lows. The POWR Ratings reflect a promising outlook for IMOS. It has an overall rating of “Buy” with an “A” for Trade Grade and Industry Rank, and a “B” for Buy & Hold Grade and Peer Grade. Among the 86 stocks in the Semiconductor & Wireless Chip industry, it’s ranked #45. Xperi Holding Corporation (XPER) XPER invents, develops, and delivers various technologies worldwide. Its technologies that enable extraordinary experiences are integrated into consumer devices, media platforms, and semiconductors, packaging, and providing interconnect solutions. It serves automotive, home solutions, mobile, pro audio, and content solutions, semiconductor technologies, and intellectual property markets. XPER has been consistently paying a fixed amount of $0.2 as dividends every quarter for six years now. The company had declared a dividend of $0.2 in the preceding quarter despite the bottom-line being affected by the pandemic. At the moment, the stock has a dividend yield of 5.51%. XPER reported a free cash flow of $33.4 million for the fiscal second quarter. This implied a 4.5% increase from its preceding quarter cash flow. Cash generated from operations stood $34.6 million. The company paid $10.12 million to its shareholders in the form of dividends. Moreover, the company reported a revenue of $138 million, a year-over-year growth of 83%. The intellectual property (IP) segment contributed more than 53% to the top-line compared to the year-ago contribution of 18%. XPER has an impressive earnings surprise history with the company beating consensus ESP estimates in each of the trailing four quarters. The company recently repurchased common stocks worth $15 million. The second quarter has also been eventful for the company. XPER completed the merger with TiVo Corporation, a DVR major, to form a unique digital entertainment technology platform. Moreover, the company announced a multiyear extension of agreements between its subsidiary and CommScope Holding Company, Inc. (COMM), a technology infrastructure provider, to expand its intellectual property (IP) relationships and seal new license deals. XPER is currently trading at a 33% discount from its 52-week high of $21.71. The stock hit a low of $9.01 in March but has recovered more than 61% since then. As per our POWR Ratings, it has an “A” for Industry Rank and is ranked #47 among the 86 stocks in the Semiconductor & Wireless Chip industry. MIND C.T.I. Limited (MNDO) MNDO, together with its subsidiaries, designs, develops, markets, supports, implements, and operates real-time and offline convergent billing and customer care software solutions in the United States, the United Kingdom, Europe, Israel, and internationally. The company offers billing and customer care solutions that support various services, such as voice, data, and content services, as well as prepaid, postpaid, and pay-in-advance payment models in a single platform. MNDO has an annual dividend yield of 10.41%. The company declares dividends each year during its first quarter and has a strong dividend history for 17 years now. The most recent dividend of $0.24 was announced in March this year. Over the last five years, MNDO’s dividend has grown at a CAGR of 1.6%. The company had impressive second-quarter results. Free cash flow for the firm grew 8% year-over-year to $1.23 million, while cash flow from operations increased 11% compared to the year-ago quarter to $1.3 million. MNDO returned $4.78 million to its shareholders this quarter in the form of dividends. The top-line for the quarter came in at $5.6 million. MNDO’s net profit improved 35% year-over-year to $1.41 million. Moreover, the company reported an EPS of $0.07. The stock has recovered more than 40% since hitting a low of $1.64 during the market crash in March. It’s no surprise that CLX is rated “Strong Buy” in our POWR Ratings system. It also has an “A” for Trade Grade, Buy & Hold Grade, Peer Grade, and Industry Rank. MNDO is ranked #44 out of 82 stocks in the Software – Application industry. Want More Great Investing Ideas? The Best of StockNews 3 Possible Directions for the Stock Market from Here 9 “BUY THE DIP” Growth Stocks for 2020 IBM shares were trading at $124.56 per share on Monday afternoon, down $0.71 (-0.57%). Year-to-date, IBM has declined -3.60%, versus a 6.00% rise in the benchmark S&P 500 index during the same period."}]}