{"article": [{"url": "https://stocknews.com/news/low-cmg-a-hlt-qsr-are-billionaire-bill-ackmans-5-largest-holdings-good-stocks-to/", "published": 1599739700.0, "headline": "Are Billionaire Bill Ackman's 5 Largest Holdings Good Stocks to Buy?", "body": "Bill Ackman, one of the world’s most successful hedge fund managers, has been quite vocal about the need for more Americans to own stocks. Ackman has even called for stock ownership at birth to ensure every American has a stake in our increasingly stratified society. Ackman is the founder and head of Pershing Square Capital Management. Ackman’s investment choices are particularly notable as he has a sterling stock-picking track record. Furthermore, Ackman is respected as an activist investor and a contrarian. This means Ackman is not afraid to demonstrate some irreverence for the convention, even if it proves unpopular. Let’s take a look at Ackman’s top five holdings to see if he is worthy of his reputation as an investing trailblazer: Lowe’s (LOW), Chipotle Mexican Grill (CMG), Agilent Technologies (A), Hilton Worldwide Holdings (HLT), and Restaurant Brands International (QSR). 9 \"BUY THE DIP\" Growth Stocks For 2020Lowe’s (LOW) LOW comprises 22% of Ackman’s portfolio. The investing guru recently added 4% more LOW to his holdings, likely due to its recent stellar earnings report. LOW is on a roll following the onset of the pandemic. People worldwide are stuck inside, looking for things to do, including home repairs and improvements. LOW provides homeowners with the tools and equipment they need to enhance their living space. LOW personnel even builds items for homeowners and installs them on their behalf. The POWR Ratings show LOW has “A” grades in its Trade Grade and Industry Rank POWR components. LOW has a “B” in the remaining components. Furthermore, LOW is ranked 13th of 68 stocks in the Home Improvement & Goods industry. Analysts view LOW as underpriced, having set an average price target of $183.58 for the stock. If LOW hits this level, it will have spiked 17%. Low’s forward P/E ratio is still relatively low at 18.32 despite its recent ascent. Low went all the way up to $171 and has since declined to $155. The suburbanization trend will likely continue for years, if not decades ahead, which could propel LOW even higher. Chipotle Mexican Grill (CMG) Ackman has allocated 15% of his funds to CMG. This is a prudent move, as it seems as though nothing can stop CMG. From tainted food to the pandemic, lengthy lines at CMG stores and beyond, the company has prevailed through it and will likely continue to shine bright across posterity. CMG now provides delivery and takeout, so customers don’t have to wait for 15 minutes for service inside CMG restaurants. CMG’s success is also attributed to the fact that its meat is free-range and hormone-free. CMG also has vegetarian and vegan offerings that appeal to the younger crowd. The POWR Ratings reveal CMG has “A” grades in each POWR Component, but for its Industry Rank, which is graded as a “B.” CMG is ranked above all but one stock in the nearly 50 stocks in the Restaurants industry. Agilent Technologies (A) A comprises 14% of Ackman’s holdings. This measurement company provides electronic and bio-analytical measurement solutions for those conducting business in the chemical analysis, communications, life sciences, and electronics industries. The POWR Ratings show A has a mixture of “A” and “B” grades in the POWR components with an “A” in the Trade Grade and Peer Grade Components. A is ranked third of nearly 60 stocks in the Medical – Diagnostics/Research industry. A has an average analyst price target of $103.14, which is 6% above its current price. A has climbed up toward $100 from its coronavirus low of $65. Hilton Worldwide Holdings (HLT) Approximately 13% of Ackman’s funds are invested in HLT. This is one of Ackman’s more questionable picks simply because the pandemic has made the hospitality industry a risky bet. HLT has hotels and resorts throughout the world, with plenty more in the pipeline. The POWR Ratings for HLT show a grade of “B” for the Peer Grade and Trade Grade POWR components. HLT is the top-ranked publicly traded company in the Travel – Hotels/Resorts industry. However, HLT has a forward P/E ratio of 540, meaning it is likely overvalued at its current trading price of $90.28. Restaurant Brands International (QSR) QSR comprises 17% of Ackman’s portfolio. Ackman recently added 66% more of the stock. QSR is a fast-food company that owns the likes of Tim Hortons, Burger King, and Popeyes. These are some of the world’s premier fast-food chains, yet the wild card is the pandemic’s uncertainty. Thankfully, QSR restaurants provide efficient carryout and drive-thru service to remain in operation even if the pandemic drags on. The POWR Ratings show QSR has a grade of “B” for Industry Rank and average grades in the remaining components. QSR is ranked in the top 20 of nearly 50 stocks in the Restaurants category. QSR’s has an average price target of $63.90, which is 15% higher than its current price. Want More Great Investing Ideas? 7 Best ETFs for the NEXT Bull Market Will Stocks Fall into Historical September Slump? 9 “BUY THE DIP” Growth Stocks for 2020"}]}