{"article": [{"url": "https://stocknews.com/news/dks-this-outperforming-retailer-is-ripe-for-upgrades/", "published": 1597925300.0, "headline": "This Outperforming Retailer is Ripe for Upgrades", "body": "Dick’s Sporting Goods Inc. (DKS) has been charging higher on the charts, up 42% year-over-year, and now sits at more than triple its mid-March lows. Even further, a few weeks ago the retail chain announced the grand opening of 11 stores throughout nine states by the end of August, subsequently landing no fewer than four bull notes from analysts. And despite already sporting a 3% gain to trade near $46.26 this afternoon, even more upside could be on the horizon. Digging deeper, data from Schaeffer’s Senior Quantitative Analyst Rocky White shows that DKS just came within one standard deviation of its 40-day moving average. Per White, three similar signals have occurred during the past three years. Dick’s Sporting Goods stock was higher one month after 67% of these signals, averaging a one-month return of 9.4%. A similar move, from the security’s current perch, would put DKS back above the $50 mark — territory not seen since April 2017. 7 Best ETFs for the NEXT Bull Market In terms of analyst sentiment, it’s looking like the retail giant is overdue for a fresh round of upgrades and/or price-target hikes. This is per the 10 out of 18 covering firms that still sport a tepid “hold ” or worse rating, as well as the stock’s average price target of $47.06, which runs flat to current levels. Lastly, Dick’s Sporting Goods stock’s near-term options are attractively priced at the moment. This is per the equity’s Schaeffer’s Volatility Index (SVI) which now stands at 64%, in the 32nd percentile of its annual range. This indicates that now is an attractive time to jump aboard the streaming name with options. Even further, the equity has been more volatile than expected during the past 12 months, based on its Schaeffer’s Volatility Scorecard (SVS) of 80 (out of 100). Keeping track of the week’s stock market activity is no easy feat. Our Schaeffer’s Market Mashup podcast gives you a quick 15-minute look at hot-button investing news and trends, as well as interviews with analysts and traders to help you craft a rock-solid options strategy. Tune into the latest episode of Market Mashup to up your investment game. DKS shares were trading at $45.46 per share on Thursday afternoon, down $1.03 (-2.22%). Year-to-date, DKS has declined -5.69%, versus a 5.98% rise in the benchmark S&P 500 index during the same period."}]}