{"article": [{"url": "https://stocknews.com/news/nvda-amd-nvidia-and-amd-star-performers-in-the-technology-sector/", "published": 1599566900.0, "headline": "NVIDIA And AMD- Star Performers in The Technology Sector", "body": "NVDA shares over tripled since the March 2020 low before a sharp correction last week Visual computing technology benefits from the global pandemic NVIDIA consistently beats earnings projections AMD, another chipmaker that had been on a bullish ride before last week The demand for NVIDIA and AMD’s products will continue to rise- Improving technology leads to soaring sales- Buying the dip in the chips NVIDIA Corporation (NVDA) has been around since 1993. The company’s headquarters are in Santa Clara, California, in Silicon Valley. The region is the heart of the US technology industry. NVDA transformed computer graphics. As the gaming market grew, the demand for better 3D graphics skyrocketed. NVDA evolved the GPU into a computer’s brain at the “intersection of virtual reality, higher performance computing, and artificial intelligence.” The company produces products that have become essential tools for gamers and others that depend on computer graphics. NVDA’s products are incredible, buy the ascent of the shares has been even more impressive. NVIDIA first sold shares to the public on January 22, 1999, at $12. The stock has split four times over the years. Three splits were 2-for-1, and the other was 3-for-2. The stock opened for trading at a split-adjusted level of $1.75 per share in 1999. Last Friday, it was trading at $504.90 after hitting a high of $589.07 on September 2 as gravity hit the shares and market volatility soared. Advanced Micro Devices (AMD) is another chipmaker than has experienced a similar decline from lofty levels at the end of last week. NVDA shares over tripled since the March 2020 low before a sharp correction last week 7 Best ETFs for the NEXT Bull MarketThe market’s sentiment shifted last week, as selling hit the stock market on Thursday and Friday. On Wednesday, September 2, NVDA shares hit a new all-time high at $589.07 per share. Source: Barchart As the chart shows, NVDA shares rose by over 3.26 times from the March 18 low of $180.68. The volatile stock dropped to its most recent low of $468.19 last Friday, a 20.5% correction from September 2-4. The shares came storming back to close above $500 per share on Friday. Visual computing technology benefits from the global pandemic NVDA’s products experienced a surge in demand as COVID-19 caused social distancing and many people remained cooped up in their homes. Passing the hours and avoiding boredom through gaming pushed sales higher. While the company’s fundamentals remain strong when it comes to sales, the volatile stock market likely lifted NVDA shares to an unsustainable short-term level; as gravity hit the market late last week, they dropped like a stone. However, an over 225% gain over the past five-and-one-half months, followed by a 20.5% correction, is not a bad result. The long-term trend in the stock remains extremely bullish. Source: Barchart The chart spanning over two decades shows the bullish ascent of NVDA. The shares exploded higher starting in 2016 and have hardly looked back. NVIDIA consistently beats earnings projections NVDA reported third-quarter earnings of $2.18 per share, which beat consensus estimates by 21 cents. Q3 was the fourth consecutive quarter, where EPS was higher than the average consensus estimates. Source: Yahoo Finance As the chart shows, the company continues to outperform projections, profits have been trending higher, and the estimates for Q4 are currently running at expectations for EPS of $2.57 per share. A survey of thirty-six analysts on Yahoo Finance has an average target of $543.35 per share for NVDA, ranging from $300 to $650 per share. NVDA was not the only chipmaker that got hit in the recent stock market correction. AMD, another chipmaker that had been on a bullish ride before last week AMD shares moved from $36.75 on March 18 to a high of $94.28 on September 2, a rise of 156.5%. Source: Barchart The chart shows that last week’s correction took AMD shares to a low of $76.33 on September 4, a decline of 19% from last Wednesday through Friday. The shares came back to close the week at just over $82. AMD is a semiconductor company that provides chips for computing and graphics. The company will report Q3 earnings later this month. According to Yahoo Finance, the consensus estimate for EPS is 35 cents per share after reporting 18 cents in Q2. An average of thirty-four analysts on the site has an average price target of $77.15 for AMD, with a massive range from $9 to $120 per share. Gravity hit the high-flying chipmakers last week after over five months of spectacular gains from the mid-March lows. Even at the lows on September 4, AMD and NVDA were still trading at significantly higher levels than the pre-pandemic all-time highs from February 2020. The demand for NVIDIA and AMD’s products will continue to rise- Improving technology leads to soaring sales- Buying the dip in the chips COVID-19 will leave a lasting legacy when it comes to social distancing and the demand for technology. While technology stocks took it on the chin late last week, it had been the market sector that experienced the most significant gains over the past months. I favor buying the dip in the chips. However, I would leave lots of room to add to long positions on the downside. A few short days ago, many investors were kicking themselves for not buying technology stocks and the chipmakers. The most recent correction provides another chance to buy the companies that promise to thrive over the coming years. Technology is always improving, meaning that companies like NVDA and AMD sales will continue to soar as consumers look for the latest and greatest computing power and graphics. The demand for the chips that make computing faster and improve graphics promises to keep the two chipmakers’ earnings on an upward slope. It is impossible to pick tops or bottoms in markets. Buying these stocks on a scale-down basis with lots of room to add on further weakness could be the optimal long-term approach to the semiconductors over the coming weeks and months. Markets tend to rise to levels that exceed fundamentals and fall to irrational prices during volatile periods. The lows in mid-March on the back of risk-off conditions because of the global pandemic pushed prices to illogical lows. The explosive price action since the lows was fueled by unprecedented central bank liquidity levels, low interest rates, and TINA. “There is no alternative” to stocks has been a powerful force in the stock market and a magnet for capital. Technology was the sector with the most significant magnetic power, so they experienced the most substantial price volatility during the current correction. I look at the selloff as an opportunity to buy the companies that power technology over the coming years, and NVDA and AMD are at the forefront of chipmaking worldwide. Want More Great Investing Ideas? 7 Best ETFs for the NEXT Bull Market Will Stocks Fall into Historical September Slump? 9 “BUY THE DIP” Growth Stocks for 2020 NVDA shares fell $34.90 (-6.91%) in premarket trading Tuesday. Year-to-date, NVDA has gained 100.44%, versus a 5.84% rise in the benchmark S&P 500 index during the same period."}]}