{"article": [{"url": "https://stocknews.com/news/spy-cboe-revealed-understanding-what-delta-neutral-really-means/", "published": 1596542900.0, "headline": "Revealed: Understanding What 'Delta Neutral' Really Means", "body": "In any endeavor, whether in business, law, medicine, sports, or even parenting, a certain amount of jargon becomes the lingua franca among active participants. It helps people express complex concepts in a concise manner. It also often serves a second purpose of making the “professionals” feel more important and knowledgeable than the layperson. The options industry is no exception. One of the mainstays of option language are “the Greeks”, which are used to define how an option’s price will change relative to certain variables. And we’re going to do it in plain English by using the commonly applied applications as opposed to the strict mathematical definitions. Today let’s focus on Delta: 9 \"BUY THE DIP\" Growth Stocks For 2020Delta: This is the expected change in an options’ price for every $1 move in the price of the underlying stock. Delta can range from 0.00 to 1.00, with calls being expressed as a positive number and puts as a negative. The rule of thumb is that an at-the-money option has a delta of 0.50. Note, delta can be both positive and negative to reflect bullish or bearish positions and can be created through both puts and calls, It’s also important to understand that delta is not fixed. It is a function of the underlying stock price and the time remaining until expiration. As an option moves further into-the-money and time decays, the delta increases at an accelerated rate. Conversely, as an option moves further out-of-the-money and has more time remaining, delta decreases at a slower rate. For example, if shares of “Apple (AAPL)” moved from $425 to $430, you could expect the at-the-money 425 call to increase by about $3 a contract, and the at-the-money 425 put to decline by about $2 a contract. If shares of AAPL were to climb to $450, the 425 call, which would now be $25 ITM, would have increased by around $21, have a delta of around 0.90 while the 425 put, now $25 OTM, would decrease by around $10 have a delta around -0.15 This is a valuable feature of options in that your profits will accelerate as price moves in your direction and losses will decelerate relative to the stock as price moves against you. Conversely, it also means that profits pile up quicker as price increases. The other important reason for understanding delta is that it will help you gear expectations and determine how many contracts might be needed for hedging purposes when people want to set up a “delta neutral” position. The concept of “delta neutral” is an intriguing one – especially for traders who have had a hard time predicting the market or to those who don’t believe the market can be predicted (random walkers). The concept is even sometimes “sold” to novice investors as a sort of “can’t-lose” trading method, even though that isn’t true at all. While the idea of having a position that can make money without predicting the direction of the underlying stock seems attractive, in practice the strategy is difficult, if not impossible, to apply – at least in terms of keeping a position delta neutral. A delta neutral position may be constructed out of any number of options and the underlying – from as few as 2 options as in this example: Example: XYZ: 48 Buy 1 July 50 call & Sell 2 July 60 calls July 50 call delta: 0.50 / July 60 call delta: 0.25 Delta neutral position: Since the ratio of the deltas is 2.0-to-1 (50 divided by 25), then the indicated spread is delta neutral Or more complex positions, such as market makers might hold. No matter how many options are in one’s position, the position delta can be computed by multiplying the quantity of each option held by the delta of that option and summing over all the options held. That sum will generally not be zero, but it is a simple matter to neutralize the position by taking an offsetting position in the underlying stock. Here is more a complicated example, showing this concept: Example: Suppose the following prices exist: XYZ: 48 July 60 call delta: 0.25 Oct 55 call delta: 0.40 July 50 call delta: 0.50 And further suppose that this is a position that you hold: Long 20 July 60 calls Long 30 Oct 55 calls Short 10 July 50 calls The position delta of your holding can be computed by multiplying the quantity of each option in your position by its delta (and then multiplying by 100, assuming the option is for 100 shares of stock). This computation is also sometimes called the “equivalent stock position (ESP)” because it shows how many shares of stock are equivalent to the given option position: Hence the total “exposure” of all these options combined is equivalent to being long 1200 shares of XYZ. To neutralize this position – i.e., to make it “delta neutral,” one could simply short 1200 shares of XYZ while still keeping the option holdings the same. When a delta neutral position is established, the position has no delta – that is, it does not profit (in the very short term) if the underlying moves up or down. That’s all “delta neutral” really means. It does not mean, for example, that the position will profit no matter which way the stock moves. This simple statement may come as a big surprise to more novice traders who thought that delta neutral was more of a “lock” in terms of profits. The point is, once again, that delta neutrality is really only descriptive of short-term movements by the underlying. To attempt to apply it to longer-term projections or to expect a delta neutral position to “magically” be capable of producing profits would be wrong. Click here to find out more about Steve Smith’s unique and profitable trading service — Options360. Want More Great Investing Ideas? 9 “BUY THE DIP” Growth Stocks for 2020 How HIGH Can This Tech Bubble Fly? 7 “Safe-Haven” Dividend Stocks for Turbulent Times SPY shares were trading at $328.57 per share on Tuesday afternoon, down $0.22 (-0.07%). Year-to-date, SPY has gained 3.14%, versus a % rise in the benchmark S&P 500 index during the same period."}]}