{"article": [{"url": "https://stocknews.com/news/slv-sil-paas-silver-still-no-sign-of-real-fear/", "published": 1602158900.0, "headline": "Silver: Still No Sign Of Real Fear", "body": "It’s been a disappointing couple of months for the Silver Miners ETF (SIL), as the ETF has gone from hero to zero, sliding from a rank of 4th among all asset classes to 34th as of yesterday’s close. The catalyst for the sharp drop in relative strength is the precipitous fall we’ve seen in the silver price (SLV), which is down over 20% from its year-to-date highs. Fortunately, this double-digit decline has finally begun to spook some investors, with bullish sentiment retreating from a reading of 95% bulls in August. If we could see this sentiment reading drop further in the coming weeks to below 20%, this would significantly increase the probability that the low is in for silver. The Federal Reserve decided to keep rates steady this week, but the plan for “lower for longer” rates remain in effect, even if we aren’t heading to negative levels. Many bulls are perplexed as to how the silver price isn’t higher by now given the continued stimulus and loose monetary policy, but the issue for silver is that sentiment got ahead of itself in August, and the 150% in rally off the March lows priced most of the fundamentals in ahead of time. Unfortunately, no matter how great the fundamentals are, the path of least resistance is typically lower first when everyone is bullish. Let’s take a closer look below: 9 \"BUY THE DIP\" Growth Stocks For 2020 (Source: Daily Sentiment Index Data, Author’s Chart) The above chart shows sentiment readings for the past year for silver, and we can see that the metal tends to go to both extremes every few months. Most recently, the metal hit an extreme of 95% bulls when everyone was anxious to pile into the metal near $28.00/oz, and now we’ve got sentiment going in the other direction, with some of these same investors now puking up their positions. As of Wednesday’s close, bullish sentiment had fallen to 32%, which is a massive improvement. However, following a 27% decline in silver from peak to trough, this is still a relatively elevated reading. As we can see in the above chart, silver previously went below 15% bulls during corrections of 12% or larger, so we would expect it to drop at least this low during a correction that’s been twice the magnitude. Obviously, this time could be different, but I would prefer to see a lower reading to confirm we have seen capitulation in the metal. (Source: Daily Sentiment Index, Author’s Chart) If we look at silver from a technical picture, the bulls have managed to play defense where they need to, but otherwise haven’t been able to see much follow-through to the upside. For now, we have seen the $21.50/oz pivotal support level defended, but we now have strong resistance at $26.55/oz, and there’s no reason to believe this correction is over until the bulls can clear this area on a weekly closing basis. Therefore, even if this rally does continue for silver, I see no reason to put much exposure in silver miners until we see some evidence that the correction is over. Based on sentiment not showing any signs of capitulation yet, I would not be surprised to see silver re-test the $21.00/oz – $22.00/oz once more before this correction is over. Ideally, this would translate to a reading of below 20% bulls for sentiment as well. While the fundamentals remain bullish for silver with loose monetary policy and strong industrial demand, the technicals remain neutral at best until we see a clear sign of a bottom in place. In order to increase the probability that the bottom is in, the bulls are going to need to get through $26.55/oz, or we’re going to need to see a complete breakdown in sentiment, with bullish sentiment falling below 15% bulls. Outside of one of these scenarios occurring, I believe the best course of action is patience here. For now, I remain long one silver miner, which is Pan American Silver (PAAS), but I have not yet added back any exposure to the metal or other miners until we see more confirmation that the lows are in. Disclosure: I am long PAAS, GLD Disclaimer: Taylor Dart is not a Registered Investment Advisor or Financial Planner. This writing is for informational purposes only. It does not constitute an offer to sell, a solicitation to buy, or a recommendation regarding any securities transaction. The information contained in this writing should not be construed as financial or investment advice on any subject matter. Taylor Dart expressly disclaims all liability in respect to actions taken based on any or all of the information on this writing. Want More Great Investing Ideas? 7 Best ETFs for the NEXT Bull Market What is the Cure for Stock Market Volatility? Chart of the Day- See Christian Tharp’s Stocks Ready to Breakout SLV shares were trading at $22.28 per share on Thursday morning, up $0.19 (+0.86%). Year-to-date, SLV has gained 33.57%, versus a 8.25% rise in the benchmark S&P 500 index during the same period."}]}