{"article": [{"url": "https://stocknews.com/news/vgt-igv-skyy-buy-the-dips-in-these-3-tech-etfs/", "published": 1600430900.0, "headline": "Buy the Dips in These 3 Tech ETFs", "body": "Since the beginning of the pandemic, there has been a huge disconnect between the economy and the stock markets. Despite second-quarter GDP dropping by 33%, the stock market quickly recovered its losses. Most of the market’s gains were concentrated in tech as it was the most resilient and many companies actually saw an increase in sales. At one point, the Nasdaq was almost 20% above its pre-coronavirus levels. However, in September, we got a much-needed correction with the Nasdaq dropping by nearly 15%. While there were concerns that a bubble was forming in tech, recent earnings reports validate much of the gains in stock prices. As the tech industry is set to grow substantially in the future, investors should use the market dip to add exposure to technology. ETFs such as Vanguard Information Tech ETF (VGT), iShares Expanded Tech Software Sector ETF (IGV) and First Trust ISE Cloud computing Index Fund (SKYY) can help investors get an all-round exposure to different tech companies. 7 Best ETFs for the NEXT Bull MarketVanguard Information Tech ETF (VGT) VGT invests in notable tech companies of varying market sizes operating in any of the three segments — hardware, software, and consulting. This top-heavy ETF allocates a large proportion of its assets to large-cap tech companies, thereby reducing the volatility of the fund. VGT’s major holdings include Apple, Inc. (AAPL), Microsoft Corp (MSFT), and Visa, Inc. (V), which make up for 39.6% of its total assets. It has $36.87 billion worth of assets under management (AUM). VGT has an expense ratio of 0.1% versus the category average of 0.51%. It has returned 23.3% year-to-date and 49.8% in the past six months. VGT pays an annual dividend of $2.87, which yields 0.94% based on its current price. The ETF’s dividend payout grew at a CAGR of 19.5% in the past three months. VGT has gained more than 85% since hitting its 52-week low of $179.45 in March. The ETF hit its 52-week high of $340.74 in September. How does VGT stack up for the POWR Ratings? B for Trade Grade B for Buy & Hold Grade B for Overall POWR Rating. It is also ranked #24 out of 94 ETFs in the Technology Equities ETFs group. iShares Expanded Tech Software Sector ETF (IGV) IGV primarily invests in mid-cap tech companies operating in the United States. These up-and-coming companies have huge growth potential, and thereby this fund is ideal for investors looking to make substantial capital gains. However, IGV’s top holdings include several well-known tech companies with huge market valuation and they help mitigate the overall risk of the portfolio. This passively managed fund with an annual turnover of 0.46% tracks S&P North American Technology- Software Index. It has an AUM of $5.04 billion, with major portfolio holdings such as Adobe (ADBE), Microsoft, and Salesforce.com Inc (CRM) accounting for 25.8% of it. IGV’s expense ratio of 0.46% is relatively lower than the category average of 0.51%. The ETF has gained 28.4% year-to-date, and 50.3% in the past six months. IGV’s annual dividend of $1.24 yields 0.41% based on its current price. IGV has gained more than 90% since hitting its 52-week low of $176.23 in March. The ETF hit its 52-week high of $337.08 in September. It’s no surprise IGV is rated a “Buy” in our POWR Ratings system, with a “B” for Trade Grade and Buy & Hold Grade. It is ranked #28 out of 94 ETFs in the Technology Equities ETFs group. First Trust ISE Cloud computing Index Fund (SKYY) SKYY primarily invests in cloud computing tech companies operating in the United States and globally. It has an AUM of $4.81 billion and invests in companies mainly listed in the ISE Cloud Computing Index. However, it is an actively managed ETF, with an annual turnover of 85%. SKYY’s top holdings include several fortune 500 companies such as Amazon (AMZN), Microsoft, Alphabet (GOOGL), and Alibaba (BABA). It has $4.81 billion worth AUM. SKYY has returned 27.1% to its investors year-to-date, and 55.5% in the past six months. SKYY has an expense ratio of 0.6%, slightly higher than its category average. But given its year-to-date performance, it’s worth spending a little higher for this fund. It pays $0.18 annually as a dividend, which yields 0.23%. SKYY’s dividends have increased at a CAGR of 39.2% in the past three years. SKYY gained more than 90% to hit its 52-week high of $86.15 in September since hitting its 52-week low of $45 in March. SKYY is rated a “Buy” in our POWR Ratings system, with a grade of “B” in Trade Grade and Buy & Hold Grade. It is currently ranked #29 out of 94 ETFs in the Technology Equities ETFs group. Want More Great Investing Ideas? 7 Best ETFs for the NEXT Bull Market Is the Stock Market Correction Over? Chart of the Day- See the Stocks Ready to Breakout VGT shares were trading at $296.82 per share on Friday afternoon, down $4.98 (-1.65%). Year-to-date, VGT has gained 22.28%, versus a 3.60% rise in the benchmark S&P 500 index during the same period."}]}