{"article": [{"url": "https://stocknews.com/news/spy-why-the-stock-market-might-soon-plunge-30/", "published": 1595419700.0, "headline": "Why the Stock Market Might Soon Plunge 30%", "body": "In this series, I’ve already covered the irrational but plausible reasons that the most irrational market bubble in history might continue for a bit longer. Why The Craziest Bubble In History Might Get Even Bigger I’ve also explained a very important and effective method for protecting your retirement portfolio from this dangerous mania and the painful correction that is coming eventually. How to Protect Your Retirement Portfolio From the Craziest Bubble in History In part three of the “crazy bubble” series, I’ll explain why the S&P 500 (SPY) may soon plunge 30%, potentially by the end of the year. 7 \"SAFE HAVEN\" Dividend Stocks for Turbulent TimesThat’s due to a very real and obvious threat, that has nothing to do with the pandemic or economy, yet the market has thus far blissfully, and stupidly, ignored. But in just a few months it may not be able to, and conservative income investors need to be prepared for the potential return of not just market volatility, but outright market panic. The Obvious And Dangerous Threat To Stocks Wall Street May Not Be Able To Ignore Much Longer The worst pandemic in 100 years, the worst economy in 75 years, and a labor market that’s nothing short of a house of horrors are all things that the craziest stock market bubble in history has thus far ignored. Never mind the fact that in the last month almost 10 million people have lost their jobs. Never mind that 36.4 million Americans are currently unemployed, or 22.1% of the pre-pandemic workforce. The most tech stock driven mania has ignored all of this, led by several irrational things and dangerous ideas such as Quant-based hedge funds blindly pouring money into overvalued stocks because low-volatility tracking rules say to New retail investors with no sports to bet on are speculating on red hot momentum stocks TINA/FOMO gamblers convinced that low-interest rates and “don’t fight the Fed” will continue to always work and that the “Powell Put” will never fail But there is one very real and obvious event risk that’s been staring us in the face for months now and is barreling towards us like a freight train. The 2020 elections are on November 3rd and right now objectively Joe Biden is the favorite to win. (Source: Real Clear Politics) No, I’m not a rapid Trump supporter convinced that Joe Biden is a socialist and will destroy American capitalism. I’m a political independent who, as I’ll explain in the final article in this series NEVER buys or sells stocks for political reasons. But there is an important reason that I’m paying attention to what the betting markets are saying is a 63% probability that Biden becomes the next president. (Source: PreditIt) Biden leading by 9% in the national polls is not important, only the electoral college matters. (Source: FiveThirtyEight) Currently, Biden is leading in every swing state and is tied with Trump in Iowa, and very close in Texas. The Cook Political Report, one of the most respected non-partisan political analyst organizations, even considers Georgia a “toss-up” and polls show Biden leading Trump in one of the reddest states by a small amount. This election is looking more like a Democratic tsunami than simply a Blue Wave. President Trump, mired in some of the lowest job approval ratings of his presidency, is trailing Biden by significant margins in key battleground states like Pennsylvania (8 points), Michigan (9 points), and Wisconsin (9 points). He’s even running behind Biden in his firewall states of Florida and North Carolina.” – Cook Political Report (emphasis added) If the election were held today and the poll averages held true, Biden would win almost 380 electoral votes, winning by a landslide not seen since Reagan won 49 states in 1984. The 7 competitive Senate races in November, if the latest polls are to be believed, would have Democrats picking up 6 Senate seats and giving them a 53/47 majority. And the House lead Democrats currently enjoy would only get bigger. In other words, as things currently stand, and have been trending for several months now, Democrats are likely to have a very good election night. Here’s why, unlike virtually every other election before it, this time investors really DO need to pay attention to politics. Corporate Taxes Are Potentially Going To Increase Joe Biden, like Obama before him, thinks the corporate tax rate should be higher than 21%. Not 35% like it was before the 2018 tax cuts, but 28%. Morningstar is now reducing the fair value on some of its covered companies due to a 50% estimated probability that Biden will win the White House Democrats will win the Senate Majority in the House will increase Morningstar’s estimate is that if the Democrats take over Congress and the Presidency there is about an 80% probability that corporate taxes will rise to 28% in 2021. What would that mean for corporate earnings? Goldman Sachs warns that Biden’s tax plan, combined with an expected drag on GDP, would lower next year’s S&P 500 per-share earnings by $20 to $150.” – CNN That next year earnings would grow about 12% less than currently expected. Mind you they would still grow, but not the 29% to 30% that the analyst bottom-up consensus currently expects. 2021 EPS falls from $163 to $143 2022 EPS falls from $186 to $164 (still 15% growth but off a smaller base) Never mind that analysts generally overestimate forward earnings by 1.8% to 3.8% over the last 20 years according to FactSet’s John Butters. Let’s just assume that those smaller, post-tax hike figures are accurate. Here is what that would mean for the 2021 S&P 500 consensus return potential which is currently -8.3% CAGR. S&P 500 2021 Consensus Return Potential If Taxes Go Up Drops To -13.7% CAGR (Source: F.A.S.T Graphs, FactSet Research) Here is what happens to 2022’s consensus return potential for stocks under the tax hike scenario. S&P 2022 Consensus Return Potential Falls From 1.2% to -2.3% CAGR (Source: F.A.S.T Graphs, FactSet Research) If corporate taxes, go up to 28% then the S&P 500’s consensus return potential won’t turn positive until 2023 (1.2% CAGR). And look what happens to the 2025 Consensus Return Potential, currently a low 5.0%, if corporate taxes go up. (Source: F.A.S.T Graphs, FactSet Research) From 5% CAGR 5-year consensus return potential, investors would be looking at about 3.4%. S&P 500 Probability-Weighted Expected Return Calculator 5-Year Consensus Annualized Total Return Potential 3.40% Conservative Margin Of Error Adjusted Annualized Total Return Potential 1.70% Bullish Margin Of Error Adjusted Annualized Total Return Potential 5.10% Conservative Probability-Weighted Expected Annualized Total Return 1.02% Bullish Probability-Weighted Expected Annualized Total Return 4.08% Mid-Range Probability-Weighted Expected Annualized Total Return Potential 2.55% (Source: Dividend Kings Investment Decision Tool) This drops to about 2.6% when adjusting for margins of error and the 20% to 40% probability that analysts are just wrong about the next few years’ worth of earnings growth. Do you know what a 5-year 2.6% CAGR probability-weighted total return actually represents? About 14% total returns…including dividends…over the next 5 years. It’s about 3X less than the S&P 500’s historical return. Do you think this very real politically induced risk is priced into stocks? I sure don’t. At some point, unless Trump’s poll numbers skyrocket (they’ve been steadily trending down for months now) the market is going to have to begin pricing in the objectively rising probability that next year’s earnings will be about 12% lower than currently expected (and all future earnings will be slightly smaller as well). And it’s not likely to be a gradual repricing, over the next five years. Why Stocks Might Plummet 30% In The Next Few Months Perhaps the stock market, in its speculative mania clouded fog can ignore the very real risks that corporate taxes will increase next year, right up until election day. But what about after election day? Sure, the fact that many of us will be voting by mail might delay the results for a week or so. But what about mid-November if Biden’s current polls hold and he wins a big majority of the electoral college? What if the Democrats hold a 51 to 53 seat majority in the Senate and pad their lead in the House? Do you think the market can ignore the simple math that Goldman laid out in its warning note to its clients? I’m not even saying that all of the proposed tax policy reforms will necessarily happen. A wealth tax is unlikely An unrealized capital gains tax is unlikely Capital gains and dividends being taxed at top marginal tax rates is a wildcard Financial service transaction tax is also potentially up for grabs I’m just looking at the corporate tax rate which has a 50% probability according to Morningstar, of rising to 28% in 2021 right now. That rises to about 80% if the Democrats sweep the elections, which the polls say is the current outlook. Note that I’m NOT making a judgment about whether it’s a good idea for corporate taxes to go up, just that this is the most likely outcome if the Democrats are victorious. So, let’s run some very simple math. According to Merrily Lynch, the average bear market bottom forward PE is 10 to 15 If this is no longer a bear market in a few months, then it’s possible stocks will merely pullback to a forward PE (off $143 earnings in 2021) of 15 to 16.5, slightly below or basically equal to the 16.4 25-year average forward PE. 15 forward PE by the end of the year = 2,145 S&P 500 (33% decline) 5 forward PE by the end of the year = 2,360 S&P 500 (27% decline) Note that this math has zero to do with the pandemic or the economy, both things that are not likely to improve in the coming months. They add additional downside risk but are unlikely to provide any good news that could help stocks ignore the real threat of significantly lower 2021 and 2022 corporate earnings. Am I predicting a massive 50+% crash? The kind that the Fed might actually step in to prevent? No. I’m saying that we’re potentially headed for a nasty correction, and possibly even the 2nd bear market of 2020. There have never been two bear markets in the same year. But 2020 is a year of unprecedented things happening. Investors lulled into complacent buy a market that seems to only go up, an idea championed by the captain of the day traders, Dave Portnoy, might be in for a rude awakening come to the end of the year. (Source: imgflip) In part four of this series, I’ll explain the single most useful way to protect your retirement portfolio from what might be a 30% market plunge in the coming months. More importantly, I’ll explain how you can avoid the most dangerous mistake that most investors make when facing such risks, a mistake that is the #1 retirement killer in stock market history. Want More Great Investing Ideas? 9 “BUY THE DIP” Growth Stocks for 2020 Top 5 WINNING Stock Chart Patterns 7 “Safe-Haven” Dividend Stocks for Turbulent Times SPY shares were trading at $325.27 per share on Wednesday morning, up $0.26 (+0.08%). Year-to-date, SPY has gained 2.10%, versus a % rise in the benchmark S&P 500 index during the same period."}]}