{"article": [{"url": "https://stocknews.com/news/xlrn-tndm-crsp-bmy-vrtx-3-healthcare-stocks-absurdly-overvalued-right-now/", "published": 1596024500.0, "headline": "3 Healthcare Stocks Absurdly OVERVALUED Right Now", "body": "The coronavirus pandemic has wreaked havoc on many industries, but healthcare has not been one of them. Pharmacies have seen increased sales of over-the-counter (OTC) drugs as well as prescriptions, and many companies in the pharma and biotech sectors have seen surging stock prices due to the development of tests and vaccines for COVID-19. According to macrotrends, the healthcare industry has a price-to-earnings (P/E) ratio of 33.77. This is higher than the current price-to-earnings ratio of 27.79 for the S&P 500. In my opinion, some stocks in the industry are overvalued. These stocks are trading at extremely high prices combined with low or negative earnings growth, so their P/E ratio is absurd. Therefore, I focused on the price-to-sales (P/S) ratio instead. This ratio compares a stock’s price to its revenues. 9 \"BUY THE DIP\" Growth Stocks For 2020Here are three overvalued healthcare stocks with sky-high P/S ratios: Acceleron Pharma (XLRN) XLRN is a biotechnology company focused on the discovery, development, and commercialization of novel therapies. Its research focuses on critical natural regulators of cellular growth and repair. The company had its first drug, Reblozyl, approved by the FDA in November of last year. The drug is used to treat anemia in adult patients with beta-thalassemia who require regular red blood cells. XLRN is in partnership with Bristol-Myers Squibb (BMY) for the development of the drug. The stock is very dependent on Reblozyl for growth, as it is their only approved drug so far. The company has other drugs in the pipeline but has faced recent setbacks such as ACE-083, a neuromuscular candidate. XLRN had a phase II study with patients suffering from Charcot-Marie-Tooth disease (CMT), but ACE-083 did not demonstrate improvement in CMT patients. XLRN has a ridiculously high P/S ratio of 73.2, compared to 12.8 for the industry and 2.3 for the S&P 500. That can be explained through its stock performance and revenue figures. The stock is up almost 95% for the year, while the company posted revenue of $4 million for the first quarter, compared with $39 million in the previous quarter. The company has a negative operating cash flow and an operating margin of -1187.2%. The consensus estimate for the second quarter is -$0.55. It might be a good idea to wait on this stock until it shows positive earnings. Tandem Diabetes Care (TNDM) TNDM is a medical device company that develops products for people with insulin-dependent diabetes. The company has three insulin pump products. The first is the t:slim Insulin Delivery System, which can easily fit into a user’s pocket. The t:flex Insulin Delivery System is used by patients with more significant insulin needs, and the t:slim G4 Insulin Delivery system is a continuous glucose monitoring enabled pump fitted with a touch screen. The company has benefited from a rise in diabetes worldwide. TNDM also features an impressive pipeline of products. One product under development is the AID systems, which is a next-generation hardware platform. The company has seen mounting operating costs, which has hampered the company’s earnings growth. It has current operating costs of $68.8 million, which rose 43.9% year over year. TNDM has a P/S ratio of 15.3, which is considerably higher than its industry average of 5.2. The company’s stock is up 72% year-to-date. The company posted revenue of $98 million last quarter, compared with $108 million in the previous quarter. Its operating income for the quarter was -$14 million, while its net income was -$15 million. The company’s profitability figures are negative across the board, highlighted by a -13.9% operating margin. TNDM is expected to report earnings tomorrow after the market closes. The consensus estimate is for -$0.24 a share. While I like the company’s prospects, its current valuation is way too rich for my blood. CRISPR Therapeutics (CRSP) CRSP is a gene-editing company. It develops CRISPR/Cas9-based therapeutics. CRISPR/Cas9 is a technology that allows for precise, directed changes to genomic DNA. The company is using that technology to develop therapies for the treatment of hemoglobinopathies, cancer, diabetes, and other diseases. The company has no current marketed drug in its portfolio. The best candidate for approval is CTX001, which is being developed with Vertex Pharmaceuticals (VRTX). CTX001 is an investigational ex vivo CRISPR gene-edited therapy. It is being evaluated for treating sickle cell disease (SCD) and transfusion-dependent beta-thalassemia (TDT). If CTX001 is proven successful, it could have significant profit potential due to the current unmet needs of patients suffering from those two diseases. CRSP, which is up over 40% for the year, has a P/S ratio of 18.3 compared to an industry average of 12.7. The company reported earnings of -$1.30 a share on Monday, which was lower than analyst expectations of -$0.95. CRSP also underwhelmed on revenue posting $0.04 million, compared to the consensus estimate of $19.77 million. That’s an 87.5% drop a year ago. Its current operating margin is an absurd -183384%. Aside from poor fundamentals, two concerns are that the company has no marketed product and is relying on VRTX for revenue opportunities. I would avoid the stock for now. Want More Great Investing Ideas? 9 “BUY THE DIP” Growth Stocks for 2020 Newly REVISED 2020 Stock Market Outlook 7 “Safe-Haven” Dividend Stocks for Turbulent Times XLRN shares were trading at $102.27 per share on Wednesday morning, down $2.77 (-2.64%). Year-to-date, XLRN has gained 92.89%, versus a 1.60% rise in the benchmark S&P 500 index during the same period."}]}