{"article": [{"url": "https://stocknews.com/news/csco-wdc-ayx-3-nasdaq-stocks-to-avoid/", "published": 1597406900.0, "headline": "3 Nasdaq Stocks to AVOID", "body": "Tech stocks have dominated the market this year as the Nasdaq 100 is up 66% from its March low, leading all of the major averages. To compare, the Dow Jones Industrials is up 53% over the same timeframe. From late-March to early-June, nearly all tech stocks participated in the rally. However, as the rally has matured, there is increased differentiation. This means that less stocks were participating in the index’s advance in the past month than the first phase from late-March to early-June. This is evident from the chart below, which shows the percent of Nasdaq stocks above their 50-day moving average: 7 Best ETFs for the NEXT Bull Market Two months ago, 90% of Nasdaq stocks were above their 50-day moving average. Today, it’s 64%. Over this period, the Nasdaq is 7% higher, which means that the index is being lifted by fewer stocks. This is to be expected. As prices rise, expectations also increase. If companies can’t meet these expectations when they release earnings, then prices will reverse. Cisco (CSCO), Alteryx (AYX), and Western Digital (WDC) are three Nasdaq stocks to avoid for the remainder of 2020. Cisco (CSCO) CSCO is trading down 11.3% this week lower following its earnings report that was released on Wednesday. The company actually beat expectations for the second quarter on the top and bottom-line, but investors sold the stock as it issued disappointing forward guidance. In the second-quarter, CSCO reported second-quarter EPS of $0.62 which was higher than consensus by $0.61. Revenue of $12.15 billion was 9% lower on a year-over-year basis and was $60 million above expectations. However, its forecast for the next quarter’s EPS was between $0.41 and $0.47 which was well below expectations of $0.75. Its estimate for revenue is between $11.7 and $11.98 billion, which was below expectations of $12.23 billion. In essence, the market was expecting CSCO’s earnings and revenue to return closer to its 2019 levels in the next quarter. Its stock price had retraced the entirety of its coronavirus decline, but these results made it clear that demand for its products is not going to bounce back immediately. Overall, CSCO’s stock looks attractive by traditional valuation metrics given its price to earnings ratio of 15.7 and above-average dividend yield of 3.4%. However, it does share some characteristics of a value trap given that the business has stopped growing and fallen behind many of its competitors in terms of innovation. Many network equipment like Calix (CALX) and Ciena (CIEN) reported strong quarters with no indication of weaker customer demand with the guidance above expectations. Overall, the sector is doing well as carriers invest in upgrading their networks to get ready for 5G. It’s an indication that Cisco was once on the cutting-edge of innovation in this space but now is falling behind. Looking at CSCO’s results by segment shows a year-over-year decline in revenue in nearly every category. Infrastructure platforms were down 16%; Application was down 9%, and Products was down 17%. The one bright spot was Security, which showed a 10% increase, while Services was flat. Western Digital (WDC) While most technology stocks have been strong over the past decade, WDC’s performance has been lackluster. (source: finviz.com) Its long-term chart shows that it topped in early-2015 and is down 68% since then. There was some optimism going into earnings that the increase in PC and server sales would be a catalyst for the stock price. This week WDC’s earnings report extinguished these hopes as the stock fell 12%. The primary factor was its weak guidance. Analysts were expecting $1.35 in EPS, but the company forecast between $0.45 and $0.65. On revenue, analysts were expecting $4.4 billion in revenue, but WDC guided for between $3.7 and $3.9 billion. Like CSCO, WDC’s results for its previous quarter were in-line with expectations. It reported $1.23 a share in earnings and $4.3 billion revenue, while analysts expected $1.22 in EPS and $4.4 billion in revenue. Notably, the results showed a sequential improvement over the prior year due to above-average demand. WDC’s underperformance is because its storage devices, primarily hard drives, and flash memory, have essentially become commodities. So, WDC doesn’t have pricing power. There’s very little differentiation in the market but high levels of competition. This means prices are falling, and money has to continually be invested to keep up with the competition. It’s turned WDC into a value trap like CSCO as it has a forward price to earnings ratio of 5 and a price to sales ratio of 0.65. The stock is 16% higher from its March lows, while the Nasdaq is 65% higher. Investors should expect this underperformance to continue, given its lack of pricing power and weak forecast. Alteryx (AYX) AYX has been a market darling. From its March-bottom to its recent high, the stock gained more than 100% until it peaked in early-July. From its IPO in 2017, it’s gained 1,100%. (source: finviz.com) AYX is a cloud-based data analytics company that helps its customers optimize their operations, save money, and boost revenue. In the last six years, its revenue has grown from $37 million to $457 million. The company has been focused on growth and has just recently turned its focus to profitability. It had a consistent track record of increasing customers every quarter and growing revenue per customer while maintaining gross margins. In its last quarter, AYX grew revenue by 17% from the previous year and slightly topped EPS guidance. However, shares moved lower last week after the company warned that it noticed that corporate spending was declining. The sales cycle was longer, and there was an increased focus on costs. As a result, the stock has nearly dropped 40% as it’s become clear that the company’s growth is slowing. Investors were expecting a continued acceleration in its top and bottom-line, which is unlikely based on its pessimistic guidance. Conclusion The common link between all these three stocks is that they recently beat earnings but experienced significant declines on weaker guidance. These companies’ primary customers are other businesses, which could indicate that corporations could be tightening their belts. In terms of the broad economy, this could lead to more job cuts, less hiring, less wage growth, and weakness in consumer spending. Want More Great Investing Ideas? 9 “BUY THE DIP” Growth Stocks for 2020 How to Trade THIS Stock Bubble? 7 “Safe-Haven” Dividend Stocks for Turbulent Times CSCO shares fell $0.09 (-0.21%) in after-hours trading Friday. Year-to-date, CSCO has declined -9.18%, versus a 5.73% rise in the benchmark S&P 500 index during the same period."}]}