{"article": [{"url": "https://stocknews.com/news/amzn-baba-sne-pton-4-robinhood-100-stocks-with-buy-ratings/", "published": 1597234100.0, "headline": "4 Robinhood 100 Stocks With BUY Ratings", "body": "Robinhood, a popular trading app that allows investors to use financial instruments at zero commissions, posts a list of its 100 most popular stocks. The list gives insight into the thinking and positioning of Millennial retail traders. It’s a good source of ideas but also reflects the demographic as it’s full of technology and high-beta stocks. It also shows that traders on the platform like to chase high-flying stocks and dumpster-dive for stocks which have endured big sell-offs. Applying our POWR Ratings system to the Robinhood 100 is one way to filter out the bad ideas and identify the best stocks. Amazon.com, Inc. (AMZN), Alibaba Group Holding Ltd (BABA), Sony Corporation (SNE), and Peloton Interactive, Inc. (PTON) are four stocks from the Robinhood 100 that are rated a “Buy” or “Strong Buy” by the POWR Ratings. 9 \"BUY THE DIP\" Growth Stocks For 2020Amazon.com, Inc. (AMZN) AMZN has benefitted from the coronavirus as demand for e-commerce has sharply increased. In addition, it’s resulted in an increased demand for cloud computing services. This has caused the company to beat on the top and bottom-line for multiple quarters, and the stock is trading at all-time highs. In the second quarter, AMZN’s net sales increased 40% year-over-year, and net income increased to $5.2 billion as compared to $2.6 billion in the year-ago period. Furthermore, operating cash flow was up 42% for the trailing twelve months as compared to the previous year. The stock has returned 89.5% since its March lows. The market expects AMZN to report an EPS of $7.25 for the quarter ended September 2020, which represents a 71.4% growth over the year-ago number. The average revenue estimate of $92.39 billion for the quarter ended September 2020 indicates an increase of 32% over the year-ago quarter. How does AMZN stack up for the POWR Ratings? A for Trade Grade A for Industry Rank B for Buy & Hold Grade B for Peer Grade B for Overall POWR Rating The stock is also ranked #1 out of 54 stocks in the Internet industry. Alibaba Group Holding Ltd (BABA) BABA is one of the fastest-growing companies, relative to its size, but it remains reasonably valued with a forward price to earnings ratio of 27. This means the stock has major upside. BABA achieved a gross merchandise value of $1 trillion in its fiscal year ended March 31st, 2020, which is a historic landmark. In the quarter ended March 31st, 2020, revenue increased 22%, and EPS increased by 7% year-over-year. Moreover, annual active customers in the China retail space reached 726 million, representing an increase of 72 million from the previous year. The stock has grown by about 40% since its March lows. BABA’s consensus revenue estimate of $21.2 billion for the quarter ended June 2020 indicates a year-over-year increase of 46.7%. BABA has an impressive earnings surprise history with the company beating the consensus EPS estimates in each of the trailing four quarters. The market expects the company to report an EPS of $1.98 for the quarter ended June 2020, which represents an 11.9% improvement over the year-ago number. It’s no surprise that BABA is rated “Buy” in our POWR Ratings system. It also has an “A” for Trade Grade and Peer Grade, and a “B” for Buy and Hold Grade and Industry Rank. In the 115-stock China industry, it is ranked #1. (BABA is one of the stocks currently in the Steve Reitmeister’s Total Return portfolio. Learn more here.) Sony Corporation (SNE) Sony Electronics, an affiliate of SNE, announced the first CFexpress Type A memory cards in both 80GB and 160GB, which demonstrate high-speed performance, tough durability, and reliability for photographers and content creators. Moreover, last month SNE agreed to make a strategic investment of $250 million to acquire a minority interest in Epic through a wholly-owned subsidiary of Sony. This will further broaden the collaboration between the two companies and create a unique user experience for customers. For the quarter ended June, net income attributable to Sony Corporation’s stockholders increased 53.4%, and sales and operating revenue increased 2.2% year-over-year. SNE has gained about 55% since it hit its 52-week low of $50.94 on March 16th. SNE’s POWR Ratings reflect this promising outlook. It has an overall rating of “Strong Buy” with an “A” for Trade Grade, Buy & Hold Grade, and Peer Grade and a “B” for Industry Rank. Among the 20 stocks in the Entertainment-Media Producers industry, it’s ranked #1. Peloton Interactive, Inc. (PTON) PTON is an interactive fitness platform that offers an array of classes in various fitness disciplines such as yoga, strength training, boot camp, meditation, and indoor cycling. For the fiscal third quarter ended March 31st, the company’s connected subscribers grew 94%, paid digital subscribers grew 64%, and total revenue grew by 66% year-over-year. The 12-month retention rate for connected fitness subscribers was 93%, which shows that most customers were happy with the service. The company also ended the quarter with $1.4 billion in cash and cash equivalents and investments in marketable securities as compared to $439.3 million in the prior-year period. Moreover, the stock has gained more than 265% since its March lows. PTON is focused on developing an affordable low-priced tread which would attract subscribers as PTON’s existing internet-connected treadmills are rather expensive. This would help expand PTON’s customer network. PTON continues to sell its connected fitness products through e-commerce and inside sales channels. The company adopted curbside and threshold delivery early in the COVID- 19 crisis and currently provides live programming from instructors’ homes for its members. PTON’s strong fundamentals are reflected in its POWR Ratings, it has a “Buy” rating with an “A” in Trade Grade and Industry Rank, and a “B” in Buy & Hold Grade and Peer Grade. Within the Consumer goods industry, it’s ranked #9 out of 34 stocks. Want More Great Investing Ideas? 9 “BUY THE DIP” Growth Stocks for 2020 How to Trade THIS Stock Bubble? 7 “Safe-Haven” Dividend Stocks for Turbulent Times AMZN shares fell $10.24 (-0.32%) in after-hours trading Wednesday. Year-to-date, AMZN has gained 71.13%, versus a 5.92% rise in the benchmark S&P 500 index during the same period."}]}