{"article": [{"url": "https://stocknews.com/news/xom-epd-et-amlp-these-11-dividends-are-dangerous-and-will-annoy-your-accountant/", "published": 1602158900.0, "headline": "These 11%+ Dividends Are Dangerous (and will annoy your accountant)", "body": "You may not know it, but big pension funds are pulling billions of dollars out of one sector, leaving behind a group of stocks these big players will never buy again. That’s a clear signal that we need to avoid these stocks, too. I’m talking about oil companies. In New Jersey, for example, legislators are trying to ban the state pension fund from fossil fuels. The state’s Fossil Fuel Divestment Bill has bipartisan support, mainly because oil has been a clear loser for investors. We can clearly see this when we look at the chart of the biggest oil major of them all: 9 \"BUY THE DIP\" Growth Stocks For 2020Exxon’s Long Decline Exxon-Mobil (XOM) peaked at a $500-billion market cap in 2007 and has been in a downward spiral since, pushed lower by the 2014 and 2020 drops in oil prices. Fracking, continued growth in alternative energies and a price war with Saudi Arabia sent oil plunging in 2014. This year, of course, the coronavirus hit travel hard and made telecommuting a way of life for millions of workers. Meantime, electric vehicles continue to grow their market share. These Double-Digit Yields Come With Risk, Tax Hassles This makes the double-digit yields you’ll find among master limited partnerships (MLPs), operators of midstream pipelines and storage facilities, simply too good to be true. Major players in the space include Enterprise Products Partners (EPD), which yields 11% today, and Energy Transfer LP (ET), payer of a massive 23% dividend. Another disadvantage of MLP investing is that these firms are structured so shareholders are classified as partners to the MLP. This is a major headache if you’re a shareholder (or the accountant of a shareholder!) because it means MLPs issue complicated tax documents known as K-1s at tax time. At CEF Insider and our other research services, we much prefer to stick to stocks and funds that give you a simple Form 1099. However, MLPs’ tax structure also means they can pass through a large portion of their earnings to shareholders in the form of dividends. That’s one reason why the ETF that specializes in MLPs—the Alerian MLP ETF (AMLP)—yields 12% today. We don’t have to go too far to see that AMLP’s payout is far from safe: the fund has yielded a lot in its brief history—and it’s cut dividends quickly, too, slashing its payout 40% in the last decade. If AMLP offered a strong total return, those payout cuts could be tolerable—but it hasn’t delivered that, either. AMLP Pays High Dividends—But Takes Away Your Principal Instead, investors have been stuck with a money-losing asset that promised big payouts but has undercut those payouts with dividend cuts and big share-price drops. And with bankruptcies in the MLP world hitting historic highs, that trend is set to continue. The bottom line: There are a lot of high-yield opportunities out there worth checking out, but MLPs aren’t one of them. The downward spiral in oil consumption, strong growth in alternatives and energy efficiency, and high debt loads are all factors weighing down these stocks, and none of these trends are going to shift anytime soon. Want More Great Investing Ideas? Free Report: 5 Bargain Funds with Safe 11% Dividends A “1-Click” Way to Grab Safe 8% Dividends The $43,000 “dividend secret” Wall Street hides from you XOM shares were trading at $34.81 per share on Thursday morning, up $1.31 (+3.91%). Year-to-date, XOM has declined -47.40%, versus a 7.97% rise in the benchmark S&P 500 index during the same period."}]}