{"article": [{"url": "https://stocknews.com/news/xone-mtls-prlb-three-3d-printing-stocks-to-buy-now/", "published": 1595938100.0, "headline": "Three 3D Printing Stocks to BUY NOW", "body": "3D printing is a process of making physical three-dimensional objects from a digital file. The creation of the object is achieved using additive processes. This is where an object is created by laying down successive layers of material until it is formed. 3D printing brings an array of benefits that traditional printing does not offer. The first is customization. 3D printing can provide the ability to personalize products to individual needs. 3D printing also allows for complex printing. This has had a meaningful impact on industrial applications. The technology is also emerging as energy efficient. The process utilizes up to 90% of standard materials, which reduces waste. The coronavirus has had a significant impact on the manufacturing business. Many companies have had to close factories and lay off employees to stop the spread of the virus. This is where 3D is needed. There has been a rise in the demand for specialized medical products, and 3D printers help manufactures create those products. 7 \"SAFE HAVEN\" Dividend Stocks for Turbulent TimesThe ExOne Company (XONE), Proto Labs (PRLB), and Materialise (MTLS) are three 3D printing companies investors should consider buying now. The ExOne Company (XONE) XONE designs, develops, and manufactures 3D printing machines and accessories for industrial customers primarily in the Americas, Europe, the Middle East, Africa, and the Asia Pacific regions. It is a global leader in industrial sand and metal 3D printers, which use binder jetting technology. XONE’s addition to the Russell 2000 and Russell 3000 Indexes last month has increased its appeal to investors. XONE recently announced an upgrade to its existing Quick Ship metal 3D printing service, which includes 2 new stainless steels. This would provide high-density precision parts in 316L and 17-4PH for instant quoting and quick delivery. This upgrade could help XONE attract more customers going forward. Moreover, XONE entered into a Manufacturing PA Innovation Program with Pennsylvanian universities for research and advancement of 3D printing technology. About $2.8 million was granted to respective universities for funding this project. ExOne CEO John Hartner said, “The projects funded by this program will help ExOne unlock the commercial and sustainability value that binder jet 3D printing has to offer, such as delivering lighter weight vehicles that are more fuel-efficient as well as all-new innovations.” XONE’s revenues for the first quarter increased 40% year over year to $13.4 million. Increases in both machine sales and recurring revenue contributed to the growth. The company has adopted several cost-reduction measures since the pandemic started in March to maintain a strong liquidity position. XONE’s EPS is expected to grow 46.5% annually over the next 5 years. XONE hit its 52-week low at $3.55 on March 16th due to an overall dip in the market, but recovered more than 150% since then. How does XONE stack up for POWR Ratings? A for Trade Grade B for Buy & Hold Grade B for Overall POWR Rating You can’t ask for better. It is ranked #3 out of 6 stocks in Technology – 3D Printing sector. Proto Labs, Inc. (PRLB) PRLB is an e-commerce driven digital manufacturer of computer numerical control machining, 3D printing, selective laser sintering, etc. It uses 3D computer-aided design software for developing its products across various markets. PRLB has partnered with GE Additive to develop the world’s largest metal additive system, GE Additive concept laser X line 2000R. This device has applications in the aerospace industry, as it can create larger parts with complex geometries. PRLB generated $31 million in cash from operations in the second quarter of 2020, indicating a 38% rise from the last quarter. Though both net revenue and income declined year over year, CEO and President Vicki Holt said, “The first half of 2020 has presented a great deal of challenges to all businesses, and Proto Labs is no exception.” PRLB gained more than 100% since hitting its 52-week low on March 23rd due to the virus led market crash. PRLB is rated a “Strong Buy’ in our POWR Ratings, consistent with its financial strength and sound business model. It has an “A” in Trade Grade, Buy & Hold Grade and Peer Grade. Out of 6 stocks in the Technology – 3D Printing industry, PRLB is ranked #1. Materialise NV (MTLS) MTLS provides 3D printing services, additive manufacturing, and medical software in the North and South American, European, African, and Asian continents. Its services are primarily used by the aerospace, automotive, consumer goods, and hearing aid industries. Though MTLS’ business operations were affected due to the coronavirus lockdown in most countries, its software and medical segment fared relatively well. Revenues from medical devices and services rose 18.2%, while the software segment grew 5% year over year in the first quarter. MTLS performance in the second quarter is uncertain, as it might have faced problems in the delivery of the final goods and services to different countries. MTLS’ consensus EPS estimates indicate a 63.1% growth annually for the next five years. MTLS hit its 52-week high of $28.99 on June 10th after hitting its 52-week low of $10.65 on March 16th. The stock has gained more than 160% since hitting its 52-week low. MTLS is rated a “Strong Buy” in our POWR Ratings system, with an “A” in Trade Grade and Buy & Hold Grade, and a “B” in Industry Rank. It is ranked #2 out in the Technology- 3D Printing Industry. Want More Great Investing Ideas? 9 “BUY THE DIP” Growth Stocks for 2020 Newly REVISED 2020 Stock Market Outlook 7 “Safe-Haven” Dividend Stocks for Turbulent Times XONE shares . Year-to-date, XONE has gained 21.98%, versus a 0.81% rise in the benchmark S&P 500 index during the same period."}]}