{"article": [{"url": "https://stocknews.com/news/lvs-wynn-rrr-3-casino-stocks-to-bet-against/", "published": 1594296500.0, "headline": "3 Casino Stocks to Bet Against", "body": "When the economy is booming and the stock market is gaining, casino stocks thrive. People feel positive about their finances and are willing to travel to places like Las Vegas, Atlantic City, and Macau to gamble and spend money in restaurants, at bars, and for shows. However, during recessions and in bear markets, people are more reluctant to take risks at the casino tables and spend lavishly. This is why the VanEck Vectors Gaming ETF (BJK) plunged by more than 50% at the end of February and in March of this year when the coronavirus pandemic emerged. 7 Best ETFs for the NEXT Bull MarketAs Covid-19 continues to surge across the globe, especially in the US, casino stocks continue to suffer. Here are 3 casino stocks to avoid: Las Vegas Sands (LVS) When the casinos reopened in June, there was an initial burst of pent-up demand that excited investors, causing a big spike in the stock. Yet since then, LVS is 20% lower. Casino traffic is 60% lower on a year-over-year basis. And that’s before taking into account, the recent increase in case counts which will likely lead to more caution among consumers. Casinos, like LVS, are caught in a trap, since they have huge fixed costs for the amenities to attract travelers. Cutting back on these amenities might make sense in this environment, but then it becomes less attractive for visitors. LVS saw a 50% decline in revenue in the last quarter. Even before the coronavirus, its business has been seeing a flattening of revenues due to increased competition from regional casinos, visitors to the Las Vegas Strip and Macau flatlining over the past couple of years, and online gambling taking larger market share. Younger people also seem less interested in going to casinos. This is evident in its stock price which topped in early-2014 and is 50% below those levels. Its financials reflect this as revenues peaked in 2014 at $14 billion and were $13 billion in 2019. However, operating expenses remained the same at $10 billion. LVS’s poor prospects are also apparent in its POWR Ratings which gives it a Sell rating. It has an “F” for Trade Grade, a “D” for Industry Rank and Buy & Hold Grade, and a “C” for Peer Grade. Among casino/gambling stocks, it’s ranked #5 out of 21. Wynn Resorts (WYNN) (source: finviz.com) As you can see in the 10-year chart above WYNN was struggling even before the coronavirus. Casinos are competing intensely amongst themselves for market share and this leads to margin pressure which negatively impacts the stock price. Though the stock had a bounce in March right at its 2015 lows due to optimism about the economy reopening, the increase in COVID-19 cases put a damper on the stock’s rally. WYNN’s POWR Ratings are consistent with its bleak prospects, as it has a Strong Sell rating. It has an “F” for Trade Grade and Buy & Hold Grade, in addition to a “D” for Peer Grade and Industry Rank. Among casino/gambling stocks, it’s ranked 14th out of 21. Red Rock Resorts (RRR) A contrarian could make a long-term bull case for LVS and WYNN: Yes, casino stocks have been weak for half a decade because of overbuilding, and traffic has flattened. And, the coronavirus is going to lead to a reduction in traffic for the next couple of years. However, this is going to lead to a wave of bankruptcies and consolidations within the space. Larger companies, with financial resources, will emerge from this with more market share and pricing power. This makes sense – cyclical and secular forces will lead to a brutal depression for the sector. However, the survivors will be positioned to thrive. Unfortunately, in this scenario, smaller operators like RRR are the pawns who have to be sacrificed. (source: finviz.com) RRR is unlikely to have the financial resources to survive a prolonged downturn. It has a market cap of $1.2 billion, $1 billion in cash on hand, and operating expenses of $1.6 billion last year. The clock is ticking for RRR. POWR Ratings is negative on RRR with a Strong Sell rating. It has an “F” for Trade Grade and Buy & Hold Grade. It also has a “D” for Peer Grade and Industry Rank. Among casino/gambling stocks, it’s ranked #15 out of 21. Want More Great Investing Ideas? 9 “BUY THE DIP” Growth Stocks for 2020 Is the Bull S#*t Rally FINALLY Over? 7 “Safe-Haven” Dividend Stocks for Turbulent Times Top 3 Investing Strategies for 2020 LVS shares were trading at $44.53 per share on Thursday afternoon, down $1.08 (-2.37%). Year-to-date, LVS has declined -34.21%, versus a -1.61% rise in the benchmark S&P 500 index during the same period."}]}