{"article": [{"url": "https://stocknews.com/news/msft-hd-dpz-mktx-spgi-powi-4-uber-safe-dividends-that-could-double-by-2026/", "published": 1601554100.0, "headline": "4 Uber-Safe Dividends That Could Double by 2026", "body": "Dividend safety matters more than ever today. And we can’t take the continued presence of a payout for granted, either. There are still shoes waiting to drop on dividends that are widely thought to be “secure.” But how do we verify dividend safety? The answer is simple: We look for stocks that are throwing cash at shareholders like it’s no big deal. By “following the money” we’ll also find shares that are: On pace to double their dividends every few years, with The safest dividends to boot. 7 Best ETFs for the NEXT Bull MarketThe conventional wisdom says you can trust companies with entrenched, long-growing dividends because they have a reputation to uphold. But what does it matter if a company paid a dividend in October 1970? That was 50 years ago! We want companies that will still be paying dividends in October 2025 and October 2030 and beyond. We don’t care about a storied history. We are focused on the future, so a modest past is just fine with us. Consider Microsoft (MSFT), which still had a relatively young dividend program coming out of the Great Recession. Shareholders enjoyed a near-doubling of the stock in five years as it rushed to keep pace with a dividend that jumped 125% over the same time period. A “Dividend-Doubler” From MSFT It’s a tale as old as time. Go back to the late ‘80s and early ‘90s when Home Depot (HD) was spinning up its longstanding dividend program, and you’ll see a similar shareholder success story. HD Stacked Cash on Top of More Cash Early On We really want to thread the needle here. Dividend growth is a great start, but we want the most stable of financial foundations. So I’ve tapped into data from dividend health-measuring system DIVCON, which filters important financial metrics into an easy 1-to-5 scoring system to identify the market’s best payout prospects. Read on as I introduce you to a quartet of rapid dividend growers that are pacing for dividend doublers every three to five years, and that have earned sterling 5 scores from DIVCON, indicating their distributions could take a bullet and keep marching forward. Domino’s Pizza (DPZ) Dividend Yield: 0.7% DIVCON Score: 5 5-Year Avg. Dividend Growth: 20.3% The Domino’s Pizza (DPZ) growth story is well-worn at this point, but a quick refresher: At the end of 2009, not long before Domino’s was set to mark a half-century in the pizza biz, the maligned chain announced that it was completely overhauling its core recipe, and the rest is history. A much-improved pie—as well as aggressive adoption of technology—turned Domino’s into one of the best stocks of the 2010s, gaining nearly 4,000%. The good times have kept rolling in 2020. DPZ was one of a handful of consumer stocks that still looked promising even in the depths of the pandemic, given that its business was perfectly positioned to leverage a shut-in population. Shares are up 45% year-to-date, obliterating the broader market. In fact, its stock gains have been so impressive that most investors haven’t taken a peek at how Domino’s is spending its cash. Namely, it’s lavishing ever-higher amounts of it on appreciative shareholders. DPZ Is Delivering Piping-Hot Dividend Growth DPZ has juiced its payout by 152% over the past five years, at a 20%-plus annual rate that, if it maintained that pace, would see its dividend double again by the end of 2024. That’s not a backloaded growth rate, either—Domino’s raised its quarterly dividend by a full 20% earlier this year to its current 78 cents per share. Today’s 0.7% yield looks awful, but your yield on cost won’t stay there for very long. And you can’t ask for much more safety in the payout, which accounts for just about a quarter of DPZ’s profits and garners DIVCON’s top rating. MarketAxess Holdings (MKTX) Dividend Yield: 0.5% DIVCON Score: 5 5-Year Avg. Dividend Growth: 24.6% Next up is MarketAxess Holdings (MKTX), which is bringing bond trading into the 21st century. MarketAxess offers an electronic trading platform for institutional credit markets. That sounds like it would be a mature business given how long stocks have been traded electronically, but consider that in 2019, only a quarter of bonds were traded that way. And importantly, MarketAxess commands the vast majority of this market at the moment. I’ve previously talked about how rapidly the dividend has blossomed at MKTX—a 7-cent-per-share dividend in 2009 has become 60 cents as of this year. That includes a tripling in the payout since 2015, and a 17.6% bump higher for 2020. MKTX: 3x the Income in Just 3 Years But I want to focus a little more on the dividend safety. Not only has MKTX earned DIVCON’s top 5 rating, but its composite score of various financial metrics is 70.75—the second-highest among the 1,200 stocks DIVCON evaluates. Specifically, DIVCON favors its ample 322% free cash flow-to-dividend ratio, robust earnings growth and a sky-high Altman Z-score of 65.32. If you’re not familiar, Altman-Z is a formula that looks at profits, liquidity, debt and other financials to determine just how likely a company is to file for bankruptcy, with a score lower than 1.8 signaling a high probability, a score between 1.8 to 3 signaling some issues, and a score above 3 signaling relatively clear skies. So not only is MarketAxess not a bankruptcy threat—its sky-high score indicates that it’s as rock-solid as a company gets. S&P Global (SPGI) Dividend Yield: 0.8% DIVCON Score: 5 5-Year Avg. Dividend Growth: 15.2% Most Dividend Aristocrats have already waved goodbye to their prime dividend-growth years long ago. But not S&P Global (SPGI). S&P Global, of course, is the financial info and analytics firm that’s largely responsible (via the S&P Dow Jones Indices joint venture) for the S&P 500, Dow Jones Industrial Average and other indices. A lot, actually. Some $4.2 trillion in global assets under management are directly investing in products tied to its indices, and $11.7 trillion is benchmarked and indexed to them. The money that flows in as a result of that ubiquity has powered a dividend SPGI has paid since 1937, including 47 consecutive years of payout growth. But SPGI has really put the pedal down of late, more than doubling its dividend over the past five years, from 33 cents per share to a current 67 cents as its fortunes have exploded. It Pays to Be “The Market” DIVCON points out some obvious pluses, like its 20%-plus profit growth or the fact it has six times the free cash flow it needs to cover its payout. But I love this backstop metric: repurchases-to-dividends. In the trailing 12 months, SPGI has paid out $602 million in dividends, but three times that—$1.8 billion—in repurchases. DIVCON points that out because, if times got really tough and it had to preserve cash to keep paying the dividend, S&P Global would be able to save $1.8 billion annually by toning down its buybacks. It won’t come to that, of course. SPGI is doggedly profitable, and should continue upping its dividends at a torrid pace. Power Integrations (POWI) Dividend Yield: 0.8% DIVCON Score: 5 5-Year Avg. Dividend Growth: 12.9% Most investors are familiar with semiconductor “A-listers” such as Nvidia (NVDA), Intel (INTC) and Advanced Micro Devices (AMD). But they tend to overlook analog semiconductor makers such as Power Integrations (POWI). And that’s a shame. For one, Power Integrations’ components help power a wide range of useful and interesting technologies, from smartphones and LED lights to smart utility meters and solar energy generation. In fact, its application in green technologies has landed it a spot in multiple clean-tech stock indices. Also, you’re missing out on a gem of a dividend-growth story. POWI’s payout isn’t exactly new; it was initiated in 2008 at a split-adjusted 1.25 cents per share. However, growth was inconsistent up until 2012, when the payout really started to take off. And in the past five years, the payout has jumped 83%, including three different dividend hikes in the trailing 12 months. I love this chart, because it indicates the stock is actually trailing the dividend by a significant margin and might still have even more catching up to do. Meanwhile, it’ll be backstopped by a financial position so strong that DIVCON gives Power Integrations its highest composite score. No debt. $446 million in cash. Free cash flow that’s 1,000% times what it needs to finance the dividend. The 0.8% yield for current money might seem chintzy, but this tech stock could handsomely elevate that in the years to come. Want More Great Investing Ideas? Your Early Retirement Portfolio: 7.7% Dividends—Every Month—Forever How to Retire on 10% Dividends Paid Monthly The Simple (and Safe) Way to Earn 15% Every Year from Stocks MSFT shares were trading at $211.84 per share on Thursday morning, up $1.51 (+0.72%). Year-to-date, MSFT has gained 35.40%, versus a 6.14% rise in the benchmark S&P 500 index during the same period."}]}