{"article": [{"url": "https://stocknews.com/news/shop-pypl-w-hznp-spyg-spyv-amzn-ebay-etsy-ma-v-heres-my-top-4-growth-stocks-to-buy-right-now/", "published": 1597666100.0, "headline": "Here’s My Top 4 Growth Stocks to Buy Right Now", "body": "2020 has been an interesting year, to say the least. The panic and uncertainty created by the pandemic led to a historic, yet temporary, market crash. The subsequent bounce-back was also historic. Many of the stocks that have been soaring are growth stocks. The SPDR S&P 500 Growth ETF (SPYG) has been outpacing its value counterpart, SPDR S&P 500 Value ETF (SPYV), 56.30% to 33.65%. Growth stocks can produce significant gains when supported by fundamentals. As earnings season winds down and we’ve got a look into corporate performance for the second quarter, now is an excellent time to determine which growth stocks to buy for the remainder of the year. These stocks have increased sales numbers, and their products are in high demand. Tailwinds such as investor optimism for a new fiscal package, a vaccine, and lower unemployment claims should keep the party going for a while. I believe growth companies should remain a catalyst for the overall market going forward. Here are four growth companies that have performed well and should continue to outperform for the rest of the year: Shopify (SHOP), PayPal Holdings (PYPL), Wayfair (W), and Horizon Therapeutics (HZNP). 9 \"BUY THE DIP\" Growth Stocks For 2020Shopify (SHOP) SHOP offers an e-commerce platform primarily to small and midsize businesses. The firm has two segments: subscription solutions, which represented 43% of fiscal 2018 revenue, and merchant solutions, representing 57%. The subscription solutions segment allows SHOP merchants to conduct e-commerce on various platforms such as the company’s website, at physical stores, and on social networks. The company is well-positioned to benefit from changing consumer behavior due to the pandemic. SHOP’s platform offers everything a merchant needs to set up shop online. As consumers shop online and through mobile, SHOP has it covered. The company sets itself apart from other e-commerce players because it is a brand-oriented platform. It’s not an online marketplace. Merchants use their domains to set up shop, as opposed to selling on Amazon (AMZN), eBay (EBAY), or Etsy (ETSY). This allows merchants to control their brands. SHOP had an outstanding second quarter. The company reported adjusted net income of $129.4 million or $1.05 per share. This was a 950% increase from the previous year’s figure. Its total revenue for the quarter was $714.3 million, a 97% increase from the same quarter last year. New stores created on SHOP’s platform grew 71%. The company estimated 5-year EPS growth is 108.3%. SHOP is rated a Buy in our exclusive POWR Ratings system. In the four components that make up the POWR ratings, the stock has a grade of A for Trade Grade, and a B for Buy & Hold Grade, Peer Grade, and Industry Rank. It is also the #6 ranked stock in the Internet – Services industry. PayPal Holdings (PYPL) PYPL is one of the largest online payment solutions providers in the world. The company, which was spun off from eBay (EBAY) in 2015, provides electronic payment solutions to merchants and consumers, focusing on online transactions. The company had over 300 million active accounts at the end of 2019. This includes 20 million merchant accounts. The company differs from its competitors due to safety and the simplicity of its transactions. Its solutions are simple and affordable, and consumers and merchants can move money by any connected device. PYPL also benefits through its strategic partnerships. The company has had a ten-year partnership with Mastercard (MA) and has started working with Visa (V), where it receives economic incentives for increased volume. PYPL’s One Touch solution is the company’s most rapidly adopted product. It allows customers to make purchases through a variety of merchant sites and apps without entering additional information. Its Venmo app has boosted the company’s stake in mobile payments. The company reported its most recent financial results on July 29th with EPS of $1.07, compared to the consensus estimate of $0.61. This was a 29% increase from the same quarter a year ago. Revenue was $5.26 billion, a 13.9% increase from the previous year. The company has a five-year EPS estimate of 23.4%. PYPL is rated a Strong Buy by our POWR Ratings system. Every score for the POWR Ratings has a grade of A, an impressive feat. PYPL is also the #2 ranked stock in the Consumer Financial Services industry. Wayfair (W) W, founded in 2002, is one of the world’s leading online sellers of home goods products. This consists of furniture and home decor. At the end of 2019, the firm offered approximately 18 million products from more than 12,000 suppliers under the brands Wayfair, Joss & Main, AllModern, DwellStudio, Birch Lane, and Perigold. The company is poised to benefit from a growing home goods market. Affluent households are expected to drive this demand. W has also been making insteps to strengthen its position in the international markets. This includes Canada, the United Kingdom, and Germany. It has grown its global supplier network and established its brand presence in these countries. W reported financial results on August 8th. Its EPS of $3.13 was a massive jump from its EPS of -$2.92 last year, over the same period. Total revenue came in at $4.3 billion, 83.7% higher than last year. Revenue growth was driven by an increase in new and repeat customer orders. In the second quarter, more than 50% of orders were from repeat customers, which was up 104.9% year over year. This bodes well for the company as it incurs less advertising costs from repeat customers. W is rated a Strong Buy by our POWR Ratings system. The company has a grade of A for three out of the four components that make up the POWR Ratings: Trade Grade, Buy & Hold Grade, and Peer Grade. It has a grade of B for the remaining component, Industry Rank. W is the #1 ranked stock in the Specialty Retailers industry. Horizon Therapeutics (HZNP) HZNP is a specialty and generic drug manufacturing company. The company is focused on researching, developing, and commercializing medicines that address critical needs for people with rare and rheumatic diseases. It markets drugs in the areas of inflammation, orphan diseases, and rheumatology. The company has two reportable segments: orphan and rheumatology segment and the inflammation segment. HZNP reported earnings on August 5th with record second-quarter results. HZNP had net sales of $462.8 million for the quarter, which was an increase of 44 percent. The company has also recently received FDA approval for Procysbi, a delayed-release oral medicine for adults and children with nephropathic cystinosis. It increased its full-year 2020 net sales and adjusted EBITDA based on the continued strength of its thyroid eye disease drug, TEPEZZA. HZNO has a five-year EPS growth estimate of 25.9%. In April, the company acquired privately-held, biopharma company Curzion Pharmaceuticals, Inc. and its development-stage oral selective lysophosphatidic acid 1 receptor (LPAR1) antagonist, CZN001, which was renamed HZN-825. This drug treats diffuse cutaneous systemic sclerosis (dcSSc). The company expects to start a phase IIb study in the first half of 2021. HZNP is rated a Buy in our POWR Ratings system. It has grades of A in three out of the four POWR components: Trade Grade, Peer Grade, and Buy & Hold Grade. The company has a grade of B in the fourth component, Buy & Hold Grade. Want More Great Investing Ideas? The Best of StockNews 3 Possible Directions for the Stock Market from Here 9 “BUY THE DIP” Growth Stocks for 2020 SHOP shares . Year-to-date, SHOP has gained 154.78%, versus a 6.07% rise in the benchmark S&P 500 index during the same period."}]}