{"article": [{"url": "https://stocknews.com/news/amd-nxpi-glw-nvda-the-4-best-technology-stocks-to-buy-right-now/", "published": 1602158900.0, "headline": "The 4 Best Technology Stocks to Buy Right Now", "body": "The market has whipsawed back and forth this year, but technology stocks have been the clear winners. I believe the sector has plenty of room to grow, and I’ve selected the four best stocks in the sector to buy now. In my opinion, these companies offer the best potential for both earnings’ growth and price appreciation over the near and mid-term. But first, let’s consider why I am so bullish on the sector. The move to remote working and learning wasn’t the only catalyst to spark up technology companies. I believe the tech sector has benefited from the Fed rate cuts. This has led to a drop in the real interest rate, which is the rate of interest an investor receives after inflation. This puts downward pressure on bond yields and makes the technology sector more attractive. The economic setting remains favorable to tech stocks as the pandemic seemingly carries on with rising case counts. This should continue the acceleration of technology growth trends, especially against a backdrop of companies struggling in other industries. In that sense, the following companies have certainly benefited from the digital transformation, and I see their growth stories continuing: Advanced Micro Devices (AMD), NXP Semiconductors (NXPI), Corning (GLW), and NVIDIA (NVDA). 9 \"BUY THE DIP\" Growth Stocks For 2020Advanced Micro Devices (AMD) AMD designs and produces microprocessors for the computer and consumer electronics industries. The company has benefited from the strong adoption of the 7 nanometer-based Ryzen and Radeon and second-generation EPYC server processors. This is due to a rapid increase in the usage of artificial intelligence and machine learning in both cloud gaming and supercomputing. I see the company gaining significant market share in the CPU data center segment, driven by the work from home trend. As the company moves to its next-generation processors, it should generate higher volume, higher prices, and expand its gross margin. The launch of several new gaming platforms should serve as a growth catalyst this quarter. Sales and earnings are expected to grow 22.9% and 50.9%, respectively, next year. This has driven up momentum for the stock and resulted in a “Buy” rating in our POWR Ratings system. The stock holds a grade of “A” in Trade Grade and Industry Rank, and a “B” in Buy & Hold Grade and Peer Grade. These are the four components that make up our POWR Ratings system. AMD is also the #17 ranked stock in the Semiconductor & Wireless Chip industry. NXP Semiconductors (NXPI) NXPI is a leading supplier of high-performance mixed-signal products. The company has benefited from a strong position in the Internet of Things (IOT), communications, industrial, and mobile industries. The rising trend of 5G is driving NXPI’s communications business. Growth in the industrial and IoT segments are a result of the replacement of traditional mechanical equipment with smart and connected electronic equipment. The company should see an increased market share in its automotive segment. This segment represents almost half of NXPI’s revenue. The company designs and develops products for an automobile’s infotainment, in-vehicle networking, and electric powertrain applications. The automotive electronics market has been growing rapidly due to demand from consumers that want more technology and safety in their cars. The company is expected to see 42.7% earnings growth next year, with a consensus estimate rising as the company improves on its gross and operating margins. The stock is rated a “Strong Buy” in our POWR Ratings system. It holds a grade of “A” in Trade Grade, Buy & Hold Grade, and Industry Rank, and a “B” in Peer Grade. It also ranked #20 out of 86 stocks in the Semiconductor & Wireless Chip industry. Corning (GLW) The next stock on my list is considered a technology stock and a manufacturing stock. It engages in display technologies, optical communications, environmental technologies, specialty materials, and life sciences businesses worldwide. The company is a leader in each of its Market-Access Platforms. In the Specialty Materials segment, GLW has seen strong demand for premium glasses. The company should also see long-term growth in Optical Communications, driven by an increase in hyper-scale data center demand. The company recently completed its purchase of the Communication Markets Division from 3M (MMM) for $900M. The business consists of optical fiber and copper passive connectivity solutions for the telecom industry. This expands GLW’s portfolio into high-growth areas. GLW has made inroads in the Life Sciences market as it secured government funding to manufacture glass vials for vaccines. The company is also looking to move into the automotive market. While the company has had poor recent earnings reports, analysts forecast 42.9% growth next year. GLW is rated a “Strong Buy” in our POWR Ratings system. It holds a grade of “A” in Trade Grade, Buy & Hold Grade, and Peer Grade. In the remaining component, Industry Rank, the stock has a grade of “B.” GLW is ranked #2 in the Industrial – Manufacturing industry. NVIDIA (NVDA) The final stock on this list is another chip company and plays on the booming gaming and data center industries. NVDA is the leading designer of graphics processing units that enhance the experience of computing platforms. The company has benefited from the coronavirus-induced work-from-home and learn-at-home trend. It has also gained from strong growth in GeForce desktop and notebook GPUs. Rising demand for its hyper-scale line is boosting the company’s Data Center business. This business should improve due to expanding AI workloads from enterprise customers. The company’s presence in the autonomous automotive business should increase with its collaboration with Mercedes-Benz. Plus, its AI-based cockpit solutions are an additional driver in the automotive industry. NVDA’s acquisition of Arm Limited would create the world’s top AI computing company, setting it up for future growth. Analysts expect earnings to grow 21.7% next year, and sales to grow 18.6%. The company is rated a “Strong Buy” in our POWR Ratings system. It holds straight “A” across the board in every component and the overall rating. The stock is also ranked #15 out of 86 companies in the Semiconductor & Wireless Chip industry. Want More Great Investing Ideas? 7 Best ETFs for the NEXT Bull Market What is the Cure for Stock Market Volatility? Chart of the Day- See Christian Tharp’s Stocks Ready to Breakout"}]}