{"article": [{"url": "https://stocknews.com/news/sil-wpm-paas-cef-silver-investments-may-be-priced-to-purchase-after-recent-retreat/", "published": 1598789300.0, "headline": "Silver Investments May Be Priced to Purchase after Recent Retreat", "body": "Silver investments may be priced to purchase after a recent retreat that followed a big jump. Silver investments surged earlier this year and the precious white metal has a historic pattern of lagging behind the advance in gold but ultimately catching up and surpassing the percentage gain in the latter. The price of silver has outperformed gold and even the technology-fueled NASDAQ Composite Index so far this year. Thus far in 2020, silver soared 41.54%, the NASDAQ Composite jumped 30.35%, gold gained 26.51%, the S&P 500 climbed 8.58% and the Dow Jones Industrial Average nosed up 0.40%, as of the close of trading on Friday, Aug. 28. The strong performance of silver and gold, boosted by more than $6 trillion in aid from federal stimulus and Federal Reserve actions, followed a recent pullback in their prices that gives investors who had waited to gain a second chance at purchasing precious metals, as well as related stocks and funds. 7 Best ETFs for the NEXT Bull MarketSilver Investments May be Priced to Purchase After Dip “After the tumultuous rise in gold and silver, profit-taking was in order,” Rich Checkan, president and chief operating officer of Asset Strategies International, a full-service tangible asset dealer in Rockville, Maryland. “I believe this most recent bout is over.” Rich Checkan, president, Asset Strategies International Meanwhile, the value of the U.S. Dollar Index has fallen 4.34% so far 2020, as of Aug. 28. The index closed at its second-lowest level in more than two years, since only on Aug. 18 did it slip lower in that multi-year period. In terms of purchasing power, the U.S. dollar has weakened 14.6% since March 29, 2020, when the U.S. currency could buy .00068 of an ounce of gold, compared to just .0005806 of an ounce on Aug. 28, said Patrick Heller, communications officer at Michigan’s largest rare coin and precious metals dealer, Liberty Coin Service, of Lansing. The U.S. Dollar Falls in Value, as Silver and Gold Prices Surge “All world currencies have fallen against the price of gold since mid-March, with the U.S. dollar having fallen further than all but a handful of foreign currencies,” Heller said. Retail customers at Liberty Coin Service’s store, just three miles from Michigan’s Capitol building, have risen strongly among patrons who are buying bullion-priced physical silver and gold, Heller said. Increased media coverage about the drop in the U.S. dollar likely has been a big reason, he added. Many of those customers are first-time buyers, Heller said. Liberty’s sales in July more than tripled June’s total, he added. Silver Investments May be Priced to Purchase, Coin Dealer Says Month-to-date sales through Aug. 27 at Liberty Coin Service are getting close to topping July’s total and may well do so by Monday, Aug. 31, Heller continued. News about gold reaching all-time high prices, without factoring in the effects of inflation, is also playing a role in boosting demand from retail customers, he added. “In July, our quantity of purchases from the public were still only 82% of the average per month from January 2016 through December 2019,” Heller said. “However, the average transaction size was so large that it was our second-largest total dollars spent buying from retail customers of any month since January 2016. Only August 2017 was higher in dollars spent, though on a much greater number of transactions.” Dividend-paying Silver Investments May be Priced to Purchase Investors can buy silver mining stocks and funds, too. Those who want dividends may be interested in Global X Silver Miners Fund (NYSE:SIL) as a proxy for silver. SIL offers a 1.16% dividend yield and gained 4.05% on Friday, Aug. 29, to boost its year-to-date (YTD) return to 48.47%. Its returns are 4.99% for the past week, a loss of 0.35% for the last month, a rise of 40.35% for the past month and 49.07% for the last 12 months. Chart courtesy of www.stockcharts.com Kramer Eyes Dividend-paying Silver Investments May be Priced to Purchase “For silver itself, I prefer Wheaton Precious Metals Corp. (NYSE:WPM), which is less about mining than pure silver trading,” said Hilary Kramer, host of a national radio program called “Millionaire Maker” and head of the Value Authority and GameChangers advisory services. “They know what they’re doing and pay a dividend. Rising silver prices will enhance the shareholder payout.” Columnist and author Paul Dykewicz interviews money manager Hilary Kramer, whose premium advisory services include 2-Day Trader, Turbo Trader, High Octane Trader and Inner Circle. Wheaton Precious Metals offers a current dividend yield of 0.78% and has a forward price-to-earnings ratio of 50.40%. The stock’s returns are 79.29% YTD, 2.47% for the last week, -4.36% for the past month, 23.01% for the last three months and 78.58% for the past 12 months. It also gained 3.17% on Friday, Aug. 28. Chart courtesy of www.stockcharts.com Dividend-paying Silver Investments May be Priced to Purchase “Probably the best stock in the space as far as relative share price performance is Pan American Silver (NASDAQ:PAAS),” said Jim Woods, who leads the Successful Investing, Intelligence Report and Bullseye Stock Trader advisory services. “That stock is outpacing 97% of all other publicly traded companies in terms of relative price strength.” Pan American Silver offers a current dividend yield of 0.59% and has a forward P/E of 38.69%. Its returns are 51.41% for the YTD, 7.53% for the past month, 32.83% for the last three months and 91.90% for the past 12 months. On Friday, Aug. 28, it closed up 4.90% for the day. Chart courtesy of www.stockcharts.com Woods told me a big help in choosing stocks is his use of relative price strength as a key screening tool when selecting recommendations for his Bullseye Stock Trader premium advisory service. Paul Dykewicz meets with Jim Woods before COVID-19 to discuss new investment opportunities. Skousen Sees Silver Investments Priced to Purchase Another investment forecaster who likes silver and gold is Mark Skousen, PhD, Presidential Fellow at Chapman University, recipient of the inaugural Triple Crown in Economics in 2018 and honoree as one of the 20 most influential living economists. Skousen, who also writes a monthly investment newsletter called Forecasts & Strategies, recommended the purchase of Pan American Silver (NASDAQ: PAAS) in his TNT Trader advisory service. The stock jumped 21% in two weeks, while the call options he recommended rose 101% during the same time span. To protect his gains, Skousen sets stop prices on stock recommendations in his trading services and raises them as the share prices climb to ensure even larger profits are protected during the ascent. Mark Skousen, a descendant of Benjamin Franklin, meets with Paul Dykewicz in Philadelphia. Caution Needed with Dividend-paying Silver Investments Priced to Purchase Investors can earn income and benefit from rising precious metals prices by owning shares in mining companies, said Bob Carlson, chairman of the Board of Trustees of Virginia’s Fairfax County Employees’ Retirement System with more than $4 billion in assets. However, investors need to beware that the share prices of mining companies are “far more volatile” than the prices of gold and silver themselves, he added. Carlson, who also leads the Retirement Watch advisory service, advised investors to remember that mining company shares are affected by factors other than the price of precious metals. Those considerations include a company’s debt level, management skill, labor issues and COVID-19 risks. Pension fund Chairman Bob Carlson answers questions from Paul Dykewicz during an interview before social distancing became the norm after the outbreak of COVID-19. Dividend Investments Priced to Purchase Appeal to Perry Bryan Perry, a former Wall Street trading professional, is recommending Sprott Physical Gold and Silver Trust (NYSE:CEF) as a hedge position in his high-income Cash Machine advisory service. Paul Dykewicz interviewing Bryan Perry. “The price of silver has rallied back to pre-coronavirus levels under the influence of two driving forces,” Perry told me. “The first is the tidal wave of liquidity pouring into the global financial system brought on by central bank stimulus. At its core, fiscal stimulus eats away the purchasing power of fiat currencies, making precious metals an attractive hedge and investment. “Stability in copper prices recently has speculators interpreting that broad commodity price inflation might be brewing, which also would bode well for putting upside pressure on silver that is used in several manufacturing subsectors. Silver is considered the poor man’s precious metal but has a history of catching fire and making sudden sharp moves higher to catch up with gold. Owning CEF offers the best of both metals in one ETF in physical form.” CEF jumped 1.80% on Friday, Aug. 28, while rising 2.88% in the last week, 4.20% in the last month, 25.37% in the past three months, 38.88% YTD and 35.46% in the last 12 months. It currently trades without a discount after the recent rise in demand but its three-year average discount from its net asset value is 2.91%. Unfortunately, CEF does not pay a dividend. Assets under management at CEF rose to $17 billion on Aug. 4, up 22% since June 30, company officials announced. Its net income rose 18.0% to $10.5 million, or 43 cents per share, at the end of second-quarter 2020, compared to $8.9 million for the same period last year. Dividend-paying Silver Investments May be Priced to Purchase The global COVID-19 pandemic has been costly in so many ways, but especially in human terms by imperiling and snuffing out lives. As of Aug. 29, 24,800,366 cases and 838,704 deaths have occurred globally, along with 5,931,511 cases and 182,069 deaths in the United States, as of June 5. America has amassed the most cases and deaths by far of any country in the world, including China, where COVID-19 originated. As the U.S. economy is starting to reopen gradually in most states, the stock market has been recovering strongly since March with both the NASDAQ Composite and S&P 500 setting record highs. With more than $6 trillion in federal stimulus boosting the likelihood that inflation will rise in the future, experts are predicting further appreciation for silver and gold, despite the recent short-term pullback in both. SIL shares closed at $49.07 on Friday, up $1.91 (+4.05%). Year-to-date, SIL has gained 48.47%, versus a 10.05% rise in the benchmark S&P 500 index during the same period."}]}