{"article": [{"url": "https://stocknews.com/news/penn-byd-dkng-wynn-bjk-spy-2-gambling-stocks-to-buy-and-2-to-sell/", "published": 1597147700.0, "headline": "2 Gambling Stocks to BUY and 2 to SELL", "body": "The gaming industry surged over the past two years, but took a massive hit when the pandemic began spreading across the world in February 2020. The VanEck Vectors Gaming ETF (BJK) dropped 50% in just 1-month before bottoming on March 18th. While the sector has rebounded, the gambling industry faces an uncertain future. Some states are reopening, while others are closing. This has had a significant effect on which casinos, if any, will be open for business. Online gaming, specifically sports betting, is one way for the industry to generate revenue in times of social distancing. In May 2018, the U.S. Supreme Court found the Professional and Amateur Sports Protection Act (PASPA) unconstitutional. The PASPA was created to define the legal status of sports betting in the United States. It essentially outlawed sports betting nationwide, except for a few states. 18 states and Washington D.C currently offer legal sports betting. There are another 16 states that have legislation for betting on their ballots this year. While three of the four major sports are currently playing again, we don’t know how long that will last. Also, the college football season appears to be in jeopardy, as the Big 10 conference voted on Sunday to cancel its season due to the pandemic. The Mid-American Conference (MAC) already announced it wouldn’t be playing this year, and players in the PAC-12 have raised concerns about playing. 7 \"SAFE HAVEN\" Dividend Stocks for Turbulent TimesIn this era of uncertainty in gambling, I have highlighted two gaming stocks that should hold steady during the pandemic, Penn National Gaming (PENN) and Boyd Gaming (BYD), and two to avoid, DraftKings (DKNG) and Wynn Resorts (WYNN). Gaming Stocks to Buy Penn National Gaming (PENN) PENN is an operator of gaming and racing properties and video gaming terminals in the U.S. It offers live sports betting in Indiana, Iowa, Mississippi, Nevada, Pennsylvania, and West Virginia. The company operates 41 facilities with approximately 50,500 gaming machines, 1,300 table games, and 8,800 hotel rooms. New England is one area of the country that has recently gotten the coronavirus under control and is slowly reopening the economy. This has been great news for PENN as it was able to reopen the Plainridge Park Casino in Massachusetts and the Hollywood Casino Bangor in Maine. The company is also poised to benefit from its development project with Barstool Sports for a betting app. The company has plenty of liquidity to survive another shutdown. As of June 2020, the company had $1.24 billion in cash sitting on its balance sheet with a current ratio of 2.0. Last week, PENN beat analysts’ expectations with earnings per share (EPS) of -$1.69, compared to the average estimate of $-2.06. Revenue also outpaced with $305.5 million, compared to $242.94 million. The stock is up over 90% year to date, significantly outpacing the BJK and the SPDR 500 ETF (SPY). PENN is rated a Buy in our momentum-based POWR Ratings system. It holds grades of A in Trade Grade and Peer Grade, two of the components that comprise the POWR Ratings. It is the #2 ranked stock in the Entertainment – Casinos/Gambling industry. Boyd Gaming (BYD) BYD is a regional casino company focused primarily on serving middle-income customers. The company operates 16 casinos in Atlantic City, Las Vegas, Illinois, Indiana, Louisiana, and Mississippi. Its Las Vegas casinos account for over a third of its total revenue. BYD was founded in 1973 and currently employs more than 24,000 employees. The company recently debuted the Stardust Social Casino mobile app. Unlike other gaming apps that allow users to bet on sports games, the Stardust Social Casino mobile app will enable customers to play many of the same games they play on the casino floor. PENN also drives growth with acquisitions to increase its brand. The company entered an agreement with PENN to acquire the operations of Ameristar St. Charles; Ameristar Kansas City; Belterra Casino Resort in Florence, IN; and Belterra Park in Cincinnati, OH. BYD also has enough liquidity to sustain operations through the pandemic. At the end of the second quarter, it had cash and cash equivalents of $1.31 billion, which is up considerably from $0.25 billion at the end of 2019. The stock is up 51% over the past three months, well above the rest of the industry. The company is rated a Buy in our POWR Ratings system. It has a grade of A for Peer Grade and a grade of B for Trade Grade. BYD is also the #4 ranked stock in the Entertainment – Casinos/Gambling industry. Gaming Stocks to Sell DraftKings (DKNG) DKNG is a digital sports entertainment and gaming company. The company provides users with daily fantasy sports, sports betting, and iGaming opportunities. iGaming is placing a bet on the outcome of an event of a game online. DKNG is also involved in the design and development of sports betting and casino gaming platform software for online and retail sportsbook and casino gaming products. As most major sports were on hold until recently, DKNG offered the ability to bet on Golf, NASCAR, Counter-Strike, and Rocket League. Now that sports are back on, the company is poised to benefit, assuming the games keep getting played. That assumption is where my apprehension is. There is a genuine possibility that the major leagues get shut down, and the college season doesn’t get played at all. The MLB is already seeing several of its players testing positive. While DKNG may be a great company, in the long run, there is too much uncertainty to buy it now. The company went public in April via a special-purpose acquisition company. It then merged with Diamond Eagle Acquisition and SBTech. It reported its first quarterly statement in May, and is reporting its next statement this Friday. Most analysts do not expect great fundamentals from the company for the quarter. Its growth is dependent on an increased amount of betting, which may not be reflected in its latest report. The consensus estimate for EPS is -$0.15 on just $65 million of revenue. Not exactly high numbers for a company with an $11.7 billion market cap. Wynn Resorts (WYNN) WYNN operates luxury casinos and resorts. The company, founded in 2002 by Steve Wynn, operates four megaresorts: Wynn Macau and Encore in Macau, and Wynn Las Vegas and Encore in Las Vegas. WYNN also launched the Encore Boston Harbor in 2019. The Macau operations make up over 50% of revenue. The coronavirus has hurt the company, and it will likely continue until it is over. Most of the firm’s U.S. properties were temporarily closed. WYNN reported terrible results for the second quarter. It reported EPS of -$6.14 compared with the average estimate of -$4.98, and revenue of only $85 million compared with the consensus estimate of $275.82 million. The revenue figure was a decline of 94.8%. The results were negatively impacted by the pandemic induced shutdowns in Las Vegas and low foot traffic in Macau. While the company has resumed operations, social distancing guidelines will continue to harm its bottom line. WYNN has also suspended its dividend to maintain liquidity. That is not a sign of a healthy company. In more bad news, the Macau government has set a withdrawal limit on ATM transactions to tackle money laundering. This will likely restrict gaming revenue in Macau. The company is currently rated a Sell by our POWR Ratings system. It holds grades of F in Trade Grade and Buy & Hold Grade, and a D in Peer Grade. Want More Great Investing Ideas? 3 Possible Directions for the Stock Market from Here How to Trade THIS Stock Bubble? 9 “BUY THE DIP” Growth Stocks for 2020 PENN shares were trading at $47.84 per share on Tuesday afternoon, up $2.46 (+5.42%). Year-to-date, PENN has gained 87.17%, versus a 5.43% rise in the benchmark S&P 500 index during the same period."}]}