{"article": [{"url": "https://stocknews.com/news/nvda-crwd-qqq-two-tech-stocks-with-explosive-growth/", "published": 1600949300.0, "headline": "Two Tech Stocks With EXPLOSIVE Growth", "body": "We’ve seen a flood of sell orders hit the Nasdaq-100 Index (QQQ) over the past couple of weeks, and investors chasing the index near the $300.00 level have learned an expensive lesson about paying for growth at any price. However, with the market now more than 13% off of its highs, it’s a good time to begin preparing shopping lists if this market correction does send the Nasdaq-100 down closer to its 200-day moving average. While we’ve seen considerable damage to many of the tech names, there are a couple of names holding up quite well, suggesting that funds are likely accumulating them. These stocks also have explosive earnings growth, which adds to their attractiveness when coupled with their relative strength in the past two weeks. 7 \"SAFE HAVEN\" Dividend Stocks for Turbulent Times(Source: TC2000.com) While Nvidia (NVDA) and Crowdstrike (CRWD) have little in common, with the latter being the leader in Software-Security and the former being a juggernaut in the Semiconductor space, the two do share one crucial trait: relative strength. Although the Nasdaq-100 and S&P-500 (SPY) have slid beneath their 50-day moving averages on heavy volume, CRWD and NVDA have barely budged and haven’t even tested their 50-day moving averages. This underlying strength suggests that institutions are likely accumulating these two names, as they’re standing head and shoulders above their peers from a relative strength standpoint. Let’s take a closer look at why institutions might be sitting on the bid for these two tech heavyweights: (Source: Company Presentation) Crowdstrike develops security solutions in the US, and its AI-powered Falcon Platform can block threats better than most other offerings in the market currently. The reason for this is that the company’s cloud-scale AI gets smarter as it consumes more data, with 3 trillion events streamed to the Threat Graph per week. Crowdstrike’s customer growth of 91% year-over-year and position with 49 of the Fortune 100 and 11 of the top 20 banks is a testament to its superiority and recognition as the leading tool in the marketplace currently. While many would argue that it’s too late to hop aboard with CRWD already having significant penetration in the market, the company believes that its TAM could be upwards of $30 billion. With trailing-twelve-month revenue of just $700~ million, there is still a significant runway here. (Source: TC2000.com) While the above earnings trend leaves a lot to be desired as there are no earnings yet, it’s important to note that net losses per share have narrowed for the past three years, and CRWD is expected to have positive earnings this year finally. This is a very positive development for the bull camp, as the bears have been citing for two years now that a lack of profitability was a concern while ignoring the company’s triple-digit sales growth. As shown above, annul EPS estimates are sitting at $0.08 in FY2021 and are expected to grow to $0.30 in FY2022. Assuming the company can meet these estimates, this would translate to 275% growth year-over-year, one of the highest earnings growth rates in the market. Besides, growth funds often wait for annual EPS to be on the table before taking on significant positions, so this transition to profitability should be a tailwind. Given that the stock continues to hold up well during this correction and its leading role in the Software Security space, I would view any dips below $123.00 as buying opportunities. (Source: Company Presentation) Moving over to Nvidia, it’s been an exciting year for investors, with the stock up over 90% year-to-date, massively outperforming the QQQ. The company continues to grow through acquisition and use of its position of power to its advantage, with the purchase of ARM last week for $40 billion, and the massive Mellanox acquisition last year. There are few things more bullish for a stock than growing through acquisition. It suggests that we have management that is hungry to grow market share when opportunities arise, rather than other mega-caps that sometimes get complacent and take on a caretaker approach when they reach critical mass. The recent ARM Holdings deal puts Nvidia in a position to dominate the chip industry further. Besides, the company should also benefit from cross-selling its computing products to existing ARM customers. (Source: YCharts.com, Author’s Chart) If we look at the company’s earnings trend above, few mega-caps can hold a candle to Nvidia’s growth, with annual EPS increasing from $0.74 in FY2014 to estimates for $9.16 in FY2021. This translates to a 43% compound annual EPS growth rate, well above the average for even mid-cap growth stocks. However, growth isn’t expected to stop here. Based on FY2022 estimates, NVDA is forecast to continue seeing double-digit annual EPS growth, with estimates sitting at $11.25. It’s worth noting that these estimates have not included the benefit of the ARM Holdings deal, which is still subject to regulatory approvals. Assuming NVDA can close the deal, I would expect FY2023 annual EPS estimates to jump closer to $13.40 based on much higher revenues cross-selling to ARM customers, and the company’s current revenue base. It isn’t easy to find any mega-caps out there gobbling up companies left and right and growing annual EPS at double-digit growth rates, but NVDA is one of them. Fortunately, the stock has now reset its overbought condition in early September, sliding from near $600 to below $480 currently. While there’s no guarantee that this correction is over just yet, I would expect any pullbacks closer to the stock’s 150-day moving average at $420.00 to provide an exceptional buying opportunity. Therefore, while I don’t think it’s time to get aggressive on NVDA just yet, another 10% drop here to $429.00 would make the stock quite attractive from a valuation basis. I recently sold my position at $580.00 as the stock was getting ahead of itself, but I would consider jumping back in if this weakness continues. During a market correction, it’s essential to focus on quality, and NVDA and CRWD are the definitions of high-quality. Both companies are leaders in their respective industries, they continue to gobble up market share, and they both have powerful earnings growth rates heading into FY2022. Therefore, I believe investors should keep both stocks at the top of their shopping lists. While I’m not in a rush to buy either name just yet, I believe these are two stocks investors should keep a close eye on we do start to see some real panic in the market in the coming weeks. Disclosure: I have no positions in either name currently Disclaimer: Taylor Dart is not a Registered Investment Advisor or Financial Planner. This writing is for informational purposes only. It does not constitute an offer to sell, a solicitation to buy, or a recommendation regarding any securities transaction. The information contained in this writing should not be construed as financial or investment advice on any subject matter. Taylor Dart expressly disclaims all liability in respect to actions taken based on any or all of the information on this writing. Want More Great Investing Ideas? 7 Best ETFs for the NEXT Bull Market Is the Stock Market Correction Over? Chart of the Day- See the Stocks Ready to Breakout NVDA shares were trading at $501.75 per share on Thursday morning, up $16.80 (+3.46%). Year-to-date, NVDA has gained 113.53%, versus a 2.27% rise in the benchmark S&P 500 index during the same period."}]}