{"article": [{"url": "https://stocknews.com/news/sne-atvi-spot-roku-4-entertainment-stocks-to-add-to-your-portfolio/", "published": 1597406900.0, "headline": "4 Entertainment Stocks to Add to Your Portfolio", "body": "The entertainment industry has been very lucrative for investors right now. When the economy went into a total lockdown, a majority of American households directed their home spending broadly into two categories: Staples and Entertainment. According to a survey conducted by Deloitte during May, about four-fifth of US consumers have a streaming video subscription, which is higher than the pre-pandemic ratio. School closures, shelter-in-place guidelines, and rising unemployment have given people more time to engage in social viewing, live streaming, and watching first-run movies on various over-the-top (OTT) media services. Consequently, the “new normal” witnessed a massive spike in demand for movies and music streaming apps, television shows, online gaming, rentals of digital titles, and related activities. Due to this trend, entertainment stocks like Sony Corporation (SNE), Activision Blizzard, Inc (ATVI), Spotify Technology S.A. (SPOT), and Roku, Inc. (ROKU) have been thriving amid the pandemic; and the momentum for their stocks should continue. 7 \"SAFE HAVEN\" Dividend Stocks for Turbulent TimesSony Corporation (SNE) SNE designs, develops, produces, and sells electronic equipment, instruments, and devices for the consumer, professional, and industrial markets worldwide. The company distributes software titles and add-on content; network services related to game, video, and music content; and game consoles, software, and peripheral devices. SNE also produces and distributes recorded music and animation titles. In addition, the company offers live-action and motion picture movies, TV series, game shows, television movies and miniseries, and digital networks. SNE has recently acquired a minority stake in Epic Games, Inc., a forefront game engine developer, to evolve its digital ecosystem and create unique experiences for consumers. The company’s fiscal first quarter revenues rose 2.2% year-over-year to $18.3 billion. The upside was driven by increases in Game & Network Services (G&NS) and Financial Services segment sales, both soaring 32.5% year-over-year. SNE also generated $1.17 billion of net cash from operating activities. Net income for the quarter increased by 53% year-over-year to $2.17 billion. EPS for the quarter stood at $1.74. The consensus estimate for the current year EPS is $4.23 while revenues are expected to reach $79.25 billion for the year. SNE is presently trading at $82.67, gaining 43.5% year-to-date. The stock hit a 52-week low of $50.94 in March and has recovered more than 62% since then. How does SNE stack up for the POWR Ratings? A for Trade Grade A for Buy & Hold Grade A for Peer Grade B for Industry Rank A for Overall POWR Rating. You can’t ask for better. It is ranked #1 out of 20 stocks in the Entertainment – Media Producers industry. Activision Blizzard, Inc (ATVI) ATVI is an interactive entertainment company that develops and publishes online, personal computer (PC), video game console, handheld, mobile, and tablet games worldwide through retail and digital channels; including subscription, full-game, and in-game sales, as well as licensing software to third-party or related-party companies. It also offers downloadable content. It serves retailers and distributors in the Americas, Europe, the Middle East, Africa, and the Asia Pacific. The company recently reported excellent second-quarter results. ATVI’s revenue increased 38% year-over-year to $1.9 billion. Digital revenue accounted for 82% of total revenues. Net income for the quarter stood at $580 million, up 77% from $328 million in the comparable quarter last year. Moreover, cash flow from operations stood at $768 million, and free cash flow for the firm increased 494% year-over-year to $755 million. ATVI has an impressive earnings surprise history with the company beating consensus EPS estimates in each of the trailing four quarters. EPS for the last quarter of $0.97 beat the consensus estimate by 42.6%. Furthermore, EPS for the next quarter is estimated to be $1.06, and revenue for the next quarter is expected to be $2.58 billion. The company has announced the issuance of $2 billion worth of senior notes to improve its liquidity. ATVI is currently trading at $81.29, a 7% discount from its 52-week high of $87.73. The stock has gained 37% year-to-date. ATVI’s POWR Ratings reflect this promising outlook. It has an overall rating of Buy” with a grade of A for Trade Grade. Among the 13 stocks in the Entertainment – Toys & Video Games industry, it’s ranked #1. Spotify Technology S.A. (SPOT) SPOT is a digital music-streaming service provider that gives on-demand access to songs on devices, computers, mobiles, tablets, and home entertainment systems. Its services allow subscribers to search and discover music collections, build a personal collection playlist, and share music over social media. It operates through two segments — Premium and Ad-Supported. It also provides unlimited online access to its catalog of podcasts to its subscribers. The company has over 299 million active users including 138 million premium subscribers. SPOT has recently launched its service in 13 new markets across Europe including Russia, expanding its reach to a total of 92 countries worldwide. Moreover, it has entered into a multi-year agreement with Universal Music Group (UMG), a global music corporation, to improve user experience and further advance its industry position. SPOT recently posted strong financial results for its second fiscal quarter. Total revenue grew 13% year-over-year. Premium subscription revenue contributed 93% to the overall revenue, rising more than 17% year-over-year as the company added more than 14 million new users in the quarter. While the revenue for the current quarter is estimated to grow by 20%, the street expects the EPS to grow 167% per year over the next five years. SPOT is trading at a 15% discount from its 52-week high of $299.67. The stock has gained 69% year-to-date. SPOT is rated a Buy in our POWR Ratings system, consistent with its growth estimates. It also has a grade of A for Peer Grade, and a grade of B for Trade Grade. It is ranked #1 out of 11 stocks in the Entertainment – Radio industry. Roku, Inc. (ROKU) ROKU offers a streaming platform for delivering entertainment to customers. The company operates in two segments — Platform and Player. Its platform allows users to discover and access various movies and TV episodes, as well as live sports, music, news, and others. The company also offers a Roku software developer kit that enables developers to build a channel that streams their content through the ROKU device. It provides its product and services through retailers and distributors, as well as directly to customers through its e-commerce website. The company has recently reported impressive second quarter results highlighted by exceptional account growth. Net revenue grew by 42% year-over-year to $356 million and its Platform segment revenue increased 46% year-over-year to $245 million. Gross profit was up 29% year-over-year to $147 million. Cash flow from operations stood at $34 million whereas free cash flow for the firm grew 131% year-over-year to $15.4 million. Average Revenue Per User (ARPU) stood $24.92, up 18% year-over-year. Furthermore, ROKU added 3.2 million incremental accounts in the previous quarter to reach 43 million active users. The revenue for the current quarter is expected to grow 39% year-over-year to $362.9 million. EPS is estimated to grow by 25% next year. Moreover, ROKU delivered earnings surprises in three of the trailing four quarters. ROKU is presently trading at $149.97, a 15% discount from its 52-week high of $176.55. The stock is already up 157% from its March lows. According to our POWR Ratings, ROKU is rated a Buy. It also has a grade of A for Trade Grade and Industry Rank. It’s ranked #11 out of 28 Technology – Hardware stocks. Want More Great Investing Ideas? 3 Possible Directions for the Stock Market from Here How to Trade THIS Stock Bubble? 9 “BUY THE DIP” Growth Stocks for 2020 SNE shares were unchanged in after-hours trading Friday. Year-to-date, SNE has gained 22.30%, versus a 5.73% rise in the benchmark S&P 500 index during the same period."}]}