{"article": [{"url": "https://stocknews.com/news/msft-amzn-aapl-fb-goog-a-pullback-in-microsoft-could-entice-price-sensitive-investors/#:~:text=A%20Pullback%20in%20Microsoft%20Could%20Occur%20Amid%20Economic%20Weakness&text=That's%20a%209.5%25%20drop%20compared,GDP%20record%20keeping%2C%20he%20added.", "published": 1596197300.0, "headline": "A Pullback in Microsoft Could Entice Price-Sensitive Investors", "body": "A Pullback in Microsoft Could Entice Price-Sensitive Investors A pullback in Microsoft could entice price-sensitive investors who may be concerned about the Redmond, Washington, computer software and systems company reporting reduced growth in its most recent quarterly results. Even though the company remains one of the world’s top technology organizations, the lofty price-to-earnings (P/E) valuation ratio of 34.8 for Microsoft (NASDAQ:MSFT) may lead to a further drop in its share price that ultimately could hit a level when wary investors might be swayed to buy again. Microsoft’s reduced growth during its fiscal fourth quarter that ended on June 30 deflated some of the stock’s appeal, despite the company announcing strong profits and revenues. 7 \"SAFE HAVEN\" Dividend Stocks for Turbulent TimesAs much as Microsoft is respected as a leader and innovator in its various niches, cautious investors may prefer to see its share price retreat before starting to bid it upward again amid the economic contraction due to the ongoing COVID-19 crisis. Even so, Microsoft’s fiscal fourth-quarter financial results beat analysts’ consensus estimates for both earnings per share (EPS) and revenues. A Pullback in Microsoft Occurred After the Company Announced Slowing Growth The company’s EPS in its fiscal fourth quarter reached $1.46, compared to $1.34 consensus estimates of analysts, while revenues climbed to $38.03 billion, topping expectations of $36.54 billion. However, Microsoft also reported slightly slowing revenue growth of 50% in constant currency for its Azure product segment that offers a set of cloud services to help organizations meet their business challenges to build, manage and deploy applications on a global network. The company falling short of modestly higher growth than analysts projected helped to convince Oppenheimer analyst Timothy Horan to cut his rating on Microsoft to “perform” from “outperform” on July 23, the day after the software provider released its latest financial results. He cautioned that slowing growth in Microsoft’s cloud business would boost competition and expenses. Such a move may signal weakening growth for cloud services as enterprises cut information technology (IT) budgets and as small business (SMB) churn increases due to the recession, he wrote in a research note. The downgrade in Oppenheimer’s rating of Microsoft also factored in the valuation of the software company hitting all-time highs, he added. Consensus analysts’ average price target increased 3.2% to $227.59 after Microsoft released its latest financial results. A Pullback in Microsoft Stems Partly from the Competitive Threat of Amazon Amazon Web Services, a subsidiary of Amazon.com (NASDAQ:AMZN), provides on-demand cloud computing platforms and Application Programming Interface capabilities to individuals, companies and governments on a metered, pay-as-you-go basis. Microsoft claims on its website that AWS is five times more expensive than Azure for Windows Server and SQL Server. Rarely does a company devote one of its own website pages to name a top competitor and advise customers to reject it, but Microsoft took the unusual approach of targeting Amazon Web Services directly. Microsoft is all about the cloud,” said Jim Woods, who leads the Successful Investing, Intelligence Report and Bullseye Stock Trader advisory services. “The pandemic has created a work-from-home society, and that has created greater demand for safe and secure cloud computing services such as those offered by the software giant.” Woods recommends Microsoft, which offers a current dividend yield of 1.02%, in his Prime Movers portfolio in Successful Investing, and he recently banked a 16.3% gain in the stock in his Intelligence Report Tactical Trends Portfolio. Paul Dykewicz meets with Jim Woods before COVID-19 to discuss new investment opportunities. A Pullback in Microsoft Could Occur Amid Economic Weakness The Commerce Department announced gross domestic product (GDP), which measures the value of all goods and services produced across the economy, fell at a seasonally and inflation-adjusted 32.9% annual rate in the second quarter, Woods wrote to his Intelligence Report members on July 31. That’s a 9.5% drop compared with the prior quarter, and it’s the steepest decline in more than 70 years of the Commerce Department’s GDP record keeping, he added. Another reality check is that four giant technology stocks reported financial results after the close of trading on July 30, with Apple (NASDAQ:AAPL) and Amazon.com Inc. (NASDAQ:AMZN) notching better-than-expected performance, while Facebook (NASDAQ:FB) and Google’s parent company Alphabet Inc. (NASDAQ:GOOG) showed softening growth. Nonetheless, the next day the share prices of three of them jumped, with Apple zooming 10.47%, Amazon rising 3.70%, and Facebook climbing 8.17%, while Alphabet slid 3.17%. The previous day, each company’s chief executive officer was grilled by a Congressional committee exploring “unfair” business practices. A Pullback in Microsoft May Lead to Buying Opportunity “Results from Microsoft were baked into the stock, but results from Apple, Amazon, Google and Facebook obviously showed that one shouldn’t bet against the U.S. consumers and businesses,” said Bryan Perry, who heads the Cash Machine, Premium Income, Quick Income Trader, Hi-Tech Trader and Breakout Profits Alert advisory services. Microsoft remains the most trusted technology stock in the world, even as cloud revenues came in a “tad light,” Perry said. This also held true for Amazon and its cloud business, he added. Microsoft’s other businesses, such as Outlook 365, LinkedIn, Surface, XBox, TEAMS and the vaunted Windows 10 operating system, are “very strong, Perry said. The stock has not given investors a “decent entry point” for a while and any pullback to around $195 would be an attractive level to initiate and add to positions, he concluded. Paul Dykewicz interviews investment guru Bryan Perry at the Orlando MoneyShow. Reduced Growth May Cause a Pullback in Microsoft But Microsoft’s high P/E valuation of 34.80, compared to an estimated NASDAQ P/E of 22.17, raises questions about whether the wide spread is justifiable for investors who are concerned about overpaying for growth. In a zero-interest-rate environment, Microsoft’s share price peaked at 37 times forward earnings and eight times its revenue. “That’s the kind of valuation that makes traditional investors nervous,” said Hilary Kramer, host of a national radio program called “Millionaire Maker.” Columnist and author Paul Dykewicz interviews money manager Hilary Kramer, whose premium advisory services included 2-Day Trader, IPO Edge, Turbo Trader, High Octane Trader and Inner Circle. But in a world where leverage is cheap and growth is scarce, a little hope goes far, said Kramer, who leads the Value Authority and GameChangers advisory services. While the quarantines slowed Microsoft, do not expect earnings deterioration, she added. Microsoft’s management affirmed guidance for earnings growth of about 7% in the coming year. Compared to the S&P 500, where profit contracted 44% last quarter, and may end 2020 with a 20% drop, dividend-paying Microsoft stands out, Kramer continued. “Everything else being equal, I’d rather own Microsoft than the S&P 500 as a whole,” Kramer said. “However, the time to buy in was when the stock had been beaten down to $135 just four months ago. At the bottom, mighty Microsoft was available for only 23 times earnings. This was clearly a bargain that Wall Street couldn’t ignore.” Chart Courtesy of www.StockCharts.com A Pullback in Microsoft Accompanies Eroding Market Share, Analyst Says Andrew Nowinski, an equity research analyst with D.A. Davidson, cautioned that Microsoft perennially loses market share in the cybersecurity niches of email, identity and endpoint security where it operates. The company is more focused on fixing “vulnerabilities” in Windows, which is a “huge source of breaches,” than in providing a best-in-class solution in any of those three areas, he added. Pension fund Chairman Bob Carlson answers questions from Paul Dykewicz during an interview before social distancing became the norm after the outbreak of COVID-19. Bob Carlson, leader of the Retirement Watch investment newsletter and chairman of the Board of Trustees of Virginia’s Fairfax County Employees’ Retirement System with more than $4 billion in assets, said he likes Microsoft long term. The company has a dominant Windows operating system and its office software is akin to operating a growing utility that is likely to provide “steadily increasing cash flow” for a long time, he added. “The company also is growing in cloud services and other enterprise services,” Carlson said. “It is well behind the market leaders but it’s offerings are solid and attract new customers.” However, Carlson expressed concerns about Microsoft in the short term because it had risen so much already this year. He mentioned putting it on a watch list and waiting to buy it at a lower price than where it is trading now. A Pullback in Microsoft Includes Many Other Companies Carlson wrote to Retirement Watch subscribers on July 30 that the major U.S. stock indexes were either flat or slightly higher between June 8 and July 20. During that period, a few large companies, mostly in the technology arena, continued to rise while many others faltered. The average stock declined about 5.7% during this period, according to Bespoke Investment Group. Smaller company stocks, value stocks and high dividend stocks performed the worst. During that same period, the 50 largest stocks in the S&P 500 rose 2.53%, while the 50 smallest stocks fell 20.35%. The market might have started a new rotation on July 20, since the 50 largest stocks in the S&P 500 dipped 0.67% through July 30, while the 50 smallest stocks rose 1.5%, according to Bespoke. Value stocks and high-dividend stocks gained 1% or more during this period. The COVID-19 crisis has caused 17,406,644 cases and 675,213 deaths globally, along with 4,541,016 cases and 152,922 deaths in the United States, as of July 31. America has more cases and deaths of any other nation, including China, where COVID-19 first arose. Microsoft is a computer software colossal that is starting to show signs of slowing growth while facing heightened competition from rivals. Patient investors who are willing to wait for pullbacks may find a chance to buy at more modest valuations than the level of a cloud. “Want More Great Investing Ideas?” Click the links below. Dr. Mark Skousen, world-renowned investment advisor and economist, just released his Top 3 Dividend Plays that are set to skyrocket. Click here now to find out what they are, and how you too can cash in from this profit bonanza. A devastating new law has paved the way for the IRS to confiscate up to 30% of your retirement funds. Bob Carlson, America’s foremost retirement expert, will show you how to protect your hard-earned nest egg, and keep these damning new rules at bay. Click here now to learn more. MSFT shares rose $1.29 (+0.63%) in after-hours trading Friday. Year-to-date, MSFT has gained 30.72%, versus a 2.56% rise in the benchmark S&P 500 index during the same period."}]}