{"article": [{"url": "https://stocknews.com/news/btg-gold-nem-3-gold-stocks-to-buy-after-recent-retreat/", "published": 1598098100.0, "headline": "3 Gold Stocks to Buy After Recent Retreat", "body": "Three gold mining stocks fell in price enough recently to go on sale for prospective buyers who had been on the sidelines and now want another chance to buy shares in any or all of the positions at a discount. Gold experts tell me that the slide is not surprising after the yellow metal became one of the fastest-rising investments so far this year with a 27.26% gain. With federal deficits on the ascent and talk by the leading presidential candidate Joe Biden about carrying out hefty tax hikes, gold could receive further support for its climb in the months ahead. The price of gold recently hit an all-time high and experts predict further gains remain ahead, even though they consolidated in the past week. The outlook for the three gold stocks to buy on sale is positive for investors seeking a refuge from the falling U.S. dollar, inflationary federal spending and the growing threat of huge tax hikes if Democrats win the next election and take control of the White House and Congress. 7 \"SAFE HAVEN\" Dividend Stocks for Turbulent TimesGold has risen 4.68% during the past week after slipping to $1,944.00 at the close of trading on Friday, Aug. 14, then rising to $2,035.00 through trading on Aug. 21. However, the price could climb further soon, market followers predict. Descendant of Benjamin Franklin Profits from One of Three Gold Stocks to Buy The interest in gold is fueled by the most aggressive monetary and fiscal policies since 2008, said Mark Skousen, PhD, a Presidential fellow at Chapman University who also leads the Forecasts & Strategies investment newsletter. He currently is recommending B2Gold Corp. (BTG, $6.28, 1.2% yield), a mid-tier Canadian gold mining company. (Chart Courtesy of www.stockcharts.com) The gold mining company reported record revenues and cash flow for the second quarter of 2020, led by sales increase of 65% from the same period last year to reach $445 million. B2Gold is on target to produce more than one million ounces of gold in 2020, Skousen continued. The stock briefly topped $7 a share before it pulled back when a political coup occurred in the West African nation of Mali, where BTG’s Fekola mine is based. President Ibrahim Boubacar Keita resigned and dissolved parliament hours after soldiers detained him at gunpoint in an unexpected move to seize power. Despite the share price slipping in recent days, B2Gold officials stated that the company’s operations are continuing normally. Despite the deepening political crisis in that West African nation, B2Gold has not lost any operational efficiency at its Fekola mine. Plus, the Malian government owns a 20% stake, so it has a financial interest in preserving continued operation of the mine, as well as the safety of employees. Because the government is a major shareholder, Skousen said production is expected to continue in Mali. But the political risk remains. (Mark Skousen, a descendant of Benjamin Franklin, meets with Paul Dykewicz. Skousen’s premium investment services consist of Home Run Trader, Five Star Trader, TNT Trader and Fast Money Alert.) Barrick Gold Joins the List of Three Gold Stocks to Buy on Sale Toronto-based Barrick Gold Corp. (NYSE: GOLD), the world’s second-largest gold mining company, produced a 38% gain in the stock and 213% profit in the call options in less than two months as a recommendation in the Five Star Trader advisory service. Barrick Gold turned into a top-performing recommendation in the trading service co-led by stock picker Jim Woods, also heads the Successful Investing, Intelligence Report and Bullseye Stock Trader advisory services, and Skousen, whose accomplishments include becoming recipient of the inaugural Triple Crown in Economics in 2018 and ranking as one of the 20 most influential living economists. (Paul Dykewicz meets with Jim Woods before COVID-19 to discuss new investment opportunities.) Barrick Gold has more than doubled in price in the past year, beating the SPDR Gold Shares fund (NYSE:GLD), the NASDAQ Composite and the S&P 500. The company has $3.3 billion in cash as a financial cushion to back its $5.5 billion in long-term debt. In addition, Barrick Gold last year produced 5.5 million ounces of gold, achieved profit margins above 40% and earned $4 billion on revenues of $9.7 billion. Wall Street has taken notice, with TD Securities raising its rating of Barrick Gold to a “buy” on April 1, when the brokerage set a price target of $28. Another upgrade occurred on March 26 when Deutsche Bank initiated a “buy” on Barrick Gold and gave the stock a price target of $25. GOLD already has surpassed both price targets in just months. (Chart courtesy of www.StockCharts.com) Newmont Ranks Among the Three Gold Stock to Buy on Sale Gold mining company Newmont Corp. (NYSE:NEM) recently reported its second quarter in a row of 20%-plus growth and money manager Hilary Kramer said it would not surprise her if that expansion rate triples by the end of the year. Yet NEM does not even trade at 27 times anticipated earnings. Aside from the defensive nature of gold, investors understandably are bidding up the share price of miners that are growing 60% this year and priced at 27 times earnings, rather than a technology company such as Microsoft with growth of 7% and trading at a lofty 38 times earnings, said Kramer, who leads the Value Authority and GameChangers advisory services. (Chart courtesy of www.StockCharts.com) “Gold stocks are collectively cheaper than the S&P 500 as a whole, Kramer said. “Unless you can find a faster-growing business at a comparable multiple, go for the gold. After all, the Fed is unlikely to quit printing money for the foreseeable future. This bullion boom has legs.” Newmont zoomed 1.99% in the last month, 51.81% for the year to date and 71.93% for the past 12 months. The gold mining company further offers a current dividend yield of 1.49% that income investors should appreciate. (Columnist and author Paul Dykewicz interviews money manager Hilary Kramer, whose premium advisory services include 2-Day Trader, IPO Edge, Turbo Trader, High Octane Trader and Inner Circle.) COVID-19 Has Not Collapsed the Three Gold Stocks to Buy on Sale The COVID-19 crisis not only has hurt the economy and indirectly aided gold prices but taken a severe human toll with 22,847,562 cases and 797,007 deaths globally, along with 5,618,133 cases and 175,245 deaths in the United States, as of Aug. 21. The novel coronavirus has caused America to report the most cases and lives lost of any nation, including China, where COVID-19 originated. Fledgling gold investors should remember that gold mining stocks do not offer the 100% protection bank deposits provide through the Federal Deposit Insurance Corporation (FDIC). That deposit insurance, which could be especially important for people who have limited savings and money to invest, tops out at $250,000 for each person per bank. The three gold stocks to buy on sale have taken a bit of a break from their upward climb but are expected to resume doing so once the market digests the news about the political coup in Mali and recent profit taking. Investors fretting about missing the earlier opportunity should not worry, since the latest pullback offers a new chance to make the move at slightly reduced prices. BTG shares closed at $6.28 on Friday, down $-0.10 (-1.57%). Year-to-date, BTG has gained 57.46%, versus a 6.56% rise in the benchmark S&P 500 index during the same period."}]}