{"article": [{"url": "https://stocknews.com/news/cgc-tlry-two-cannabis-stocks-with-cheap-options/", "published": 1597406900.0, "headline": "Two Cannabis Stocks With Cheap Options", "body": "In the past week, two cannabis names have been in focus in the wake of their respective quarterly reports. Canadian cannabis producers Tilray Inc (NASDAQ:TLRY) and Canopy Growth Corp (NYSE:CGC) had two vastly different post-earnings reactions on the charts. Below, we’ll dive into the technical setups of TLRY and CGC, as well as how options traders could be playing them. Looking first at Tilray, the stock gapped 13% lower on Aug. 11, after the company disclosed worse-than-expected second-quarter losses and revenue, with stockpiling issues stemming from pandemic-related shutdowns. TLRY is down almost 60% in 2020, and has spent the summer months trading in a tight range between the $7 and $9 levels. For perspective, the shares were trading at $46.24 a year ago to this date. 7 \"SAFE HAVEN\" Dividend Stocks for Turbulent Times In the options pits, calls are extremely popular. In the past 10 days, 87,998 calls have been exchanged at the International Securities Exchange (ISE), Cboe Options Exchange (CBOE), and NASDAQ OMX PHLX (PHLX), compared to only 15,275 puts. The resultant call/put volume ratio of 7.84 sits in the elevated percentile of its annual range, suggesting a healthier-than-usual appetite for bullish bets of late. However, considering a healthy 18.8% of TLRY’s total available float is sold short, it’s possible some of this call buying could be shorts seeking an options hedge against any unexpected upside. Turning to Canopy Growth, the stock gapped higher by 7.8% on Monday, after the company reported smaller-than-expected fiscal first-quarter losses. A solid restructuring plan and boosted demand during lockdown measures helped offset the coronavirus impact. Unlike its more stagnant sector peer, CGC has tacked on 24.4% in the last three months, with support emerging at its ascending 80-day moving average. Nevertheless, one year ago today, the shares were trading at $34.34. In CGC’s options pits, it’s a similar setup as TLRY. ISE/CBOE/PHLX data shows in the past 10 days, 55,657 calls have exchanged hands on the International Securities Exchange (ISE), Cboe Options Exchange (CBOE), and NASDAQ OMX PHLX (PHLX), compared to 7,099 puts. And while short interest has fallen off by 10% in the most recent reporting period, the 19.82 million shares sold short still accounts for almost 25% of CGC’s total available float. It appears short sellers could also be using calls here to hedge their bearish bets. What’s another connecting thread between the two cannabis companies? They both sport attractively priced premium. TLRY and CGC’s Schaeffer’s Volatility Indexes (SVI) of 73% and 61%, respectively, both sit lower than the bottom 10th percentile of readings from the past year. Keeping track of the week’s stock market activity is no easy feat. Our Schaeffer’s Market Mashup podcast gives you a quick 15-minute look at hot-button investing news and trends, as well as interviews with analysts and traders to help you craft a rock-solid options strategy. Tune into the latest episode of Market Mashup to up your investment game. CGC shares were unchanged in after-hours trading Friday. Year-to-date, CGC has declined -18.49%, versus a 5.73% rise in the benchmark S&P 500 index during the same period."}]}