{"article": [{"url": "https://stocknews.com/news/gld-gfi-kgc-aem-gss-4-top-gold-miners-for-august/", "published": 1597147700.0, "headline": "4 Top GOLD MINERS for August", "body": "Gold has been one of the strongest assets in the past couple of years. The primary driver of gold has been lackluster economic growth which has resulted in interest rates plunging. In October 2018, the 10-year Treasury note was yielding above 3%, and today, it’s at 0.65%. 7 \"SAFE HAVEN\" Dividend Stocks for Turbulent TimesGiven the Fed’s determination to support the economy, Congress experimenting with more direct and aggressive forms of fiscal stimulus, and the continued economic challenges stemming from the devastation of the coronavirus, it’s likely that interest rates will remain depressed for the foreseeable future. If gold gains, then gold mining stocks will also be big winners as their earnings and assets increase in value with gold. In recent days, gold prices have declined by 7%, while gold miners are down between 10 and 20%. This is the first major dip in the last couple of months. It could be an opportune time to buy Aginco Eagles (AEM), Gold Fields (GFI), Kinross (KGC), and Golden Star (GSS) which are four of the highest-quality gold miners. Agnico Eagles Mines Ltd. (AEM) AEM focuses on acquiring, developing, and mining mineral properties in the United States, Europe, Canada, and Latin America. The company is currently looking at expanding its operations in Finland by investing, around €160-million. It has already received the Government permit for the proposed expansion. Despite the mining constraints imposed by the spread of the pandemic, AEM has managed to improve its revenue by 5.8% in the second quarter of the year. AEM’s earnings surprise history is impressive as well with the stock beating street EPS estimates in three of the trailing four quarters. AEM has added close to 130% to its stock price since this year’s low of $35.02 hit on March 18th due to the virus-driven market crash. How does AEM stack up for the POWR Ratings? A for Trade Grade A for Buy & Hold Grade A for Peer Grade A for Industry Rank A for overall POWR Rating You can’t ask for better. The stock is also ranked #4 out of 30 stocks in the Gold – Miners industry. Gold Fields Limited (GFI) GFI focuses on the acquiring, extraction, processing, and smelting of gold and copper properties in Australia, Peru, Ghana, and South Africa. The company has been modernizing its operations and has added renewable energy capabilities in its Agnew Gold Mine in Western Australia. Even though mining operations suffered due to the lockdowns, the company stated that the overall negative effect from the coronavirus has been very limited. The company stated that its half-year profits could nearly triple due to the rallying of gold prices. GFI is set to declare its quarterly results later this month, but the stock price has already risen in anticipation of a solid performance by the company. GFI’s stock has soared more than 200% from the year-to-date low it hit in mid-March due to the overall dip in the market. The company’s strong recovery could be part of a growth momentum that could last well for the rest of 2020. It’s no surprise that GFI is rated “Strong Buy” in our POWR Ratings system. It also has an “A” for Trade Grade, Buy & Hold Grade, Peer Grade, and Industry Rank. In the 30-stock Gold – Miners industry, it is ranked #6. Kinross Gold Corporation (KGC) KGC has operations and mining properties in the United States, Ghana, Russia, Brazil, Chile, and Mauritania. The company has recently released its pre-feasibility study of its Lobo-Marte project in Chile. This project could lead to an almost 25% increase to the 2019 year-end mineral reserve estimates of the company. Even though the company’s operations were impacted by the pandemic, the rise in gold prices has more than offset the negatives. For the second quarter ended June 30th, the company reported a rise in revenue of 20% compared to the same period in 2019. The earnings surprise history for KGC looks pretty good, as the company beat or met the consensus EPS estimates in each of the trailing four quarters. KGC’s price performance reflects its ability to capitalize on the recent rally in gold prices. The stock has gained more than 130% since hitting a year-to-date low in mid-March. KGC’s strong fundamentals are reflected in its POWR Ratings, it has a “Strong Buy” rating with an “A” in Trade Grade, Peer Grade, Buy & Hold Grade, and Industry Rank. Within the Gold – Miners group, it’s ranked #7 out of 30 stocks. Golden Star Resources (GSS) GSS is a gold exploration and mining company with operations in Ghana, West Africa. The company has recently signed an agreement to sell 90% percent of its interest in the Bogoso-Prestea Gold Mine in Ghana for a total consideration of $95 million. This move will help bolster the company’s balance sheet and help it quicken the growth and development of the Wassa mine. For the quarter ended June 30th, the company has declared an income of more than $13 million compared to a loss incurred a year ago. The company has also managed to increase its gold production on a year-over-year basis, despite the challenges brought by the pandemic. GSS has also been performing pretty well. The stock has soared more than 120% since this year’s low of $1.85 it hit on March 16th due to the virus-driven market crash. It’s no surprise that GSS is rated “Strong Buy” in our POWR Ratings system. It also has an “A” for Trade Grade, Buy & Hold, Peer Grade, and Industry Rank. In the 30-stock Gold – Miners industry, it is ranked #14. Want More Great Investing Ideas? 9 “BUY THE DIP” Growth Stocks for 2020 How to Trade THIS Stock Bubble? 7 “Safe-Haven” Dividend Stocks for Turbulent Times GLD shares . Year-to-date, GLD has gained 25.92%, versus a 4.46% rise in the benchmark S&P 500 index during the same period."}]}