{"article": [{"url": "https://stocknews.com/news/ups-expd-fdx-3-freight-stocks-that-keep-moving/", "published": 1594901300.0, "headline": "3 Freight Stocks That Keep \"Moving\"", "body": "Freight companies are companies that specialize in moving freight or cargo from one place to another. While this industry was initially hit by the coronavirus pandemic, the boost in e-commerce sales helped the freight industry get back on its feet. The coronavirus changed how people shopped as many people were in lockdown at their homes. This created a surge in online shopping which created revenue opportunities for freight companies. By investing in these stocks, you can profit off this trend in the transportation sector. Here are three freight stocks worth a look. United Parcel Service, Inc. (UPS) 7 \"SAFE HAVEN\" Dividend Stocks for Turbulent TimesUPS has been focusing on strategic growth imperatives in health and e-commerce. The package delivery company is building capacity where required and ensuring the functioning of critical supply chains. UPS’s B2C deliveries constituted 70% of the total delivery volume at the end of March. UPS recently announced a partnership with Yotpo, an e-commerce marketing platform for its Customer Technology Program (CTP). This partnership will provide shipping and marketing tools that will help Small & Medium businesses compete and improve their operations. The growing demand for e-commerce due to the pandemic has helped UPS significantly. Furthermore, TuSimple, along with UPS and McLane, recently launched a self-driving freight network that should operate nationwide by 2024. UPS expects to reduce cash use by nearly $1.8 billion in 2020 by suspending share buybacks and reducing capex without compromising on automation targets. This should bode well for the company from a liquidity perspective. In the first quarter, total revenue increased by 5.1% and average daily package volume increased by 6.9% year-over-year. The stock recovered more than 35% since its 52-week low of $82.00 on March 12th due to the pandemic-led market crash. How does UPS stack up for the POWR Ratings? A for Trade Grade A for Buy & Hold Grade B for Peer Grade B for Industry Rank A for Overall POWR Rating The stock is also ranked #1 out of 9 stocks in the Air Freight & Shipping Services industry. Expeditors International of Washington, Inc. (EXPD) EXPD is a global logistics service company. Governments have designated EXPD as an essential business during these uncertain times because of its important role in supply chain operations worldwide. In May this year, EXPD announced its acquisition of Fleet Logistics’ Digital Platform, which will help the company focus on digital solutions and will provide support to EXPD’s online Less Than Truckload (LTL) Freight shipping platform Koho. EXPD continues to operate with its credit control and collection monitoring procedures to limit credit losses. Moreover, EXPD has an impressive earnings surprise history with the company beating consensus EPS estimates in three of the trailing four quarters. Also, EXPD has a dividend yield of 1.33% and a payout ratio of 31.5%. Since its 52-week low of $52.55 in March, EXPD has recovered more than 20%. It’s no surprise that EXPD is rated “Strong Buy” in our POWR Ratings system. It also has an “A” for Trade Grade, Buy & Hold Grade and Peer Grade, and a “B” for Industry Rank. In the Air Freight & Shipping Services industry, it is ranked #2. FedEx Corporation (FDX) FDX provides a broad portfolio of e-commerce, transportation and business services to customers, and businesses worldwide. Although commercial volumes have been reduced significantly due to closure of global businesses, there was increased revenue per shipment at FedEx freight, strong residential delivery volume growth at FedEx ground, lower variable incentive compensation expenses, and a favorable net impact of fuel, which helped offset the negatively affected operating results. FDX’s investments in e-commerce will help increase its margin in the future. On May 18th this year, FDX announced a multi-year collaboration with Microsoft powered by Azure and Dynamics 365 to transform the commercial experience and help businesses compete in today’s digital network. FDX has recovered quickly and grown close to 80% since hitting its 52-week low of $88.69 on March 17th. The consensus revenue estimate of $17.39 billion for the current quarter indicates an increase of 2% over the year-ago number. For the fiscal fourth quarter ended May 31st, FDX’s actual EPS surpassed its consensus estimate by 66.4%. FDX’s POWR Ratings reflect a promising outlook. It has an overall rating of “Buy” with an “A” for Trade Grade and a “B” for Buy & Hold Grade, Peer Grade, and Industry Rank. In the Air Freight & Shipping Services group, it’s ranked #3. Want More Great Investing Ideas? 9 “BUY THE DIP” Growth Stocks for 2020 Newly REVISED 2020 Stock Market Outlook 7 “Safe-Haven” Dividend Stocks for Turbulent Times UPS shares were trading at $119.39 per share on Thursday afternoon, up $0.18 (+0.15%). Year-to-date, UPS has gained 4.08%, versus a 0.52% rise in the benchmark S&P 500 index during the same period."}]}