{"article": [{"url": "https://stocknews.com/news/crwd-docu-work-zm-are-these-3-work-from-home-stocks-a-buy-sell-or-hold/", "published": 1599134900.0, "headline": "Are These 3 Work-from-Home Stocks a Buy, Sell or Hold?", "body": "Work-from-home stocks have been some of the most popular stocks during this recent rally, as the coronavirus pandemic forced people to work remotely. Stocks that have benefited from this trend have soared over the past five months. For instance, Zoom Video Communications (ZM), founded in 2011, has become a household name due to its widespread use in corporate meetings and friendly online get-togethers. The stock reported its latest financial results on Monday and outperformed analysts’ expectations in earnings and revenue. Its price shot up 40.8% the next day. This had led to investors placing bets on companies that may offer similar profit potential. There are many more work-from-home companies reporting financial results this week and next, so I thought it was an excellent time to evaluate stocks that have benefited from the pandemic. While the market has trended downward since yesterday afternoon, many of these stocks are still priced high based on the anticipation of their financial results. I choose three well-known work-from-home stocks that have reported or will report their financial results within a week. To determine if each stock is a Buy, a Sell, or a Hold, I evaluated their business models and where each stands in terms of growth, valuation, momentum, and profitability. 7 \"SAFE HAVEN\" Dividend Stocks for Turbulent TimesHere are three stocks that have benefited from a digital transformation in the workplace: CrowdStrike Holdings (CRWD), DocuSign (DOCU), and Slack Technologies (WORK). CrowdStrike Holdings (CRWD) CRWD is a cybersecurity vendor specializing in endpoint protection, threat intelligence and hunting, attack remediation, and offers various solutions to supplement security and network operations teams. Its cloud-based architecture collects data across endpoint agents, analyzes the information within its cloud platform, and then updates its customers. The company sells packaged tiers of cybersecurity protection and offers individual security modules via its online marketplace. The company reported earnings per share yesterday of $0.03 compared to the consensus estimate of $0.01. The stock is down 9% today because it had run up 45% over the past three weeks in anticipation of the report. Revenue came in at $198.97, which was 84% higher than a year ago. The company’s subscription revenue was $184.3 million, up 89%. The company also raised its outlook for the January 2021 fiscal year. The pandemic has sped up the digital transformation for companies, and CRWD is benefiting. As more companies adopt cloud-based services, security will be of the uttermost importance. This will continue to create demand for the company in the future. In terms of valuation, the company is overvalued with a price to sales ratio of 49.8. The industry average is 9.6. CRWD is showing revenue growth as of its most recent report, and it forecasts higher revenue growth in the future. The company has negative profitability figures with a return on equity of -17.9 and a return on invested capital of -53.8%. With strong recent performance, aside from today, the company is showing robust momentum. Taking all these factors into consideration, I rate CRWD as a Hold. The company had a strong quarter, but its valuation is too steep to award it a Buy. DocuSign (DOCU) DOCU is a software company that provides e-signature solutions. It offers the Agreement Cloud, a broad cloud-based software suite that enables users to automate the agreement process and legally bind e-signatures from nearly any device. DocuSign also helps companies securely collect information and payments, automate workflows, and transact anything, anywhere, on any device. With over 200 million users, the company is considered a leader in its market. The company was down 8.7% for the day due to a broad-based tech sell-off. It reported its latest financial results after the close with total revenue of $342.2 million, which was up 45% year-over-year and well above Wall Street estimates. The stock is up slightly in after-hours trading. Like other work-from-home companies, it has seen a surge in new customers and increased usage with existing customers. Its Agreement Cloud offering should continue to grow into next year as people continue to work remotely. As the company has an entrenched leadership position in e-signatures, DOCU should see its revenue continue to grow. Also, its offerings should continue to expand beyond signatures. The stock has seen strong momentum, with a year to date return of 226.6%. Similar to CRWD, its valuation figures are quite high. It has a price to sales ratio of 41.1 and a price to book ratio of 85.3. Its profitability numbers are not great either, with a return on equity of -40.2% and an operating margin of -18.2%. While I believe this company has a bright future ahead, the valuation is too high to award it a Buy, so I rate it a Hold for now. Slack Technologies (WORK) WORK operates Slack, a software-as-a-service platform that brings together people, applications, and data. The platform is used by all business types, from small and medium-size businesses to enterprise customers. The platform offers chat, file sharing, video calls, and more. The company views Slack as a replacement for email. The product operates as a freemium model, whereby the software is available to download for free on the company website. Users can then upgrade to different tiers on the platform for more features. While the company doesn’t report its latest financial results until Tuesday, the stock was up 20.9% from August 17th to September 1st in anticipation of its earnings report. It was down 7.9% today as part of the tech sell-off. The company had a decent first quarter as it beat analyst expectations in both earnings and revenue. Both figures were significant increases over the year-ago numbers. The company so far has an impressive conversation rate on its platform. The stock has seen solid momentum, but not as strong as the other stocks on this list. Its valuation figures are more down to earth than CRWD and DOCU, but still quite elevated. WORK has a price to sales ratio of 25.0 and a price to book ratio of 21.2. The company has a 1-year sales growth rate of 37.4% and a projected rate for the next year of 30.8%. Its metrics are very low terms of profitability, with a negative return on equity (-74.3%) and a negative return on invested capital (-73.9). The company has a strong product in its Slack platform but doesn’t offer any other products to diversify its offerings. With a high valuation and a limited product offering, I rate the stock a Sell for now. Want More Great Investing Ideas? 7 Best ETFs for the NEXT Bull Market Beware Stocks in September? 9 “BUY THE DIP” Growth Stocks for 2020 CRWD shares fell $3.75 (-2.90%) in after-hours trading Thursday. Year-to-date, CRWD has gained 159.17%, versus a 8.42% rise in the benchmark S&P 500 index during the same period."}]}