{"article": [{"url": "https://stocknews.com/news/rock-regi-grvy-3-exciting-small-cap-stocks-for-the-rest-of-2020/", "published": 1602158900.0, "headline": "3 EXCITING Small-Cap Stocks for the Rest of 2020", "body": "Small cap stocks have been out of favor, as they are more vulnerable to the economy slowing with the decrease in economic activity due to the pandemic. They have smaller balance sheets so have a smaller margin of error to withstand tough economic conditions. Small caps tend to outperform during periods of accelerating economic growth. And, there is some hope that this could happen as the economy continue to recover Additionally, various government stimulus packages are expected in the coming months that would benefit small businesses. In recent weeks, the iShares Russell 2000 ETF (IWM) has been outperforming in anticipation of an agreement on a stimulus deal. Gibraltar Industries, Inc. (ROCK), Renewable Energy Group, Inc. (REGI), and Gravity Co., Ltd. (GRVY) are three small caps well-positioned to gain with an economic recovery and stimulus deal. 7 \"SAFE HAVEN\" Dividend Stocks for Turbulent TimesGibraltar Industries, Inc. (ROCK) ROCK manufactures and supplies building materials for the construction of renewable energy infrastructure, residential and industrial units across North American and Asian countries. It operates in three segments – Residential Products, Industrial and Infrastructure Products, and Renewable Energy. Earlier this year, ROCK acquired the assets of Delta Separations and Thermo Energy Systems for all cash transactions of $50 million and $75 million, respectively. This, combined with higher demand for building products under the new normal, accelerated ROCK’s second-quarter financials. The company’s revenue increased 8.8% year-over-year to $285.80 million in this period, while net income rose 37.2% from the year-ago value to $27.30 million. EPS increased by 36.1% from the same period last year to $0.83. The consensus EPS estimate of $0.97 for the third quarter ended in September 2020 indicates a slight improvement year-over-year. Moreover, ROCK beat the street EPS estimates in each of the trailing four quarters, which bodes well for the stock. The consensus revenue estimate of $326.67 million indicates 12.6% growth from the year-ago value. ROCK has gained more than 135% since hitting its 52-week low of $30.60 in March. The stock hit its 52-week high of $73.15 in October. How does ROCK stack up for the POWR Ratings? A for Trade Grade A for Buy & Hold Grade A for Peer Grade B for Industry Rank A for Overall POWR Rating. You can’t ask for better. It is also ranked #1 out of 33 stocks in the Industrial – Metals industry. Renewable Energy Group, Inc. (REGI) REGI develops lower-carbon transportation fuels by converting natural gas, oil and grease into advanced biofuels. Its operational segments include Biomass-based diesel, Services, Renewable Chemicals, and Corporate and other activities. REGI also extends operational management and servicing facilities to other biomass production centers. It currently owns 11 biorefineries in the United States, and 2 refineries in Germany. On October 6th, REGI announced the expansion of production capacity at its Geismar Louisiana biorefinery by 250 million gallons, thereby reaching a yearly production capacity of 340 million gallons. REGI’s production capacity increased 4% year-over-year to 132 million gallons of biodiesel and renewable diesel. Production capacity at the Geismar plant alone rose 17% from the prior year’s quarter. Gross profit and net income of $25 million and $1 million, respectively, indicate substantial gains compared to losses reported during the same period last year. However, the company’s absolute revenue declined slightly year-over-year as the demand and prices of energy remain repressed due to the pandemic. The consensus EPS estimate of $0.70 for the third quarter ended in September 2020 indicates a significant improvement over the year-ago losses. Also, REGI has an impressive earnings surprise history, as it beat the street EPS estimates in three out of trailing four quarters. REGI gained more than 280% to hit its 52-week high of $61.29 in October since hitting its year-to-date low of $16.05 in March. It’s no surprise that REGI is rated a “Strong Buy” in our POWR Ratings system, with an “A” for Trade Grade, Buy & Hold Grade, and Peer Grade. In the 60-stock Energy – Services industry, it is ranked #2. Gravity Co., Ltd. (GRVY) GRVY is an online game developer and publisher across North American and Asian countries. Its multiplayer online games are designed to support gaming consoles as well as web-based playing. It currently has five proprietary developed games. It also distributes and publishes games licensed from third parties. Headquartered in South Korea, GRVY is a wholly-owned subsidiary of GungHo Online Entertainment. GRVY has announced the launch of its next online game Ragnarok X: Next Generation in Taiwan, Hong Kong, and Macau on October 15th. GRVY’s impressive performance in the second quarter ended in June 2020 can be attributed to the rising popularity of online gaming amid the stay-at-home norms. Its total revenue increased 13.2% year-over-year to $73.68 million. Operating profit rose 25.5% from the same period last year to $13.59 million, while net profit grew 20.6% from the year-ago value to $10.91 million. GRVY has gained more than 595% since hitting its 52-week low of $21.49 in March. the stock hit its 52-week high of $150 in September. Under POWR Ratings, the company has been accorded a “B” for Trade Grade and Industry Rank. It is also ranked #5 out of 14 stocks in the Entertainment – Toys & Video Games industry. Want More Great Investing Ideas? 7 Best ETFs for the NEXT Bull Market What is the Cure for Stock Market Volatility? Chart of the Day- See Christian Tharp’s Stocks Ready to Breakout ROCK shares were trading at $72.88 per share on Thursday afternoon, up $0.40 (+0.55%). Year-to-date, ROCK has gained 44.49%, versus a 8.26% rise in the benchmark S&P 500 index during the same period."}]}