{"article": [{"url": "https://stocknews.com/news/dell-cdnss-roku-spns-4-technology-stocks-to-buy-for-september/", "published": 1598962100.0, "headline": "4 Technology Stocks to BUY for September", "body": "Tech stocks have been the big winner since the March bottom. They’ve seen revenues accelerate and their stock prices soar as they were big winners of the digital economy’s growth due to the economic shutdown. The ability of tech stocks to capitalize on changes in economic activity is evident from the 75% gain of the Vanguard Information Technology Index Fund ETF’s (VGT) since the market crash in March. Moreover, the essential nature of technology amid the pandemic has made tech stocks the “new defensive plays.” Entering September, it wouldn’t be surprising if tech stocks continued to outperform. The coronavirus crisis is far from over, and some believe the winter weather may necessitate further lockdowns. Also, slowing growth and falling interest rates have been translating into higher multiples for industries with growth potential. 7 \"SAFE HAVEN\" Dividend Stocks for Turbulent TimesHere are the four tech stocks that have huge upside potential left because of their strong fundamentals: Dell Technologies Inc (DELL), Cadence Design Systems, Inc. (CDNS), Roku, Inc. (ROKU), and Sapiens International Corporation (SPNS). Dell Technologies Inc (DELL) DELL designs, develops, manufactures, and supports IT hardware, software, and services solutions worldwide. It operates through three segments – Infrastructure Solutions Group (ISG), Client Solutions Group (CSG), and VMware. DELL currently holds 81% equity ownership interest in VMware, which is valued at more than the parent company itself. DELL has recently announced that it is planning a spin-off of this stake, which could increase the valuation of DELL by billions. This deal is expected to create additional long-term enterprise value and help DELL achieve investment-grade credit. Scheduled for September 2021, this deal is timed to limit the federal income taxation applicable, allowing DELL to retain its earnings. The company reported a top-line of $22.73 billion for its fiscal second quarter ended July 2020. DELL’s operating income increased 119% year-over-year to $1.1 billion. The quarter witnessed strength in the government sector and education, with orders rising 16% and 24%, respectively, as parents and teachers prepared for a new frontier in virtual learning. The company generated $3.3 billion as cash from operating activities. The company reported an EPS of $1.92 for the quarter, delivering an earnings surprise of 38.1%. Moreover, DELL has beaten EPS estimates in three of the trailing four quarters. EPS is expected to grow by 8.1% next year. DELL closed yesterday’s trading session at $66.08, gaining 28.6% year-to-date. The stock has recently hit an all-time high of $67.62 and has gained more than 33% in the last three months. How does DELL stack up for the POWR Ratings? A for Trade Grade A for Buy & Hold Grade A for Peer Grade A for Industry Rank A for Overall POWR Rating You can’t ask for better. DELL is also ranked #2 out of 28 stocks in the Technology – Hardware industry. Cadence Design Systems, Inc. (CDNS) CDNS provides software, hardware, services, and reusable integrated circuit (IC) design blocks worldwide. The company offers functional verification services, including emulation and prototyping hardware through three platforms – JasperGold, Xcelium, and Palladium. CDNS has recently announced the certification of the Cadence tools in Taiwan Semiconductor Manufacturing Company’s (TSMC) reference flows for advanced packaging solutions. The collaboration will enable customers to accelerate productivity through streamlined design, analysis, and verification reference flows. The recent availability of its silicon-proven Cadence UltraLink D2D PHY IP on the TSMC N7 process is also an important milestone for high-speed, advanced IP. Furthermore, the company has collaborated with Microsoft Corporation (MSFT) to reduce semiconductor design signoff schedules on the cloud. CDNS’ net revenues grew 10% year-over-year to $638 million in the second quarter ended June 2020. Its income from operations of $151 million improved 13.6% year-over-year while net income grew 22.4% to $131 million. Net cash flow from operations increased by 40.2% year-over-year to $345 million during this period. EPS for the quarter came in $0.47, implying an increase of 23.7% year-over-year and an earnings surprise of 27%. The consensus EPS estimate for the current quarter indicates an 11% growth year-over-year. Moreover, CDNS managed to beat the street EPS estimates in each of the trailing four quarters, which is impressive. Revenue for the current quarter is expected to increase 11.2% year-over-year to $641 million. As 5G is the most anticipated technology development this year, the demand for CDNS’ hardware services can skyrocket in the upcoming months. CDNS closed yesterday’s trading session at $110.91, gaining 60% year-to-date. It has recently hit a 52-week high of $113.97 and has gained more than 21% in the past three months. It’s no surprise that CDNS is rated a Strong Buy in our POWR Ratings system. It has a grade of A in Trade Grade, Buy & Hold Grade, Peer Grade, and Industry Rank. In the 28-stock Technology – Hardware industry, CDNS is ranked #4. Roku, Inc. (ROKU) ROKU offers a streaming platform for delivering entertainment to the television. The company operates in two segments — Platform and Player. It provides its product and services through retailers and distributors, as well as directly to customers through its e-commerce website. Computer Network’s (CNET) recent annual review of streaming devices resulted in top choice awards for ROKU devices in four different categories – Best Streamer Overall, Best Budget Streamer, Best Soundbar-Streaming Combo, and Best Convenience Features. Furthermore, ROKU added 3.2 million incremental accounts in the previous quarter to reach 43 million active users. The company has recently reported impressive second-quarter results with exceptional account growth. Net revenue grew 42% year-over-year to $356 million and Platform segment revenue increased 46% year-over-year to $245 million. Average Revenue Per User (ARPU) stood $24.92, up 18% year-over-year. Cash flow from operations stood at $34 million whereas free cash flow for the firm grew 131% year-over-year to $15.4 million. The company delivered a negative EPS of $0.35 for the quarter, which is an improvement of $0.1 from the quarter-ago negative EPS of $0.45. This represents an earnings surprise of 30%. EPS is estimated to grow by 25% next year. Moreover, ROKU delivered earnings surprises in three of the trailing four quarters. The revenue for the current quarter is expected to grow 39% year-over-year to $362.9 million ROKU closed yesterday’s trade at $173.48, gaining more than 29% year-to-date. It has recently hit a 52-week high of $177.54 and is up more than 58% in the past three months. According to our POWR Ratings, ROKU is a Strong Buy. It also has an A for Trade Grade, Buy & Hold Grade and Industry Rank, and a B for Peer Grade. It’s ranked #5 out of 28 Technology – Hardware stocks. Sapiens International Corporation (SPNS) SPNS is an Israel-based insurance and financial services software provider. The company offers digital insurance solutions for property and casualty, life, pension and annuity, reinsurance, financial and compliance, workers’ compensation, and financial markets. SPNS has recently entered into a definitive agreement to acquire Delphi Technology Inc., a leading vendor of software solutions for property & casualty (P&C) carriers, with a focus to expand into the North American medical professional liability markets. The company has also announced the availability of Sapiens CoreSuite for Life Insurance on Microsoft AppSource, an online cloud marketplace that provides tailored line-of-business solutions. SPNS’ net revenues grew 17% year-over-year to $93.1 million for the second quarter ended June 2020. The gross margin came in 41% while the operating income improved 31% year-over-year to $12.4 million. The company generated $14.8 million as cash from operations and grew its free cash flow by 38.6% year-over-year to $12.2 million. EPS for the quarter came in $0.26, beating the consensus estimate by 23.8%. The company also returned $6.6 million to its shareholders in the form of dividends. Furthermore, the street expects EPS to grow 20.8% in the current year and revenues to grow 16.5% in the current year. SPNS closed yesterday’s trading session at $33.54, with a year-to-date gain of 45.8%. The stock has recently hit a fresh high of $35.23 and has gained more than 42% in the last three months. SPNS’ strong momentum is reflected in its POWR Ratings, it has a Strong Buy rating with a grade of A in Trade Grade and Buy & Hold Grade, and a B in Peer Grade and Industry Rank. Within the Software – Business industry, it’s ranked #18 out of 47 stocks. Want More Great Investing Ideas? 7 Best ETFs for the NEXT Bull Market Beware Stocks in September? 9 “BUY THE DIP” Growth Stocks for 2020 DELL shares were trading at $66.19 per share on Tuesday afternoon, up $0.11 (+0.17%). Year-to-date, DELL has gained 28.80%, versus a 10.29% rise in the benchmark S&P 500 index during the same period."}]}