{"article": [{"url": "https://stocknews.com/news/pton-mnst-bned-3-stocks-to-buy-that-are-potential-takeover-targets/", "published": 1600344500.0, "headline": "3 Stocks to Buy That are Potential Takeover Targets", "body": "As the stock market moves higher, risk appetites are expanding among investors and businesses. This means there are greater chances of large acquisitions. This means that investors have another factor to consider when looking at companies. Companies can be acquired for large premiums and deliver big gains to investors in these companies. &nbsp The challenge lies in identifying companies that are legitimate takeover candidates. Below, we highlight three such companies: Monster Beverage (MNST), Peloton Interactive (PTON), and Barnes & Noble (BNED). &nbspMonster Beverage (MNST) Coca-Cola currently has around a 20% equity stake in MNST yet there are rumblings that Coca-Cola will purchase the entirety of MNST. Even if the executives at Coke don’t pull the trigger on a MNST deal, another food and beverage behemoth will consider doing so as MNST continues to expand its market share. MNST is a seemingly unstoppable behemoth. Though the market certainly has a litany of competing energy drinks, many of which taste just as good as those offered by MNST, the consumers favor MNST’s offerings. In particular, millennials and those in the Generation Z age cohort are in love with MNST beverages. Some analysts insist the Coca-Cola’s gradual investment in MNST is similar to the approach used to acquire Innocent Drinks back in 2013. That deal commenced with an 18% stake in Innocent that eventually progressed to 100% full ownership. 7 Best ETFs for the NEXT Bull MarketThe POWR Ratings system is quite complimentary of MNST, grading it with As in the Trade Grade and Buy & Hold Grade Components along with B grades in the remaining categories. MNST is ranked second of nearly 30 publicly traded companies in the Beverages category. The analysts have set a price target of $85.09 for MNST, indicating the stock is slightly underpriced. However, if rumors swirl of MNST being acquired, the stock should easily shoot through the $100 level. Even if MNST is not acquired, you should feel perfectly fine holding this elite beverage-maker in your portfolio. Peloton Interactive (PTON) There is a renewed focus on fitness now that the average person has packed on 10+ pounds as a result of an extended quarantine. Furthermore, the closure of gyms far and wide has limited opportunities for exercise. Though some gyms have reopened, many are only partially open. This means there is plenty of interest in fitness industry winners such as PTON. PTON’s primary competitor, Mirror, was acquired three months ago. Though PTON’s exercise equipment is certainly expensive, it is selling like hotcakes. The power brokers in the fitness industry have been paying close attention to PTON’s sales success. Though no specific names of potential buyers have been floated out by the media, it certainly makes sense for a larger company to make a play to scoop up PTON. As an example, a tech company such as Apple might consider bidding for PTON to implement its gadgets into PTON machines. Perhaps a company in the video game industry such as Electronic Arts (EA) would consider a PTON acquisition as an opportunity to expand its horizons to fitness-oriented interactive gaming. Barnes & Noble (BNED) Elliott Management, a British bookstore chain owner, acquired Barnes & Noble a year ago. However, Barnes and Noble Education (BNED) was not acquired in the deal. Rather, BNED spun off and even rebuffed a subsequent takeover attempt from Bay Capital Finance. BNED manages bookstores at colleges across the country and also provides a digital studying program dubbed Bartleby. BNED officially split from Barnes & Noble five years ago. BNED has a respectable Peer Grade POWR Rating Component and a ranking of 19 out of nearly 30 stocks in the Outsourcing – Education Services industry. TipRanks reports the average analyst price target for BNED is $4. If BNED reaches this price level, it will have increased in value by nearly 80%. BNED executives insist the offers from Bay Capital undervalued the company, included conditional provisions, and simply lacked credibility. BNED’s brass is adamant its transformation into a digital enterprise is largely responsible for its increase in value. The question is whether BNED’s digital offerings are even more coveted now that colleges are partially transitioning to the web. Though BNED college bookstores are either closed or only partially functional, its online business is poised to explode. It will merely take a rumor or two of a potential BNED takeover from a credible source to send this stock skyrocketing. Want More Great Investing Ideas? 7 Best ETFs for the NEXT Bull Market Is the Stock Market Correction Over? Chart of the Day- See the Stocks Ready to Breakout shares were trading at $336.54 per share on Thursday morning, down $2.28 (-0.67%). Year-to-date has gained 5.64%, versus a % rise in the benchmark S&P 500 index during the same period. PTON shares were trading at $82.38 per share on Thursday morning, down $0.21 (-0.25%). Year-to-date, PTON has gained 190.07%, versus a 5.62% rise in the benchmark S&P 500 index during the same period."}]}