{"article": [{"url": "https://stocknews.com/news/lfc-nbl-mlco-cpg-bch-top-5-large-cap-dividend-stocks-for-july-2-2020/", "published": 1593691700.0, "headline": "Top 5 Large Cap Dividend Stocks for July 2, 2020", "body": "The top winners in the large cap US dividend space for Thursday, July 2, 2020 are LFC, NBL, MLCO, CPG, and BCH. Below is a recap of how they fared. China Life Insurance Co Ltd (LFC) Daily Price Recap China Life Insurance Co Ltd is up 8.02% ($0.81) since yesterday, marking the 3rd day in a row an increase has occurred. As for how volume fared, yesterday’s volume was up 182.74% from the previous day (Tuesday), and up 153.11% from Wednesday of the week before. Here is a daily price chart of China Life Insurance Co Ltd. As for LFC’s dividend discount model value score, it is currently higher than that of approximately 30% US dividend payers. 9 \"BUY THE DIP\" Growth Stocks For 2020Make investment decisions regarding LFC using the data that counts. Learn more about POWR Ratings. Noble Energy Inc (NBL) Daily Price Recap 9.55 was the closing price of the day for Noble Energy Inc, resulting in today being one in which price moved up 7.79% ($0.69) from the day prior. The change in price came along side change in volume that was down 6.33% from previous day, but up 50.66% from the Wednesday of last week. The daily price chart of Noble Energy Inc below illustrates. Dividend investors may wish to pay attention to the annual compound dividend growth rate of dividend stocks, and for NBL, its higher than that of 13.43% of US dividend-issuing stocks. Is NBL a Buy, Hold or Sell? See the POWR Ratings now! Melco Resorts & Entertainment LTD (MLCO) Daily Price Recap Melco Resorts & Entertainment LTD came into today up 6.35% ($0.99) from the open of yesterday, marking the 4th day in a row an upward move has occurred. The price move occurred on stronger volume; specifically, yesterday’s volume was up 47.9% from the day prior, and up 53.02% from the same day the week before. The daily price chart of Melco Resorts & Entertainment LTD below illustrates. As for MLCO’s beta, it is currently lower than that of approximately 72.24% US dividend payers. Is MLCO a Buy, Hold or Sell? See the POWR Ratings now! Crescent Point Energy Corp (CPG) Daily Price Recap The back and forth price flow continues for Crescent Point Energy Corp, which started today off at 1.64 US dollars, up 5.81% ($0.09) from the day prior. The price move occurred on volume that was up 81.54% from the day prior, but down 28.41% from the same day the week before. Below is a daily price chart of Crescent Point Energy Corp. Dividend investors may wish to pay attention to the dividend discount model value score of dividend stocks, and for CPG, its higher than that of 6.14% of US dividend-issuing stocks. Make investment decisions regarding CPG using the data that counts. Learn more about POWR Ratings. Bank Of Chile (BCH) Daily Price Recap Bank Of Chile is up 5.4% ($0.99) since yesterday, marking the 2nd day in a row it has gone up. This move happened on lower volume, as yesterday’s volume was down 3.47% from the day before — and down 9.34% from the same day the week before. Below is a daily price chart of Bank Of Chile. As for BCH’s beta, it is currently lower than that of approximately 79.95% US dividend payers. What is the outlook for BCH? Use POWR Ratings for clearer insight into price direction. Want More Great Investing Ideas? 9 “BUY THE DIP” Growth Stocks for 2020 Is the Bull S#*t Rally FINALLY Over? 7 “Safe-Haven” Dividend Stocks for Turbulent Times Top 3 Investing Strategies for 2020 To further your research on dividend stocks, check out our list of dividend stocks sorted by yield. LFC shares . Year-to-date, LFC has declined -21.11%, versus a -1.99% rise in the benchmark S&P 500 index during the same period."}]}