{"article": [{"url": "https://stocknews.com/news/cat-bpl-rs-3-recently-upgraded-global-growth-stocks/", "published": 1595851700.0, "headline": "3 Recently UPGRADED Global Growth Stocks", "body": "Global growth has been slowing since 2018, but there are some signs that it’s hit a bottom, and the outlook is improving. Coronavirus case counts have been improving in many parts of the world. In most Asian and European countries, schools and businesses have reopened. In light of the crisis, all major economies are implementing record amounts of fiscal and monetary stimulus. Additionally, since the slowdown was due to an extraneous event, political opposition to these measures is minimal, especially for infrastructure projects. Infrastructure projects are politically popular and lead to increased wages and hiring for blue-collar workers. It also is supportive of manufacturing industries. 9 \"BUY THE DIP\" Growth Stocks For 2020Another reason to be bullish on manufacturing is that inventories are low which typically coincides with a cyclical upturn. Forward-looking indicators are also supportive of this thesis. Commodities linked to global growth like copper and lumber have recovered their coronavirus dips and are trading at multi-year highs. Caterpillar (CAT), BHP Group (BPL), and Reliance Steel & Aluminum (RS) are three stocks that were recently upgraded by our POWR Ratings system and will thrive from an acceleration in global growth. Caterpillar, Inc. (CAT) CAT manufactures and sells construction and mining equipment, diesel and natural gas engines, and industrial gas turbines. The stock has been rising since hitting its 52-week low of $87.50 on March 12th and is up nearly 60%. CAT’s capital turnover, which is the annual revenue relative to shareholder’s equity, is 3.58, better than 84.8% of US stocks. CAT has an annual dividend of $4.12 which yields 2.99%. CAT’s EPS grew at an annualized rate of 26.5% over the past five years. Moreover, the market expects the company’s EPS to increase by 43.3% next year. CAT has a strong financial position and ended the first quarter with $7.1 billion in cash and $10.5 billion of available global facilities. Moreover, the company arranged $8 billion of supplemental liquidity facilities in April to cushion against an economic contraction. Our POWR Ratings system has recently upgraded CAT’s Overall rating from “Buy” to “Strong Buy.” It also has an “A” for Trade Grade, Buy & Hold Grade and Industry Rank, and a “B” for Peer Grade. The stock is also ranked #2 out of 59 stocks in the Industrial-Machinery sector. BHP Group Plc (BBL) BBL has gained more than 80% since the March low on concerns that the coronavirus would result in a global recession. The CEO of BBL, Mike Henry said “Our diversified portfolio and high-quality assets, together with our strong balance sheet, make us resilient to the ongoing uncertainty in the markets for our commodities. We expect to continue to generate solid cash flow through the cycle and we remain confident in the outlook for demand for our products over the medium to long-term.” By the end of fiscal 2020, this global natural resources company had six major projects with a combined budget of $11.4 billion under development in copper, iron ore, petroleum, and potash. Last month BBL agreed to acquire the Honeymoon Well Nickel Project. This would help expand BBL’s nickel resource base in Western Australia. BBL pays an annual dividend of $2.60, which yields 5.93%. It’s no surprise that BBL has been upgraded from “Buy” to “Strong Buy” in our POWR Ratings system. It also has an “A” for Trade Grade, Buy & Hold Grade and Peer Grade, and a “B” for Industry Rank. In the 33-stock Industrial Metals industry, it is ranked #3. Reliance Steel & Aluminium Co. (RS) RS is a global diversified metal solutions provider that has a network of more than 300 locations in 40 states and 13 countries other than the United States. RS’s earnings surprise history looks impressive, with the company surpassing consensus EPS estimates in each of the trailing four quarters. The stock was soaring high before the pandemic which made it hit its 52-week low of $70.57 in March. However, since then the stock is on its way up and has grown more than 40%. In the second quarter, RS showcased a strong gross profit margin of 30.4% which compares to 29.6% a year ago. RS’s shareholder yield, which is a measure of how much capital is returned to stockholders via dividends and buybacks, is 14.96%, greater than the shareholder yield of 86.44% of stocks in our set. Reflecting a promising outlook, RS has been upgraded from “Neutral” to “Buy” in our POWR Ratings system. It has an overall rating of “Buy” with an “A” for Peer Grade and a “B” for Trade Grade. Among the 28 stocks in the Steel group, it’s ranked #1. Want More Great Investing Ideas? 9 “BUY THE DIP” Growth Stocks for 2020 Newly REVISED 2020 Stock Market Outlook 7 “Safe-Haven” Dividend Stocks for Turbulent Times CAT shares rose $0.11 (+0.08%) in after-hours trading Monday. Year-to-date, CAT has declined -3.01%, versus a 1.46% rise in the benchmark S&P 500 index during the same period."}]}