{"article": [{"url": "https://stocknews.com/news/wmt-nee-cl-3-stocks-to-buy-to-protect-your-portfolio-from-another/", "published": 1601554100.0, "headline": "3 Stocks to Buy to Protect Your Portfolio from Another Market Selloff", "body": "There is a lot of uncertainty surrounding equity markets right now. While the S&P 500 has rebounded after it entered a bear market in March 2020, high unemployment rates and falling GDP figures do not inspire much confidence. A second wave of COVID-19 might spell doom especially if lockdown restrictions are reimposed. The markets ended September 2020 in red and this weakness might well extend into Q4 of 2020. So, is it time to revisit your portfolio and look at stocks that might perform during an economic downturn? Investors who have a bearish outlook need to identify recession-proof stocks that offer essential products and services which will generate demand irrespective of a weak economy. Let’s look at three such companies that should do well in a weak economic environment. 7 Best ETFs for the NEXT Bull MarketA utility giant The first stock on the list is NextEra Energy (NEE), a company that provides electricity-related services. NextEra is in fact the top producer of wind and solar energy in the world and one of the largest companies in the battery storage space. The company has invested heavily in building a strong portfolio of renewable energy assets making it a top buy for the next few decades. Further, its traditional utility business powers over five million customers in Florida. It continues to invest heavily and aims to grow its asset base at an enviable pace. NextEra confirmed it will pump in between $12 billion and $14 billion in capital expenditure through 2022. The company also forecasts earnings to grow between 6% and 8% in 2022 and 2023. A regulated-business will help NextEra generate a steady stream of cash flow and its earnings growth will help the company increase dividends in the upcoming years. NextEra has a forward yield of 2% and the stock has returned 400% in the last 10 years, easily outpacing broader market returns. While dividends are at par with the market average, NextEra aims to increase payouts by 10% annually through 2022. NextEra is a stock with strong fundamentals. It has one of the highest credit ratings among utility stocks and a low payout ratio. This will help the company take advantage of low interest rates and raise additional debt or refinance existing loans to fund expansion projects. Further, a low payout ratio gives it enough room to reinvest capital or increase dividends and improve shareholder wealth. A retail heavyweight The world’s largest retailer, Walmart (WMT) is another top-quality stock that will perform well across business cycles. It has about 11,500 stores in 27 countries and 5,000 stores in the U.S. It is also one of the largest e-commerce platforms in the world with walmart.com attracting 100 million unique visitors every month. Walmart is a cash cow and generated $524 billion in sales in fiscal 2020. Analysts expect revenue to grow to $550 billion in fiscal 2021 and $557 billion in fiscal 2021. Comparatively, Amazon (AMZN) which is the world’s largest e-commerce retailer generated $280 billion in 2019 which also includes revenue from its cloud platform and other businesses such as advertising and online streaming. Walmart is investing heavily in e-commerce and taking on Amazon in the online retail space. The Walmart+ which is a subscription delivery service is priced at $98 a year and offers free delivery and other applicable discounts. Walmart started paying dividends in 1974 and has increased payouts every year since then. While several companies reduced or entirely suspended payouts amid the pandemic, Walmart increased quarterly dividends by $0.01 to $0.54 a share. In the first two quarters of fiscal 2021, the company’s free cash flow stood at $15.4 billion. Compare this to its $3.1 billion dividend payout and we can see the retail giant has enough room to increase payments or reinvest in expansion that will drive top-line growth for several years. Walmart has already invested $16 billion to acquire a majority stake in Flipkart, India’s e-commerce platform. Now it might invest $25 billion in Tata Group’s super app that is eying a launch by early 2021. A consumer-goods behemoth The third company on the list that is recession-proof is Colgate-Palmolive (CL), a consumer goods company valued at a market cap of $66.3 billion. Colgate Palmolive is a dividend king, which means it has increased dividends each year for 50 consecutive years. The stock has a forward yield of 2.3% and a payout ratio of just 55% which means its dividend growth record is not in danger. Further, CL stock has returned 150% in the past decade after accounting for dividend reinvestments. In the first six months of 2020, Colgate’s free cash flow stood at $1.6 billion while it paid less than $800 million in dividends. The company’s sales grew 7.5% year-over-year in Q2 and almost 70% of revenue is generated from international markets, making it a well-diversified company. Demand for Colgate-Palmolive’s portfolio of products remains steady throughout the year and across business cycles. Want More Great Investing Ideas? Do NOT Buy Stocks Before the Election! 7 “Safe-Haven” Dividend Stocks for Turbulent Times Chart of the Day- See Christian Tharp’s Stocks Ready to Breakout WMT shares were trading at $143.60 per share on Thursday afternoon, up $3.69 (+2.64%). Year-to-date, WMT has gained 22.40%, versus a 6.24% rise in the benchmark S&P 500 index during the same period."}]}