{"article": [{"url": "https://stocknews.com/news/baba-will-alibaba-be-the-next-trillion-dollar-giant/", "published": 1597061300.0, "headline": "Will Alibaba Be the Next Trillion-Dollar Giant?", "body": "Technology companies have been on a stupendous rally in the last decade. They have created significant wealth over the years and a few such stocks as Apple (AAPL), Amazon (AMZN), Microsoft (MSFT), and Alphabet (GOOGL) have touched trillion-dollar valuations as well. Even during the ongoing pandemic tech stocks have continued to soar higher, touching record highs and are largely immune to the current recessionary environment. Another stock that has generated market-beating returns is China’s technology heavyweight Alibaba (BABA). The company went public back in November 2014 and has since returned over 170% to investors. In comparison, broader indexes such as the S&P 500 and Dow Jones have gained 68% and 61% respectively since Alibaba’s IPO. BABA stock is currently valued at a market cap of $682 billion and might very well be the next trillion-dollar company on the New York Stock Exchange. Alibaba is currently the six largest publicly listed company in the U.S., trailing social media giant Facebook which is valued at $765 billion. 7 Best ETFs for the NEXT Bull MarketSo why am I bullish on BABA stock and why do I think it can continue to generate outsized gains in 2020 and beyond? A diversified tech behemoth Alibaba is an internet company that aims to transform the way businesses market, sell, and operate. It provides a robust technology infrastructure and marketing reach to help companies and brands leverage the power of tech and engage with customers. Alibaba operates various businesses that include: Taobao Marketplace: This business was launched in 2003 that provided consumers with a personalized shopping experience that is optimized by big data analytics. It aims to acquire and engage customers by providing real-time merchant updates and is China’s largest mobile commerce destination with a large and expanding community. Tmall: Launched in 2008, Tmall provides users with a premium shopping experience. It is a platform to buy domestic and international products, allowing several brands to establish digital storefronts. Tmall is the largest third-party online and mobile commerce platform for brands and retailers in the world in terms of gross merchandise volume (GMV). Freshippo: This is Alibaba’s proprietary grocery retail chain. At the end of the March quarter, Alibaba had 207 self-operated Freshippo stores located primarily in tier-one and tier-two Chinese cities. AliExpress: AliExpress is another online marketplace that allows consumers to purchase directly from manufacturers and distributors located in China and other regions. The AliExpress platform is available in 17 other languages. 1688.com: Analysys forecasts 1688.com to be China’s leading integrated domestic wholesale marketplace by revenue. This B2B platform connects manufacturers and wholesale sellers to buyers in several verticals. Alibaba.com: The company’s first business, Alibaba.com is China’s largest online wholesale marketplace by revenue. The platform connects suppliers to wholesale buyers and in fiscal 2020, it fulfilled orders from over 20 million buyers from 190 countries. Alibaba Cloud: The company’s cloud computing segment was established in 2009 and offers an expansive suite of services to customers that include database, storage, network virtualization services, security, management, and application services among others. Alibaba Cloud is China’s largest and the world’s largest public cloud provider. Ant Group: This is Alibaba’s digital payments vertical and the number of annual active users served by Ant Group (including nine e-wallet partners) touched 1.3 billion in the 12-months prior to March 2020. A growing and expanding addressable market We can see that Alibaba is one of the largest e-commerce and online companies in the world. Its business vertical comprises of core commerce, cloud computing, retail, and digital media. In the last two decades, the company has benefitted from the evolution of China’s digital landscape as well as an increase in the purchasing power of its populace. China’s growth story of its rising middle class and the shift towards online shopping will continue to drive Alibaba’s top-line figures higher. The ongoing COVID-19 pandemic will, in fact, accelerate the shift towards e-commerce and allow Alibaba’s digital infrastructure to gain significant traction amid an uncertain macro environment. In fiscal 2020, Alibaba surpassed $1 trillion in gross merchandise volume which was an important milestone given China’s total annual retail sales for consumer goods is about $6 trillion. In the next decade, China’s GDP is forecast to grow by at least 5% annually while its internet and cloud computing markets are forecast to grow by 10% and 16% respectively. Alibaba continues to focus on investing in growth and in a recent shareholder letter it said, “Our next goal is to serve more than 1 billion consumers in China and facilitate more than RMB10 trillion of consumption on our platforms in the next five years as we continue on the path of globalization.” It added, “Our longer-term goals are to serve 2 billion consumers globally, create 100 million jobs and provide the necessary infrastructure to support 10 million small businesses to become profitable on our platforms by 2036.” BABA stock is trading at an attractive valuation BABA stock is trading at a forward price to sales multiple of 7.1x while its forward price to earnings multiple is 29x. These valuations are extremely attractive given the company’s expected revenue and earnings growth. According to estimates from Yahoo! Finance, BABA is forecast to increase sales by 31.1% to $95.4 billion in fiscal 2021 and by 26% year-over-year to $120.06 billion in 2022. Comparatively, its earnings growth is forecast at 15% for 2021 and 28% in 2022. Analysts tracking BABA stock have a 12-month average target price of $284.23 which is about 13% higher than the current trading price. The verdict Alibaba stock will be volatile given the current tensions between China and the U.S. BABA stock slumped over 5% last Friday as President Donald Trump said apps including TikTok and WeChat will be banned by the end of September. However, Alibaba’s rapidly expanding market, profitable businesses, low valuation, and rising margins make it an enticing bet for long-term investors. BABA stock needs to gain 47% to touch a valuation of $1 trillion in market cap. There is a good chance Alibaba will reach this milestone before the end of 2021. (BABA is one of the stocks currently in Steve Reitmeister’s Total Return portfolio. Learn more here.) Want More Great Investing Ideas? 3 Possible Directions for the Stock Market from Here How to Trade THIS Stock Bubble? 9 “BUY THE DIP” Growth Stocks for 2020 BABA shares were trading at $247.80 per share on Monday afternoon, down $4.30 (-1.71%). Year-to-date, BABA has gained 16.83%, versus a 5.07% rise in the benchmark S&P 500 index during the same period."}]}