{"article": [{"url": "https://stocknews.com/news/kr-go-sfm-wmt-3-supermarket-stocks-to-buy-as-covid-19-continues-to-spread/", "published": 1595938100.0, "headline": "3 Supermarket Stocks to Buy as Covid-19 Continues to Spread", "body": "This is one of the better times in modern history to be invested in supermarket stocks. Outside of supermarkets, people have precious few options to go during the pandemic. Sadly, there is no end in sight for the coronavirus outbreak, creating the potential for even more money to be spent at supermarkets as the masses continue to stock up on hot and cool treats. Furthermore, people will inevitably hoard their favorite foods and beverages as there is potential for yet another series of product shortages as the winter approaches. Harsh weather, supply chain problems, and all sorts of other issues can arise in the months to come, each of which will undoubtedly cause panic buying. The following grocery store stocks are likely to benefit: The Kroger Company (KR), Grocery Outlet Holdings Corp. (GO), and Sprouts Farmers’ Market (SFM). The Kroger Company (KR) 7 Best ETFs for the NEXT Bull MarketEveryone needs food, beverages, medication, and other sundries, even amidst a pandemic. KR sells each of these items along with numerous other non-necessities. Analysts have set a price target of $36 for KR, which is 4% below its current price. KR is not your traditional supermarket. The company is launching its own line of plant-based products. KR is also making advances toward tech expansion. The company even acquired English web-based grocery delivery company Ocado. KR also acquired meal-kit business, Home Chef. These moves point toward KR’s preparation for a tech-centric grocery shopping experience highlighted by vegan and vegetarian offerings that appeal to the sizeable millennial age cohort and the environmentally-conscious Generation Z age cohort. In short, KR is one of the few grocers outside of Whole Foods that is well-prepared for the future. The POWR Ratings show KR has an A Grade in each component except for Peer Grade. KR is ranked in the top five of nearly 20 Grocery/Big Box Retailers. This is precisely why KR has increased in value even during the March sell-off that reduced stock values across the board. KR could break through its 52-week high of $36.84 by summer’s end. Grocery Outlet Holdings Corp. (GO) Discount retail grocers are all the rage these days as people watch their pennies and restrict spending to the bare necessities required for survival. GO provides these necessities at rock-bottom prices. GO has been in business for nearly 80 years, primarily because it offers fresh products, including name-brand items at competitive prices in fun-filled stores. GO’s treasure hunt shopping theme provides shoppers with quite an enjoyable in-store experience. Furthermore, it is easy to find what you are looking for in GO stores thanks to their small box style. GO stores typically measure 15,000 square feet, a reasonably small size compared to other supermarket chains like Walmart (WMT) and Wegmans. In total, GO has more than 350 stores. The company’s stock has doubled since going public last summer. GO’s business model is quite unusual in that stores are owned and operated by independent contractors instead of the company itself or franchisees. GO provides independent contractors with loans to launch GO stores. The contractor then decides what to stock on the shelves after the store is open. Each inventory item is purchased directly from GO’s stockpile. GO then pays the independent contractors a commission along with shares of the overarching gross profit. The POWR Ratings reveal GO has As in the Trade Grade and the Industry Rank POWR components. The stock also has a grade of B for Buy & Hold Grade. GO’s comparable sales are growing around 5% per year, indicating a budding success story is likely to hold steady in the grocery game for years to come. Sprouts Farmers’ Market (SFM) Wouldn’t it be nice to own a grocery store stock with a forward P/E ratio of 15 that sells fresh products, vitamins, and other wellness products? SFM is this mystery sock. SFM’s focus on nutrition and wellness is proving particularly prescient considering the public health crisis unfolding in the form of the coronavirus pandemic and the United States’ high obesity rate. SFM’s products are primarily plant-based, keto-oriented, and void of gluten. Most of SFM’s meat is derived from grass-fed animals. SFM management is making an effort to reduce operational complexity, improve production efficiency, and provide same-day delivery. In other words, SFM is well-positioned for a successful future. The POWR Ratings show SFM has As in each component along with an overall rating of seven out of 18 Grocery/Big Box Retailers stocks. Trading at $26 and change, SFM has doubled since its March low. SFM could break through its 52-week high of $28.10 within weeks. Want More Great Investing Ideas? 9 “BUY THE DIP” Growth Stocks for 2020 Newly REVISED 2020 Stock Market Outlook 7 “Safe-Haven” Dividend Stocks for Turbulent Times KR shares were trading at $35.23 per share on Tuesday afternoon, up $0.47 (+1.35%). Year-to-date, KR has gained 22.78%, versus a 0.85% rise in the benchmark S&P 500 index during the same period."}]}