{"article": [{"url": "https://stocknews.com/news/cvs-met-viac-3-value-stocks-currently-trading-at-bargain-prices/", "published": 1599653300.0, "headline": "3 Stocks Currently Trading at “Bargain Prices”", "body": "It is not often you find a litany of stocks trading at affordable prices. However, that is exactly the case after the market selloff from Wednesday through yesterday. If you have been patiently waiting on the sidelines, hoping to seize the opportunity to scoop up several stocks after they dip, this is the time to pounce. Even if you are over-leveraged on tech stocks, you should consider adding a couple of low-priced value stocks to your portfolio for better balance. Let’s take a look at four stocks currently trading at attractive prices: CVS Health Corporation (CVS), MetLife (MET), and ViacomCBS (VIAC). 9 \"BUY THE DIP\" Growth Stocks For 2020CVS Health Corporation (CVS) Even if the economy continues to shrink, CVS should hold strong. CVS sells sundries along with pharmaceutical products people will need no matter how bad the economy gets. Furthermore, CVS is now consolidated with insurance powerhouse Aetna, expanding the company’s boundaries all the more. CVS is currently trading under $60, yet it was in the range of $70 to $75 earlier this year. The POWR Ratings show CVS has a B Peer Grade. Furthermore, the stock is ranked first of four publicly traded companies in the Medical – Drug Stores industry. Take a look at the average analyst price target for CVS as detailed on TipRanks, and you will find plenty of room for upward movement. Analysts have set a price target of $85.29 per share. It is quite interesting that CVS has a forward P/E ratio of merely 8. The stock also has a dividend yield of 3.32%. If you’re worried about a lengthy recession, consider this defensive stock as it will enjoy consistent foot traffic no matter how bad the economy gets. MetLife (MET) If you are unsure where to park your money during the economic uncertainty, consider MET, a value stock in the financial services and insurance industries. MET provides individual insurance, group insurance, investment products, annuities, retirement products, and more. MET has not yet moved back to its pre-COVID trading price of $45 to $55. However, the stock has inched upward steadily since dipping down to $25 this past spring. Analysts have set a price target of $44.20, which is 17% higher than its current price. Furthermore, MET has an incredibly low forward P/E ratio of 7.06, meaning it is likely undervalued at its current trading price in the high $30s. ViacomCBS (VIAC) Though VIAC is not the entertainment powerhouse it was in the 90s or early 2000s, the stock still has considerable value and is trading lower than where it should be. VIAC was trading between $35 and $45 in the months preceding the coronavirus pandemic. The stock is now priced below $29 per share. Regardless of your interests, there is a good chance you consume some of VIAC’s entertainment offerings in the form of CBS, CBS All Access, CBS Sports, CBS Interactive, etc. Approximately half of all VIAC revenue stems from advertising. One-quarter of VIAC revenue is derived from content licensing. About one-fifth of revenue results from affiliate income. In our POWR Ratings, VIAC has a grade of B for Industry Rank and an overall ranking of 6 out of 20 publicly traded companies in the Entertainment – Media Producers industry. VIAC’s forward P/E ratio of 7 indicates the stock is underpriced at its current trading level. Want More Great Investing Ideas? 7 Best ETFs for the NEXT Bull Market Will Stocks Fall into Historical September Slump? 9 “BUY THE DIP” Growth Stocks for 2020 CVS shares were trading at $59.78 per share on Wednesday afternoon, up $0.25 (+0.42%). Year-to-date, CVS has declined -17.67%, versus a 7.26% rise in the benchmark S&P 500 index during the same period."}]}