{"article": [{"url": "https://stocknews.com/news/regn-gild-nvax-mrna-4-biotech-stocks-benefiting-from-trumps-covid-19-diagnosis/", "published": 1601899700.0, "headline": "4 Biotech Stocks Benefiting from Trump’s COVID-19 Diagnosis", "body": "With recent reports that President Trump had received treatment with drugs from Regeneron Pharmaceuticals (REGN) and Gilead Sciences (GILD), biotech stocks soared today. The SPDR S&P Biotech ETF (XBI) was up almost 5% today, and the rally could easily continue. Biotech stocks such as REGN, GILD, Novavax (NVAX), and Moderna (MRNA) should see steady gains as the President’s positive COVID-19 diagnosis brings new urgency to treatments and vaccines. The President revealed he and the First Lady had tested positive late last week, and a number of his staff have also revealed positive tests. On Saturday morning, the White House medical team announced that they were treating the President with REGN’s antiviral cocktail, which showed positive results last week. Doctors also gave Trump a five-day course of GILD’s remdesivir, an antiviral drug that has shown to shorten hospital stays for patients that are seriously ill with the virus. A positive trend in the biotech sector may result in “a rising tide lifting all boats,” as other biotech stocks stand to benefit. NVAX has been working on potential COVID-19 vaccine, and other promising vaccines, and MRNA also has a COVID-19 vaccine candidate in addition to other vaccines in its pipeline. 7 \"SAFE HAVEN\" Dividend Stocks for Turbulent TimesRegeneron Pharmaceuticals (REGN) The President received an 8-gram dose REGN-COV2, a pair of antibodies REGN had developed, which attaches to the spiky fuzz-ball part of coronavirus. It aims to prevent it from entering host cells and replicating. REGN had announced last Tuesday that REGN-COV2 had shown positive results in clinical trials. The company reported that in the first 275 trial patients, REGN-COV2 reduced the viral load and the time to alleviate symptoms. REGN has already signed an agreement with the U.S. government for $450 million. The company also has six current drugs providing revenue for the firm. Revenue has been driven by the Eylea, which is approved in the United States, Europe, and Japan to treat neovascular age-related macular degeneration, diabetic macular edema, and macular edema following retinal vein occlusion. The growth of the drug can be attributed to an aging population and an increase in diabetes. The label expansion of the drug bodes well for future performance. The company has also seen strong sales for its Dupixent and Libtayo drugs. Dupixent treats atopic dermatitis, asthma, and nasal polyposis, and Libtayo treats cutaneous squamous cell carcinoma. REGN has also outperformed analysts’ estimates over the past four quarters. The company has a pipeline of over 30 programs, with nine in phase 3, an extremely encouraging sign for top-line growth. Gilead Sciences (GILD) The other drug given to Trump in addition to REGN-COV2, aspirin, and steroids was Veklury, an antiviral drug also known as remdesivir. The drug is authorized by the FDA for the emergency treatment of COVID-19 for hospitalized patients and patients with moderate symptoms. In a study performed by the National Institute of Allergy and Infectious Diseases (NIAID), remdesivir showed that it significantly reduced the amount of time patients spent in the hospital. The company has been boosting the production of remdesivir for a goal of 2 million treatment courses by the end of the year. This represents 12 million vials, with a cost of $390 to $520 per viral. This isn’t the only drug in GILD’s portfolio. The company has over 40 programs in its pipeline. The company focuses on therapies that treat HIV and hepatitis B, and C. Sales of its HIV drugs have grown 12% a year over the past nine years. Its Biktarvy HIV drug, which is the number one prescribed regimen for both treatment-naïve and switch patients, has shown impressive performance. In addition, last month, GILD announced that it would be expanding its oncology portfolio by acquiring Immunomedics (IMMU) for $21 billion. IMMU brings Trodelvy, an FDA-approved treatment for a type of breast cancer that does not respond well to conventional treatment. Trodelvy is expected to bring in $1.44 billion in annual revenue by the end of 2024. Keep an eye out on October 22nd for GILD’s latest financial results. Novavax (NVAX) NVAX has had quite the year, up 2,668.1%, after gaining 6.3% today. It’s tough to remember that the stock opened the year trading at only $3.99. The company has undoubtedly benefited from the COVID-19 pandemic. In its search for a treatment, NVAX has secured more than $2 billion in funding from the U.S. government and the Coalition for Epidemic Preparedness Innovations. It has also lined up deals with the U.S. and U.K. and reached an agreement to supply up to 76 million doses of its vaccine candidate, NVX-CoV2373, to Canada. Not only has the company lined up funding, but it’s one out of 10 coronavirus vaccine candidates in late-stage testing. Half of those are from Chinese or Russian companies that stand little chance to sell well in the U.S. and Europe. This makes NVAX an intriguing opportunity to bet on. It is currently running a phase 3 study in the U.K. and plans to start one in the U.S. this month. NVAX specializes in creating vaccines. In addition to NVX-CoV2373, the company’s NanoFlu vaccine is extremely encouraging. The company developed NanoFlu for senior patients aged 65 years and above. In March, it announced positive data from a phase III study that demonstrated both the efficacy and safety of NanoFlu. NVAX plans to file for regulatory approval after the company runs a consistency clinical trial. It is also developing ResVax, a respiratory syncytial virus vaccine to protect infants by immunizing their mothers against the disease. Moderna (MRNA) MRNA is another company with a COVID-19 vaccine in late-stage trials. Its vaccine candidate, mRNA-1273, is in a phase 3 study that started at the end of July. The study is being conducted in partnership with the National Institutes of Health and the Biomedical Advanced Research and Development Authority. The company has already signed multiple supply agreements, including a $1.5 billion contract with the U.S. government for up to 500 million doses and an agreement with Canada to supply up to 56 million doses. While growth for the company is heavily dependent on mRNA-1273, it does have other vaccine candidates in its pipeline portfolio. MRNA is looking to start Phase 3 trials next year for mRNA-1647, a vaccine candidate for cytomegalovirus, a form of herpes. Another promising vaccine candidate is mRNA-1893 for the Zika virus. As you can tell by the names of the vaccine candidates, and the stock’s ticker symbol, the company is engaged in creating transformative medicines based on messenger RNA (mRNA). mRNA transfers information stored in the genes to the cellular machinery that makes all the proteins required for life. Messenger RNA could help develop therapeutics and vaccines for infectious diseases, immuno-oncology, rare diseases, autoimmune and cardiovascular diseases. MRNA gained 4.6% today and is up 267.8% year to date. If MRNA is successful in its phase 3 trial for its COVID-19 vaccine, watch out, this stock could continue soaring. Want More Great Investing Ideas? Do NOT Buy Stocks Before the Election! 7 “Safe-Haven” Dividend Stocks for Turbulent Times Chart of the Day- See Christian Tharp’s Stocks Ready to Breakout"}]}