{"article": [{"url": "https://stocknews.com/news/sedg-run-azre-3-solar-stocks-that-are-ready-to-run/", "published": 1594037300.0, "headline": "3 Solar Stocks that Are Ready to Run", "body": "Investing in stocks that benefit from major trends is typically a winning strategy. And the shift to renewable energy is now a prominent trend across the globe. Particularly, concerns related to climate change is making the need to move to green power more obvious. So, even if the prices for hydrocarbons are low, which works as a disincentive for investments in renewable energy projects, technological improvements and consequent low-cost energy storage will keep enhancing the demand for renewable energy. Overall, the industry is well positioned to enter the new phase of growth driven by innovation and cost competitiveness. Looking at the numbers, the global use of renewable energy increased 1.5% year over year in the first quarter of 2020. 9 \"BUY THE DIP\" Growth Stocks For 2020Moreover, being the most resilient source of energy during this staying at or working from home new normal, the industry has performed pretty well so far this year. The S&P Global Clean Energy Index, which includes 30 companies from around the world that are involved in clean energy related businesses, has returned 9.1% year to date versus the S&P 500’s loss of 3.12%. Also, the iShares Global Clean Energy ETF (ICLN) has returned 9.93% over the same period. As solar is undoubtedly a leading renewable energy source and this segment is expected grow significantly over the next few years, you may want to bet on these four solar stocks that are set to outperform in 2020 and beyond: Solaredge Technologies Inc (SEDG) SEDG designs and sells direct current (DC) optimized inverter systems for solar photovoltaic (PV) installations worldwide. It has deployed more than 1.3 million monitored solar systems in 130 countries. Earlier this year SEDG announced that it received certification from Japan Electrical Safety and Environment Technology Laboratory for its award-winning single-phase inverter with HD-Wave technology. This will help SEDG grow its footprint in the Japanese PV market. The company also entered into a four-year pan-European contract to supply smart energy products and solutions, including inverters and power optimizers for 1 GW of solar projects with international solar investor, Enfindus. Over the past twelve months, SEDG has reported earnings growth of 79.12%, putting it ahead of 86.78% of US stocks. While the company missed the consensus EPS estimate in the first quarter of 2020, it surpassed the estimates in the prior three quarters. The stock is trading just 9.6% below its 52-week high of $156.92. SEDG has returned 612% over the past three years and 129.7% over the past year. SEDG is rated B (Buy) in the StockNews.com POWR Ratings. Its Trade, Buy & Hold and Peer grades are A, B and B, respectively. It is ranked #2 out of 14 stocks in the Solar industry. Sunrun Inc. (RUN) RUN is a leading residential solar energy systems provider in the United States. According to Sunrun’s Chief Executive Officer and co-founder Lynn Jurich, the company’s orders reached a single-day all-time high at the end of April. In June 2020, RUN and Orange & Rockland (O&R) jointly received approval to deploy rooftop solar and battery systems as part of an innovative virtual power plant project supporting New York’s transition to clean, reliable, locally generated electricity. RUN is trading around 18% below its 52-week high of $23.66. The stock has returned 196.3% over the past three years and 44.8% year to date. RUN has a “Buy” rating in the StockNews.com POWR Ratings. Among the POWR components, Trade and Peer grades for the stock are A and B, respectively. The stock is ranked #3 in the industry. Azure Power Global Limited (AZRE) AZRE is a low-cost power producer and developer of solar energy in India. The company has a portfolio of over 7GWs spread across 24 states, with 40+ operational utility scale projects and several commercial rooftop projects. India’s rapid economic growth and infrastructure development is a powerful driver for the stock. India is expected to experience a significant economic growth in the coming decades and that makes a solid case for betting on AZRE. The POWR Ratings have rated AZRE a “Strong Buy” with an A for Trade Grade, Buy & Hold Grade, and Peer Grade. In the Solar industry, it’s ranked #1. Want More Great Investing Ideas? 9 “BUY THE DIP” Growth Stocks for 2020 Is the Bull S#*t Rally FINALLY Over? 7 “Safe-Haven” Dividend Stocks for Turbulent Times Top 3 Investing Strategies for 2020 SEDG shares were trading at $146.78 per share on Monday afternoon, up $3.67 (+2.56%). Year-to-date, SEDG has gained 54.36%, versus a -0.73% rise in the benchmark S&P 500 index during the same period."}]}