{"article": [{"url": "https://stocknews.com/news/spy-4-ways-this-stock-pullback-could-turn-into-an-unprecedented/", "published": 1600171700.0, "headline": "4 Ways This Stock Pullback Could Turn Into An Unprecedented Bear Market", "body": "Despite the very rapid correction, tied for the fastest in Nasdaq history, a remarkable three days, stocks are still enjoying what Ben Carlson calls a “face-ripping rally”. 3-Day 10% Plunge Tied for the Fastest Correction in Nasdaq History (Source: Market Watch) 7 \"SAFE HAVEN\" Dividend Stocks for Turbulent TimesThe S&P 500 is still up 53% from the March lows and the Nasdaq 61%. However, there might be a perfect storm coming for stocks that could turn this pullback into a full-blown correction, or possibly even an unprecedented bear market. Here are the four potential risk catalysts that investors need to know to potentially prepare themselves for a return to the kind of market volatility that traumatized so many earlier this year. Friday, September 18th Is a Potentially Very Important Day for the Stock Market Friday, September 18th is the quarterly options expiration, which is called the “quadruple witching” because it can result in extreme volatility when options contracts expire. Why should stock investors care? Because according to Refinitiv economist Roger Hurst the number of options sold in recent months was 5X the previous record set back in early 2000. Options are a way to leverage short-term stock market moves, in either direction. call options allow you to make leveraged bets that stocks will go up put options allow for leveraged bets that stocks will go down Options are apparently a favorite of the Robinhood crowd, who isn’t satisfied merely speculating on short-term stock moves but wants to amplify short-term gains (and losses) the way only options allow. When options are sold, either calls or puts, the market maker (usually your broker) doesn’t just keep those naked, which exposes them to potentially significant losses. Rather they hedge the positions by buying or selling the underlying stock (or index funds) to protect themselves. Normally the number of shares required is a fraction of the 100 shares each option represents, say 10 shares. However, if the stock price moves close to the strike price of the option, the number of shares the market maker must hedge rises (known as “delta”). This can sometimes result in the market maker having to sell or buy a full 100 shares of the underlying stock for each option sold. The closer the option gets to the expiration date the more shares a market maker must hedge via either buying or selling the underlying security. The rate of new hedging required via selling or buying more shares as the time to expiration falls is called “gamma.” On the 3rd Friday of each quarter the quarterly expiration date, known as the quadruple witching, can result in extremely high volatility if the stock market has a specific trend, such as a correction, occurring at the time. Mr. Hurst is careful to point out that quarterly option expirations don’t always result in wild swings in the stock market, such as 6% declines seen on June 11th, but they represent a potential risk catalyst that can turn a mere pullback into an outright correction. Which brings us to the second potential catalyst that might make for a wild few weeks for stocks, possibly even triggering a second bear market in the same year, something that has literally never happened in the history of the US stock market. Fed Meeting Likely Offers More Downside Than Upside Potential For Stocks On Tuesday and Wed, September 15th and 16th, the Fed is meeting and some investors are holding out hope that the “Fed Put” will put an end to this pullback and get stocks soaring higher again. However, the Fed doesn’t actually care about the stock market, it just seems that way because of the difference between correlation and causation. The Fed cares about smoothly functioning credit markets when market volatility spikes, corporate credit markets can come under stress The Fed is quick to calm the corporate credit markets, such as overnight lending (REPO) to prevent another financial crisis stocks tend to rally upon such actions thus investors incorrectly assume the Fed “won’t let stocks fall a lot…ever.” With the Fed funds rate at zero already, there are just two main things the Fed could announce on Wednesday when Chairman Powell does his normal press conference. yield curve control (Fed promises to use infinite treasury bond-buying to lock 10-year yield below a certain target level) increased treasury or mortgage-backed asset buying (ramping up QE infinity to even greater levels) Why is the Fed not likely to do either of these things and thus potentially disappoint the stock market? Corporate Credit Mostly Unfazed by Equity Volatility: In response to heightened equity market volatility, a composite high-yield bond spread widened from the 517 basis points of the five trading days ended September 2 to a 535 bp average thereafter. However, the widening of the high-yield bond spread is less than what might be inferred from the comparably measured jump by the VIX from 25.3 points to 31.1 points. Ordinarily, a rise by the VIX of 5.8 points is accompanied by a 59 bp widening of the high-yield bond spread. However, the latest widening of the high-yield bond spread was a much thinner 18 bp. Apparently, the recent jump in equity market volatility is mostly for reasons that extend beyond any possible diminution of pretax profits.” – Moody’s As Moody’s recently pointed out, the current Nasdaq correction and S&P pullback has resulted in very little credit market stress. Just look at short-term borrowing rates (3 months or less) vs LIBOR, the overnight lending rate. The overnight commercial paper market is dead steady and stable, at pre-recessionary levels. The difference between average BBB bond yields (60% of corporate American bonds according to S&P and Moody’s) and 10-year US Treasury yields is another important proxy for credit market conditions. The corporate bond market is absolutely dead steady for the last few weeks, with no indication that a falling market has spooked the bond market that the Fed truly serves. The Fed made the unprecedented move of buying both junk and investment-grade bond ETFs a few months back in order to stabilize corporate borrowing costs. Those are now at record lows and have been falling steadily for every grade of corporate bond, even the deepest of junk bonds. Now consider the fact that recent economic news has been surprising to the upside. Here is what the 16 most accurate economists out of 45 tracked by MarketWatch think about America’s economic growth prospects. (Source: MarketWatch) Here’s how this week’s median blue-chip economist consensus compares to last weel’s estimates. Q3 growth consensus up 4% to 25.0% Q4 growth consensus unchanged at 6.0% 2020 growth consensus +1.2% to -4.4% Q1 growth consensus unchanged at 5.6% 2021 growth consensus +0.5% to 4.9% Are there many risks to the economy right now? You bet. Is the Fed watching these closely? Absolutely. Does it appear that in the short-term we may be nearing peak good news, as far as the macroeconomy goes? Indeed it does. Are there any reasons for the Fed to become even more dovish and pump a ton more liquidity into the financial markets that could cause stocks to roar higher once again? Not really. And with the S&P 500 still trading at a 40% historical premium, the Fed merely staying the course, and reiterating its current plans, could be enough to turn a historically normal stock market pullback into a completely normal, healthy 10% or so correction. Catalyst 3: Fed Disappointment Correction + Quarterly Option Expiration = Potentially Wild Swings to the Downside The last two corrections, March 2020, and December 2018, both bottomed the day after quarterly expiration. Does that mean that corrections will always bottom one day after the “quadruple witching”? Heck no. For one thing, two data points is not statistically significant. Statisticians usually want at least 40 data points to confirm they aren’t just looking at random noise. Second, if market corrections were to persistently bottom after such an obvious technical catalyst as quarterly options expiration then asset managers seeking an edge would begin front running those dates, causing stocks to bottom faster and earlier. BUT for the sake of this article, which describes a potential perfect storm of negative catalysts that could POTENTIALLY cause an unprecedented bear market, lets’ assume that stocks fall to near -10% from record highs on Wed and Thursday due to Fed disappointing Wall Street by not “cranking up the QE to 11” gamma becoming sky-high due to quarterly option expirations forces market makers to hedge their option books to the max stocks slide a significant 3% to 6% on Monday, September 21st In this scenario, stocks end up down about 13% to 15%. That happens to be a historically normal, run-of-the-mill correction. (Source: Guggenheim Partners, Ned Davis Research) In fact, since 1980 the S&P 500’s average intra-year peak decline has been 14%, meaning for 40 years investors needed to be prepared for a 14% market decline in every single year. So how can a pullback turning into a perfectly normal, healthy, and not at all frightening (to those with a sense of market history) correction turn into an unprecedented bear market? That’s what I’ll explain in the conclusion of this two-part article, coming tomorrow. Want More Great Investing Ideas? 7 Best ETFs for the NEXT Bull Market Stock Market Outlook: Before & After the Election Chart of the Day- See the Stocks Ready to Breakout SPY shares rose $2.83 (+0.84%) in premarket trading Tuesday. Year-to-date, SPY has gained 7.09%, versus a % rise in the benchmark S&P 500 index during the same period."}]}