{"article": [{"url": "https://stocknews.com/news/avgo-tsm-orcl-3-top-tech-stocks-to-buy-in-october/", "published": 1601899700.0, "headline": "3 Top Tech Stocks to Buy in October", "body": "October marks the beginning of the holiday season when consumer companies earn most of their annual sales. The fourth quarter is especially important for mobile, laptop makers, and gaming companies as their sales increase during the Black Friday sale. Another factor is Apple‘s (AAPL) next-generation iPhone which may become the biggest-selling consumer tech product in history. This year, the COVID-19 pandemic and the US-China trade war has delayed the iPhone launch. In September, we saw the launch of a new Apple Watch and iPad, but no iPhone 12. There are rumors that Apple will launch the new iPhone in October. Two such Apple suppliers are Broadcom Inc. (AVGO) and Taiwan Semiconductor Manufacturing Company Ltd. (TSM). These stocks dipped in September and fell in early October around iPhone rumors, giving a buying opportunity. Another stock to consider in October is Oracle Corp (ORCL), which is looking to enter the consumer-data business. The three stocks are enjoying the limelight, which could fuel their momentum in the fourth quarter. 7 Best ETFs for the NEXT Bull MarketBroadcom Inc. (AVGO) On the face of it, AVGO is a provider of communications semiconductor and enterprise security software. But it operates as a private equity firm. Its CEO Hock Tan has made some of the largest acquisitions of market leaders in their mature growth stage with stable cash flows. He has integrated businesses and divested some of them to make AVGO what it is today, an end-to-end 5G network solutions provider. While AVGO’s communications portfolio gives it an edge in the 5G revolution, it is a stock you should buy in October for the value Apple brings to it. AVGO is one of the largest component suppliers for Apple’s iPhones, providing chips like Bluetooth and WiFi and radio frequency front end modules. It earned 20% of its 2019 revenue from Apple, with this revenue concentrated in the second half. But this year, the delay in the iPhone launch has pushed the revenue to the fourth quarter of fiscal 2020 and the first quarter of fiscal 2021. In January, AVGO announced that in addition to its current supply agreement, it has entered into two more agreements to supply high-performance communication chips for Apple’s future products in the next 3.5 years. The fourth quarter could see revenue from the two new contracts. AVGO has guided fourth-quarter revenue to rise 10.8% year-over-year to $6.4 billion. AVGO stock has surged 17% year-to-date and 29% last year. This double-digit revenue growth could drive the stock higher. Hence, AVGO is a “Strong Buy” in our POWR Ratings system. It holds an “A” in Trade Grade, Peer Grade, and Buy & Hold Grade and a “B” for Industry Rank. It is the #2 ranked stock in the 86-stock Semiconductor & Wireless Chip industry. Taiwan Semiconductor Manufacturing Company Ltd. (TSM) Another beneficiary of the Apple iPhone is TSM, the world’s largest third-party semiconductor manufacturer. It is the sole foundry that manufactures all of Apple’s A-series chips used in iPhones and iPads. It also has exposure to Apple in other forms. For instance, Apple’s supplier Qualcomm (QCOM) gets its chips manufactured at TSM foundries. Without a doubt, the fourth quarter would see TSM fabrication facilities running at full capacities to produce A-14 processors and other chips. While AAPL is the largest customer of TSM, the latter’s leadership in the most advanced process node technology has attracted many new orders of high-margin products. It is also manufacturing game console chips for Advanced Micro Devices (AMD). However, the US-China trade war saw the United States imposing sanctions on Huawei, from which TSMC earns 14% of its revenue. As a result, TSM stopped supplying chips to Huawei in September. The loss of Huawei’s orders could be partially offset by new orders from Apple in 2021 and 2022. These new orders will come as Apple plans to launch iPhone 12 Lite next year and design PC and laptop processors in-house. TSMC’s tailwinds more than offset its headwinds. The company would release its third-quarter earnings on October 15, which would reflect AMD’s order, and the fourth-quarter guidance would reflect Apple’s order. TSM has guided third-quarter revenue to surge 20.7% year-over-year to $11.35 billion. TSM stock has surged 39% year-to-date and 63% last year. Better-than-expected earnings and guidance could drive the stock further. Hence, TSM is rated a “Strong Buy” in the POWR Ratings. It holds an “A” in Trade Grade, Peer Grade, Buy & Hold Grade, and Industry Rank. It is also the #1 ranked stock in the Semiconductor & Wireless Chip industry. Oracle Corp (ORCL) Unlike AVGO and TSM, Apple has nothing to do with ORCL stock’s recent rally. The enterprise software service giant ORCL came into the limelight last month after it bagged the TikTok deal from Microsoft (MSFT). ORCL stock surged 8% from September 8theven when other tech stocks dipped as the terms of the deal were being worked out. TikTok was searching for a bidder for its U.S. operations as the Trump administration had problems with the Chinese ownership of the video-sharing app. The Microsoft negotiations fell apart after China restricted exports of the software TikTok uses to recommend videos to users. TikTok-parent ByteDance instead chose Oracle as the deal allowed the former to retain major ownership in TikTok. The Oracle deal is like a corporate restructuring where it acquires a 12.5% stake in TikTok for $7 billion and becomes its U.S. technology partner. Oracle benefits from housing massive amounts of TikTok’s data in its cloud servers while ensuring the security of the data. The biggest concern was whether the deal would be approved by the U.S. and Chinese governments. ORCL CEO Larry Ellison personally lobbied President Donald Trump and got the White House approval. ORCL stock has surged 13% year-to-date and 19% last year. If the deal moves further and gets China’s backing, ORCL stock could surge more. ORCL has also signed a cloud deal with Zoom (ZM). Together Zoom and TikTok, ORCL could boost its cloud infrastructure service revenues by a strong double-digit in the next 12 months. Hence, ORCL stock is rated a “Strong Buy” in our POWR Rating system. It also has an “A” for Trade Grade, Peer Grade, and Buy & Hold Grade, and a “B” for Industry Rank. In the 96-stock Software – Application industry, it is ranked #1. Want More Great Investing Ideas? Do NOT Buy Stocks Before the Election! 7 “Safe-Haven” Dividend Stocks for Turbulent Times Chart of the Day- See Christian Tharp’s Stocks Ready to Breakout AVGO shares were unchanged in after-hours trading Monday. Year-to-date, AVGO has gained 20.12%, versus a 7.08% rise in the benchmark S&P 500 index during the same period."}]}