{"article": [{"url": "https://stocknews.com/news/spxx-aapl-msft-googl-v-a-buy-and-hold-fund-for-7-2-dividends-and-strong-gains-before/", "published": 1597925300.0, "headline": "A Buy-and-Hold Fund for 7.2% Dividends and Strong Gains (before 2021)", "body": "These days, I’m hearing from a lot of readers who are worried about this market rebound—and wondering whether they should buy high-yield stocks or sit on the sidelines. They’re right to be worried—the S&P 500’s 19% surge (!) in the last 12 months has only been topped a handful of times in the last 20 years, and none of those 12-month periods saw a pandemic that shuttered the global economy. Pandemic Strikes … Stocks Soar? 9 \"BUY THE DIP\" Growth Stocks For 2020 So what the heck is going on here? And how should you respond? Well, here’s my (admittedly contrarian) take: the stock market should be at record highs, and you should be buying stocks now—especially high-yield stocks—as long as you choose the right ones, of course. This is how I’m approaching the market today, and it’s how I think you should, too. Let’s dive into the reasons for this “buying opportunity in disguise” now. Further on, I’ll show you a closed-end fund (CEF) to consider. I see it as perfectly suited to this moment: it holds the big names of the S&P 500, including Apple (AAPL), and it pays you a healthy 7.2% dividend, too. A Split Market In response to the March crash, we saw several relief efforts that helped offset rising unemployment, and the Fed promised to buy corporate bonds if their value fell too far. Now we know that these programs did their job. In the second quarter of 2020, US GDP fell by 32.9% on an annualized basis. That’s a jaw-dropping number, but it was much better than the 40% predicted when the market was crashing. And forecasts see a 25.6% GDP increase in the third quarter, thanks in part to these relief efforts, as well as a reopening of several cities and counties. If the economy is recovering, it makes sense for stocks to recover, too. But does it make sense for them to be above where they were before the market collapsed? For some companies, the answer is clearly yes. Netflix (NFLX), Amazon (AMZN) and Facebook (FB) are winners in a world where people are more reluctant to go out, and with many discovering online shopping for the first time. Walmart (WMT) is also set to gain, since it’s spent years building its e-commerce presence and getting its huge customer base to buy from its website. Other companies, of course, are tragically out of step. We shouldn’t expect American Airlines (AAL) or AMC Entertainment (AMC) to be great stocks in a COVID-19 “new normal.” Their loss is Netflix and Amazon’s gain. Rotating Consumer Behavior, Clear as Day This is just one of many trends demonstrating a rational market of investors selling what isn’t in demand and buying what is. Similarly, a company like Lowe’s (LOW) is up over 70% from a year ago, while Ralph Lauren (RL) is down 20%. Investors Sell Yesterday’s Stocks, Buy Today’s Since people in lockdown have been taking on long-ignored reno projects and making other upgrades to their homes, and they don’t need to dress to impress as much as they used to, this is a logical stock-market reaction. But is there still enough money being spent to justify any growth? Since Lowe’s reported a shocking 30% sales surge, it seems clear the answer is yes. And Commerce Department data shows that July consumer spending actually rose to pre-coronavirus levels. A “Heads-You-Win, Tails-You-Win” CEF Paying 7.2% How do you react to such a weird moment in economic history? The obvious answer is to buy stocks, but if you’re still not convinced that’s the right move, consider the Nuveen S&P 500 Dynamic Overwrite Fund (SPXX) instead. SPXX owns the stocks in the S&P 500—its top holdings include Apple (AAPL), Microsoft (MSFT), Alphabet (GOOGL) and Visa (V)—but it also has an “insurance policy” against future downturns in the form of call options. Basically, the fund sells contracts to speculators that give them the right to buy back the stocks SPXX holds in the future at a higher price. In exchange, SPXX gets a cash payment from these speculators right away. If stocks go up, SPXX sells at a profit. And either way, SPXX keeps the cash speculators paid. It’s a win-win for SPXX investors that works best in a sideways or falling market. So if you think this market is frothy, but you can see from the data that stocks are where you need to be now, SPXX is a great option. And thanks to the dividends SPXX collects from the S&P 500 stocks it holds and the cash payouts it gets from speculators, the fund pays an annualized 7.2% dividend yield. That’s over four times greater than the 1.7% you’d get from an S&P 500 index fund. So even if the market pulls back, SPXX gives you a cash stream you can rely on as you wait for a recovery. Want More Great Investing Ideas? Free Report: 5 Bargain Funds with Safe 11% Dividends A “1-Click” Way to Grab Safe 8% Dividends The $43,000 “dividend secret” Wall Street hides from you SPXX shares were unchanged in after-hours trading Thursday. Year-to-date, SPXX has declined %, versus a 6.18% rise in the benchmark S&P 500 index during the same period."}]}