{"article": [{"url": "https://stocknews.com/news/xom-psx-cop-bp-4-energy-stocks-to-avoid-for-the-rest-of-the/", "published": 1600344500.0, "headline": "4 Energy Stocks to AVOID for the Rest of the Year", "body": "The energy sector has had a tumultuous 2020. Oil and gas companies have struggled the most as the market was in oversupply for most of the year. Many of these companies are going to have to make tough decisions about cutting production to save cash, selling assets, or using the weakness in the sector to make acquisitions. &nbsp The longer-term trend is also not great, because renewables keep getting cheaper and more efficient. Oil demand is expected to peak and start declining as well due to green energy, electric cars, and increased efficiency. Below, we provide a look at four energy stocks investors should consider selling or shorting: Exxon Mobil Corporation (XOM), BP (BP), ConocoPhillips (COP), and Phillips 66 (PSX). 7 \"SAFE HAVEN\" Dividend Stocks for Turbulent TimesExxon Mobil Corporation (XOM) As a bellwether of the oil industry, XOM sets the tone for its fellow energy companies. Though XOM has produced fairly reliable returns in recent years and decades, the company is now struggling to generate growth. This change will likely hold across posterity as the energy industry evolves, moving toward renewable sources of energy rather than fossil fuels. The POWR Ratings have XOM rated as an F, meaning it is a Strong Sell. XOM has F grades in three of the four POWR Components but for its Peer Grade which is a C. Furthermore, XOM is ranked outside of the top 30 in the Energy – Oil & Gas sector. Out of the 11 analysts who have studied XOM in-depth, three recommend selling, six recommend holding and only two recommend buying. Though XOM popped to $55 in June, it went right back down to $36 in the months since. XOM’s dividend of 9.59% is simply not guaranteed considering the state of the industry and the economy. Even if XOM pays its dividend, there is an argument to be made the money would be better spent in the form of reinvestment in the company. BP (BP) As one of the world’s largest oil businesses, BP certainly receives plenty of attention from the mainstream press. However, BP is trading at less than $40 after a steep coronavirus selloff. Investors do not believe in this stock. BP recently admitted oil demand is peaking, meaning the company’s profitability will be inherently limited as time progresses. BP recently cut its dividend by a whopping 50%. Though BP’s brass deserves credit for investing in clean energy, it might be too little too late. Even if everything goes right for this stock, it will still likely struggle to pay its dividend and hover in the $20 range. ConocoPhillips (COP) COP’s business is divided into half a dozen segments yet four of them are directly related to the declining oil industry. The POWR Ratings reveal COP has an uphill battle ahead: F grades in three of the four POWR Components and a year-to-date price return of -45%. COP briefly spiked following a considerable COVID selloff yet investors took their money off the table in the ensuing months, sending the stock down toward its prior lows. At the moment, COOP is trading at $33. However, the stock was trading between $60 and $65 before the pandemic. COP dropped 10% in one week alone earlier this September. The bottom line is the price of crude oil is likely to continue to decline or stagnate. It is quite shocking to learn oil prices have decreased every single day this month. Look for COP to move back toward its coronavirus low of $20 to $25 unless it can quickly capitalize on its investment in Canadian oil sands. Phillips 66 (PSX) PSX refines, processes, transports, markets, and stores fossil fuels across the globe. Though PSX is ranked just outside of the top 10 stocks out of 97 in the Energy – Oil & Gas category, it has F grades in each POWR Component but for its Peer Grade of B. PSX has a forward P/E ratio of 77.79, indicating it is overpriced at its current level. This stock has a -44% year-to-date price return and a three-year price return of -24%. It is quite telling that investors quickly took their profits off the table after buying PSX’s March dip, selling the stock as soon as it hit $90. PSX has not recovered from this June selloff, dropping down to the $55 level and hovering there ever since. If you own PSX, consider selling it or shorting the stock unless the company makes headway in its renewable fuel operations. XOM shares were trading at $37.27 per share on Thursday afternoon, down $0.54 (-1.43%). Year-to-date, XOM has declined -43.68%, versus a 4.67% rise in the benchmark S&P 500 index during the same period."}]}