{"article": [{"url": "https://stocknews.com/news/spy-inx-dia-iwm-qqq-what-comes-next-for-the-stock-market/", "published": 1593605300.0, "headline": "What Comes Next for the Stock Market?", "body": "(Please enjoy this updated version of this week’s commentary from the Reitmeister Total Return newsletter). Monday saw the 2nd attempt for stocks to break below 3,000. And once again support was found with stocks bouncing a few percent since then. Bulls fought hard to win this battleground above 3,000. So they will not give up easy. But often the 3rd time is the charm when it comes to removing strong areas of support. 7 Best ETFs for the NEXT Bull MarketWe will talk more about the current trading range, economic data, coronavirus update and much more to help us chart our course forward. Market Commentary Before we get too far along I wanted to remind you to register for the Reitmeister Total Return Members Only webinar this coming Monday 7/6 @ 2pm ET. I think the best use of our time would be to talk about contingency plans. Meaning that right now I see a trading range between 3,000 and 3,200 in the near term. And beyond that a return of the bear market. So it would be a good use of our time to contemplate what we would do if stocks… Remain in the trading range a long time? Break out higher? Or break out lower? On top of these 3 scenarios we will also have a portfolio review and hearty Q&A session. But you must be a member of the newsletter to watch. Click below if interested… About Reitmeister Total Return newsletter & 30 Day Trial Now back to our discussion of “home on the trading range”… As you will remember, the idea of an extended trading range was the focus of last week’s commentary. And right now that is holding true even as the # of coronavirus cases in the US surges to new record highs. It’s kind of like investors are fiddling as the country burns. Because no doubt an increase in coronavirus cases, and up to 100,000 a day estimated by some experts, would reignite the fears of the populace leading. This would lead to a slowing or even reversal of re-opening the economy. That would come hand in hand with a weakening economy. And darn well should come with lower stock prices. (unless the world truly has gone downright mad). The funny thing is that there do seem to be days when investors do get the above memo. For example, last Wednesday saw another ratcheting up of daily Coronavirus cases in the US that was hard to ignore and the S&P tumbled -2.59%. The final tally was 39,103 cases which is actually a new record hear providing a clear reminder that this problem is far from over. Since then we have endured 4 straight sessions above 40,000 including 47.3K cases on Thursday. This very noticeable increase, especially in Florida, California and Texas seemed to give investors reason to tumble below 3,000 on Monday. And indeed the market futures on Sunday night pointed in that direction. Then Monday morning investors lost heart after a momentary break below that key level. Next thing you know stocks sprint to a close at 3,053. There is such a disconnect between that idea and the realities of the economy. And sure I could march out a long, long list of economic readings at anemic levels. But let’s just focus on one today. And truly the one that matters the most. I am referring to GDP where we see 2 key estimates for Q2 coming in at… -39.5% for GDPNow model from the Atlanta Fed -35% from the Blue Chip Consensus of economic experts. Now compare that to the -8.4% GDP in Q4-2008 during the Great Recession that produced a nearly 60% decline in stock prices from peak to valley. The conclusion is obvious. There is a big disconnect between the economic picture and the historical movement of stock prices. Heck, the IMF said the same thing this past week which leads them to warn of future instability. Because of this history, I see no need to change our current hedged portfolio strategy which has served us well the past couple weeks. Especially as our gold position is hitting its stride. Beyond this temporary trading range I still expect stocks to succumb to historical patterns where a decimated economy produces lower earnings and investors run away from stocks leading to significantly lower prices. Like I said in the intro, we have been prepared for this façade above 3,000 to end. Two times a break out lower has been attempted. And two times it has failed. Indeed the third time may be the charm. So be prepared. What to Do Next? I know its crazy out there. And I am trying my best to help investors make sense and profit from the situation. The best way for me to do that is give you 30 days access to the Reitmeister Total Return. This is my newsletter service where I share frequent commentaries on the market outlook, trading strategy, and yes, a portfolio of hand selected stocks and ETFs to produce profits whether we have a bull…a bear…or anywhere in between. And right now I continue to strongly believe bear makes a lot more sense than bull. Just click the link below to see 4 stocks and 5 ETFs in the portfolio now that should rise as the market sinks back into bear territory. And then receive all the future commentary and trades as we find bottom on this move as the next and “lasting” bull market emerges. About Reitmeister Total Return newsletter & 30 Day Trial Wishing you a world of investment success! Steve Reitmeister …but everyone calls me Reity (pronounced “Righty”) CEO, Stock News Network and Editor, Reitmeister Total Return SPY shares were trading at $310.57 per share on Wednesday afternoon, up $2.21 (+0.72%). Year-to-date, SPY has declined -2.51%, versus a % rise in the benchmark S&P 500 index during the same period."}]}