{"article": [{"url": "https://stocknews.com/news/adbe-fb-msft-nvda-mgc-4-mega-cap-stocks-to-buy-and-hold-for-the-rest/", "published": 1598357300.0, "headline": "4 Mega-Cap Stocks to Buy and Hold for the Rest of 2020", "body": "Mega-cap stocks are the largest stocks in the market. They generally have a market cap of over $200 billion. Most companies that reach this level have a reliable brand name and operate in different countries around the world. The current rally we’ve been experiencing has been primarily driven by mega-cap stocks. The Vanguard Mega Cap ETF (MGC), which tracks the MSCI US Large Cap 300 Index, a benchmark index consisting of America’s largest companies, is up almost 10% year-to-date, compared with a 6.5% gain for the S&P 500. As I wrote in a previous article, I believe the stock market is currently a bubble. Many investors feel that mega-cap stocks are driving this bubble up, as the FAAMG stocks, Facebook (FB), Apple (AAPL), Amazon (AMZN), Microsoft (MSFT), and Alphabet (GOOGL) currently represent more than 20% of the S&P 500. 7 Best ETFs for the NEXT Bull MarketWhile many mega-cap companies are overvalued based on numerous valuation metrics, some of them deserve these high valuations. I evaluate stocks based on several factors, such as past and future growth, profitability, financial health, and short and medium-term momentum. I ran my proprietary screen for mega-cap stocks, and the results yielded four well-known companies that are also rated a “Strong Buy” by our exclusive POWR Ratings system: Adobe (ADBE), Facebook (FB), Microsoft (MSFT), and NVIDIA (NVDA). Adobe (ADBE) ADBE provides content creation, document management, and digital marketing and advertising software and services to creative professionals and marketers. The company operates with three segments: digital media content creation, digital experience for marketing solutions, and publishing for legacy products. ADBE is one of the largest software companies globally and mainly derives revenue through licensing fees from customers. The company has been benefiting from strong demand for its creative suite. Creative Cloud, Document Cloud, and Adobe Experience Cloud are primarily driving sales growth. In the fiscal first quarter, total Digital Media Annualized recurring revenue, a key cloud performance measure, grew to $8.73 billion. The company is also seeing increasing subscription revenues and momentum in its mobile apps. ADBE has a three-year average sales growth rate of 22.6% and a forward EBITDA growth rate of 30%. In terms of profitability, the stock has a return on equity of 34% and a return on invested capital of 25.4, indicating strong profitability. The stock is currently rated a Strong Buy by our POWR Ratings system. It holds a grade of A in every POWR component, including Trade Grade, Buy & Hold Grade, Peer Grade, and Industry Rank. It is the #2 ranked stock in the Software – Application industry. Overall, ADBE has excellent long-term growth potential due to its competitive advantage, the global growth of creative professionals, and the corporate transition to cloud products. Facebook (FB) FB is the world’s largest online social network, with 2.5 billion monthly active users. The company’s portfolio consists of the Facebook app, Instagram, Messenger, and WhatsApp. Users can engage with one another by exchanging messages and sharing news events, photos, and videos. These engagements can create an addictive fear of missing out, bringing users back to the platform repeatedly. Advertising revenue represents more than 90% of the company’s total revenue, half of which comes from the U.S. and Canada. The company is continuing to see an increase in online and mobile advertising spending and is looking to increase revenue through video advertising. Video has become very popular on its platforms and is the most lucrative form of digital advertising. Instagram also serves as a moneymaker for the company due to its ad platform. FB is also looking to monetize Messenger and WhatsApp further. The stock has a three-year sales growth rate of 31.2% and projects a 23.9% growth rate next year. The company has a return on equity and an ROIC over 21%. It also has a current ratio of 6.0, which means it has plenty of liquidity to pay off debt. FB is rated a Strong Buy by our POWR Ratings system. Every POWR component has a grade of A. The company is the #4 ranked stock in the Internet industry. The company has tremendous long-term revenue and EPS growth potential due to the shift from traditional advertising to digital. Microsoft (MSFT) MSFT develops and licenses consumer and enterprise software. The company is widely known for its Windows operating systems and Office productivity suite. It is organized into three segments: productivity and business processes, which include Microsoft Office, cloud-based Office 365, Exchange, SharePoint, Skype, LinkedIn, and Dynamics, intelligence cloud, which includes infrastructure- and platform-as-a-service offerings Azure, Windows Server OS, SQL Server, and personal computing, which includes Windows Client, Xbox, Bing search, display advertising, and Surface laptops, tablets, and desktops. The company has a dominant position in the desktop PC market, with its operating systems being used in most PCs worldwide, especially in the enterprise market where MSFT generates most of its revenue. As computing is undergoing changes where companies are switching to the “bring-your-own-device” model, MSFT has been launching new Surface devices that may encourage enterprises to stick with Windows. The company has also become a significant player in cloud computing. Its Azure product has increased availability in 58 regions globally. MSFT is also expanding its Microsoft Teams subscriber base by adding new capabilities that enable users to work from home during the coronavirus crisis. MSFT has a three average sales growth rate of 16.7% and an EPS three-year growth rate of 23.5%. Forecasts for next year include a 16.7% jump in revenue and 13.6% growth for EPS. The company has a sky-high return on equity of 37.4% and an ROIC of 25%. The stock is rated a Strong Buy by our POWR Ratings system. It holds a grade of A in every POWR component and is the #1 rated stock in the Software-Application industry. The company should see continued success in all of its cloud-based businesses. As the cloud grows, MSFT is likely to increase its operating margin over time. NVIDIA (NVDA) NVDA is a leading designer of graphics processing units that enhance the experience of computing platforms. The firm’s chips are used in a variety of end markets, including high-end PCs for gaming, data centers, and automotive infotainment systems. The company has recently expanded its focus from traditional PC graphics applications to more favorable opportunities such as artificial intelligence and autonomous driving. The company reported its latest financial results last week with earnings per share of $2.18, compared with the consensus estimate of $1.97. The EPS was up 21.1% from the previous quarter. Revenue came in at $3.87 billion, a 50% increase from the same quarter last year. NVDA is benefiting from coronavirus social distancing as many people continue to work from home, and children will likely learn from home in the upcoming school year. The company has seen steady growth in gaming due to increased demand in GeForce desktops and notebook GPUs. The firm’s data center business is seeing increased growth due to a surge in Hyperscale demand. NVDA is rated a Strong Buy in our POWR Ratings system. Similar to every other stock in this list, it has a grade of A in every POWR component. It is also the #2 ranked stock in the Semiconductor & Wireless Chip industry. NVDA has a forward EBITDA growth of 30.0%, so future growth looks strong. The company’s data centers and gaming segments should carry the stock to new heights. Want More Great Investing Ideas? The Best of StockNews 2 Step Process to Sell @ Market Top in September 9 “BUY THE DIP” Growth Stocks for 2020 ADBE shares . Year-to-date, ADBE has gained 46.88%, versus a 8.02% rise in the benchmark S&P 500 index during the same period."}]}