{"article": [{"url": "https://stocknews.com/news/eqix-dlr-cone-cor-4-top-reits-for-the-second-half-of-2020/", "published": 1594123700.0, "headline": "4 Top REITs for the Second Half of 2020", "body": "Real Estate Investment Trusts (REITs) are companies that work with income-generating properties and can be publicly traded like stocks. REITs usually pay a majority of their earnings as dividends which could generate a steady income for shareholders. As this industry is highly dependent on debt, the ongoing low interest-rate environment has been helping participants channel the majority of revenues to the bottom line, as interest expenses are minimal. While the entire REIT sector should perform well, since there are no expectations of the Fed hiking rates anytime soon, the REITs Data Centers sector is particularly well-positioned to outperform. This group has soared during these troubled times as the Coronavirus outbreak has resulted in increased demand for data centers and falling interest rates. 7 \"SAFE HAVEN\" Dividend Stocks for Turbulent TimesJust like the majority of industries, REIT stocks as a whole declined during the initial phases of the pandemic. However, the data center stocks have differentiated themselves from the rest of the sector. The Pacer Benchmark Data & Infrastructure Real Estate SCTR ETF (SRVR) has gained 13.2% versus the iShares Core US REIT ETF’s (USRT) loss of 17.3%. This compares to the S&P 500’s year-to-date loss of 1.6%. According to POWR Industry Rankings, the REIT Data Centres Industry ranks #3 out of 123 industries. Here are four of the top-performing stocks in this industry: Equinix, Inc. (EQIX) EQIX connects information assets with an emphasis on data centers and Internet connection. EQIX added its ninth IBX data center in the Dallas Infomart campus which is worth $142 million. The company is looking to expand its network in Canada. It has initiated its expansion by buying 13 Bell data centers for $750 million from Bell Canada Enterprises (BCE), a Canadian mass media company. EQIX has helped Zoom (ZM) and Cisco Systems Inc.’s Webex (CSCO), two of its most important customers in building their capacities to meet rising demand during this period by providing Equinix Internet Exchange and Equinix Cloud Exchange Fabric, respectively. Ten out of twelve Wall Street analysts have a “Buy” rating for this stock. The stock has a dividend yield of 1.48% and a payout ratio of 61.3%. EQIX has gained 24.8% year to date and has returned 41.6% over the past year. EQIX has recorded a 4% year-over-year increase in gross profit and a 4.9% year-over-year increase in total assets for the first quarter this year. The company has an “A” for Trade Grade, Buy & Hold Grade, Industry Rank, and Peer Grade. As a result, it has a “Strong Buy” according to POWR Ratings. EQIX also ranks #1 in the REIT-Data Centers industry. Digital Realty Trust, Inc. (DLR) DLR is a real estate investment trust that deals with technology-related real estate. It focuses on the daily operations of tenants, corporate data center users, and financial services. DLR has strategically expanded its network over the years through partnerships and acquisitions. DLR acquired Interxion (INXN), a European cloud-neutral colocation center in an $8.4 billion deal adding 54 assets and a large development pipeline in the first quarter. The company has collaborated with Ascenty, a Latin data center service provider to enter the Mexican market. DLR also recently announced the installation of a carrier-neutral data center in Hong Kong estimated to be completed by mid-2021. The company’s earnings per share increased by 95.6% year over year in the first quarter. As of March 31st, 2020, DLR’s net income increased by 111.6% year over year. The stock has a dividend yield of 3.02% and a payout ratio of 69.3%. There has been a continuous increase in dividend payments over the last fifteen years. DLR has gained 25.5% year to date and has returned 27% over the past year. How does DLR stack up for the POWR Ratings? A for Trade Grade A for Buy & Hold Grade A for Industry Rank D for Peer Grade A for overall POWR Ratings It is the #2 rated stock in the REIT’s Data Centers industry. CyrusOne Inc. (CONE) CONE invests in multi-tenant and carrier-neutral data center properties. The company assists global firms seeking enterprise colocation solutions, catering to more than 185 of Fortune 1000 customers worldwide. CONE announced new Internet Computer Concepts and Asetek technologies a few months back. When this technology is used with CONE’s standard cooling design, there is a considerable improvement in power usage effectiveness and customer workload efficiency. The company has also been named as a certified partner for the NVIDIA DGX-Ready Data Center program which helps develop AI infrastructure for organizations worldwide. The highest analyst target is $83.30 which is 10% off its last closing price of $75.43. The stock has a dividend yield of 2.65% and a payout ratio of 53.1%. For the first quarter, CONE has a 9.3% year-over-year increase in revenue. YTD, CONE is up 17.2%. Our POWR Ratings system gives CONE a Strong Buy rating. It has an “A” for Trade Grade, Buy & Hold Grade, Industry Rank, and a “B” for Peer Grade. Among REIT Data center companies, it’s ranked #3. CoreSite Realty Corporation (COR) COR is a Denver-based REIT that provides cloud and interconnection data center solutions. COR completed the SV8 data center on the Santa Clara campus which will ensure high-count fiber connectivity and sustainable functionality. COR announced last month that it would provide Oracle FastConnect available on the CoreSite Open Cloud Exchange which would increase the quality of network connections. The stock has a dividend yield of 3.94% and an impressive payout ratio of 94.9%. COR is approaching its 52-week high of $123.74. Odds of continuation are strong given its high dividend and stable cash flows. The company’s total assets increased by $211 million year over year in the first quarter. COR is rated Strong Buy in the POWR Ratings and ranked #4 in the REITs-Data Centre space. It has an “A” for TradeGrade and Buy & Hold Grade. Want More Great Investing Ideas? 9 “BUY THE DIP” Growth Stocks for 2020 Is the Bull S#*t Rally FINALLY Over? 7 “Safe-Haven” Dividend Stocks for Turbulent Times Top 3 Investing Strategies for 2020 EQIX shares were trading at $725.39 per share on Tuesday afternoon, up $2.72 (+0.38%). Year-to-date, EQIX has gained 25.29%, versus a -0.98% rise in the benchmark S&P 500 index during the same period."}]}