{"article": [{"url": "https://stocknews.com/news/amzn-docu-2-tech-stocks-to-buy-the-dip/", "published": 1594728500.0, "headline": "2 Technology Stocks to Buy on Dips", "body": "It’s been an incredible past few months for the Nasdaq-100 (QQQ) and the tech names in a rally that is one of the strongest in 20 years, nearly mirroring the move we saw off of the 1998 correction lows. Following the 1998 correction, the Nasdaq-100 gained 102% in 92 trading days, and this rally was up 64% in 77 days as of yesterday’s highs. This relentless advance has produced several massive winners in the index, but it’s also contributed to quite a bit of complacency, which has left the QQQ vulnerable to a correction, and the high-growth names vulnerable as well. However, similar to the correction following the massive rally in 1998, I would expect any significant pullbacks in the high-tech growth names to be buying opportunities. Therefore, it’s worth building a shopping list of the best names, and two names stand out if we do see healthy corrections. Let’s take a closer look below: 7 Best ETFs for the NEXT Bull Market(Source: TC2000.com) The key ingredients to selecting the best growth stocks are superior strength vs. peers and high-octane earnings growth, and when it comes to Docusign (DOCU) and Amazon (AMZN), these companies check both boxes. Docusign is one of the top-performing stocks year-to-date, up over 150% year-to-date, dwarfing the performance of the QQQ. Meanwhile, Amazon has also handily outperformed the QQQ, up 68% year-to-date, triple the QQQ’s 21% year-to-date return. However, it’s the earnings growth for both companies that is most impressive, with annual EPS expected to double for both DOCU and AMZN between FY-2020 and FY-2022. This translates to a compound annual EPS growth rate of over 40%. Let’s take a closer look below: (Source: YCharts.com, Author’s Chart) Beginning with Amazon, we can see that the company has seen a powerful earnings trend since FY-2015, and managed to grow annual EPS by over 1500% in just five years. The retail disruptor’s FY-2019 annual EPS came in at $23.01, up 14% year-over-year, but is expected to dip to $20.35 in FY-2020 due to higher investments and higher pay for workers. While this might spook off some investors, it’s no reason to write off the stock, as this is merely a very brief aberration within a powerful earnings trend. As the FY-2021 and FY-2022 annual EPS estimates show, Amazon is expected to earn $38.80 and $55.95 in the following two years, more than making up for the brief lapse in earnings growth in FY-2020. Therefore, while the stock might look very expensive at 150x FY-2020 annual EPS estimates, it’s worth noting that all stocks set to double annual EPS in 2 years trade at what seem to be very lofty multiples. Based on FY-2022 annual EPS of $55.95, Amazon is currently trading a 2-year forward multiple of 54, which is still quite expensive, though not as expensive as some of the other tech high-fliers. However, if we could see a 15% to 20% pullback in Amazon closer to $2,750, I believe this would provide a low-risk buying opportunity. At these levels, the stock would relieve most of its overbought condition and would be trading at less than 50x FY-2022 annual EPS, a very reasonable valuation for a company set to grow annual EPS by more than 80% next year ($20.35 to $38.80). However, at current levels, I see Amazon as close to fully priced, and therefore, while I continue to hold my core position, I trimmed some shares above $3,100. (Source: YCharts.com, Author’s Chart) Moving over to Docusign, the company was posting net losses per share from FY-2016 through FY-2018 as the company was in its growth phase, funneling any profits back into its perfecting product and customer acquisition. Since then, however, the company has seen market-leading growth, with annual EPS growing by 240% last year to $0.31, and earnings estimates are projecting another massive year in FY-2021. Currently, annual EPS estimates are sitting at $0.51, forecasting 64% growth year-over-year, and this growth is lapping a year of triple-digit growth. This is one of the highest two-year stacked earnings growth rates in the market currently at above 300%, placing the company in a group of just 50 companies out of 7000 with this explosive growth rate. If we look ahead to FY-2022 annual EPS estimates, annual EPS is forecasted to increase to $0.85, translating to yet another year of incredible growth. Assuming the company meets or beats these estimates, this would translate to a 66% growth year-over-year, maintaining the two-year stacked triple-digit growth rate. Like Amazon, the high earnings multiple might scare investors off, as Docusign is currently trading at 370x FY-2020 earnings estimates. However, Shopify (SHOP) has been selling for a multiple of near 1000 for years now, and the top-50 growth stocks in the market often trade at very high multiples as investors don’t care about what they’re earning this year, they’re looking out 24-36 months. While Docusign is not expensive here, though, it’s not cheap either, and I would prefer to see a 20% pullback to $165.00 or lower to bake in a margin of safety. If we were to see the stock trade down into the lower-risk $160.00 – $165.00 zone before year-end, I believe this would provide a low-risk buying opportunity. While most tech names remain over-extended, AMZN and DOCU have two of the strongest earnings growth rates in the market currently, and a product or service that is seeing an accelerated trend in their favor due to COVID-19. While both names have gotten ahead of themselves here as have many tech names, I do not believe their runs are over yet on a long-term basis, and I believe the first sharp correction should provide a buying opportunity. Therefore, if we were to see a pullback to $165.00 on DOCU and $2,750 on AMZN, I believe this would be a low-risk area for investors to add to their positions as I ultimately expected higher highs for both names in FY-2021. For now, I remain long both names, but have no interest in adding to my position here, and have been trimming a little off the top recently to re-balance. Disclosure: I am long DOCU, AMZN, short QQQ as a hedge Disclaimer: Taylor Dart is not a Registered Investment Advisor or Financial Planner. This writing is for informational purposes only. It does not constitute an offer to sell, a solicitation to buy, or a recommendation regarding any securities transaction. The information contained in this writing should not be construed as financial or investment advice on any subject matter. Taylor Dart expressly disclaims all liability in respect to actions taken based on any or all of the information on this writing. Want More Great Investing Ideas? 9 “BUY THE DIP” Growth Stocks for 2020 Top 5 WINNING Stock Chart Patterns 7 “Safe-Haven” Dividend Stocks for Turbulent Times AMZN shares fell $11.00 (-0.35%) in premarket trading Tuesday. Year-to-date, AMZN has gained 69.06%, versus a -1.20% rise in the benchmark S&P 500 index during the same period."}]}