{"article": [{"url": "https://stocknews.com/news/apha-mj-acb-is-aphria-stock-a-long-term-buy/", "published": 1601986100.0, "headline": "Is Aphria's Stock a Long-Term Buy?", "body": "The coronavirus pandemic has wreaked havoc on many non-tech industries, including the cannabis industry. Just take a look at the ETFMG Alternative Harvest ETF (MJ), which is down 37% year-to-date. Though many cannabis companies have seen their stocks tank in 2020, Aphria (APHA) is performing better than its peers. APHA is one the largest cannabis companies in Canada and has been able to deliver consistent results. The company has reported positive EBITDA for the past five consecutive quarters and grew its revenue by more than 100% in its 2020 fiscal year. The company’s products are well liked. Its CBD oil, indica and sativa products won seven Canadian Cannabis Awards last year. Its vape segment has a 29% market share in Canada. And APHA also has a growing international presence with operations in Germany and Latin America. 7 Best ETFs for the NEXT Bull MarketAnalysts also love the stock. Out of eight tracked by Tipranks, all of them rate the stock a “Buy,” with an average price target of $7.13. Pablo Zuanic, of Cantor Fitzgerald, recently said that APHA is their top pick, based on their focus on the value segment of the market. I highly favor value brands, compared to the more expensive premium brands , like Aurora Cannabis (ACB) focuses on, due to the fact that the numbers have shown the highest revenue growth in value brands. Consumers want a reason to buy legal cannabis, but have been deterred by higher prices. If the licensed producers can offer quality at competitive prices, those companies are more likely to substantially grow revenues. Investors are excited about APHA’s upcoming earnings report, which is scheduled to be released on October 15th. With a healthy balance sheet, strong cash position, and solid revenue growth over the past few quarters, APHA remains my favorite large-cap Canadian licensed producer. (Disclosure: The author is long APHA) Want More Great Investing Ideas? Do NOT Buy Stocks Before the Election! 7 “Safe-Haven” Dividend Stocks for Turbulent Times Chart of the Day- See Christian Tharp’s Stocks Ready to Breakout APHA shares were trading at $5.09 per share on Tuesday morning, up $0.06 (+1.19%). Year-to-date, APHA has declined -2.49%, versus a 6.91% rise in the benchmark S&P 500 index during the same period."}]}