{"article": [{"url": "https://stocknews.com/news/kr-fms-hum-an-4-great-stocks-to-buy-on-sale-right-now/", "published": 1598443700.0, "headline": "4 GREAT Stocks to BUY on SALE Right Now", "body": "Investing during a stock market bubble makes it more challenging to find stocks trading below their worth. Yet, there are excellent stocks to be had for bargain-based prices. All you need to do is look at sectors that are out of favor. Over the last three months, Technology and Consumer Discretionary have been the leading sectors with 26.9% and 25.2% returns, respectively. If we look at some of the lowest-performing sectors, such as Consumer Staples and Healthcare, there are values. The healthcare sector is up 1.5% over the past three months, and the Consumer Staples sector is up 4.3%. When looking for stocks that are trading at low valuations, I employ a few different valuation metrics, such as the price to earnings ratio (P/E), the price to sales ratio (P/E), and the EV/EBITDA ratio. The EV/EBITDA ratio compares a company’s enterprise value (EV) to its earnings before interest, taxes, depreciation & amortization (EBITDA). I typically look for an EV/EBITDA below 10, a P/E below 15, and a P/S below 2, but those figures are not set in stone. While a low price is desired, we can’t just go out and buy any cheap stock. We also want a company with strong growth and profit potential. 9 \"BUY THE DIP\" Growth Stocks For 2020Here are four strong companies that can be purchased at attractive prices: The Kroger Company (KR), Fresenius Medical Care (FMS), Humana (HUM), and AutoNation (AN). The Kroger Company (KR) KR is a leading American grocer, with 2,757 supermarkets operating under several different banners throughout the country. Approximately 82% of its stores have pharmacies, while more than half sell fuel. The company also operates more than 300 fine jewelry stores. The stores offer private-label products, a third of which is manufactured in-house. The company has been benefiting from the coronavirus as it reported better than expected first-quarter fiscal 2020 results. KR reports second-quarter earnings on September 10th. The company is a dominant player in the grocery game, which has enabled it to increase market share by offering plant-based products, digital coupons, and online pickup service in-store. The firm’s “Restock Kroger” program involves investing in an omnichannel platform, identifying alternative profit streams, and lowering expenses. KR has a P/E of 13.9, a P/S of 0.2, and an EV/EBITDA of 6.9, so there is no question the stock is undervalued. The company should see growth based on strong sales from the pandemic, investments in e-commerce, a strong loyalty program, and private-label offerings. The company’s loyalty program has led to 97% of transactions captured on its loyalty cards. In a recessionary period, its lower-priced private label products should continue to drive revenue. The company is rated a Strong Buy by our POWR Ratings system. Three out of the four components that make up the POWR Ratings are graded an A, including Trade Grade, Buy & Hold Grade, and Industry Rank. KR is the #5 ranked stock in the Grocery/Big Box Retailers industry. Fresenius Medical Care (FMS) FMS is the largest dialysis company in the world. It treats approximately 345,000 patients in 4,000 clinics worldwide, as of the end of last year. The company is also a leading supplier of dialysis products, including machines, dialyzers, and concentrates. FMS accounts for 35% of the global dialysis products market and benefits from being the only fully integrated dialysis business in the world. Its services segment accounts for 80% of the firm’s revenue. This includes care coordination and ancillary operations. Its product segment accounts for the other 20%. The products have a higher margin, which helps strengthen the company’s bottom line. The company had a strong second quarter with earnings per share of $0.66, which beat analyst expectations and increased by 27% over the prior year. FMS benefitted from both health care products and services, which saw revenue growth in the second quarter. The company has a wide range of dialysis products and services that have set it apart. FMS has a P/S of 1.2 and an EV/EBITDA of 8.1. The company also has a low price to book ratio of 1.9. The company is in a strong position due to its market share. It has made investments to improve its cost base and capture growth opportunities such as home dialysis to support growth over the medium and long-term. The stock is rated a Strong Buy in our POWR Ratings system. It has a grade of A for Trade Grade and Buy & Hold Grade, and a B for Peer Grade and Industry Rank. It is also the #2 ranked stock in the Medical – Services industry. Humana (HUM) HUM is a health insurance company based in Louisville, Kentucky. The company had created a niche by specializing in government-sponsored programs. Almost all its medical memberships stemmed from individual and group Medicare Advantage, Medicaid, and the military’s Tricare program. The company is also a leader in stand-alone prescription drug plans for seniors enrolled in traditional fee-for-service Medicare. The firm also provides other healthcare services, including primary-care services and pharmacy benefits management. The company’s Medicare business has it well-poised for growth for the foreseeable future. Acquisitions have been another growth driver. The purchases of Family Physicians Group, Your Home Advantage, Curo, and a share in Kindred at Home, have helped HUM strengthen its reach in the home health and hospice market. After posting earnings of $12.56 per share on August 5th, a year over year increase of 107%, the company reaffirmed its earnings projection for 2020. HUM has a P/E ratio of 15.4, a P/S of 0.8, and an EV/EBITDA of 11.0. While the P/E and EV/EBITDA ratios were slightly over my typical targets, I thought this stock belonged in this list due to its positive long-term growth outlook. The company should see long-term growth due to rising demand for its primary Medicare Advantage plans, which make up over 80% of its total revenue. More and more baby boomers are opting for the private Medicare option. The company is rated a Strong Buy by our POWR Ratings system. It has a grade of A in three out of the four POWR components except for Industry Rank, which HUM has a grade of B. The firm is the #2 stock in the Medical – Health Insurance industry. AutoNation (AN) AN is the largest automotive dealer in the United States, with over 230 dealerships. The company also has five AutoNation USA used-vehicle stores and 81 collision centers across 16 states, primarily based in the Sunbelt metropolitan areas. New-vehicle sales account for a little over half of its revenue. The company also sells used vehicles, parts, repair services, and offers auto financing. The company’s diversified mix of products and multiple income streams make this stock a buy. AN’s used vehicle business has been performing well during the current economic slowdown as consumers buy more used vehicles. The firm’s strong footprint, store expansions, and extensive dealer network should drive long-term profits. As AN enhances its digital solutions, it should boost its market presence. AN has a P/E of 16.8, a P/S of 0.3, and an EV/EBITDA of 11.4, reflecting an attractive valuation for the stock. The company has initiated several cost-cutting measures, including staffing adjustments, capital expenditure reduction, and compensation cuts to help the company weather any further disruptions due to the pandemic. The company also has more than $1.6 billion of liquidity, which will help navigate any auto market downturn. The company is rated a Strong Buy by our POWR Ratings system. The company has a grade of A in Trade Grade, Buy & Hold Grade, and Peer Grade. It is the #4 ranked stock in the Auto Dealers & Rentals industry. Want More Great Investing Ideas? The Best of StockNews 2 Step Process to Sell @ Market Top in September 9 “BUY THE DIP” Growth Stocks for 2020 KR shares . Year-to-date, KR has gained 27.42%, versus a 9.10% rise in the benchmark S&P 500 index during the same period."}]}