{"article": [{"url": "https://stocknews.com/news/aapl-msft-qcom-orcl-txn-5-strong-buy-dividend-paying-tech-stocks-to-buy-now/", "published": 1598616500.0, "headline": "5 'Strong Buy' Dividend-Paying Tech Stocks to Buy Now", "body": "The stock market is trading at all-time highs as investors are increasingly optimistic about the economic recovery and coronavirus case counts in the most hard-hit states seem to be under control. Tech stocks have been the primary drivers of this bull market. Over the last three months, the Technology Select Sector SPDR ETF (XLK) is up 30%. However, this outperformance is raising concerns of overvaluation. Overvalued stocks tend to underperform especially if revenue growth misses expectations. Investors should consider tech stocks that pay dividends that will offer a cushion in the case of a market correction. Here are the five tech stocks that stand out for their exceptional fundamentals and reliable dividend history: Apple Inc. (AAPL), Microsoft Corporation (MSFT), QUALCOMM Incorporated (QCOM), Oracle Corporation (ORCL), and Texas Instruments Incorporated (TXN). 9 \"BUY THE DIP\" Growth Stocks For 2020Apple Inc. (AAPL) AAPL has been uniformly paying dividends every quarter for the past few years. Over the last 5 years, the average dividend per share growth for AAPL was 10.7% per year. The company has also been consistently increasing its dividend payout after its second-quarter each year. The most recent dividend declared by AAPL was $0.82 per share for its quarter ended June 2020, which translates into a forward annual dividend yield of 0.65%. AAPL generated a free cash flow of $14.7 billion in its last reported quarter, registering a 53% growth from its comparable quarter last year. The company also generated $16.3 billion in cash flow from operating activities during the quarter, accounting for a 40% increase year-over-year. Moreover, AAPL is producing more trailing twelve-month cash flow than 98.3% of US dividend stocks in the StockNews.com universe. AAPL’s top-line for its fiscal third quarter ended June was $59.7 billion, up 11% from the year-ago quarter. International sales formed more than 54% of total revenue. The company generated $26 billion in phone sales in the June quarter alone. The pandemic also acted as a catalyst to drive up sales of MacBook and iPad, contributing $13.6 billion in June quarter sales. AAPL reported an earnings surprise of 26.5% in the last reported quarter, with an EPS of $2.58. The EPS is expected to grow at 19.5% next year. AAPL has recently been all over the news for becoming the first company to cross the $2-trillion market capitalization mark. It closed yesterday’s trading session at $500.04. The stock is already up 150% from its 52-week low of $199.15. It gained more than 70% year-to-date. How does AAPL stack up for POWR Ratings? A for Trade Grade A for Buy & Hold Grade A for Peer Grade A for Industry Rank A for Overall POWR Rating. You can’t ask for better. It is ranked #1 out of 28 stocks in the Technology – Hardware industry. Microsoft Corporation (MSFT) MSFT has been consistently paying dividends every quarter since 2003. Over the last 10 years, the average dividend per share growth for MSFT was 14.3% per year. The company has also been constantly increasing its dividend payout amount during the first quarter each year. The most recent dividend declared by MSFT was $0.51 per share for its fourth quarter ended June. MSFT pays an annual dividend of $2.04 which yields 0.9%. Free cash flow for the company increased 15.5% year-over-year to $13.93 billion in the last reported quarter. The company also generated $18.67 billion in cash flow from operations, a 16% improvement year-over-year. Additionally, over the past six years, the company has issued more dividends than 98.4% of other dividend-issuing US stocks in the StockNews.com universe. The top-line for the quarter grew 13% year-over-year to $38 billion. The Intelligent Cloud segment revenue witnessed a 17% increase year-over-year primarily driven by server products and cloud services amid the pandemic. The EPS for the quarter came in at $1.78, increasing 15% year-over-year. Moreover, EPS is expected to grow by 13.6% next year. MSFT is on a strategic expansion spree. It has recently announced a partnership with Universal Film Entertainment group to accelerate live-action and animated productions. It has also partnered with Standard Chartered Bank to become a cloud-first bank. Mastercard (MA) has collaborated with MSFT to accelerate innovation across digital commerce. MSFT closed yesterday’s trading session at $226.58 after hitting an all-time high of $231.15. Additionally, the stock has gained more than 43% year-to-date. MSFT’s strong momentum is reflected in its POWR Ratings, it has a “Strong Buy” rating with an “A” in Trade Grade, Buy & Hold Grade, Peer Grade, and Industry Rank. Within the Software – Application industry, it’s ranked #1 out of 92 stocks. QUALCOMM Incorporated (QCOM) QCOM has a dividend yield of 2.24%. The company has been consistently paying dividends every quarter since 2003. The company has also been constantly increasing its dividend payout amount biannually. Over the last 10 years, the average dividend per share growth for QCOM was 14% per year. The most recent dividend of $0.65 per share was declared by the company for its fiscal third quarter ended June, implying a $0.02 or 4.8% growth. The company’s second-quarter results were impressive. Free cash flow for the quarter came in $1.45 billion while cash generated from operations stood $1.87 billion. QCOM returned $733 million to its shareholders during the quarter in the form of dividends. The company reported a top-line of $4.89 billion while improving its gross margins to 57.5%. EPS for the quarter came in $0.86, beating the consensus estimates by 21.1%. EPS is expected to grow 62.8% next year. The stock is currently trading at $116.02, gaining more than 31% year-to-date. Furthermore, it has doubled in value since hitting a low of $58 during the market crash in March. It’s no surprise that QCOM is rated a “Strong Buy” in our POWR Ratings system. It also has an “A” for Trade Grade, Buy & Hold Grade, Peer Grade, and Industry Rank. It is ranked #5 out of 86 stocks in the Semiconductor & Wireless Chip industry. Oracle Corporation (ORCL) ORCL has been consistently paying dividends each quarter since 2009. Over the last 5 years, the average dividend per share growth for ORCL was 13.7% per year. The most recent dividend declared by the company was $0.24 per share for the last reported quarter, cumulating to an annual dividend of $0.96. While the four-year average dividend yield for ORCL is 1.59%, the current annual dividend translates to a 1.68% yield. ORCL generated $3.61 billion in cash from operating activities in the fiscal fourth quarter. The company delivered a free cash flow of $3.18 million. The top-line came in at $10.44 billion with 81% gross margin. The cloud services and license support contributed 66% to the overall revenue, growing 3% year-over-year in constant currency. EPS for the quarter came in $1.2, delivering an earnings surprise of 4.3%. Additionally, EPS is estimated to grow by 8.9% next year. The Nissan Motor Corporation has recently migrated its high-performance computing (HPC) workloads to Oracle Cloud Infrastructure to improve its speed to design and test new cars. Moreover, the company had issued $20 billion worth investment-grade notes earlier this year to improve its liquidity. The stock closed yesterday’s trading session at $57.18 after hitting an all-time high of $58.45. It has already recovered more than 44% from its March lows and gained 8% year-to-date. ORCL’s POWR Ratings reflect a promising outlook. It has an overall rating of “Strong Buy” with an “A” for Trade Grade, Peer Grade, Buy & Hold Grade, and Industry Rank. Among the 92 stocks in the Software – Application industry, it’s ranked #4. Texas Instruments Incorporated (TXN) TXN has been uniformly paying dividends every quarter since 1972. Its dividend has grown at a CAGR of 21% over the last five years. The company has also been constantly increasing its dividend payout amount during its third-quarter each year. The most recent dividend declared by TXN was $0.9 per share for its second quarter ended June. The annual dividend aggregates to $3.6, which yields 2.54%. TXN’s free cash flow grew 5.2% year-over-year in the last reported quarter to $1.59 billion while the company witnessed $1.72 billion cash flow from operations. The company issued $823 million in the form of a quarterly dividend. Furthermore, TXN has returned more capital to shareholders through its dividend issuances over the last six years than 95% of other dividend-paying US stocks in the StockNews.com Universe. TXN reported revenue of $3.24 billion for the quarter, decreasing 12% from the year-ago quarter. The weakness in the automotive market is primarily responsible for this decline. However, both the Analog and Embedded Processing segments had positive sequential growth in the second quarter. The company also reported EPS of $1.48, beating the consensus estimate by 68.2%. The stock closed yesterday’s trade at $141.49, after hitting an all-time high of $143.23. It has increased by more than 10% year-to-date. TXN is rated a “Strong Buy” in our POWR Ratings system, consistent with its growth estimates. It is rated “A” in Trade Grade, Buy & Hold Grade, Peer Grade, and Industry Rank. It is ranked #6 in the 86-stock Semiconductor & Wireless Chip industry. Want More Great Investing Ideas? 7 Best ETFs for the NEXT Bull Market Why Stocks Could Drop 20% in September? 9 “BUY THE DIP” Growth Stocks for 2020 AAPL shares were trading at $499.23 per share on Friday afternoon, down $0.81 (-0.16%). Year-to-date, AAPL has gained 71.18%, versus a 10.04% rise in the benchmark S&P 500 index during the same period."}]}