{"article": [{"url": "https://stocknews.com/news/unp-cni-nsc-csx-4-railroad-stocks-headed-in-the-right-direction/", "published": 1598875700.0, "headline": "4 Railroad Stocks Headed in the RIGHT Direction", "body": "During the initial stages of the economic shutdown, the railroad industry came to standstill. Only freight transport was allowed within the country to ensure the availability of adequate resources in the worst-hit regions. From these depths, there has been a rebound and continued improvement. Still, freight traffic is down 17.6% year-over-year in July 2020. As most businesses resumed operations in the April-June quarter, the freight industry witnessed a higher volume of products transported to various parts of the country. Though returning to the pre-coronavirus levels might take some time, most railway transportation companies managed to generate profits in the last reported quarter. Many stocks in the industry are at new, 52-week highs. Union Pacific Corporation (UNP), Canadian National Railway Company (CNI), CSX Corporation (CSX), and Norfolk Southern Corporation (NSC) reported impressive net income and cash flow balance for the quarter and should outperform. 7 Best ETFs for the NEXT Bull MarketUnion Pacific Corporation (UNP) UNP is a rail transport service provider for agricultural products, construction materials, and fossil fuels such as coal, petroleum, and industrial chemicals. UNP’s rail network comprises 32,340 route miles connecting Eastern regions to the pacific coast. As a major freight transportation company, UNP is an important part of the US supply chain. Though affected by the economic slump, UNP’s revenues are expected to pick up with companies returning to fully functional modes. For the second quarter ended June 2020, UNP managed to generate $3.97 million in operating revenues despite the decline in the railway operation volume. Its net income stood at $1.13 billion for the quarter. UNP’s EPS is expected to grow by 6.8% per annum over the next five years. UNP gained more than 85% to hit its 52-week high of $196.17 in August since hitting its 52-week low of $105.08 in March. How does UNP stack up for the POWR Ratings? A for Trade grade A for Buy & Hold Grade A for Peer Grade A for Industry Rank A for Overall POWR Rating. You can’t ask for better. It is currently ranked #1out of 14 stocks in the Railroads industry. Canadian National Railway Company (CNI) CNI is a rail transportation company having 2,000 route miles across the United States, Canada, and the Gulf of Mexico. It engages in the transport of both perishable and non-perishable items, supply chain services, and trucking services. Despite complete lockdown in the operational countries as well as the intermittent travel ban, CNI managed to operate its essential transportation services. With the gradual reopening of the economy, many non-essential services were also resumed. As a result, CNI reported revenue worth C$750 million for the second quarter ended June 2020. It generated an adjusted operating income of C$1.27 billion during this time. CNI generated over C$1 billion in free cash flow during the recessionary quarter. Moody reaffirmed CNI’s investment-grade credit rating of A2 with a stable outlook, which is reassuring. JJ Ruest, President and Chief Executive Officer of CNI, said, “I’m pleased to reaffirm our commitment in encouraging the economic recovery through our C$2.9B capital investment plan for 2020 as well as our new investment announcement of the purchase of approximately 1,500 new, efficient, high-capacity, covered hopper cars to expand our grain export business for delivery starting in January of 2021.” CNI’s EPS is expected to grow 4% per annum over the next five years. Also, CNI beat the street EPS estimates in each of the trailing four quarters, which bodes well for the stock. CNI gained more than 65% to hit its 52-week high of $107.52 in August since hitting its 52-week low of $65.13 in March. CNI is rated a “Strong Buy” in our POWR Ratings system, consistent with the financial strength and growth potential of the company. It has a grade of “A” in Trade Grade, Buy & Hold Grade, Peer Grade, and Industry Rank. It is also ranked #2 out of 14 stocks in the Railroads industry. CSX Corporation (CSX) CSX provides rail-based freight and intermodal transportation services across the United States and Canada. It transports perishable and non-perishable merchandise, such as food items, fertilizers, coal, chemical, fertilizers, and metallic equipment. Its Intermodal transport services are connected through over 30 terminals across the country. CSX is committed to ensuring sustainable growth through fuel efficiency and adapting the ESG standards. It is the first U.S. Class 1 railroad to operate at less than 1 gallon of fuel per thousand gross ton miles fuel efficiency rate. The impact of the pandemic on CSX’s operations was reflected in its second-quarter (ended June 2020) results. However, the company managed to remain profitable with $499 million in net earnings. Its cash and cash equivalents balance improved 180.3% year-over-year to $2.39 billion in the first two quarters of 2020. CSX’s EPS is expected to grow at 3.7% per annum over the next five years. Moreover, CSX surpassed the street EPS estimates in each of the trailing four quarters, which bodes well for the stock. CSX gained more than 60% since hitting its 52-week low of $46.81 in March. It’s no surprise that CSX is rated a “Strong Buy” in our POWR Ratings system. It also has an “A” in Trade Grade, Buy & Hold Grade, and Industry Rank. It is ranked #4 out of 14 stocks in the Railroads industry. Norfolk Southern Corporation (NSC) NSC operates in the rail transportation business across the United States as well as engages in overseas freight transportation services through the Atlantic and Gulf coast. It also offers logistics and intermodal services and commuter passenger services. On August 6th, NSC signed Operation Clean Sweep pledge to eliminate plastic pollution in the environment, making it the most recent Class 1 railroad in the United States to voluntarily do so. This ensures sustainable growth of the company in the upcoming years, concerning the ESG standards. Despite the pandemic driving down freight transportation services across the country, NSC managed to generate $610 million as income from railway operations in the second quarter ended June 2020. Cash and cash equivalents and restricted cash balance increased 217.5% from the year-ago value to $1.14 billion in the first 6 months of 2020. NSC bought back 3.9 million shares in the first half of 2020 for $629 million. This has positive implications for the stock, as it implies a higher valuation for NSC shares. NSC’s EPS is expected to grow at 5.2% per year in the next five years. Also, NSC’s earnings surprise history is impressive, as it beat the street EPS estimates in each of the trailing four quarters. NSC gained more than 90% since hitting its 52-week low in March and is currently trading near its 52-week high. NSC is rated a “Strong Buy” in our POWR Ratings system, consistent with its strong business model. It has an “A” in Trade Grade, Buy & Hold Grade and Industry Rank, and a “B” in Peer Grade. It is also ranked #3 out of 14 stocks in the Railroads industry. Want More Great Investing Ideas? 7 Best ETFs for the NEXT Bull Market Why Stocks Could Drop 20% in September? 9 “BUY THE DIP” Growth Stocks for 2020 UNP shares were unchanged in after-hours trading Monday. Year-to-date, UNP has gained 8.21%, versus a 9.65% rise in the benchmark S&P 500 index during the same period."}]}