{"article": [{"url": "https://stocknews.com/news/wfc-kmi-spg-nly-4-dividend-stocks-to-avoid-in-october/", "published": 1602158900.0, "headline": "4 Dividend Stocks to AVOID in October", "body": "There is looming uncertainty in the market due to the upcoming presidential election, the ongoing spread of the coronavirus, and stalled fiscal stimulus talks. The US economy still faces considerable risks. While dividend stocks can be good long-term investment options for those looking to invest in such times, investors need to be more careful about their picks. The spread of the coronavirus along with changing consumer behavior has caused widespread changes in the market that could have far-reaching consequences for a number of sectors. There are several stocks that are lowering their dividend payouts due to the impact of the pandemic on their financials and an expected decline in revenues or cash flows. So, such stocks should be avoided. 7 \"SAFE HAVEN\" Dividend Stocks for Turbulent TimesWells Fargo & Company (WFC), Kinder Morgan, Inc. (KMI), Simon Property Group, Inc. (SPG), and Annaly Capital Management Inc. (NLY) have lowered their dividend payouts due to the weakness in their financials. Wells Fargo & Company (WFC) WFC offers retail, commercial, and corporate banking services worldwide. The company operates in three segments: wholesale banking, community banking, and brokerage and retirement. WFC’s stock price has fallen 53.9% so far this year. The company has recently cut 700 jobs in its commercial banking operations which are a part of a much larger downsizing happening within the company. The company is also closing down branches in the United States. During the second quarter, the company reported its first quarterly loss since 2008. For the third quarter of 2020, WFC reduced its quarterly dividend payout to $0.1 from $0.51. The company is expected to see a fall in revenue of 11% for the quarter ended in December 2020 and a fall of 15.9% in 2020. The company’s EPS is expected to contract 52.2% this quarter and 97% this year. WFC’s POWR Ratings are consistent with this bleak outlook. It has an overall rating of “Strong Sell” and an “F” for Trade Grade and Buy & Hold Grade with a “D” for Peer Grade and Industry Rank. The stock is also ranked #9 out of 10 stocks in the Money Center Banks industry. Kinder Morgan, Inc. (KMI) KMI operates as an energy and energy-related infrastructure company. The company operates natural gas pipelines, product pipelines, terminals, and so on. KMI’s stock price has fallen 40.5% so far this year. The company is reportedly slowing down its expansion plans and has reduced its investments in the energy sector to $1.7 billion from $2 to $3 billion that it invested for the last 10 years. The company is reducing its expansion plans due to limited growth opportunities in the US energy sector. The company’s dividend CAGR has been negative 11% for the last five years. The company is expected to see a fall in revenue of 8.7% for the quarter ended in December 2020 and a fall of 11.2% in 2020. The company’s EPS is expected to contract 4.5% this quarter and 17.9% this year. KMI’s POWR Ratings reflect its poor prospects. The company is rated a “Sell.” It also has an “F” for Trade Grade in addition to a “D” for Buy & Hold Grade and Industry Rank. In the 97-stock Energy – Oil & Gas industry, it is ranked #12. Simon Property Group, Inc. (SPG) SPG is a property development company that primarily invests in regional malls, premium outlets, lifestyle centers, and mills. It is the largest shopping mall operator in the United States. SPG’s stock price has fallen 52.3% so far this year. Since the company’s primary operation is in shopping malls, the company is suffering from tailwinds caused by the surge in e-commerce along with the reduction in mall traffic and closures caused by the spread of the coronavirus. The company is working on a redevelopment program to transform its malls to make them more relevant to the current market, however, this is a period of uncertainty for the company and its business model. In 2020, the company has reduced its quarterly dividend payout to $1.3 from $2.1 to make it in line with expected revenues. The company is expected to see a fall in revenue of 14.7% for the quarter ended December 2020 and a fall of 13.8% in 2020. The company’s EPS is expected to contract 48% this quarter and 35.4% this year. SPG is rated a “Sell” in our POWR Ratings system, with a grade of “F” in Buy & Hold Grade and a “D” in Trade Grade and Industry Rank. In the 41-stock REITs – Retail industry, it is ranked #23. Annaly Capital Management Inc. (NLY) NLY invests in different types of agency mortgage-backed securities along with derivative products to hedge these investments. The company’s portfolio consists of collateralized mortgage obligations, mortgage pass-through certificates, agency callable debentures, and more. NLY’s stock price has lost 22.8% so far this year. In the second quarter, the company’s economic leverage fell to 6.4x from 6.8x in the prior quarter. In 2020, the company’s quarterly dividend payout has fallen to $0.22 from $0.25. Over the last three years, the company has recorded a dividend CAGR of negative 6.4%. The company is generating more cash flow than only 2.7% of dividend-paying US stocks in the Stocknews.com universe. The company is expected to see a fall in revenue of 43% for the quarter ended in December 2020 and a fall of 37.8% in 2020. The company’s EPS is expected to contract 1% this year and at a rate of 3.25% per annum over the next five years. NLY is rated “Neutral” in our POWR Ratings system in addition to a “D” for Industry Rank. In the 31-stock REITs – Mortgage industry, it is ranked #5. Want More Great Investing Ideas? 7 Best ETFs for the NEXT Bull Market What is the Cure for Stock Market Volatility? Chart of the Day- See Christian Tharp’s Stocks Ready to Breakout WFC shares were trading at $25.21 per share on Thursday afternoon, up $0.40 (+1.61%). Year-to-date, WFC has declined -51.48%, versus a 8.25% rise in the benchmark S&P 500 index during the same period."}]}