{"article": [{"url": "https://stocknews.com/news/xom-uso-tot-bp-cvx-risk-off-trading-returns-to-energy-markets/", "published": 1601294900.0, "headline": "Risk-Off Trading Returns to Energy Markets", "body": "Coronavirus and the US election create more problems for energy-related companies The leading energy companies are the only way to go- And they pay while waiting for capital growth British Petroleum (BP)- Renewable energy for one of Europe’s leading producers 7 \"SAFE HAVEN\" Dividend Stocks for Turbulent Times&nbsp Royal Dutch Shell (RDS-B) – Going green to stay ahead of the trend Total SE (TOT)- France’s crown jewel in energy The stock market was flying high until earlier this month when it hit a speed bump after rising to new record highs. Fueled by technology shares, the stock market made a V-shaped recovery since the March low that was starting to look more like a checkmark than a “V” as the NASDAQ index exploded higher. Many other stocks went along for the bullish ride as investors and traders looked for value in a market where it became a challenge to identify. Meanwhile, the energy sector had lagged the stock market and even the price of crude oil since 2018. When stocks rose, energy-related shared moved higher, but to a far lesser extent. However, during corrections, the energy sector was front and center when it came to corrections. The weakest members of the stock market became weaker. In August, the Dow Jones Industrial Average removed Exxon Mobil (XOM) from its ranks, leaving only Chevron (CVX) as a member of the closely watched index. Finding value in the stock market is challenging these days. The world will continue to require energy products that power daily life. I favor the top-tier energy companies that are critical for the national security of countries worldwide. In the US, XOM and CVX are my favorites. In Europe, BP, RDS-B, and TOT are the candidates for long-term investors looking for an eventual rebound in the companies that power the world. I would only purchase these shares during periods of price weakness, and there are plenty these days. Coronavirus and the US election create more problems for energy-related companies Last week, Europe began to experience a surge in coronavirus cases as a second wave of the pandemic looks set to hit the continent. If European cases continue to rise significantly, the US may not be far behind. The potential for more shutdowns could begin to weigh on oil prices. It has already taken a toll on the stock market, and as usual, energy shares have been performing poorly. At the same time, the November 3 election in the US is creating lots of uncertainty. While the Presidential contest is highly contentious, the balance of power and majorities in the House of Representatives and the Senate also are at stake. A sweep by Democrats would likely shift US energy policy dramatically. President Trump and the Republican majority in the Senate have supported the regulatory reforms that put the US in a leadership role in crude oil and natural gas production. Therefore, the potential for lower demand because of the virus and uncertainty over the election has weighed on the share prices of energy-related companies. The leading energy companies are the only way to go There are bargains galore in the energy sector these days. Juicy dividends and low share prices are risky, as debt-laden companies could change their yield policies in the blink of an eye. Moreover, the potential for bankruptcies rises as the price of energy commodities remains under pressure. When looking for bargains, I would only consider the leading companies that are well-capitalized and are critical to the national security of the countries they call home. In the US, Chevron and Exxon Mobil fit the bill. The two companies are as close to state oil businesses as it gets. Three European companies are a step closer to state energy companies than XOM and CVX, making them even more attractive for investors. British Petroleum (BP)- Renewable energy for one of Europe’s leading producers British Petroleum (BP) operates a global energy business in three segments. Upstream explores for crude oil and natural gas. It also handles midstream operations such as transportation, storage, and processing for oil and gas. Downstream refines, manufacturers, markets, transports, supplies, and trades crude oil, products, and petrochemicals. The Rosneft segment owns and operates thirteen refineries in Russia and approximately 3,000 retail service stations in Russia and worldwide. The Rosneft segment also explores for and produces hydrocarbons and jet and bunkering fuels. BP had a market cap of $59.642 billion at a share price of $17.86 at the end of last week. The company pays shareholders a $1.26 or 7.05% dividend. Source: Yahoo Finance BP reported earnings in three of the past four quarters. The company lost $1.98 per share during the challenging second quarter of 2020. A survey of nine analysts on Yahoo Finance has an average price target of $30.77 for the shares with a range of $21 to $40. On September 25, the stock was trading below the bottom end of the range. Meanwhile, the company unveiled its climate strategy on September 24, the day the stock dropped to a 25-year low. CEO Bernard Looney and his management team made detailed presentations on now BP plans to adapt to a low-carbon future without sacrificing returns, but the share price continued to decline. The company plans to increase its activities in renewable energy production. Source: Barchart At $17.86 on September 25, the shares were at the lowest level since 1994. BP fell to a low of $15.51 in March during the risk-off period caused by the global pandemic. The stock was not far above that recent low. BP is a critical business in Europe, making its survival a good bet. At the current price level, the shares are trading at a bargain-basement price. Royal Dutch Shell (RDS-B) – Going green to stay ahead of the trend Royal Dutch Shell (RDS-B) has its headquarters in The Hague in the Netherlands. The company operates through its Integrated Gas, Upstream, and Downstream segments. RDS-B explores for and extracts crude oil, natural gas, and natural gas liquids from the earth’s crust. It markets and transports gas, oil, and petrochemicals worldwide. The company has been around since 1907 and is a leading European energy company. RDS-B had a market cap of just above $96.65 billion at a share price of $24.69 at the end of last week. An average of over 3.5 million shares trade each day, and the company pays shareholders a $1.28 dividend for a yield of 5.2%. Source: Yahoo Finance RDS-B reported EPS in three of the past four quarters, but it missed estimates in three. The company reported a small profit of eight cents per share in the challenging second quarter, which beat consensus estimates of a 21 cents loss. A survey of four analysts on Yahoo Finance has an average price target of $44, with a range from $35 to $50 per share. The stock was trading well below the bottom end of the range on September 25. A recent article on Barrons highlighted the changes at Shell to change its energy business to adapt to the concerns of environmentalists. Shell is working to become a greener company, but the share price continues to languish. Source: Barchart At the $24.69 level, RDS-B was trading at the lowest level since 1996. The shares fell to a low of $19.19 in March, but the recovery has lagged the overall stock market along with the entire energy sector. RDS-B is another company that is strategic for Europe’s economy. Total SE (TOT)- France’s crown jewel in energy Total SE (TOT) has its headquarters in Paris and employs over 107,000 people worldwide. The integrated oil and gas company operates its Exploration and Production, Integrated Gas, Renewables and Power, and Refining and Chemicals segments in fifty nations. At $32.70 per share, the company’s market cap was just under $87.2 billion. TOT pays its shareholders a $3.12 dividend or 9.54%. Source: Yahoo Finance As the chart shows, TOT has consistently beat analyst EPS projections over the past four quarters and has reported a profit in each period, even in Q2 2020. A survey of seven analysts on Yahoo Finance has an average price target of $50.29, with a range from $42 to $71 per share. The low end of the scale is well above the current share price. TOT is investing more than 500 million euros in converting its Grandpuits Refinery into a zero-crude platform for biofuels and bioplastics. The project is just one of many moves by the company to shift towards renewable energy. Source: Barchart The chart shows that TOT shares are trading at the lowest level since 2003. In March, the shares hit a low of $22.13. Energy has been the worst-performing sector of the stock market for years. However, people worldwide require energy to power their lives. Shares in the companies that are the leading energy producers in countries worldwide have declined to levels not seen in decades. When looking for value, patience is necessary. The risk-reward of the top energy companies offer a compelling opportunity for the future. Want More Great Investing Ideas? 7 Best ETFs for the NEXT Bull Market Is the Stock Market Correction Over? Chart of the Day- See the Stocks Ready to Breakout XOM shares were trading at $35.39 per share on Monday morning, up $0.75 (+2.17%). Year-to-date, XOM has declined -46.52%, versus a 5.29% rise in the benchmark S&P 500 index during the same period."}]}