{"article": [{"url": "https://stocknews.com/news/hexo-acb-tap-can-hexo-remain-on-the-nyse/", "published": 1600776500.0, "headline": "Will HEXO Remain on the NYSE?", "body": "Canada-based HEXO Corp.(HEXO) is a cannabis company that has come under hard times. The company has seen a slower rollouts of retails stores in Canada and a delay in approval for derivative products. This has resulted in a year to date loss of 55% so far. Over the summer, HEXO sold its facility in Niagara, Ontario due to an excess of capacity and lowered demand. Making matters worse, the company has received a delisting notice from the NYSE. A minimum requirement for a company to remain listed on the NYSE is a share price of $1.00 USD. If the company fails to maintain this price, it will be notified about a potential delisting. The company would then need to provide a plan of action to regain compliance or they can simply move forward with the delisting. HEXO is currently trading at $0.71. One common fix for a company that faces delisting is a reverse stock split or a share consolidation. Aurora Cannabis (ACB) was the first major cannabis company to consolidate its shares in a 12:1 reverse stock split. The problem with this strategy though, is that investors generally view this as a temporary bandage. 7 \"SAFE HAVEN\" Dividend Stocks for Turbulent TimesHEXO has until December 16th to regain compliance. However, there has been some good news for the company this year. Its net revenue grew 30% in its fiscal 2020 third quarter, and the firm forecasts positive adjusted EBITDA in the first half of fiscal 2021 depending on the growth of its retail stores. In addition, HEXO entered Israel’s medical market through an agreement with Breath of Life International and expanded its partnership with Molson Coors (TAP) to form Truss CBD USA, a joint venture that will make non-alcohol hemp-derived CBD beverages in Colorado. HEXO also recently announced a management change. Trent MacDonald will be the new Chief Financial Officer, with a start date expected in the coming months. He will take the place of Stephen Burwash who is the current CFO and will remain in his position through the transition period. MacDonald boasts more than 15 years of financial executive experience and has worked for both publicly ‎listed and private companies. MacDonald is also an award-winning entrepreneur with success in multiple industries. Sebastien St-Louis, the Chief Executive Officer and co-founder of HEXO said, “We are very pleased to welcome Trent to the HEXO leadership team. We are excited about the experience he brings to HEXO as we continue to deal with challenging but exciting and promising times for the cannabis industry.” Even with new management and partnership deals, the stock faces headwinds in getting back above $1 a share before December 16th. The average analyst price target is $0.80, which is still $0.20 off. HEXO will likely need to show positive earnings this quarter to even have a chance getting back above $1.00. Want More Great Investing Ideas? 7 Best ETFs for the NEXT Bull Market Stock Market Outlook: Before & After the Election Chart of the Day- See the Stocks Ready to Breakout HEXO shares were trading at $0.71 per share on Tuesday afternoon, down $0.00 (+0.41%). Year-to-date, HEXO has declined -55.35%, versus a 2.94% rise in the benchmark S&P 500 index during the same period."}]}