{"article": [{"url": "https://stocknews.com/news/hd-bc-pii-swbi-rgr-homz-3-trends-driving-up-dividend-stock-share-prices-after-lifting/", "published": 1596542900.0, "headline": "3 Trends Driving Up Dividend Stock Share Prices After Lifting the Lockdowns", "body": "It was just a handful of months ago that the coronavirus pandemic took hold of the U.S. population and economy. Most states put their populations into lockdown for much of April and May, which did slow the spread of the virus. Still, people can’t stay at home forever, and reopening of much of the economy has led to continued high numbers of reported COVID-19 infections. The good news is that the death rate from reported cases is a fraction of what it was back in March and April. A significant change from the pandemic has been a shift in what people do with their free time and how they spend their money. Based on the news and my own personal observations, here are some trends and investment ideas from the new pandemic-driven economy. 9 \"BUY THE DIP\" Growth Stocks For 2020People still want to travel, but they don’t plan to stay in hotels or take cruises. Instead, people are looking for recreation options that include social distancing—myself included (You might recall that I purchased a travel trailer a few months ago.) Let’s take a look at three trends driving up share as the population moves away from full lockdown. Trend 1: Home Improvement and Relocation The third trend from the pandemic focuses on homeownership and home improvement. I know the number of home improvement projects in my neighborhood exploded in April through June. There also is a growing trend of relocation out of the urban centers into the suburbs, where COVID-19 infection rates are much lower. This trend is very positive for home builders and real estate companies. The Home Depot, Inc. (HD) The Home Depot, Inc. (HD) is an obvious beneficiary of the explosion in home improvement projects. When the company reported first-quarter results in May, same-store sales growth of 7.5% handily beat the Wall Street estimate of 5.8%, and reported revenue beat the estimate by $690 million. Home Depot has been aggressively growing its dividend, with the payout increasing at an average of 20% per year over the last decade. The Hoya Capital Housing ETF (HOMZ) The Hoya Capital Housing ETF (HOMZ) is a newer fund that gives investment exposure to the full housing sector. The fund portfolio covers the four sectors of housing: Home Ownership and Rental Operations (30% of the portfolio) Home Building and Construction (30%) Home Improvement and Furnishings (20%) Home Financing, Technology and Services (20%). The fund also pays dividends monthly. Trend 2: The Desire to Get Out Brunswick Corp. (BC) Brunswick Corp. (BC) manufactures boats and marine engines. The company has over a dozen boat brands under its corporate umbrella. For the 2020 second quarter, the company reported non-GAAP earnings of $0.99 per share, blowing away the Wall Street consensus of $0.44 per share. Polaris, Inc. (PII) Polaris, Inc. (PII) manufactures motorcycles, snowmobiles, and the very popular Ranger and RZR off-road adventure vehicles. For the second quarter, Polaris reported non-GAAP earnings of $1.30 per share. The profits were double the Wall Street estimate. Polaris is also a dividend champion, increasing the payout to investors for 23 straight years. Trend 3: The Desire to Stay Safe During the pandemic lockdown, fear drove many Americans to purchase weapons for home defense. The unrest in many U.S. cities continues to propel firearms sales. Gun dealers are seeing weapons and ammunition disappear off the shelves as soon as they get restocked. Smith & Wesson Brands (SWBI) Shares of Smith & Wesson Brands (SWBI) are up 165% year-to-date. The company’s last earnings in June were for the fiscal fourth quarter that closed on April 30. At that time, the EPS $0.57 per share beat the Wall Street consensus by $0.15. The next earnings report will be out at the end of August, and a blowout quarter could continue to propel the share price higher. Sturm, Ruger & Company, Inc. (RGR) Sturm, Ruger & Company, Inc. (RGR) is up 71% year-to-date, although the company’s second-quarter GAAP EPS of $1.05 per share missed the $1.23 Wall Street estimate. Ruger did declare a quarterly dividend of $0.42 per share based on the results of the second quarter and a special dividend of $5.00 per share. Both dividends are for shareholders of record as of August 14, 2020, and are payable on August 28, 2020. Want More Great Investing Ideas? Top Dividend Stock to Own! Download Free Report Today Buy These 3 High-Yield Dividend Stocks All Under $15 Buy and Hold These 3 Dividend Stocks Forever HD shares were trading at $266.15 per share on Tuesday afternoon, down $0.03 (-0.01%). Year-to-date, HD has gained 23.42%, versus a 3.27% rise in the benchmark S&P 500 index during the same period."}]}