{"article": [{"url": "https://stocknews.com/news/ivr-mfa-play-3-worst-performing-robinhood-100-stocks-for-the-quarter/", "published": 1593605300.0, "headline": "3 Worst Performing Robinhood 100 Stocks for the Quarter", "body": "Yesterday was the last day of the second quarter of 2020. Which means that now is a great time to evaluate stocks that were winners and losers in the last three months. In this article I am going to focus on the three worst performing stocks on the Robinhood Top 100. This is a list of the most popular stocks owned by investors that use the Robinhood app. Over 100,000 Robinhood investors own each of the three stocks on this list. Their market caps range from $591 Million to $1.1 Billion, while their prices range from $2.49 to $13.15 per share. All of these stocks have lost over 60% this past quarter. 7 Best ETFs for the NEXT Bull MarketHere are the three worst-performing stocks on the Robinhood 100 for the second quarter of 2020: Invesco Mortgage Capital (IVR) IVR is a REIT that invests, finances, and manages residential and commercial mortgage-backed securities and mortgage loans. The company has a portfolio that consists of residential mortgage-backed securities for which a U.S. government agency or a federally chartered corporation guarantees payment of principal and interest. The portfolio also includes residential mortgage-backed securities, commercial mortgage-backed securities, and residential and commercial mortgage loans. The asset manager for the company is Invesco Advisers, which is a subsidiary of Invesco. Mortgage real estate investment trusts invest in real estate securities with borrowed money. This is fine during normal economic conditions, but in periods of distress, this becomes a problem. If banks get worried that they won’t get repaid, this creates selling, which drives prices down. This is what happened to IVR. When banks want their money back, they issue margin calls for repurchase agreements when the collateral value falls below the loan value. In response to margin calls, IVR had to sell what it could and ended up negotiating a forbearance agreement with the banks. The stock is down 77% for the quarter. IVR is a Strong Sell in the StockNews.com POWR Ratings. The company is ranked #24 out of 30 REIT and Mortgage Stocks. MFA Financial (MFA) MFA Financial Inc is a holding company for their subsidiaries in real estate finance that invest in a portfolio of residential mortgage assets on a leveraged basis. Their portfolio is primarily made up of government-sponsored agency mortgage-backed securities, non-agency MBS, residential mortgage loans, and credit risk transfers. These securities divert risk from residential mortgages securitized by government-sponsored enterprises. The mortgage sector was hit badly in the first quarter of the year. The volatility created by COVID-19 created illiquidity in the credit markets. Companies in this sector were hit with margin calls. MFA was one of the worst-hit stocks. The company had a lot of exposure to mortgages that were not guaranteed by the government. As I mentioned with IVR, these margin calls were detrimental to MFA’s business as well. MFA was unable to raise enough cash to make the margin calls, so they entered into a forbearance agreement with the banks. In the company’s most recent earnings report, MFA reported a net loss of $914.21 million. On Monday, though, the company announced that it had completed the funding of a $500 million senior secured term. As MFA completes various financing transactions, it should exit from forbearance soon. The stock is down 66% for the quarter. MFA is a Strong Sell in the POWR Ratings. The company is ranked #22 out of 30 REIT and Mortgage Stocks. Dave & Buster’s (PLAY) PLAY owns and operates almost a hundred entertainment and dining establishments in the United States. Customers can eat, drink, play games, and watch televised sports. The company was adversely affected due to COVID. People weren’t able to go out and socialize. While other restaurants were able to generate revenue through takeout, PLAY is primarily an adult entertainment company. The company thrives on socialization. It’s a perfect breeding ground for spreading germs. Their business model was also threatened by home entertainment and games as people were able to take advantage of streaming services and video games at home. The price of the stock went from $46.60 at its peak down to $4.87 in March. While the company has rebounded a little bit to $13.33, it is still well off its February highs. PLAY has since re-opened some locations, but the recent upticks in COVID diagnoses and a possible second wave make it a difficult to stock to consider right now. The stock is down 60.1% for the quarter. PLAY is a Strong Sell in the POWR Ratings. The company is ranked #34 out of 48 Restaurant Stocks. Want More Great Investing Ideas? 9 “BUY THE DIP” Growth Stocks for 2020 Is the Bull S#*t Rally FINALLY Over? 7 “Safe-Haven” Dividend Stocks for Turbulent Times Top 3 Investing Strategies for 2020 IVR shares fell $0.03 (-0.80%) in after-hours trading Tuesday. Year-to-date, IVR has declined -65.46%, versus a -3.21% rise in the benchmark S&P 500 index during the same period."}]}