{"article": [{"url": "https://stocknews.com/news/ccj-spy-fcx-ag-wy-gold-5-stocks-that-will-beat-the-sp-500-in-the/", "published": 1594987700.0, "headline": "5 Stocks That Will BEAT the S&P 500 in the Next 6 Months", "body": "The S&P 500 (SPY) has had quite an eventful year. In February and March, it saw a 35% crash and that was followed by a 43% rally. This volatility has created several opportunities for savvy traders and investors. Things aren’t likely to calm down given the number of uncertainties including the November elections, the continued spread of the coronavirus, and a potential vaccine. However, some things are more certain. The government will be supporting the economy with fiscal and monetary policy, good companies will grow stronger even during bad times, and investors’ emotions will vacillate between extremes of fear and greed. 7 Best ETFs for the NEXT Bull MarketTo find stocks that will outperform, investors should focus on companies that will benefit from these monetary and fiscal policies. Below are 5 stocks that are likely to beat the S&P 500 over the next six months: Barrick Gold (GOLD) Gold was one of the first assets to hit new 52-week highs following as the coronavirus began to spread worldwide. This prolonged period of economic weakness has resulted in massive amounts of fiscal and monetary stimulus. The Fed has already committed to keeping interest rates at zero percent until 2022. The deficit this year will likely be more than $2 trillion. More fiscal stimulus is likely given that it’s an election year, and politicians will do anything to keep their seats. The longer the crisis persists, the greater the duration and magnitude of the stimulus. This is bullish for gold as it is viewed as a good form of protection against inflation. Barrick Gold is a high-quality gold miner. It has a price to earnings ratio of 11. The stock has been consolidating underneath the $28 price level and looks poised to break out higher in the coming weeks. GOLD’s POWR Ratings are also very strong with a Strong Buy rating. It has an “A” for Trade Grade and Buy & Hold Grade with a “B” for Industry Rank. Among Gold Miners, it’s ranked #1 out of 30. First Majestic Silver (AG) So far, silver has been underperforming relative to gold. While gold is 6% away from its all-time highs, silver is about 85% off its all-time highs that were made in 1980 and 67% off its 2011 highs. In recent months, silver has begun to outperform gold. In the past, every precious metals bull market has climaxed with silver significantly outperforming gold. AG is a silver miner that generates 61% of its revenue from silver mining. Last year, the company produced 25.5 million ounces of silver which resulted in revenue of $364 million. Despite COVID-19, AG has maintained production at the same level. Since prices are 25% higher today, they will generate more revenues, while costs are the same – about $13 per ounce. AG’s POWR Ratings are also quite positive on the stock as it has a Buy rating. It has an “A” for Trade Grade and Industry Rank, and it’s ranked 7th out of 11 silver miners. Weyerhaeuser Company (WY) Another surprising development of the coronavirus economy is the strength in housing. Ordinarily, a high unemployment rate would dampen demand for housing. However, this crisis is different, as it’s leading to an exodus of people leaving the cities for the suburbs. There’s less reason to pay high rents in a city when many of the restaurants, bars, and attractions are shut down, and you’re forced to stay cooped up in a small apartment. The strong housing market is evident in all types of economic data, but it also shows up in lumber prices which are 10% above its pre-coronavirus peak. WY owns 12.2 million acres of timberland in the US and Canada. It’s one of the largest producers of wood products and lumber, so its fortunes are tied to the housing market. The recent strength in lumber prices means that the value of its assets will increase as will its earnings. Additionally, there’s good reason to believe that housing will remain strong especially as mortgage rates are at record lows which will be supportive of housing demand and housing supply is near record lows which is supportive of increased homebuilding. Freeport-McMoran (FCX) FCX has nearly tripled since its March low. It’s benefiting from strong demand for copper, while supply is relatively tight. Copper is now higher than its pre-coronavirus levels which is surprising given that it’s historically correlated to be sensitive to economic growth. However, one reason for copper’s strength is the number of infrastructure projects that are going to take place around the world as a form of stimulus to counteract the drop in economic activity. It’s also likely that supply will remain negatively affected which has reduced production in many places including South America. FCX’s POWR Ratings are consistent with its strong fundamentals as it’s rated a Strong Buy. The stock has an “A” for Trade Grade, Buy & Hold Grade, and Peer Grade with a “B” for Industry Rank. Among the Industrials – Metals sector, it’s ranked #3 out of 33. Cameco Corporation (CCJ) CCJ is one of the world’s leading producers of uranium. Its stock has been strong over the past month due to rising uranium prices. The short-term catalyst for uranium has been the reduction in production due to COVID-19. However, the longer-term fundamentals for uranium are bullish. After years of oversupply, supply and demand are in balance. Production has declined by nearly 20% over the last 3 years, and no new major projects are coming online soon. Worldwide, there are 447 nuclear reactors, and there are 45 under construction. Given the low cost and low emissions of nuclear, it’s going to be an increasing component of energy production. The last several years have been rough for the nuclear industry. Low natural gas made it the fuel of choice for new projects. Additionally, the Fukushima disaster led to many plants being taken out of commission. However, the total number of reactors stayed flat due to new projects replacing old ones in emerging markets. The POWR Ratings is also constructive on CCJ as it has a Strong Buy rating with an “A” for Trade Grade, Buy & Hold Grade, and Peer Grade with a “B” for Industry Rank. Among the Industrials – Metals group, it’s ranked #5 out of 33. Want More Great Investing Ideas? 9 “BUY THE DIP” Growth Stocks for 2020 Newly REVISED 2020 Stock Market Outlook 7 “Safe-Haven” Dividend Stocks for Turbulent Times CCJ shares rose $0.05 (+0.42%) in after-hours trading Friday. Year-to-date, CCJ has gained 33.37%, versus a 0.99% rise in the benchmark S&P 500 index during the same period."}]}