{"article": [{"url": "https://stocknews.com/news/avav-lmt-atsg-3-defense-stocks-to-protect-your-portfolio/", "published": 1596197300.0, "headline": "3 Defense Stocks to PROTECT Your Portfolio", "body": "The defense sector typically outperforms during recessions, since their revenues are disconnected from economic cycles. Defense spending in the US has risen every year, regardless of which party is in charge. Over the last decade, the US economy grew around 2.1% annually, while defense spending grew 5% annually. Global growth and defense spending figures are similar. So, it’s interesting to note that the defense sector has been underperforming despite recessionary conditions. From the March lows, the S&P 500 is 46% higher, while the Dow Jones US Defense Index is 20% higher. 9 \"BUY THE DIP\" Growth Stocks For 2020This underperformance may be an opportunity for investors to gain exposure to this sector given that in the long-term, defense spending has steadily increased. AeroVironment, Inc. (AVAV), Lockheed Martin Corporation (LMT), and Air Transport Services Group, Inc (ATSG) are three of the strongest defense stocks that investors should take a look at. AeroVironment, Inc. (AVAV) AVAV is an American defense contractor that specializes in Small Unmanned Aircraft Systems (UAS). Having entered the 50th year of its business, AVAV is reaching new heights by developing the first aircraft to attempt controlled flight on another planet. AVAV’s Ingenuity Mars Helicopter will be secured to the underbelly of NASA’s Perseverance Rover and will help in NASA’s mission of exploring Mars. AVAV announced that the US army decided to exercise its first option worth $21 million under the Small Unmanned Aircraft Systems (UAS) contract in the Flight Control System (FCS) domain. The company’s idea of providing broadband services through solar-charged drones in collaboration with Softbank has also excited people. Furthermore, AVAV received orders worth $9.8 million as part of a three-year base contract from NATO Support and Procurement agency that involves services for Puma tactical, Wasp and Raven UAS. AVAV is up by more than 70% since it hit its 52-week low of $45 on March 16th. It is impressive to note that the company beat its consensus EPS estimates in three of the trailing four quarters. Moreover, AVAV’s EPS is expected to grow by 29.2% per annum in the next five years. For the fiscal fourth quarter ended April 30th, revenue increased 54% year over year. AVAV’s EPS from continuing operations was $0.73 as compared to $0.26 in the previous year. How does AVAV stack up for the POWR Ratings? A for Trade Grade A for Buy & Hold Grade A for Peer Grade A for Overall POWR Ratings It ranks #2 out of 65 in the Air/Defense Services Industry Lockheed Martin Corporation (LMT) LMT has been selected by the Swiss Army for a fleet of its Indago 3 small unmanned aircraft systems (UAS) for tactical reconnaissance and surveillance. LMT built the aeroshell capsule that would enclose and protect NASA’s Perseverance Rover for its Mars mission. The company also developed the Mars helicopter delivery system in collaboration with NASA’s Jet Propulsion Laboratory. LMT has grown more than 40% since its March lows due to the virus-led market crash. LMT’s earnings surprise history looks impressive with the company consistently surpassing the consensus ESP estimates in the trailing four quarters. The market expects the company to report EPS of $6.09 for the current quarter, representing a 7.6% improvement over the year-ago number. Moreover, LMT’s consensus revenue estimate of $16.1 billion for the current quarter indicates a year-over-year increase of 6.2%. In the second quarter ended June 28th, net sales increased 12.4% and net earnings increased 14.5% year over year. It’s no surprise that LMT is rated “Buy” in our POWR Ratings system. It also has an “A” for Trade Grade and Peer Grade, and a “B” for Buy & Hold Grade. In the 65-stockAir/Defense Services industry, it is ranked #6. Air Transport Services Group, Inc (ATSG) Under a five-year dry lease agreement between ATSG’s subsidiary Cargo Aircraft Management and MasAir, ATSG announced the delivery of a Boeing 767-300 converted freighter to MasAir of Mexico City which provides dry lease customers a cost-effective option to meet market demand. Earlier this month, the company also reported positive news that its Passenger-to-FlexCombi™ conversion program has been approved by the U.S. Federal Aviation Administration. In the first quarter, earnings from continuing operations were up 13% and customer revenues were up 12% year over year. Moreover, the stock has been showing bullish trends and has grown more than 80% since its March lows. The market expects the company to report EPS of $0.29 for the quarter ended June, representing a 7.4% improvement over the year-ago number. ATSG’s earnings surprise history looks impressive with the company consistently surpassing the consensus ESP estimates in the trailing four quarters. ATSG’s consensus revenue estimate of $ 367.65 million for the quarter ended June 2020 indicates a year-over-year increase of 9.9%. ATSG’s POWR Ratings reflect this promising outlook. It has an overall rating of “Strong Buy” with an “A” for Trade Grade, Buy & Hold Grade, and Peer Grade. Among the 65 stocks in the Air/Defense Services group, it’s ranked #3. Want More Great Investing Ideas? 9 “BUY THE DIP” Growth Stocks for 2020 How HIGH Can This Tech Bubble Fly? 7 “Safe-Haven” Dividend Stocks for Turbulent Times AVAV shares fell $0.05 (-0.07%) in after-hours trading Friday. Year-to-date, AVAV has gained 23.99%, versus a 2.49% rise in the benchmark S&P 500 index during the same period."}]}