{"article": [{"url": "https://stocknews.com/news/aapl-msft-t-amzn-vz-want-to-be-an-a-investor-heres-a-list-of/", "published": 1600258100.0, "headline": "Want to be an A+ Investor? Here's a List of Stocks to Own", "body": "Today, I look at the top stocks held by AAII members. These are companies that show up the most in A+ Investor portfolios at AAII.com, and they give an insight into the stocks that real investors are attracted to right now. Most Popular A+ Investor Stocks What are AAII’s A+ Investor members invested in these days? You might be surprised.AAII’s A+ Investor is a suite of tools that helps investors monitor their investments, discover new opportunities and learn what strategies work (or don’t work). AAII’s A+ Investor portfolio tools and technology team track stocks that members hold in their portfolio. Going through all the portfolios of members who have created a portfolio, A+ Investor looks at the most popular holdings among the portfolios, tallies the positions in individual stocks, and then ranks those stocks by most popular holdings.The most widely held names offer a portrait of A+ Investor members. Many investors choose to invest in companies and industries they are passionate about and believe will be successful over the long term.These are primarily large blue-chip stocks, ranging from the hundreds of billions of dollars in market capitalization to more than $1 trillion. Unsurprisingly, then, most of the stock holdings are big, stable names known to most Americans. Some of the technology names show durability, with strong estimated earnings per share growth prospects. A few of the companies possess typical defensive characteristics such as health care and cyclical businesses and/or high dividend yields. Wisdom of the Crowd The table below shows the 25 most popular stock holdings among A+ Investor members. The list includes holdings across diversified sectors such as: technology, health care, consumer cyclicals and financials. The list also includes four companies with a market cap greater than $1 trillion and 21 companies that currently pay a dividend. If an investor held a portfolio of these 25 stocks, it would be up over 30% since the end of 2019 through the close on September 14, 2020. Top 25 A+ Investor Stock Holdings (Ranked by Most Popular Portfolio Holdings) 9 \"BUY THE DIP\" Growth Stocks For 2020 Apple Inc. (AAPL) took home top honors as the most-held stock in portfolios by A+ Investor members as of September 8, 2020. The maker of smartphones, tablet devices and wearables is a top holding as investors expect demand for a 5G (wireless network) upgrade cycle to support growth later this year. Analysts are forecasting earnings to grow, on average, by 12.5% over the next three to five years. Apple has a strong balance sheet, with about $194 billion in cash and investments as of the end of June 2020. Its high-margin services segment and its expanding capital return program could all serve as catalysts for Apple in the years ahead. Apple’s annual fall event, in which it unveils new products ahead of the holiday season took place virtually on Tuesday, September 15. The event featured new Apple Watch and iPad models and a service bundle including iCloud, Apple Music, TV+, Arcade, News+ and Fitness+. The event did not include the 5G iPhone lineup, which could have a separate launch event in October.On August 31, Apple split its stock 4-for-1 to “make the stock more accessible to a broader base of investors.” If an investor held Apple shares before the market opened on August 31, they now own four shares for every share they held, and the stock price was reduced to one-quarter of its value at the start of trading on August 31. Apple shares closed on August 28 at $499.24 (pre-split), which translates into a split-adjusted price of $124.81. On September 14, Apple shares closed at $115.36. Microsoft Corp. (MSFT), the third most valuable stock on the list by market cap at $1.5 trillion, is the second-most widely held stock in A+ Investor portfolios. Microsoft has made strides in building its cloud computing division and making its Azure platform one of the top brands in the high-growth cloud services business. Microsoft has benefited from the surge in work-from-home telecommuting, especially from the cloud versions of Office and related Teams and SharePoint apps for collaboration. Microsoft has several long-term growth opportunities in machine learning and artificial intelligence (AI). Analysts are forecasting earnings to grow, on average, by 15.2% over the next three to five years.Rounding out the top five most popular holdings is AT&T Inc. (T), a diversified services provider in media & entertainment, telecommunications and technology, with over 40% more A+ Investor members holding it in their portfolio than the stock in fourth place, leading global e-commerce retailer Amazon.com Inc. (AMZN), and 44% more than the largest U.S. wireless carrier Verizon Communications Inc. (VZ). No doubt AT&T’s 7.1% dividend yield is a draw. Analysts are forecasting earnings growth to be relatively flat over the next three to five years despite AT&T’s strong position given its premium content, direct-to-customer relationships, technology platform and high-speed network. Popularity Is a Difficult Trait to Assess Mark Hulbert, founder of the Hulbert Financial Digest, notes in an article written for the AAII Journal that popularity is one of those traits whose desirability in the investment arena is difficult to assess. Some investors simply believe that a stock’s popularity is a good thing.On the other hand, Hulbert notes that contrarians argue that popular stocks should be avoided. He states, “if given a choice between two stocks with similar financials, they would prefer the less-popular one, on the assumption that it has not yet been discovered.” Of course, he admits, often there are no such clear-cut choices.Which “popularity” theory is right? Is it possible to harness the wisdom of the crowd to generate fresh investing inspiration? The debate continues.In any case, we believe it is worth keeping tabs on what investors are doing. The list enables investors to pinpoint top stock holdings that are popular with A+ Investor members. The data points to a primary characteristic of investors. They are inclined to invest in companies that they have a general understanding of and that they perceive as stable, long-term investments.By keeping an eye on what AAII’s A+ Investor members are doing, you have one more piece of the investment puzzle that may help aid your investment approach. The stocks meeting the criteria of the approach do not represent a “recommended” or “buy” list. It is important to perform due diligence. If you want an edge throughout this market volatility, become an AAII member. AAPL shares rose $0.45 (+0.40%) in after-hours trading Wednesday. Year-to-date, AAPL has gained 53.59%, versus a 6.35% rise in the benchmark S&P 500 index during the same period."}]}