{"article": [{"url": "https://stocknews.com/news/spy-inx-dia-iwm-qqq-3-key-questions-at-this-critical-time-for-the-market/", "published": 1595851700.0, "headline": "3 Key Questions at this Critical Time for the Market", "body": "Will sports bettors stop investing in stocks as baseball, hockey and basketball are set to reopen? Don’t bet on it! Is the tech stock bubble over? 9 \"BUY THE DIP\" Growth Stocks For 2020Don’t bet on it! Can we finally stop worrying about the return of the bear market? Don’t bet on it! Indeed these are 3 key questions for investors to contemplate at this time. However, they deserve a more in-depth response than shared above. So let’s dig in deeper with each of these vital topics below… Will sports bettors stop investing in stocks as baseball, hockey and basketball are set to reopen? A lot of ink has been spilt about how sports bettors were driven to the stock market when the Coronavirus stamped out professional sports. The leader of that movement is Dave Portnoy. (aka Davey Day Trader) the founder of Barstool Sports. My good friend Adam Mesh has been dialed into this trend from the onset with articles like the ones below: Davey Day Trader Global & The Missing Million Why Options Trump Bitcoin…Will Dave Portnoy Buy In? Will DraftKings Break the Robinhood Curse? This legion of sports bettors had no place else to go to get their fix than the stock market. This certainly can explain some of the bubblicious price action of stocks the past few months. Thus, the timing of a little sell off at the end of last week was curious as professional baseball were getting set to re-open. Many of us wondered if this meant that these sports bettors were ready to abandon the market for their old habit of betting on games instead. I believe the answer is…Don’t Bet On It! So yes, it is true that professional baseball opened this weekend. The NBA and NHL will be rolling later this week. Indeed some of these gamblers time and attention will go back to their old hobby. But the reason why they will not give up stocks is the gains have been far too easy. Meaning that their win rate was too high in the midst of a bubble. And stock investing is not an all or nothing proposition like most sport bets. Thus, if you are wrong…you may only lose 5-10% in such short term trades. So not much of a penalty. But the real problem is that these newbies had a false sense of the risk/reward with stocks. Remember that they have never gone through a rough period with heavy losses on their hands. Thus, I believe strongly that they will stick with trading the stock market even as professional sports and sports betting come back online. Is the tech stock bubble over? Certainly we have seen the tech stocks lead the entire way up from bottom. This is most apparent in this graphic comparing the year to date returns for the 10 largest stocks of the S&P 500 versus the remaining 490. And yes, those 10 stocks includes all the FAANG stocks plus Microsoft, Nvidia, Adobe, and Netflix. This chart tells you that investors don’t believe there is a broad based rally going on. They are just stampeding to the usual suspect tech names that just so happened to have gotten a boost from Coronavirus as more people were pushed online for work, shopping and entertainment. But the main reason the tech bubble is not over is that the sports gamblers had the most success with these stocks. And there is no reason to go away until they see any downside to that choice. Meaning that bubbles are periods where investors do not properly appreciate risk and reward because for too long everything was coming up roses. It is not until these investors see the thorny under-side of the bubble bursting that they will have a better respect for realistic stock movement and returns. So even though these very same tech stocks had a noticeable sell off at the end of last week, they are ready to charge ahead again this week. That can be seen in the Nasdaq futures ready to pop 1% this morning. More than 2X the level of the S&P futures. So given the history of the way bubbles work, there is likely much more upside to this move before the party is over. Get more recent insights on the tech bubble here: Welcome to the Tech Bubble 2.0 Can we finally stop worrying about the return of the bear market? As already stated above…Don’t bet on it! That is because when you look beyond the bubble in the top tech stocks, there is not a true broad based improvement of the market. We saw a glimpse of that above in the chart of how the remaining 490 stocks in the S&P are still down on the year and quite flat of late. However, it really comes back to the traditional ways we view the market from a fundamental and technical perspective. When you review the current facts and consider that versus historical precedence both these schools of thought point to a return of the bear market. First, because the economy is in shambles and will be for quite some time. Second, because there NEVER has been a V bottom in bear market history. And certainly not a logical outcome only 3 weeks after the bear market began when the typical bear market is a 13 months process. I did a deep dive on these topics in a recent presentation that I put online. Now is a great time to check that out to appreciate why the bear market will come out of hibernation sooner or later. Plus how the Presidential Election cycle is another big hurdle for the stock market this year: Newly Revised 2020 Stock Market Outlook. What to Do Next? I know its crazy out there. And I am trying my best to help investors make sense and profit from the situation. The best way for me to do that is give you 30 days access to the Reitmeister Total Return. This is my newsletter service where I share more frequent commentaries on the market outlook, trading strategy, and yes, a portfolio of hand selected stocks and ETFs to produce profits whether we have a bull…a bear…or anywhere in between. And right now I continue to strongly believe bear makes a lot more sense than bull as the year progresses. Yet at the same time one has to give a nod to the bubble that is occurring for a select group of stocks. The solution is a unique portfolio I have constructed that provides protection against the bear when it reawakens from hibernation. While at the same time leans into some of the stocks that are benefiting the most from the current bubble. That explains how we continue to top the market at this time. Just click the link below to see all 11 stocks and ETFs in this uniquely successful portfolio. Plus get ongoing commentary and trades to adjust your strategy as 2020 continues to the wildest market in history. Gladly it can be tamed. About Reitmeister Total Return newsletter & 30 Day Trial Wishing you a world of investment success! Steve Reitmeister …but everyone calls me Reity (pronounced “Righty”) CEO, Stock News Network and Editor, Reitmeister Total Return SPY shares rose $1.46 (+0.45%) in premarket trading Monday. Year-to-date, SPY has gained 0.72%, versus a % rise in the benchmark S&P 500 index during the same period."}]}