{"article": [{"url": "https://stocknews.com/news/baba-jd-pdd-bidu-3-chinese-internet-stocks-challenging-alibaba/", "published": 1594642100.0, "headline": "3 Chinese Internet Stocks Challenging Alibaba", "body": "Over the last couple of weeks, Alibaba (BABA) has been breaking out to new, all-time highs on strong volume. It’s one of the best operators in a growing market, as it’s carved out a leading position in e-commerce, cloud computing, and fintech. BABA’s success also reflects the tremendous size and growth and opportunities of the Chinese Internet and cloud computing markets. The Chinese economy is expected to grow between 5 and 8% over the next decade. And, the Chinese Internet and cloud computing are expected to grow 10 and 16% over the next decade, respectively. As each segment becomes a bigger and more vital part of the overall economy, there will be many other winning companies competing in the same space as Alibaba. 9 \"BUY THE DIP\" Growth Stocks For 2020Here are three Chinese internet stocks that are challenging Alibaba’s dominance: JD.com (JD) JD started with a single, retail location in 1999 that was 4 square meters. From these humble origins, it’s become the second-largest e-commerce company in China. It became a primarily online-focused business in 2003, although it still maintains a significant, retail presence. Like BABA, JD has grown with the country as the Chinese population gets wealthier and their citizens utilize the internet even more. It competes with BABA directly in terms of fulfillment, shipping, and delivery. It sells directly to consumers and also has its marketplace, where businesses can sell directly to consumers. JD handles all the back-end processes, makes money from listings and advertising, and takes a cut of each transaction. Also like BABA, it has used its knowledge of the Internet space and profitable marketplace to grow horizontally by investing in cloud computing. The company was keen on the power and opportunity in cloud computing since it was so integral to the success of its operations. It’s also broken out to new, all-time highs over the last week. It’s up more than 200% since its IPO and is up more than 77% so far this year. JD has a Strong Buy rating in our POWR Ratings with an “A” for Trade Grade, Peer Grade, Industry Rank, and Buy & Hold Grade. Among Chinese stocks, it’s ranked #3 out of 115. Baidu (BIDU) At one time, BIDU was the hot Chinese Internet stock with a dominant position in search. Like Google (GOOG), its search business was a cash-cow and it used its profits to build market share in adjacent industries. It also has a presence in video streaming, AI, and cloud computing. In these areas, it’s competing with Ali Baba. BIDU’s stock has been a laggard over the past couple of years. The stock is off more than 50% from an all-time high set in 2018. BIDU has a price to sales ratio of 3, while BABA’s is 9. However, the stock’s period of underperformance makes it appealing from a valuation perspective, especially since it has a multitude of future growth drivers like autonomous driving, AI, and cloud infrastructure. BIDU has a $45 billion market cap and $11 billion in cash. It has its core search business, where it has a 70% market share. It’s lagging behind BABA in the cloud, but it’s growing at a 110% rate, while BABA is growing at 50%. On an overall basis, cloud spending in China grew at 65% last year, so there’s plenty of opportunity for companies in that sector. Pinduoduo (PDD) PDD is a newcomer to the e-commerce space. Although it’s a new company, it has been able to grow remarkably fast and reached $1 billion in annual gross merchandise volume on its platform in less than 5 years. It has a unique growth method in which people can recruit their friends and family to buy along with them and then unlock group discounts. This has made the product viral and popular among young people. Over the last five quarters, revenue has increased from $1.9 billion to $4.6 billion. It’s one of the few stocks which has outperformed BABA with a 133% gain YTD and 361% gain over the past year. PDD has a Buy rating in our POWR Ratings and ranks #18 out of 115 Chinese stocks in the group. The stock has an “A” for Trade Grade, Peer Rank, and Industry Rank with a “B” for Buy & Hold Grade. Want More Great Investing Ideas? 9 “BUY THE DIP” Growth Stocks for 2020 Top 5 WINNING Stock Chart Patterns 7 “Safe-Haven” Dividend Stocks for Turbulent Times BABA shares rose $0.03 (+0.01%) in after-hours trading Monday. Year-to-date, BABA has gained 18.66%, versus a -1.17% rise in the benchmark S&P 500 index during the same period."}]}