{"article": [{"url": "https://stocknews.com/news/vz-tmus-sbac-cbb-is-verizon-a-good-buy/", "published": 1600258100.0, "headline": "Is Verizon a Good Buy?", "body": "Verizon Communications Inc. (VZ) is one of the world’s top communications, information, and entertainment products and services providers to consumers, small and medium businesses, global enterprises, and governmental agencies. The company primarily operates with two segments – wireless and wireline. VZ’s consumer group for both the business segments include more than 94 million retail connections and 90 million post-paid connections. (VZ is one of the stocks currently in Steve Reitmeister’s Total Return portfolio. Learn more here.) With robust growth in demand for wireless networks amid the pandemic, VZ’s customer base increased exponentially. The company added 352,000 retail post-paid wireless consumers, including 173,000 phone additions and 287,000 post-paid smartphone additions, during the last quarter. Verizon Media Group, a division of VZ, also launched Verizon Media Immersive platform to power the future of 5G advertising content during the last quarter. 7 \"SAFE HAVEN\" Dividend Stocks for Turbulent TimesVZ reported a top-line of $30.4 billion for its second quarter of the fiscal year 2020. EPS for the quarter came in $1.13, growing 19% year-over-year. The company is accelerating its 5G network deployment and network monetization at scale. This impressive performance and the potential upside based on several factors have helped it earn a “Strong Buy” rating in our proprietary rating system. Here is how our proprietary POWR Ratings system evaluates VZ: Trade Grade: A VZ is currently trading higher than its 50-day and 200-day moving averages of $57.95 and $57.48, respectively, indicating that the stock is in an uptrend. The stock’s 7.9% return over the past three months reflects a solid short-term bullishness. VZ’s last earnings report explained that VZ is in the forefront of 5G mobility and Intelligent Edge network. Its consumer-centric business model is helping the company execute Network-as-a-Service (NaaS) at scale. Its next-gen B2B applications are also acting as a catalyst to further strengthen its position. Buy & Hold Grade: A VZ is well positioned in terms of proximity to its 52-week high, which is a key factor that our Buy & Hold Grade takes into account. The stock is currently trading just 2.6% below its 52-week high. The stock has gained more than 44% in the last three years. The recent developments within the company are enabling enterprises to engage with their customers digitally. Moreover, it has an impressive performance history, as its free cash flow grew at a CAGR of 26.6% over the past three years. VZ has recently announced an agreement with America Movil to acquire Tracfone, a leading pre-paid and value mobile provider in the United States. The acquisition expands Verizon’s portfolio into the value segment, bringing enhanced access to its industry-leading wireless network. Peer Grade: A VZ is currently rated #1 out of 24 stocks in the Telecom – Domestic industry. Other popular stocks in the industry are T-Mobile US, Inc. (TMUS), SBA Communications Corporation (SBAC), and Cincinnati Bell Inc. (CBB). While VZ gained 1.9% year-to-date, TMUS, SBAC and CBB gained 47.8%, 34.2%, and 43.6%, respectively, over this period. However, VZ is better positioned than many of its peers based on its ability to capitalize on the upcoming 5G boom. Industry Rank: B The Telecom – Domestic industry is ranked #14 out of the 123 StockNews.com industries. Since the onset of the health crisis, remote working, and learning culture amplified the dependence on telecom infrastructure. The nationwide lockdown led to high demand for high-speed internet in every household. This situation has created enormous opportunities for the industry. Overall POWR Rating: A (Strong Buy) Overall, VZ is rated a “Strong Buy” due to its impressive past performance, steady growth in its wireless user base, and short-and-long-term developments, as determined by the four components of our overall POWR Rating. Bottom Line VZ has remained profitable and maintained its leadership position during the pandemic. It has the potential to grow further based on disciplined network strategy, strong operational performance, and wireless customer growth. Analyst sentiment, which gives a good sense of a stock’s future price movement, is pretty impressive for ADBE. The average broker rating of 1.7 indicates a favorable analyst sentiment. Of the 25 Wall Street analysts that rated the stock, 7 have given it a “Strong Buy” rating. The market expects EPS to grow by 6.9% annually for the next five years. Want More Great Investing Ideas? 7 Best ETFs for the NEXT Bull Market Is the Stock Market Correction Over? Chart of the Day- See the Stocks Ready to Breakout VZ shares fell $0.07 (-0.12%) in after-hours trading Wednesday. Year-to-date, VZ has gained 1.54%, versus a 6.35% rise in the benchmark S&P 500 index during the same period."}]}