{"article": [{"url": "https://stocknews.com/news/bby-ea-chkp-3-top-stocks-robinhood-investors-should-be-buying/", "published": 1599566900.0, "headline": "3 TOP Stocks Robinhood Investors Should Be Buying", "body": "The stock market has experienced two extremes this year. First was the historic drop in February and March. Then we witnessed the quickest rally from a bear-market bottom of all time. This rally saw investors of all types jump on board due to FOMO or fear of missing out. This was exhibited most clearly by millennial investors on the stock trading app, Robinhood. Unfortunately, there didn’t seem to be any long-term strategy with their investments. Many of these investors were buying many stocks based on their price returns and news. Investors were piling into stocks such as Tesla (TSLA) and Zoom (ZM). That was fine when the stocks were soaring, but things have changed, at least temporarily, since Wednesday afternoon. The S&P 500 is down 7.1% since its peak on Wednesday. This has been a rude awakening for many investors on the platform. 7 Best ETFs for the NEXT Bull MarketInstead of chasing short-term returns, Robinhood investors should invest in strong companies trading at attractive prices. I like to evaluate stocks based on various metrics, including valuation, profitability, growth, and momentum. So, I chose three stocks that grade well in each of these metrics. Here are my top three stocks for Robinhood investors to consider: Best Buy Co. (BBY), Electronic Arts (EA), and Check Point Software Technologies (CHKP). Best Buy Co. (BBY) BBY is one of the largest consumer electronics retailers in the U.S., with product and service sales representing 9.3% of the $450 billion-plus market in personal consumer electronics and appliances expenditures in 2019, according to estimates from the U.S. Bureau of Economic Analysis. The company is currently focused on accelerating its online sales growth, improving its multichannel customer experience, and developing new in-store and in-home service offerings. The company had a strong second quarter, outpacing earnings and revenue estimates. Earnings jumped 58.3% year over year. This was due to sales of products that support the stay at home trend, including tablets and home appliances. BBY’s online sales were strong due to higher traffic and conversion. The company is also benefiting from the improvement in its digital services such as curbside pickup. Aside from its pullback, the stock has exhibited strong momentum. The company also has strong profitability figures with a return on equity of 43.1% and a return on invested capital (ROIC) of 21.8%. In terms of valuation, BBY has a free cash flow yield of 18.2% and a price to earnings ratio of 17.1; both are attractive numbers. BBY is rated a Buy in our POWR Ratings system. The stock has a grade of A for Trade Grade, and a B for Buy & Hold Grade and Peer Grade. These are three out of the four components that make up the POWR Ratings. The company is also the #3 stock in the Specialty Retailers industry. I believe the stock should perform well going forward due to my belief that electronic & appliance products should fare well as long as Covid-19 continues. Electronic Arts (EA) EA is one of the world’s largest third-party video game publishers. It has transitioned from a console-based video game publisher to one of the largest publishers on consoles, PC, and mobile. The company owns several large video games franchises, including Madden, FIFA, Battlefield, Apex Legends, Mass Effect, Dragon’s Age, and Need for Speed. It has been the primary beneficiary of the current shift from physical to digital versions of video games. EA expects its digital business to grow on the back of its live services and its strong mobile segment. Digital games are more profitable for the company as they have minimal packaging costs. The firm has grown in regions like the Middle East and countries like China and Korea due to Esports. EA has a strong list of releases for the fiscal year 2021, including the latest installments of FIFA and Madden NFL. The company has shown solid revenue growth with a $1.39 billion revenue figure for the most recent quarter. This was an 87% jump from the year-ago figure. EA has strong profitability figures with a return on equity of 25.5% and an ROIC of 24.6%. Its valuation figures are also attractive, with a P/E of 18.3 and a free cash flow yield of 5.2%. EA is currently rated a Buy in our POWR Ratings system. It has a grade of A for Trade Grade, and a B for both Buy & Hold Grade and Peer Grade. It is also the #3 ranked stock in the Entertainment – Toys & Video Games industry. I believe in the company due to its portfolio of games that should see a boost in revenue as many next-generation game consoles are expected to be released over the next quarter. The company should also continue to benefit from people playing videos during the pandemic, especially as the weather gets cooler. Check Point Software Technologies (CHKP) CHKP is a cybersecurity vendor. The company offers solutions for network, endpoint, cloud, and mobile security in addition to security management. The firm sells to enterprises, businesses, and consumers. The company broke into the industry with its FireWall-1 product and expanded its footprint to include full enterprise security, including endpoint security, remote access, and network security. The company sees growth due to strong demand for its CloudGard solution, which provides cloud-native security with advanced threat prevention. Its Sandblast Zero-day threat prevention and Infinity solutions are also driving the company’s growth prospects. CHKP is looking to increase revenue through a subscription-based model, which generates stable recurring revenue. The firm is also seeing increased demand for network-security gateways due to the increasing adoption of its remote-access VPNs. CHKP has had solid growth over the past five years and is highly profitable with a return on equity of 24.5% and an ROIC of 22.7%. Its revenue and earnings figures both beat analyst expectations for the most recent quarter. The company is still trading at an attractive price based on its 6.2% free cash flow yield. The company is rated a Buy in our POWR Ratings system. It has a grade of A for Trade Grade, and a B for Buy & Hold Grade and Peer Grade. It is also the #3 ranked stock in the Software-Security industry. I believe CHKP is a Buy due to its strong balance sheet and growth prospects. The company should see increased growth as it expands into newer markets and increases its presence in the small to mid-sized business segment. Want More Great Investing Ideas? 7 Best ETFs for the NEXT Bull Market Will Stocks Fall into Historical September Slump? 9 “BUY THE DIP” Growth Stocks for 2020 BBY shares fell $0.46 (-0.44%) in after-hours trading Tuesday. Year-to-date, BBY has gained 21.81%, versus a 4.59% rise in the benchmark S&P 500 index during the same period."}]}