{"article": [{"url": "https://stocknews.com/news/apha-why-aphria-crashed-after-earnings/", "published": 1596197300.0, "headline": "Why Aphria Crashed After Earnings", "body": "While the cannabis sector has been gearing up for earnings season, many investors were speculating that Aphria (APHA) would post another stellar earnings report. Unfortunately, that was not the case. APHA reported a net loss of 29 cents per share, a huge miss compared to analyst expectations of $-0.03 per share. Revenue came in at $113.85 million, which was up 18% from a year ago, and 5% from the previous quarter. Analysts were expecting revenues of $102.31 million. Net cannabis sales came in at 39.79 million USD, down from 41.66 million USD in the previous quarter. The number of kilograms sold by APHA also fell, as sales slowed. When it comes to medical cannabis, the average retail selling price increased to CA$6.63 per gram from CA $6.41 in Q3. The price per gram for the recreational market continued to fall as it hit CA$5.23 per gram, down from CA$5.47 per gram in the previous quarter. 7 Best ETFs for the NEXT Bull MarketAPHA recorded a non-cash impairment of 64 million Canadian dollars this quarter, related to “measures taken with respect to certain of the Company’s international businesses in response to the COVID-19 pandemic.” Due to the additional charges, production costs rose to $116.6 million, from $50.9 million in the prior quarter, and $60.0 million a year ago. Irwin D. Simon, Chairman and Chief Executive Officer at APHA had the following remarks on the quarter, “At Aphria, we are setting ourselves apart from the rest of the cannabis industry. We have generated some of the strongest sales growth, we have one of the strongest balance sheets and cash positions, compelling consumer brands, and a well-diversified global business. We are grateful for the dedication of our employees for whom our commitment to protect their safety is unwavering and remains a founding principle of our company. Our strong finish to fiscal year 2020 demonstrates that this was a transformative year for Aphria, as our net revenue increased 129% from fiscal year 2019. We continue to focus on capturing strong market share in Canada by executing upon our strategic plan and positioning Aphria as a leader in category innovation.” Though this wasn’t a good quarter for Aphria, this is still a solid cannabis company. Overall, they have been operating efficiently, seeing profits when their industry peers have struggled. Therefore, I am optimistic that APHA will be fine in the long run and this quarter was just a “bump in the road.” Disclosure: The author is long APHA Want More Great Investing Ideas? 9 “BUY THE DIP” Growth Stocks for 2020 How HIGH Can This Tech Bubble Fly? 7 “Safe-Haven” Dividend Stocks for Turbulent Times APHA shares were unchanged in after-hours trading Friday. Year-to-date, APHA has declined -8.43%, versus a 2.49% rise in the benchmark S&P 500 index during the same period."}]}