{"article": [{"url": "https://stocknews.com/news/spy-inx-dia-iwm-qqq-the-shock-awe-of-this-sector-rotation/", "published": 1597234100.0, "headline": "The “SHOCK & AWE” of This Sector Rotation", "body": "(Please enjoy this updated version of this week’s commentary from the Reitmeister Total Return newsletter). Over the weekend on StockNews.com I posted an updated view of what I believe happens next for stock prices: 3 Possible Directions for the Stock Market from Here. The outlook expressed there is not a shocker to any Reitmeister Total Return member as we have talked about this consistently in the past. And that is where we have a mini-bubble forming that looks set to burst around September as the market takes a run at the all time highs. And just like clockwork the market is wasting no time rising day by day up in route to 3,393. 9 \"BUY THE DIP\" Growth Stocks For 2020Yes, it came up just short today. But as sure as day follows night, we will touch it. And likely a notch or two above before this bubble finally pops. The calling card of a sector rotation is that recent winners get pummeled and recent losers get bid up. That is explains why technology and precious metals were sold with reckless abandon. That money is being moved to many of the underperforming groups…most of which have been languishing because of the extreme effects of the Coronavirus on their business. I am referring to hotels, restaurants, airlines, cruise lines etc. Many of which are represented in our recent addition of (ETF name deleted as the recommendation is reserved for Reitmeister Total Return subscribers). But also many of the economically sensitive groups spent some time in the sun like industrials, banks, autos, and energy. This is actually a very positive sign for the market to broaden out from its previous FAANG + Tesla obsession. But it is only positive if there is serious reason for economic optimism. The main catalyst on Tuesday came in the form of the first registered vaccine hailing from Russia. Yes, the sooner a vaccine comes on the scene the sooner the World economy will repair. And certainly most beneficial for all the industries most harmed by the virus. Unfortunately it is right to look at the Russian claims with some suspicion given a much less stringent testing regime than used in other parts of the world. And the Russian government hailing this victory has a penchant for being “less than 100% honest”. But of course we hope this to be true for the benefit of all mankind. Back to the investment ramifications. Let’s say an effective and widely available vaccine is on the market by then end of the year. Does that make me bullish? No. Its makes me neutral. That is because we are already at the all time highs yet it will take 2-3 years for earnings to get back to peak levels. Or to put it another way, this is kind of like earnings season where a stock runs up in anticipation of strong results. And then indeed it is an impressive beat with shares actually falling afterwards. That is what the experts call “buy the rumor, sell the news”. Meaning that good news was expected which is why it rallied in advance of the announcement. As you can see, the market has already bought the rumor. That is how you shockingly get to an all time high in the midst of the worst economic environment since the 1930’s. So at best stocks tread water for a couple years as earnings rise enough to justify the valuations. This matches up with scenario #2 from my weekend article. That environment is unfulfilling for mutual fund and index investors because the average stock will be pretty close to breakeven. But stock pickers wading into the right sectors and specific stocks offering exceptional growth and/or value will find outperformance. And yes, I like our odds in that environment. However, before we assume this is the proper glimpse of our future, I have to return to what I believe is the most likely scenario. That being continued economic malaise for 1-2 years to come. And at some stage investors FINALLY wake up and smell the economic decay leading to lower share prices. The main catalysts for this decline have been spelled out for you a few times in recent commentary including an in-depth discussion in the August Members Only Webinar. But the short answer is a combination of economic data likely to roll over and go negative in September. Plus how poorly stocks have been treated in September and October of each Presidential election cycle. Speaking of the economic data turning south once again, we are getting glimpses here and there. For example, this morning the NFIB Small Business Optimism Index came in lower than expected. But most importantly see the full take by TradingEconomics.com with the key sections highlighted in bold by me. “The NFIB Business Optimism Index in the United States fell to 98.8 in July of 2020 from 100.6 in the previous month, as coronavirus cases continue to rise across the country. The outlook for general business conditions over the next six months deteriorated 14 points to 25, and the percentage of owners thinking it’s a good time to expand dropped 8 points to 5 percent. In addition, the Uncertainty Index increased seven points to 88. “Owners continue to temper their expectations of future economic conditions as the COVID-19 public health crisis is expected to continue”, NFIB’s chief economist said.” Yes, only 5 percent of small business owners believe that now is a good time expand. And as you likely know small business owners are traditionally the key drivers of the economic growth and job creation. This report doesn’t look good for those claiming an economic recovery is at hand. And stocks are at the all time highs because what??? On top of that is another interesting piece of information about the poor health of the US consumer when it comes to their credit picture. See article link below, but really the headline kind of says it all. Millions of Americans are worried they won’t be able to make even the minimum payments on their credit cards. Here’s what they can do So for me I am still focused on this being a mini-bubble that starts to burst in September. But the timing of trading this idea is a bit tricky. So I plan on doing it in stages. First stage = take profits off the table of the most Risk On positions. Second stage = add inverse ETFs to profit from market downside. But no sense buying them until there is some sign that indeed other investors are willing to concede to the weak fundamentals. Or fall into the Presidential Election sell off pattern. So this move is contingent on seeing early signs of an actual sell off forming. Reity, what if the September sell off doesn’t happen? Well if it is because there is growing evidence of a vaccine coming online soon, then I shared that view above. That would likely be a sideways market benefiting stock pickers with an edge for focusing on the best stocks in the best industries. And yes, I like our odds to pick and choose our way to strong outperformance in that environment. But it that is not the case, and stocks just continue to rise so far ahead of the true fundamental picture, then the outlook would fall to the 3rd scenario from the weekend article. That being an extended bubble reminiscent of the late 1990’s. So overweighting the groups that were doing the best earlier this summer like technology and precious metals would be the same groups to overweight in this scenario. (More about each of those groups in the Portfolio update section further below). The key is at this moment is to under that no environment is more confusing then sector rotation. That is because today’s big winners often become tomorrow’s big losers…and vice versa. So it’s best to fix your eyes to the longer term horizon just beyond the sector rotation. When you consider that outlook, and the trades you want to be in for that environment, then easier to not get overly swayed by the day to day volatility that shows up on your screen. I hope you agree we have the right plans in place for whatever Mr. Market throws our way. Trading Strategy Right now my Reitmeister Total Return portfolio is positioned based upon Scenario #1. That being where we are in the midst of a mini-bubble that will likely end as soon as September Of the 11 stocks and ETFs on board I am overweight technology and precious metals. Plus 3 stocks that are uniquely positioned in both a Coronavirus fueled recession and when things get back to normal. Few stocks check both those boxes…but these 3 stocks certainly do which is why they are all serious outperformers of late. Then, not unlike scenario #3, I am sleeping with one eye open awaiting for the party to be over with 20%+ correction quite likely in store. The rolling over of economic data is one possible clue that’s it time to spring into action. Or its about investors sinking into the Presidential Election cycle sell off is yet another clue. The plan would be to bag gains on all the big stock winners and switch over to inverse ETFs as the best route to profits. Meaning if the market is going to tank then going to cash is nice…but inverse ETFs are going to be the best trade in town. But let’s be honest with ourselves. Its crazy out there! That’s why I am trying my best to help investors make sense of it all and profit from whatever scenario comes our way. The best way for me to do that is give you 30 days access to the Reitmeister Total Return. This is my newsletter service where I share more frequent commentaries on the market outlook, trading strategy, and yes, a portfolio of hand selected stocks and ETFs to produce profits whether we have a bull…a bear…or anywhere in between. As shared above, the unique portfolio I have constructed at this time leans into the stocks that are benefiting the most from the current bubble. That explains how we continue to top the market at this time. Yet we are FULLY prepared for when the rug gets pulled out and stock prices better reflect the still dire economic situation. Just click the link below to see all 11 stocks and ETFs in this uniquely successful portfolio. Plus get ongoing commentary and trades to adjust your strategy as 2020 continues to the wildest market in history. Gladly it can be tamed. About Reitmeister Total Return newsletter & 30 Day Trial Wishing you a world of investment success! Steve Reitmeister …but everyone calls me Reity (pronounced “Righty”) CEO, Stock News Network and Editor, Reitmeister Total Return SPY shares rose $2.74 (+0.82%) in premarket trading Wednesday. Year-to-date, SPY has gained 5.23%, versus a % rise in the benchmark S&P 500 index during the same period."}]}