{"article": [{"url": "https://stocknews.com/news/ryaay-znh-algt-vlrs-4-airline-stocks-up-in-july/", "published": 1596542900.0, "headline": "4 Airline Stocks That Actually ASCENDED in July", "body": "Airline investors have been burned this year for obvious reasons. The airline stocks experienced a strong bounce from mid-May to early June as case counts were declining and economies were reopening. However, recent developments have made it clear that the near-future is going to remain challenging for the sector. Though airline stocks pose a considerable risk, there are certainly some opportunities worth considering on a short and long-term basis. 9 \"BUY THE DIP\" Growth Stocks For 2020It may take air travel years to return to its pre-COVID levels. For the airlines that can survive this downturn, they will thrive as weaker companies will go out of business, and there will be less competition. In the short-term, some parts of the world are recovering, and life is returning to normal, so these stocks have the potential to keep climbing higher. So, it’s interesting to note that some airline stocks bucked the industry trend and increased in value this past July. Those stocks are as follows: Ryanair Holdings (RYAAY), China Southern Airlines Company (ZNH), Allegiant Travel Company (ALGT) and Controladora Vuela Compania de Aviacion (VLRS). Ryanair Holdings (RYAAY) Most Americans know little-to-nothing about RYAAY simply because the airlines operate outside of the United States. Now and then you will see RYAAY pop up in a story, typically highlighting the company’s penny-pinching ways. However, RYAAY pinches pennies for good reason to give its customers the cheapest flights in Europe. The airline provides unbeatably low airfares and efficient service throughout Ireland, the United Kingdom, Morocco, and Continental Europe. The POWR Ratings reveal RYAAY has an A Peer Grade, a B Trade Grade, a solid Buy & Hold Grade, and an overall ranking of #1 out of more than 22 Airline stocks. TipRanks analysts’ ratings of RYAAY put the stock’s price target at $90, indicating there is more than 20% upside to go. It is hard to believe RYAAY is up to $20 from its March sell-off low of $47. Though the stock has not returned to its pre-COVID trading level of $90 to $100, it has displayed considerable strength while most other airlines have struggled to remain in business. China Southern Airlines Company (ZNH) Commercial airline service, cargo transportation via the air and mail service by air are still essential activities. Goods must be transported to keep the economy in halfway decent shape yet there are few instances in which passenger air travel is an absolute necessity. This is precisely why ZNH has plenty of bulls in its corner. The POWR Ratings reveal ZNH has a B Peer Grade and a #3 ranking of 22 airline stocks. However, ZNH has not returned to its pre-COVID trading price of $30 to $35. ZNH has spiked four times across the past five months, enduring a sell-off each time it reaches $26. Look for ZNH to break through this ceiling as China’s economy regains momentum in the months ahead. It should not be long until ZNH moves back toward its pre-COVID trading level. Allegiant Travel Company (ALGT) It is particularly interesting to learn ALGT was modestly higher in July, because its service is centered on air transportation to leisure destinations. After all, few travelers are willing to risk coronavirus exposure on a flight to Las Vegas or Orlando. Yet, one possibility is that investors are betting that the company is best-positioned to survive this downturn and increase market share in the long-term. However, it appears as though ALGT has found a trading floor at $105. The POWR Ratings reveal ALGT has an A Peer Grade and an Industry Rank of six out of nearly two dozen Airline stocks. The top analysts have set a price target of $139.71 for ALGT. If this forecast comes true, ALGT will have spiked more than 25%. Controladora Vuela Compania de Aviacion (VLRS) Though you might be hesitant to invest in traditional airlines that transport potential coronavirus-carriers from place to place (i.e. humans), you might be more receptive to the idea of investing in an airline that transports non-humans. VLRS provides air transportation for private enterprise, flying everything from food to medicine, flowers, and even human remains. In other words, this is one of the safer airline stocks to invest in. VLRS has an Industry Rank of seven out of 22 stocks along with a B Peer Grade. VLRS has steadily climbed upward since its coronavirus dips down below $4. Though it might take months or years for VLRS to move back toward its pre-COVID levels of $13, it could easily approach double digits within a couple of quarters. Want More Great Investing Ideas? 9 “BUY THE DIP” Growth Stocks for 2020 How HIGH Can This Tech Bubble Fly? 7 “Safe-Haven” Dividend Stocks for Turbulent Times RYAAY shares were trading at $75.07 per share on Tuesday morning, up $0.32 (+0.43%). Year-to-date, RYAAY has declined -14.31%, versus a 3.17% rise in the benchmark S&P 500 index during the same period."}]}