{"article": [{"url": "https://stocknews.com/news/hd-low-w-tol-mth-buy-these-5-stocks-to-capitalize-on-americans-moving-to/", "published": 1601554100.0, "headline": "Buy These 5 Stocks to Capitalize on Americans Moving to the Suburbs", "body": "Americans are moving out of large cities in droves. Suburban and rural areas are receiving an influx of new residents, many of whom will work from home through the pandemic and beyond. The shift to the suburbs will benefit specific stocks as Americans fill out their spacious homes with furniture, home office equipment, and other sundries. However, most investors are unsure as to which stocks are best to own as this potentially permanent shift plays out. 7 Best ETFs for the NEXT Bull Market Let’s take a quick look at five stocks most likely to benefit from Americans’ migration to the ‘burbs: Home Depot (HD), Lowe’s Companies (LOW), Wayfair (W), Toll Brothers (TOL), and Meritage Homes Corporation (MTH). Home Depot (HD) Suburban and rural homes are spacious and require considerable upkeep. Americans will undoubtedly head to HD to load up on home maintenance tools, equipment, and niceties. HD is the largest home improvement business in the world. HD operates right here in the United States, Mexico, Canada, Puerto Rico, and a couple of other countries. HD is a POWR Ratings superstar with A grades in each Component but for its Peer Grade which is still quite respectable with a grade of B. HD is ranked first of 68 stocks in the Home Improvement & Goods space. The top analysts have a rosy outlook for HD, setting an average price target of $310.89, meaning the stock has nearly 15% upside. It appears as though the only event that can slow HD is a housing downturn. However, homes are being built left and right as more people move out of densely packed cities, meaning HD should continue its bull run. Lowe’s Companies (LOW) The shift to the suburbs means homeowners will invest a considerable amount of money, time, and effort to improve their spacious pads. LOW will benefit from this trend in the months, years, and decades ahead. LOW has everything suburban and rural homeowners need for living space improvement, maintenance, and beautification. The POWR Ratings show LOW has A grades in each component. LOW is ranked second of 68 stocks in the Home Improvement & Goods space. The top analysts are bullish on low, setting a price target of $185.67, meaning the stock has nearly 14% upside. LOW’s forward P/E ratio is under 20, meaning it is likely slightly undervalued considering its potential for growth as the suburbanization trend continues. LOW’s e-commerce platform is gradually expanding, boosting second-quarter online sales by more than 135%. All in all, LOW second-quarter sales exceeded $27 billion. LOW could easily zoom past its 52-week high of $171 before year’s end, possibly touching $200. Wayfair (W) Many new homeowners in the suburbs will shop online to fill out their spacious living accommodations. W will receive much of that business. W has 18 million products from 12,000+ suppliers. W also operates throughout the United Kingdom, Canada, and Germany. W has B grades in each POWR component but for its Trade Grade which is an A. W is ranked 4th of 30+ Specialty Retailers stocks. The analysts are bullish on W, setting an average price target of $312. Though W ships its fair share of large furniture, the company does so creatively and profitably. Do not hesitate to invest in W as the suburbanization trend plays out. This stock should remain a power player in the home furnishing sector for years to come. Toll Brothers (TOL) Investors have the opportunity to directly benefit from the homebuilding bonanza. Invest in TOL and your money is likely to grow as the company continues to construct single-family detached, attached, master-planned, high-rise, and other living communities. TOL homes are coveted by first-time home buyers, active adults, empty-nesters, home investors, age-qualified home seekers, and just about everyone else. The POWR Ratings reveal TOL has A grades in each POWR Component. TOL is ranked in the top five of 21 Homebuilders. TOL has a forward P/E ratio of 16.26, indicating it is likely undervalued at its current price just below $50. TOL’s all-time high in contract signings makes it quite clear the pandemic will continue to benefit this homebuilding superstar in at least the next couple of financial quarters. Meritage Homes Corporation (MTH) Single-family homes will continue to spike in popularity as city-dwellers look for an escape from urban spaces. This is music to the ears of MTH investors as the company is one of the nation’s top designers and builders of such homes. Single-family home permits are up 17%. The POWR Ratings show MTH has A grades in each POWR Component. The stock is ranked in the top third of all publicly traded companies in the Homebuilding sector. The top analysts insist MTH has room for upward movement, setting a price target of $118.83 for the stock, indicating it has more than 10% more room to run before it is fairly priced. MTH appears to be undervalued at its current trading price of $107 as its forward P/E ratio is only 11.33. HD shares were trading at $276.84 per share on Thursday afternoon, down $0.87 (-0.31%). Year-to-date, HD has gained 29.06%, versus a 6.04% rise in the benchmark S&P 500 index during the same period."}]}