{"article": [{"url": "https://stocknews.com/news/acb-apha-could-an-aurora-cannabis-and-aphria-merger-actually-happen/", "published": 1594814900.0, "headline": "Could an Aurora Cannabis and Aphria Merger Actually Happen?", "body": "This week, it was reported that Aurora Cannabis (ACB) and Aphria (APHA) recently held advanced talks to merge in what would have been one of the largest mergers in the cannabis sector to date. Those discussions broke down late last week, according to two people familiar with the matter. Two sources told BNN Bloomberg Both that the companies took a step back from negotiations after failing to agree on board structure and compensation for senior-level executives. They did not know if the two companies would resume talks. Michelle Lefler, Vice-president of Communications at ACB, told BNN Bloomberg in an email that the company’s corporate policy is “not to comment on rumors or speculation.” APHA was also silent on the matter as a spokesperson for APHA did not provide comment after multiple requests from BNN Bloomberg. 7 \"SAFE HAVEN\" Dividend Stocks for Turbulent TimesBefore the negotiations came to a halt, executives came to a partial agreement that would have seen APHA shareholders control approximately 51 percent of the combined company. ACB shareholders would own the remaining 49 percent. According to one of the sources who were not familiar with the planned exchange ratio, the deal would have been conducted through a share swap. APHA CEO Irwin Simon was set to become Chief Executive Officer of the new company. This would be a blessing for ACB shareholders because APHA is already profitable and has a better balance sheet than ACB. This might also explain why ACB is taking such a long time to announce a new CEO. My only concern with the potential merger is the massive debt that ACB still holds on its balance sheet. The details of this transaction are still under wraps as this is just a rumor right now, but as the cannabis sector continues to consolidate, this is something investors should keep in mind. Overall, an ACB and APHA merger would make sense, and in my opinion, could be what both companies need to take the number one spot in the Canadian cannabis sector away from CGC. Disclosure: The author is long APHA and ACB Want More Great Investing Ideas? 9 “BUY THE DIP” Growth Stocks for 2020 Top 5 WINNING Stock Chart Patterns 7 “Safe-Haven” Dividend Stocks for Turbulent Times ACB shares were trading at $12.17 per share on Wednesday afternoon, up $0.42 (+3.57%). Year-to-date, ACB has declined -53.05%, versus a 0.85% rise in the benchmark S&P 500 index during the same period."}]}