{"article": [{"url": "https://stocknews.com/news/nok-aten-mndo-3-strong-buy-tech-stocks-under-10/", "published": 1599048500.0, "headline": "3 \"Strong Buy\" Tech Stocks Under $10", "body": "Tech stocks have been the stock market’s biggest source of strength since the market bottom in March. The S&P 500 recorded its steepest August gain since 1986 with tech stocks the best-performing group. While the top tech stocks attracted the majority of investors’ attention, there are still several, attractive low-priced stocks. If the technology rally continues, it’s possible that these stocks could see big gains. Here are three such stocks that are currently trading below $10 and could offer intriguing upside: Nokia Corporation Inc. (NOK), A10 Networks, Inc. (ATEN), and MIND C.T.I. Limited (MNDO). 7 \"SAFE HAVEN\" Dividend Stocks for Turbulent TimesNokia Corporation Inc. (NOK) NOK is engaged in network and technology businesses worldwide. The company has a strategic collaboration with Microsoft Corporation (MSFT) and offers network infrastructure software, hardware, and services across different screens, mobile networks, and operating systems. NOK closed yesterday’s trade at $4.71. The stock hit a 52-week low of $2.34 due to a virus-led crash on March 18th. This implies that the stock has already more than doubled from the low. Moreover, NOK has a year-to-date gain of 27.5%. The company’s second-quarter result did not fail to impress the street. NOK delivered an earnings surprise of 133% by reporting an EPS of $0.07. The enterprise grew year-on-year constant currency sales by 18% to $5.7 billion, primarily contributed by the 4.5% year-on-year enhancement in Networks gross margin. Net income improved significantly to $105.6 million compared to the year-ago loss of $219.5 million. Free cash flow for the firm stood $285 million compared to the negative cash flow of $875 million last year. NOK also reported $374 million as cash flow from operations. NOK has recently announced that it is launching the first in a series of professional-level certifications to train and certify industry professionals on end-to-end 5G networks from network access to application management. Moreover, Nokia and StarHub recently conducted South East Asia’s first live 5G non-standalone network trial in Singapore, aimed towards delivering better user experience. NOK returned $1.1 million to the shareholders in the form of dividends during the last reported quarter. It translates into a yield of 1.02%. Furthermore, in line with the clear roadmap progress, particularly related to the 5G mid-band portfolio, the street expects EPS to grow more than 21% next year. The revenues are estimated to be $25.4 billion for the current year. NOK has a 59% buy rating as per the Robinhood analyst ratings with the consensus price target of $5.44. This implies a potential upside of 15% from its current price. How does NOK stack up for the POWR Ratings? A for Trade Grade B for Buy & Hold Grade A for Peer Grade B for Industry Rank B for Overall POWR Rating. It is also ranked #8 out of 52 stocks in the Technology – Communication/Networking industry. A10 Networks, Inc. (ATEN) ATEN provides application delivery controllers for optimizing data center performance, carrier-grade networking products that offer address and protocol translation services for service provider networks, and a distributed denial-of-service threat protection system for network-wide security protection. It operates through two segments – Service and Cloud Providers, and Enterprise. The stock closed yesterday’s trading session at $8.38, 9% lower than its 52-week high of $9.21. With a year-to-date gain of 22%, the stock is up more than 131% from its March lows. Wall Street analysts expect the stock to reach $13.5, increasing more than 61% from the current price. The company’s top-line grew 6.7% year-over-year to $52.5 million for its second quarter ended June 2020. The operating income improved significantly to $7.2 million compared to the year-ago loss of $0.9 million. Revenue contributed by the Enterprise segment improved to 42% versus 35% in the preceding quarter. ATEN generated $10.47 million as cash flow from operations and free cash flow of $9.79 million. The company also repurchased common stocks worth $9.73 million during the quarter. ATEN, in collaboration with Dell Technologies (DELL), announced a set of solutions, in the previous quarter, that delivers application security and availability for customers who are increasingly facing the operational and security complexities of hybrid-cloud infrastructures. EPS for the last reported quarter came in $0.09, beating the consensus estimate by 12.5%. Moreover, ATEN beat EPS estimates in each of the trailing four quarters. With the increasing demand for business-critical applications that are secure, available, and efficient for multi-cloud transformation and 5G readiness, ATEN’s EPS for the current year is anticipated to grow 1100% year-over-year to $0.36. The top-line is expected to grow 5.8% year-over-year to $225 million in the current year. ATEN’s POWR Ratings reflect this promising outlook. It has an overall rating of “Buy” with an “A” for Trade Grade and Peer Grade, and a “B” for Buy & Hold Grade and Industry Rank. Among the 52 stocks in the Technology – Communication/Networking industry, it’s ranked #16. MIND C.T.I. Limited (MNDO) MNDO designs, develops, and operates real-time and offline convergent billing and customer care software solutions in the United States and internationally. The company offers solutions that support various services, such as voice, data, and content services and pay-in-advance payment models in a single platform. The stock closed yesterday’s trading session at $2.27 and has recovered more than 40% since hitting a low of $1.64 in April this year. The company reported impressive second-quarter results with top-line coming in at $5.6 million, as customer care and billing software totaled to $3 million contributing 53% to the total revenues. Net profit improved 35% year-over-year to $1.41 million. Free cash flow for the firm grew 8% year-over-year to $1.23 million while cash flow from operations increased 11% compared to the year-ago quarter to $1.3 million. EPS for the quarter came in $0.07, growing 40% year-over-year. MNDO had declared a dividend of $0.24 earlier this year and has an annual dividend yield of 10.41%. The company declares dividends each year during its first quarter and has a reliable dividend history for 17 years now. Moreover, this quarter’s follow-on orders include a major upgrade of the billing platform indicating better margins for the succeeding quarters. It’s no surprise that MNDO is rated a “Strong Buy” in our POWR Ratings system. It also has an “A” for Trade Grade, Buy & Hold Grade and Industry Rank, and a “B” for Peer Grade. It is ranked #31 out of 92 stocks in the Software – Application industry. Want More Great Investing Ideas? 7 Best ETFs for the NEXT Bull Market Beware Stocks in September? 9 “BUY THE DIP” Growth Stocks for 2020 NOK shares were trading at $4.77 per share on Wednesday afternoon, up $0.04 (+0.85%). Year-to-date, NOK has gained 28.57%, versus a 11.88% rise in the benchmark S&P 500 index during the same period."}]}