{"article": [{"url": "https://stocknews.com/news/amzn-googl-adbe-crm-splk-5-cloud-computing-stocks-that-are-expected-to-outperform/", "published": 1593691700.0, "headline": "5 Cloud Computing Stocks that are Expected to Outperform", "body": "The coronavirus has been responsible for widespread changes in the US economy. Consumer preferences have changed which has resulted in increased demand for certain industries. Cloud computing, which had been a niche industry, is slated to take center stage. As more people have been working from home, there has been an increase in video conferencing, and distance education. This bodes well for cloud computing service providers since many individuals and companies will be shifting their work online. Large companies now require sophisticated cloud architectures to shift their data and software applications online. Here are five cloud computing stocks expected to do well in the second half of 2020: 7 \"SAFE HAVEN\" Dividend Stocks for Turbulent TimesAmazon (AMZN) With the spread of the pandemic, AMZN has received a boost not just to its core business of e-commerce, but also to its cloud computing services. In the first quarter of this year, AMZN’s cloud computing segment AWS, brought in a record of $10 billion in revenue. That was a rise in revenue of 34.2% compared to the same period last year. With cloud computing being increasingly important for the world, AMZN is well-poised to experience high growth in the sector. AMZN has a Strong Buy rating in the StockNews.com POWR Ratings. It is the #1 stock out of 52 Internet companies. AMZN has returned 55.79% so far year to date. Alphabet (GOOGL) GOOGL has not only benefited from an overall increase in web traffic, but its cloud computing service has been flying high as well. The company’s first quarter gross revenue saw an increase of approximately 13%. In the same quarter, GOOGL’s revenue from Google Cloud rose by 52%. Google’s Cloud unit is now hiring faster than the rest of the company with expectations of faster growth. GOOGL has returned 7.66% year to day. The stock has a Strong Buy rating in the POWR Ratings. It also has a Buy & Hold Grade of A. This measures the long-term bullish or bearishness of a stock. Adobe (ADBE) This may surprise some, but ADBE is a large player in the cloud computing space thanks to its Creative Cloud product. The company also offers Experience Cloud, which focuses on providing tools for marketing, advertising, analytics, and commerce. Last month, ADBE released the Adobe Experience Manager as part of its Experience Cloud service. With a greater digital presence for many companies, the company’s latest offering seeks to provide digital experience solutions.This could mean a larger share for Adobe in the overall cloud computing market. ADBE has a year to date return of 33.35%. The stock has a Strong Buy rating in the POWR Ratings. It is also ranked #1 of out 82 stocks in Software – Application industry. Salesforce (CRM) CRM is a dedicated cloud computing services provider that operates in six core segments: sales force automation, customer support, marketing automation, community management, analytics along with a cloud platform for building custom applications. The company has announced a new mobile collaboration tool called Salesforce Anywhere. With more people working from home, there has never been a better market condition for this type of a tool. CRM has returned 17.98% so far year to date. The stock has a Strong Buy rating in the POWR Ratings It also has A Grades in all four components that make up the POWR Ratings. Splunk (SPLK) SPLK is a cloud computing service provider that focuses on big data. It enables companies and organizations to monitor and analyze big data metrics from a range of sources. The company recently announced that Splunk Cloud will now be available through Google Cloud, adding to data sharing and analysis capabilities of its users. This move could spark greater adoption of Splunk’s cloud-based tools. SPLK cloud-specific sales grew 81% in its most recent quarterly which ended on April 30.. The stock has returned 35.95% so far this year. SPLK has a Strong Buy rating in the POWR Ratings It also has A Grades in all four components that make up the POWR Ratings. Want More Great Investing Ideas? 9 “BUY THE DIP” Growth Stocks for 2020 Is the Bull S#*t Rally FINALLY Over? 7 “Safe-Haven” Dividend Stocks for Turbulent Times Top 3 Investing Strategies for 2020 AMZN shares . Year-to-date, AMZN has gained 56.42%, versus a -1.99% rise in the benchmark S&P 500 index during the same period."}]}