{"article": [{"url": "https://stocknews.com/news/rio-cube-stag-bgs-4-strong-buy-dividend-stocks-with-yields-over-4/", "published": 1599653300.0, "headline": "4 \"Strong Buy\" Dividend Stocks with Yields Over 4%", "body": "The market has been extremely volatile over recent weeks after witnessing a strong rally since the March bottom. Economists still expect a significant contraction of the global economy this year which could translate into a further market correction over the near term. Moreover, with two months to go before the US presidential election, market volatility might increase. While investing in dividend stocks is a sound investment strategy, there are not too many options currently available. In the second-quarter of 2020, the number of companies cutting dividends increased 931% year-over-year to 639. So, stocks that are still able to pay dividends and are expected to sustain them due to their fundamental strength, could be good additions to your portfolio. Rio Tinto Group (RIO), CubeSmart (CUBE), Stag Industrial, Inc. (STAG), and B&G Foods, Inc. (BGS) are four such stocks that could be a steady source of income for you due to their exceptional dividend yields and ability to sustain dividend payments. 7 \"SAFE HAVEN\" Dividend Stocks for Turbulent TimesRio Tinto Group (RIO) RIO engages in finding, mining, and processing mineral resources worldwide; with iron ore being the dominant commodity. The London-based company owns an integrated network of 16 mines in the Pilbara region of Western Australia, and RIO extracts the bulk of its ore from this mine. RIO pays an annual dividend of $3.10 which translates into a yield of 5.04%. The company has a four-year average dividend yield of 7.01%. During the past five years, the average dividends per share growth rate for RIO was 30.05% per year. The company pays dividend semiannually and the most recent payout was an interim dividend of $1.55 for the period ending June 2020. The company generated free cash flow of $1.71 billion in the last reported quarter. It also reported $2.81 billion in cash flow from operations. It returned $1.8 billion back to its shareholders in the form of dividends. RIO delivered a solid top-line of $9.68 billion as the company had successfully operated its global mines throughout the pandemic for the production of diamonds. The company has recently approved an investment of close to $200 million for the next stage of development of the lithium-borate Jadar project in Serbia. Moreover, healthy demand of iron from China should continue to propel the price of iron ore over the long term. Higher commodity prices should be reflected in RIO’s EPS. RIO closed yesterday’s trading session at $60.87, gaining 2.5% year-to-date. The stock has grown more than 60% since its March low. How does RIO stack up for the POWR Ratings? A for Trade Grade A for Buy & Hold Grade A for Peer Grade B for Industry Rank A for Overall POWR Rating The stock is also ranked #1 out of 23 stocks in the Industrial-Metals industry. CubeSmart (CUBE) CUBE is a self-administered and self-managed real estate investment trust. The Company’s self-storage properties are designed to offer affordable, easily accessible, and secure storage space for residential and commercial customers. It is one of the top three owners and operators of self-storage properties in the United States. While the four-year average dividend yield for CUBE is 4.04%, the current annual dividend translates into a 4.13% yield. The stock has been consistently paying a dividend each quarter since 2005, and increasing its payout every year. During the past ten years, the average dividends per share growth rate for CUBE was 28.4% per year. The most recent dividend declared by the company was of $0.33 for the last reported quarter. CUBE reported a net operating income of $97.7 million for the second quarter that ended in June 2020. The company delivered $0.41 as funds from operations (FFO) per share. Revenues grew 3% year-over-year to $163.8 million with same-store occupancy averaging to 93% during the quarter. The company added 27 stores to the third-party management platform during the quarter, bringing the total third-party managed store count to 719. CUBE has an impressive earnings surprise history, as it beat consensus FFO estimates in three of the trailing four quarters. The company has recently launched The CubeSmart Mobile App, which enables customers to manage their self-storage experience from wherever they are. In the REIT landscape, self-storage REITs are gaining traction and the market expects CUBE’s FFO to grow 46.3% per year over the next five years. CUBE closed yesterday’s trade at $31.71. The stock hit a 52-week low of $19.61 due to the virus-led crash in March. This implies that it has already recovered more than 48% from its low. CUBE’s strong momentum is reflected in its POWR Ratings, it has a Strong Buy rating with a grade of A in Trade Grade and Peer Grade, and a B in Buy & Hold Grade and Industry Rank. Within the REITs – Industrial industry, it’s ranked #1 out of 21 stocks. Stag Industrial, Inc. (STAG) STAG is a real estate investment trust (REIT) focused on the acquisition, ownership, and operation of single-tenant, industrial properties throughout the United States. The company’s portfolio consists of 457 buildings in 38 states, with approximately 91.8 million in rentable square feet. STAG pays an annual dividend of $1.44, which translates into a dividend yield of 4.46%. The company has been unvaryingly paying a dividend of $0.12 per share every month since January 2020. It paid a fixed amount of $0.119 per share as a monthly dividend in 2019. The last dividend paid by the company was in August 2020. The company has grown its dividend at a CAGR of 2.1% over the last five years. The four-year average dividend yield for the company is 5.76%. STAG generated a cash net operating income of $96.6 million for the second quarter of 2020, an increase of 24.5% compared to the year-ago quarter. The company also produced $69 million in cash available for distribution, an increase of 48.1% year-over-year. The top-line grew 21.7% year-over-year to $118 million, achieving an occupancy rate of 97% on the total portfolio. The company has recently established five new solar rooftop systems in the Bay state that will deliver energy to the local electrical grid. STAG has beaten FFO estimates in three of the trailing four quarters. STAG focuses on relative value investment strategy driven by a robust quantitative process, and thus, has an ability to add additional value at the asset level. The street anticipates FFO to grow 88.6% in the current year. STAG closed yesterday’s trading session at $31.92, which is 6.4% lower than its 52-week high of $34.09. The stock has already gained more than 47% from its March lows. STAG’s POWR Ratings reflect this promising outlook. It has an overall rating of Strong Buy with a grade of A for Trade Grade and Buy & Hold Grade, and a B for Industry Rank. Among the 21 stocks in the REITs – Industrial industry, it’s ranked #3. B&G Foods, Inc. (BGS) BGS manufactures, sells, and distributes a portfolio of shelf-stable and frozen foods, and household products in the United States, Canada, and Puerto Rico. It operates more than 50 brands and distributes its products directly, as well as through supermarket chains. BGS pays an annual dividend of $2.04. While the four-year average dividend yield for the company is 7.37%, the current annual dividend translates into a 6.33% yield. The company has been consistently paying a fixed amount dividend ($0.475) every quarter since 2018. It was paying a fixed dividend of $0.465 prior to this period. Over the last five years, the average dividend per share growth for BGS was 6.92% per year. Free cash flow for the last reported quarter came in at $185 million, compared to the year-ago negative cash flow of $43 million. The company generated $189 million in cash flow from operations. It returned $30.5 million back to its shareholders during the quarter in the form of dividend. Quarterly revenues grew 38% year-over-year to $512.5 million, primarily due to an increased demand for frozen food during the pandemic. The company’s sales also benefited from the “Clabber Girl” and “Farmwise” acquisitions completed earlier this year. The EPS for the quarter came in at $0.71, increasing 150% year-over-year, and beating the consensus estimate by 16.4%. The company is working closely with its supply chain partners to turn this pandemic-related increase in demand into a long-term growth opportunity. The market expects EPS to grow 33.5% in the current year. BGS closed yesterday’s trading session at $28.11, gaining more than 56% year-to-date. The stock has recently hit an all-time high of $31.93 and is up more than 68% in the last six months. It’s no surprise that BGS is rated a Buy in our POWR Ratings system. It also has a grade of A for Trade Grade, and a B for Buy & Hold Grade, Peer Grade, and Industry Rank. It is ranked #18 out of 57 stocks in the Food Makers industry. Want More Great Investing Ideas? 7 Best ETFs for the NEXT Bull Market Will Stocks Fall into Historical September Slump? 9 “BUY THE DIP” Growth Stocks for 2020 RIO shares were trading at $62.08 per share on Wednesday afternoon, up $1.21 (+1.99%). Year-to-date, RIO has gained 12.42%, versus a 7.07% rise in the benchmark S&P 500 index during the same period."}]}