{"article": [{"url": "https://stocknews.com/news/aapl-hear-mwk-vuzi-4-outperforming-consumer-electronic-stocks/", "published": 1597320500.0, "headline": "4 Outperforming Consumer Electronic Stocks", "body": "The coronavirus outbreak has significantly impacted the day-to-day operations of almost all businesses and caused a major change in consumer behavior. Demand for most consumer discretionary products, except essential technology and consumer electronics goods, declined. In fact, the demand for technology and consumer electronics products increased during this period as people tried to comply with the social distancing rules. Despite the major global indices seeing unprecedented lows earlier this year, stocks in the technology and electronics industries took off as work and education went remote. As a result, the tech-heavy Nasdaq Composite has been on a bull run since the March bottom. The index closed above 11,000 for the first time in history on August 5th. Apple Inc. (AAPL), Turtle Beach Corporation (HEAR), Mohawk Group Holdings, Inc. (MWK), and Vuzix Corporation (VUZI) have all gained momentum since their March lows and have been outperforming their peers. Strong fundamentals and revenue should help further capitalize on the ongoing crisis. 7 Best ETFs for the NEXT Bull MarketApple Inc. (AAPL) Apart from designing and manufacturing communication and media devices, AAPL also deals in software, services, accessories, networking solutions, and digital content and applications. The stock is presently trading at $452.04, increasing more than 38% in the last six months. The year-to-date gain for AAPL is 54% compared to the 22.7% and 4.6% gains for the Nasdaq Composite and the S&P 500 index, respectively. The most recent launch of the reasonably priced iPhone SE has proved to be a huge success for the company. AAPL recently announced results for its fiscal year third quarter that ended in June. The company posted revenue of $59.7 billion, an increase of 11% from the year-ago quarter. AAPL also generated a free cash flow of $14.7 billion in its last reported quarter, registering a 53% growth from the same quarter last year. AAPL generated $26 billion in phone sales in the second quarter alone. The pandemic also acted as a catalyst to drive up sales of MacBook and iPad. International sales were more than 54% of total revenue. Paid subscriptions went up to $550 million, an increase of $130 million versus the year-ago quarter. The company also reported an earnings surprise of 26.5% in the last quarter, with an EPS of $2.58. The EPS is further expected to grow 19.5% next year while revenue for the current quarter is estimated to be $64 billion. How does AAPL stack up for the POWR Ratings? A for Trade Grade A for Buy & Hold Grade A for Peer Grade A for Industry Rank A for Overall POWR Rating. You can’t ask for better. It is also ranked #1 out of 28 stocks in the Technology – Hardware industry. Turtle Beach Corporation (HEAR) HEAR operates as an audio technology company. It develops, commercializes, and markets gaming headset solutions for various platforms, including video game and entertainment consoles, handheld consoles, personal computers, and mobile and tablet devices. It serves retailers, distributors, and other customers in North America, South America, Europe, the Middle East, Africa, Australia, and Asia. The stock is presently trading at $16.49, implying a 306% premium to its March low of $4.06. The stock is up 74.5& year-to-date. HEAR has been recently included in the broad-market Russell 3000 Index, reflecting its strong fundamentals and growth prospects. HEAR reported an impressive second quarter. Revenue for the quarter stood at $80 million, an increase of 93% year-over-year. Gross margins improved by 4.8% to 36.7%, while net income for the quarter improved to $8.2 million from a net loss of $2.4 million in the year-ago quarter. Cash generated from operating activities stood at $14.3 million compared to cash used from operating activities of $2.8 million in the year-ago quarter. Free cash flow for the company stood at $12.9 million at the end of the quarter. HEAR has an impressive earnings surprise history with the company beating consensus EPS estimates in each of the trailing four quarters. EPS for the last quarter was reported as $0.42, beating the consensus estimate by 13.5%. Furthermore, EPS for the next quarter is estimated to be $0.46, and revenue is expected to be $102.7 million. HEAR’s POWR Ratings reflect this promising outlook. It has an overall rating of Buy with a grade of A for Trade Grade and a grade of B for Peer Grade and Industry Rank. Among the 36 stocks in the Technology – Electronics industry, it’s ranked #10. Mohawk Group Holdings, Inc. (MWK) MWK is a technology-enabled consumer products company that primarily serves consumers over e-commerce platforms. The company’s product categories include home and kitchen appliances, kitchenware, environmental appliances, beauty related products and consumer electronics. MWK operates its consumer electronics segment under the brand RIF6. The stock got listed last year and is currently trading at $7.34. MWK hit its 52-week low of $1.42 on March 23rd and has recovered more than 416% since then. MWK is up 24.6% year-to-date. The company had an exceptional second quarter, as revenue increased 97% year-over-year to $60 million. Gross margin improved to 46.2% versus 38.7% in the second quarter last year. Furthermore, the company launched 8 new products in the quarter. Free cash flow for the firm stood at $8.17 million, translating to free a cash flow margin of 13.7%. MWK reported an EPS of -$0.19 for the second quarter, beating the street estimates by 61.2%. MWK is rated a Buy in our POWR Ratings system, consistent with its growth estimates. It has a grade of A for Industry Rank and a grade of B for Trade Grade. It is ranked #18 in the 34-stock Consumer Goods industry. Vuzix Corporation (VUZI) VUZI designs, manufactures, markets, and sells augmented reality (AR) wearable display devices in the United States and internationally. The company offers its products in the form of smart glasses and AR glasses. The company is now developing a binocular AR smart glasses product that provides the user a live, direct, or indirect view of a real-world environment. It holds 150 patents and patents pending and numerous IP licenses in the Video Eyewear field. The stock is currently trading at $3.46, a 30% discount from its 52-week high of $4.93. With a year-to-date gain of more than 72%, VUZI has outperformed the Nasdaq Composite and the S&P 500. VUZI has recently announced its association with Microsoft Corporation and MobileIron to provide support of mobile device management applications Microsoft Intune and MobileIron Core and MobileIron Cloud for use with its Vuzix M400 Smart Glasses product. VUZI had an excellent second quarter. Revenue grew 39% over the comparable year-ago period as the business continued to expand at an accelerated pace. The company delivered a record $2.3 million of Vuzix smart glasses in the quarter, an increase of 183% year-over-year. Despite reporting a negative EPS of $0.13, the company reported a positive earnings surprise of 13.3%. The street expects EPS to grow by 28% in the current quarter and 29% in the current year. According to the POWR Ratings, VUZI has a grade of B for Trade Grade and Industry Rank. It’s ranked #11 out of 36 Technology – Electronics stocks. Want More Great Investing Ideas? 3 Possible Directions for the Stock Market from Here How to Trade THIS Stock Bubble? 9 “BUY THE DIP” Growth Stocks for 2020 AAPL shares . Year-to-date, AAPL has gained 57.74%, versus a 5.73% rise in the benchmark S&P 500 index during the same period."}]}