{"article": [{"url": "https://stocknews.com/news/wab-chart-of-the-day-westinghouse-air-brake-technologies-wab/", "published": 1597752500.0, "headline": "Chart of the Day: Westinghouse Air Brake Technologies (WAB)", "body": "A cup and handle pattern has formed in the chart of Westinghouse Air Brake Technologies (WAB). Westinghouse Air Brake Technologies (WAB) is a provider of value-added, technology-based products and services for the rail industry. It provides its products and services through two main business segments, the Freight and Transit. The company’s merger with GE transportation is one component driving revenue. The merger increased WAB’s freight services capabilities and capacity. Take a look at the 1-year chart of WAB below with added notations: 7 Best ETFs for the NEXT Bull Market Chart of WAB provided by TradingView After selling off from February into March, WAB rallied back up to hit a high of $72.50 in June and then sold off again. Since bottoming around $55, the stock has rallied back up to the $72.50 resistance (red) and now appears to have formed a cup (green) and handle pattern. A cup and handle is a bullish continuation pattern that marks a consolidation period followed by a breakout. As its name implies, there are two parts to the pattern: the cup and the handle. The cup forms after an advance and looks like a bowl or “rounding bottom”. As the cup is completed, a trading range develops on the right hand side and the handle is formed. A subsequent breakout from the handle’s trading range, and through the resistance created by the cup, usually signals a continuation of the prior advance. Therefore, a trader could buy WAB if/when the $72.50 resistance level is broken, in anticipation of a breakout. Want to Discover More Great Trades? I have explored virtually every flavor of technical analysis and chart pattern known to mankind. The sad fact is that the vast majority of them don’t work at all. That is why I recently put together this presentation to help investors focus on the only 5 chart patterns that matter…the ones that lead to the most timely and profitable stock trades. Click below to learn these patterns and how to quickly find the 5 to 7 best trades today. 5 WINNING Stock Chart Patterns Have a good trading day! Good luck! Christian Tharp, CMT @cmtstockcoach WAB shares were trading at $68.28 per share on Tuesday morning, down $0.16 (-0.23%). Year-to-date, WAB has declined -11.76%, versus a 6.26% rise in the benchmark S&P 500 index during the same period."}]}