{"article": [{"url": "https://stocknews.com/news/nke-pton-fit-3-fitness-stocks-to-buy-for-2021/", "published": 1601294900.0, "headline": "3 Fitness Stocks to Buy for \"2021\"", "body": "The fitness industry, though shaken up due to the pandemic and consequent social distancing measures, has revealed immense potential to make a strong comeback late this year, or by next year. Deserted gyms are witnessing increased foot traffic, while organized sports industries across the world are rescheduling all postponed and/or cancelled matches. The worldwide fitness industry is expected to witness a year-over-year revenue increase of 30.9% to 22.5 billion in 2020. Among others, live interactive virtual workouts are gaining in popularity amid the COVID crisis, as people turn to exercising at home to avoid exposure to the deadly virus. A drive to remain fit and healthy has also enhanced the interest to build a stronger immunity to battle the virus. Popularity of fitness wearables and apparel have also increased substantially over the past couple of months. Wearables is the largest segment of the fitness industry and could see a market volume of as high as $19 billion this year. The industry has undertaken several measures to become accustomed to the new normal. Companies such as Nike, Inc. (NKE), Peloton Interactive, Inc. (PTON), and Fitbit, Inc. (FIT) have already made impressive recoveries since the market crash in March, as they adapted to social distancing norms by focusing more on online sales channels. Given the industry’s continued recovery, these stocks are well positioned to soar higher in the near future. 7 \"SAFE HAVEN\" Dividend Stocks for Turbulent TimesNike, Inc. (NKE) NKE is the biggest and most valuable sports apparel manufacturer in the world, with a 25.1% global market share in the April-June quarter. It had a brand value of over $32 billion, as of 2019. The company’s sound business model and financial strength helped the stock gain more than 115% since its March low. The stock hit its 52-week high of $130.38 in September after hitting its 52-week low of $60 in March. On July 22nd, NKE announced several leadership changes to make the brand digitally empowered and support its Consumer Direct Acceleration (CDA) strategy. With digital sales becoming immensely popular in the current economic scenario, this move can help NKE branch out to untapped markets. NKE’s robust recovery is a result of its accelerating brand momentum and digital sales since the beginning of the pandemic, which was reflected in its fiscal first quarter that ended in August 2020. Its direct sales improved 12% year-over-year to $10.60 billion, and brand digital sales increased 82% from the same period last year. EPS increased 10% from the year-ago value to $0.95. The consensus revenue estimate of $10.55 billion for the fiscal second quarter indicates a slight improvement from the year-ago value. NKE’s EPS is expected to grow at a rate of 25.1% per annum over the next five years. How does NKE stack up for the POWR Ratings? A for Trade Grade A for Buy & Hold Grade A for Peer Grade B for Industry Rank A for Overall POWR Rating. It is also ranked #1 out of 33 stocks in the Athletics & Recreation industry. Peloton Interactive, Inc. (PTON) PTON is an interactive fitness platform providing technology-based fitness products, and subscription-based streaming classes. PTON operates through three main categories – connected fitness product segment, subscription segment, and others. With 1.4 million subscribers, it is known for its on-demand live classes and PTON Digital app for connected access. PTON introduced a new product suite with Bike+ and treadmills on September 8th. Priced lower than the average market price, this product offers an effective at-home fitness experience to individuals worldwide. PTON’s subscription services have gained popularity amid the pandemic, as the lockdown has forced people to exercise at their homes. For the fiscal fourth quarter that ended in August 2020, PTON’s ending connected fitness subscriptions grew 113% year-over-year to over $1.09 million, while digital subscriptions grew 210% from the year-ago value to over 316,800. Connected fitness subscription workouts increased 333% year-over-year to 76.8 million. Total revenue increased 172% year-over-year to $607.10 million, while gross profit rose 188% from the same period last year to $288.80 million. PTON generated $89.10 million in net income this quarter, indicating a significant improvement over the net loss of $47.40 million reported during the same period last year. PTON expects revenues for the fiscal first quarter ending November 2020 to be in the range of $720 to $730 million, with 218% growth at midpoint. The consensus EPS estimate of $0.11 for the ongoing quarter indicates a significant improvement from the negative year-ago values. PTON has gained more than 460% since hitting its 52-week low of $17.70 in March. The stock hit its 52-week high of $100.44 in September. PTON’s strong fundamentals are reflected in its POWR Ratings. It is rated “Strong Buy”, with a grade of “A” in Trade Grade, Buy & Hold Grade, Peer Grade and Industry Rank. In the 34-stock Consumer Goods industry, PTON is ranked #7. Fitbit, Inc. (FIT) FIT is a leading manufacturer of tech-based fitness accessories across the globe. Its unique software and services blending with its fitness devices, allows users to view personalized insights and virtual interactive workouts. FIT entered into an acquisition agreement with Google, Inc. (GOOGL) in late 2019. The deal is expected to close this year, pending regulatory approvals. It recently partnered with Scripps Research Institute and Stanford Medicine to evaluate the ability of fitness wearables to detect, track, and contain infectious diseases such as coronavirus. FIT’s paid membership service Fitbit Premium garnered 500,000 users within its first year of launch. On June 3rd, FIT rolled out an easy to use ventilator called Fitbit Flow for coronavirus emergency, after obtaining Emergency Use Authorization (EUA) from the FDA. It also received FDA clearance on September 14th for its ECG app to assess heart rhythm for atrial fibrillation. On August 25th, FIT launched the most advanced health smartwatch — Fitbit Sense, with the world’s first electrodermal sensor, advanced heart tracking technology and ECG app. This allowed the company to reach a paid-subscriber base exceeding 500,000 in less than a year. However, FIT reported a slowdown in business volume in the second quarter that ended in July 2020, as a result of the pandemic. Though the quarterly reports indicated a year-over-year decline in revenue, FIT’s no-device revenue grew 195% year-over-year. Its non-GAAP gross margin improved 200 basis points to 37.6%. Consumer demand for Fitbit devices remained strong, as POS increased 12% year-over-year. FIT’s EPS is expected to grow 22.5% per year over the next five years. The stock has gained more than 10% since hitting its year-to-date low of $5.85 in March. FIT is rated a “Buy” in our POWR Ratings system, with a grade of “B” in Buy & Hold Grade, Peer Grade, and Industry Rank. In the 33-stock Athletics & Recreation Industry, it is ranked #19. Want More Great Investing Ideas? 7 “Safe-Haven” Dividend Stocks for Turbulent Times When Does the Next Bull Run Start? Chart of the Day- See the Stocks Ready to Breakout NKE shares were trading at $124.32 per share on Monday afternoon, up $0.09 (+0.07%). Year-to-date, NKE has gained 23.63%, versus a 5.32% rise in the benchmark S&P 500 index during the same period."}]}