{"article": [{"url": "https://stocknews.com/news/aapl-tsla-stock-news-stock-splits-are-back-a-scary-sign-considering/", "published": 1598962100.0, "headline": "Another SCARY SIGN That We're In a Bubble", "body": "Apple is the world’s most valuable company and Tesla has been a bullish beast AAPL and TSLA announce stock splits, splits do not impact valuation or do they? Attracting retail investors- Signs of a top? 7 Best ETFs for the NEXT Bull MarketA stock split should theoretically have no impact on a company’s market valuation. Cutting the price of a stock in half, a quarter, or any other split merely increases the number of shares but does not change the overall business’s value. Theory and practice often present different results. The availability of a stock at a lower price can increase retail interest in the company for a wide audience of investors. Two of the leading stocks since the March lows have been Apple (AAPL) and Tesla (TSLA). Both recently announced stock splits. AAPL shares hit a low of $212.61 on March 23. It was trading at just below $500 per share as of August 28, a rise of almost 135%. TSLA, the EV pioneer, reached a bottom of $350.51 on March 18. At over $2213 per share at the end of last week, TSLA has rallied by over six times the price under six months ago. Time will tell if the stock splits in AAPL and TSLA will keep the bullish train on its tracks over the coming months. Some analysts may increase their lofty targets on the stocks in anticipation of a rush of retail buying. While both companies have seen incredible appreciation on the back of earnings and bullish sentiment, the stock splits are an event that could create what becomes at least temporary tops in the two technology companies that lead the world in their businesses. In 1999, Herb Greenberg wrote a piece in Fortune entitled, “Don’t Be Fooled by Stock-Split Mania.” In that article, Greenberg wrote that a stock-split is a mirage, quoting a Wall Street analyst who said that they are a “retail phenomenon.” The stock split mania in 1999 led to a significant correction in the tech-heavy NASDAQ index the turn of the century. Source: Barchart As the chart shows, the NASDAQ rose to an all-time peak of 5,132.52 in March 2000. By late 2002, it fell to a low of 1,108.49, a 78.4% correction. It took thirteen years for the index to return to the March 2000 high. Since then, it has more than doubled in value. AAPL and TSLA are splitting their stocks because of the incredible price rise over the recent months. Time will tell if the decision is a harbinger of another substantial correction in the technology sector and the overall stock market. Apple is the world’s most valuable company Apple Inc. (AAPL) was the first company to surpass the $2 trillion market cap level, and so far, remains the only member of the exclusive club. As of Friday, August 28, at the $499.23 per share level, AAPL’s market cap was at a cool $2.135 trillion. When Steve Jobs passed away in October 2011, AAPL shares were between $50 and $60 per share. Many market participants wondered if Tim Cook had the skills and vision to continue the company’s growth trajectory. Source: Barchart As the chart shows, AAPL shares’ performance shows that Tim Cook did a job that would have made Steve Jobs proud. On August 28, the shares were around ten times higher than the level in October 2011. Tesla has been a bullish beast Steve Jobs was one of the most innovative operators of his time. While Tim Cook has done yeoman’s work carrying on Jobs’ legacy, the leading innovator these days is Elon Musk. Mr. Cook is a top-notch CEO and steward of Apple’s franchise, but it is Mr. Musk, the engineer and inventor, who embodies Steve Job’s quirkiness and genius. Elon Musk’s flagship company is Tesla (TSLA), the electric vehicle design and manufacturing company. TSLA is his publicly traded company, but he has two other companies that are not available to mere mortal investors. Space X is leading the way in launches and space exploration. Mr. Musk has pledged to put a human on Mars. The Boring Company builds tunnels to alleviate traffic jams and revolutionize travel in the US and around the world. While AAPL has appreciated around ten times since 2011, TSLA has achieved the feat in a little over one year. Source: Barchart The chart shows that TSLA shares were trading at over $2200 at the end of last week. In June 2019, they were below the $220 level. TSLA’s market cap was over $412.49 billion as the car manufacturer was worth more than its US and foreign peers. The ascent of AAPL and TSLA and high levels of their stocks caused the companies to decide to declare a stock split. AAPL and TSLA announce stock splits Apple and Tesla’s shares have risen to lofty levels. On July 30, AAPL announced a four for one split of Apple common stock on August 31. Tesla said they would split their shares five for one for shareholders of record on August 21. The split will also take effect on August 31. Since the announcements, both AAPL and TSLA shares experienced explosive gains. Source: Barchart The chart shows that AAPL shares moved from $425.04 at the end of July to the most recent high of $515.14 on August 24, a gain of 21.2% in under one month. Source: Barchart TSLA rose from $1430.76 on July 31 to its most recent peak of $2318.49 on August 28 or 62%. While the incredibly bullish price action in both shares over the past month reflect investors’ appetites for the technology companies, the prospects for a stock split likely added a psychologically bullish tone to the shares. Splits do not impact valuation- Or do they? Stock splits at AAPL and TSLA alone have no impact on the businesses of the two companies. Sales, earnings, and product innovation will be the guiding force for the two stocks. However, a stock split at both companies that brings AAPL shares down to the $125 level and TSLA down to $440 based on the prices at the end of last week could create a short-term buying wave by those market participants that look at the nominal prices of the shares. At the same time, professional traders that believe the stock splits will have a bullish impact on the stocks are likely to jump on board as the trajectory of gains continues. The trend is always a trader or investor’s best friend, and the path of least resistance of the two stocks remains higher. Attracting retail investors- Signs of a top? Some retail investors are buying AAPL and TSLA because of the stock splits. The prospects for owning four and five times the number of shares on August 31 is reason enough for some market participants. AAPL and TSLA have been cult stocks for years, and both companies have rewarded their shareholders handsomely. In 1999, the stock split mania led to a brutal correction in the NASDAQ. Other companies are likely to follow Apple and Tesla over the coming weeks as their splits have driven the share prices significantly higher. A rise of over 20% for Apple and over 60% for Tesla shares in one month set a tempting example for other companies. Management’s primary job is to increase shareholder value through a higher stock market. Earnings and the economy are typically the building blocks for profits, but a stock split can have a bullish impact in the current environment. The trend is your friend until it bends. The lofty valuations in the stock market and a wave of stock splits could be another sign that a significant correction will come sooner rather than later. Want More Great Investing Ideas? 7 Best ETFs for the NEXT Bull Market Beware Stocks in September? 9 “BUY THE DIP” Growth Stocks for 2020 AAPL shares were trading at $132.46 per share on Tuesday morning, up $3.42 (+2.65%). Year-to-date, AAPL has gained 81.68%, versus a 10.20% rise in the benchmark S&P 500 index during the same period."}]}