{"article": [{"url": "https://stocknews.com/news/adbe-fdx-len-mlhr-4-stocks-topping-earnings-estimates/", "published": 1600776500.0, "headline": "4 Stocks TOPPING Earnings Estimates", "body": "A majority of US companies beat consensus earnings expectations in the last reported quarter. Out of the S&P 500 members, about 83% beat consensus ESP estimates in the second quarter, while only a handful of sectors actually benefited from the digital transformation and record-low interest rate environment. Despite economic challenges, a business model suited to the pandemic has enabled some companies to deliver robust financial performance, beating all expectations. Consensus estimates are important in gauging a company’s future earnings potential. And this is typically an important determinant of a stock’s price movement. The street had anticipated some companies to report strong earnings results due to rapid growth in demand for their products and services amid the pandemic, yet many of these companies performed so well that they beat the optimistic estimates as well. Adobe Inc. (ADBE), FedEx Corporation (FDX), Lennar Corporation (LEN) and Herman Miller, Inc. (MLHR) comfortably beat market’s expectations with record high earnings in the last reported quarter. These stocks have already gained huge momentum and should continue to move higher. 7 \"SAFE HAVEN\" Dividend Stocks for Turbulent TimesAdobe Inc. (ADBE) ADBE is one of the largest global software companies that offers content creation, document management, and digital marketing and advertising software and services to creative professionals and marketers. The company operates in three segments – digital media, digital experience, and publishing for legacy products. For the fiscal third quarter that ended in August 2020, ADBE reported EPS of $2.57, growing 25% year-over-year and beating the street estimate by 6.6%. It had also reported an earnings surprise of 5.2% in the preceding quarter. Moreover, the company has beaten the consensus EPS estimates in each of the trailing four quarters. The consensus EPS estimate of $2.66 for the current quarter indicates a 16.2% year-over-year increase. The top-line for the quarter grew 14% year-over-year to $3.23 billion primarily due to increasing global demand for the company’s innovative solutions. Digital media segment revenue came in at $2.34 billion, representing a 19% year-over-year increase. ADBE generated $1.44 billion in cash flow from operations. Net profit for the quarter came in $955 million, improving 20% year-over-year. Moreover, the company repurchased 1.5 million shares during the quarter. ADBE recently announced that it has been recognized as a leader in Mobile Engagement Automation. Moreover, the company had announced a strategic partnership with International Business Machines Corporation (IBM) and Red Hat, Inc. (RHT) in July, to help accelerate digital transformation and strengthen real-time data security for enterprises. ADBE closed yesterday’s trading session at $475.64, gaining 44.2% year-to-date. The stock is up more than 47% over the past six months. How does ADBE stack up for the POWR Ratings? B for Trade Grade B for Buy & Hold Grade B for Peer Grade B for Industry Rank B for Overall POWR Rating. It is ranked #12 out of 94 stocks in the Software – Application industry. FedEx Corporation (FDX) FDX provides customers and businesses with a broad portfolio of transportation, e-commerce, and business services. Its network reaches more than 220 countries worldwide. The company operates primarily through five segments – Express, Ground, Freight, Services, and Other. The company reported an EPS of $4.72 for its fiscal first-quarter that ended in August 2020, increasing 66.2% year-over-year. This represents an earnings surprise of 75.4%. Furthermore, it beat the consensus estimate by 66.4% in the preceding quarter. The street expects EPS to grow 71.2% year-over-year in the current quarter to $7.24. Revenues for the quarter increased 13% year-over-year to $19.3 billion. Operating results increased due to volume growth in FedEx International Priority and U.S. domestic residential package services. The FedEx Ground segment revenue grew 36% year-over-year to $7 billion. Net income increased to $1.2 billion in the quarter, implying a year-over-year growth of 67%. Average daily package volume for FedEx Ground, which handles e-commerce deliveries for retailers like Walmart (WMT), jumped 31% to 11.6 million during the quarter due to the pandemic-fueled surge in e-commerce shipments. Moreover, FDX formed a multi-year collaboration with Microsoft (MSFT) in May to help transform commerce by combining the global digital and logistics network of FDX with the power of MSFT’s intelligent cloud. FDX closed yesterday’s trading session at $238.74, gaining nearly 60% year-to-date. It has added close to 91.5% to its stock price over the last six months. FDX’s POWR Ratings reflect this promising outlook. It has an overall rating of “Strong Buy” with a grade of “A” for Trade Grade, Peer Grade, Buy & Hold Grade, and Industry Rank. Among the 9 stocks in the Air Freight & Shipping Services industry, it’s ranked #2. Lennar Corporation (LEN) LEN engages in the homebuilding activities in the United States. The company’s homebuilding operations include the construction and sale of homes and residential lands. It operates through Homebuilding East, Homebuilding Central, Homebuilding West, Homebuilding Southeast Florida, Homebuilding Houston, Financial Services, Rialto, and Lennar Multifamily segments. LEN reported an EPS of $2.12 for its fiscal third quarter that ended in August 2020, implying an increase of 33% year-over-year and an earnings surprise of 36.8%. LEN had also beaten the street estimate by 40% in the previous quarter. Moreover, the company consistently delivered earnings surprises in the trailing four quarters. The street expects current year EPS to grow 28.6% from the year-ago value to $7.38. LEN’s top-line of $5.9 billion remained consistent with the year-ago quarter. Revenues from home sales increased 3% in the quarter to $5.5 billion. The quarterly results benefited from robust market conditions. Fundamentals in the housing market continued to remain strong, supported by record low mortgage rates and a continued undersupply of new and existing inventory. The company delivered 13,842 homes during the quarter, implying a 2% increase year-over-year. New orders of 15,564 homes were up 16% while new orders’ dollar value of $6.3 billion grew 20% year-over-year. Net income for the quarter came in at $0.6 million, improving 30% compared to the year-ago quarter. The stock closed yesterday’s trade at $76.75, 4% below its all-time high of $80.00. Moreover, it has gained more than 38% year-to-date. It’s no surprise that LEN is rated a “Strong Buy” in our POWR Ratings system, with a grade of “A” in Trade Grade and Buy & Hold Grade, and a “B” in Peer Grade and Industry Rank. It is also ranked #2 out of 21 stocks in the Homebuilders industry. Herman Miller, Inc. (MLHR) MLHR designs, manufactures, and distributes office furniture systems, seating products, other freestanding furniture elements, textiles, and related services in the United States and internationally. MLHR has recently reported its financial results for its fiscal first quarter that ended in August 2020. EPS for the quarter came in at $1.24, beating the street estimate by 377%. This also implies a year-over-year growth of 47.6%. The company had also beaten the consensus estimate by 210% in the preceding quarter. Moreover, the company consistently delivered earnings surprises in the trailing four quarters. The consensus EPS estimate for the succeeding year stands at $2.84, indicating a year-over-year increase of 12.3%. Manufacturing and project scheduling were disrupted due to the pandemic and its top-line declined 6.6% year-over-year to $627 million. However, the robust gross margin of 39.9% reflects an increase of 3.2% year-over-year. In line with the strong liquidity position, MLHR has resumed its quarterly dividend program during the quarter. Moreover, net income increased 51.5% year-over-year to $73 million. The Retail business segment led the way last quarter, as orders were up 40% year-over-year. Demand was led by the Home Office category due to the remote working trend. Consumers are investing in their broader home environments, which led to positive year-over-year demand growth across multiple product categories, notably upholstery, outdoor, and accessories. MLHR closed yesterday’s trading session at $31.77 and has gained more than 31% over the past three months. The stock has gained more than 109% since its March low. In the POWR Ratings, the company has been accorded a grade of “A” for Industry Rank. In the 68 stock Home Improvement & Goods industry, it is ranked #42. Want More Great Investing Ideas? 7 Best ETFs for the NEXT Bull Market Stock Market Outlook: Before & After the Election Chart of the Day- See the Stocks Ready to Breakout ADBE shares were trading at $476.10 per share on Tuesday afternoon, up $0.46 (+0.10%). Year-to-date, ADBE has gained 44.36%, versus a 2.82% rise in the benchmark S&P 500 index during the same period."}]}