{"article": [{"url": "https://stocknews.com/news/ung-d-buffet-bets-10-billion-on-natural-gas/", "published": 1596542900.0, "headline": "Buffet Bets $10 Billion On Natural Gas", "body": "The purchase of Dominion’s gas assets was the first move in a while The political aspects of the purchase A purchase in the forlorn energy sector- Buffett goes for the cleaner fossil fuel During past financial meltdowns, the Oracle of Omaha, Warren Buffett, appeared on the scene to scoop up bargains in the stock market. His typical investment transaction was purchasing a convertible preferred that paid him a handsome dividend with the right to buy shares at attractive levels. The most recent risk-off period on the back of the global pandemic was a departure from the norm for Mr. Buffet. Initially, the only news was that he sold a portfolio of airline stocks. The first news of a significant purchase from Omaha came in July as Warren Buffet decided to dip a $10 billion toe into the natural gas arena. The investment comes at a time when the Presidential election will determine the futures of oil and gas in November. Natural gas recently traded to its lowest price in a quarter-of-a-century, so Mr. Buffett is getting in cheap. Meanwhile, there is no guaranty that what is inexpensive today will not become even cheaper in 2021 if US energy policy experiences a dramatic shift. The Purchase of Dominion’s Gas Assets was the First Move in a While 7 \"SAFE HAVEN\" Dividend Stocks for Turbulent TimesWarren Buffett had been absent from the market since the global pandemic hit in February and March. In the past, Buffett stepped up and made substantial investments during periods of financial carnage. His formula of a massive investment in exchange for a convertible preferred stock position with a juicy dividend made him and Berkshire billions. The spread of the coronavirus silenced Buffett for months. He emerged in July when he purchased the natural gas transmission and storage assets of Dominion Energy (D) for $4 billion. Including debt, the deal totaled a $10 billion investment. Berkshire will now own 18% of all interstate natural gas transmission in the United States, up from its previous holdings of 8%. Dominion sold its Atlantic Coast Pipeline and transmission assets. The company remains an energy producer. Buffett has given natural gas a vote of confidence with the purchase at a time when the price is languishing below $2 per MMBtu and after hitting a quarter-of-century low at $1.432 in late June. Warren bought natural gas cheap, but time will tell if the investment pans out. The Political Aspects of the Purchase Natural gas is a cleaner fuel than crude oil, but it is still a fossil fuel. Extracting natural gas from the earth’s crust via fracking has reduced the energy commodity’s production cost over the past years. Massive discoveries of the energy commodity in the Marcellus and Utica shale regions has made the US the world’s leader in output. At the same time, liquefying natural gas for export expanded the demand side of the fundamental equation. The Trump administration has supported oil and gas production in the United States with regulatory reforms. The November election will, among many other issues, be a referendum on the future of US energy policy. The Democrat’s progressive wing supports the “Green New Deal” that includes bans on fracking for oil and gas in certain parts of the US. At the same time, the global pandemic has weighed on the price of natural gas and sent it to the lowest level of this century. The November election will shape the future of natural gas production and consumption in the United States. Warren Buffett made a $10 billion wager that natural gas will be an ongoing energy business over the coming years. A Purchase in the Forlorn Energy Sector- Buffett Goes for the Cleaner Fossil Fuel Warren Buffet made a long-term $10 billion wager on natural gas at the lowest price in almost twenty-five years. Source: CQG As the quarterly chart highlights, the energy commodity has traded from a low of $1.02 to a high of $15.65 per MMBtu since 1990. At below the $1.85 level at the end of last week, the price is not far off its all-time bottom. Price momentum and relative strength indicators point to an oversold market. Quarterly historical price variance at just over 20% is closer to the low than the high for the volatile energy commodity. While politics over the coming months could determine the future of US production, Warren Buffett took a position in natural gas at a very reasonable level. Risk-reward favors the upside for the Oracle of Omaha. Want More Great Investing Ideas? 9 “BUY THE DIP” Growth Stocks for 2020 How HIGH Can This Tech Bubble Fly? 7 “Safe-Haven” Dividend Stocks for Turbulent Times UNG shares fell $0.16 (-1.33%) in premarket trading Tuesday. Year-to-date, UNG has declined -28.17%, versus a 2.78% rise in the benchmark S&P 500 index during the same period."}]}