{"article": [{"url": "https://stocknews.com/news/sq-v-gdot-ma-clgx-5-financial-services-stocks-to-invest-in-now/", "published": 1595506100.0, "headline": "5 Financial Services Stocks to Invest in NOW", "body": "The Financial services sector encomposses a wide range of companies from insurance providers, to banks, to mortgage lenders. Many financial stocks are struggling due to the economy being weak, interest rates remaining low, and the pandemic clouding the economic outlook. However certain companies that are using technology to innovate, create value, and deliver solutions for their customers are thriving. Some well-known examples include digital payment processing, cashless transfers, cryptocurrencies, online mortgages, and banking services delivered online. These areas are going to keep growing in the coming years regardless of economic conditions. 7 \"SAFE HAVEN\" Dividend Stocks for Turbulent TimesHere are five financial services stocks that are innovating and should continue to gain market share in the future: Visa Inc. (V) Visa is continually investing in maintaining its position as the world’s largest payment processor. It recently launched a digital tool named Advanced Identity Score which will help financial institutions fight against new accounts and synthetic fraud. This move could help V guard against almost $10 billion in losses and will also benefit consumers. V has launched the Visa Small Business Hub which is a platform that provides a range of services for smaller companies across twenty nations. This could further cement Visa’s position as a market leader and help it compete with companies like Square (SQ), Paypal (PYPL), and Stripe. V is scheduled to announce its fiscal third-quarter 2020 results on July 28. While the consensus EPS and revenue estimates for the quarter indicate a year-over-year decline, V has a history of delivering earnings surprises. The company has beat consensus EPS estimates in three of the trailing four quarters. V’s recent price performance reflects its ability to capitalize on the recent digitization of payments. The stock has gained around 45% since hitting a year-to-date low in mid-March. How does V stack up for the POWR Ratings? A for Trade Grade A for Buy & Hold Grade A for Industry Rank A for Peer Grade A for Overall POWR Rating You can’t ask for better. The stock is also ranked #1 out of 45 stocks in the Consumer – Financial Services industry. Mastercard, Inc. (MA) MA is also looking to expand its operation in the cryptocurrency space by partnering with Wirex to help the company process cryptocurrency payments through its network. This foray into cryptocurrency could help Mastercard capitalize on a new trend and create a new channel fro growth. The company is expected to release its quarterly earnings report later this month. While the consensus EPS and revenue estimates indicate a year-over-year decline, the earnings surprise history for MA looks pretty good with the company beating the consensus EPS estimates in each of the trailing four quarters. MA has also been performing pretty well in the “new normal,” and it has added close to 48.2% to its stock price since this year’s low of $199.9 hit on March 23rd due to the virus-driven market crash. It’s no surprise that MA is rated “Buy” in our POWR Ratings system. It also has an “A” for Trade Grade and Industry Rank and “B” for Buy & Hold Grade and Peer Grade. In the 45-stock Consumer Financial Services industry, it is ranked #8. Square (SQ) SQ is a payment processing solutions provider that has been gaining a lot of attention for its Cash App. The Cash App is a peer-to-peer platform that allows users to transfer money to each other and also invest in cryptocurrencies. The company’s revenue from the Cash App is expected to increase three times by 2025. The company is scheduled to announce its second-quarter results on August 5th. In the quarter ended March 31st, SQ reported a rise in revenue of around 43% compared to the same period last year. Though SQ missed the consensus EPS estimate last quarter, it beat the estimates in the prior three quarters. SQ’s stock has recovered more than 200% from the 52-week low it hit in mid-March due to the overall dip in the market. The company’s strong recovery could be part of a growth momentum that could last well for the rest of 2020. SQ’s strong fundamentals are reflected in its POWR Ratings, it has a “Strong Buy” rating with an “A” in Trade Grade, Buy & Hold, and Peer Grade and a “B” in Industry Rank. Within the Financial Services (Enterprise) group, it’s ranked #2 out of 137 stocks. CoreLogic, Inc. (CLGX) CLGX is a data analytics and related services provider for the mortgage finance, insurance, capital markets industries. The company recently unveiled its OneHome platform that is aimed to make the home-purchase experience easier for both agents and buyers. This integrated platform could help drive further revenues for CLGX. CLGX is currently staving off acquisition attempts from two investment firms which bodes well for its stock price. The company is set to declare its quarterly earnings today before the market opens. While revenues for the quarter are expected to decline marginally, the consensus EPS estimate of $0.85 indicates a year-over-year increase of 3.7%. CLGX has an impressive earnings surprise history with the company surpassing consensus EPS estimates in three of the trailing four quarters. Moreover, the stock has been rising since hitting its YTD low of $24.6 on March 23rd due to the coronavirus-led market crash. CLGX gained more than 136% during this period and the momentum might continue given the strength in its business model. It’s no surprise that CLGX is rated “Strong Buy” in our POWR Ratings system. It also has an “A” Trade Grade, Buy & Hold Grade, Peer Grade, and Industry Rank. In the 45-stock Consumer Financial Services industry, it is ranked #5. Green Dot Corporation (GDOT) GDOT is a financial services company that operates in a range of areas such as debit cards, wage disbursements, checking accounts, and so on. The company recently announced its partnership with Welcome Technologies to bring banking services to immigrants. They will first start by targeting Hispanic immigrants in the US. This move could bolster GDOT’s footprint in a new and untapped market that will be growing in the coming years. GDOT’s earnings surprise history is impressive as well with the stock beating consensus EPS estimates in each of the trailing four quarters. The stock has also been performing pretty well in this “new normal.” GDOT has added close to 120% to its stock price since hitting its low of $14.6 on March 18th. GDOT’s strong fundamentals are reflected in its POWR Ratings, it has a “Strong Buy” rating with an “A” in Trade Grade, Buy & Hold Grade, Peer Grade, and Industry Rank. Within the Consumer Financial Services Group, it’s ranked #6 out of 45 stocks. Want More Great Investing Ideas? 9 “BUY THE DIP” Growth Stocks for 2020 Newly REVISED 2020 Stock Market Outlook 7 “Safe-Haven” Dividend Stocks for Turbulent Times SQ shares rose $0.07 (+0.06%) in after-hours trading Thursday. Year-to-date, SQ has gained 96.50%, versus a 1.38% rise in the benchmark S&P 500 index during the same period."}]}