{"article": [{"url": "https://stocknews.com/news/amgn-sgen-vrtx-3-top-biotech-stocks-for-july/", "published": 1593778100.0, "headline": "3 Top Biotech Stocks for July", "body": "A variety of startups and established companies have been working on a vaccine and treatments for the coronavirus. There’s increasing optimism that a coronavirus vaccine could be developed by the end of the year. And, there’s been progress in therapies that are resulting in better treatment outcomes. One silver lining of this crisis is that it’s highlighted all the innovations that are taken place in the biotechnology sector over the past decade. The cost of drug development has dropped, treatments are more targeted, and diagnostics have improved. This is translating into more effective products that can save and extend life. Given the aging population of developing countries, the demand for these products is only going to increase. These strong fundamentals are resulting in outperformance for the sector, as the Nasdaq Biotechnology Index (IBB) has a YTD return of 14.89% versus the S&P 500’s (SPY) 3.12% loss. 7 \"SAFE HAVEN\" Dividend Stocks for Turbulent TimesHere are three biotechnology stocks positioned to outperform in July: Amgen Inc. (AMGN) AMGN is one of the world’s leading biotechnology companies with a highly differentiated pipeline. The biotech giant has a market cap of $151.91 billion. AMGN has entered a partnership with Adaptive Biotechnologies to find a Covid-19 treatment. It also has a drug, Enbrel which is a popular biological drug used to treat inflammatory conditions. AMGN emerged victorious against Novartis AG’s Sandoz in an appeals court hearing that upheld two patents for Enbrel till 2028. This victory resulted in an 8% increase for AMGN and resulted in the stock making new, all-time highs. Although, there is a chance the decision could be appealed. Despite the stock’s strong stock market performance, its valuation remains attractive with a forward price to earnings ratio of 15.6. It expects to increase sales by 11% next year and has 79% gross margins. AMGN has returned 40.8% over the past year, 26.57% over the past three months, and on a technical basis looks strong as it broke out from a nine-month consolidation. Twelve Wall Street Analysts have a “Buy” rating on the stock. AMGN has an overall POWR Ratings of Strong Buy with an “A” in all of its POWR components. AMGN tops the POWR Industry Rankings in the Biotech industry. Vertex Pharmaceuticals (VRTX) VRTX manufactures small molecule drugs for patients with serious ailments and focuses on treatment therapies for cystic fibrosis. Vertex’s cystic fibrosis drug Trikafta has been a huge success and as a result, the company has raised its revenue guidance for 2020. VRTX’s revenue guidance increased from a range between $5.1 billion and $5.3 billion to a range of $5.3 billion to $5.6 billion. The company also expects its EPS to double over the next year. As a result, VRTX is 58.9% higher over the past year and gained 22.2% over the past three months. VRTX has an average price target of $292.83 and out of twenty-two Wall Street analysts, eighteen have a “Buy” rating on the stock which means that analysts remain bullish on the stock. VRTX has a Strong Buy rating in our POWR Ratings with an “A” for Trade Grade, Peer Grade, Buy & Hold Grade, and Industry Rank. It also ranks #2 out of 336 stocks in the Biotech sector. Seattle Genetics (SGEN) SGEN is a biotechnology company focused on innovating and developing antibody-based therapies for cancer treatment. SGEN has been largely dependent on Adcetris which is a drug that inhibits cancer growth. However, this year, Seattle Genetics came up with two FDA approved drugs, Padcev and Tuksya, which have diversified its revenues. It expects this year’s revenue to be between $675 and $700 million. SGEN has a YTD gain of 47.9%. In May and June, the stock has been consolidating its recent gains between $150 and $175. Odds are high for an upside breakout given the bullish market climate and relative strength in the biotech sector. Twelve Wall Street analysts out of seventeen have “Buy” ratings on SGEN. It also has a Strong Buy rating in POWR Rankings and with an “A” in Trade Grade and Buy & Hold Grade and a “B” in Peer Grade and Industry Rank. Within the biotech sector, it’s ranked #5 among 336 stocks. Want More Great Investing Ideas? 9 “BUY THE DIP” Growth Stocks for 2020 Is the Bull S#*t Rally FINALLY Over? 7 “Safe-Haven” Dividend Stocks for Turbulent Times Top 3 Investing Strategies for 2020 AMGN shares were trading at $258.24 per share on Friday afternoon, up $3.12 (+1.22%). Year-to-date, AMGN has gained 8.61%, versus a -1.99% rise in the benchmark S&P 500 index during the same period."}]}