{"article": [{"url": "https://stocknews.com/news/ma-are-shares-of-mastercard-a-buy-sell-or-hold/", "published": 1599566900.0, "headline": "Are Shares of Mastercard a Buy, Sell or Hold?", "body": "Mastercard Incorporated (MA) is a global technology-based payment company that connects the digital economy making transactions safe, smart and accessible. The company has networks in more than 210 countries and territories. MA has an impressive earnings surprise history with the company surpassing consensus EPS estimates in three of the trailing four quarters. Even though the pandemic has hit the company hard, causing a year-over-year decrease in net revenue and adjusted net income, MA’s future prospects look encouraging with increased dependence on digital payments. In the second quarter financial report, Mastercard CEO AjayBanga said, “Our platform uniquely positions us to support the shift to digital across consumer and business payments that has been accelerated by the COVID-19 pandemic, including an increase in consumers’ preference for contactless payments. Further, our broad range of market-leading services — from insights and analytics to cybersecurity tools — means we are able to support our partners’ evolving needs in a rapidly changing world.” 9 \"BUY THE DIP\" Growth Stocks For 2020This encouraging outlook and the potential upside based on a number of factors has helped it earn a “Buy” rating in our proprietary rating system. Here is how our proprietary POWR Ratings system evaluates MA: Trade Grade: A MA is currently trading higher than its 50-day and 200-day moving averages of $320 and $297.51, respectively, indicating that the stock is in an uptrend. In fact, the stock’s 6.2% return over the past three month reflects a solid short-term bullishness. MA’s new partnership with TSYS, a global payments company, will enable consumers to use their Mastercard to split transactions into installments before, during or after checkout and complement its comprehensive suite of merchant offerings. Moreover, MA has partnered with Circle K, Delaware North, Dunkin’ and White Castle to reimagine the consumer shopping journey using a new suite of frictionless solutions for retailers to enable the touchless economy. Buy & Hold Grade: B In terms of proximity to its 52-week high, which is a key factor that our “Buy & Hold Grade” takes into account, MA is well positioned. The stock is currently trading just 9.6% below its 52-week high of $367.25. Looking at the past three years, the stock has grown more than 148.3%. At the current price, MA’s valuation looks expensive. With a one-year PEG ratio of 651.65, MA is expected to have a higher PEG ratio (a measure of how expensive a stock is relative to its expected earnings growth) than 94.8% of US stocks in the Stocknews.com Universe. However, the company’s revenue and net income growth has been impressive over the past three years. The revenue and net income witnessed a CAGR of 12.4% and 18.7%, respectively, over the past three years. In addition, the company’s EPS is expected to grow 11.4% per year over the next five years. MA is building the future of commerce with eleven companies joining its Start Path startup engagement program and nearly fifty new deals signed to Engage network to foster customers growth ambitions. Industry Rank: A MA is part of the StockNews.com Consumer Financial Services industry, which is ranked #16 out of the 123 industries. The increased need for secure and contactless payments should help the stock grow in the “new normal.” In fact, the industry should witness more opportunities with the recovery of industries and the economies. Peer Grade: A MA is currently rated #3 out of 45 stocks in the Consumer Financial Services industry. Other popular stocks in the industry are Visa Inc. (V), CoreLogic, Inc. (CLGX) and PayPal Holdings, Inc. (PYPL). While PYPL and CLGX beat MA by gaining 77.4% and 54.1% year-to-date, V returned only 9.4% compared to MA’s 11.6% year-to-date gain. Overall POWR Rating: B (Buy) Overall, MA is rated a “Buy” due to its impressive past performance, short-and-long-term bullishness, and solid price momentum, as determined by the four components of our overall POWR Rating. Bottom Line Despite returning about 35% over the past six months, MA has potential to grow even further based on its continued business growth, price momentum and favorable earnings outlook. Analyst sentiment, which gives a good sense of a stock’s future price movement, is pretty impressive for MA. Twenty seven out of thirty eight Wall Street analysts have a “Strong Buy” rating on the stock. Want More Great Investing Ideas? 7 Best ETFs for the NEXT Bull Market Will Stocks Fall into Historical September Slump? 9 “BUY THE DIP” Growth Stocks for 2020 MA shares fell $2.78 (-0.84%) in after-hours trading Tuesday. Year-to-date, MA has gained 10.95%, versus a 4.59% rise in the benchmark S&P 500 index during the same period."}]}