{"article": [{"url": "https://stocknews.com/news/chwy-zts-frpt-trup-zts-4-pet-stocks-you-should-know/", "published": 1593518900.0, "headline": "4 Pet Stocks You Should Know", "body": "Pet care companies might not be on the top of your list when considering which stocks to add to your portfolio. But maybe they should be. Pet ownership continues to increase, as does the cost of owning a pet. 35 years ago, under 50% of households owned a pet. Today, 67% of households own a pet. In 2019, $95.7 billion was spent on pet products with the figure expected to hit $99 billion in 2020. Millennials are more likely to consider a pet as a member of the family and treat them accordingly. 73% of Millennials currently own a pet, and 89% of Millennial homeowners own a pet. 9 \"BUY THE DIP\" Growth Stocks For 2020These four stocks are perfectly positioned to cash in on these trends: Chewy (CHWY) CHWY is at the intersection of two growing trends – pet ownership and e-commerce. Along with Amazon (AMZN), it accounts for $9 of every $10 spent on pets online. It’s quite expensive by traditional valuation metrics, but the history of many e-commerce stocks shows that once a company can carve out a dominant, entrenched position in the market, then it can always find new ways to monetize. CHWY has accomplished the first part of this equation. It was a beneficiary of the coronavirus, as it resulted in 1.6 million new customers in the previous quarter with the average order size increasing by 11%. CHWY is likely to hold on to many of these customers given its convenience, cost-savings, and strong customer retention figures. However, it’ll only be able to grow into its $20 billion valuation by continuing to increase the value of each customer by offering higher-margin items like pet insurance and medicines. CHWY’s POWR Ratings are constructive with a “Buy” rating. It has an “A” in Trade Grade and Industry Rank and a “B” in Buy & Hold and Peer Rank. It’s ranked #13 among the Consumer Goods category. Freshpet (FRPT) FRPT has a unique proposition in that it sells refrigerated pet food which it claims is healthier and tastier than dry or wet, canned food. The company’s products are also more expensive by a significant margin. FRPT has found a niche by producing and selling higher-end food to pet owners. One impressive metric is that 70% of revenue is repeating. It has partnerships with leading retailers like Kroger (KR), Walmart (WMT), Whole Foods, and Petco with its own branded, refrigerated cases. Some more impressive metrics are its 25% average annual revenue growth over the past 5 years, 27% expected revenue growth over the next 12 months, and 46% gross margins. The company’s stock has been a big winner and is 5% off all-time highs. (source: finviz.com) FRPT is rated a “Buy” by POWR Ratings. It has an “A” in Trade Grade and Peer Grade and a “B” in Buy & Hold Grade and Industry Rank. Among food manufacturers, it’s ranked #17. Trupanion (TRUP) TRUP is the second-largest pet insurer in the US. Just like humans, healthcare for pets is expensive, and it’s growing at a faster rate than incomes. Therefore, pet insurance is increasingly becoming a necessity. Since October 2018, the stock has been range-bound between $45 and $25. Over this period, TRUP’s revenues have increased from $288 million to $407 million. It expects to grow revenues 27% over the next year and maintains 16% gross margins. (source: finviz.com) Given these fundamentals and the strong performance of pet stocks, there’s a good chance that TRUP will break this range to the upside. POWR Ratings is also positive on the stock, as it has a “Strong Buy” rating with an “A” in Trade Grade, Buy & Hold Grade, and Peer Grade with a “B” in “Industry Rank”. It’s ranked #6 in the Medical Services group. Zoetis (ZTS) ZTS’s size and success is a testament to the growth and opportunity in pets. It’s the leading manufacturer and producer of animal health products including medicines, vaccines, and diagnostic products. It was spun off from Pfizer (PFE) in 2013. Since its debut, it’s up more than six-fold. (source: finviz.com) The company pays a dividend of 0.60% which isn’t impressive in normal times but is much more attractive when the 10-year Treasury is yielding 0.65%. ZTS also has impressive margins of 67% and a 5% growth rate. Over the next 12 months, it expects to grow EPS by 37% giving it a price to earnings ratio of 33. The stock is rated a “Buy” by POWR Ratings. It has an “A” in Trade Grade and Peer Grade with a “B” in Buy & Hold Grade and Industry Rank. Within the Medical Pharmaceuticals category, it’s ranked #21. Want More Great Investing Ideas? 9 “BUY THE DIP” Growth Stocks for 2020 Is the Bull S#*t Rally FINALLY Over? 7 “Safe-Haven” Dividend Stocks for Turbulent Times Top 3 Investing Strategies for 2020 CHWY shares . Year-to-date, CHWY has gained 54.10%, versus a -3.21% rise in the benchmark S&P 500 index during the same period."}]}