{"article": [{"url": "https://stocknews.com/news/pltr-pypl-fb-spot-should-you-buy-palantirs-direct-listing/", "published": 1601467700.0, "headline": "Should You Buy Palantir’s Direct Listing?", "body": "Palantir (PLTR), one of the most fascinating and controversial companies in recent history, is going public today through a direct listing. The company is named after the “palantiri,” which are seeing stones in the “Lord of the Ring” trilogy. In the books, these allowed the characters to see across the whole universe and through time. Palantir is hoping to accomplish the same with its algorithms and data-ming technology. It was founded after 9/11 during the “War on Terror” to stop terrorist attacks or other national security threats. 7 \"SAFE HAVEN\" Dividend Stocks for Turbulent TimesThe company was started by Peter Thiel, soon after he sold Paypal (PYPL) to eBay (EBAY) for $1.5 billion. At Paypal, they had developed a highly effective fraud detection algorithm for financial transactions which he wanted to apply to detect other sorts of threats. Thiel remains the Chairman of Palantir, and his involvement is sure to generate interest, since he is known for his successful investments in companies like Facebook (FB), Spotify (SPOT), and Lyft (LYFT). In addition to starting PYPL, he is known as a thought leader in Silicon Valley and has been outspoken about his political beliefs. Some of these beliefs have certainly filtered down to Palantir. In its S-1, the company states, “We have chosen sides, and we know that our partners value our commitment. We stand by them when it is convenient, and when it is not.” This statement is a rejoinder to critics in Silicon Valley who don’t approve of the company’s work with places like intelligence agencies, immigration enforcement, defense companies, and the Department of Defense. It’s also a message to his partners that Palantir will not be swayed by public opinion. However, the company’s intent was very clear with its first major venture backer – the CIA’s venture arm, In-Q-Tel. It worked with the agency to train and develop its analytics engine. Reportedly, the company’s software was instrumental in helping to locate Osama bin Laden in 2011. As a result, the company began getting contracts from police departments, foreign governments, military branches, and intelligence agencies. Direct Listing Palantir’s trading debut is unusual for a couple of reasons. It’s going public through a direct listing which means that the company will save costs in terms of underwriting and not having to do an IPO roadshow. It also means that there will be less constraint on the supply of shares and no source of demand generation. Spotify (SPOT) and Slack Technologies (WORK) are the two most recent, high-profile companies which have gone public through this route. Both saw tepid reactions in their stock prices in their initial months of trading, however, these stocks have started outperforming in recent months. In traditional IPOs, the underwriters generate demand and keep supply limited which is supportive of the price during the first, few months of trading. It’s expected that Palantir will start trading at $10 which would give it a valuation of $22 billion. It plans to sell 257 million shares to raise $2.57 billion. Another unique feature of the direct listing is that Palantir has created three classes of stock which will keep all the voting power in the hands of Thiel, co-founder Stephen Cohen, and co-founder and CEO Alex Karp. To-date, Palantir has never been profitable. In the first six months of the year, it reported a loss of $164.7 million which was an improvement from $281 million in the first six months of 2019. The company remains focused on growth as it generated $481 million in revenue in the first half of the year which is a 49% improvement over last year. For the full year, Palantir projects $1 billion in revenue. Palantir’s Products Palantir builds software platforms for companies, government agencies, and other institutions. Karp in his interviews has said Palantir builds and sells a “platform for modeling the world and making decisions.” Palantir sells two, different platforms – Gotham and Foundry. Gotham was its initial product created to help with counterterrorism and intelligence operations. Foundry was created to provide these same tools to effectively sift through massive amounts of data to find useful and actionable insights for companies and other customers. Currently, it has 125 customers using its platform. The company believes it has a total addressable market of $119 billion, with $56 billion coming from commercial business and $63 billion from government business. Bull Case The bull case for Palantir is that the company will continue to grow revenue and become profitable. There will certainly be increasing demand for companies that can help turn the massive amounts of data generated by companies through the many parts of their business – marketing, sales, customer service, software, operations, technology infrastructure, CAPEX, etc. The combination of large gross margins, impressive revenue growth, and a “sticky product” is very attractive for growth-oriented investors, especially in this low-rate environment. Since Palantir has many government and military clients, these contracts are less prone to corporate contracts. Palantir also has an early lead in developing its technology given that it was one of the first companies in this space. Bear Case The bear case centers around that Palantir is overpriced with a $10 billion valuation compared to $1 billion in sales. Its growth has lagged many other high-profile software companies around the same time. Additionally, there is a lot of secrecy and controversy around the company, although some are necessary since it works on sensitive work that impacts a lot of people. This may convince some investors to look at opportunities that are less opaque. The shareholder model is unusual and eliminates the chance of any activism. The direct listing process comes with less oversight than the traditional IPO process. Two more issues: In recent years, terrorism and national security have receded as the top issues on voter’s minds. Given the coronavirus and chances of a Democratic administration, defense spending could decline. As a result, many defense companies and government contractors have underperformed. Verdict Overall, my opinion is that Palantir looks like a good buy at $10. Concerns about its background are good for media fodder, especially when thinking about it as a tech company. But in reality, it’s more of a defense company that uses software as its means to help its customers accomplish their goals. The company made this very clear, in a literal way, by moving its headquarters from Silicon Valley to Denver. In this current economic environment, stocks with high growth and margins will likely lead to outperformance, especially with customers where recurring revenue should continue to increase. Want More Great Investing Ideas? 7 “Safe-Haven” Dividend Stocks for Turbulent Times When Does the Next Bull Run Start? Chart of the Day- See the Stocks Ready to Breakout"}]}