{"article": [{"url": "https://stocknews.com/news/baba-jd-ntes-nio-4-red-hot-chinese-stocks/", "published": 1598530100.0, "headline": "4 RED HOT Chinese Stocks", "body": "It appears as though President Trump’s threat to de-list Chinese stocks from the US exchanges is an empty one. The presidential election is two months away and no meaningful action has been taken to remove Chinese stocks from the NASDAQ and other exchanges. &nbsp If you have been holding off on investing in Chinese stocks due to this issue then, you are not alone. It seems increasingly likely that while threats will be made, delisting is unlikely given the incentives on both sides. Chinese companies want access to US markets. And, US exchanges want to have the world’s largest and best companies listed on them. Investors who have been on the sidelines missed the rocket-like ascent of several Chinese stocks in recent months. However, there is still plenty of time to hop on board and ride the following Chinese stocks to new heights: Alibaba Group (BABA), JD.com (JD), NetEase (NTES), and Nio (NIO). Alibaba Group (BABA) 7 Best ETFs for the NEXT Bull MarketE-commerce has become even more important as the pandemic has forced people across the globe to quarantine away from other potential virus-carriers. China’s BABA has emerged as one of the world’s top e-commerce companies. Unlike other e-commerce businesses, BABA is not exclusively focused on web-based shopping. Rather, BABA has broadened its scope to cloud computing, logistics, and more. At the moment, BABA’s businesses constitute more than 50% of all of China’s web-based retail sales. BABA’s success is likely to continue far into the future as China’s population swells. If you are hesitant to invest in BABA, consider its dazzling POWR Ratings. BABA has A grades in each of its POWR Components but for its Industry Rank grade which is a B. BABA is ranked #1 of more than 100 China stocks. The analysts are bullish on BABA, with an average price target of $296.60. If BABA reaches this level, the stock will have increased by nearly 4%. One would think BABA would have a forward P/E ratio over 100 considering its prominence as an e-commerce power. However, BABA’s forward P/E is only slightly above 31. Furthermore, the company has diversified its risk across a series of niches ranging from digital payments to food delivery, logistics, and beyond. BABA’s current customer base of 742 million helped the company’s revenue spiked nearly 35% to just under $22 billion in the most recent quarter. Even if China’s middle class does not expand as expected, BABA will undoubtedly continue to grow across posterity. This is a can’t-miss stock if there ever was one. JD.com (JD) Web-based direct sales are quickly replacing conventional sales at spacious malls, strip malls, and stand-alone brick-and-mortar stores. JD provides a wide array of authentic products through its website as well as its mobile applications. JD offerings include the likes of home appliances, handbags, jewelry, household products, furniture, books, food, movies, and more. Check out JD’s POWR Ratings and you will walk away impressed. JD has A grades in each POWR Rating Component but for its Industry Rank of B. Out of 115 China stocks, JD is ranked second. Of the 18 analysts who have reviewed JD, 16 rates it a Buy, two rates it a Hold, and none advise selling. Though JD is currently trading right around its 52-week high, it is likely to move even higher as its Chinese customers have become accustomed to ordering goods through the company’s online platform during the pandemic. This comparably efficient shopping process is quite easy compared to shopping at traditional brick-and-mortar stores. JD’s annual revenue is growing at its fastest rate across the past 10 quarters, coming in at 33.8% in the second quarter of 2020. Furthermore, JD’s customer growth rate is just under 30%, a considerable spike from the 2.4% customer growth rate in the second quarter of ’19. Look for JD to move toward the $100 mark as the company expands its offerings with new services such as a web-based pharmacy and a telehealth platform. NetEase Inc. (NTES) It is difficult to find a more profitable and growth-oriented business than internet technology. NTES operates in this space, creating applications, services, and another tech for China’s web users. NTES even provides web-based gaming services including the uber-popular MMORPGs (massively multiplayer online role-playing games). NTES also provides web advertising services, micro-blogging services, and entertainment content. The POWR Ratings show NTES has A grades in each of its POWR Components but for its Industry Rank which has a B grade. Of the 115 China stocks, NTES is ranked third. Furthermore, NTES has the backing of the top analysts who have set an average price target of $536.75 for the stock. The bottom line is NTSE is worthy of your money as its businesses are internet-based, meaning they are pandemic-proof. Look for NTSE to hit an all-time high by the end of the year. NIO Inc. (NIO) The electric vehicle market is as hot as it gets. NIO is one of China’s leaders in this sector, manufacturing and selling electric cars. NIO operates in San Jose, London, and Munich yet its corporate headquarters is in Shanghai. The POWR Ratings show NIO has A grades in each POWR Component but for its Buy & Hold and Industry Rank grades of B. NIO is ranked 15th of all the China stocks. NIO recently announced it would provide a $10,000 discount to customers who agree to pay a monthly subscription fee around $140 for the battery used in the company’s electronic vehicles. As long as NIO maintains its inside track to increased EV market share, the stock should gradually move upward toward $20 and possibly even higher before 2020 ends. Want More Great Investing Ideas? The Best of StockNews 2 Step Process to Sell @ Market Top in September 9 “BUY THE DIP” Growth Stocks for 2020 BABA shares were trading at $284.29 per share on Thursday afternoon, down $7.67 (-2.63%). Year-to-date, BABA has gained 34.04%, versus a 9.19% rise in the benchmark S&P 500 index during the same period."}]}