{"article": [{"url": "https://stocknews.com/news/tsla-nio-tesla-vs-nio-which-stock-is-a-better-buy/", "published": 1601899700.0, "headline": "Tesla vs. NIO: Which Stock is a Better Buy?", "body": "Tesla, Inc. (TSLA) and NIO Ltd. (NIO) are two of the leading electric car manufacturers in the world. While TSLA is more mature with a stable customer base across the world, NIO, based in China, is one of the fastest-growing companies in this industry. Both stocks have generated significant returns year-to-date, despite the coronavirus pandemic. NIO is the clear winner with 426.9% returns year-to-date versus TSLA’s 396.1%. But which of these stocks is a better pick now? Let’s find out. Latest Movements 7 Best ETFs for the NEXT Bull MarketTSLA split its stock in five earlier this year, reducing its sky-high share price to an affordable amount. It is currently planning to expand to Indonesia to ensure a steady supply of nickel, a key component in manufacturing car batteries. TSLA is also planning to launch three new electric vehicles shortly, including Tesla cybertruck and 2 electric cars. It is reportedly planning to launch its product in India in 2021. With a huge population and thereby potential market, this expansion is expected to ramp up profits for the company. NIO recently raised $1.30 billion through American depository share offering, which is expected to contribute to the research and development of electric car ecosystems and automated technologies as well as developing its global market presence. It also plans to buy back some of its shares from Hefei investor group, which previously bailed out the company with a $1.40 billion cash infusion. NIO is the first company to launch a “battery as a service” (BaaS) subscription model, allowing customers to purchase electric vehicles and battery packs separately. It is planning to launch its EVs in the European market by 2021. Recent Financial Results TSLA’s EV deliveries increased 7% year-over-year in the third quarter. In the second quarter, TSLA reported net revenue of $6.04 billion, indicating a year-over-year decline. However, net revenues grew 1% on a sequential basis. Net income of $104 million and EPS of $0.50 for the quarter indicates a significant improvement from the year-ago negative values. Cash and cash equivalents improved 74% year-over-year to $8.62 billion. NIO’s vehicle sales and total revenues both increased 146.5% year-over-year to $493.40 million and $526.40 million respectively in the second quarter ended June 2020. Gross profit of $44.30 million compares to a loss reported in the prior-year quarter. NIO’s deliveries for the third quarter ended September 2020 indicates a 154.3% improvement year-over-year to 12,206 vehicles. In September alone, NIO delivered 4,708 vehicles, indicating a 133.2% rise from the year-ago value. Thus, NIO has an edge over TSLA here. Expected Financial Performance The market expects the TSLA’s revenue to increase by 30.5% in the current quarter, 22.5% in the current year, and 39.9% next year. NIO’s revenue is expected to increase 137.7% in the current quarter, 95.7% in the current year and 75.5% next year. Hence, NIO is in an advantageous position here. Valuation NIO is currently trading at 15.88x its trailing-twelve-month sales versus TELA’s 14.65x. However, it’s worth paying this marginal premium because of its significant revenue growth potential. POWR Ratings While TSLA is rated “Buy” in our proprietary POWR Ratings system, NIO is rated “Strong Buy”. Here’s how the four components of overall POWR Rating are graded for TSLA and NIO: TSLA holds a “B” for Trade Grade, Peer Grade, and Industry Rank, and “C” for Buy & Hold Grade. It is also ranked #4 out of 29 stocks in the Auto & Vehicle Manufacturers industry. NIO has an “A” for Trade Grade, Buy & Hold Grade, Peer Grade, and Industry Rank. In the 1115-stock China group, NIO is ranked #3. The Winner While both TSLA and NIO are strong performers in the electric car industry, NIO is the better buy right now given its solid momentum and revenue outlook. While TSLA is a well-established electric vehicle manufacturer, NIO’s expansion plans and impressive growth in the past couple of months indicate significant growth potential in the upcoming quarters. Want More Great Investing Ideas? Do NOT Buy Stocks Before the Election! 7 “Safe-Haven” Dividend Stocks for Turbulent Times Chart of the Day- See Christian Tharp’s Stocks Ready to Breakout TSLA shares fell $3.20 (-0.75%) in after-hours trading Monday. Year-to-date, TSLA has gained 408.78%, versus a 7.08% rise in the benchmark S&P 500 index during the same period."}]}