{"article": [{"url": "https://stocknews.com/news/bkng-hlt-ta-3-travel-stocks-starting-to-perk-up/", "published": 1600949300.0, "headline": "3 Travel Stocks Starting to PERK UP", "body": "In the month of March, the whole world came to standstill due to the coronavirus outbreak. Preventive measures taken by governments all over the world had significant negative implications for the travel and tourism industry. In fact, this has been one of the worst hit industries. With a ban on travel, a lockdown, and other measures to dodge the virus, millions of people were forced out of work in these industries. While domestic travel for the fall season shows some recovery, a resurgence of COVID-19 cases in the United States and in many other countries have dampened the hopes of a near-term recovery for the industry. However gloomy it might look in the present time, the travel industry has the potential to pick up over the next few years, as vaccines are expected to arrive soon. In fact, the pandemic has forced operational changes in the industry to operate in the new normal. For example, Artificial Intelligence (AI) and facial recognition is already being used by various airports. Booking Holdings Inc. (BKNG), Hilton Worldwide Holdings Inc. (HLT), and TravelCenters of America LLC (TA) are three fundamentally sound stocks in the industry that could recover faster than their peers over the coming years. 7 Best ETFs for the NEXT Bull MarketBooking Holdings Inc. (BKNG) BKNG provides travel related services ranging from providing online reservations of hotels, restaurants, vacation packages, and travel insurance products. The current economic downturn due to the pandemic remains a major headwind for the company. With a ban on international travel, consumers had no option but to travel domestically, which turned out to be a positive for the company. In the reopening phase, the company saw an increase in bookings from new customers. In April, the company saw a dip of 85% year-over-year on newly booked nights. However, July saw a decline of 35 % year-over-year, which is an improvement. BKNG’s net income in the second quarter declined 88% to $122 million, compared to the same quarter last year. Loss per share for the quarter came in at $10.81, beating the consensus estimate by 6%, but declined from the year-ago EPS of $23.59. BKNG’s revenue and EPS estimate of $2.56 billion and $14.55 indicate a year-over-year decline of 49.2% and 67.9%, respectively. The company’s EPS is expected to grow 257% next year and at a rate of 2.2% per annum over the next five years. The stock has gained more than 45% since hitting its low in March. The stock is ranked #4 out of 57 stocks in the Internet Industry. Hilton Worldwide Holdings Inc. (HLT) HLT is a hospitality company which has been in business since the 1900s, and has a portfolio of 18 brands, with 6100 properties in 119 countries. The company franchises, owns, and leases hotel resorts and timeshare properties worldwide. The company has an edge over its competitors as it operates on a Franchise system wherein it doesn’t own all the properties. This model helps the company save on costs of operation in uncertain times, such as what we are going through now. As of July 31, 2020, 96% of HLT hotels were open. Hilton’s development pipeline increased 11% year-over-year to 414,000 rooms on June 30, 2020. However, the company’s comparable RevPAR decreased 81% year-over-year in the second quarter, on a currency neutral basis. HLT reported a loss of $0.61 per share for the second quarter, versus an EPS of $0.98 a year ago. The company’s EPS is expected to grow 529% next year. The stock has gained closed to 30% since hitting its low in March. HLT has been accorded a grade of “B” for Peer Grade in our POWR Ratings system. Among the 14 stocks in the Travel – Hotels/Resorts industry, its ranked #1. TravelCenters of America LLC (TA) TA operates and franchises travel centers and gasoline station/convenience store locations offering a range of products and services, including gasoline, truck repair and maintenance services, and full-service restaurants across the United States. TA’s business benefited from preventive lockdown measures as initial uptick in demand by businesses and households for essential commodities resulted in increased trucking activity. However, demand was reduced in April 2020. Attributing to social distancing norms, the company had to close most of its restaurants and limit its product offerings. As a part of its growth strategy moving forward, the company fired employees, which it claims will result in a reduction of $13.1 million in SG&A expenses. Last year, TA had entered into an agreement with IHOP Franchisor LLC to rebrand its 94 restaurants to IHOP restaurants over the next 5 years; but this initiative has been delayed by a year. TA’s net income for the second quarter ended jumped 78.3% year-over-year to $2.16 million. EPS for the quarter jumped 73.3% year-over-year to $0.26. The fuel gross margin increased 19.6%, which was mainly due to low fuel prices and tax credits. The stock has gained more than 225% since hitting its low in March. Within the Specialty Retailers, it’s ranked #10 out of 34 stocks. Want More Great Investing Ideas? 7 “Safe-Haven” Dividend Stocks for Turbulent Times When Does the Next Bull Run Start? Chart of the Day- See the Stocks Ready to Breakout BKNG shares were unchanged in after-hours trading Thursday. Year-to-date, BKNG has declined -19.63%, versus a 1.95% rise in the benchmark S&P 500 index during the same period."}]}