{"article": [{"url": "https://stocknews.com/news/isrg-snap-plug-wkhs-4-stocks-on-the-cutting-edge-of-innovation/", "published": 1598616500.0, "headline": "4 Stocks on the Cutting Edge of Innovation", "body": "In this era of rapid digital transformation that speeds up the economy, companies that are working on cutting-edge innovations stand to gain the most. These companies will at the very least have first-mover advantage in their industries. This could eventually lead to a dominant market share for some. Current established blue-chip companies were once simply upstarts focusing on innovation and technological advancements. Hence, the potential for growth for companies currently working on technologies such as robot-assisted surgeries, augmented reality, electric vehicles and storage of alternative energy, is limitless. Intuitive Surgical, Inc. (ISRG), Snap Inc. (SNAP), Plug Power, Inc. (PLUG), and Workhorse Group, Inc. (WKHS) are four companies on the cutting edge of innovation. 7 Best ETFs for the NEXT Bull MarketIntuitive Surgical, Inc. (ISRG) ISRG designs, develops, and sells da Vinci surgical systems and related accessories and instruments. ISRG is a market leader in providing surgical systems that use robots to assist with surgery. This leadership position is further solidified since competitors like Johnson & Johnson (JNJ) are experiencing delays in their robotic surgery programs and face higher standards for regulatory approval. The most noteworthy feature of the company is its recurring revenue due to the sale of instruments and accessories that users of the company’s da Vinci surgical systems need on a regular basis, and can only buy from the company. This recurring revenue provides a stable business model for the company and will help it keep growing as the use of the da Vinci surgical systems becomes commonplace. In the second quarter of 2020, the company placed 5,764 surgical systems, while its installed base grew 9% year-over-year. The company’s EPS is expected to grow by 47.8% next year. ISRG has delivered a year-to-date price return of 22%, despite disruptions caused by the spread of the coronavirus. How does ISRG stack up for the POWR Ratings? A for Trade Grade A for Buy & Hold Grade A for Peer Grade A for Industry Rank A for Overall POWR Rating You can’t ask for better. The stock is also ranked #1 out of 138 stocks in the Medical – Devices and Equipment industry. Snap, Inc. (SNAP) Snapchat is a popular social media company that operates a camera-based app for the sharing of photos and short videos. The company has been making forays into augmented reality through “lenses” and “filters” that Snapchat users can use. Around 75% of Snapchat’s users play with these AR tools every day. Snapchat enhanced its AR platform last year by adding features for the world around us in addition to our faces. In February, the company launched Bitmoji TV which allows users to make avatars for themselves and be characters within a pre-made animated series. The company has recently signed licensing deals with major music publishers to add a music feature to its app. SNAP’s EPS is expected to grow by 155.6% next year. SNAP has delivered a year-to-date price return of 33.1%. The company has a grade of A for Industry Rank in our POWR Ratings system. In the 57-stock Internet industry, it is ranked #24. Plug Power, Inc. (PLUG) PLUG is an alternative-energy technology company that primarily focuses on fuel cell systems for vehicles. PLUG is known for creating the world’s first commercially viable hydrogen fuel system. The company is currently working on expanding into new areas such as robotics, data centers, and zero-emissions on-road vehicles. The company has recently announced the development of a light-weight 1kW fuel cell that can be used in small scale robotics, drones, automatic guided vehicles, and other applications in aerospace. In the second quarter of 2020, the company achieved its highest gross billings so far which marked a year-over-year growth of 24%. The company also issued the first ever green bond in the US. PLUG’s EPS is expected to grow by 19.4% in the current year and by 17.2% over the next year. PLUG has delivered a year-to-date return of 311%. It’s no surprise that PLUG is rated a Buy in our POWR Ratings system. It also has a grade of A for Trade Grade and Peer Grade. In the 57-stock Industrial – Equipment industry, it is ranked #15. Workhorse Group, Inc. (WKHS) WKHS focuses on the development and sale of electric medium-duty trucks along with unmanned aerial delivery systems that can be integrated with electric vehicles. WKHS’s stock has been rising on the news that Lordstown Motors, a company in which WKHS owns a 10% stake, is having a public offering. If the IPO is successful, WKHS could receive a large influx of money. WKHS currently has the ability to scale up its manufacturing due to a 265,000 sq. ft. plant and is ready to meet future demand in the commercial electric vehicles industry. The company has begun production of its new C-series electric step vans. WKHS has also received approvals from the EPA and the CARB allowing the company to sell its vehicles in all 50 U.S. states. Sales for the second quarter of 2020 was $92,000 compared to $5,500 over the same period last year. The company is expected to see EPS growth of 83.2% next year. WKHS has delivered a year-to-date price return of 451%. According to our proprietary POWR Ratings, the stock has a grade of B for Trade Grade and Industry Rank. Want More Great Investing Ideas? 7 Best ETFs for the NEXT Bull Market Why Stocks Could Drop 20% in September? 9 “BUY THE DIP” Growth Stocks for 2020 ISRG shares were trading at $726.31 per share on Friday afternoon, up $16.92 (+2.39%). Year-to-date, ISRG has gained 22.86%, versus a 9.72% rise in the benchmark S&P 500 index during the same period."}]}