{"article": [{"url": "https://stocknews.com/news/amzn-heres-what-could-thwart-amazons-bullish-momentum/", "published": 1600085300.0, "headline": "Here's What Could THWART Amazon's Bullish Momentum", "body": "A massive valuation and bullish trend in AMZN The election could change the landscape for Bezos’s company &nbsp A Biden victory will face pressure from progressives Another four years of President Trump could come with payback for the owner of the Washington Post 7 \"SAFE HAVEN\" Dividend Stocks for Turbulent Times&nbsp AMZN’s business model is bullish; the political landscape means speedbumps ahead Jeff Bezos founded Amazon (AMZN) in the garage of a rented home in Bellevue, Washington. His parents invested $250,000 in the start-up. Amazon began as an online bookseller. Bezos left his job at D.E. Shaw & Co., a Wall Street hedge fund in 1994. Twenty-six years later, he is the wealthiest man in the world, and his company is in the trillion-dollar-plus market cap club. After a divorce, his ex-wife is one of the top five richest women on the earth. In the first two months of operation, Amazon sold to all fifty states in the US and over forty-five countries. Within that period, sales reached $20,000 per week. Amazon’s initial public offering on May 15, 1997, was at $18 per share. With stock splits, the shares opened at $1.96. At over $3110 per share at the end of last week, AMZN has been one of the world’s most incredible success stories. Mr. Bezos created a vast empire through the success of Amazon and acquisitions over the years. His profile, wealth, and power have grown to an unprecedented level, making him and his business a target for politicians in Washington DC and countries worldwide. A massive valuation and bullish trend in AMZN After trading at a record-high $3,552.25 on September 2, AMZN shares retreated with the rest of the stock market. Technology stocks suffered the worst losses during the correction that began earlier this month. Meanwhile, at just over $3,116 per share, the bullish trend in AMZN remains firmly intact, and the valuation of the company of over $1.56 trillion puts it in an exclusive club. Source: Barchart The long-term chart shows that even after correction of around 12.3%, AMZN continues to be a bullish beast. The election could change the landscape for Bezos’s company The November 3 upcoming election in the US could have significant consequences for Amazon and the other leading technology companies. Together with Apple (AAPL), Facebook (FB), Microsoft (MSFT), and Alphabet (GOOG), AMAZ and the other trillion-dollar companies have faced more than a few objections from politicians and regulators in the US, Europe, and around the world. The sheer size of the companies raises antitrust issues. The companies’ founders and leaders have seen their wealth grow to levels where many believe they are oligarchs. Jeff Bezos, the wealthiest man in the world, is at the top of the list when it comes to a bullseye on his back. Gridlock on the political landscape in the US is likely a best-scenario for the trillion-dollar companies. In an environment where the two political parties do not agree on any issue, the odds of any government action are low. However, there is some bipartisan agreement that the leading companies’ power and influence have grown to a level that impedes competition. In the aftermath of the election, we could see a renewed effort to break up the leading technology companies. However, each political party is likely to come at the issue with different solutions. A Biden Victory Will Face Pressure from Progressives Former Vice President Joe Biden continues to lead in the polls as the election approaches. A Biden victory where a majority in the House of Representatives remains in the hands of Democrats and the slim Republican majority in the Senate changes to the other side of the aisle could pose the most significant challenge to Amazon and other members of the trillion-dollar club. The Democrat’s progressive wing that supports Socialist Democracy is not a fan of the leading technology corporates. Congresswoman Alexandria Ocasio Cortez blocked AMZN’s move to New York City, claiming it would displace residents in Queens by forcing housing prices higher. She also objected to tax breaks and subsidies for the company. Meanwhile, many supporters of AMZN argued that the tax revenues more than compensated the City of New York. At the same time, the progressives favor colossal tax increases for corporations and the wealthiest individuals, which would weigh on earnings for AMZN and other leading technology companies. Moreover, many politicians from the left, including Senators Bernie Sanders and Elizabeth Warren, favor breaking up the leading companies. Another Four Years of President Trump Could Come With Payback for the Owner of the Washington Post On the other side of the political aisle, there is no love lost between President Trump and Jeff Bezos. Bezos’s ownership of the Washington Post creates lots of animosity between the incumbent candidate and the world’s wealthiest person. President Trump includes the Washington Post in his “fake news” category. The newspaper has been a consistent critic and foe of the President and his administration. Another four years of President Trump, without the pressure of re-election, could spell problems for AMZN. While the President developed a relationship with Tim Cook from AAPL, and Mark Zuckerberg from FB, Bezos remains political enemy number one. AMZN’s Business Model is Bullish; the Political Landscape Means Speedbumps Ahead AMZN’s success story is nothing short of incredible. The company is appropriate as an “amazon” is “a big warrior-like woman, someone who reminds you of the mythical Greek women-warriors, the Amazons.” While the term can have a negative connotation, it can be just the opposite as a positive term for a statuesque, athletic woman. As a company, AMZN is a statuesque model of growth and profitability. The company that began as a bookseller in a garage of a rented home has made its founder and CEO the richest person in the world. AMAZ’s tentacles have expanded over the past years, swallowing competitors and new businesses. The growth of the company and its earnings remain nothing short of staggering. Source: Yahoo Finance As the chart shows, during what may have been the most challenging quarter in history, AMZN reported EPS of $10.30 per share in Q2 2020 compared to average analyst estimates of $1.46. A survey of forty-four analysts on Yahoo Finance has an average price target of $3,661.68 per share, with a range of $2,646 to $4,200 per share. A continuation of gridlock in the US government is likely the base case scenario for Mr. Bezos and the futures of AMZN for the coming years. While the Democrats and Republicans would never admit agreement on any issue, both parties likely have AMZN in its crosshairs, creating a bumpy road for the shares over the coming months and years. Want More Great Investing Ideas? 7 Best ETFs for the NEXT Bull Market Is the Stock Market Correction Over? Chart of the Day- See the Stocks Ready to Breakout AMZN shares were trading at $3,175.21 per share on Monday morning, up $58.99 (+1.89%). Year-to-date, AMZN has gained 71.83%, versus a 6.63% rise in the benchmark S&P 500 index during the same period."}]}