{"article": [{"url": "https://stocknews.com/news/bp-british-petroleum-sends-a-message/", "published": 1595851700.0, "headline": "British Petroleum Sends a Message", "body": "BP sells its Alaskan production to Hilcorp BP makes the deal happen The leaders want low cost and clean production- Expect the trend to continue British Petroleum (BP) is one of the world’s leading oil companies. BP operates in three segments., The upstream segment explores for oil and natural gas, develops fields and production. It also includes its midstream operations, covering transportation, storage, processing, and marketing and trading of energy products and pipelines and processing facilities and export terminals. The downstream segment refines, manufactures, transports, supplies, and trades in crude oil, petroleum, and petrochemical products. The Rosneft segment explores and produces hydrocarbons in Russia. BP is a public company, but in many ways, it is the state oil company of the United Kingdom. BP has been around since 1889. The company had a market cap of over $76 billion at a share price of approximately $22.93 per share on July 20. BP trades an average of over 10.8 million shares each day and pays its shareholders an 11% dividend. The company recently decided to divest itself of an asset it has held since the late 1970s. BP sells its Alaskan production to Hilcorp 7 Best ETFs for the NEXT Bull MarketIn the 1970s, before fracking changed the oil business in the United States, Alaska was the new frontier for petroleum production. Alaska’s northern slope yielded massive quantities of the energy commodity. BP began pumping oil from Prudhoe Bay in 1977 and transported it over the frozen wilderness to the port of Valdez. Alaskan production is expensive. Fracking for crude oil in the Permian basin involves far lower output costs. After owning the Alaskan production for forty-three years, BP sold its interest to Hilcorp, a smaller production company, for $5.6 billion this month. BP makes the deal happen The sale was no easy feat considering the risk-off conditions created by the global pandemic. Moreover, oil companies have been the red-headed stepchildren of the stock market, as they underperformed almost all other sectors over the past years. With banks and financial institutions shying away from financing multibillion-dollar acquisitions in the current environment. BP accomplished the sale by directly lending Hilcorp the money to close the deal. BP had a market cap of around $76.4 billion at a share price of approximately $23 at the end of last week. The $5.6 billion loan is a significant allocation of capital and shows BP’s desire to shed the Alaskan asset. The leaders want low cost and clean production- Expect the trend to continue After the price carnage in the oil market in April, the price has made a comeback. Production cuts by OPEC, Russia, and other world producers have gone a long way to rebalance the petroleum market’s supply and demand equation. At the same time, US output has declined from a record 13.1 million barrels per day in March to 11.1 mbpd as of July 17, according to the EIA. The drop in the oil price caused the US rig count to decline to 181 as of July 24, 595 fewer than the previous year, according to Baker Hughes. The leading oil companies are cleaning house and shedding high priced production. In June, BP and Royal Dutch Shell announced write-downs of up to $17.5 to $22 billion, respectively, on assets. At the end of last week, both nearby WTI and Brent futures were above the $40 per barrel level. However, the credit environment for oil producers and the threat of low prices means that consolidation will continue. The weaker oil companies are likely to fall to the wayside, with their best assets going to the industry leaders. At the same time, the trend towards environmentally friendly energy sources means that only the cheapest and cleanest fossil fuels will be attractive to those companies that remain in the international crude oil business. Want More Great Investing Ideas? 9 “BUY THE DIP” Growth Stocks for 2020 Newly REVISED 2020 Stock Market Outlook 7 “Safe-Haven” Dividend Stocks for Turbulent Times BP shares were trading at $22.96 per share on Monday afternoon, up $0.03 (+0.13%). Year-to-date, BP has declined -36.47%, versus a 1.13% rise in the benchmark S&P 500 index during the same period."}]}