{"article": [{"url": "https://stocknews.com/news/afin-glad-oxlc-pdt-phk-how-to-make-60000-a-year-with-just-5-stocks/", "published": 1602158900.0, "headline": "How to Make $60,000 a Year With Just 5 Stocks", "body": "The mortgage. The car payment. The power bill. The cell phone bill. Your regular dividend check. One of these things, I’m sorry to say, is not like the others. While almost every one of your obligations comes once a month across all 12 months of the year, most stocks or funds you can invest in will pay you just four times a year. 7 \"SAFE HAVEN\" Dividend Stocks for Turbulent TimesIf you’re still working, you’re probably thinking “no big deal.” That’s true—your job pays you once or twice a month, so who cares when you collect dividends? You’re not touching your 401(k) or IRA now anyway. But retirees know the struggle. Dividend income is their income, so quarterly won’t cut it. Payouts need to be monthly, and not in lumpy, inconsistent amounts, either. The good news is, a few hundred monthly dividend stocks (and monthly dividend funds) recognize the importance of frequent, reliable distributions and have built their payout programs in the most shareholder-friendliest of ways. The bad news is, only a few offer up the amount of income retirees need too. Remember: Even if you have a million bucks saved up to live off, an average 4% portfolio yield will deliver just $40,000 in annual income, and the market doesn’t even yield half that right now. High-quality bonds? Not even close. You need real, meaningful income… …And my research has brought me across a few names that can get the job done. Today, I’m going to show you a group of monthly dividend stocks and monthly-paying funds that can generate $60,000 in annual income—not on a million-dollar nest egg, but on a mere $500,000 investment. Let’s see how many of them stand up to scrutiny. American Finance Trust (AFIN) Dividend Yield: 12.8% Real estate investment trusts (REITs) are known for their generous yields, but even by REIT standards, American Finance Trust’s (AFIN) roughly 13% annual payout is a whopper. American Finance Trust invests in nearly 850 single and multi-tenant retail properties across most of the U.S., with a focus on service retail. It covers service industries including restaurants, retail banks, gas stations and pharmacies, and traditional retail types such as auto, discount and furniture, among others. It adds in a smattering of office and distribution real estate, creating a pretty diverse portfolio anchored by names such as Home Depot (HD), Truist (TFC) and Bob Evans. Given that kind of exposure, however, it’s no surprise that AFIN has struggled mightily in 2020. American Finance Trust (AFIN): Wrong Place, Wrong Time Shares are off 46% year-to-date. The company recorded much wider net losses in Q1 and Q2 of this year than its year-ago periods, and funds from operations (FFO) dropped as well. And not only was American Finance Trust was forced to cut its monthly dividend by nearly 23% in the early months of the COVID outbreak, but even then, its most recent quarterly AFFO (20 cents per share) wasn’t enough to cover the quarterly responsibility (21.24 cents paid out across three months). A year ago, I wouldn’t have even blinked at AFIN’s portfolio. But its heavy exposure to restaurants, entertainment and a host of retailers, not to mention its office properties, is a liability given a potential “second wave” and a COVID vaccine timeline that keeps creeping backward. This could eventually end up looking like a bargain buy, but there’s too much uncertainty for retirement investors to depend on AFIN at the moment. Gladstone Capital (GLAD) Dividend Yield: 10.3% Gladstone Capital (GLAD) is one of a handful of high-yield acronyms – in this case, a business development company (BDC) that invests in lower middle market American businesses. Just don’t get it confused with its other family members, which include fellow BDC Gladstone Investment Corporation (GAIN), as well as real estate investment trusts (REITs) Gladstone Land (LAND) and Gladstone Commercial Corporation (GOOD). This particular Gladstone uses everything from revolving loans and senior term loans to minority equity to provide capital to companies with $20 million to $150 million in annual revenues, $3 million to $25 million in EBITDA, limited market and/or technology risk, and the potential to expand cash flow. Like many BDCs, Gladstone Capital was heavily impacted by COVID-19. The company lost 89 cents per share during its fiscal second quarter ended in March, delivered a return on equity of -51%, and lowered its monthly dividend by 7% to 6.5 cents per share. Its quarter ended June wasn’t as disastrous, but net investment income (NII) of 20 cents per share missed expectations and represented a decline from Q2’s 21 cents per share. That also translates to a tight 97.5% NII payout ratio – troubling considering Gladstone has already trimmed its payout. To be fair, Gladstone has long been a respectable performer among BDCs. Here’s a look at GLAD versus the broader market as well as a broad BDC exchange-traded fund, for comparison’s sake: BDCs Lag the Market, But GLAD Is Better Than Most But COVID has really set back BDCs, which deal with vulnerable smaller businesses, far more than most other industries. GLAD and Its Brothers Haven’t Recovered Gladstone could very well bounce back with a vengeance if and when the economy gets back on its legs, but a sudden impasse in Washington has kicked that can down the road, meaning danger likely will persist in the BDC space. Don’t bite now, but remember to check back in on GLAD’s situation once the economic outlook begins to clear up. Oxford Lane Capital (OXLC) Dividend Yield: 17.8% Oxford Lane Capital (OXLC) has a similar small-business problem. This closed-end fund (CEF) deals in collateralized loan obligations, or CLOs—an area of the market that most retail investors never really dip their toes into. CLOs are similar to mortgage-backed securities in that they’re pooled investments, but rather than mortgages, CLOs instead tend to be corporate loans. So in short, Oxford Lane’s investments are backed by a lot of business debt. These bundled debt obligations make for an opaque market, so it’s difficult to know what you’re getting into. But hey—for some investors, it might be worth it to blindly chase a 18% yield if OXLC has a history of delivering. Or Maybe Not Even on a total return basis, its gigantic dividend has never really helped it make up for its lack of price performance over long time periods. That’s in part because the fund gobbles up a massive 15.65% in annual expenses between management, interest expenses and “other,” according to CEF Connect data. Also consider that OXLC cut its dividend in half just a quarter ago, marking the second reduction in four years. It hurts to pass on a yield that high, but those are too many issues to overlook, especially as COVID continues to weigh on many of the businesses underlying OXLC’s investments. JH Premium Dividend Fund (PDT) Dividend Yield: 9.1% Next up is something a little more conventional. The JH Premium Dividend Fund (PDT) is an interesting blend of dividend-generating securities. Roughly half of this CEF’s assets are invested in dividend-paying common stocks, another 43% is plunked down on higher-yielding preferred stocks, and the rest is scattered across convertibles and other assets. That makes for an interesting set of holdings that includes regular ol’ utilities such as Dominion Energy (D) and Duke Energy (DUK), as well as preferreds such as CenterPoint Energy’s (CNP) 7% preferred convertibles. It then uses a healthy dose of leverage (37% currently) to juice both its yield and its performance. Over the very long term, PDT has been an extremely competitive fund that goes toe-to-toe with the market (and then some), as its performance over the past decade or so illustrates. JH Premium Dividend (PDT) Scorched the Competition After the Crisis Better still, PDT trades at a slight 1% discount to net asset value (NAV), which is a refreshing change from the 4% premium it has averaged over the past half-decade. However, leverage can really come back to bite PDT when stocks collapse like they did earlier this year. There’s Nothing Conservative About This Dividend Portfolio In short: If capital gains are any part of your retirement plan, you don’t want to rely on a fund as volatile as JH Premium Dividend. But it could serve you well if you’re content to sit on it and let the monthly dividends pile up. Pimco High Income (PHK) Dividend Yield: 10.4% Pimco is a well-established juggernaut in the fixed-income game with a slew of products that regularly put up benchmark-beating returns. So it’s understandable to be drawn to any Pimco product that can offer a yield in the double digits. Such is the case for Pimco High Income (PHK), a diversified CEF that invests across numerous fixed-income assets to generate high income. PHK’s managers play by a number of rules. No more than 25% of assets can go toward non-U.S.-dollar-denominated securities. No more than 40% can go toward emerging-market issues. And they try to keep portfolio duration between zero and eight years. Right now, Pimco High Credit has double-digit exposure to U.S. government bonds, mortgage products, junk debt, investment-grade corporates and EM bonds. The portfolio is further juiced via nearly 30% leverage. That makes for some stellar returns—depending on what time frame you invest in. A 38% Total Return Across a Decade? No Thanks. Like PDT, PHK’s gambles can mean significant declines when its bets go bad. The problem is, those failures are magnified given the lower overall returns of bonds over time. Want More Great Investing Ideas? Your Early Retirement Portfolio: 7.7% Dividends—Every Month—Forever How to Retire on 10% Dividends Paid Monthly The Simple (and Safe) Way to Earn 15% Every Year from Stocks AFIN shares were trading at $6.71 per share on Thursday morning, up $0.12 (+1.82%). Year-to-date, AFIN has declined -45.07%, versus a 8.03% rise in the benchmark S&P 500 index during the same period."}]}