{"article": [{"url": "https://stocknews.com/news/bby-deck-ebs-musa-wmt-4-great-stocks-to-add-to-your-portfolio/", "published": 1597752500.0, "headline": "4 Great Stocks to Add to Your Portfolio", "body": "When looking for a stock to invest in, there are many different factors investors and analysts can consider. For instance, factors can include growth, value, fundamental strength, efficiency, and momentum. Typically, investors only consider one or two factors when looking at a stock. A growth stock trading at a discount might be an interesting play. But what if you could find stocks that tick every box? A stock that has strong value and growth attributes has fundamental strength, efficiency, and is also trading upwards. These stocks are the cream of the crop based on multi-factor strength. To find these types of stocks, I ran a proprietary screen with multiple metrics over the various factors. This resulted in a shortlist of stocks. I then narrowed down that list with stocks rated a Strong Buy by our exclusive POWR Ratings system. 7 Best ETFs for the NEXT Bull MarketHere are four stocks that show strength in growth, value, fundamentals, efficiency, and momentum: Best Buy Co (BBY), Deckers Outdoor (DECK), Emergent Biosolutions (EBS), and Murphy USA (MUSA). Best Buy Co (BBY) BBY is one of the largest consumer electronics retailers in the U.S. The company also sells home office products, entertainment software, communication devices, security, and appliances. BBY operates in the United States, Canada, and Mexico. The company provides its customers with the option to pick a product at a store or get it delivered to their homes. Delivery is fulfilled through its distribution centers or retail stores. The company also offers a ship-from-store option that can speed up the delivery process. BBY had a decent second quarter driven by robust consumer demand. Online sales rose 255%, with customers buying computing products, appliances, and tablets. The company has focused on improving its online shopping and pick up in-store services. The company is looking to continue its “Building the New Blue: Chapter Two” initiative, which will include growth opportunities, better execution in critical areas, cost containment, and investing in people and systems. Management targets $600 million in cost reduction by fiscal 2021. For its growth factor, BBY has been steadily growing its EPS over the last five years. Its five-year EPS growth average is 18.2%, with next year’s estimate of 13.2%. The stock currently has a price/earnings ratio of 20.5, well below the industry average and the S&P 500. One way to determine a company’s financial health is through its interest coverage ratio, which determines how well it can pay interest on outstanding debt. BBY has an interest coverage of 30.9. The stock also has a return on investment capital (ROIC) of 19.9%, representing high efficiency. The company has strong performance over 1, 3, 6- and 12-month periods. BBY is rated a Strong Buy in our POWR Ratings system. It has a grade of A for three out of the four components that make up the ratings: Trade Grade, Buy & Hold Grade, and Peer Grade. It is also the #2 ranked stock in the Specialty Retailers industry. Deckers Outdoor (DECK) DECK designs and sells casual and performance footwear, apparel, and accessories. Its primary brands include UGG, Teva, and Sanuk. The company distributes most of its products through its wholesale business, but it also has a direct-to-consumer business with company-owned retail stores and websites. While the company has retail stores and distributors throughout Europe, Asia, Canada, and Latin America, most sales are in the U.S. The company’s focus on bolstering its e-commerce capabilities and investment in digital marketing helped it survive the retail lockdowns. DECK is targeting underpenetrated and profitable markets to drive growth. The company is also focused on expanding its brands, bringing innovative products to market, and targeting consumers through digital marketing. DECK is looking to open smaller concept omnichannel outlets and bolstering programs such as Retail Inventory Online, Infinite UGG, Buy Online, Return In Store, and Click and Collect to improve customer shopping experiences. DECK has a 3-year EPS growth average of 147.2%, with an EPS growth estimate of 21.6% for next year. The company has a P/E of 21.1 and an EV/EBITDA ratio of 13.6. The EV/EBITDA ratio measures a company’s enterprise or total value (EV) to its earnings before interest, taxes, depreciation, and amortization (EBITDA). It’s another tool to determine valuation. DECK has a relatively high current ratio of 3.3, which means it can pay its short-term debts. The stock has a return on assets ratio of 15.6%, which is an indicator of how profitable a company is relative to its total assets. In terms of momentum, the company has strong performance over multiple time frames. DECK is rated a Strong Buy by our POWR Ratings system. It has a grade of A for Trade Grade, Buy & Hold Grade, and Peer Grade. It is also the #5 ranked stock in the Fashion & Luxury industry. Emergent Biosolutions (EBS) EBS offers public health products to the government and healthcare providers. The company has four central units: vaccines, which produces specialty vaccines for public health threats; devices, such as nasal sprays and injections; therapeutics, which includes antibody-based treatments; and contract development and manufacturing, which brings treatments to market through collaboration with pharmaceutical and biotechnology companies and the United States government. The majority of revenue comes from U.S. government purchases of vaccines, devices, and therapeutic products. The company has signed several contract development and manufacturing deals to provide manufacturing services to companies to produce their experimental vaccine candidates against COVID-19. EBS signed a contract with Vaxart (VXRT) and Novavax (NVAX) to help them produce their vaccine candidates. The company also reached a five-year agreement for Johnson & Johnson’s (JNJ) lead COVID-19 vaccine candidate. EBS’s next-gen anthrax vaccine, AV7909, which treats post-exposure prophylaxis of anthrax disease, should bode well for the company. EBS has high growth averages over the past three years for sales (34.9%) and EPS (30.6%). The company reported EPS of $1.98 on July 30th, which was a 19,700% increase from the previous year. EBS has a forward P/E of 17.1 and an operating margin of 20.9%. Operating margin is an important measure of profitability. The stock has a current ratio of 2.7 and strong performance over multiple recent time frames. The stock is rated a Strong Buy by our POWR Ratings system. It has grades of A for Trade Grade, Buy & Hold Grade, and Peer Grade. It is the #4 ranked stock in the Biotech industry. Murphy USA (MUSA) MUSA is an American retailer of gasoline products and convenience store merchandise. The stores are 100% company-operated, many of which are adjacent to Walmart (WMT) stores. The business also includes product supply and wholesale assets, such as product distribution terminals and pipelines. The company is positioned as a low-price, high-volume fuel retailer that sells through low-cost kiosks and small stores. That business model allows it to retain high profitability. The company sells more than 4 billion gallons of retail fuel annually and owns more than 90% of its gasoline stations. By mostly owning the stations, MUSA can keep its operating expenses low. Also, the proximity of its fuel stations to WMT allows the company to leverage WMT’s strong and consistent foot traffic. The company’s sourcing infrastructure also helps the company’s bottom line. Since it has access to pipelines and product distribution terminals, MUSA can access fuel at a lower cost than its competitors. This allows it to sell fuel at a discount. MUSA has a one-year EPS growth rate of 150.9%, with a five-year average of 22.8%. In terms of valuation, the stock has a P/E ratio of 11.6 and a price to sales ratio (P/S) of 0.4, both well below the industry average. The company has a strong return on equity of 40.9% and a debt/equity ratio of 1.1. Debt/equity is calculated by dividing a company’s total liabilities by its shareholder equity. It helps determine a company’s financial strength. MUSA has shown powerful momentum over the past twelve months. MUSA is rated a Strong Buy by our POWR Ratings system. It has a grade of A in Trade Grade and Buy & Hold Grade, and a grade of B for Peer Grade and Industry Rank. It is also the #5 ranked stock in the Specialty Retailers industry. Want More Great Investing Ideas? The Best of StockNews 3 Possible Directions for the Stock Market from Here 9 “BUY THE DIP” Growth Stocks for 2020 BBY shares rose $0.21 (+0.19%) in after-hours trading Tuesday. Year-to-date, BBY has gained 27.90%, versus a 6.30% rise in the benchmark S&P 500 index during the same period."}]}