{"article": [{"url": "https://stocknews.com/news/infy-ter-lpl-ntgr-4-tech-stocks-to-buy-before-earnings-season/", "published": 1602158900.0, "headline": "4 Tech Stocks to Buy Before “Earnings Season”", "body": "Technology stocks have had a good year in 2020 due to the spread of the coronavirus and the increased demand for their products and services. The increase in remote working and remote learning, along with the digital transformation of companies, has been especially beneficial for the industry. Though the technology industry witnessed a healthy correction last month, the NASDAQ 100 Technology Sector index, which can be seen as a benchmark for the performance of technology stocks, is still up year-to-date at 19.9%. In comparison, the S&P 500 has gained only 5.8% year-to-date. The majority of technology companies have had an impressive second quarter this year, and are expected to build on those gains this earnings season, which will start later this month. So, investing in tech stocks such as Infosys Limited (INFY), Teradyne, Inc. (TER), LG Display Co. (LPL), and Netgear, Inc. (NTGR), ahead of earnings could be rewarding. 7 \"SAFE HAVEN\" Dividend Stocks for Turbulent TimesInfosys Limited (INFY) INFY offers technology, business consultancy, engineering, and outsourcing services internationally. The company also offers products and solutions to clients in various industries. INFY’s stock has gained 40.9% so far this year. INFY recently announced the development of the Infosys Health Insights Platform in collaboration with Amazon Web Services (AWS), Couchbase, and Knowi. This platform helps public health agencies improve their analytics capabilities. INFY has also announced an agreement to acquire GuideVision, which is an enterprise service management consultancy company based in Europe. For the quarter that ended in September, INFY is expected to report a rise in EPS of 7.7%. The company’s revenue is expected to grow 2% in 2021 and 8.5% in 2022. INFY’s EPS is estimated to rise 12.7% next year and at a rate of 8% per annum over the next five years. How does INFY stack up for the POWR Ratings? A for Trade Grade A for Buy & Hold Grade A for Peer Grade B for Industry Grade A for Overall POWR Rating The stock is also ranked #1 out of 14 stocks in the Outsourcing – Tech Services industry. Teradyne, Inc. (TER) TER offers automation solutions for industrial and test applications. Teradyne Automatic Test Equipment can be used to test wireless products, data storage and complex electronic systems, semiconductors, and so on. TER’s stock has gained 20.7% year-to-date. During the second quarter, TER’s revenue rose 49% as compared to the same period in 2019. The company also released guidance stating that it expects the third quarter to see a 33% increase in growth compared to the third quarter of last year. The company expects to make increased memory and storage test shipments, along with the increase in production. TER has also successfully started large scale production of its new Magnum EPIC memory tester. The consensus estimates for TER’s revenue and EPS indicate year-over-year growth of 32.3% and 45.5%, respectively for the quarter that ended September 2020. The company’s revenue is expected to grow 24.2% in 2020 and 4% in 2021. TER’s EPS is estimated to rise 36.4% this year and at a rate of 16.6% per annum over the next five years. TER is rated a “Buy” in our POWR Ratings system, with a grade of “A” in Industry Rank. In the 86-stock Semiconductor & Wireless Chip industry, it is ranked #37. LG Display Co. (LPL) LPL develops, manufactures, and sells thin film transistor liquid crystal display panels worldwide. The company also supplies OLEDs and flexible displays. LPL’s stock has gained 74.3% since hitting its low in mid-March. LPL has recently patented a rollable OLED device. This device might serve several purposes, and could drive future growth for the company. The company has also recently expanded production of OLED devices in its Paju facility. During the second quarter, LPL recorded a 12% increase in revenue quarter-on-quarter. The increase in earnings was due to increased panel shipments caused by remote working and education. It is estimated that LPL will deliver the best third quarter results in 11 years this earnings season. The company’s revenue is expected to grow 12% in the quarter that ended September, 2020. LPL’s revenue for the about-to-be-reported quarter is expected to increase 12% year-over-year. The company’s EPS is estimated to rise 68.5% this year and at a rate of 9.4% per annum over the next five years. LPL’s strong fundamentals are reflected in its POWR Ratings. It has a “Buy” rating with a grade of “A” in Trade Grade. Within the Technology – Electronics industry, it’s ranked #5 out of 38 stocks. Netgear, Inc. (NTGR) NTGR offers network attached storage devices, internet protocol security cameras, and home automation devices and services. NTGR’s stock has returned 30.7% so far this year. NTGR has recently launched the Orbi WiFi 6 Tri-band Mesh system, which is designed to provide high speed cable internet and wi-fi in a single device. The company has also released the Insight Managed Business Router, which allows small businesses and remote offices to access their company intranet securely and quickly. During the second quarter, the company reported a rise in revenue of 21.3% compared to the same period last year. NTGR has announced that they will hold their third quarter earnings call on October 21st. The company’s revenue is expected to grow 17.9% in the third quarter and 14.3% in 2020. NTGR’s EPS is estimated to rise 1.5% in the third quarter to $0.66. Moreover, the market expects the company’s EPS to grow 11.8% this year and at a rate of 54.8% per annum over the next five years. It’s no surprise that NTGR is rated a “Buy” in our POWR Ratings system, with a grade of “A” in Trade Grade and Peer Grade. In the 53-stock Technology – Communication/Networking industry, it is ranked #7. Want More Great Investing Ideas? 7 Best ETFs for the NEXT Bull Market What is the Cure for Stock Market Volatility? Chart of the Day- See Christian Tharp’s Stocks Ready to Breakout INFY shares were trading at $14.79 per share on Thursday afternoon, up $0.25 (+1.72%). Year-to-date, INFY has gained 44.94%, versus a 8.21% rise in the benchmark S&P 500 index during the same period."}]}