{"article": [{"url": "https://stocknews.com/news/unh-moh-hum-3-outperforming-insurance-stocks-to-invest-in-now/", "published": 1597752500.0, "headline": "3 OUTPERFORMING Insurance Stocks to Invest in Now", "body": "Insurance isn’t exactly an exciting business, but that’s exactly what makes it a great investment. After all, it’s one of the main ways that Warren Buffett was able to accumulate his fortune. Currently, health insurance stocks are exciting, as they are coming off years of underperformance as investors chase tech stocks. However, their earnings and revenues have continued to grow which has made their valuations even more attractive. StockNews has sorted through the pool of insurance stocks to highlight the best names that should outperform in the coming months – UnitedHealth Group (UNH), Humana (HUM), and Molina Healthcare (MOH). 7 Best ETFs for the NEXT Bull MarketUnitedHealth Group (UNH) Healthcare insurance, services, and products are some of the few investment bright spots amidst the global pandemic. After all, people need healthcare, UNH has emerged as one of the more attractive insurance stocks. The POWR Ratings show UNH has A grades in each of its POWR Components but for its Industry Rank of B. UNH is ranked first of nine stocks in the Medical – Health Insurance space. The analysts are anticipating UNH will reach a price point of $350 shortly, increasing nearly 10%. Out of the 17 analysts who have reviewed UNH, 15 recommend buying it, two recommend holding and none recommend selling. If you are hesitant to invest in UNH, consider the fact that the company generated more than $16 billion worth of free cash flow last year alone. The company’s cash position exceeded $24 billion after the first quarter of 2020. More than one-quarter of the company’s aggregate revenue stems from its Medicare business. Look for UNH to zoom past its 52-week high of $324 in the weeks ahead. Humana (HUM) The uncertain healthcare insurance industry has the potential to change quite significantly in the years ahead as public policy is altered. When in doubt, invest in a health insurer that makes money from private employer health insurance groups, individuals who pay for health insurance on their own, and government-sponsored programs. HUM has such a diversified approach to healthcare insurance and corresponding revenue. All in all, HUM is ranked second of nine stocks in the Medical – Health Insurance category, highlighted by A grades in the Buy & Hold and Trade Grade POWR Components. HUM has B grades in the Industry Rank and Peer Grade POWR Components. The analysts have set a price target of $447.67 for HUM, indicating it has nearly 7% upside remaining. HUM’s reasonable forward P/E ratio of 22.41 makes the stock all the more attractive. Add in the fact that HUM has increased its revenue each year since ’05 but for ’17 and it is that much easier to understand why investors are so bullish on the stock. The company’s revenue was up 14% last year, generating a net income slightly below $3 billion. The bottom line is America’s aging population bodes well for HUM. Buy this stock, hold it for years and you will likely be more than pleased with its payout. Molina Healthcare (MOH) Health services will be in demand no matter how bad the economy gets. This fact bodes well for the future of MOH. MOH specializes in providing government-sponsored health services with a focus on Medicare and Medicaid. In other words, MOH will only get busier as time progresses and that many more people lose private health insurance due to the economic recession that has no end in sight. The POWR Ratings show MOH has A grades in its Buy & Hold and Trade grade POWR Components. The stock has B grades in the remaining two POWR Component categories of Industry Rank and Peer Grade. The analysts are quite bullish on MOH, setting an average price target of $211.14 for the stock. Out of the seven analysts who have studied MOH in-depth, half a dozen insist the stock is a Buy, one advises holding and none advise selling. If MOH reaches the analysts’ price target, it will have increased by 8%. MOH has steadily climbed higher following a brief coronavirus dip yet its forward P/E ratio is merely 16. MOH’s year-over-year bottom line has increased by 54% on a year-over-year basis. This evidence further strengthens the stock’s potential for ongoing growth. Want More Great Investing Ideas? The Best of StockNews 3 Possible Directions for the Stock Market from Here 9 “BUY THE DIP” Growth Stocks for 2020 UNH shares were trading at $318.36 per share on Tuesday morning, down $2.15 (-0.67%). Year-to-date, UNH has gained 9.23%, versus a 6.23% rise in the benchmark S&P 500 index during the same period."}]}