{"article": [{"url": "https://stocknews.com/news/anss-what-investors-are-missing-about-the-economy/", "published": 1597838900.0, "headline": "What Investors Are Missing About the Economy", "body": "The U.S. Economy Is Defying Expectations Since its March 23 low, the stock market has put on a rollicking rally. Of course, this is less of a rally and more of the market making up for lost ground from a punishing fall in February and March. Once the severity of the coronavirus pandemic became clear, the stock market plunged. Over the space of about a month, the S&P 500 shed a third of its value—one of the worst bear markets on record. The selling stopped once the Federal Reserve said it would do everything it could to get the economy going. 7 \"SAFE HAVEN\" Dividend Stocks for Turbulent TimesThe Fed’s efforts worked. Since then, the stock market has made an impressive recovery. The index is up more than 50% from its low. But the question now is: can it continue? Goldman Sachs thinks it can. The powerful investment house recently raised its target for the S&P 500 from 3,000 to 3,600—that’s a big increase. Goldman isn’t alone; a few other Wall Street strategists have also bumped their forecasts. Goldman’s David Kostin wrote: “Looking forward, a falling equity risk premium will outweigh a rise in bond yields, and combined with our above-consensus EPS forecast, will lift the S&P 500 Index to 3,600 by year-end.” That’s a fancy way of saying that investors are no longer afraid of the market. Winning the Expectations Game To be sure, the point is not that the economy is doing well overall. There are still millions of unemployed and underemployed Americans. Also, many companies have gone under since the lockdown began. Rather, the key point is that the economy may be doing better than expected, and investing is all about an expectations gain. For example, if we look at some recent economic reports, we can also see some tentative signs that the economy is getting better. Last Friday’s retail sales report, for example, showed that Americans are still willing to shop. For July, retail sales rose by 1.2%. Though this was below estimates of 2.3%, if you exclude automobile sales, retail sales were up 1.9%. That beat estimates of retail-minus-auto sales by 0.7%. This is key because consumer spending drives a large part of the U.S. economy. Here’s another key data point: Last week’s jobless claims fell to 963,000—the first time in 20 weeks that it was below one million. Economists had been expecting 1.1 million. Long-term bond yields have been climbing higher recently as well. Remember that Kostin mentioned the rise in bond yields. This usually aligns itself with an improved economic outlook. Once again, it’s not that bond yields are high. Instead, it’s that the increase is off a very pronounced low. On August 4, the yield on the 10-year Treasury got down to 0.52%, which is incredibly low. In fact, Deutsche Bank noted that it’s a 234-year low. Lately, the 10-year has been yielding more than 0.7%. It shouldn’t be much of a surprise that bond yields have moved higher, alongside inflation. Last week’s CPI report showed that consumer prices rose by 0.6% in July, double what Wall Street had been expecting. Not only that, but it comes on top of a 0.6% increase in June. But here’s what really caught my attention. The “core rate” of inflation, which excludes volatile food and energy prices, also rose by 0.6% in July. That’s the largest one-month increase since January 1991. Economists like to look at the core rate because food and energy prices can move around a lot and give a misleading picture of the true underlying trend of inflation. Another area that’s been surprisingly strong has been residential construction. An index for homebuilder optimism increased from 72 (in June) to 78, its highest level in more than 20 years. Bloomberg notes that an index of homebuilding stocks is up more than 140% since the March low. Ansys Subhead Ansys (ANSS) One stock that’s well-positioned to ride the recovery is Ansys (ANSS). The company makes simulation software which lets engineers create, experiment with, and test new designs before anything is built. Their software gives designers tools that were unimagined a few years ago. Business is going well. For Q2, Ansys reported revenue of $389.7 million and earnings of $1.55 per share, crushing Wall Street’s estimate of $1.16 per share. Ajei Gopal, Ansys president and CEO, said: “Q2 was a very strong quarter for Ansys, with revenue, operating margins and earnings exceeding the high end of our financial guidance. I’m excited that during the quarter we closed both the largest deal in our 50-year history as well as our largest sales agreement for new business. These results demonstrate the strength and resilience of our business and give us confidence for the future.” For Q3, Ansys expects earnings of $1.10 to $1.34 per share on revenue between $347 million and $377 million. For the full year, Ansys sees earnings ranging between $5.75 and $6.35 per share on revenue of $1.570 billion to $1.645 billion. That’s an increase from the previous range of $5.61 to $6.23 per share. Wall Street had been expecting $5.93 per share on revenue of $1.59 billion. Best of all, Ansys now has a backlog of $846 million. That’s up 18% from a year ago. I expect to see more great news from Ansys is the months ahead. Want more great investing ideas? Download free the “10-Step Options Trading Checklist” you need before making a trade. The Virtual Trading Pit Is Open: Trade Set-ups, Training, New Trading Ideas How to Try Out Options Without Risking a Penny ANSS shares were unchanged in after-hours trading Wednesday. Year-to-date, ANSS has gained 24.13%, versus a 5.86% rise in the benchmark S&P 500 index during the same period."}]}