{"article": [{"url": "https://stocknews.com/news/ung-boil-kold-the-natural-gas-futures-market-moves-into-winter-mode/", "published": 1601986100.0, "headline": "The Natural Gas Futures Market Moves into Winter Mode", "body": "October futures rolled to November Natural gas for delivery in January 2021 remains well above the November 2019 high Stocks are bearish- Production and the election could be bullish Levels to watch over the coming weeks The price of nearby November natural gas futures fell by over 40 cents per MMBtu since September 24, but the price remained significantly above where the October futures contracts were trading when it expired last week. Contango is a premium for a commodity for deferred delivery. The contango between the October and November futures reflected the change from the injection to the natural gas market’s withdrawal season. Inventories tend to rise from March through early November each year. Producers increase output to build stockpiles for the peak season of demand during the coldest winter months. When the temperature drops, so do the amount of natural gas in storage across the United States. This year, stockpiles have risen to the highest level in years, and are approaching a record level. Meanwhile, the high level of contango between the October and November contracts likely caused the November futures to begin to decline as October rolled off the board and expired. The United States Natural Gas Fund (UNG) tracks the price of NYMEX natural gas higher and lower. The BOIL and KOLD ETN products seek to provide double leverage compared to the price action in the futures for the energy commodity. 9 \"BUY THE DIP\" Growth Stocks For 2020October futures rolled to November Last week, October natural gas futures rolled to November. The spread traded to a high of over an 80 cents contango or premium for November futures and expired at around a 60 cents contango. Source: CQG The chart shows a considerable premium for the November futures contract. Since September 24, the November futures contract has been trending lower. Source: CQG As the daily chart shows, November NYMEX natural gas futures were just below the $2.44 per MMBtu level on Friday, October 2. The nearby contract traded to a lower low on the final day of last week at $2.373. The low on Friday was the lowest level for November natural gas since July 28. Open interest has remained stable and was at the 1.272 million contract level at the end of last week. Price momentum and relative strength indicators were below neutral readings. The increased daily trading ranges pushed daily historical volatility to over 80% after the metric was down at under 30% in mid-September. Natural gas for delivery in January 2021 remains well above the November 2019 high Seasonality in the natural gas futures market kept the January peak season contract at over $3 on October 2. Source: CQG At $3.138 per MMBtu, natural gas for delivery in January 2021 was trading at a 70 cents premium to the November 2020 contract. The continuous futures contract in the natural gas market rose to a peak of $2.905 in November 2019 at the start of the 2019/2020 peak season. The level continues to stand as medium-term technical resistance in the energy commodity. The price of January futures at $3.138 was 23.3 cents above the November 2019 high at the end of last week. The November contract has been falling since September 24, eating away at the contango between the now active month and expired October contract. The level of inventories could cause the same price action for the December and January contracts over the coming weeks. December futures were trading at over a 55 cents premium to the November contract on Friday. Stocks are bearish- Production and the election could be bullish Last week, the Energy Information Administration reported that natural gas in storage across the United States rose to 3.756 trillion cubic feet. The inventories rose above the high from late 2019, which was at 3.732 tcf. With seven weeks to go until the start of the withdrawal season, reaching the four trillion cubic feet level for the third time since the EIA began reporting inventories requires an average injection of 34.9 bcf. According to Estimize, a crowdsourcing website, the current consensus estimates for a build in stocks for the week ending on October 2 is at the 78 bcf level. Natural gas stocks at over four tcf and a record high before the beginning of the peak season for demand during the winter months is looking highly likely. On Friday, October 2, Baker Hughes reported that the number of natural gas rigs operating stood at 74, one lower than the previous week, and 70 lower than last year’s level. The decline in rigs is a sign of lower output, but the level of inventories points to falling demand. The bottom line is that the amount of natural gas in storage across the US will go into the winter months at the highest level in years, or a record level. The election on November 3 will determine the future of US energy policy. Last Friday, President Trump tested positive for COVID-19. Over the coming month, we should expect more surprises as the stakes in the election are high. The uncertainty over the future of the regulatory environment in energy could cause lots of volatility in oil and natural gas futures markets in October and beyond. Levels to watch over the coming weeks I expect a continuation of high levels of price variance in the natural gas arena over the coming weeks. Source: CQG The daily chart of November futures shows that technical support is at $2.253 and $2.133. Below the low end of the range, the continuous contract traded down to $1.605 in late July and $1.432 per MMBtu in late June 2020. On the upside, resistance on the continuous contract stands at $2.905, the high from November 2019. On the November 2020 contract, the $2.928 and $3.002 levels were the highs from September 24 and September 4. Fasten your seatbelts as we could see lots of price action in the natural gas futures arena over the coming weeks and months. Want More Great Investing Ideas? Do NOT Buy Stocks Before the Election! 7 “Safe-Haven” Dividend Stocks for Turbulent Times Chart of the Day- See Christian Tharp’s Stocks Ready to Breakout UNG shares were trading at $11.56 per share on Tuesday morning, down $0.31 (-2.61%). Year-to-date, UNG has declined -31.44%, versus a 7.10% rise in the benchmark S&P 500 index during the same period."}]}