{"article": [{"url": "https://stocknews.com/news/spy-qqq-how-to-profit-in-the-markets-with-the-election-just/", "published": 1600776500.0, "headline": "How to Profit in the Markets With the Election Just 7 Weeks Away", "body": "Back in my youth, while I whiled away the days in the bond pit on the floor of the “Chicago Board of Options Exchange (CBOE)” there were several days marked on the calendar each month as “most important.” In other words, you better show up early — prior to the start of the 7:15 am CT trading day — if you wanted a foothold in the trading pit to participate in what surely was going to be “The Most Import Number” released that month or year. Sometimes, these MIN (Most Important numbers) lived up to the billing. But, mostly not. The item at hand changed from money supply to inflation date to employment rates. But all-in-all, the reaction was more of a knee-jerk than truly trend shifting — let alone mind-bending. The upcoming presidential election is now the next “most important event” on the calendar and everyone is likely overplaying it as a crucial or lasting market driver. [SPECIAL Sale Extended] Learn about the One-Month $19 Trial Offer Our Market Experts Are Ranting & Raving About —the Options360 Service! 9 \"BUY THE DIP\" Growth Stocks For 2020Certainly, the options market, as measured by the “CBOE VIX (VIXY),” has been building in a big premium in anticipation of the big event. As you can see, the VIX term structure has a large “election” hump that is priced for the event. But, isn’t this election a closely contested binary choice between two starkly different world views and economic philosophies, complicated by fears about election integrity and a delayed outcome? DO NOT Miss Out! Click here and try Options360 for just $19 — Before It’s Too Late Sure. But one reason to believe the election is overplayed as a decisive and exploitable market swing factor is that investors always overplay elections, and they rarely prove to be instrumental inflection points for economic or market cycles. In order to treat an election as a specific catalyst for investment moves, one would have to handicap the result, anticipate Congress’s makeup, intuit the key policy priorities, evaluate the likelihood of them becoming law, estimate their economic impact, and then determine how much of this decision tree has already been priced into financial markets. Sound doable? Think the prospect of capital-gains tax rate hikes with Biden as president would knee-cap stocks? Maybe there’d be a flurry of front-loaded selling. But, capital gains tax increases in 1986 and 2013 didn’t derail strong bull markets. And, famously, Wall Street wisdom had it wrong in 2016, when a Donald Trump win was viewed as dangerous for stocks. The SPY quickly reversed a 7% overnight loss and repriced for higher nominal growth, lower taxes, and less fiscal restraint. This set off a new bull market. One of the market’s more identifiable patterns isn’t how they react to elections, but how they behave leading up to them. From this standpoint, I’d expect stocks to have a limited upside over the next few weeks. Given recent gains in the major indices and the unknowns regarding the election and how a potential second wave of COVID might play out, I’d expect money managers to pull in their horns and take a defensive stance. This can be seen in the amount of hedging occurring in the options market. Even as indices and individual stocks pushed to new highs in August, the VIX and put/call ratio were providing readings suggesting that portfolio protection was firmly in place. For my part, I’ve been taking advantage of the pumped-up premium by establishing credit spreads and iron condors in names such as “IBM (IBM)” and the QQQ, which I will close before the election date. [Last Chance] Take Advantage of this Exclusive $19 Trial Offer to the Options 360 Service! Want More Great Investing Ideas? 7 Best ETFs for the NEXT Bull Market Stock Market Outlook: Before & After the Election Chart of the Day- See the Stocks Ready to Breakout SPY shares were trading at $329.39 per share on Tuesday afternoon, up $2.42 (+0.74%). Year-to-date, SPY has gained 3.39%, versus a % rise in the benchmark S&P 500 index during the same period."}]}