{"article": [{"url": "https://stocknews.com/news/gdot-rpay-mitk-3-strong-fintech-stocks-that-will-continue-to-soar/", "published": 1597925300.0, "headline": "3 Strong Fintech Stocks that Will Continue to Soar", "body": "The fintech (financial technology) industry has significantly replaced the outdated system of making financial transactions. It has changed the way we buy groceries or deposit money at banks. The ongoing pandemic and the consequent “new normal” have given a solid boost to the industry’s growth, with more consumers shifting toward a cashless economy. As the world continues to evolve throughout this pandemic, the dependence on fintech companies has been increasing, helping their stocks significantly outperform the market. The Global X FinTech ETF (FINX), which covers several fintech areas, has gained more than 80% since its mid-March lows, significantly outperforming the S&P 500’s 46% return over this time. Green Dot Corporation (GDOT), Repay Holdings Corp. (RPAY), and Mitek Systems, Inc. (MITK) are three fintech stocks that could reach new highs. 7 Best ETFs for the NEXT Bull MarketGreen Dot Corporation (GDOT) GDOT is a fintech and bank holding company that is empowering people towards non-traditional banking products by providing reliable and affordable debit accounts that make everyday banking hassle-free. Its BaaS (Banking as a Service) platform is growing among America’s most prominent consumer and technology companies to design and deploy their own bespoke banking solutions to their customers and partners such as the Apple Pay Cash platform, Walmart’s (WMT) financial division, or Uber’s (UBER) Instant Pay. GDOT had an excellent second quarter as the company added more than 510,000 new customers during the on-going crisis, and registered a 9% growth in its customer base compared to the previous quarter. Revenues grew 13.6% year-over-year to $316 million as the purchase volume spiked 31% year-over-year to $8.5 billion. GDOT generated $57.4 million cash flow from operations while the free cash flow for the firm increased by 25.5% to 41.7 million. GDOT has an impressive earnings surprise history with the company beating EPS estimates in each of the trailing four quarters. The company reported EPS of $0.43 in the second quarter, beating the consensus estimate by 34%. The EPS is expected to grow 21% next year. The stock hit a low of $14.2 on March 18th and has recovered more than 267% to close yesterday’s trading session at $52.12. Moreover, GDOT has gained 123% year-to-date. How does GDOT stack up for the POWR Ratings? A for Trade Grade A for Buy & Hold Grade A for Peer Grade A for Industry Rank A for Overall POWR Rating. You can’t ask for better. It is ranked #6 out of 45 stocks in the Consumer Financial Services industry. Repay Holdings Corp. (RPAY) RPAY provides integrated payment processing solutions to industry-oriented markets. The company offers a range of solutions relating to electronic payment methods, including credit and debit processing, automated clearing house processing, and instant funding. RPAY has recently acquired cPayPlus, LLC, an accounts payable (AP) automation provider, to expand its footprint in the AP automation space and strengthen its B2B payments offerings. Furthermore, the company acquired Ventanex, an integrated payments solution provider earlier this year to expand its presence in the B2B healthcare market. The inclination toward digital payment solutions was evident in RPA’s second quarter results. Card payment volume increased 63% year-over-year to $3.6 billion. Revenue was $36.5 million, a 68% improvement from the year-ago quarter. Gross profit for the quarter also increased 63% year-over-year to $27.8 million. The company generated $0.85 million in cash flow from operations. RPAY closed yesterday’s trading session at $25.81. With a year-to-date gain of 76%, the stock is trading at a 7.5% discount to its 52-week high of $27.93. RPAY is rated a Buy in our POWR Ratings system, consistent with its strong momentum. It holds a grade of A in Trade Grade, and a B in Buy & Hold Grade, Peer Grade, and Industry Rank. It is ranked #32 out of 156 stocks in the Financial Services (Enterprise) industry. Mitek Systems, Inc. (MITK) MITK develops and sells mobile image capture and digital identity verification solutions. The company’s solutions are embedded in mobile apps and browsers to facilitate online user experiences, fraud detection, and compliant transactions. It offers Mobile Deposit that enables individuals to remotely deposit checks using their smartphones; and Mobile Verify, an identity verification solution. The company operates in the United States, Europe, Latin Americas, and internationally. It has over 80 million users availing the mobile capturing solution and over 7,500 customers globally across financial services, fintech, and marketplaces. The most recent financial result reported by MITK was for its third quarter ending in June. Revenues increased 16% year-over-year to $25.4 million. Transactional software as a service (SaaS) revenue stood at $7.6 million, growing 42% year-over-year, while the ID revenue and deposits revenue grew 23% and 13%, respectively. MITK’s free cash flow increased 802% year-over-year to $8.9 million. Moreover, MITK has an impressive earnings surprise history with the company beating EPS estimates in each of the trailing four quarters. The company reported EPS of $0.16 for the second quarter, beating the consensus estimate by 60%. The EPS is expected to grow 33% for the current year. The stock has gained more than 68% year-to-date and closed yesterday’s trading session at $12.87. The stock has recently gained momentum and is hitting fresh highs every day. MITK is already up more than 144% from its March lows. It’s no surprise that MITK is rated a Strong Buy in our POWR Ratings system. It also has a grade of A for Trade Grade, Buy & Hold Grade, Peer Grade, and Industry Rank. MITK is ranked #18 out of 84 stocks in the Software – Application industry. Want More Great Investing Ideas? The Best of StockNews 2 Step Process to Sell @ Market Top in September 9 “BUY THE DIP” Growth Stocks for 2020 GDOT shares were trading at $51.66 per share on Thursday afternoon, down $0.46 (-0.88%). Year-to-date, GDOT has gained 121.72%, versus a 6.02% rise in the benchmark S&P 500 index during the same period."}]}