{"article": [{"url": "https://stocknews.com/news/tsla-solo-plug-3-electric-vehicle-stocks-to-buy-in-july/", "published": 1594123700.0, "headline": "3 Electric Vehicle Stocks to Buy in July", "body": "In 2020, climate change is a topic in the hearts and minds of people throughout the world. The ramifications of climate change and damage it could do to our planet is quite scary to think about. One of the ways of reducing climate change is to scale down our use of carbon emissions by putting more electric vehicles on the road. This is something that we’re already seeing take hold. The International Energy Agency predicts that the global fleet of electric vehicles will increase to around 130 million by 2030. Two ways to invest in this burgeoning industry is in the stocks of car manufactures and the stocks of companies that produce electric vehicle parts. The KraneShares Electric Vehicles and Future Mobility Index ETF (KARS), an index composed of electric vehicles, is up 14.7% for the year, so you can see it’s an industry worth looking at. 7 \"SAFE HAVEN\" Dividend Stocks for Turbulent TimesHere are three electric vehicle stocks to consider: Tesla (TSLA) TSLA recently announced better-than-expected car deliveries in the second quarter. The company delivered 90,650 cars during this period. That number was way ahead of analyst estimates of 72,000 deliveries. This is especially remarkable since it occurred during a quarter when the company’s top U.S. factory was shut down the first half of the quarter. TSLA suddenly has a chance of fulfilling 500,000 vehicles a year, which was its outlook for 2020 before COVID-19. The announcement resulted in analyst upgrades. JMP Securities raised its price target by $450 to $1,500 per share. TSLA is looking at technological advances to generate more revenue. The company recently announced that it increased the cost of its self-driving option by $1,000 for a new price of $8,000 even though it hasn’t received final approval. TSLA CEO Elon Musk believes the real value of autonomous driving is closer to $100,000. So, consumers should expect the price for that option to increase as the company gets near a final approval. TSLA is one of the top rated stocks in our momentum based POWR Ratings system . Overall, it is the #1 ranked stock in the Auto & Vehicle Manufacturers industry. The stock is currently up 227.9% year to date. The stock is loved by investors, so it’s hard to imagine that momentum will stop this month. Electrameccanica Vehicles (SOLO) SOLO is a Canadian-based manufacturer of electric vehicles. Unlike TSLA, these vehicles are more compact. The company’s flagship car is the Solo, which is a three-wheel electric vehicle that seats only one person. The theory is that so many people commute to their jobs alone, they only need a small vehicle. The Solo car has a range of 100 miles and a charge time of 2 and a half hours. The car has a top speed of 80 mph and can reach 0 mph to 60 mph in 10 seconds. The Solo car offers a Bluetooth stereo, a heated seat, and a rear-view camera. The company recently reported that sales in the first quarter rose from 101,404 CAD to 116,831 CAD . The company has a 5-year Growth Estimate of 24.1%. SOLO is planning to build a U.S.-based assembly plant and is in development for its first electric micro car. Plug Power (PLUG) Plug Power Inc., a well known company in the green-power market, provides hydrogen fuel cell turnkey solutions for the electric mobility and stationary power markets in North America and Europe. Hydrogen cells have long been considered a clean energy source. The technology has been slow to catch on due to various reasons such as safety concerns and a lack of charging stations. That is about to change. Hydrogen fuel cells have become safer over the past couple due to technological improvements and are gaining traction in the material handling industry. In this industry, the fuel cells deliver more power for a longer period of time and at a lower cost than electric batteries. For instance, Amazon (AMZN) and Walmart are using PLUG’s forklifts in their warehouses. What does this have to do with electric cars? A report from the Department of Energy anticipates that by the year 2040, fuel cell electric vehicles will be a less expensive option for the majority of light duty vehicles than battery electric engines. Barclays analyst Moses Sutton has named PLUG “the elder statesmen of a long-awaited, emerging U.S. hydrogen economy.” PLUG is poised to become a major player in the electric vehicle industry. How does PLUG fare in the POWR Ratings? A for Trade Grade A for Buy & Hold Grade B for Industry Rank A for Peer Grade A for overall POWR Rating That’s pretty good for stock ranked #5 in the Industrial – Equipment industry. The stock is up 215.8% year to date and was on fire Monday returning 9.7%. Want More Great Investing Ideas? 9 “BUY THE DIP” Growth Stocks for 2020 Is the Bull S#*t Rally FINALLY Over? 7 “Safe-Haven” Dividend Stocks for Turbulent Times Top 3 Investing Strategies for 2020 TSLA shares rose $26.42 (+1.93%) in premarket trading Tuesday. Year-to-date, TSLA has gained 232.51%, versus a -1.01% rise in the benchmark S&P 500 index during the same period."}]}