{"article": [{"url": "https://stocknews.com/news/u-shop-like-shopify-unity-software-has-multibagger-potential/", "published": 1601640500.0, "headline": "Like Shopify, Unity Software Has MULTIBAGGER Potential", "body": "Unity Software (U) had its IPO a couple of weeks ago and it has had an impressive debut. It was originally slated to open around $35 but it actually opened at $68 due to better than expected demand. In its first couple of days of trading, it reached a high of $102 before backing off to about $85. This early performance is not entirely surprising as there are many attractive things about the company. For one, it gives investors exposure to video games which are one of the fastest-growing industries. And Unity Software is adding users and increasing sales at a steady clip. Unity has a unique business model. It is a platform-based company that makes money when its users are successful. Meaning, Unity offers a platform that lets creators build, render, and operate interactive and real-time 3D content. Currently, it’s primarily used for video games. 7 \"SAFE HAVEN\" Dividend Stocks for Turbulent TimesUnity Software has also been helped by the bullish environment for IPOs and high tech stocks. However, to value a company and understand its potential, it’s always helpful to compare it to its peers. This is hard for Unity because its business model is different than most companies. Within the gaming sector, its closest peer and competitor is Epic Games. However, Epic Games is private, so it’s not possible to get an in-depth look at its financials. Additionally, the company derives the bulk of its revenue from publishing rather than from its platform for video game developers. So it’s helpful to look at other industries to find similar examples. Although it might not seem counterintuitive, Unity has some striking parallels with Shopify (SHOP). Similar Business Model and Upside SHOP has been one of the most successful stocks and companies in recent years. Since its IPO in 2015, SHOP is up 3,295%. Over this period, it’s grown revenues from $144 million to $2.1 billion on a trailing 12-month basis. Like Unity, Shopify is more than a business. Both companies are building ecosystems that are empowering others to build businesses by giving them tools, a platform, and guidance. Shopify is doing this for eCommerce, while Unity is building the same type of product for video game creators. Shopify has simplified the process and reduced the barriers for a business to sell online. For both, the upfront, basic product is free, but then it has multiple paths to monetization if a user is successful. SHOP will sell higher-value services like marketing, finance, logistics, design, etc. Unity has a very similar business model. It lets developers build their games for free. And, if these games gain a following then, Unity makes money. This means both sides’ incentives are aligned. It also provides value-added services like helping users monetize games and find advertising. In addition to a similar business model, Unity shares two more positive traits with Shopify that could result in similar outperformance: expanding total addressable markets and platform-based stocks with high-growth and high-margins. Expanding Markets Both e-commerce and video games are growing markets. Since 2001, eCommerce sales have grown between 10 and 40% every year. In 2001, eCommerce accounted for 1% of retail sales. Now, it’s closer to 30% due to the coronavirus but was around 15% prior to the pandemic. Video games are in a secular uptrend as well. Gaming is increasing in popularity in terms of the number of gamers and the amount of time spent. Video game spending has more than doubled over the last 10 years. Unity Software and Shopify are providing other businesses with the tools to take advantage of the opportunity created by this change in the economy. Just like during the Gold Rush, the most successful weren’t those prospecting for gold, but the people selling them clothes, equipment, and other services. Unity also has an additional opportunity, since its software is used for cloud, mobile, and tablet gaming which are the fastest parts of gaming. The company is also working on VR and AR applications for its technology which could be future sources of growth. It also believes that the 3d content which can be created on its platform will eventually find uses in all types of industries. Platform Stocks Shopify and Unity are both platforms. The platform gets more valuable with more user growth. As more users join, Shopify and Unity can keep iterating and improving the tools it offers its users. As users make more money, they are more likely to purchase the platform’s higher-end products and services. Already, Shopify has had much success as it has 1.2 million users. In the last quarter, they accounted for $30.1 billion in gross merchandise volume. Unity has also been quite successful. It has 1.5 million active users. More than half of the top 100 games in the Apple and Google app stores were made on Unity’s platform. Additionally, half of the top 100 console games are also created on Unity. Many video game companies are also moving to Unity’s platform since it allows them to focus on creating games rather than developing software to build games. This demonstrates the capability and power of Unity’s game development engine. Conclusion The real secret to these companies’ success is that they are building ecosystems that are helping their users become more successful. The user growth and platform attracts more users, and it also gives Shopify and Unity resources to improve the platform. On top of this burgeoning asset, the core business is also doing well in terms of growth and margins. This means that they will be able to deliver stellar earnings, once their growth phase is over. Over time, they will also figure out new and more effective ways to monetize users. In the end, these companies are also providing a valuable service to the world by democratizing access to e-commerce and video game development. They will likely be two of the biggest winners of the growth in video gaming and e-commerce. Want More Great Investing Ideas? Do NOT Buy Stocks Before the Election! 7 “Safe-Haven” Dividend Stocks for Turbulent Times Chart of the Day- See Christian Tharp’s Stocks Ready to Breakout U shares were trading at $84.16 per share on Friday afternoon, down $0.40 (-0.47%). Year-to-date, U has gained 23.13%, versus a 5.47% rise in the benchmark S&P 500 index during the same period."}]}