{"article": [{"url": "https://stocknews.com/news/acb-apha-aurora-cannabis-continues-to-slide-as-it-announces-fresh-cuts/", "published": 1595333300.0, "headline": "Aurora Cannabis Continues to Slide as It Announces Fresh Cuts", "body": "Aurora Cannabis (ACB) continues to scale back its European operations as part of its lower cost transformation plan. ACB is aggressively doing everything in its power to minimize SG&A expenses to become a lean, efficient business. On Monday, a spokesperson for ACB said about one-quarter of the workforce in select countries, and the company’s European regional office would be eliminated as a result of the decision. ACB’s spokesperson stated in an email that, “Aurora has undertaken a thorough analysis of our international operations to better align to current market conditions, continue to meet market demand and drive the company to near-term profitability. We are committed to simplifying all aspects of our business and applying greater efficiency to our operations.” These cuts come shortly after ACB announced massive layoffs in their Canadian operations just last month. The company will be closing 5 facilities for a combined 700 job cuts, resulting in a $60 million dollar charge next quarter. The company also cut an additional 500 jobs at the start of the year while announcing over $1 billion in write-downs. 7 Best ETFs for the NEXT Bull MarketDespite the downsizing, ACB did announce on Monday, they plan to increase production in Denmark. The company will acquire an outstanding 49 percent stake in its Danish business. Mads Ulrik Peterson, the CEO of Aurora Nordic Cannabis, will now be in control of operations in the area as President of the European organization. This comes after the company announced last week that they were in serious talks with Aphria (APHA) regarding a potential merger, but negotiations fell apart last minute. The stock continued its downtrend and fell another 2.8% on Monday to close at $11.54. Until investors get more clarity surrounding management, ACB could be headed back to the single digits. Investors may want to consider waiting on the sidelines in the meantime. (Disclosure: The author is long ACB) Want More Great Investing Ideas? 9 “BUY THE DIP” Growth Stocks for 2020 Newly REVISED 2020 Stock Market Outlook 7 “Safe-Haven” Dividend Stocks for Turbulent Times ACB shares were trading at $11.61 per share on Tuesday afternoon, up $0.07 (+0.61%). Year-to-date, ACB has declined -55.21%, versus a 2.07% rise in the benchmark S&P 500 index during the same period."}]}