{"article": [{"url": "https://stocknews.com/news/ssrm-mag-silv-3-silver-stocks-to-buy-on-a-price-rebound/", "published": 1594210100.0, "headline": "3 Silver Stocks to Buy on a Price Rebound", "body": "The price of silver saw a sharp drop as global uncertainty surrounding the pandemic affected industry demand for this precious metal. The spot silver price fell to $12.13 per ounce in March, hitting its lowest level since 2009. This low price created a boost in demand and helped the metal recover more than 48% to $18.00 per ounce. The recent weakness in the U.S. dollar provided additional support in maintaining this price level. Any further weakness in the U.S. dollar will help drive prices up from a surge in demand from buyers outside the U.S. Here are three silver stocks set to benefit from a rise in silver prices. 7 \"SAFE HAVEN\" Dividend Stocks for Turbulent TimesSSR Mining (SSRM) SSRM specializes in the exploration and mining of precious metals in the U.S. and Canada. The company is in a great position to benefit from an increase in silver prices. Unlike many of its competitors in the mining industry, SSRM has a great balance sheet. The company has approximately $200 cash on its balance sheet after its merger with Alacer Gold (OTC:ALIA.F). SSRM is expected to grow its EPS by 79.8% this year. SSRM has generated 61.7% in revenue growth over the last twelve months, which is higher than 91.4% of U.S. companies in the StockNews.com universe. This company has an average analyst price target of $25.8 SSRM is one of the top-rated stocks in our momentum-based POWR Ratings system. Overall, it is the #3 ranked stock in the #4 ranked industry (Miners – Silver Stocks). SSRM is up 12.4% year to day on top of its 59.3% gain in 2019. MAG Silver Corporation (MAG) Canadian-based MAG engages in the acquisition, development, and management of mineral properties in the Americas. In addition to Silver, the company also mines Zinc, Lead, Copper, and Gold. The company’s primary silver project is Minera Juanicipio, which is located in Mexico’s Fresnillo District. MAG owns 44% of this venture. This region has historically produced approximately 10% of global silver production. MAG has a strong balance sheet to drive its exploration activities with cash assets worth approximately $132 million, with zero debt. MAG got straight As on its report card. By that I mean that all 5 scores of our exclusive POWR Ratings system are an A for the stock. It is also the #4 ranked stock in the Miners-Silver industry. The company is up 20% so far for 2020, on top of its 62% return in 2019. This company has an average price target of $16.5. SilverCrest Metals (SILV) SILV engages in the development and operation of mineral properties and precious metals. The company primarily operates in Mexico’s mineral-rich districts with a portfolio consisting of Cruz de Mayo, Las Chispas, Angel de Plata, and Estacion Llano. In mid-June, the company completed the construction of a mining camp at Las Chispas to build on existing exploration and mining activities. SILV has a current ratio of 9.8 and has $86 million in cash on hand. The stock is up 33% year to date after it gained 130% last year. SILV has an average analyst price target of $9.78. SILV has a Strong Buy, or a Buy rating in 4 out 5 five components that make up the POWR Ratings. It is also the #6 ranked stock in the #3 ranked industry (Miners-Silver). Want More Great Investing Ideas? 9 “BUY THE DIP” Growth Stocks for 2020 Is the Bull S#*t Rally FINALLY Over? 7 “Safe-Haven” Dividend Stocks for Turbulent Times Top 3 Investing Strategies for 2020 SSRM shares fell $0.01 (-0.04%) in after-hours trading Wednesday. Year-to-date, SSRM has gained 18.07%, versus a -0.75% rise in the benchmark S&P 500 index during the same period."}]}