{"article": [{"url": "https://stocknews.com/news/pld-psa-sbac-3-red-hot-reits/", "published": 1595419700.0, "headline": "3 \"Red Hot\" REITs", "body": "A real estate investment trust (REIT) is an investment company that buys real estate assets. Examples of these assets include residential properties, commercial real estate, medical buildings, or even cell phone towers. They typically offer investors above-average dividends and trade like stocks or ETFs. To qualify as a REIT, it must invest 75% of its assets in real estate and payout 90% of taxable income as dividends. REITs were created to give access to opportunities that were before only available to wealthy people. Income generated by these assets is passed onto shareholders as dividends, and ideally, the value of the underlying asset also increases over time. REITs are particularly attractive during a period of uncertainty and low-interest rates. Here are three of the most appealing REITs at the moment -: Prologis (PLD), SBA Communications Corporation (SBAC), and Public Storage (PSA). Prologis (PLD) 9 \"BUY THE DIP\" Growth Stocks For 2020Though commercial real estate has taken quite the hit during the pandemic, industrial real estate has been resilient. PLD purchases, develops, and operates industrial spaces throughout North America, Europe, and Asia. PLD’s primary customers are those who conduct global trade. All in all, PLD is invested in properties totaling nearly one billion square feet, spanning 19 countries. Check out PLD’s POWR Ratings and you will find the company has A Grades in all POWR Components but for its Industry Rank which is a B. PLD is ranked above the other 20 stocks in the REITs – Industrial space. The top analysts have set a price target of $100.25 for PLD which is 3% below current prices. As long as industrial real estate holds steady during the recession, PLD should hold steady, trading right around its 52-week high of $99 and change or possibly moving into the triple digits. SBA Communications Corporation (SBAC) Wireless connectivity will likely prove quite important and profitable far into the future. This is SBAC’s bread and butter. The company owns and operates towers that provide wireless communications services to those in the United States, the U.S. Virgin Islands, and Puerto Rico. SBAC specializes in developing and leasing these tower sites. These are long-term leases that ensure profits for multiple years. The company has nearly 17,000 communications sites in the United States alone. The POWR Ratings show SBAC has A Grades in the Trade Grade and Peer Grade POWR Components along with B Grades in the Buy & Hold and Industry Rank POWR Components. All in all, the stock is ranked in the top five of 24 Telecom – Domestic stocks. The top analysts have set a price target of $330.63 for SBAC. There is a good chance SBAC breaks through its 52-week high of $323.03 in the months ahead as the 5G rollout leads to increased demand. Public Storage (PSA) Self-storage facilities are one of the more consistent businesses simply because people will likely always have extra items that are best stored in facilities rather than at home. PSA purchases, improve, owns, and fully operates such self-storage spaces. PSA provides an impressive annual dividend of 4.28%. Take a look at PSA’s POWR Ratings and you will find it is not the highest-rated REIT yet has considerable potential. With a solid Buy & Hold Grade along with an above-average Industry Rank, PSA is certainly worthy of investors’ attention. Furthermore, PSA provided an 8.96% price return in 2019 and a five-year price return of 10.60%. The analysts who have reviewed PSA insist the stock is undervalued. PSA has an average analyst price target of $196. Furthermore, PSA has a forward P/E ratio of 17.87. This is a fairly low P/E ratio because most attractive stocks have forward P/E ratios well above 20. PSA represents solid value, operating in a steady industry that will likely allow the company to fulfill its dividend promise in the years ahead. The same cannot be said of many other dividend stocks that will undoubtedly struggle as the United States is mired in a recession. If you are looking for a relatively haven amidst the economic chaos, you should give serious consideration to PSA. Want More Great Investing Ideas? 9 “BUY THE DIP” Growth Stocks for 2020 Newly REVISED 2020 Stock Market Outlook 7 “Safe-Haven” Dividend Stocks for Turbulent Times PLD shares were unchanged in after-hours trading Wednesday. Year-to-date, PLD has gained 11.97%, versus a 2.60% rise in the benchmark S&P 500 index during the same period."}]}