{"article": [{"url": "https://stocknews.com/news/rxt-amzn-eqix-ctl-ctsh-3-cloud-stocks-that-could-benefit-from-an-amazon-investment/", "published": 1597925300.0, "headline": "3 Cloud Stocks That Could Benefit From an Amazon Investment in Rackspace", "body": "Rackspace Technologies (RXT) IPO’d earlier this month, and on Monday it saw a more than 20% gain on reports that Amazon (AMZN) is interested in purchasing a minority stake in the company. The deal makes sense for both parties, as Rackspace is a managed cloud services provider that helps companies manage cloud data and applications on Amazon Web Services (AWS). Cloud Computing Overview 7 Best ETFs for the NEXT Bull MarketCloud computing is one of the fastest-growing areas of the economy. Worldwide cloud spending is expected to reach $270 billion in 2017 according to Gartner. And, over the next decade, it’s expected to increase 11% annually. Currently, Amazon is the clear leader, but it’s in an intense competition with Google (GOOG) and Microsoft (MSFT). In its last quarter, AWS grew 29% on a year-over-year basis, Google Cloud grew 43%, and Microsoft’s Azure grew 47%. AWS had an early advantage, but Google and Microsoft are closing the gap. Many see Amazon’s interest in Rackspace as a way for it to increase its cloud penetration since Rackspace manages cloud computing operations for thousands of companies. Rackspace would be incentivized to nudge its clients towards AWS. And, it could force Microsoft and Google to invest in other managed cloud service providers. Managed Cloud Services Overview Whether or not they take this step, it will certainly increase investors’ interest and appetite for managed cloud service stocks. Equinix (EQIX), CenturyLink (CTL), and Cognizant Technologies (CTSH) are three stocks that could benefit from Amazon’s potential investment in Rackspace. That’s because these companies help their clients set up, organize, and manage their cloud computing systems. They allow companies to take advantage of the power, flexibility, and cost-savings of cloud platforms without the expense of hiring additional staff to manage this endeavor. It makes cloud computing accessible to small and medium-sized businesses who might lack the technical abilities or resources to hire more staff. Managed cloud service providers can manage a variety of needs for its customers including cloud infrastructure, applications, tools, computing, storage, networks, and development. As cloud adoption becomes a necessity for businesses, managed cloud service providers are an important bridge to help businesses figure out the best way for them to take advantage so they can reap the benefits. Equinix (EQIX) EQIX’s stock has been a long-term winner and grown with the cloud computing sector. Over the last decade, it’s stock is nearly 700% higher. (Source:finviz.com) Since the March low, it’s up more than 50%, and it seems poised to continue this outperformance given the strength in its sector and this recent catalyst. (source: finviz.com) EQIX runs data centers that allow companies to store and distribute data. Its servers can work with any cloud platform, and it offers managed services to help companies configure their cloud in the most optimal way. In terms of traditional valuation metrics, EQIX is expensive given its price to earnings ratio of 135. However, it has 49% gross margins, consistent sales growth, and pays above-average dividends for the sector. Additionally, EQIX’s revenues are quite stable given its data center business. The need to store, manage, and distribute data is only increasing and will likely accelerate with 5G. EQIX is one of the leading data center stocks. In some ways, it’s like a REIT except for data, rather than real-estate. On top of data storage, it’s been able to offer value-added, higher-margin services like managed cloud services, cloud migration, and automation. The POWR Ratings are also high on EQIX as it has a Strong Buy rating. It also has an “A” for Trade Grade, Buy & Hold Grade, and Industry Rank with a “B” for Peer Grade. Among REIT – Data Center stocks, it’s ranked #1 out of 6. CenturyLink (CTL) CTL is an interesting stock with upside for several reasons. It has an 8.8% dividend yield, strong earnings growth, and a cheap valuation. It’s forward price to earnings ratio is 8, and it has 55% gross margins. The stock has been a laggard for the past couple of years, but it’s pivoted its business away from telecom services to faster-growing areas including managed cloud services. From the March lows, CTL’s stock has lagged the broader market and Nasdaq, trading in a tight range. (source:finviz.com) It looks to be on the verge of a break higher from this range, and there could be follow-through given that it has exposure to 5G based on its fiber infrastructure. CTL has a 250,000 mile US fiber network and 300,000 miles of international connectivity. Over the past few years due to the cord-cutting, this has negatively affected the stock and led to its decline. However, 5G networks are dependent on fiber, since there are exponentially more cells that need to be connected via fiber. Therefore, this part of the business which has been a drag on its performance is likely to become a net positive in the coming years. Another drag for CTL has been its purchase of Level 3 which resulted in its debt load increasing to $32 billion. However, the low-interest-rate environment has helped it finance at lower rates resulting in increased profitability, and it boosted the company’s fiber network. Cognizant Technologies (CTSH) CTSH is a diversified IT company that provides consulting and outsourcing for businesses. Its cloud segment has been its fastest-growing unit. In the last quarter, it grew 40% and accounted for nearly $1 billion in revenue. It’s been scooping up smaller cloud services providers and has experience with multiple platforms including Salesforce (CRM), Workday (WDAY), Google Cloud, AWS, and Azure. The stock is very interesting, as it has a forward price to earnings ratio of 16 and gross margins of 35%. Its main customers are in the healthcare and financial industry which means its revenues are less affected by the coronavirus. Another impressive metric is through dividends and buybacks, the company returned $2.6 billion to shareholders which are 7% of its market cap. (source:finviz.com) The stock is 65% higher from its March low, 5% away from a 52-week high, and 25% from its all-time high set in October 2018. Given the strong momentum in the technology space, CTSH should continue higher the rest of the year. As companies invest more in IT and cloud computing, demand for its services will increase. Want More Great Investing Ideas? The Best of StockNews 2 Step Process to Sell @ Market Top in September 9 “BUY THE DIP” Growth Stocks for 2020 RXT shares were trading at $17.86 per share on Thursday morning, down $0.46 (-2.51%). Year-to-date, RXT has declined %, versus a 5.88% rise in the benchmark S&P 500 index during the same period."}]}