{"article": [{"url": "https://stocknews.com/news/spy-inx-dia-iwm-qqq-3-possible-directions-for-the-stock-market/", "published": 1596802100.0, "headline": "3 Possible Directions for the Stock Market from Here", "body": "Let me properly set the stage. I am a 40 year investment veteran with an economics degree. And from my fundamental view of the world we should still be entrenched in a nasty bear market befitting the worst economic event in our lifetimes. Yes, even worse than the Great Recession as illustrated by the devastating -32% plummeting of Q2 GDP. That is essentially four times more painful than the -8.5% showing in Q4 of 2008. 7 Best ETFs for the NEXT Bull MarketYet with all my experience and volumes of evidence on my side stocks are now just a stone’s throw away from the all-time highs at 3,393. In fact, given the size of the bounce from bottom we really can’t use the term “bear market rally” anymore. So What the Heck is This Market? At this stage even the staunchest bear has to pull back and make a fresh assessment of where we are now…and why…and what comes next? That is the goal of my article today. To do my level best to put past biases, and my ego, aside to make profitable investments going forward. So with that disclaimer fully in place I can say without reservation that the economy will continue to be horrible for the rest of the year. And likely that pain extends well into 2021 and possibility beyond depending on how long the Coronavirus continues to be a daily threat. Many investors are unaware of this as they are getting lured into economic statistics that are focused on month over month improvements. So yes, EVERYTHING looks better month over month than an economy that was essentially DOA in March, April and May. So every bit of re-opening of the economy now looks better month over month. However, what really matters is year over year statistics. And in that light we still see negative economic readings in virtually every category. This is what creates a recession…and possibly depression that SHOULD be more represented in current stock prices. Unfortunately it is also true that the stock market can disconnect from the harsh economic realities and continue higher. That happens all the time when you appreciate how the pendulum swings from fear to greed. And at each extreme the market disconnects from the fundamentals. In fact, this same idea is at the root of all equity bubbles. And as we saw with the tech bubble of the late 1990’s and the real estate bubble leading up to the financial crisis in 2008…bubbles can last for a surprisingly long time. So yes, I am saying there is a bubble afoot right now. Especially in the stocks of tech companies that benefited from the stay @ home & work @ home movements. The valuations are nowhere near the insane levels of 1999. The comparison is more akin to 1997 at this stage which brings us back around to the main point of the article. That being where we head from here. Overall I see 3 possible scenarios for where the market heads next. I will list them in order of likelihood along with the investing strategy so you stay on the right side of the action. Most Likely Scenario = Mini Bubble That Ends Soon I see two events coming up soon, like September/October, that should stop the markets in their tracks and likely give back a great deal of recent overinflated gains. No, I do not believe we will retrace to the March lows. Instead a 20-30% correction from current heights is more likely in order. First, I see the economic data rolling over and becoming more negative. That’s because there was a lot of pent up demand that took place during the “live under a rock” phase of the Coronavirus in March, April and May. That is now coming through the economy creating the illusion of improvements. We are nearing the end of that phase where the economy will start acting more and more like one with 10%+ unemployment and with a quasi-PTSD from the events that just happened. This should result in lower #s across the board for manufacturing, services, employment etc. And when investors see that the economy is not so quickly getting back to normal it SHOULD result in a requisite repricing of risk and lower share prices. Second, the Presidential Election cycle has not been kind to the market as you will see in the two images below. In both 2016 and 2012 you will see the market rally strongly up to September and then tumble into the election. More on this topic after you review the historical norm pattern for election years. 2016 Election: Trump vs. Clinton 2012 Election: Obama vs. Romney The past pattern is clear. Rally…crater…bounce after the election. But 2020 has a new twist to deal with that Goldman Sachs cited in this recent article. That being the Coronavirus will GREATLY increase the number of write in ballots…which increases the odds of a contested election…which would create serious market volatility! Either way you slice it, the market should get a douse of cold water come September and think that this bubble in stocks ends about a month from now. But yes, in the meantime it is clear that with the S&P wants to touch the all time highs only 42 points above Friday’s close. Or to put it another way. At this stage I sense that investors want to touch the all-time high at 3,393 the same way a young child needs to touch stove to learn an important life lesson. Just no amount of lecturing from the adults in the room can prevent it from happening. The strategy for this scenario is best described after all 3 scenarios are laid out. So let’s continue with… 2nd Most Likely Scenario = Long Term Trading Range as Bridge to Future Bull I contemplated this scenario a while back in my 5/15/20 article on StockNews.com: Is This a Bull or Bear Market? Here is the key excerpt to appreciate this scenario for the market: “Whereas bulls will say they are not blind to the current problems. Instead they are just looking out to a longer term horizon where the economy gets back on track. Add in unprecedented Fed and Government stimulus and they see it propping up share values.” Read that last paragraph again because there is a lot of meat to this concept. Because indeed that may be the main theme behind this four month rally and why it disconnected from current economic realities. And these investors may not care how long they have to wait for a true economic rebound because with rates this low, then investments in stocks may still be better than cash or bonds which pay virtually nothing. This scenario leads to big gains now…which in many ways has already happened. And then likely 1-2 years of little to no returns for stocks as the economy and corporate earnings play catch up to right size valuations. This scenario provides little benefit to mutual fund or index investors because the average return going forward will be very low to nothing. Instead this the domain of stock pickers who properly smell out which sectors are ripe to outperform. Not just industry by industry. But also when it is time to shift from growth to value stocks etc. Gladly we have great tools on StockNews.com to help with that like our POWR Industry Rank. Before you lock onto this idea, we have one more scenario to contemplate. Then my recommended trading strategy. Now onto… 3rd Most Likely Scenario = This Bubble Grows Larger, Then POP! Here we have a continuation of the theme that the market remains disconnected from the dismal economic realities. And given that so many people are still bearish, then you could explode above the all-time highs with all the FOMO players getting on board. With bubbles you never know how high…or high long they will go. But typically it is an extreme level beyond what you could imagine. For now let’s say a good spot above the previous highs. Like 4,000….heck it could be 5,000. And now we are rivaling the valuations just before the original tech bubble burst. The strategy here would be to lean into stocks at the heart of the bubble like the FAANG and other in fashion growth stocks. But also you could nibble at the stocks that are the most depressed right now thanks to the Coronavirus because they would have the most upside potential in an extended rally (airlines, oil, restaurants, hotels, banks etc). But here is the real key… SLEEP WITH ONE EYE OPEN waiting for the bubble to burst. Meaning you hold your nose joining the rally that you never really believed had any merit to begin with. This will keep you sober enough to be one of the first investors out the door when the bubble bursts and prepared for the downside that ensues. Whereas most others will be asleep at the wheel drunken with “irrational exuberance” leading to heavy losses. Trading Strategy Right now my Reitmeister Total Return portfolio is positioned based upon Scenario #1. That being where we are in the midst of a mini-bubble that will likely end as soon as September Of the 11 stocks and ETFs on board I am overweight technology and precious metals. Plus 3 stocks that are uniquely positioned in both a Coronavirus fueled recession and when things get back to normal. Few stocks check both those boxes…but these 3 stocks certainly do which is why they are all serious outperformers of late. Then, not unlike scenario #3, I am sleeping with one eye open awaiting for the party to be over with 20%+ correction quite likely in store. The rolling over of economic data is one possible clue that’s it time to spring into action. Or its about investors sinking into the Presidential Election cycle sell off is yet another clue. The plan would be to bag gains on all the big stock winners and switch over to inverse ETFs as the best route to profits. Meaning if the market is going to tank then going to cash is nice…but inverse ETFs are going to be the best trade in town. But let’s be honest with ourselves. Its crazy out there! That’s why I am trying my best to help investors make sense of it all and profit from whatever scenario comes our way. The best way for me to do that is give you 30 days access to the Reitmeister Total Return. This is my newsletter service where I share more frequent commentaries on the market outlook, trading strategy, and yes, a portfolio of hand selected stocks and ETFs to produce profits whether we have a bull…a bear…or anywhere in between. As shared above, the unique portfolio I have constructed at this time leans into the stocks that are benefiting the most from the current bubble. That explains how we continue to top the market at this time. Yet we are FULLY prepared for when the rug gets pulled out and stock prices better reflect the still dire economic situation. Just click the link below to see all 11 stocks and ETFs in this uniquely successful portfolio. Plus get ongoing commentary and trades to adjust your strategy as 2020 continues to the wildest market in history. Gladly it can be tamed. About Reitmeister Total Return newsletter & 30 Day Trial Wishing you a world of investment success! Steve Reitmeister …but everyone calls me Reity (pronounced “Righty”) CEO, Stock News Network and Editor, Reitmeister Total Return SPY shares rose $0.04 (+0.01%) in after-hours trading Friday. Year-to-date, SPY has gained 5.02%, versus a % rise in the benchmark S&P 500 index during the same period."}]}