{"article": [{"url": "https://stocknews.com/news/rl-tpr-blue-nog-4-stocks-downgraded-to-strong-sell/", "published": 1596715700.0, "headline": "4 Stocks Downgraded to STRONG SELL", "body": "The shortest bear market in history ended in the third week of March. Even though the broad market is strong, there are some stocks that don’t belong in investor portfolios. &nbsp Thankfully, you do not have to sort through the entirety of stocks to pinpoint the worst of the bunch. Our exclusive POWR Ratings system runs daily calculations to identify stocks worthy of an upgrade or downgrade. &nbsp A considerable amount of stocks have been downgraded of late which is always a red flag during a bull market. The following four stocks were recently downgraded to the lowest possible rating of F, meaning they are Strong Sells: Ralph Lauren Corporation (RL), Tapestry (TPR), Bluebird Bio (BLUE) and Northern Oil and Gas (NOG). &nbsp Ralph Lauren Corporation (RL) It was not long ago when RL was hot. Stylistic preferences have changed away from RL’s style. Additionally, RL has been negatively affected by the struggles in department stores, as they are one of RL’s primary sales channels. Factors like decreased foot traffic and an inability to grow sales online was already leading to store closures. However, their situation has further deteriorated with the coronavirus which has caused foot traffic to fall further, and many stores to be shut down completely. This is filtering down into decreased sales for RL, as well. The POWR Ratings give RL an F grade in each POWR Component except for a D in Peer Grade and Industry Rank of C. RL is ranked outside of the top half of the publicly traded companies in the Fashion & Luxury category. The RL price returns are red in each period except for 2017 to 2019 when, it was positive but still underperformed the market. The stock’s five-year price return is a disappointing -37.62%. Savvy investors will steer clear of RL or even consider shorting it. 7 Best ETFs for the NEXT Bull MarketTapestry (TPR) This is not the best time to be in the outerwear and accessories business. Nor is it a good time to sell watches, jewelry, fragrances, and travel bags because nearly everyone is doing their best to quarantine while the coronavirus spreads. Unfortunately for TPR investors, TPR sells each of the items listed above. The POWR Ratings show TPR has an F grade in the Buy & Hold and Trade POWR Components along with a D Peer Grade. TPR is ranked in the bottom half of Fashion & Luxury stocks. The company’s price returns are primarily red with a -48% return across the past six months, a -46% return across the past year, and a ’19 price return of -15.97%. Though TPR has a low forward P/E ratio of 8.47, it has all the markings of a value trap rather than a value stock. Investors should not consider investing in TPR until the pandemic ends and consumer discretionary income bounces back. If you are considering jumping in on TPR, consider the fact that the company’s former CEO, Jide Zeitlin resigned out of the blue last month. Zeitlin is one of several executives who have departed TPR across the past 18 months. Executive turnover is always a poor indication for a company attempting a turnaround. Bluebird Bio (BLUE) One would think a publicly-traded company in gene editing, gene therapy, and cancer immunotherapy business would have considerable investor support, especially with the strength in the biotech sector. However, BLUE has disappointed investors in recent months. Despite high hopes, BLUE hasn’t been successful in bringing a breakthrough product to the market. Currently, it has a $4 billion market cap but only $54 million in sales. The POWR Ratings show BLUE has F Trade and Buy & Hold grades, a D Peer Grade, and a rank of #217 out of 343 Biotech stocks. The BLUE price returns leave much to be desired. BLUE has a -28.38% price return year-to-date. The stock has a six-month price return of -29.10%. Take a look at BLUE’s three-year and five-year price returns and you will find the numbers are even worse: -33.88% and -59.41%, respectively. Northern Oil and Gas (NOG) Energy has been in a multiyear bull market. The coronavirus has put a huge dent in demand which makes it even harder to imagine a sustained turnaround. High-cost producers like NOG will be vulnerable. They will have to take on debt or dilute shares to stay in business. NOG has Fs in each POWR Component but for its Peer Grade which is graded a D. Though NOG’s price returns were in the green in ’19 and ’18, the stock’s price returns are red for every other period. NOG’s six-month price return is -51%. The stock’s three-year price return is a pitiful -32.50%. Steer clear of NOG in favor of alternative energy stocks and your portfolio will benefit. Want More Great Investing Ideas? 9 “BUY THE DIP” Growth Stocks for 2020 How to Trade THIS Stock Bubble? 7 “Safe-Haven” Dividend Stocks for Turbulent Times RL shares were trading at $66.53 per share on Thursday morning, down $1.98 (-2.89%). Year-to-date, RL has declined -42.69%, versus a 4.17% rise in the benchmark S&P 500 index during the same period."}]}