{"article": [{"url": "https://stocknews.com/news/sbux-mcd-dnkn-3-coffee-stocks-to-perk-up-your-portfolio/", "published": 1601899700.0, "headline": "3 Coffee Stocks to PERK UP Your Portfolio", "body": "Warren Buffet once said, “Never invest in a business you cannot understand.” So, if you enjoy drinking coffee, you may also enjoy investing in coffee stocks. Restaurants that serve coffee have not fared well during the COVID-19 pandemic. Many restaurants remained closed as consumers refrain from dining out to avoid exposure to the deadly virus. Restaurants with successful delivery services or takeout operations, however, have been able to capitalize on the huge demand for fast food and coffee during this period. With many restaurants adapting quickly to the new normal, the outlook for the industry has started looking better. In fact, with the arrival of a potential vaccine or treatment for Covid-19, restaurants should fare much better as people will be willing to return to spending time at coffee shops, meeting friends, and enjoying the ambience. While it’s not a high-growth tech industry, restaurant stocks could offer more stability once the risks related to the virus subside. Restaurants, as an industry, rank #23 out of 123 StockNews.com stock categories. Starbucks Corporation (SBUX), McDonald’s Corporation (MCD), and Dunkin’ Brands Group, Inc. (DNKN) are three coffee stocks well positioned to “perk up” your portfolio. 9 \"BUY THE DIP\" Growth Stocks For 2020Starbucks Corporation (SBUX) The premier roaster and retailer of specialty coffee in the world, SBUX needs no introduction. Jumpstarting the fall season with the pumpkin spice latte , the well-liked blend has been driving fans to stores even amidst the pandemic. While SBUX, too, bore the brunt of the pandemic and hit its 52-week low of $50.02 in mid-March, the stock has gained 53.7% since. The company opened 130 net new stores in the fiscal third quarter that ended June 2020, yielding 5% year-over-year unit growth. While SBUX’s revenues declined 38% year-over-year during the quarter, the company’s loss per share of $0.46 surpassed the consensus estimate by 22%. In fact, SBUX’s earnings surprise history looks impressive with the company missing the consensus estimate in just one of the trailing four quarters. SBUX’s EPS is expected to grow 184.2% next year and at a rate of 2.7% over the next five years. Moreover, the company recently announced a 10% increase in its quarterly cash dividend. The opening of new stores around the globe is likely to increase revenue of the global brand. Its ease of adaptability during the “new normal” by focusing on digital ordering and wellness-centered menu innovation, has enabled SBIX to create a moat for itself. How does SBUX stack up for the POWR Ratings? A for Trade Grade A for Buy & Hold Grade A for Peer Grade A for Industry Rank A for Overall POWR Rating You can’t ask for better. The stock is also ranked #2 out of 49 stocks in the Restaurants industry. McDonald’s Corporation (MCD) MCD is one of the most popular hamburger-focused fast-food chains offering various food products and beverages, as well as a breakfast menu. The company is also well-known for its coffee offerings. The company’s power lies in its vast franchisees operating globally. Being that MCD was already a pro drive-thru service, it handled the pandemic much better than its competitors. The stock has gained more than 50% since hitting its low in mid-March. MCD’s collaboration with rapper Travis Scott helped it increase domestic foot traffic. Its innovations and sweet deals available exclusively on the app have given the company the twin benefits of digital innovation and an increased market share for people ages 11 to 24. For the second quarter that ended June 2020, MCD’s revenue and earnings declined, compared to the year-ago quarter. Though the US, International Operated Markets segment its and global monthly comparable sales improved sequentially. While MCD’s sales growth was initially hampered by the closure of restaurants, 99% of the restaurants in the U.S. and 96% of restaurants worldwide were operational as of June 30, 2020. The market expects the company’s revenue to increase 13.9% next year. EPS is expected to increase 39.6% next year and at a rate of 3.88% over the next five years. MCD’s strong fundamentals are reflected in its POWR Ratings, it has a “Strong Buy” rating with an “A” in Trade Grade, Buy & Hold Grade, Peer Grade, and Industry Rank. Within the Restaurants industry, it’s ranked #1 out of 49 stocks. Dunkin’ Brands Group, Inc. (DNKN) One of the world’s leading franchisors of quick service restaurants serving hot and cold coffee and baked goods, and hard serve ice cream is DNKN. It operates through five segments: Dunkin’ U.S., Dunkin’ International, Baskin-Robbins International, Baskin-Robbins U.S., and U.S. Advertising Funds. As of December 28, 2019, it had 13,137 Dunkin’ restaurants and 8,160 Baskin-Robbins restaurants. The stock has gained 93.7% since hitting its 52-week low in mid-March. While DNKN’s revenues declined 20% year-over-year in the second quarter that ended June 2020, comparable store sales in Dunkin’ U.S. and Baskin-Robbins U.S. segments improved sequentially in each month of the quarter. DNKN has an impressive earnings surprise history with the company beating consensus EPS estimates in each of the trailing four quarters. The market expects revenue to increase 6.6% next year. EPS is expected to increase 16.4% next year and at a rate of 4.9% over the next five years. The price to trailing twelve-month operating cash flow for DNKN is currently 27.11, higher than 85.8% of US stocks with positive operating cash flow in the StockNews.com universe. It’s no surprise that DNKN is rated a “Strong Buy” in our POWR Ratings system. It also has a grade of “A” in Trade Grade, Buy & Hold Grade, Peer Grade, and Industry Rank. In the 49-stock Restaurants industry, it is ranked #4. Want More Great Investing Ideas? Do NOT Buy Stocks Before the Election! 7 “Safe-Haven” Dividend Stocks for Turbulent Times Chart of the Day- See Christian Tharp’s Stocks Ready to Breakout SBUX shares were trading at $88.29 per share on Monday afternoon, up $1.72 (+1.99%). Year-to-date, SBUX has gained 2.01%, versus a 6.72% rise in the benchmark S&P 500 index during the same period."}]}