{"article": [{"url": "https://stocknews.com/news/w-five-musa-eye-should-you-buy-the-dip-in-wayfair/", "published": 1600862900.0, "headline": "Should You Buy the Dip in Wayfair?", "body": "As one of the largest home goods e-commerce platforms, Wayfair Inc. (W) has nearly 26 million active customers over the United States and internationally. The company offers a range of furniture, home furnishings, décor, improvement, and goods. It provides approximately eighteen million products for the home sector under various brands. W is one of the best-performing stocks in 2020 with record revenue and income growth. In the second quarter ended June 2020, the top-line was up 84% year-over-year to $2 billion while net income came in at $274 million compared to the year-ago loss of $182 million. The number of active customers in its direct retail business reached 26 million during the quarter, increasing 46% year-over-year. With the robust growth in its operating results, the stock gained 237% year-to-date. This impressive performance and the potential upside based on several factors have helped it earn a “Buy” rating in our proprietary rating system. The stock is down close to 10% over the past month, so it’s worth considering getting long the stock now. 9 \"BUY THE DIP\" Growth Stocks For 2020Here is how our proprietary POWR Ratings system evaluates W: Trade Grade: B W is currently trading way above its 50-day and 200-day moving averages of $279.93 and $157.13, respectively, indicating that the stock is in an uptrend. The stock’s 48.3% return over the past three months reflects a solid short-term bullishness. W is benefiting from booming e-commerce demand amid the pandemic. Orders delivered in the second quarter of 2020 were 18.9 million, an increase of 106.2% year-over-year. Moreover, 61% of total orders delivered for the direct retail business were placed via a mobile device, compared to 53.5% in the comparable quarter last year. Buy & Hold Grade: B In terms of proximity to its 52-week high, which is a key factor that our Buy & Hold Grade takes into account, W is fairly positioned. The stock is currently trading 13% below its 52-week high of $349.08. Looking at the past three years, the stock has grown more than 307% due to its aggressive spending on building its product portfolio, steady growth in user base, and rapid international expansion. The international segment net revenue in constant currency grew 96.9% in the last reported quarter. As part of the second-quarter results, W mentioned, “Our strategic long-term investments positioned us well to serve our customers and to quickly adapt during a challenging time. We experienced unprecedented demand in Q2 and saw record numbers of new and repeat customers choose Wayfair.” Peer Grade: B W is currently ranked #11 out of 34 stocks in the Specialty Retailers industry. Other popular stocks in the group are Five Below, Inc. (FIVE), Murphy USA Inc. (MUSA), and National Vision Holdings, Inc. (EYE). W comfortably beat the year-to-date gains of the three industry participants. FIVE, MUSA, and EYE returned 0.7%, 15.8%, and 20.6%, respectively, over this period. Industry Rank: C The StockNews.com Specialty Retailers industry is currently ranked #78 out of the 123 industries. The companies in this industry offer an assortment of goods from health supplements, beauty supplies, home décor, and more. Demand for such products is primarily driven by the disposable income of consumers and the industry has not been performing well amid the health crisis due to lower demand for most of the products. Overall POWR Rating: B (Buy) Overall, W is rated a “Buy” due to its impressive quarterly performance, strength in its fundamentals, and solid price momentum, as determined by the four components of our overall POWR Rating. Bottom Line The stock has soared so far this year, despite instances of profit bookings. W was able to meet the pandemic-driven accelerated demand and retain its customers. Hence, it is well-positioned for long-term growth. However, the company is facing immense competition from traditional retailers such as Amazon.com (AMZN), which already has a 30% share of the online furniture market. Even so, with the scale of revenue and profit growth, W has the potential to grow even further based on its favorable earnings and price momentum. Analyst sentiment, which gives a good sense of a stock’s future price movement, is pretty impressive for W. The average broker rating of 1.79 indicates a favorable analyst sentiment. The market expects EPS for the ongoing year to rise 131% from the year-ago value. This outlook should keep W’s price momentum alive in the near term. Want More Great Investing Ideas? 7 Best ETFs for the NEXT Bull Market Is the Stock Market Correction Over? Chart of the Day- See the Stocks Ready to Breakout W shares were unchanged in after-hours trading Wednesday. Year-to-date, W has gained 217.27%, versus a 1.68% rise in the benchmark S&P 500 index during the same period."}]}