{"article": [{"url": "https://stocknews.com/news/ftnt-akam-clr-upwk-aeye-5-overlooked-remote-work-stocks-to-buy-as-the-coronavirus-persists/", "published": 1600258100.0, "headline": "5 Overlooked 'Remote Work' Stocks to Buy as the Coronavirus Persists", "body": "The transition to remote work has propelled numerous stocks to new highs. However, the mainstream media typically covers a select few work-from-home (WFH) stocks while neglecting smaller ones that may have even more upside. &nbsp The WFH transition is not a transitory phenomenon. WFH is mutually beneficial to both employers and employees as it reduces costs and employees are staying productive but able to manager better work-life balance. Below, we provide a look at five often-neglected stocks related to WFH likely to benefit from the transition away from the traditional workplace: Fortinet (FTNT), Akamai Technologies (AKAM), Cloudera (CLR), Upwork (UPWK), and Audioeye (AEYE). 7 \"SAFE HAVEN\" Dividend Stocks for Turbulent TimesFortinet (FTNT) Network security has become that much more important as a growing number of workers rely on the web for work. FTNT provides these solutions for multi-level security protection. FTNT provides protective antivirus software, firewalls, web filtering, virtual private networking (VPN), and more. In short, FTNT’s services safeguard against all sorts of digital security threats that will prove even more prominent and destructive now that an abundance of work is shifting online. The POWR Ratings show FTNT has a solid grade in the Buy & Hold and Industry Rank Components. FTNT is ranked in the top 10 of 23 stocks in the Software – Security sector. The top analysts insist the stock is undervalued, setting a price target of $137.57. If FTNT reaches this level, it will have popped more than 17%. Look for FTNT to return to its high of $150 set earlier this summer if a second wave of the virus arises this winter. Akamai Technologies (AKAM) The delivery of information and applications on the web is proving that much more important as even more workers shift to the internet. AKAM accelerates and facilitates the delivery of such information on the web. From traditional work-oriented content to streaming video and beyond, AKAM makes it easier and quicker to conduct business on the web in a timely and seamless manner. The POWR Ratings reveal AKAM has A grades in the Trade Grade and Peer Grade Components. AKAM is ranked third of 53 stocks in the Technology – Services space. The top analysts have set a price target of $122.88 for AKAM, meaning it is likely to increase by 12%. AKAM has a forward P/E ratio of 21.17, indicating the stock is likely undervalued because it operates in the tech space. AKAM has declined since peaking around $120 in a rapid ascent following the onset of the pandemic. The recent dip is quite the tempting buying opportunity because a second lengthy quarantine is looking likely as we transition to the fall and winter months. Cloudera (CLDR) CLDR makes and distributes software for businesses. In particular, CLDR focuses on business data storage, management, access, processing, and security. CLDR’s services are primarily provided on the cloud, meaning that many more businesses will be inclined to sign up for CLDR services as the pandemic drags on. The POWR Ratings show CLDR has a B Industry Rank grade along with solid grades in the Trade Grade and Buy & Hold Grade Components. TipRanks reports the analysts to insist CLDR will hit $14.50, meaning it has more than 30% upside. CLDR currently spends more than 50% of its revenue on sales and marketing. This figure should decline amidst a lengthy pandemic as that many more companies gravitate toward CLDR’s services. If a second wave of the virus rears its ugly head this fall and winter, CLDR is likely to move back toward the $14 level reached earlier in September. Upwork (UPWK) Though Fiverr seems to get all the publicity, another WFH stock, UPWK, is also worthy of investors’ attention. UPWK provides a polished and intuitive WFH platform that connects employers to workers. UPWK’s hourly time measurement system is easy to use and flawless in all regards. UPWK also provides employers with the opportunity to pay workers a flat rate per project. The POWR Ratings show UPWK has A grades in the Peer Grade and Trade Grade POWR Components. The stock is ranked in the top 10 of more than 30 Internet – Services stocks. The average analyst price target for UPWK is excess of $18. UPWK will only get bigger and better from here on out. Add this stock to your portfolio, hold it for years or even decades and you will likely make plenty of money. Audioeye (AEYE) Cloud-based solutions for internet browsing, voice-driven technologies that improve the web, and the real-time transmission of media to web-connected devices are proving that much more important during the pandemic. AEYE provides these services in the form of software as a service. The top analysts have set a price target of $25 for AEYE, indicating it has more than 93% upside. Though AEYE has had a couple of negative estimate revisions in recent weeks, the stock has considerable potential, especially as more companies move operations to the web. Look for AEYE to move back toward $20 if the pandemic worsens. Want More Great Investing Ideas? 7 Best ETFs for the NEXT Bull Market Is the Stock Market Correction Over? Chart of the Day- See the Stocks Ready to Breakout FTNT shares were trading at $118.17 per share on Wednesday afternoon, down $0.03 (-0.03%). Year-to-date, FTNT has gained 10.69%, versus a 7.13% rise in the benchmark S&P 500 index during the same period."}]}