{"article": [{"url": "https://stocknews.com/news/spy-how-to-protect-your-retirement-portfolio-from-a-potentially-unprecedented/", "published": 1600258100.0, "headline": "How to Protect Your Retirement Portfolio From a Potentially Unprecedented Bear Market", "body": "In part one of this article, I explained three potential risk catalysts that could turn this perfectly normal and healthy market pullback into a perfectly normal and typical correction. For now, the S&P 500 and Nasdaq are merely in a pullback, not even a correction. So how can I possibly be worried about something that’s never happened before in the history of the stock market? Two bear markets in the same year? Well, for one thing, I NEVER worry about bear markets, no matter how severe or closely spaced together they might be. So let me first explain the final piece of the puzzle, about how a perfect storm might turn a normal pullback into a correction, into an unprecedented bear market. More importantly, I’ll then explain how to protect your retirement portfolio from such a perfect storm, so that you never lose a wink of sleep, no matter how crazy the stock market might get in the coming weeks or months. $400 Billion in Dumb Money: The Final Ingredient to Our Perfect Storm Bear Market Scenario 7 Best ETFs for the NEXT Bull MarketI should point out that I’m hardly the only analyst warning about a possible bear market. Here’s what Tim Hayes, senior investment strategist at Ned Davis Research recently told Business Insider. I would expect a decline of 15-20% and then we get a rally that maybe leaves us back where we are around now. That would be my best expectation.” – Business Insider JPMorgan’s economic team, one of the 16 most accurately tracked by MarketWatch, also considers a 22% bear market a potential scenario that investors need to be prepared for. While JPMorgan’s bear market scenario is based on a second wave of the virus triggering a mild double-dip recession (which is a 25% probability according to them and 80% of economists) we actually don’t need a recession to trigger an unprecedented second bear market in a single year. That’s because of what JPMorgan’s Marko Kolanovic, head of macro quantitative and derivatives research at the bank, wrote in a note to clients a few weeks back. Quantitative hedge funds — including volatility targeting and risk parity funds — slashed exposure to the stock market earlier in 2020 as virus risks raged. The trading algorithms commonly used by such firms target specific gauges to decide when capital should be pulled from or added to stocks. If the volatility-tracking VIX index falls below 30 though the summer, the firms’ programs are set to push hundreds of billions of dollars back into the stock market, Kolanovic said. “For these investors to reach their historical median equity exposure, they would need to add ~$400 billion of equity exposure, which can easily push the broad market to new highs,” he wrote.” – Business Insider For several months now, quant-algorithm driven hedge funds, specifically risk-parity “smart beta” funds, have been plowing money into broader market indexes, including the largest tech giants. Not because of any fundamental reason, but purely because realized volatility (not the VIX which is implied volatility) fell to 10 on September 2nds record high. According to Refinitiv economist Roger Hurst, the recent market pullback caused actual volatility to rise to 17. If volatility were to rise to 30 or higher, then the $400 or so billion in risk-parity fund flows could start to reverse. But, if volatility is only 17 and the algorithm-driven cutoff for blindly dumping the broader market indexes is 30 then why should investors potentially be worried? Because of the scenario, I outlined in part one of this article. If the Fed disappoints Wall Street this week by not becoming even more dovish, stocks could fall into a correction Friday’s quarterly options expiration could then force market makers, sitting on 5X the previous record number of options, to hedge an extreme number of shares in stocks triggering a potential 3% to 6% crash on Monday actual volatility, from this 13% to 15% historically normal and healthy correction, could then exceed 30 In other words, anyone of these risk catalysts, on their own, are unlikely to trigger a bear market. But what if they occur in quick succession, a daisy chain of volatility boosting short-term bad news? Then suddenly the large quant macro funds that have been helping to fuel this market bubble could start dumping stocks, purely because their algos are programmed to. What’s more, we can’t forget about the retail options traders who, according to Citadel Securities, have been driving 25% of market volatility in recent months. The same short-term speculators, many dabbling for the first time in options or the stock market in general, are hardly the kind of disciplined and experienced veterans that might be expected to stay calm in a fast and significant market slide. It’s possible that those same retail options traders that were driving Tesla up 10X over a single year with a frenzy of call buying, could panic, or decide to start shorting the market. By selling puts, they could gain leveraged bets to the downside, and possibly profit handsomely from a bear market. Thus the same FOMO (fear of missing out) that helped drive the market to absurd levels very quickly, could help drive it down even faster. The more puts investors buy, the more stocks market makers have to sell in order to hedge their books and minimize the risk of massive losses. The more stocks they sell to hedge the option trades, the more stocks fall, raising the delta and gamma of those options forcing market makers to sell yet more stocks to hedge those positions. And if the same rabid option speculators who got lucky with their use of leverage on the way up suddenly find it super profitable to make money on the way down?Then many could double or even triple down on put buying and thus accelerate the market down even faster. Throw in big institutional hedge funds, those risk-parity funds that would be dumping potentially $400 billion in stocks and you get a recipe for potentially the fastest bear market in history. Would it be as large as the March bear market when stocks fell 35%? Not according to Ned Davis, JPMorgan, and most asset managers. But it could potentially take less time, a few weeks that might feel like an eternity for unprepared investors. Plenty of people would get flashbacks to March’s four-week 34% market plunge, and the lack of any obvious fundamental reason for stocks plunging might only enhance the blind panic many might feel. But fortunately, there is a highly effective way to protect your retirement portfolio from any amount of irrational speculative driven market madness, such as a two or three week 20% to 30% bear market that could potentially be coming soon. The Easiest & Smartest Way to Protect Your Retirement Portfolio From an Unprecedented Bear Market (Source: Dalbar) Many investors attempt to time the market on the theory that missing the market’s worst days can enhance returns. IF you could indeed do that, without missing the market’s best days, then you could have tripled the market’s returns from 2000 to 2019. For context, 18% CAGR total returns from perfect market timing would be on par with some of the greatest investors in history. However, note how I said those are the returns you’d have earned IF you could time the market with perfection, and in reality, no one can. (Source: Dalbar) This is the reality of market timing. According to JPMorgan, 80% of the market’s best days come within two weeks of the worst days. (Source: Wikipedia) According to Bank of America’s head quant, since 1926 99% of the market’s long-term returns were the result of the best 10 market days in each decade. Guess when those best days occurred? Mostly during the Great Depression, Financial Crisis, and the COVID-19 Pandemic bear market. Want to see what actual market timing, from regular investors, gets you? How about 0.3% of inflation-adjusted returns that underperformed every asset class…for 20 years. Nothing other than insufficient savings kills retirement dreams faster or more effectively than market timing. Prudent risk management, not market timing, is how you can protect your nest egg from the kind of crazy market volatility I’ve outlined in this article. 10 Safe Hyper-Growth Blue-Chips For A Rich Retirement In this video article, I not only explain how to find the safest 10 hyper-growth blue-chips during this market bubble, but I also walk you through exactly how to construct a bunker sleep well at night or SWAN retirement portfolio. One that can stand up to anything the pandemic, economy, or stock market can throw at us. Let me show you two examples of what I mean, from that article. First, let’s consider the most conservative version of that SWAN portfolio I would recommend for retirees today. That’s a 30/70 stock/bond portfolio consisting of the 10 fastest growing blue-chips you can safely buy today, using my risk management guidelines to construct a fully diversified portfolio. (Source: JPMorgan Asset Management) Consider this 30/70 SWAN hyper-growth blue-chip portfolio against the most conservative blended portfolio JPMorgan recommends a 20/80 stock/bond portfolio. During the March bear market, my SWAN portfolio fell just 12%, virtually matching the even more conservative 80% bond portfolio. (Source: JPMorgan Asset Management) My SWAN portfolio also outperformed the more conservative benchmark by significant margins in most of the market’s last 10 years of correction rallies. (Source: JPMorgan Asset Management) In various future risk scenarios, you can see that a highly conservative stock/bond portfolio can be expected to provide a significant amount of downside protection vs the broader market. If we get a double-dip recession due to the pandemic JPMorgan’s economists expect the stock market to fall 22%, this portfolio just 8% and a 20/80 portfolio just 6%. in most current event risk scenarios this portfolio falls 50% or less than an S&P 500 index fund the more bonds you own the more downside protection you get, hedging against short-term market declines The obvious downside to bonds is that if long-term rates rise fast (if the economic recovery is faster than expected) the worse a heavily bond focused portfolio will do. This is why in the article I linked to above, I also include a video for a 75/25 stock/bond SWAN portfolio that also outperforms an appropriate benchmark while allowing you to sleep like a baby in all future risk scenarios (plus the last decade of market corrections). The point is that on Wall Street anything can happen in the short-term, just like anything can happen in a casino. But over the long-term, also like a casino, probability, statistics, and math (stock fundamentals) ensure the house always wins. If you construct the right portfolio for your needs, including prudent diversification and asset allocation for your risk profile, then you never have to worry about how crazy Wall Street gets in the short-term. My retirement portfolio, where I keep 100% of my life savings, is such a bunker SWAN portfolio. This is precisely why I am NOT worried about stocks potentially (though in an unlikely worst-case scenario) plunging 20% to 30% within a matter of weeks. (Source: AZ quotes) In fact, I have a mountain of cash/bonds that I’ve been building steadily for months, to ensure that I’m able to profit from every market downturn in the future, no matter how fast, severe, or what causes it. Want More Great Investing Ideas? 7 Best ETFs for the NEXT Bull Market Stock Market Outlook: Before & After the Election Chart of the Day- See the Stocks Ready to Breakout SPY shares were trading at $342.14 per share on Wednesday morning, up $1.97 (+0.58%). Year-to-date, SPY has gained 7.40%, versus a % rise in the benchmark S&P 500 index during the same period."}]}