{"article": [{"url": "https://stocknews.com/news/spy-a-shocking-prediction-from-moodys-that-could-make-or-break/", "published": 1601467700.0, "headline": "A Shocking Prediction From Moody's That Could Make or Break Your Portfolio", "body": "After a painful three weeks for investors, in which the Nasdaq fell as much as 12.5% and the S&P 500 9.4%, it appears that the pullback MAY be ending, or at least the worst may potentially be behind us. However, while the fact that this latest downturn didn’t turn into an epic market crash, as so many Perma bears have been predicting for the past decade, doesn’t mean that prudent long-term investors can be complacent. Moody’s, one of the 16 most accurate economists on earth, just released a report that has some shocking implications that could make or break your retirement portfolio, not just over the next year or two, but potentially over the next decade. Moody’s Prediction That Could Potentially Devastate Stocks For The Next 10 Years It’s no surprise that after the fastest bear market recovery rally in history, stocks became a tad overvalued. In fact, on September 2nd they peaked at a record high that was 49% historically overvalued. Now Moody’s, one of the 16 most accurate economist teams out of 45 tracked by MarketWatch, has a new report showing just how potentially overvalued stocks have become. 7 \"SAFE HAVEN\" Dividend Stocks for Turbulent TimesMoody’s latest baseline economic forecast estimates that the earnings fundamentals won’t support the current market valuations, not even close. In fact, Moody’s baseline forecast now assumes that the S&P 500’s fundamentals won’t justify the S&P 500 at 3,000 until the end of 2030. Especially at risk to a potential severe medium-term correction are the tech stocks, whose sky-high valuations have benefited from record low long-term interest rates. Low-interest rates may be contributing to high valuations of the tech sector. The valuations of many tech companies are more back-loaded than other firms because they are expected to have stronger long-term profitability prospects than other types of companies. Low-interest rates imply low discount factors for far-future cash flows, which effectively means that investors are putting more weight on long-term than short-term future profits. This is a potential vulnerability of the sector as rates rise.” – Moody’s (emphasis added)How high could long-term rates go and how fast? Well, the blue-chip economist consensus expects the 10-year yield to rise from 0.5% in August 2020 to about 2.5% by the end of 2030. The Congressional Budget Office’s latest long-term forecast expects 2.6% 10-year yields by the end of the decade. However, that forecast also doesn’t expect rates to rise significantly higher from today’s 0.7% through the end of 2021. Such modest and gradual increases in interest rates are one of the major reasons for the TINA (there is no alternative) rally in red hot growth stocks. However, while the overall economist consensus is that long-term rates won’t rise too far, too fast, Moody’s has a very different opinion and one that could have dire implications for your portfolio. Moody’s New Long-Term Forecast Could Torpedo Your Retirement Portfolio The outlook calls for stock market values to gradually decline in the near term, with the S&P 500 projected to gradually drop to back under 3,000 (around a 13% drop from current levels) by early 2021 as recovery from the pandemic is slower than market participants expect, followed by a gradual recovery. Treasury yields will stay near current levels before gradually rising in 2021.” – Moody’s (emphasis added). Now, Moody’s isn’t predicting a major market crash in the short-term, nothing like the hyperbolic claims from the likes of John Hussman for the past decade (up to a 70% market crash). What does Moody’s think could trigger a historically normal 13% correction from here, which would equate to a 20% mild bear market? Moody’s estimates that stocks are currently about 9% overvalued but rising long-term interest rates will make stocks even more overvalued in the future. “Long-term interest rates will steadily increase from 2021 onward, with the 10-year rate reaching 4.1% by 2030. Unless there is significant compression of the equity risk premium, the fundamentals will then weigh on values over the decade.” – Moody’s (emphasis added) The major thing that momentum traders have been relying on to keep market multiples at a “permanently high plateau” is long-term rates that stay near current levels for the foreseeable future. If the 10-year yield were to very gradually rise to the 2.5% or so that most blue-chip economists expect, over a period of 10 years, then stocks would not likely face a major shock. Moody’s own long-term model, before this latest update estimated 1.75% to 2.25% 10-year yields through the end of this decade. That’s the kind of low rates that, while not levitating stocks at current levels forever, could at least avoid a valuation induced bear market. But, if Moody’s new forecast, for a 3.4% increase in long-term rates is correct? Well, that’s a totally different story. In part two of this series, I’ll explain just how bad such a long-term spike in interest rates could be for stocks, but more importantly how you can protect yourself in case Moody’s, one of the 16 most accurate economists in the world, is right about a potential lost decade for stocks. Want More Great Investing Ideas? 7 “Safe-Haven” Dividend Stocks for Turbulent Times When Does the Next Bull Run Start? Chart of the Day- See the Stocks Ready to Breakout SPY shares were trading at $336.59 per share on Wednesday morning, up $4.22 (+1.27%). Year-to-date, SPY has gained 6.08%, versus a % rise in the benchmark S&P 500 index during the same period."}]}