{"article": [{"url": "https://stocknews.com/news/spy-cboe-using-options-to-trade-mergers-acquisitions/", "published": 1596802100.0, "headline": "Using Options to Trade 'Mergers & Acquisitions'", "body": "One would have thought the recent market volatility and economic uncertainty would put mergers and acquisitions on hold as corporations hunker down, protect market share, and build up their balance sheets. But instead, what we’re seeing, possibly as the sell-off made some targets both more vulnerable and less expensive, a pick-up in M&A activity in recent weeks. The takeovers usually come with a premium bid, which can often be 25%-50% or me to the current stock price and offers investors a quick way to cash out. But, this often comes after a long period holding a stock that has been underperforming. I’m going to show you a way to use a low-cost options strategy as a way to play anticipated mergers that can yield large profits. The action has been both strategic, such “TeleDoc (TDOC)” acquiring “Livongo (LVGO)” or few such as LVHM’s bid for Tiffany (TIF) surfaced a few weeks ago and others such as “SCHWAB (SCHW)” move to acquire “TD Ameritrade (AMTD)” and Novartis (NVS) purchase of Medicines Co. (MDCO) — both came as a surprise and sent shares surging. In tech-land, most of the activity has been large players gobbling private companies that now find the path to an IPO more difficult. “Uber (UBER)” recently bought Postmates in response to “Grubhub (GRUB)” merging with European food delivery company, Just Eat Takeaway.com (TKAYY). There has also been a notable increase in private equity firms using the cheap cost of capital buyout cash flow positive businesses. For example, a few months ago, “Red Robin Gourmet Burger (RRGB)” shares popped over 10% after receiving a buy-out bid from Vintage Capital for $40 a share. Shares have since slumped back below $10 but the rumors persist. 7 \"SAFE HAVEN\" Dividend Stocks for Turbulent TimesIn fact, the restaurant and retail space are ripe for M&A activity as there is a need for consolidation and the stronger players take-out. This is reminiscent of the last stages of circa 2006-2007 pre-crisis, as anything with a real estate component was levered up with debt, taken private…and we know that ended. But we’re not here today to judge or make forecasts. Rather, how do we profit from such activity without taking too much risk. Options for Takeovers Each deal comes with various specifics from the form of payment cash/stock, the premium offered, to regulatory hurdles that can impact the time frame to closing. Trying to capitalize on a broad trend of M&A by simply buying call options is basically throwing darts. You may hit a bull’s eye but unless you are an expert, or have some special knowledge, it will usually take a lot of throws. Let’s look at how options can be used to take a more conservative approach to capture value if a merger does occur and minimize the losses if it doesn’t. This options strategy will let you speculate on takeovers while minimizing the risk. Selling the Calendar Spread The approach I’m taking is an atypical use of a calendar, or time spread. Some quick definitions: A calendar spread consists of buying and selling calls (or puts) with different expiration dates. If the near term option is sold and the longer-dated purchased, usually for a debit, this is considered being long the spread. It is mostly employed on the expectation of a gradual move higher or lower in stock price. The notion being that the sale of the near term option helps finance the cost of the longer-dated option. A diagonal calendar spread refers to using two different strike prices to gain a more directional bias. Typically, this would involve buying a longer-dated closer to the money options and selling the near term further out of the money option. This approach costs money or is done for a debit and its profitability is dependent on clearing that cost basis. For a potential takeover play, we are going to turn these typical approaches on their head. That is; buy a lower strike call and sell a longer-dated higher strike call. This strategy will be done for a credit and will profit if a takeover is reached, regardless of the price. The reasoning is that once a deal is announced and agreed upon all options will approach their intrinsic value. The concept is that once a deal occurs all options across all expirations will drop in implied volatility essentially losing their time premium, and be valued at intrinsic value. Meaning, the time premium of the longer-dated calls will evaporate given the upside potential of the stock has been eliminated. Let’s look at the above mentioned RRGB as an example that will allow us to focus on the numbers and reasoning for using such an approach. Let’s assume a bid does emerge in the $20 per share range which would be a 100% premium to the current price. One could buy the January 2021 $10 call and sell the March 2021 $20 call for a mere $1.00 net debit. If a deal occurs near the expected range by the end of the year, or before the January 2021 options expiration, the spread will be worth $10 or a 1,000% gain! The worst scenario would be if share price merely meandered between $10-15 for the next few months with no bid in sight. Using a diagonal calendar spread for a credit, one can take advantage of a takeover or merger without having to predict the exact price or timing. Click here to find out more about Steve Smith’s profitable and unique approach to options trading — the Options360 service. Want More Great Investing Ideas? 9 “BUY THE DIP” Growth Stocks for 2020 How to Trade THIS Stock Bubble? 7 “Safe-Haven” Dividend Stocks for Turbulent Times SPY shares were trading at $334.41 per share on Friday afternoon, up $0.08 (+0.02%). Year-to-date, SPY has gained 4.97%, versus a % rise in the benchmark S&P 500 index during the same period."}]}