{"article": [{"url": "https://stocknews.com/news/uaa-the-best-retail-stock-to-own-next-week/", "published": 1599134900.0, "headline": "The Best Retail Stock to Own Next Week", "body": "Next week marks not only the unofficial end of summer, but a holiday-shortened week and much-needed break for many. As Labor Day week looms, some seasonal quantitative data suggests retail stock Under Armor Inc (NYSE:UAA) might be worth a closer look. Earlier this week, we profiled the 25 best stocks to own during Labor Day week. Yesterday, we narrowed the focus to look at the 25 best-performing stocks on the S&P 500 during Labor Day week. Stocks had to have at least eight years’ worth of returns to make the list, which was cultivated by Schaeffer’s Senior Quantitative Analyst Rocky White. Under Armour stock has generated the third healthiest average returns, at 2.8%, and has ended the week higher 80% of the time. It’s also worth noting that UAA is the only stock in the personal goods sector to show up on the list. The athleisure retailer has taken a 50% haircut in 2020, but has managed to tack on 10% this quarter. A move higher and of similar magnitude would have Under Armour stock knocking on the door of the $11 level for the first time in three weeks. Since early July, UAA’s 80-day moving average has emerged as a floor, an area that coincides with the round $10 level. 7 Best ETFs for the NEXT Bull Market A short squeeze could keep the wind at the equity’s back. Short interest fell by 18.5% in the two most recent reporting periods. However, the 19.18 million shares sold short still account for a healthy 10.2% of UAA’s total available float. The options pits are predominantly focused on calls, despite limited absolute volume. In the past 10 days, 4,717 calls have exchanged hands on the International Securities Exchange (ISE), Cboe Options Exchange (CBOE), and NASDAQ OMX PHLX (PHLX), compared to just 401 puts. The resultant call/put volume ratio of 11.76 sits two percentage points from an annual high, suggesting a healthier-than-usual appetite for bullish bets of late. Call options are certainly an intriguing route, considering the implied volatilities call options are near parity with their put counterparts. This is per Under Armour’s 30-day implied volatility (IV) skew of 2.3%, which registers in the low 13th percentile of its 12-month range. Keeping track of the week’s stock market activity is no easy feat. Our Schaeffer’s Market Mashup podcast gives you a quick 15-minute look at hot-button investing news and trends, as well as interviews with analysts and traders to help you craft a rock-solid options strategy. Tune into the latest episode of Market Mashup to up your investment game. UAA shares fell $0.12 (-1.15%) in after-hours trading Thursday. Year-to-date, UAA has declined -51.71%, versus a 8.42% rise in the benchmark S&P 500 index during the same period."}]}