{"article": [{"url": "https://stocknews.com/news/home-zm-why-shares-of-at-home-group-stock-will-continue-to/", "published": 1599048500.0, "headline": "Why Shares of At Home Group (HOME) Will Continue to Rally", "body": "At Home Group (HOME) has jumped by over 22% and nears the highest levels since 2018. At Home Group earnings beat estimates amid the pandemic. The robust housing market and rush to the suburbs may allow for more gains after the correction. Being at the right place at the right time is critical to success – and there is no place like home amid the coronavirus crisis. At Home Group, which is a retail chain focusing on home decor products, has been one of the beneficiaries of these times. HOME shares leaped by around 22% to $23.33 on Wednesday, hitting the highest level since May 2019. Greedy investors may frown at the low-tech’s gains, which fall short of another COVID-19 era winner Zoom Video (ZM). Zoom’s shares soared by 40% and that may be only the beginning. Nevertheless, there are reasons to expect additional gains after a post-earnings-day correction. 7 \"SAFE HAVEN\" Dividend Stocks for Turbulent Times Home stock news At Home Group reported a net income of $89.4 million in the second quarter, nearly nine times above the same quarter last year. Earnings per share stood at $1.39 – beating estimates of $1.31 – while net sales jumped by over 50% to $515.2 million. During the worst days of the pandemic, many Americans that were locked at home began investing in their immediate surroundings. At Home Group offers around 50,000 products from the very basics to heavy furniture. Demand for such goods has remained robust even after the reopening. Those living in small urban apartments have rediscovered the benefits of having more space and sunlight available in the suburbs. The pandemic may have reversed a trend of moving into the cities – that was probably about to fade after house prices soared. Sales of new homes topped 900,000 annualized in July, the highest since 2006. A similar trend has been seen in purchases of existing dwellings. The Federal Reserve’s low-interest rates have been pushing borrowing costs lower, adding fuel to the housing market – despite high unemployment. Moreover, HOME has room to rise as the trend toward larger suburban homes implies a greater need for such products than for apartments in the city. Overall, At Home Group has more room for growth. HOME shares were trading at $17.09 per share on Wednesday afternoon, down $6.24 (-26.75%). Year-to-date, HOME has gained 210.73%, versus a 11.38% rise in the benchmark S&P 500 index during the same period."}]}