{"article": [{"url": "https://stocknews.com/news/pg-procter-gamble-is-now-the-time-to-buy/", "published": 1599566900.0, "headline": "Procter & Gamble: Is Now the Time to Buy?", "body": "With a market capitalization of over $343 billion, Procter & Gamble Company (PG) is the second largest consumer goods company in the world. It manufactures products under five segments – Beauty, Grooming, Health Care, Fabric & Home Care, Baby, and Feminine & Family Care. The rising demand for consumer packaged goods (CPG) and hygiene products was the key driving factor behind PG’s growth in the last reported quarter. Net sales grew 4% year-over-year in the fiscal fourth quarter ended June 2020. Gross profit increased 7% from the year-ago value to $8.75 billion, while net earnings of $2.78 billion improved significantly from the prior-year loss. PG’s price momentum and impressive financial performance in the recent quarters despite the pandemic-driven challenges have helped it earn a “Strong Buy” rating in our POWR Ratings system rating system. 7 \"SAFE HAVEN\" Dividend Stocks for Turbulent TimesHere’s how our proprietary system evaluates PG: Trade Grade: A PG is currently trading above its 50-day and 200-day moving averages of $130.22 and $122.07 respectively, indicating short term bullishness of the stock. PG returned 18.8% in the past three months alone, signaling an uptrend. The pandemic-induced increase in demand for PG’s products was the key driver for the stock’s short-term price performance. The onset of the healthcare crisis increased the sale of personal hygiene, household cleaning and cleansing products specially in North America and China, thereby increasing PG’s revenues and earnings. Buy & Hold Grade: A PG is well positioned in terms of proximity to 52-week high, which is a key factor in determining the Buy & Hold Grade. The stock is currently trading just about 4% below its 52-week high of $141.70. PG returned more than 49% to its investors through price gains in the past three years. A steady increase in demand combined with a rise in product prices allowed PG to generate higher profits over this period. PG’s EPS witnessed a CAGR of 10.4% over the past three years. Peer Grade: A PG is ranked #1 out of 34 stocks in the Consumer Goods industry. Other popular stocks in this industry include Unilever NV (UN), Kimberly-Clark Corporation (KMB) and Helen of Troy Ltd. (HELE). PG’s 8.9% year-to-date returns exceed the performance of UN which gained 2.1%. However, KMB and HELE have gained 9.1% and 9.8%, respectively, over this period. Industry Rank: A The consumer goods industry is ranked #19 out of 123 StockNews.com industries. Because of stable demand for daily essentials, the industry is well positioned to combat the pandemic-driven recession. In fact, the consumer goods industry witnessed a rise in the demand for its products during the initial months of the pandemic, as people were stocking up on the essentials. Overall POWR Rating: A (Strong Buy) Overall, PG is rated a “Strong Buy” due to its impressive past performance, short-and-long-term bullishness, and price momentum, as determined by the four components of our overall POWR Rating. Bottom Line PG is a good investment for investors looking for stability and growth in the long run. It is also a consistent dividend paying stock, currently yielding 2.33%. Analysts estimate the EPS to rise 2.9% in the upcoming quarter. Of the 21 Wall Street analysts that rated the stock, 12 have given it a “Strong Buy.” Want More Great Investing Ideas? 7 Best ETFs for the NEXT Bull Market Will Stocks Fall into Historical September Slump? 9 “BUY THE DIP” Growth Stocks for 2020 PG shares fell $0.04 (-0.03%) in after-hours trading Tuesday. Year-to-date, PG has gained 10.91%, versus a 4.59% rise in the benchmark S&P 500 index during the same period."}]}