{"article": [{"url": "https://stocknews.com/news/cdna-azre-bita-calx-4-small-cap-stocks-analysts-love/", "published": 1600258100.0, "headline": "4 Small-Cap Stocks Analysts LOVE", "body": "Though the large-cap stocks have been the main drivers of the market rally since the pandemic-led crash earlier this year, small-cap stocks were no less attractive to analysts and investors. This is evident from the Russell 2000 index’s 39% gain since mid-March, compared to the S&P 500’s gain of 34%. There is always a risk associated with investing in small-cap stocks as they tend to be more volatile than their mid and large peers. However, it’s worth taking a look at some as valuations of many large-cap stocks are extremely high. Given their smaller size, these companies have more room for growth than large-cap stocks. CareDx, Inc. (CDNA), Azure Power Global Limited (AZRE), Bitauto Holdings Limited (BITA), and Calix, Inc (CALX) are small-cap stocks that Wall Street analysts recommend buying based on their fundamental strength and intriguing upside potential. 9 \"BUY THE DIP\" Growth Stocks For 2020CareDx, Inc. (CDNA) CDNA is a leading precision medicine solutions company focused on the discovery, development, and commercialization of clinically differentiated, high-value healthcare solutions for transplant patients and caregivers. It offers testing services, products, and digital healthcare solutions along the pre- and post-transplant patient journey. The American Society of Nephrology’s journal, Kidney360, recently published a study evaluating CDNA’s AlloSure, a transplant-focused analytical tool for allograft rejection using donor-derived cell-free DNA, ability to have a significantly superior turnaround time compared to other monitoring tools. CDNA closed yesterday’s trading session at $33.75, gaining more than 56% year-to-date. All six Wall Street analysts issuing recommendations for CDNA have rated it a “Strong Buy.” The stock’s consensus price target is $44.5, which is 31.9% higher than yesterday’s closing price. The stock hit a 52-week low of $13.04 in March and has recovered more than 142% since then. CDNA had an impressive fiscal second quarter, as revenues rose 33% year-over-year to $41.8 million. The company provided over 17,100 AlloSure Kidney and AlloMap Heart patient results. It has grown its top-line at a CAGR of 47% over the last three years. CDNA also completed a follow-up public offering during the quarter, raising $134.6 million. However, CDNA is still not profitable yet. The company reported loss of $0.15 per share for the quarter, improving significantly from quarter-ago loss of $0.19 per share. The company has been extensively investing in its research and development. Hence, the street estimates EPS to grow 137.5% next year. How does CDNA stack up for the POWR Ratings? B for Trade Grade B for Buy & Hold Grade B for Peer Grade B for Industry Rank B for Overall POWR Rating. It is also ranked #19 out of 58 stocks in the Medical – Diagnostics/Research industry. Azure Power Global Limited (AZRE) AZRE is a leading independent solar power producer in India. It manages the development and operation process, providing low-cost solar power solutions to its customers. It has 43 utility scale projects and multiple commercial rooftop projects with a combined capacity of 1,808 MWp. AZRE has been named the most sustainable company in the solar energy industry by the World Finance magazine this year. It has also been ranked as the top 10th global renewable power producer by Sustainalytics recently. AZRE closed yesterday’s trading session at $28.94, gaining 130% year-to-date. The stock has gained huge momentum this year and is continuously hitting fresh highs. The consensus Wall Street analyst recommendation for AZRE is a “Strong Buy.” The stock has gained more than 87% over the past three months. The last quarterly results reported by the company was for its fiscal first quarter that ended June 2020. Top-line grew 16% year-over-year to $52.2 million. Operating and Committed Megawatts increased 112% from its year-ago value to 7,1115 MWs. Electricity generation increased 26% year-over-year to 883.9 million kWh. EPS for the quarter came in at $0.01, beating the consensus estimate by 105.3%. The company expects approximately 90% of its revenue for fiscal year 2021 to come from projects already commissioned and operating; and which have not been materially impacted by the pandemic. Hence, the market expects EPS to grow 110.8% next year. AZRE’s POWR Ratings reflect this promising outlook. It has an overall rating of “Strong Buy” with a grade of “A” for Trade Grade, Buy & Hold Grade, and Peer Grade. Among the 14 stocks in the Solar industry, it’s ranked #3. Bitauto Holdings Limited (BITA) BITA provides internet content and marketing services, and transaction services for the automobile industry in the People’s Republic of China. It operates in three segments – Advertising and Subscription Business, Transaction Services Business, and Digital Marketing Solutions Business. With a year-to-date gain of 6.3%, BITA closed yesterday’s trading session at $15.77. The stock has gained 28% over the last six months. Two out of four Wall Street analysts have issued a “Strong Buy” rating for this stock. BITA’s second quarter has been adversely affected by the pandemic. Revenues declined 35% year-over-year to $277 million primarily due to weak vehicle sales and increasingly fierce competition in China’s online automobile advertising sector. However, the paying subscriber base increased slightly during the quarter, helping revenue from the advertising and subscription business segment to rise 2.2% year-over-year. The company’s transaction services business facilitated approximately 69,000 financed transactions during the quarter. Despite reporting a negative EPS of $0.73 for the quarter, China’s gradual economic recovery following the virus outbreak is presenting both challenges and opportunities for the company. Retail passenger vehicle sales and dealer inventory levels are reaching back to the pre-pandemic levels. In line with the macro situation, the street expects EPS to grow 97.7% next year. It’s no surprise that BITA is rated a “Strong Buy” in our POWR Ratings system. It also has a grade of “A” for Trade Grade, Buy & Hold Grade, and Peer Grade, and a “B” for Industry Rank. It is ranked #4 out of 115 stocks in the China industry. Calix, Inc (CALX) CALX provides cloud and software platforms, and systems and services, required to deliver unified access networks and smart premises in the United States and internationally. Innovative communications service providers rely on CALX’s platforms to help them master and monetize the complex infrastructure between their subscribers and the cloud. The company has been witnessing strong demand for its platforms and is rapidly expanding its customer base. CALX added 18 new customers in the last quarter. Jade Communications, one of CALX’s clients, reportedly saved 45% on capital expenditure with Calix Intelligent Access EDGE. CALX closed yesterday’s trading session at $18.99, gaining more than 137% year-to-date. The consensus Wall Street Analyst price target for CALX is $23.25, indicating a potential upside of 25.2%. The stock is already up 173% over the last six months and is just trading 16.3% below its all-time high of $22.69. CALX reported a top-line of $119 million for its second quarter that ended in June 2020, indicating a 19% increase year-over-year. It delivered a gross margin of 47.4%. The company’s EXOS platform shipments grew more than 60% year-over-year while the AXOS platform increased 70% in the same period. CALX also went for a follow-up public offering of its common shares worth $56 million during the quarter. The EPS for the quarter came in at $0.14, beating the consensus estimate by 180%. CALX’s work-from-anywhere culture should continue to fuel the company’s growth. Hence, the street remains optimistic about the potential to capitalize on additional opportunities as the year progresses. The EPS is estimated to grow 766.7% in the current year to $0.52. As per our POWR Ratings, CALX is rated a “Buy”. It holds a grade of “A” in Peer Grade, and a “B” in Trade Grade. It is currently ranked #7 out of 53 stocks in Technology – Communication/Networking industry. Want More Great Investing Ideas? 7 Best ETFs for the NEXT Bull Market Stock Market Outlook: Before & After the Election Chart of the Day- See the Stocks Ready to Breakout CDNA shares were trading at $34.50 per share on Wednesday afternoon, up $0.75 (+2.22%). Year-to-date, CDNA has gained 59.94%, versus a 7.42% rise in the benchmark S&P 500 index during the same period."}]}