{"article": [{"url": "https://stocknews.com/news/sq-gddy-sedg-umc-4-best-performing-tech-stocks-in-august/", "published": 1597147700.0, "headline": "4 BEST Performing Tech Stocks in August", "body": "The spread of the coronavirus has adversely affected the U.S. economy and caused uncertainty for the stock market. Companies are being forced to cut jobs and reduce expenditures. Employees are now working from home wherever possible. The way of doing business has also changed. Now businesses are increasingly shifting their processes online and individual consumers are also spending more time on the internet. This has driven greater demand for the services of technology companies. These days, technology stocks are being seen as “defensive stocks.” A term that used to be reserved for utility and consumer staples stocks. That’s because the essential nature of technology is lowering the elasticity of demand. 7 \"SAFE HAVEN\" Dividend Stocks for Turbulent TimesSquare, Inc. (SQ), GoDaddy, Inc. (GDDY), SolarEdge Technologies, Inc. (SEDG) and United Microelectronics Corporation (UMC) are four such stocks that have outperformed the market in the month of August so far. Square, Inc. (SQ) SQ develops and markets point-of-sale software globally. One of its primary offerings is Square Register, which allows retailers to better handle inventory, digital receipts, and sales reports. The company delivered a stellar performance in the second quarter of the year, which boosted its stock prices. For the quarter ending June 30th, 2020, the company reported a rise in revenue of 64% year-over-year. The gross profit from their Cash App also improved 167% year-over-year. There was a parallel rise in the number of active Cash users which grew to 30 million for the quarter. SQ’s earnings surprise history is impressive as well with the stock beating consensus EPS estimates in three of the trailing four quarters. In the lastest quarter, the stock beat market expectations and delivered an earnings surprise of 460%. So far in August, the stock has returned almost 8.4%. How does SQ stack up for the POWR Ratings? A for Trade Grade B for Buy & Hold Grade A for Peer Grade B for Industry Rank B for Overall POWR Rating You can’t ask for better. The stock is also ranked #3 out of 141 stocks in the Financial Services (Enterprise) industry. GoDaddy, Inc. (GDDY) GDDY develops and provides cloud-based technology for web-design professionals, small businesses, and individual users. The company recently acquired Neustar’s registry business in an effort to boost the security of its offerings. GGDY has also reportedly changed the structuring of its business processes for outbound sales and operations to align them with the “new normal” triggered by the pandemic. For the quarter ending June 30th, 2020, GDDY saw a rise in revenue of 9.4% year-over-year. The company also improved its unlevered free cash flow by a factor of 10.8%. Further, GDDY witnessed a rise in bookings of 10.7% year-over-year taking the total to $936.3 million. Though GDDY missed the consensus EPS estimate last quarter, it beat the estimates in the prior three quarters. GDDY has witnessed a rise in stock price by more than 11% so far this month. It’s no surprise that GDDY is rated a Buy in our POWR Ratings system. It also has a grade of A for Trade Grade. In the 34-stock Internet – Services industry, it is ranked #10. SolarEdge Technologies, Inc. (SEDG) SEDG manufactures and delivers solutions for solar power harnessing. SolarEdge has recently partnered with LG Chem to make home batteries. Their partnership allows consumers new options for reliable and cheap home energy solutions. For the quarter ending June 30th, 2020, the company delivered revenues of $331.9 million, which is an increase of 2% year-over-year. SEDG’s net income was also up 11% to $36.7 million. The company also reported an improvement in cash flow from operating activities to $59.3 million. The earnings surprise history for SEDG looks pretty good, as the company beat the consensus EPS estimates in three of the trailing four quarters. SEDG has had a stellar performance in August so far, with its stock price gaining more than 20%. SEDG’s strong fundamentals are reflected in the POWR Ratings. It is rated a Strong Buy with a grade of A in Trade Grade,Buy & Hold Grade, and Peer Grade. Within the Solar industry, it’s ranked #1 out of 14 stocks. United Microelectronics Corporation (UMC) UMC delivers advanced IC production for appliances in almost all large sectors of the electronics industry. The company has reported sales for July 2020, in which the company saw a rise in net sales of 12.9% year-over-year. UMC estimates that it will utilize 95% or so of its production capacity in the third quarter of the year. For the quarter ending June 30th, 2020, UMC’s revenues came in at$44.4 billion which was up 23.2% year-over-year. The gross profit of the company improved 81.5% year-over-year. In the same quarter, UMC delivered an earnings surprise of 80% with an EPS of $0.09. UMC’s stock price has risen in August by more than 16% so far. The momentum of the stock may continue for the rest of the month. It’s no surprise that UMC is rated a Buy in our POWR Ratings system. It also has a grade of A for Trade Grade and Industry Rank. In the 86-stock Semiconductor and Wireless Chip industry, it is ranked #15. Want More Great Investing Ideas? 3 Possible Directions for the Stock Market from Here How to Trade THIS Stock Bubble? 9 “BUY THE DIP” Growth Stocks for 2020 SQ shares rose $0.25 (+0.18%) in after-hours trading Tuesday. Year-to-date, SQ has gained 120.99%, versus a 4.46% rise in the benchmark S&P 500 index during the same period."}]}