{"article": [{"url": "https://stocknews.com/news/gld-iau-gdx-will-gold-make-new-highs-in-2021/", "published": 1602245300.0, "headline": "Will Gold Make New Highs in 2021?", "body": "Gold is up 27% so far this year, making it one of the best-performing assets. However, since early-August, it’s down nearly 7.5%. This is the first major decline in gold since March when, due to the coronavirus, there was a crash in nearly every asset. Gold was no exception, as it dropped from $1,700 to $1,450. 9 \"BUY THE DIP\" Growth Stocks For 2020However, this turned out to be an excellent buying opportunity as gold climbed all the way to a new, all-time high of $2,089 until early-August. Since that peak, it’s given back about 30% of these gains. The next question for investors is whether this move lower marks the end of the bull market in gold, or is this a buying opportunity? I believe that we are in the early innings of the bull market in gold. While in the short-term, gold’s price action may remain muddled, as it continues to digest these gains. However, in the long-term, this will prove to be a buying opportunity. Some of the best ways to take advantage of rising gold prices are with the SPDR Gold Trust (GLD), the iShares Gold Trust (IAU), or the VanEck Vectors Gold Miners ETF (GDX). What Drives Gold Prices To understand why gold is in the early stages of its bull market, it’s important to note that gold prices are driven by real interest rates. Real interest rates are calculated by taking the difference between interest rates and inflation. The chart above shows the inverse relationship between the two, and it makes sense from a logical perspective. Gold pays no interest or dividends, so the opportunity cost of holding it is the risk-free return after inflation. Thus, gold is less desirable in a scenario, where real interest rates are rising. Conversely, demand for gold increases, when they are falling. For example, from October 2008 to September 2012, real rates fell from 3.1% to -0.8%, and gold climbed from $760 to $1,800. More recently, from October 2018 to August 2020, real rates declined from 1.1% to -1.08%, and gold went from $1,200 to over $2,000. Thus, any bullish thesis on gold is either implicitly or explicitly arguing that real interest rates will decline. And, in the coming months, inflation will likely trend higher, while interest rates remain depressed. Higher Inflation The case for higher inflation is simple. Governments, all around the world, are engaging in fiscal stimulus to compensate for the damage wrought by the coronavirus. The chart below shows the amount of fiscal stimulus deployed as a percent of GDP by some of the largest economies: (Source: Statista) According to McKinsey, the stimulus is dwarfing the measures taken during the 2008-2009 global crisis by a significant margin. (source: McKinsey) Of course, this is resulting in record deficits. The US is projected to have a $3.3 trillion deficit in 2020 as a result of decreased tax revenue, increased transfer payments, and fiscal stimulus. The chart below shows that inflation trends higher with bigger deficits. Of course, the exception is recessions, when a decrease in aggregate demand results in deflation. In the US, current polling shows that the Democrats are favored to win the Presidency, a majority in the Senate, and retain control of the House. They have an ambitious agenda with a green energy plan, infrastructure spending, and expansion of healthcare that would certainly lead to more than $2 trillion in deficits. If President Trump is reelected, he has also proposed additional tax cuts. In simple terms, inflation is too much money chasing too few goods which lead to higher prices. Fiscal stimulus and deficit spending will result in “too much money”. The coronavirus has caused all sorts of supply-chain disruptions which will result in “too few goods” at least for the next few months while supply and demand find its equilibrium. Low-Interest Rates Are Here to Stay While fiscal authorities are aggressively engaged, monetary policy is also accommodative which is evident in the Fed’s balance sheet which has grown by 75% over the last six months. However, this simply indicates what the Fed has already done. In terms of the future, FOMC Chair Powell has already told us that he is not going to hike rates until the end of 2021. He’s also changed the criteria by which the Fed would consider raising rates by changing its inflation framework. Given the long period of time that inflation has been below 2%, he’s unwilling to hike rates until inflation has spent a considerable amount of time above 2%. Powell has also mused about additional steps the Fed can take if it’s not achieving its goals including capping rates on long-term bonds or letting QE run until specific employment goals are reached. Typically when inflation starts running hot, the Fed raises interest rates. The Fed is clearly communicating that it’s out of that business at least for the next year. 2008 to 2011 Analogue We had a very similar situation in terms of inflation, interest rates, fiscal, and monetary policy from 2008 to 2011. Coming out of the Great Recession, there was a massive deficit and fiscal stimulus. Monetary policy was also at maximum dovishness with the Fed cutting rates to zero and engaging in QE. It resulted in real interest rates moving lower, and gold exploding higher. One interesting observation from that period is that following its initial thrust off its lows, there was a multi-month consolidation period to digest these gains between March 2009 and September 2009. Likely, we are currently in a similar phase which will also resolve higher. Conclusion There are multiple paths to lower real interest rates. If the economy is stronger than expected, it will generate additional inflationary pressures, while the Fed remains on the sidelines. If the economy is weaker than expected, the Fed will act and push rates even lower. Either outcome is bullish for gold. There are some additional catalysts that investors should consider. There is a possibility that political risk could increase with a contested election. Election Night could end with one candidate in the lead but that could change as mail-in ballots are counted in the ensuing days and weeks. Given the polarized nature of the electorate and increased tensions, this could be an outcome that undermines faith in the US government and its institutions and increases the demand for hard assets like gold. Another looming catalyst is that the coronavirus is still lingering. As the economy continues to return to normal, the threat of an outbreak increases. Many countries that seemed to have “curbed the curve” are now reinstituting lockdowns due to rising case counts. Thus, the tradeoff remains between health risks and economic activity. Health officials are adamant that winter brings with it an increased risk of an even bigger wave. While this would be unfortunate from an economic and health standpoint, gold would benefit as it would compel even more aggressive doses of fiscal and monetary stimulus. Want More Great Investing Ideas? 7 Best ETFs for the NEXT Bull Market What is the Cure for Stock Market Volatility? Chart of the Day- See Christian Tharp’s Stocks Ready to Breakout GLD shares were trading at $180.38 per share on Friday afternoon, up to $2.53 (+1.42%). Year-to-date, GLD has gained 26.23%, versus a 9.42% rise in the benchmark S&P 500 index during the same period."}]}