{"article": [{"url": "https://stocknews.com/news/jnj-this-cant-miss-strategy-has-failed-for-over-a-decade/", "published": 1594814900.0, "headline": "This \"Can’t-Miss\" Strategy Has Failed for Over a Decade", "body": "It’s a puzzle that’s haunted Wall Street for a few years now: what the heck happened to value investing? Value investing was the strategy that long occupied the minds of Wall Street’s best stock-pickers. From Warren Buffett to Ben Graham to Peter Lynch, the focus was always on value investing. All prudent investors needed to do was buy underpriced stocks, hold them, and wait for the rebound. There were hundreds of books dedicated to the topic. 7 Best ETFs for the NEXT Bull MarketThese investors weren’t alone. There was a lot of academic work to back up their thinking. In fact, value has been shown to work in many different countries and contexts. Best of all, it rewards one of the most important virtues: patience. But over the last 10 years, value investing has bombed. Not only has value lost to growth investing, but it’s lost by a long shot. Check out this chart below. It shows the S&P 500 Growth Index (in black) along with the S&P 500 Value Index (in blue) since the beginning of 2007. Over 13 1/2 years, value stocks are up only 41%, while growth stocks have gained more than 240%—that’s nearly six times better. Sure, I can understand value lagging for a year or two. That’s natural. But now we’re looking at 13 years of continuous underperformance. And the longer the rally goes on, the worse value stocks seem to do. What’s going on? A Possible Explanation I have a different view. I don’t believe that value investing has failed. Instead, what we’re seeing is a failure in methodology. Let me explain. After the financial crisis hit in 2007-2008, many banks were totally broken up. As a result, these banks had very elevated book values, meaning the accounting value of their businesses was artificially high. Even today, many of the large banks trade near one times book value, sometimes less. As a result, lots of banks have gotten unfairly swept into the value category. This really reflects the particulars of that industry, not whether the shares are cheap or not. In essence, the value index has become a stealth banking index. It’s not just banking. Many energy stocks have been classified as value stocks. Again, that’s really due to the plunging price of oil. The big energy companies have assets that are accounted for at much higher valuations. Only in accounting terms are these companies value stocks. What’s being called a failure in value is really a failure in banks and oil. Energy makes up just 0.7% of the S&P 500 Growth, but it comprises 5.9% of the S&P 500 Value Index. Financial stocks comprise 4.5% of the S&P 500 Growth but 18.3% of the S&P 500 Value Index. That’s quite a tilt. As a result, what’s being called the Death of Value Investing is really the long-term lousy performance of two sectors. There’s still a lot of opportunity for real value investing if you know where to look. Johnson and Johnson: 58 Straight Dividend Hikes Johnson & Johnson (JNJ) A good example of a value stock in the classic sense is Johnson & Johnson (JNJ). The health care giant trades with a dividend yield of nearly 2.9%. That’s quite good, especially in this interest-rate environment. Best of all, J & J has increased its dividend every year for the last 58 years. Johnson & Johnson is expected to earn $9 per share next year. That means it’s going for about 16 times earnings. The earnings could even be higher. Consider than the company has beaten earnings for the last 13 quarters in a row. The streak could even be longer but that’s as far back as my data goes. The next earnings report is due out on July 16. The consensus on Wall Street is for earnings of $1.48 per share. Don’t be surprised to see another earnings beat. Want more great investing ideas? Download free the “10-Step Options Trading Checklist” you need before making a trade. The Virtual Trading Pit Is Open: Trade Set-ups, Training, New Trading Ideas How to Try Out Options Without Risking a Penny JNJ shares . Year-to-date, JNJ has gained 3.00%, versus a 1.03% rise in the benchmark S&P 500 index during the same period."}]}