{"article": [{"url": "https://stocknews.com/news/wkhs-idex-ino-3-best-performing-robinhood-100-stocks-for-the-quarter/", "published": 1593691700.0, "headline": "3 Best Performing Robinhood 100 Stocks for the Quarter", "body": "As we just ended the second quarter of 2020, now is a great time to evaluate some stocks with the best performance in the last 3 months. The stocks I’m going to cover are all on the Robinhood Top 100. This list is comprised of the most popular stocks owned by investors that use the Robinhood app. Over 100,000 Robinhood investors own each of the three stocks on this list. Their market caps range from $359 Million to $4.4 Billion, while their prices range from $2 a share to $25 a share. All of these stocks have at least returned over 470% this past quarter. Here are the three best-performing stocks on the Robinhood 100 for the second quarter 2020: 7 \"SAFE HAVEN\" Dividend Stocks for Turbulent TimesIdeanomics (IDEX) IDEX is a global company that facilitates the adoption of commercial electric vehicles and developing next-generation financial services and Fintech products. The company’s electric vehicle division, Mobile Energy Global, provides group purchasing discounts on commercial electric vehicles, EV batteries, and electricity. The company also includes DBOT ATS and Intelligenta, which provide financial services solutions that are powered by AI and blockchain. The stock was up over 526% for the second quarter. IDEX recently had a huge price gain after it disclosed that its Mobile Energy Global subsidiary had completed the delivery of multiple orders totaling 117 units. The company has also been receiving negative attention due to accusations of fraud. One short-seller, Hindenburg Research, said it sent an investigator to their Mobile Energy Group facility where workers were unfamiliar with IDEX. Also, there was a class-action lawsuit filed against the company Tuesday, alleging that the defendants made materially false or misleading statements. The company has had several years with negative operating cash flow, negative cumulative earnings over the last 12 months, declining sales growth, and a significant percentage of their shares are being shorted, so be cautious with this stock. Workhouse (WKHS) WKHX designs, develops, manufactures, and sells high-performance, medium-duty trucks. The company’s products include trucks comprising a powertrain and chassis. Their powertrain products include E-GEN and E-100. E-GEN is an electric, transmission-free system, with a gasoline/propane or compressed natural gas engine that works as an auxiliary generator. E-100 is an all-electric, medium-duty truck. WKHS has established a business relationship with United Parcel Service (UPS) and the U.S. Postal Service. The company’s business generated $84,000 in sales in the first quarter of this year. The stock was up over 477% for Q2 2009. WKHS recently announced a new $70 million financing deal. The deal is for senior secured convertible notes, which should provide the company enough money to meet its 2020 goals. The company expects to produce and deliver 300 to 400 vehicles this year. WKHX was also recently added to the Russell 3000 index. That should help the company as it will be added to many index funds. WKHS expects 557% sales growth next year, and four out of four analysts consider the company a Strong Buy. The stock is also a Strong Buy in the StockNews.com POWR Ratings. It is ranked #4 out of 26 Auto & Vehicle Manufacturers. Inovio (INO) INO focuses on the discovery, development, and commercialization of DNA medicines to treat, cure, and protect people from diseases associated with human papillomavirus (HPV), cancer, and infectious diseases. INO is a top contender for a COVID vaccine. The company came up with a potential solution to the virus using its proprietary technology to analyze the coronavirus’s genetic profile. The Defense Department signed a $71 million deal with the company to manufacture and scale up its needleless vaccine delivery devices. This is vital to national security. Members of our armed forces have been on the front lines of this pandemic. The company is known for quickly creating potential new DNA vaccines. INO also announced successful trials of its DNA therapy that treats the deadly brain cancer glioblastoma multiforme. INO has other drugs in clinical trials, including a DNA treatment for HPV-caused cancers and one for prostate cancer. The stock was up over 470% for the quarter. INO has a Strong Buy rating in our POWR Ratings service, and it is ranked #12 out of 336 stocks in the Biotech industry. Want More Great Investing Ideas? 9 “BUY THE DIP” Growth Stocks for 2020 Is the Bull S#*t Rally FINALLY Over? 7 “Safe-Haven” Dividend Stocks for Turbulent Times Top 3 Investing Strategies for 2020 WKHS shares were trading at $17.34 per share on Tuesday afternoon, up $2.83 (+19.50%). Year-to-date, WKHS has gained 470.39%, versus a -2.81% rise in the benchmark S&P 500 index during the same period."}]}