{"article": [{"url": "https://stocknews.com/news/bc-jout-mbuu-hzo-4-stocks-benefiting-from-booming-boat-sales/", "published": 1595592500.0, "headline": "4 Stocks Benefiting From BOOMING Boat Sales", "body": "When the pandemic started, there was a run on toilet paper and bleach. Now that we’re halfway through summer, another product has been flying off the shelves, or should I say marinas. The coronavirus has kept people from taking vacations, so families are spending that money on boats. According to the NMMA, new boat sales were up 59% in May, compared to April. Boats are part of the stay-cation trend. The pandemic has kept us social-distanced, and reluctant to travel on planes and on cruises, but that doesn’t mean we can’t enjoy ourselves. The northern parts of the country still have a few months of warm weather, and the rest of the country won’t see snow for quite some time, providing an opportunity for boat sales to continue to rise. Here are four stocks that have benefited from the rising tides. 9 \"BUY THE DIP\" Growth Stocks For 2020Brunswick Corporation (BC) BC is globally known for its recreational marine products. The company is involved in designing, manufacturing, and supplying marine engines, boats, and various parts and accessories of marine electronics and control integration systems. BC managed to continue most of its businesses despite the start of the unprecedented global crisis in the first quarter. Though revenues generated by its propulsion segment declined 0.8% year over year in the first quarter, operating profits increased 2.3%. As the pandemic kept Americans away from sports and vacations, boating has become one of the major recreations. As a result, the industry has seen an increase in boat sales. BC’s second quarter results might reflect this trend. BC’s efforts to capitalize on the trend is evident from its recent initiative to host a two-day virtual boat show. Moreover, CEO David Foulkes said earlier, “The strategic portfolio actions and cost reduction efforts executed in the last two years, together with our strong pipeline of new products and successful execution of our capital strategy, position us well to navigate the near-term economic conditions and resume our growth trajectory as we exit the COVID-19 economic environment.” While the consensus EPS estimate of $0.45 for the second quarter indicates a year-over-year decline, BC managed to surpass market estimates in each of the trailing four quarters, which is impressive. BC has gained 62% since hitting its 52-week low on March 23rd, reflecting investors’ confidence in its business model and the industry-wide sales boom. The stock hit its 52-week high on July 23rd. How does BC stack up on POWR Ratings? A for Trade Grade A for Buy & Hold Grade B for Peer Rank B for Industry Rank A for overall POWR Rating You can’t ask for better. It is ranked #3 out of 32 stocks in the Athletics and recreation Industry. Johnson Outdoors Inc. (JOUT) JOUT is a multipurpose company that manufactures adventure sports equipment as well as military purpose tents. It has several subsidiaries focused on supplying goods required for fishing, diving, adventure water sports, etc. The operating profit for the second quarter increased 14% year over year to $31.8 million. Profit margin also increased from 44.5% to 46.1% due to a stronger pricing regime. While the consensus EPS estimate of $1.6 indicates a year-over-year decline for the fiscal third quarter, JOUT beat the consensus estimates in three of four quarters, which is impressive. JOUT hit its year-to-date low of $49.38 in March due to the virus-driven market crash but managed to recover more than 80% since then. In fact, the strong prospect-driven momentum helped JUOT hit its 52-week high on July 17th at $94.90. Despite weak financial performance in the last reported quarter, investors’ optimism over the rising boat sales has helped the stock gain momentum. JOUT is rated “Strong Buy” in our POWR Ratings system, consistent with its sound financials, allowing it to sustain the current economic slump. It is graded “A” in Trade Grade and Buy & Hold Grade, and “B” in Peer Grade and Industry Rank. Out of the 32 stocks in the Athletics & Recreation industry, JOUT is ranked #9. Malibu Boats Inc. (MBUU) MBUU is a designer and manufacturer of recreational power boats and supplies them under Malibu, Axis, Cobalt and Pursuit brands. It has an international market presence, with independent dealer ties in the United States, Europe, Asia, Africa, South America, and Australia. MBUU’s business operations have taken a hit amid the raging pandemic, as the demand for recreational powerboats has plummeted due to social distancing and stay at home norms. The third quarter ended March 31st showed a year-over-year decline in net sales and gross profits. However, net profits increased 7.5% year-over-year during this time, due to the strong growth momentum during the first 2 months of the quarter. MBUU launched a new towboat Wakesetter 23 LSV on July 23rd, with a target customer base of large families. This should help the company benefit from the changing industry trend. MBUU has also taken several measures to maintain its liquidity position during these unprecedented times. CEO Jack Springer said, “To ensure we maintain sufficient liquidity, we have drawn just under $100 million on our current revolver to support operations and strategic investments in the event of a prolonged lower demand environment.” The consensus EPS estimate for the fiscal fourth quarter that ended on June 30th indicates a year-over-year decline. However, you should note that MBUU has surpassed consensus earnings estimates in each of the trailing four quarters. MBUU hit its 52-week low of $18.02 on April 3rd due to the overall dip in the market. The stock has gained more than 30% since then, hitting its 52-week high of $60.4 on July 23rd. MBUU is rated a “Strong Buy” in our POWR Ratings system, due to its strong growth potential. It holds an “A” in Trade Grade, Buy & Hold Grade and Peer Grade, and a “B” in Industry Rank. MBUU is ranked #8 out of 32 stocks in the Athletic-Recreational industry. MarineMax, Inc. (HZO) HZO is a recreational boat and yacht manufacturing company dealing in sports boats, ski and jet boats. It also sells a variety of boat accessories such as marine electronics, water sports accessories, and novelty items. HZO reported record earnings in its third quarter ending June 30. Net quarterly revenues increased 30% year-over-year to $498.30 million, as same store sales grew 30%. Net income increased 83% year over year to $34.90 million. CEO W.B. McGill attributed this improvement to the strength and flexibility of HZO’s business model. As of June 30th, HZO had cash and cash equivalents in excess of $180 million, which can help sustain its business operations in the fourth quarter. HZO has an impressive earnings history, as it beat the consensus EPS estimates in each of the trailing four quarters. The consensus revenue estimate of $321.67 million for the quarter ended September indicates year-over-year growth of 4.4%. HZO’s market values fell to $7.25 per share on March 18th, hitting a 52-week low. Making a quick recovery, HZO hit its 52-week high of $30.45 on July 23rd, gaining 320% in just 4 months. It’s no surprise that HZO is rated “Strong Buy” in our POWR Ratings system. The stock is rated “A” in Trade Grade, Buy & Hold Grade and Peer Grade, and “B” in Industry Rank. It is currently ranked #12 out of 32 in the Athletics & Recreation industry. Want More Great Investing Ideas? 9 “BUY THE DIP” Growth Stocks for 2020 Newly REVISED 2020 Stock Market Outlook 7 “Safe-Haven” Dividend Stocks for Turbulent Times BC shares were unchanged in after-hours trading Friday. Year-to-date, BC has gained 12.78%, versus a 0.61% rise in the benchmark S&P 500 index during the same period."}]}