{"article": [{"url": "https://stocknews.com/news/kl-auy-pvg-3-gold-miners-trading-at-dirt-cheap-valuations/", "published": 1602158900.0, "headline": "3 Gold Miners Trading At Dirt-Cheap Valuations", "body": "The Gold Miners Index (GDX) has suffered a sharp correction since its August highs as the price of gold (GLD) has reversed sharply lower after hitting a new all-time high above $2,050/oz. Fortunately, the $150/oz correction in the yellow metal has not damaged the fundamentals of these miners, as the average realized selling price across the sector in Q2 was $1,805/oz, 6% lower than where we’re sitting even after this correction. This means that even though the miners have fallen precipitously, their margins have actually improved, and their valuations have become even more compelling. This article takes a look at three miners that are trading at dirt-cheap valuations, especially considering their strong double-digit earnings growth rates expected in FY2021. While Yamana Gold (AUY), Kirkland Lake Gold (KL), and Pretium Resources (PVG) have differing production profiles and little in common other being gold miners, they do share one common trait: explosive earnings growth. The three companies are expected to grow annual EPS at an average growth rate of 42% next year, based on preliminary and conservative FY2021 estimates. Meanwhile, the three companies are trading at a median forward P/E ratio of 15.94, a multiple that’s more synonymous with low growth companies with saturated growth. Therefore, I believe this correction in these names is an opportunity, especially as these companies get ready to report their best earnings on record in Q3. Let’s take a look at the three companies below: 7 Best ETFs for the NEXT Bull Market (Source: YCharts.com) Beginning with Kirkland Lake Gold (KL), the company recently completed the acquisition of Detour Gold, and has transformed itself into a 1.5 million-ounce gold producer, from a 900,000-ounce producer last year. The company is one of the only 1 million-ounce plus gold producers that operates out of strictly Tier-1 jurisdictions, meaning it’s one of the safest bets as it does not suffer from political risk or risks of terrorism, like some companies in Mali and Burkina Faso must endure. Meanwhile, it’s also the lowest-cost senior gold producer, with all-in sustaining costs expected to come in below $800/oz this year. (Source: YCharts.com, Author’s Chart) Despite these superior fundamentals, the company has slid 20% from its recent highs, which has left the stock at a very attractive forward P/E ratio of 14.30. If this were a low-growth company then the valuation would be more understandable, but Kirkland Lake pays a 1.0% dividend yield and is on track to grow annual earnings per share by 25% next year, a much higher earnings growth rate than the average S&P-500 company. Based on the company’s aggressive buyback program, it’s clear that management believes there’s a disconnect in the valuation as well, with the company buying back over 850,000 shares at C$64.64 to C$65.56 in the past month. This represents 0.35% of the share float, and should be a tailwind for earnings per share growth with the share count shrinking even further. Given the exceptional earnings growth here combined with the improving margins due to the higher gold price, I see the company as a strong buy below $47.00. (Source: CanadianInsider.com) Moving over to Pretium Resources, the company is the owner of the Brucejack Mine in British Columbia, a bonanza-grade underground mine that’s performed well below expectations since coming online in 2017. Fortunately, the company has got a new CEO and a new mine plan as of this year, and the new mine plan and definition drilling has been delivering gold grades that are above the mine plan. This is a massive sea change from the past two years with the mine consistently underperforming and under-delivering, with each investor having to hold their breath ahead of each quarterly report. (Source: YCharts.com, Author’s Chart) As we can see from the above earning trend, annual earnings per share [EPS] has been steadily climbing since FY2017, up from $0.09 in FY2017 to $0.55 last year. However, growth is expected to accelerate given the higher gold prices and new mine plan after what was a slow year in FY2019 ($0.55 vs. $0.54). If we look at FY2020 estimates, they’re currently sitting at $0.80, projecting 45% growth year-over-year, and FY2021 estimates are sitting at $1.24, translating to 55% growth. This average two-year earnings growth rate of 50% is more than 2000 basis points above the sector average growth rate of 30%, and it makes Pretium one of the top-150 growth stocks in the US Market currently. Given that the stock is currently trading at just 10x FY2021 earnings estimates after its recent pullback, I believe that any corrections below $11.95 would provide a low-risk buying opportunity. The only negative about Pretium is that it doesn’t have a dividend, but this could change within a year if the gold price remains above $1,900/oz. The final must-own miner, in my opinion, is Yamana Gold, a diversified gold producer with operations in the Americas. The company’s flagship mine is 50% ownership of the Canadian Malartic Mine, the largest mine in Canada currently. While Yamana had a rough Q2 due to government-mandated shutdowns at its mines, the company has bounced back massively from its tough quarter, with gold-equivalent production up 24% sequentially to 240,000 ounces. Meanwhile, the company just announced that it will be raising its dividend for the fourth time in the past 18 months, to a new annual rate of $0.105. This translates to a forward yield of 1.90%, which is one of the highest dividends in the sector currently. (Source: YCharts.com, Author’s Chart) If we look at AUY’s earnings trend above, there’s lots to like here, with FY2020 annual EPS expected to grow by 123% ($0.29 vs. $0.13), and FY2021 annual EPS estimates sitting at $0.42. Not only does this translate to massive growth which is well above the sector average, but next year should be an earnings breakout year for the company. Generally, earnings breakouts are very bullish developments as they denote a clear change in the business for the better. When it comes to Yamana, this positive change is a higher gold price, and higher-margin operations, which are flowing directly to the company’s bottom line. Based on FY2-21 estimates of $0.42 and a share price of $5.50, the company is trading at a very reasonable 13.10x earnings. While quite a few of the senior gold producers continue to trade at mediocre valuations as they’re the most well-known and the few options that funds are able to purchase, AUY, KL, and PVG offer very attractive valuations combined with industry-leading earnings growth. Therefore, for investors looking for a low-risk way to play the sector, I would view any weakness as a buying opportunity for AUY and PVG. In Kirkland Lake’s case, I see the current level as already quite low-risk at $47.00 per share, especially given that management is actively buying back shares at higher levels. (Disclosure: I am long KL) Disclaimer: Taylor Dart is not a Registered Investment Advisor or Financial Planner. This writing is for informational purposes only. It does not constitute an offer to sell, a solicitation to buy, or a recommendation regarding any securities transaction. The information contained in this writing should not be construed as financial or investment advice on any subject matter. Taylor Dart expressly disclaims all liability in respect to actions taken based on any or all of the information on this writing. Want More Great Investing Ideas? 7 Best ETFs for the NEXT Bull Market What is the Cure for Stock Market Volatility? Chart of the Day- See Christian Tharp’s Stocks Ready to Breakout KL shares were trading at $47.86 per share on Thursday morning, up $0.22 (+0.46%). Year-to-date, KL has gained 9.66%, versus a 8.06% rise in the benchmark S&P 500 index during the same period."}]}