{"article": [{"url": "https://stocknews.com/news/znga-gluu-feac-3-under-the-radar-video-game-stocks-with-attractive-upside/", "published": 1600171700.0, "headline": "3 Under the Radar Video Game Stocks with Attractive Upside Potential", "body": "The gaming industry is one of the few bright spots of our shrinking economy. The majority of people age 40 and under have at the very least, a passive interest in gaming, which serves as a foundation for this expanding industry, even amidst an economic recession. If you do not own gaming stocks, or if you would like to expand your gaming holdings, you have come to the right place. We have identified some of the most intriguing gaming stocks that have flown under the radar in recent months. The following gaming stocks are worthy of a look: Zynga (ZNGA), Glu Mobile (GLUU), and Flying Eagle Acquisition Corp (FEAC). 7 Best ETFs for the NEXT Bull MarketZynga (ZNGA) There is a common misconception that gaming is primarily limited to sitting on the couch and playing Sony (SNE) PlayStation 4 or Nintendo Switch on a TV. Nowadays, plenty of people are using their phones to play games. ZNGA, a maker of mobile social games, clearly benefits from the public’s willingness to use their phones for purposes other than texting and surfing the web. Examples of ZNGA games include FarmVille, Words With Friends, Treasure Ilse, Zynga Poker, Mafia Wars, and CSR Racing 2. Perhaps the best part about ZNGA games is that the company continues to update and support them well beyond their initial debut. ZNGA has created a complex feedback system based on player metrics that improve games using new features and content across time. The beauty of playing ZNGA games on your phone is you can dive right into the action without an extensive learning curve. There is no need to master a complex gaming controller such as those used on PlayStation 4. Rather, you can use your phone or keyboard and mouse and get right into it. This is the ease of use and simple user experience most casual gamers crave, and ZNGA is more than happy to provide. The ZNGA POWR Ratings are highlighted by a grade of “B” for Industry Rank. Analysts have set a fair price value at $11.83, meaning the stock is viewed as undervalued. ZNGA has a relatively reasonable forward P/E ratio of 23.86, considering it is a legitimate player in the gaming industry. More people will gravitate to ZNGA games as they are democratized compared to conventional games played on traditional consoles and TVs. Furthermore, ZNGA is centered on social gaming, which is much-needed as social isolation becomes a borderline public crisis. The last time ZNGA was priced around its current trading level of $8, it soared to $10.50. Glu Mobile (GLUU) Another power player in the mobile gaming space is GLUU. GLUU games include the likes of Brain Genius, Stranded, Super K.O. Boxing and Tap Baseball 2020. The POWR Ratings reveal GLUU has a solid Industry Rank grade of “B.” TipRanks reports that analysts who have reviewed GLUU have set a price target of $11.15, which is nearly 60% higher than its current price. It is particularly interesting to note GLUU has a forward P/E ratio of 18.16, indicating the stock is undervalued at its current trading price of $7. Most gaming stocks have forward P/E ratios well beyond 20. Though GLUU has missed Wall Street estimates of late, its user acquisitions are up 17% on a year-over-year basis. Furthermore, GLUU has seen a 40% growth in revenue. Flying Eagle Acquisition Corp. (FEAC) Blank check companies are all the rage on Wall Street these days. One of the more intriguing blank check companies, FEAC, recently entered the gaming business in the form of Skillz. Skillz is a skill-based gaming service that allows gamers to compete with one another in games for real cash prizes. FEAC games are played on smartphones. Though there is the potential for a small group of particularly coordinated players who have ample time to practice FEAC games to emerge as the primary winners in these competitive matchups, the FEAC brass will figure out a solution should such a problem arise. For example, FEAC executives could group players with an unusually high or low win percentage into their respective tiers, restricting them from playing against those of considerably higher or lower skill levels to maintain competitive balance. The bottom line is games are quite addictive, especially when played on smartphones that do not require the mastery of complex controls. Want More Great Investing Ideas? 7 Best ETFs for the NEXT Bull Market Is the Stock Market Correction Over? Chart of the Day- See the Stocks Ready to Breakout ZNGA shares were trading at $8.54 per share on Tuesday afternoon, up $0.15 (+1.79%). Year-to-date, ZNGA has gained 39.54%, versus a 7.27% rise in the benchmark S&P 500 index during the same period."}]}