{"article": [{"url": "https://stocknews.com/news/uber-lyft-ubers-insurmountable-advantage-over-lyft/", "published": 1597752500.0, "headline": "Uber's INSURMOUNTABLE Advantage Over Lyft", "body": "During any economic crisis, the most vulnerable are most affected. This is the case whether we look at countries, people, businesses, or communities. The coronavirus is no exception. This same dynamic is playing out on Wall Street. Big companies have the resources to withstand periods of economic distress. They can tap credit markets and take advantage of record-low interest rates to buffer their cash positions. When the crisis ends, they are in an advantageous position due to many of their smaller competitors being wiped out or significantly weakened. While smaller companies take a defensive position and focus on survival, the bigger companies will go on offense and look for ways to grow. They are also more likely to have diversified revenues in terms of geography and adjacent businesses. 7 \"SAFE HAVEN\" Dividend Stocks for Turbulent TimesThis exact sequence of events is playing out in the ride-sharing industry. Uber (UBER) is growing bigger and expanding into adjacent markets, while Lyft (LYFT) is focusing on minimizing costs to outlast the crisis. By the time the economy returns to normal, Uber’s lead on Lyft will be insurmountable. Uber vs Lyft Like the rest of the travel industry, the ride-sharing business has been devastated by the coronavirus. In the second quarter, both LYFT and UBER reported a decline in second-quarter revenue for ride-sharing of more than 60%. However, while Lyft’s total revenue was 61% lower on a year-over-year basis, Uber’s total revenue was only 29% lower. This was primarily because Uber’s food delivery business increased by 113% on a YOY basis. Currently in the US, Uber has 70% of the ride-sharing market, while Lyft has the other 30%. However, Uber has other businesses including UberEats and its growing freight business which connects truck drivers to companies. This highlights another difference between the two companies. While Lyft is solely focused on ride-sharing, Uber has a multitude of businesses that are complementary but disconnected. For example, the coronavirus severely hurt its ride-sharing business, but it was a positive catalyst for food delivery. Uber thinks of itself as a logistics company and envisions ride-sharing as its first product, in the same way, that Amazon (AMZN) started off selling books. This makes the company antifragile and able to thrive during this crisis. In contrast to Lyft which only operates in the US and Canada, Uber is international and is in most major South American, European, and Asian markets except China. Thus, Uber’s revenue is geographically diversified which is another source of resiliency. Many European and Asian countries are ahead of the US in beating the coronavirus. In its recent earnings report, it noted that in those countries, ride-sharing revenue was only down 10 to 20% from the previous year. Similar to how UBER is battling LYFT for supremacy in North America, it’s also battling other ride-sharing companies in different, international markets. These same principles apply in those markets, and the coronavirus will give it an advantage in these markets as well. Network Effects In some industries, several companies are vying for market share. However, in technology due to network effects, several monopolies have emerged in areas like search and social. These sectors eventually end up with one company earning the bulk of profits. Everyone uses Google (GOOG), because it’s the best search engine, and since it has the most users, it’s able to deliver the best results. Similarly, Facebook’s (FB) network grows in value and utility as the number of users on its platform increases. In turn, this attracts more users to its platform and makes its moat impenetrable. UBER is leveraging network effects in each of its three major businesses. Below is a diagram from its S-1 which shows the benefits to more drivers attracting more riders due to fewer wait times and cheaper fares and more riders attracting more drivers due to greater earnings potential. (source: UBER S-1) UBER Freight UBER’s growing Freight business is another example of network effects, as the more truck drivers join, it attracts more customers, which attracts more truck drivers. By serving as the intermediary, Uber earns a cut of every transaction without any sort of significant, incremental cost. For some people, especially in cities, UBER and LYFT were revolutionary. They were able to get rid of their cars because they preferred the convenience of using an app over the hassle and the cost of owning a car. They were able to essentially outsource car ownership and pay per ride. For most people, this didn’t make sense. They might Uber when traveling or for a night out, but they still needed to own a car to get to work or run errands. However, for businesses, the calculus is different. Companies outsource functions and departments to save money and become more efficient. Uber Freight will solve this problem for cargo. Companies will be able to operate their business with fewer assets and costs. Instead of owning trucks and hiring drivers, they can simply use Uber to transport cargo. Uber’s Aggression UBER is vying for supremacy in food delivery as well. Currently, food delivery is competitive with many competitors including DoorDash, GrubHub, and Seamless. However, UBER is the fastest-growing, largest, and quickly gaining market share. (source: Slice Intelligence) In the last quarter, it bought PostMates for $2.65 billion. It added several restaurant chains and increased the number of restaurants on its platform by 70%. It also expanded by offering deliveries for all types of verticals including groceries, pharmacies, and convenience stores. There’s likely to be more consolidation in the space due to the competition. Given the focus on growth and winning market share, food-delivery companies are losing money. Due to its size, Uber is best-positioned to win a war of attrition. Conclusion Uber has a good chance to be the winner in three different areas. Needless to say, once it acquires a dominant position, it can slowly increase prices to become more profitable. During certain times, one could argue that Lyft’s laser-focus on ride-sharing in certain geographies gives it a competitive advantage over UBER, however, this isn’t one of those times. UBER simply has more assets and resources to survive this downturn. UBER is more than 5x the size of LYFT and more diversified. It’s going to emerge from the crisis in a much stronger position than LYFT which will allow it to keep its fares low and force LYFT to do the same. Want More Great Investing Ideas? The Best of StockNews 3 Possible Directions for the Stock Market from Here 9 “BUY THE DIP” Growth Stocks for 2020 shares were trading at $338.47 per share on Tuesday afternoon, up $0.56 (+0.17%). Year-to-date, has gained 6.24%, versus a % rise in the benchmark S&P 500 index during the same period."}]}