{"article": [{"url": "https://stocknews.com/news/nee-xel-es-3-top-utilities-stocks-to-consider-as-temperatures-rise/", "published": 1594210100.0, "headline": "3 Top Utilities Stocks to Consider as Temperatures Rise", "body": "The Utilities industry has been hit hard by the economic downturn triggered by Covid-19. There have been supply chain disruptions, shortages of critical components, and an increase in the number of customer complaints. These are just a few of the problems the industry has been facing during these times. The Utilities Select Sector SPDR ETF (XLU) is down 11% year to date, compared with the S&P 500’s loss of 2%. This reflects how poorly the industry has performed during the pandemic. Although the industry’s prospects may seem gloomy, some utility stocks are worth a look due to the growing importance of renewable energy. 7 Best ETFs for the NEXT Bull MarketHere are three Utility stocks to consider. NextEra Energy, Inc. (NEE) NEE is the largest utility company in the world by market cap ($120.76 billion). It generates and transmits electrical energy while investing and modernizing infrastructure. NEE has more than 140MW in battery energy storage capacity, which is higher than any other U.S. competitor. The company’s continuous investment in its nuclear fleet helps optimize its plants and deliver emission-free energy to customers. NEE has been planning to strengthen its infrastructure by investing between $50-$55 billion in various projects through 2022. In the long run, if we see a shift towards renewable energy, Nees renewable energy assets stand to benefit from that shift. For the first quarter this year, NEE reported a 74.5% year-over-year increase in operating income and a 22% increase in gross profit. NEE has a dividend yield of 2.27% and a payout ratio of 65.4%. The stock has an average analyst price target of 260.60. How does NEE stack up for the POWR Ratings? B for Trade Grade B for Buy & Hold Grade A for Peer Grade B for overall POWR Ratings It ranks #1 out of 61 stocks in the Utilities-Domestic Industry. Xcel Energy Inc. (XEL) XEL provides reliable electricity and natural gas services. The company has an extensive portfolio of energy-saving programs, electric charging stations, and renewable options. XEL announced a $3 billion package to foster clean energy transition, job growth, and stability in customer bills. Electricity bills of XEL customers in Minnesota are 24% below the national average. XEL has a dividend yield of 2.71% and a payout ratio of 66.4%. The stock has returned 7.2% over the past year and 2.9% over the past six months. XEL’s return on equity was 10.39% in the first quarter of 2020. Although there was a year-over-year decrease in the gross profit and revenue in the first quarter, its customer-centric approach and a favorable renewable energy outlook could attract investments in the long term. XEL has a Buy rating in our POWR Ratings system. It has an A for Peer Grade and Bs for Trade Grade and Buy & Hold Grade. It is ranked #3 out of 61 stocks in the Utilities-Domestic industry. Eversource Energy (ES) ES provides electric service and distributes natural gas through its subsidiaries in western Massachusetts, Connecticut, and New Hampshire. The Independent System operator of New England (ISO New England) has proposed to adopt the “Ready Path Solution,” which would be delivered by ES and National Grid (NGG). The solution is a road map to augment regional grid reliability in Boston after closing the Mystic Generating Station in 2024. ES has also made an agreement with NiSource Inc. (NI) to acquire the Massachusetts natural gas assets of Columbia Gas for $1.1 billion. ES has a dividend yield of 2.71% and a payout ratio of 64.9%. The stock has returned 12.5% over the past year and 0.5% year to date. In the first quarter, ES recorded a 4.9% year-over-year increase in gross income and a 7% increase in total assets. The average analyst price target for ES is $86.71. ES has a Buy rating in the POWR Ratings system. It has an A for Peer Grade and a B for Buy & Hold Grade. In the Utilities-Domestic industry, it’s ranked #4 out of 61 stocks. Want More Great Investing Ideas? 9 “BUY THE DIP” Growth Stocks for 2020 Is the Bull S#*t Rally FINALLY Over? 7 “Safe-Haven” Dividend Stocks for Turbulent Times Top 3 Investing Strategies for 2020 NEE shares were unchanged in after-hours trading Wednesday. Year-to-date, NEE has gained 5.71%, versus a -0.75% rise in the benchmark S&P 500 index during the same period."}]}