{"article": [{"url": "https://stocknews.com/news/pgr-z-petq-yorw-4-upgraded-stocks-to-buy-now/", "published": 1594901300.0, "headline": "4 Upgraded Stocks to Buy Now", "body": "Our exclusive POWR Ratings identifies the market’s best stocks daily with the use of a momentum algorithm. Stocks are upgraded and downgraded based on myriad factors ranging from price returns to peer grades, buy & hold grades, and other key metrics. The latest POWR Ratings upgrades reveal the following stocks might be poised for positive gains: The Progressive Corporation (PGR ), Zillow Group (Z), PetIQ (PETQ), and The York Water Company (YORW). The Progressive Corporation (PGR) 9 \"BUY THE DIP\" Growth Stocks For 2020Some investors have shied away from insurance stocks during the pandemic due to a fear of force majeure clauses. A force majeure clause is a contractual provision that excuses one or both parties’ performance obligations when circumstances arise beyond the parties’ control. PGR strictly provides auto and commercial property insurance, meaning it will not lose money due to force majeure clauses that might occur with other insurance providers. Though PGR’s advertisements featuring the seemingly ubiquitous Flo character annoy some, the stock was recently upgraded in our POWR Ratings system for a good reason. PGR is now ranked #1 of nearly 60 businesses in the Insurance – Property & Casualty industry, highlighted by A grades in each of the four POWR Components except for Industry Rank. The average analyst price target for PGR is $91.25. Five analysts recommend buying PGR, while three recommend holding the stock, and none advise selling. PGR has a year-to-date price return of 21.71% on top of a return of 25.14% last year. Zillow Group (Z) Interest rates are at an all-time low. Homes are being scooped up left and right smack dab in the middle of a once-in-a-century pandemic. This means Z’s business is booming. The company provides appraisals along with rental rates on more than 100 million homes. Z owns the Zillow.com website in addition to Trulia, HotPads, and StreetEasy. Z also has business brands for real estate professionals, which include Market Leader, Mortech, Postlets, Retsly, and Diverse Solutions. The POWR Ratings show Z has As in all of the POWR Components, except for Peer Grade which is a B. Z is ranked in the top 15 out of 54 Internet stocks. Though Z has bounced back quite nicely after the COVID-19 sell-off, top analysts insist the stock still has room for even more upward movement. The analysts have set a price target of $60.18 for Z. PetIQ Inc. (PETQ) No matter how bad the economy gets, pet owners will still spend money on their fur buddies. PETQ provides pet medication and wellness solutions through retail stores and e-commerce channels. The POWR Ratings show PETQ has As in all categories except for Industry Rank. PETQ is ranked just outside of the top 10 out of 67 Medical – Services stocks. The stock is almost up 40% year to date. Over three months, PETQ has returned 57.25%. The York Water Company (YORW) When in doubt, invest in water. Water itself and water-related services will prove increasingly important as the planet warms, the global population increases, and our limited water sources become even more polluted. YORW stands to benefit from freshwater scarcity. The company purifies, impounds, and transports water. The POWR Ratings reveal YORW has As in every category except for Industry Rank. The stock is ranked second out of 13 stocks in the Water industry. The stock returned 46.40% last year. Over the past year, it’s up 36.85%. Want More Great Investing Ideas? 9 “BUY THE DIP” Growth Stocks for 2020 Top 5 WINNING Stock Chart Patterns 7 “Safe-Haven” Dividend Stocks for Turbulent Times PGR shares were trading at $87.12 per share on Thursday afternoon, up $1.23 (+1.43%). Year-to-date, PGR has gained 24.53%, versus a 0.60% rise in the benchmark S&P 500 index during the same period."}]}