{"article": [{"url": "https://stocknews.com/news/iipr-innovative-industrial-properties-closes-another-deal/", "published": 1599134900.0, "headline": "Innovative Industrial Properties Closes Another Deal", "body": "Over the last few years, Innovative Industrial Properties (IIPR) has successfully raised hundreds of millions of dollars to fuel its aggressive expansion strategy, which has worked successfully. This week the company announced that they have finalized the acquisition of its most recent property just north of Detroit. IIPR purchased the property for $6.2 million dollars, excluding transaction costs. At the same time, the company also closed a triple-net lease with Holistic Industries, the subsidiary for the property. Holistic Industries plans to use the facility for cannabis cultivation, processing, and dispensing. IIPR agreed to additionally fund the project, including development costs up to $18.8 million dollars. This marks the fourth deal between IIPR and Holistic Industries. IIPR’s President and CEO Paul Smithers stated “Have had the privilege of being Holistic’s long-term real estate partner for over three years” He also added that the company has a team of “dedicated professionals, that have set a standard for product quality, patient care, and customer experience.” The CEO of Holistic Industries also stated “He has a vision we have for the community.” 7 Best ETFs for the NEXT Bull MarketThe medical and recreational market in Michigan generated a healthy figure of $109.6 million in July, with analysts expecting substantial growth in the years to come. Due to these encouraging estimates, IIPR has been investing a substantial amount of capital into Michigan over the last few years. So far, IIPR’s investment in properties located in Michigan, totals approximately $155.8 million. As IIPR continues its aggressive expansion across the United States, the company now owns 62 properties. These properties are spread out across 16 states providing substantial diversity for investors. There are many things to like about IIPR as a stock, starting with their dividend yield. IIPR is a REIT and at its current price still pays a 3.11% dividend yield. This distribution is considered very healthy in the market despite the stock’s tremendous run. The stock has rallied since its March lows of $40 to hit recent 52-week highs of $126, a 300% return. As IIPR continues to dominate the market and expand its portfolio, I expect this company to continue to perform strongly in this environment, while capitalizing on the growth potential the cannabis sector offers. If you are looking for some exposure to the cannabis sector, yet also looking for a healthy dividend, IIPR could be a nice fit for an income and growth-oriented investor. Want More Great Investing Ideas? 7 Best ETFs for the NEXT Bull Market Beware Stocks in September? 9 “BUY THE DIP” Growth Stocks for 2020 IIPR shares were trading at $123.65 per share on Thursday afternoon, down $2.26 (-1.79%). Year-to-date, IIPR has gained 67.00%, versus a 9.14% rise in the benchmark S&P 500 index during the same period."}]}