{"article": [{"url": "https://stocknews.com/news/tsm-hd-unh-sap-4-strong-buy-mega-cap-stocks-that-pay-dividends/", "published": 1599048500.0, "headline": "4 \"Strong Buy\" Mega-Cap Stocks That Pay Dividends", "body": "If you are hesitant to invest in small-cap stocks due to their higher risk profiles and lack of coverage, you are not alone. Mega-cap stocks are the bread and butter of investing for a good reason. These companies enjoy a competitive advantage and have ample dry powder to make power moves. Sorting through the plethora of mega-cap stocks is a task few investors look forward to simply due to the prospect of researching these companies is quite intimidating. StockNews has sorted through the top stocks on your behalf to identify those with the most potential. Below, we shed light on four mega-cap stocks with a Strong Buy rating that also pays dividends: Taiwan Semiconductor (TSM), Home Depot (HD), UnitedHealth Group (UNH), and SAP (SAP). 7 \"SAFE HAVEN\" Dividend Stocks for Turbulent TimesTaiwan Semiconductor (TSM) Integrated circuit manufacturing is performed by foundries such as TSM. TSM is the top foundry company in the world. The company’s advanced production techniques facilitate the design and manufacture of integrated circuitry. This semiconductor pays a dividend of just under 2%. TSM’s POWR Ratings are flawless with A grades in each POWR component. Check out TSM’s profile on TipRanks, and you will find 10 of 12 analysts rate the stock as a Buy; one rates it as a Hold, and one rates it as a Sell. TSM has a relatively moderate forward P/E ratio of 25.28 for a mega-cap tech stock. TSM clients include Intel (INTC), Apple (AAPL), Broadcom (AVGO), and NVIDIA (NVDA). In other words, TSM will rake in cash for the foreseeable future. At the moment, TSM is merely three dollars away from its 52-week high of $84. The stock should continue to benefit from the semiconductor industry’s tailwinds in the quarters to come. Home Depot (HD) Home improvement projects have never been more popular. Homeowners across the world have shifted their attention to their home while stuck inside during the pandemic. HD stock has caught fire, soaring to a 52-week high. HD has nearly 2,300 retail stores. You can buy just about everything home-related at HD stores. The country’s blazing hot home market has the potential to send HD even higher as the year rounds out. HD also operates stores in Mexico, Canada, Puerto Rico, Guam, and the Virgin Islands. According to the top analysts, HD is underpriced at its current trading level of $285. The analysts have set a price target of $309.90 for the stock. If you are on the fence regarding a potential HD investment, consider its second-quarter results in which the company announced a sales spike of 23.4% from the prior year. This is a fantastic growth rate for a brick-and-mortar retailer. Furthermore, HD hardline sales are up 33% from the same period in 2019. With a dividend of 2.11%, A grades in every POWR Rating Component, and a rank of #1 in the Home Improvement & Goods industry, HD is an outstanding stock. UnitedHealth Group (UNH) It is hard to go wrong, investing in healthcare amidst a pandemic. UNH is the top healthcare services provider on the planet. UNH services and products range from fee-for-service programs to preferred provider organizations, HMOs, and beyond. UNH has solid POWR Rating grades with As in its Trade Grade and Buy & Hold Grade and Bs in its Peer Grade and Industry Rank grade. UNH is ranked first out of nine stocks in the Medical – Health Insurance industry. Analysts have set a price target of $350.35 for UNH, which is 12% higher than its current price. At the moment, UNH is a mere $12 away from its 52-week high of $324. Furthermore, UNH has an attractive forward P/E ratio of 18.85. UNH should continue its winning ways as 20% of the United States’ economy comprises healthcare services and products. UNH has a cash position of over $24 billion. Furthermore, about 80% of the company’s revenue is from health insurance premiums. The analysts will likely prove even more bullish on UNH should Joe Biden win the presidency this autumn as nearly 30% of the company’s revenue stems from Medicare programs Biden has championed. SAP (SAP) Nowadays, companies are relying on software to make critical decisions. SAP provides such software for businesses of varying sizes in a wide array of industries. SAP software provides valuable insights that facilitate decision-making processes, ultimately adding to the bottom line. As an example, SAP’s Human Experience Management software is used by more than 600 clients. The POWR Ratings reveal SAP has A grades in each POWR component. SAP is ranked 3rd of nearly 100 stocks in the Software – Application industry. Out of the eight analysts who have analyzed SAP in-depth, five recommend buying, three advise holding, and none insist on selling. SAP’s cloud-computing technology is significantly boosting the company’s bottom line, helping the stock reach new heights in recent months. SAP may establish a new 52-week high before year’s end. Want More Great Investing Ideas? 7 Best ETFs for the NEXT Bull Market Beware Stocks in September? 9 “BUY THE DIP” Growth Stocks for 2020 TSM shares were trading at $80.63 per share on Wednesday morning, down $0.92 (-1.13%). Year-to-date, TSM has gained 40.64%, versus a 11.28% rise in the benchmark S&P 500 index during the same period."}]}