{"article": [{"url": "https://stocknews.com/news/vz-cvs-ibkr-3-dividend-value-stocks-to-buy-now/", "published": 1597838900.0, "headline": "3 Dividend Value Stocks to Buy Now", "body": "Many companies are on a solid recovery path since the virus led market crash in March. As a result, valuations have become stretched for many of them. And these stocks may not have much upside left. So, when searching for the best stocks for your portfolio, it is important to consider valuation. Only a few industries are faring well due to a surge in demand for their products in this “new normal” era. But one could still find value stocks within these industries. In fact, investing in value stocks that also pay dividends could make for a profitable investment strategy. It is vital not to get swayed by industry performance. Instead keep a close watch on a stock fundamentals, upside potential, dividend payments, and its ability to withstand headwinds caused by the virus. Verizon Communications Inc. (VZ), CVS Health Corporation (CVS), and Interactive Brokers Group, Inc. (IBKR) are three stocks that are currently available at reasonable valuations and offer regular dividend returns. 7 Best ETFs for the NEXT Bull MarketVerizon Communications Inc. (VZ) VZ offers voice, data, and video services and solutions on its networks and platforms. VZ has an annual dividend of $2.46, which yields 4.16%. Over the past six years, VZ has issued more dividends than 98.2% of other dividend-issuing US stocks in the StockNews.com universe. The last quarterly dividend of 61.50 cents per share was paid on August 3rd. VZ has a forward P/E ratio of 12.32 and a Price/Cash Flow ratio of 6.64, both lower than their respective industry averages. In the second quarter, VZ’s net debt was reduced by $5.7 billion and the company reported an EPS of $1.13, compared to $0.95 in the year-ago period. VZ ended the first half of 2020 with free cash flow of $13.7 billion, an increase of 74.1% year-over-year. VZ’s earnings surprise history looks pretty good, with the company beating consensus EPS estimates in three of the trailing four quarters. The stock has returned more than 15% since its March lows. VZ has been selected by Bayer to develop next-generation global network infrastructure to improve the company’s network management worldwide. Recently, VZ also led a $4.5 million Series A financing round in PICadvanced (PICa). The company’s disciplined network strategy and wireless customer growth are encouraging signs for investors. How does VZ stack up for the POWR Ratings? A for Trade Grade A for Buy & Hold Grade A for Peer Grade A for Industry Rank A for Overall POWR Rating You can’t ask for better. The stock is also ranked #1 out of 24 stocks in the Telecom-Domestic industry. VZ is one of the stocks currently in the Steve Reitmeister’s Total Return portfolio. Learn more here. CVS Health Corporation (CVS) The consumer-centric pharmacy healthcare services company has an annual dividend of $2, which yields 3.08%. Over the past six years, CVS has issued more dividends than 94.7% of other dividend-issuing US stocks in the Stocknews.com universe. CVS paid a quarterly dividend of $0.50 per share on August 3rd, 2020. CVS has a PEG ratio of 1.61 and a Cash/Price ratio of 0.20, both lower than their respective industry averages. The average analyst price target of CVS is $85.29 which is 30.9% higher than its current price.The stock has grown about 9% since its March lows. In the second quarter, GAAP operating income increased 40.5% and total revenues increased 3% year-over-year. Furthermore, net income increased 54.6% year-over-year. The company also raised adjusted EPS guidance for the full year to $7.14-$7.27 from $7.04-$7.17. CVS’s consensus revenue estimate of $66.53 billion for the quarter ending September 2020, indicates a year-over-year increase of 2.7%. CVS has an impressive earnings surprise history with the company surpassing consensus EPS estimates in each of the trailing four quarters. CVS’s POWR Ratings reflect this promising outlook. It has an overall rating of Buy with a grade of A for Trade Grade and a B for Buy & Hold Grade, Peer Grade, and Industry Rank. Among the 4 stocks in the Medical-Drug Stores industry, it’s ranked #1. Interactive Brokers Group, Inc. (IBKR) The automated global electronic broker declared a quarterly dividend of $0.10 per share which is payable to shareholders on September 14th, 2020. IBKR has an annual dividend of $0.40, which yields 0.77%. IBKR has an earnings yield of 4.27%, which is lower than the industry average. Since the overall dip in the market in March, the stock has gained more than 30%. IBKR’s net revenue increased 7.2%, customer credits increased 30%, and customer accounts increased 36% year-over-year in the second quarter. Moreover, in July IBKR’s Daily Average Revenue Trades were up 124% and ending client equity was up 40%, compared to the previous year. The market expects the company to report an EPS of $0.51 for the quarter ending September 2020, which represents a 13.3% growth over the year-ago number. IBKR’s consensus revenue estimate of $484.49 million for the quarter ending September 2020 indicates a year-over-year increase of 1.8%. It’s no surprise that IBKR is rated a Buy in our POWR Ratings system. It also has a grade of A for Trade Grade and a B for Buy & Hold Grade, Peer Grade, and Industry Rank. In the 27-stock Investment Brokerage industry, it is ranked #7. Want More Great Investing Ideas? The Best of StockNews 2 Step Process to Sell @ Market Top in September 9 “BUY THE DIP” Growth Stocks for 2020 VZ shares were trading at $59.28 per share on Wednesday afternoon, up $0.10 (+0.17%). Year-to-date, VZ has declined -0.29%, versus a 6.47% rise in the benchmark S&P 500 index during the same period."}]}