{"article": [{"url": "https://stocknews.com/news/spy-the-surprising-way-the-election-will-affect-your-portfolio/", "published": 1602245300.0, "headline": "The Surprising Way the Election Will Affect Your Portfolio", "body": "It’s been a wild year for stocks, to say the least. The S&P 500 suffered its fastest bear market in history back in March, plunging 36% in just four weeks. For context, the average bear market since 1945 is a 33% decline in stocks…but it usually takes 13 months for the market to reach its lows. The Dow Jones Industrial Average, normally a less volatile popular index, plunged almost 40% due to big pandemic affected names like Boeing. The recent pullback, which saw the Nasdaq tie its previous record for the fastest correction in history (just three days), looked like it might have been ending. And then President Trump tweeted that he and his wife had coronavirus and 10 people in the administration tested positive within a few days of each other. Stocks reacted by falling 1% on Friday, October 2nd. That might not seem like much but keep in mind that it represents the market effectively pricing in a 10% decline in 2020 earnings according to Ben Carlson. We still have a month to go before the election and a lot of surprised may be in store for us, including the possibility of a contested convention that President Trump says he expects to wind up being decided by the Supreme Court. Never has the outcome of an election mattered as much to the stock market’s short-term health, but not in the way you might expect. Here’s Whose Winning The Race Right Now 7 Best ETFs for the NEXT Bull MarketWhile Biden’s lead in the national and state polls has remained relatively stable for months, with less than a month until election day (and millions of people already have voted by mail) every day that Trump doesn’t tighten the race increases the probability that he will lose. According to Nate Silver of FiveThirtyEight, if Biden maintains his current polling leads then his probability of victory on election day would be approximately 91%. However, more crucial to the economy, and thus the stock market in 2021 and beyond, is who controls the Senate. After all, politicians make wild promises about what they’ll deliver if elected but without control of Congress, nothing major can actually get done. Democrats are expected to slightly increase their lead in the House, meaning that control of the Senate will decide whether or not we have divided government for the next two years. Democrats need four pickups this November in order to get 50 seats and have Kamala Harris act as the tie-breaking vote. While a 50 seat majority leaves no margin of error for even one conservative Democrat voting “no” on anything, it would give the Democrats control of the Chamber, and thus the power to decide what legislation gets voted on. Currently, it looks like Democrats will end up with 51 Senate seats, giving them control of the entire Federal government, or at least two-thirds of it. The Supreme Court is expected to go 6-3 conservative within a few weeks, the first supermajority in over 50 years. Now understandably, in a highly polarized country, where candidates on both sides make hyperbolic claims about the horrible things that will happen if their opponents win, many investors are nervous about what a Democratic sweep might mean for your portfolio. A Democratic Sweep Will Absolutely Effect Your Portfolio…BUT Not In The Way You Think Many investors fear a Democratic sweep will mean higher regulations on businesses, and higher corporate taxes because that’s what candidate Biden has proposed. Economists and analyst firms, including the most respected and accurate ones on Wall Street, have had time to crunch the numbers and estimates what these negative headwinds would mean for the economy. The results might be very surprising. A recent poll of 32 quantitative economists found that a Democratic sweep was actually viewed by most economists as the 2nd most beneficial scenario right now, almost as positive as a vaccine being approved earlier than expected. How can that be when Biden + a Democratic Congress is likely to raise taxes and regulations? The answer is stimulus, which economists consider to be the 2nd most important factor in determining how quickly the US economy recovers from the pandemic. The worst outcome for the economy, according to UBS, one of the 16 most accurate economists in the world according to MarketWatch, is Biden winning and the GOP maintaining control of the Senate. (Source: UBS) The reason for that is that gridlock would likely result in very little additional stimulus occurring, assuming any occurred at all. Back in July, when the Republicans revealed their $1 trillion stimulus plan, Senate Majority leader McConnell revealed that 15 to 20 of his own Caucus, 30% to 40% of Republican Senators, wanted zero new stimulus. According to Moody’s most recent economic model (Moody’s, like UBS, is one of the 16 most accurate economists) estimates that without additional stimulus there will be just 1% GDP growth next year, zero net job creation and the unemployment rate will actually rise back to 10.2%, above the worst levels of the Great Recession. In contrast, if we get a $1.5 trillion stimulus bill then GDP growth next year will be a robust 3.5% and unemployment will basically remain flat over the next year, despite 2 million net job gains. If the Democrats could somehow pass their $3.4 trillion HEROES act (it would likely require more than 51 Senate seats) then economic growth could soar to 6.0%, the highest in over 40 years, and job creation would double according to Moody’s. After analyzing both candidates’ economic policy proposals, including the good and bad aspects Moody’s estimates that a Democratic Sweep could potentially be a major boon for the economy. Based on our analysis of the candidates’ proposals using simulations of our macroeconomic model, we conclude that Vice President Biden’s economic proposals would result in a stronger economy than Trump’s. This is even after allowing for some variability in the accuracy of the economic modeling and underlying assumptions that drive our analysis. This is because of Biden’s substantially more expansive fiscal policies. They bring the economy back to full employment more quickly coming out of the pandemic—the second half of 2022 under Biden’s proposed policies compared with the first half of 2024 under Trump’s. Biden’s reversal of Trump’s policies on foreign trade and immigration would also contribute to stronger economic growth, so that by the end of their terms in 2024 real GDP would be larger by $960 billion, or 4.5%, under Biden than Trump. This translates into 7.4 million more jobs under Biden than Trump.” – Moody’s (emphasis added) But surely the stock market would suffer from higher regulations and taxes right? Indeed, that’s what Goldman Sachs initially thought, estimating 12% lower S&P earnings through 2024 if Biden’s 28% corporate tax rate proposal was enacted. A Democratic-controlled government may not be as bad for stocks as many warn, according to Goldman Sachs. The team of strategists led by David Kostin aren’t as pessimistic toward a blue wave, and instead forecast “a modestly positive net impact” should Democrats sweep the November elections. Depending on the timing of tax reform and increased stimulus, a Biden administration could lift stocks and drive a healthy economic rebound, the team wrote in a Tuesday note. A large increase in fiscal spending, funded in part by increased tax revenue, would boost economic growth and help offset the earnings headwind from higher tax rates,” the strategists added. Goldman Sachs projected a 4% increase in S&P 500 earnings through 2024 under policies expected from a Democratic sweep. A “pared-down” version of Biden’s tax proposal would be enacted starting in 2022, and new trade policies would buttress corporate profits throughout the former vice president’s term.” – Business Insider (emphasis added) Goldman’s latest forecast is that, despite slightly higher taxes and increased regulations, corporate earnings would actually be 4% higher than they would be without a Democratic sweep scenario. That’s partially due to an end to the trade war, but primarily due to the much stronger stimulus that a Biden White House + Democratic Congress is likely to enact. Now let me be very clear, I am NOT a Democrat, I’m an independent. I’m not trying to get you to vote for Biden, root for a Democratic clean sweep, or try to convince you that such a scenario would be the salvation of the nation. My goal with this article is to keep anyone who is convinced that a Democratic Sweep = a major market crash, from making a potentially big mistake. (Source: imgflip) Even if you don’t believe me personally, keep in mind that Wall Street trusts Moody’s, UBS, and Goldman Sachs JPMorgan also expects very little damage from a Democratic clean sweep if Wall Street’s most respected economists and analysts are telling their institutional clients that a blue wave is a good thing for stocks…then a major market correction is less likely, and a major crash far less likely In other words, if you sell all your stocks ahead of the election, because of the rising probability of a Democratic sweep, you risk missing out on what potentially could be a strong year for stocks. (Source: MarketWatch) Here is the blue-chip economist consensus, the 16 most accurate economists out of 45 tracked by MarketWatch. Note the 4.8% GDP growth currently expected next year. That growth would mean the US economy sets a new record for GDP by the end of 2021. Or to put another way, the worst recession in 75 years could be fully recovered from, at least in terms of output, in just over a year. Do you really want to ignore the most accurate economists we have and assume that some guy on Facebook, Youtube, or Twitter, predicting market disaster is correct? When the probability of making money in stocks is close to 100% over 16 years, and 90% over six years, I know where I’m placing my bets. I have 100% of my life savings invested and have spent the pullback buying steadily and in a disciplined fashion. Those include a diverse group of the most hated cyclical names, such as industrials, financials, and energy stocks, as well as undervalued hypergrowth names that analysts expect to grow 2.5X to 5X faster than the S&P 500. Even if Moody’s, Goldman, UBS, and the entire blue-chip economist consensus is wrong, I still have a large amount of cash/bonds that I can use in any future corrections, such as should this become a contested election. (Source: imgflip) Ultimately I’m betting that America will survive and prosper, and through owning a collection of high-quality stocks, within a diversified and prudently risk-managed portfolio, so will I. Want More Great Investing Ideas? 7 Best ETFs for the NEXT Bull Market What is the Cure for Stock Market Volatility? Chart of the Day- See Christian Tharp’s Stocks Ready to Breakout SPY shares were trading at $346.04 per share on Friday morning, up $2.26 (+0.66%). Year-to-date, SPY has gained 9.06%, versus a % rise in the benchmark S&P 500 index during the same period."}]}