{"article": [{"url": "https://stocknews.com/news/dfs-1-finance-stock-for-bullish-options-traders/", "published": 1600862900.0, "headline": "1 Finance Stock for Bullish Options Traders", "body": "Illinois-based Discover Financial Services (DFS) specializes in American banking, positioned as the parent to Discover Bank, Discover and Pulse networks, and Diners Club International. Consumers can receive services ranging from credit cards, checking and savings accounts, personal, student, home-buying loans, and more. Much like its sector peers, and the rest of the broader-market, the equity has experienced a volatile 2020. Specifically, DFS began the year trading slightly below its all-time highs, at the notable $85-$86 level. However, the inevitable (and unmissable) market selloff in the wake of the coronavirus outbreak sent the shares into turmoil, with multiple bear gaps leading the way to the stock’s March 19 bottom of $23.25. This marked a more than eight-year low for Discover Financial Services stock, or a nearly 75% haircut to its July 2019 peak. However, since hitting this tremulous floor, the security has slowly reconciled, making its way modestly higher at a relatively steady pace. In fact, the shares enjoyed multiple bull gaps to push toward a three-month high near $67, though it has since pulled back slightly to trade just shy of $54, down 2% in Wednesday’s trading. Meeting the shares upon multiple occasions for a leg of support has been the 80-day moving average — a trendline the stock has now come back within one standard deviation of, implying an overdue lift may be in the cards for DFS. From a broader stance, the finance name remains down 37% year-to-date. 9 \"BUY THE DIP\" Growth Stocks For 2020According to a study from Schaeffer’s Senior Quantitative Analyst Rocky White and as mentioned above, DFS just came within one standard deviation of its 80-day moving average, after a lengthy period above the trendline. White’s modeling shows five similar signals occurring in the past three years. One month after these signals, Discover Financial Services stock was higher 80% of the time, and averaged a one-month return of 5.8%. A similar move from DFS’ current perch would put the equity back above $57. Looking toward the options pits, it looks like some bearish activity may be getting ready to unwind. This is per Discover Financial Services stock’s 10-day put/call volume ratio of 1.34 at the International Securities Exchange (ISE), Cboe Options Exchange (CBOE), and NASDAQ OMX PHLX (PHLX). This lofty ratio ranks in the 95th percentile of its annual range, or in simpler terms, should bears begin to retreat, it could send DFS higher. Analysts also look ripe for an improved mindset. Heading into today, 50% of the 14 covering brokerage firms sport a tepid “hold ” or “strong sell” recommendation. In other words, a slew of bull notes could be on the horizon for the lending giant. Also worth noting, options look like a decent way to go when weighing on DFS’ next move, as it is currently seeing attractively priced premiums. The stock’s Schaeffer’s Volatility Index (SVI) of 50% sits higher than 25% of readings in its annual range, suggesting short-term options are pricing in relatively low volatility expectations. Lastly, the stock’s Schaeffer’s Volatility Scorecard (SVS) sits at 81 out of 100. In simpler terms, this means DFS has tended to exceed option traders’ volatility expectations during the past year — a boon for option buyers. Keeping track of the week’s stock market activity is no easy feat. Our Schaeffer’s Market Mashup podcast gives you a quick 15-minute look at hot-button investing news and trends, as well as interviews with analysts and traders to help you craft a rock-solid options strategy. Tune into the latest episode of Market Mashup to up your investment game. DFS shares were unchanged in after-hours trading Wednesday. Year-to-date, DFS has declined -35.61%, versus a 1.68% rise in the benchmark S&P 500 index during the same period."}]}