{"article": [{"url": "https://stocknews.com/news/mu-pep-mkc-info-4-buy-rated-stocks-reporting-earnings-this-week/", "published": 1601294900.0, "headline": "4 Buy-Rated Stocks Reporting Earnings This Week", "body": "Another earnings season is approaching. Despite the market’s recent correction, the stock market is above its pre-coronavirus highs. Clearly, the market believes in the recovery and expects that earnings will follow suit. Earnings will reveal whether the market’s optimism is justified. In the last couple of quarters, companies weren’t punished for missing on earnings due to the challenging economic environment caused by the coronavirus pandemic. However, we are now getting closer to the moment when earnings start to matter. PepsiCo, Inc. (PEP), Micron Technology, Inc. (MU), IHS Markit Ltd. (INFO), and McCormick & Company, Incorporated (MKC) are scheduled to report their earnings this week. So, it’s worth keeping a close eye on these stocks. 9 \"BUY THE DIP\" Growth Stocks For 2020PepsiCo, Inc. (PEP) PEP operates beverage, snack, and food businesses worldwide. The company’s product portfolio includes a wide range of foods and beverages with 23 brands in more than 200 countries around the world. PEP is scheduled to report its results for the fiscal third quarter ended September 5, 2020, on October 1st. The market expects the company to report EPS of $1.48 for the quarter which indicates a 5.1% decline from the year-ago value. The consensus revenue estimate of $17.21 billion for the quarter indicates a year-over-year increase of 0.1%. However, PEP’s earnings surprise history looks impressive, with the company beating the consensus EPS estimates in each of the trailing four quarters. The company has not provided any outlook, as the environment has remained volatile and much uncertainty remains about the duration and long-term implications of the pandemic. For the fiscal second quarter, revenue decreased by 3.1% year-over-year to $15.95 billion while EPS declined 18% year-over-year to $1.18. However, the company increased its dividend payout by 7% year-over-year to $1.02. Vail Resorts and PEP have recently announced an expansion of their longstanding partnership to 18 additional Vail Resorts locations across North America, totaling 33 total resorts globally, to advance sustainability goals by focusing on waste reduction. PEP has also teamed up with Red Lobster to leverage its iconic food and beverage brands and create a variety of new menu items, starting with the DEW® Garita, the first official MTN DEW cocktail. PEP witnessed an improvement in its business performance and channel mix dynamics during the last reported quarter. The company has ample liquidity and flexibility to meet the needs of its business and return cash to shareholders. Moreover, PEP’s agile supply chain and flexible go-to-market systems are posing a competitive advantage. PEP’s POWR Ratings reflect a promising outlook. It has an overall rating of “Buy” with a “B” for Buy & Hold Grade and Peer Grade. Among the 29 stocks in the Beverages industry, it’s ranked #4. Micron Technology, Inc. (MU) MU manufactures and sells innovation memory and storage solutions worldwide. The company operates through four segments – Compute and Networking Business Unit, Mobile Business Unit, Storage Business Unit, and Embedded Business Unit. MU will host its conference call on September 29th to discuss financial results for its fiscal fourth quarter ended August 2020. The street expects MU to report EPS of $0.99 for the quarter, which indicates a 76.8% increase over the year-ago number. Moreover, MU’s consensus revenue estimate of $5.9 billion for the quarter indicates a year-over-year increase of 21%. MU also has an impressive earnings surprise history as the company beat the consensus EPS estimates in each of the trailing four quarters. The management expects EPS for the quarter to lie within the $0.78 and $0.98 range. The top-line is anticipated to fall in the range of $5.75 billion to $6.25 billion. For the fiscal third quarter, revenue increased by 13.6% year-over-year to $5.44 billion while EPS declined 4% year-over-year to $0.71. MU is ramping the industry’s most advanced DRAM technology into production and have delivered more than 75% of its NAND volume as high-value solutions, supported by record SSD revenue in the quarter. MU has recently launched a limited edition Crucial Ballistix MAX 5100 Gaming DRAM, offering consumers with an optimal gaming memory option, boasting the fastest speed available to date for purchase. The company also announced the world’s fastest discrete graphics memory solution, GDDR6X, the first to power system bandwidth up to 1 terabyte per second (TB/s) in September. Working with visual computing technology leader NVIDIA (NVDA), MU debuted GDDR6X in the new NVDA GeForce RTX 3090 and GeForce RTX 3080 graphics processing units (GPUs), which are tailored to support the fast speeds that immersive, high-performance gaming applications demand. The company shipped more chips than expected, and the price per chip was higher than expected, despite challenges in the macro-environment. The portfolio’s momentum positions MU to leverage the long-term growth across its end markets. MU is rated a “Buy” in our POWR Ratings system. It also has an “A” for Trade Grade and Peer Grade and a “B” for Industry Rank. It also ranks #10 out of 86 stocks in the Semiconductor & Wireless Chip industry. IHS Markit Ltd. (INFO) INFO provides critical information, analytics, and solutions for various industries and markets that drive economies worldwide. The company’s information, analytics, and solutions enhance operational efficiency and offer deep insights for customers in business, finance, and government. INFO will hold its earnings webcast on September 29th to discuss the financial results of its fiscal third quarter ended August 2020. The market expects the company to report EPS of $0.69 for the third quarter, which indicates a 3% improvement over the year-ago number. INFO’s earnings surprise history is impressive with the company beating the consensus EPS estimates in each of the trailing four quarters. However, the consensus revenue estimate of $1.07 billion for the quarter indicates a year-over-year decline of 3.7% In the second quarter, net revenue decreased 10% year-over-year to $1.03 billion and the EPS came in at $0.69, a slight decrease from $0.71 in the year-ago period. While the revenue from the financial segment increased by 2% year-over-year, the contribution from the transportation segment declined 24% compared to the year-ago quarter. INFO subsidiary Mastermind recently announced that it has integrated its Market EyeQ platform with its subsidiary CARFAX History-Based Value (CHBV). The integration will improve the market of EyeQ, offering dealers better insight into a vehicle’s history so that they can precisely estimate trade valuations and recondition costs. The company had also completed the acquisition of Catena Technologies (Catena), a global regulatory trade reporting firm based in Singapore, in May 2020. The company has successfully managed to cut down costs in the last reported quarter along with dealer price concessions. It is benefitting from its huge customer base which comprises more than 50,000 business and government customers, including 80% of the Fortune Global 500 and the world’s leading financial institutions. It’s no surprise that INFO is rated a “Buy” in our POWR Ratings system, with an “A” in Trade Grade and Peer Grade, and a “B” in Buy & Hold Grade and Industry Rank. It is also ranked #21 out of 204 stocks in the Financial Services (Enterprise) industry. McCormick & Company, Incorporated (MKC) MKC manufactures, markets, and distributes spices, seasoning mixes, condiments, and other flavorful products to the food industry. The company operates in two segments – Consumer and Flavor Solutions. The company will hold its earnings webcast on September 29th to discuss the financial results of its fiscal third quarter ended August 2020. MKC’s consensus revenue estimate of $1.39 billion for the quarter indicates a year-over-year increase of 4.7%. The market expects the company to report an EPS of $1.52 for the same quarter, which represents a 4.1% increase over the year-ago number. Moreover, MKS’s earnings surprise history looks impressive, with the company beating the consensus EPS estimates in three of the trailing four quarters. In the second quarter ended May 2020, MKC’s sales were up 10% year-over-year in constant currency with 26% growth in the consumer segment as consumers were cooking more at home during lockdowns. EPS for the quarter came in at $1.46 as compared to $1.12 per share in the year-ago quarter. The quarter was impacted by a shift in consumer demand resulting from the pandemic, putting pressure on the supply chain. The company believes there will be a shift in demand due to COVID-19 for the balance of the year but cannot predict the level of consumption at home or away from home. However, it expects customer demand from packaged food companies to be consistent with levels before the pandemic. The POWR Ratings are consistent with MKC’s strong fundamentals as it has a “Buy” rating with an “A” in Peer Grade, and a “B” in Trade Grade, Buy & Hold Grade, and Industry Rank. It is also ranked #11 out of 57 stocks in the Food Makers industry. Want More Great Investing Ideas? 7 Best ETFs for the NEXT Bull Market Is the Stock Market Correction Over? Chart of the Day- See the Stocks Ready to Breakout MU shares rose $0.23 (+0.46%) in after-hours trading Monday. Year-to-date, MU has declined -7.55%, versus a 5.32% rise in the benchmark S&P 500 index during the same period."}]}