{"article": [{"url": "https://stocknews.com/news/alxn-sgen-immu-fate-4-biotech-stocks-that-will-continue-to-soar-in-october/", "published": 1602158900.0, "headline": "4 Biotech Stocks That Will Continue to Soar in October", "body": "Investors should have some allocation to biotech stocks in their portfolios. Yes, there is greater than average volatility, but it’s also the hub of innovation in terms of treatments and diagnostics. Further due to advances in genetics and sequencing, the cost of drug development has plummeted. Additionally, the need for new and effective treatments is continually growing due to the aging US population. Let’s take a look at four of the most intriguing stocks that are likely to move higher in the month to come: Seattle Genetics (SGEN), Alexion Pharmaceuticals (ALXN), Immunomedics (IMMU), and Fate Therapeutics (FATE). 9 \"BUY THE DIP\" Growth Stocks For 2020Seattle Genetics (SGEN) Therapies that zero in on cancer treatment are of the utmost importance. Countless dollars have been funneled into the development and commercialization of these therapies. SGEN is leading the charge. The company’s top product, Adcetris, has been approved for cases in which Hodgkin lymphoma and systemic anaplastic large cell lymphoma have relapsed. Adcetris rakes in more than $600 million alone each year. SGEN has A grades in each POWR component but for its Industry Rank. SGEN is ranked second of 376 Biotech stocks. SGEN has steadily moved upward since a slight dip earlier this spring. Do not shy away from this stock simply because it is near its 52-week high. SGEN has the potential to eclipse $250 by the end of the year. With several potential revenue catalysts on deck, SGEN just might break through to new heights in the months to come. Alexion Pharmaceuticals (ALXN) The market for life-saving drugs that treat individuals saddled by rare disorders is more substantial than most investors assume. ALXN’s primary revenue source is Soliris, a drug approved for the treatment of disorders stemming from immune system components that activate in an uncontrolled manner. ALXN’s POWR Ratings are nearly flawless with A grades in three of four categories. ALXN is ranked 16th of nearly 400 Biotech stocks. The price target for ALXN is $147.89, meaning it has nearly 30% upside remaining. ALXN has a forward P/E ratio of 10.43, indicating it is undervalued at its current trading price of $119. ALXN is quickly moving right back toward its post-COVID high of $120. Even if Soliris ends up with considerable competition from generics, ALXN’s Ultomiris will emerge as a therapy that is administered every two months rather then every couple weeks as required by Soliris. Immunomedics (IMMU) The treatment of blood cancer and particularly challenging solid tumors is the focus of IMMU. IMMU has A grades in three of the four POWR Rating components along with an industry rank in the top five of nearly 400 publicly traded Biotech companies. Now that IMMU’s Trodelvy drug has earned approval to treat breast cancer, the runway is established for continued growth. Gilead was so impressed with the quick approval that it aggressively moved to acquire IMMU at $88 per share, equating to a $21 billion deal. Fate Therapeutics (FATE) It is possible the programming of cells to create cell therapies will one day solve the riddle of cancer and immune disorders. FATE specializes in developing such therapies. FATE scientists program the immune system and blood cells with pharmacologic modulators to bolster the properties and functions of donor cells before administering them to patients. FATE has A grades in three of the four POWR Rating components. The stock is ranked in the top 25 of nearly 400 publicly traded companies in the Biotech space. Of the six analysts to study FATE in-depth, every single one recommends buying the stock. FATE briefly dipped down toward $15 during the early days of the pandemic yet has gradually climbed upward well beyond its pre-COVID trading level. Though it might take a while for FATE to generate recurring revenue, the stock has serious potential. Overlook the inherent risk involved in developing drugs and novel therapies that have not been used on human patients before and you will find FATE has the potential to increase exponentially in the years to come. If you are a speculator, FATE is worthy of your attention. Want More Great Investing Ideas? 7 Best ETFs for the NEXT Bull Market What is the Cure for Stock Market Volatility? Chart of the Day- See Christian Tharp’s Stocks Ready to Breakout ALXN shares were trading at $123.68 per share on Thursday morning, down $1.65 (-1.32%). Year-to-date, ALXN has gained 14.36%, versus an 8.11% rise in the benchmark S&P 500 index during the same period."}]}