{"article": [{"url": "https://stocknews.com/news/amgn-gild-amgen-vs-gilead-sciences-which-stock-is-a-better-buy/", "published": 1601467700.0, "headline": "Amgen vs. Gilead Sciences: Which Stock is a Better Buy?", "body": "Amgen Inc. (AMGN) and Gilead Sciences, Inc. (GILD) ranked in the top ten biggest global pharmaceutical companies based on sales in 2019. Since the beginning of the pandemic, the pharmaceutical industry has garnered significant investors’ attention for its potential to generate massive earnings based on Covid-19 related developments and global demand for such products. Though AMGN gained 85.6% over the past five years, GILD lost 35.3% during the same period. AMGN is ahead of GILD in terms of year-to-date performance as well. AMGN is the clear winner with 3% year-to-date gains versus GILD’s 4.4% loss. But which stock is the better pick now? Let’s find out. Latest Movements 9 \"BUY THE DIP\" Growth Stocks For 2020AMGN develops and markets human therapeutics for treating cardiovascular diseases and various types of cancer. On August 31st, AMGN was added to the Dow Jones Industrial Average. AMGN recently collaborated with Eli Lilly and Company (LLY) to manufacture all future COVID-19 therapies, including Lilly’s LY-CoV-555. The main aim behind this partnership is to make the COVID vaccine accessible to all the affected countries by increasing the global supply. Also, AMGN’s inflammatory drug Otezla is being tested as a potential immunomodulatory treatment for COVID. AMGN is participating in NIH’s Accelerating COVID-19 Therapeutic Interventions and Vaccines partnership and the COVID R&D Alliance, with more than 20 biopharmaceutical companies to speed up the development of an effective vaccine. AMGN also partnered with Adaptive Technologies, AbbVie (ABBV), and Takeda (OTCMKTS:TKPHF) for the development of a potential vaccine. On August 20th, AMGN received FDA approval for two of its drugs for treatment of refractory multiple myeloma. Its Repatha drug, currently in its phase three of clinical trials, announced positive results, which were subsequently published in the New England Journal of Medicine. GILD is a research-based pharmaceutical company catering to hematology, oncology, respiratory and inflammation related diseases. On September 1st, it entered into an agreement with Jounce Therapeutics to discover and develop cancer immunotherapies. As per the contract, GILD retains all rights to commercially manufacture the treatment for an investment of $120 million in cash and equity. On September 14th, GILD announced the acquisition of Immunomedics for $21 billion, which is expected to accelerate its oncology pipeline. GILD’s new drug Jyseleca received approval from the European Commission and government of Japan for commercial sale for treating rheumatoid arthritis in their respective countries. It also received FDA approval for anti-CD47 monoclonal antibody to treat bone marrow cancer. GILD’s COVID drug Veklury (remdesivir) received emergency use authorization (EUA) from FDA for treating all patients diagnosed with COVID. Positive reports from phase three simple trials allowed remdesivir to receive EUA for treating moderate COVID-19 pneumonia along with severe cases. It is one of the first effective drugs to fight coronavirus. GILD has announced plans to produce over 2 million units of remdesivir by the end of 2020. Recent Financial Results AMGN’s net revenues increased 6% year-over-year to $6.20 billion in the second quarter that ended in June 2020. Its non-GAAP EPS increased 7% from the same period last year to $4.25, while non-GAAP operating income rose 9% from the year-ago value to $3.20 billion. GILD, on the other hand, witnessed a year-over-year decline in earnings due to the impact of the pandemic on its business operations. Its net revenue fell 5.7% year-over-year to $5.10 billion in the second quarter. It reported negative EPS for the quarter, and $1.40 billion in non-GAAP net income, significantly lower than its year-ago numbers. Past and Expected Financial Performance AMGN’s revenue has grown at a CAGR of 1.8% over the past three years. Also, the CAGR of its free cash flow has been 4.1%. The market expects AMGN’s revenues to grow 10.7% in the current quarter, 7.1% in the current year, and 4.3% next year. Its EPS is expected to grow at 3.8% in the current quarter, 6.3% in the current year, and 6.9% next year. Moreover, AMGN’s EPS is expected to grow at a rate of 6.9% per annum over the next five years. Contrarily, GILD’s revenue and free cash flow declined at a CAGR of 8% and 30.6%, respectively, over the past three years. The market expects GILD’s revenues to increase 14.5% in the current quarter and 7.8% in the current year. Its EPS is expected to grow 12% in the current quarter and 5.4% in the current year. GILD’s EPS is expected to increase nominally over the next five years. Hence, AMGN is in an advantageous position here. Profitability AMGN’s trailing twelve-month revenue is 1.1 times of what GILD generates. However, GILD is more profitable with a gross profit margin of 78.6% versus AMGN’s 78.2%. On the other hand, AMGN’s ROA of 9.3% compares favorably with GILD’s 4.4%. Valuation In terms of forward P/E, AMGN is currently trading at 15.75x, 76.8% higher than GILD’s 8.91x. Also, AMGN’s trailing 12-month P/S of 6.05x is 70.9% higher than GILD’s 3.54x. In terms of trailing 12-month price/ cash flow as well, AMGN’s 13.38x is 58.5% higher than GILD’s 8.44x. However, AMGN is less expensive in terms of non-GAAP forward PEG (1.84x versus GILD’s 2.77x). Though AMGN is relatively more expensive than GILD, it is worth paying the premium as AMGN has a higher growth potential and stable financials. POWR Ratings While AMGN is rated a “Strong Buy” under our proprietary POWR Ratings system, GILD is rated “Sell”. Here’s how the four components of overall POWR Ratings are graded for both AMGN and GILD: AMGN has an “A” for Trade Grade, Buy & Hold Grade, and Peer Grade, and a “C” for Industry Rank. It is also ranked #1 out of 376 stocks in the Biotech industry. GILD has a “C” for Buy & Hold Grade, Peer Grade, and Industry Rank, and an “F” for Trade Grade. In the Biotech industry, it is currently ranked #127. The Winner It is evident that AMGN has better potential to grow in the upcoming months. Though relatively more expensive, AMGN has favorable analyst sentiment and higher earnings and revenue growth potential. Also, its involvement in the coronavirus drug development might help the stock soar above expectations in the upcoming quarters. Want More Great Investing Ideas? Do NOT Buy Stocks Before the Election! 7 “Safe-Haven” Dividend Stocks for Turbulent Times Chart of the Day- See Christian Tharp’s Stocks Ready to Breakout AMGN shares fell $0.99 (-0.39%) in after-hours trading Wednesday. Year-to-date, AMGN has gained 7.61%, versus a 5.54% rise in the benchmark S&P 500 index during the same period."}]}