{"article": [{"url": "https://stocknews.com/news/abt-abbv-azn-regn-4-buy-rated-covid-19-stocks/", "published": 1599221300.0, "headline": "4 “Buy-Rated” COVID-19 Stocks", "body": "The anticipation of a COVID-19 treatment or vaccine has been one of the driving forces for the current stock market rally. Nearly all stocks working on treatment or vaccines have seen incredible gains. However, only a couple will be successful. The companies that fail are likely to see their stocks plunge, while the winners will rally more. There’s going to be incredible amounts of demand for any product that proves to be effective in treating or preventing the virus. 7 Best ETFs for the NEXT Bull MarketAbbott Laboratories (ABT), AbbVie Inc. (ABBV), AstraZeneca PLC (AZN), and Regeneron Pharmaceuticals, Inc. (REGN) are four buy-rated stocks that are among the better COVID-19 plays. Abbott Laboratories (ABT) This global healthcare company has gained more than 60% since its March lows. In its second quarter, ABT reported $615 million of COVID-19 diagnostic testing-related sales. ABT recently announced that its BinaxNOW™ COVID-19 Ag Card test for the detection of COVID-19 infection has received Emergency Use Authorization from the FDA. The test costs only $5 and provides results in 15 minutes. It uses a proven lateral flow technology and demonstrated a sensitivity of 97.1% and specificity of 98.5% in a clinical study. Moreover, ABT will also launch a complimentary phone app called NAVICA™ which also displays test results that can be used for verification. The company will ship tens of millions of tests in September and accelerate the number of tests to 50 million tests a month at the beginning of October. The market expects the company to report an EPS of $0.89 for the quarter ending September 2020, which indicates an increase of 6% year-over-year. ABT’s consensus revenue estimate for the quarter of $8.46 billion indicates an improvement of 4.8% from the year-ago quarter. How does ABT stack up for the POWR Ratings? A for Trade Grade A for Peer Grade B for Buy & Hold Grade B for Industry Rank B for Overall POWR Rating The stock is also ranked #14 out of 232 stocks in the Medical-Pharmaceuticals industry. AbbVie Inc. (ABBV) ABBV operates in the realm of critical therapeutic areas in medicine such as virology, neuroscience, immunology, oncology, gastroenterology, among other specializations. The stock has grown more than 45% since hitting its 52-week low of $62.55 in March. In ABBV’s second quarter, net revenues increased 26.3% on a reported basis, and earnings per share increased 3.5% year-over-year. The company is in the race to find a cure for the coronavirus. It has a novel therapeutic candidate for COVID-19 in its pipeline for which the company joined forces with Harbour BioMed, Utrecht University, and Erasmus Medical Centre. Members of the COVID R&D Alliance, which includes ABBV announced the first patients enrolled in the I-SPY COVID Trial, which will study the impact of Cenicriviroc, Otezla®, and Firazyr® on inflammatory response in COVID-19 patients. The company also announced a $30 million collaborative research alliance with Harvard University to develop novel therapies against emergent viral infections with a focus on coronavirus and hemorrhagic fever. The market expects the company to report an EPS of $2.76 for the quarter ending September 2020, which indicates an 18.5% growth over the year-ago number. Also, ABBV beat its consensus EPS estimates in each of the trailing four quarters. ABBV’s consensus revenue estimate of $12.82 billion for the quarter indicates a year-over-year increase of 51.2%. ABBV’s POWR Ratings reflect this promising outlook. It has an overall rating of “Buy” with a grade of “A” for Peer Grade and a “B” for Trade Grade, Buy & Hold Grade, and Industry Rank. Among the 232 stocks in the Medical-Pharmaceuticals industry, it’s ranked #15. AstraZeneca PLC (AZN) Interim results from the ongoing Phase I/II COV001 trial showed that AZD1222, which uses a replication-deficient chimpanzee viral vector based on a weakened version of the common cold virus, generated robust immune responses against the SARS-CoV-2 virus in all participants. AZD1222 expanded into a Phase III clinical trial in the US and there have also been ongoing late-stage clinical trials in the UK, Brazil, and South Africa and trials planned to start in Japan and Russia taking the enrollment up to 50,000 participants globally. The results from the late-stage trials are anticipated later this year. Recent supply announcements with Russia, South Korea, Japan, China, Latin America, and Brazil take the global supply capacity towards three billion doses of the vaccine. AZN also agreed with the European Commission (EC) to supply up to 400 million doses of the AZD1222 COVID-19 vaccine giving all EU member states the option to access the vaccine. Furthermore, the first participants have been dosed in a Phase I trial of AZD7442, a combination of two monoclonal antibodies (mAbs) in development for the prevention and treatment of COVID-19. If the trial showcases positive results, AZN will progress into larger late-stage Phase II and Phase III trials. In the company’s H1 2020, total revenue increased by 12% and core EPS increased 24% from the year-ago period. The positive developments concerning a solution for Covid-19 have resulted in encouraging consensus estimates for the quarter ending September. The estimates show sales growth of 4.5% and EPS growth of 6% from the previous year. The stock has returned more than 25% since its March low. It’s no surprise that AZN is rated a “Buy” in our POWR Ratings system. It also has an “A” for Peer Grade and a “B” for Trade Grade and Industry Rank. In the 232-stock Medical-Pharmaceuticals industry, it is ranked #16. Regeneron Pharmaceuticals, Inc. (REGN) REGN is a leading biotechnology company that invents life-transforming medicines for people with serious diseases. The stock has been on an upward trajectory since the start of February this year with minor hiccups along the way. REGN has returned 99.5% over the past year and 16.8% over the past six months. In REGN’s second quarter, total revenues and net income increased 24% year-over-year. REGN’s two-antibody ‘cocktail’ REGN-COV2 is currently in late-stage clinical trials for the treatment and prevention of COVID-19 infection. It is being evaluated in two Phase 2/3 clinical trials for the treatment of COVID-19 and in a Phase 3 trial for the prevention of COVID-19 in household contacts of infected individuals. REGN and Roche are collaborating to increase the supply and distribute the investigational anti-viral antibody cocktail. According to the agreement, the supply of REGN-COV2 is expected to increase at least three and a half times the current capacity and if the candidate succeeds in the trial it will be distributed by REGN within the US and Roche outside the US. REGN’s earnings surprise history looks pretty good with the company beating consensus EPS estimates in each of the trailing four quarters. The market expects REGN’s sales and EPS to grow by 1.9% and 6.7%, respectively, as compared to the year-ago period. REGN is rated a “Buy” in our POWR Ratings system. It also has an “A” for Peer Grade and a “B” for Trade Grade and Buy & Hold Grade. It is also ranked #7 out of 373 stocks in the Biotech industry. Want More Great Investing Ideas? 7 Best ETFs for the NEXT Bull Market Beware Stocks in September? 9 “BUY THE DIP” Growth Stocks for 2020 ABT shares were trading at $104.37 per share on Friday afternoon, down $1.16 (-1.10%). Year-to-date, ABT has gained 21.65%, versus a 7.84% rise in the benchmark S&P 500 index during the same period."}]}