{"article": [{"url": "https://stocknews.com/news/tsla-tm-amzn-tesla-vs-the-nfl/", "published": 1594382900.0, "headline": "Tesla vs. the NFL", "body": "My investment and analysis services focus on dividend stocks, value stocks, and high-yield investments. However, I keep an eye on investment assets of all types, and when something unusual happens, I will dig into the facts to develop my understanding of what is happening. Tesla, Inc. (TSLA) A few days ago, one news headline caught my attention. The Tesla, Inc. (TSLA) stock price has been on a tear, rising from $360 at the bottom of the stock market crash in March to currently trade around $1,400. 7 \"SAFE HAVEN\" Dividend Stocks for Turbulent TimesToyota Motor Corp. (TM) The share price rise has been relentless, and on July 1, the headlines read that Tesla had surpassed Toyota Motor Corp. (TM) as the world’s most valuable car manufacturer by market cap. If you compare the two companies, the fact that Tesla is worth more than Toyota makes little sense. In 2020, Toyota will produce 8.8 million vehicles. Tesla says it will produce 500,000 cars and SUVs. In its latest fiscal year, Toyota reported a net income of $19.3 billion on revenue of $258.2 billion. Tesla lost $144 million on revenue of $26.0 billion. Tesla has never reported an annual profit. Its best year was 2013, when it only lost $74 million. Yet, the Tesla share price marches ever higher. Logic says a stock cannot continue to appreciate at such a rate. Traders and investors continue to say “hah” to logic. Here is the event I think will bring an abrupt stop to the Tesla share price appreciation: The start of the National Football League season I always like the line on one of the financial networks: “So what are investors betting on today?” If they are betting, they are not investors. And right now, it really is betting and bettors driving TSLA higher. Here is what I see: First up is the group of investors who believe that Tesla will be the dominant car manufacturer of the future. They think that every driver will eventually own a Tesla, and other manufacturers will become shells of their former businesses. This is faith-based investing. Even if they are correct, it will take many years for Tesla to become the dominant vehicle manufacturer, and a lot can happen to share prices along the way. Amazon Inc. (AMZN) Consider the share price history of Amazon Inc. (AMZN). Amazon went public in 1997, and the stock peaked at a split-adjusted $113 in December 1999. The tech bubble burst in 2000, and by October 2001, Amazon traded for less than $6.00 per share. While you probably know that Amazon now trades for more than $3,000 per share, it was October 2009 before the stock again exceeded its 1999 peak. Do you think the millennials on Robinhood who placed all their money in TSLA would be willing to wait a decade to see the stock price recover from a fall? Anecdotal evidence points to frustrated sports bettors as another group pushing up the price of Tesla. With sports shut down by the coronavirus outbreak, regular sports gamblers have discovered the potential of Tesla options. Call options are short-term bets that stock will go higher. As long as the stock price keeps going up, options are a great bet. If the stock price stagnates for a month or so, the options will turn into 100% losers, and you can bet the gamblers will find another game. Few investors know that when traders buy calls, the market makers on the other side of the trades must buy shares to protect their capital. The explosion in Tesla option trading forces market makers to buy more shares, putting additional upward pressure on the share price. The question is: when the pro football season starts, will the former sports gamblers want to keep trading Tesla call options, or would they rather bet on the Sunday afternoon games? I think you know the answer. The Tesla stock price story shows how a rapidly rising share price can become a house of cards, where pulling just one card can cause the whole structure to tumble. Tesla is a great company, but its stock price at this level is that house of cards. As a value investor, I look for stocks that the market hates, and the share prices are far below the intrinsic value of the companies. With these stocks, patience is required, but the gains are almost guaranteed to happen. Want More Great Investing Ideas? Top Dividend Stock to Own! Download Free Report Today Buy These 3 High-Yield Dividend Stocks All Under $15 Buy and Hold These 3 Dividend Stocks Forever TSLA shares . Year-to-date, TSLA has gained 269.24%, versus a -0.31% rise in the benchmark S&P 500 index during the same period."}]}