{"article": [{"url": "https://stocknews.com/news/gold-aem-kgc-3-gold-miners-to-buy-as-we-near-novembers-election/", "published": 1601986100.0, "headline": "3 Gold Miners to Buy as We Near November's Election", "body": "The presidential election is less than one month away. The stock market will likely prove quite volatile leading up to the big day. Most expect that the election results will be contested, which will add to the volatility even after the election. Gold is an investment that investors often turn to in uncertain times like these. Which is why this might be a good time to establish positions in gold mining stocks. However, there are all sorts of mining companies to choose from. Instead of analyzing the pros and cons of each mining stock on your own, narrow your focus to those highlighted by our investing gurus. 7 \"SAFE HAVEN\" Dividend Stocks for Turbulent TimesHere is a look at three gold mining stocks every investor should consider adding to their portfolio as November 3rd quickly approaches: Barrick Gold Corporation (GOLD), Agnico Eagle Mines Limited (AEM) and Kinross Gold Corporation (KGC). Barrick Gold Corporation (GOLD) GOLD is a Toronto-based mining business focused on exploration and development. GOLD’s operations span five continents, making it the largest gold miner on the planet. GOLD has more than 70 million ounces of gold in its reserves. The company also has 13 billion pounds of copper. Even if GOLD’s operations are not significantly improved in the short-term and little changes in terms of its fourth-quarter outlook, the stock will likely increase as money shifts out of overpriced tech stocks into safe havens such as precious metals. GOLD has “B” grades in each POWR Rating component but for its Industry Rank. However, of 30 stocks in the Miners – Gold category, GOLD is ranked #1. According to TipRanks, the top analysts are quite bullish on GOLD, setting a price target of $32.27, indicating there is nearly 20% upside remaining. The fact that GOLD has reduced its debt load by more than 10% is icing on the cake. GOLD could move toward its 52-week high over $31 if the price of the precious metal rises above $2,000. Agnico Eagle Mines Limited (AEM) AEM is one of the world’s top gold producers. The company has mining operations throughout Canada, Finland and Mexico. AEM is also conducting gold exploration in Europe, the United States and Latin America. AEM has solid POWR Ratings, highlighted by an “A” Peer Grade. AEM is ranked second of 30 Miners – Gold stocks. Check out the top analysts’ take on AEM and you will find the outlook is quite rosy: a price target of $86.76, meaning there is the potential for a 12% move higher. Furthermore, 12 of 13 analysts recommend the stock as a “Buy.” Do not be dismayed by AEM’s forward Price to earnings (P/E) ratio in excess of 43. Investors are not concerned with a mining stock’s slight overvaluation when there is the potential for gold to exceed all-time highs. Kinross Gold Corporation (KGC) This Canadian gold mining company consistently ranks in the top 10 of gold mining businesses in the world. KGC’s annual gold production equivalent is in excess of 2.5 million ounces. KGC operates in the Americas, West Africa and Russia. The company also mines and sells silver. KGC has solid POWR Ratings with “B’s” in three of four components. Furthermore, KGC is ranked in the top three of the Miners – Gold stocks. The top analysts predict KGC will reach $11.07, which is 27% than its current price. KGC has a fairly low forward P/E ratio of 12.95, indicating it is likely to move higher as the seemingly inevitable political drama unfolds across the next month. KGC executives are adamant its production will significantly increase upwards of 30% or more all the way through 2023 and possibly beyond. Want More Great Investing Ideas? Do NOT Buy Stocks Before the Election! 7 “Safe-Haven” Dividend Stocks for Turbulent Times Chart of the Day- See Christian Tharp’s Stocks Ready to Breakout GOLD shares were unchanged in after-hours trading Tuesday. Year-to-date, GOLD has gained 46.89%, versus a 5.55% rise in the benchmark S&P 500 index during the same period."}]}