{"article": [{"url": "https://stocknews.com/news/cmcsa-un-umc-3-dividend-stocks-to-buy-and-hold-forever/", "published": 1601640500.0, "headline": "3 Dividend Stocks to Buy and Hold FOREVER", "body": "Now that tech stocks have become overvalued; there is a renewed focus on value stocks, particularly those that provide dividends. If you are looking for a way to diversify your portfolio away from tech stocks, you have come to the right place. Scoop up some dividend stocks, hold them for years or decades, and you will enjoy a steady stream of income. Though dividend returns are not surefire guarantees, they are usually paid. Below, we provide a look at three dividend stocks worth buying and holding forever: Comcast Corporation (CMCSA), Unilever NV (UN), and United Microelectronics Corporation (UMC). 7 \"SAFE HAVEN\" Dividend Stocks for Turbulent TimesComcast Corporation (CMCSA) No matter what happens to the economy and how much automation is implemented in years to come, media will still hold strong. CMCSA is a worldwide media and tech behemoth highlighted by Comcast Cable and NBC Universal. CMCSA had nearly $110 billion in revenue in 2019. Cable Communications account for more than half of CMCSA’s annual revenue. These communications consist of high-speed internet, video, and automation services. The POWR Ratings reveal CMCSA is nearly flawless with “A” grades in each component. CMCSA is ranked first of 14 stocks in Entertainment – TV & Internet Providers. TipRanks reports the average analyst price target for CMCSA is $50.50, which could mean a 9% upside. CMCSA has gradually climbed back to its pre-COVID price of $46. Though investors might take some profits off the table in the weeks ahead following the stock’s rapid ascension, this stock is still worth holding for the long haul. CMCSA’s dividend of 2% is the icing on the cake. Unilever NV (UN) There is no shame in shifting some of your tech dollars to value stocks that pay dividends. UN is one such stock. UN’s current dividend is more than 3%. UN is one of the leading consumer product businesses in the world. It makes all sorts of personal care products, home products, food and more. Examples of UN product lines include Lipton, Rama, and Dove. Though few know it, UN is one of the top frozen food producers in all of Europe. Furthermore, it also makes the popular Bertolli olive oil brand. In other words, UN products should sell quite well in the years and decades ahead. The POWR Ratings make it quite clear UN is a superstar stock. UN has “A” grades in each POWR Component and an industry rank of 2 out of 34 publicly traded companies in the Consumer Goods category. Analysts have set a price target of $63.99, which could mean an upside above 5%. UN has moved right back to its pre-COVID trading price of $60. The stock appears to have a floor around $58. Even if the economy remains in a prolonged recession, UN will still sell its products without significant setbacks, simply because the company’s offerings are used by people across the globe regardless of the state of the economy. United Microelectronics Corporation (UMC) The semiconductor industry will likely prove quite strong for the foreseeable future. UMC makes circuit wafers for customers in the semiconductor business. UMC also provides backend/front-end support, design libraries, IP resources, and more. UMC is a POWR Ratings superstar with “A” grades in each POWR component. UMC is ranked in the top 10 of 86 stocks in the Semiconductor & Wireless Chip category. TipRanks’ average analyst price target for UMC is $5.20, which could mean a nearly 8% upside. Even if UMC does not rapidly ascend in price, investors will benefit from its dividend, which is more than 2%. UMC’s June revenue spiked 25%. Furthermore, the company has a forward P/E ratio of 13, meaning it is undervalued at its current trading price. UMC could climb to $5 or $6 in the months. Want More Great Investing Ideas? Do NOT Buy Stocks Before the Election! 7 “Safe-Haven” Dividend Stocks for Turbulent Times Chart of the Day- See Christian Tharp’s Stocks Ready to Breakout CMCSA shares fell $0.84 (-1.81%) in premarket trading Friday. Year-to-date, CMCSA has gained 3.15%, versus a 6.22% rise in the benchmark S&P 500 index during the same period."}]}