{"article": [{"url": "https://stocknews.com/news/cco-et-skyw-gsh-4-downgraded-stocks-to-avoid/", "published": 1601035700.0, "headline": "4 DOWNGRADED Stocks to AVOID", "body": "POWR Rating Downgrades The POWR Ratings have been updated. It’s especially important to pay attention to new upgrades and downgrades as they can help us identify stocks with relative strength or weakness. If the broader market continues declining, then the biggest losers will be found amid the downgrades list. 7 Best ETFs for the NEXT Bull MarketThe stocks listed below have all been downgraded to the lowest possible POWR Rating of F, meaning Strong Sell due to a combination of poor fundamentals and technicals. Although these stocks could have oversold bounces, they are likely to underperform for the rest of the year. Without further ado, let’s take a look at the latest POWR Rating downgrades of note: Energy Transfer (ET), SkyWest (SKYW), Guangshen Railway (GSH), and Clear Channel Outdoor Holdings (CCO). Energy Transfer (ET) This is not the best time to be invested in energy companies unless they are of the renewable variety. The likes of ET have been sold off in recent months. ET provides gas-related services including transportation and storage. ET also serves as a propane retail marketer. The POWR Ratings show ET has F grades in each POWR Component but for its Peer Grade of C. ET is barely ranked in the top half of all Energy – Oil & Gas Stocks. ET has a year-to-date price return of nearly -50%, a three-month price return of -17%, and a three-year price return of-55%. ET has a forward P/E ratio of nearly 25, indicating it is overpriced at nearly $6 per share. Fuel consumption continues to stagnate as the economy remains partially closed. Though ET jumped up to $9 and change earlier this summer after selling off to $4 amidst the market-wide selloff, the stock has since settled int he $5 to $6 range. Adding salt to the wound is ET’s loss of its $300 million contracts with Chesapeake Energy, a company that is now bankrupt. This lost contract sets the stage for an awfully difficult road ahead. SkyWest (SKYW) Though some daring investors have segued back into airline stocks, the majority have kept their money on the sidelines. This is precisely why the likes of SKYW have been downgraded. SKYW provides regional airline service through the United States, Mexico, Canada, and the Caribbean. Air travel probably won’t return to normal for several years or even longer due to the pandemic and subsequent economic recession. SKYW has F grades in the POWR Components of Trade Grade and Buy & Hold Grade. SKYW also has a pitiful Peer Grade of D. All in all, SKYW is ranked in the bottom third of 20+ airline stocks. SKYW’s price return year-to-date is -51%. The stock’s three-year price return is a horrid -25%. Add in that fact that SKYW’s forward P/E ratio is a whopping 67 and you have all the more reason to exit this stock or even short it. Guangshen Railway (GSH) You have better places to put your money than a Chinese railroad stock. GSH operates the only railroad between Shenzhen and Guangzhou. This rail line transports both freight and passengers. The POWR Ratings show GSH has F grades in the Trade Grade and Buy & Hold Grade POWR Components along with a disappointing D Peer Grade. GSH has a year-to-date price return of -45%, a six-month price return of -12%, and a three-year price return of -67%. There is absolutely no reason to own this stock. Clear Channel Outdoor Holdings (CCO) The advertising industry is s struggling as fewer businesses are willing to pay for ads amidst the recession. As is often said, advertising and marketing are the first cuts when businesses are struggling. CCO provides advertising opportunities with displays of varying sorts including wallscapes, neons, billboards, and more. CCO has F grades in the POWR Components but for its Industry Rank and Peer Grade Components that are rated as Ds. The stock is ranked in the bottom half of the stocks in the Advertising sector. Even if the economy were in better shape, CCO would not be worth considering simply because more money is moving to online ads. Add in the fact that people are not traveling as frequently as they used to and companies are even less likely to pay for outdoor ads on displays provided by CCO. Stay away from this stock until the economy regains steam. CCO shares were trading at $0.93 per share on Friday morning, down $0.00 (-0.31%). Year-to-date, CCO has declined -67.48%, versus a 2.63% rise in the benchmark S&P 500 index during the same period."}]}