{"article": [{"url": "https://stocknews.com/news/aep-chart-of-the-day-american-electric-power-aep/", "published": 1594296500.0, "headline": "Chart of the Day: American Electric Power (AEP)", "body": "After a very volatile March, American Electric Power (AEP) has moved into a horizontal channel and there is a breakout trade setting up for smart and patient investors. AEP is one of the largest regulated utilities in the United States, providing electricity generation, transmission, and distribution to more than 5 million retail customers in 11 states. Like almost every stock, AEP experienced a huge downmove in February and March of this year. The stock bottomed on March 23rd at $65 and it’s currently trading at about $82. 7 \"SAFE HAVEN\" Dividend Stocks for Turbulent TimesIn the past few months, shares of AEP have been in a trading range and a horizontal channel was formed. A horizontal channel occurs when an asset’s, in this case a stock, price ranges sideways and support and resistance levels are formed. Channels are used by technical analysts to identify areas where breakout trades could occur. A breakout is when the price of an asset moves above a resistance level or below a support level. A breakout to the upside signals traders to buy the asset or cover short positions, while a breakout to the downside signals traders to get short or sell long positions. Take a look at the 1-year chart of AEP below with added notations: Chart of AEP provided by TradingView As you can see in this chart, AEP has formed a resistance level at about $87.50 (red), and an important level of support around $77.50 (green). There are two possible trades I am waiting patiently for: The stock moves higher, over the $87.50 resistance level. If/when that happens, a breakout to the upside could occur. The stock moves lower, under the $77.50 support level. If/when that happens, a breakout to the downside could occur. AEP has been a popular stock with investors due to its high dividend payout. The company currently sports a dividend yield of 3.4% with a payout ratio of 73.5%. AEP has a long consistent record of paying out dividends to its shareholders. AEP recently stated that its plans to invest $2 billion to bring renewable energy to Public Service Company of Oklahoma (PSO) customers and SWEPCO customers in Arkansas and Louisiana. That could be having an effect on the company’s recent stock movements. Have a good trading day! Christian Tharp, CMT @cmtstockcoach Stock Trading & Investing for Everyone Want More Great Investing Ideas? 9 “BUY THE DIP” Growth Stocks for 2020 Is the Bull S#*t Rally FINALLY Over? 7 “Safe-Haven” Dividend Stocks for Turbulent Times Top 3 Investing Strategies for 2020 AEP shares were trading at $81.13 per share on Thursday morning, down $1.29 (-1.57%). Year-to-date, AEP has declined -12.79%, versus a -1.03% rise in the benchmark S&P 500 index during the same period."}]}