{"article": [{"url": "https://stocknews.com/news/amzn-baba-googl-mrna-gpn-sbux-adt-3-of-david-teppers-largest-holdings/", "published": 1596802100.0, "headline": "3 of David Tepper's Largest Holdings", "body": "David Tepper is one of the most successful hedge fund managers in history, and founder Appaloosa LP. David added positions in tech behemoths and stocks in the healthcare industry after the pandemic hit. He was quick to understand what impact the virus could have on the market and had hinted to Jim Cramer of CNBC that the virus could be a “game changer” in early February. In May, the popular value investor revealed that he was holding 10-15% in equities and maintained a cautious approach. He felt that popular tech companies were “fully-valued” at the time. In an interview with CNBC he said, “The market’s pretty high and the Fed’s put a lot of money in here. The market is by anybody’s standard pretty full. There’s a lot of liquidity there and the Fed’s still there. It’s too hard to say the market can’t go up or something like that, but it’s not a very good risk-reward market.” Here are three of David’s largest portfolio holdings that you may want to invest in: Amazon.com, Inc. (AMZN), Alibaba Group Holding (BABA) and Alphabet (GOOGL): 7 Best ETFs for the NEXT Bull MarketAmazon.com, Inc. (AMZN) The highest percentage of David Tepper’s portfolio is occupied by AMZN. The portfolio holds 250,000 shares of AMZN, representing 14.9% of his portfolio. The stock price has risen by more than 88% since its March lows. There have been a number of positive developments for AMZN lately. Moderna (MRNA) has chosen Amazon Web Service as its preferred cloud provider and its standard for analytics and machine learning workloads. Moderna used the AWS powered research engine in the Phase 1 trial for its Covid-19 vaccine candidate. The cloud has helped Moderna speed up its manufacturing process and design research experiments. Moreover, AWS and Global payments (GPN) have announced a multi-year collaboration agreement in which they provide a leading cloud-based issuer processing platform to financial institutions around the world, and the partnership also helps expand Global Payment’s customer base. In the second quarter, AMZN’s net sales increased by 40% year-over-year, and net income increased to $5.2 billion compared to $2.6 billion in the year-ago period. Furthermore, operating cash flow was up 42% for the trailing twelve months compared to the previous year. The average revenue estimate of $92.37 billion for the quarter ending September 2020 indicates an increase of 32% over the year-ago quarter. AMZN’s EPS is expected to grow 36% per annum over the next five years. How does AMZN stack up for the POWR Ratings? A for Trade Grade A for Buy & Hold Grade A for Industry Rank B for Peer Grade A for Overall POWR Rating You can’t ask for better. The stock is also ranked #1 out of 54 stocks in the Internet industry. Alibaba Group Holding Ltd (BABA) BABA constitutes 13.49% of David Tepper’s Appaloosa LP portfolio. BABA has exhibited tremendous performance by growing about 50% since its March lows. BABA recently announced that it will help Starbucks (SBUX) broaden its reach in China and accelerate brand digitalization by introducing its mobile order and pay feature “Starbucks Now” on multiple platforms in the Alibaba Digital Economy. Alibaba Cloud, the official cloud service provider for the Olympics, assisted Paris 2024’s engagement initiative “Le Club Paris 2024” on the website for Olympics and sports fans. BABA achieved a gross merchandise value of $1 trillion in its fiscal year ending March 31st 2020, which is a historic landmark. In the quarter ending March 31st 2020, revenue increased 22%, and earnings per share increased 7% year-over-year. Moreover, annual active customers in the China retail space reached 726 million. BABA has an impressive earnings surprise history with the company surpassing consensus EPS estimates in each of the trailing four quarters. The market expects the company to report an EPS of $1.99 for the quarter ending June 2020, which represents 12.4% growth over the year-ago number. BABA’s consensus revenue estimate of $21.32 billion for the quarter ending June 2020 indicates a year-over-year increase of 47.5%. It’s no surprise that BABA is rated a “Strong Buy” in our POWR Ratings system. It also has an “A” for Trade Grade, Buy & Hold Grade, and Peer Grade, and a “B” for Industry Rank. In the 115-stock China industry, it is ranked #1. Alphabet Inc. (GOOGL) GOOGL has been a valuable addition to David Tepper’s portfolio since the first quarter of 2012 and accounts for 12.25% of his total holdings. Since GOOGL hit its 52-week low of $1008.87 on March 23rd due to the virus-led market crash, it has returned about 50%. There was a recent announcement with respect to a long-term partnership between GOOGL and home security business company-ADT Inc. (ADT). In the partnership, GOOGL will have to invest $450 million in the security company to get a 6.6% stake. The two companies plan to collaborate based on ADT’s services and GOOGL’s Nest hardware. In addition, the two companies have also committed $150 million as part of the partnership for marketing, product development, and employee training. Sundar Pichai, CEO of Google and Alphabet said, “We’re working to help people, businesses and communities in these uncertain times. As people increasingly turn to online services, our platforms — from Cloud to Google Play to YouTube — are helping our partners provide important services and support their businesses.” Despite recording lower total revenues in the second quarter, GOOGL’s revenues grew in its non-advertising lines — Google cloud and YouTube ads. The company has increased its total assets marginally and also reduced its total liabilities by 4.6% in the quarter, securing a healthy current ratio of 3.41. GOOGL’s consensus revenue estimate of $42.74 billion for the quarter ending September 2020 indicates a year-over-year increase of 5.5%. Also, the market expects the company to report earnings of $11.18 per share for the quarter ending September 2020, which represents a 10.5% improvement over the year-ago EPS. GOOGL’s POWR Ratings reflect this promising outlook. It has an overall rating of “Strong Buy” with an “A” for Trade Grade, Buy & Hold Grade, and Industry Rank, and a “B” for Peer Grade. Among the 54 stocks in the Internet industry, it’s ranked #2. Want More Great Investing Ideas? 9 “BUY THE DIP” Growth Stocks for 2020 How to Trade THIS Stock Bubble? 7 “Safe-Haven” Dividend Stocks for Turbulent Times AMZN shares fell $2.46 (-0.08%) in after-hours trading Friday. Year-to-date, AMZN has gained 71.41%, versus a 5.02% rise in the benchmark S&P 500 index during the same period."}]}