{"article": [{"url": "https://stocknews.com/news/zm-snap-pins-apps-ixic-4-tech-stocks-defying-the-nasdaqs-weakness/", "published": 1600862900.0, "headline": "4 Tech Stocks DEFYING the NASDAQ’s Weakness", "body": "The tech-heavy NASDAQ index is currently in the midst of correction. The index has fallen over 10% since hitting its year-to-date high of $12,074 on September 2nd. The NASDAQ’s recent weakness is viewed as a result of excessive bullishness around technology and growth stocks over the last few months. The key reasons behind the tech-led sell-off is profit taking and sector rotation. Despite the index’s recent sell-off, there are still some technology stocks that have been significantly outperforming. These technology stocks are being driven up by the strength of their fundamentals and positive business trends. There is still significant upside left in these stocks due to a continued rise in demand for their products and services. These stocks have been constantly innovating, and their leadership positions in their respective fields bodes well for their future performance. Zoom Video Communications (ZM), Snap, Inc. (SNAP), Pinterest, Inc. (PINS), and Digital Turbine, Inc. (APPS) are four such stocks that have delivered positive price returns since the NASDAQ sell-off began. These stocks are estimated to gain further on the back of higher revenue and EPS expectations. 9 \"BUY THE DIP\" Growth Stocks For 2020Zoom Video Communications (ZM) ZM is a cloud services company that focuses on providing a video communications platform for businesses and individual users. Its video communication platform has features such as text chat and content sharing. The communications platform has significantly benefited from the spread of the coronavirus due to an increased need for remote video communications services in both remote working and learning. ZM’s shares have delivered a return of 15.6% since its high on September 2nd, Compared with weakness in the NASDAQ. ZM’s shares are up 656.9% so far year to date. ZM is now looking to build customized platforms for various niches such as medicine and education. This development will provide a platform for those looking to work or learn remotely and to consult with doctors through video conferencing. ZM’s revenue is expected to grow 315.4% in the current quarter and 286% this year. The company’s EPS is estimated to rise 611.4% in the current year and at a rate of 38.5% per annum over the next five years. How does ZM stack up for the POWR Ratings? A for Trade Grade A for Buy & Hold Grade A for Peer Grade B for Industry Grade A for Overall POWR Rating The stock is ranked #3 out of 53 stocks in the Technology – Services industry. Snap, Inc. (SNAP) SNAP is a social media company that provides a camera-based app that allows users to communicate through photos and short videos. The company’s services also include AR-based filters that allow users to enhance their photographs. The company saw a stellar August during which it witnessed a 29% year-over-year increase in installations. The company’s fortunes have been bolstered by the continued uncertainty over rival TikTok’s future in the US. SNAP’s stock is up 8% since its September 2nd high. The stock has gained 56% year-to-date. The company has forayed into the content creation space through SNAP Originals which are short video shows meant for a young audience. The company has also released Dynamic Ads which allows advertisers to quickly create ads to be displayed on its platform. SNAP’s revenue is expected to grow 27.5% in the current year and 38% next year. The company’s EPS is estimated to rise 155.6% next year and at a rate of 67.4% per annum over the next five years. It’s no surprise that SNAP is rated a “Strong Buy” in our POWR Ratings system, with a grade of “A” in Trade Grade, Buy & Hold Grade, and Peer Grade. In the 57-stock Internet industry, it is ranked #6. Pinterest, Inc. (PINS) PINS operates a website that allows for pinboard-style sharing of photographs. The company’s website allows users to classify their image collections according to events, hobbies, and interests. According to the company’s second-quarter report, the company saw a 39% year-over-year increase in its daily active users, which is higher than SNAP. The stock has returned around 18% since its September 4th low. The increased adoption of Pinterest can be attributed to the spread of the coronavirus, which has led people to share more photographs online and increase their digital presence. The company is looking to use its social media status to foray into e-commerce, which could be a big performance driver in the future. PINS’ revenue is expected to grow 26.4% in the current year and 34.2% next year. The company’s EPS is estimated to grow 425% next year and at a rate of 139% per annum over the next five years. PINS’ strong fundamentals are reflected in its POWR Ratings, it has a “Strong Buy” rating with a grade of “A” in Trade Grade, Buy & Hold Grade, and Peer Grade. Digital Turbine, Inc. (APPS) APPS focuses on easing the process of advertising online. The company helps users to deliver, track, and analyze their online advertising efforts. The stock’s recent positive performance has been on the back of a stellar first quarter earnings report and a better than expected guidance for the second quarter. The stock has returned 26.3% since September 2nd. APPS stock is up 367.2% year to date. The company’s growth is expected to continue due to expansion into TV streaming platforms. The company’s management is also working on business deals for app-discovery with the three biggest US wireless networks. APPS’s revenue is expected to grow 76.1% this year and 18.9% next year. The company’s EPS is estimated to rise 130% in the current year and at a rate of 50% per annum over the next five years. It’s no surprise that APPS is rated a “Strong Buy” in our POWR Ratings system, with a grade of “A” in Trade Grade, Buy & Hold Grade, and Peer Grade. In the 94-stock Software – Application industry, it is ranked #7. Want More Great Investing Ideas? 7 “Safe-Haven” Dividend Stocks for Turbulent Times When Does the Next Bull Run Start? Chart of the Day- See the Stocks Ready to Breakout ZM shares were trading at $516.16 per share on Wednesday afternoon, up $23.56 (+4.78%). Year-to-date, ZM has gained 658.61%, versus a 2.97% rise in the benchmark S&P 500 index during the same period."}]}