{"article": [{"url": "https://stocknews.com/news/tsm-intc-soxx-amd-nvda-3-semiconductor-stocks-outperforming-their-industry-peers/", "published": 1595938100.0, "headline": "3 OUTPERFORMING Semiconductor Stocks", "body": "Last Thursday Intel (INTC) released their second-quarter earnings report. Though the company beat earnings estimates, their earnings guidance was lighter than expected. More importantly, INTC also announced a 6 month delay for the release of their 7nm-based CPU chips, which sports tiny 7-nanometer transistors with increased performance. This caused shares of INTC to plummet 16% last Friday and the iShares PHLX Semiconductor ETF (SOXX) to fall 4%. 7 \"SAFE HAVEN\" Dividend Stocks for Turbulent TimesHowever, not all semiconductor stocks are underperforming. Shares of Taiwan Semiconductor Manufacturing (TSM), Advanced Micro Devices (AMD), and NVIDIA (NVDA) are trading higher than they were before INTC reported earnings last week. Here are the reasons why these three semiconductor stocks are outperforming the rest of the sector: Taiwan Semiconductor Manufacturing Company Ltd. (TSM) Intel’s manufacturing setback of its 7 nanometer chips has given TSM the momentum to outpace its industry peers. Intel’s delay is a blessing for TSM, as it could gain a larger slice of the pie in terms of market share. Wendell Huang, VP and Chief Financial Officer of TSMC said, “Moving into third quarter 2020, we expect our business to be supported by strong demand for our industry-leading 5nm and 7nm technologies, driven by 5G smartphones, HPC and IoT-related applications.” So, the near future seems encouraging for potential investors. Since its March lows, TSM has gained more than 75%. The consensus EPS estimate of $0.77 for the current quarter indicates a year-over-year increase of 24.2%. The revenue estimate of $11.6 billion also indicates an increase of 23.5% over the year-ago quarter. TSM has an impressive earnings surprise history with the company beating consensus EPS estimates in three of the past four quarters. In the second quarter, revenue increased 28.9% and net income increased 81% year over year. How does TSM stack up for the POWR Ratings? A for Trade Grade A for Buy & Hold Grade A for Peer Grade A for Industry Rank A for Overall POWR Rating You can’t ask for better. The stock is also ranked #1 out of 86 stocks in the Semiconductor & Wireless Chip industry. Advanced Micro Devices, Inc. (AMD) AMD recently announced the 7nm x86 desktop processors with built in graphics for consumer and commercial PC markets. The AMD 4000 Series and AMD Athlon 3000 Series Desktop Processors with Radeon graphics demonstrate advanced processor core technology. Intel’s announcement of delay of its 7 nanometer chips CPU product timing could be a boon for AMD as well in terms of increasing market share. AMD has been showing a bullish trend and is up by more than 75% from its March lows. The consensus EPS estimate of $0.16 for the quarter ended June 2020 indicates a year-over-year increase of 100%. The revenue estimate of $1.86 billion also indicates an increase of 21.5% over the year-ago quarter. In the first quarter, revenue was up 40% year over year and EPS was up by $0.12. It’s no surprise that AMD is rated “Strong Buy” in our POWR Ratings system. It also has an “A” for Trade Grade, Buy & Hold Grade, Peer Grade, and for Industry Rank. In the 86-stock Semiconductor & Wireless Chip industry, it is ranked #7. NVIDIA Corporation (NVDA) NVDA plans to collaborate with the University of Florida to build the world’s fastest AI supercomputer in academia. Furthermore, the Royal Bank of Canada chose NVIDIA DGX Systems for its private AI cloud. The company’s data center business performed well in the first quarter and secured a record $1 billion in the quarter. NVDA’s focus on AI and cloud computing separates the company from the pack and makes it an interesting avenue for investors. The consensus EPS estimate of $1.97 for the current quarter indicates a year-over-year increase of 58.9%. Also, it is impressive to note that the company beat consensus EPS estimates in each of the trailing four quarters. NVDA has gained more than 70% since its March lows. Price to trailing twelve-month operating cash flow for NVDA is currently 50.66, higher than 93.39% of US stocks with positive operating cash flow. In the first quarter fiscal 2021 ended 26th April 2020, revenue was up 39% and GAAP EPS was up 130% year over year. NVDA’s POWR Ratings reflect a promising outlook. It has an overall rating of “Strong Buy” with an “A” for Trade Grade, Peer Grade, Buy & Hold Grade and Industry Rank. Among the 86 stocks in the Semiconductor & Wireless Chip industry, it is ranked #2. Want More Great Investing Ideas? 9 “BUY THE DIP” Growth Stocks for 2020 Newly REVISED 2020 Stock Market Outlook 7 “Safe-Haven” Dividend Stocks for Turbulent Times TSM shares were trading at $77.13 per share on Tuesday afternoon, down $6.12 (-7.35%). Year-to-date, TSM has gained 34.53%, versus a 1.33% rise in the benchmark S&P 500 index during the same period."}]}