{"article": [{"url": "https://stocknews.com/news/iipr-did-iipr-report-another-stellar-quarter/", "published": 1596802100.0, "headline": "Did IIPR Report Another Stellar Quarter?", "body": "Innovative Industrial Properties (IIPR) reported Q2 earnings on Wednesday. Despite a challenging environment for cannabis, IIPR clearly has been weathering the storm. The company reported revenue of $24.3 million, which was a 183% increase. Its net income for the quarter was $13 million, a 322% increase from the prior year. The company also paid a dividend of $1.06 per share on July 15. This was a 77% increase over last year’s second quarter dividend. Shares of IIPR are currently trading up almost 10% since Wednesday. IIPR has performed well, while other companies in the industry have struggled, due to the coronavirus pandemic. In fact, over the long term, the crisis may actually benefit IIPR as the company will be able to acquire more properties at potentially discounted valuations. 7 \"SAFE HAVEN\" Dividend Stocks for Turbulent TimesIIPR is able to provide struggling cannabis companies with capital through their acquisition and sale-leaseback agreement. Many companies have a hard time obtaining types of financing. IIPR offers firms a sale-leaseback agreement, which allows IIPR to grow its portfolio of properties. The way a sale-leaseback agreement works is that a company such as IIPR, will first acquire a cannabis cultivation facility or processing site for cash. It will then lease the property back to the seller for a defined time frame, usually between 10 and 20 years. The company has acquired properties at breakneck speed. It went from owning just a handful of properties a few years ago to 61 properties as of Jul 20. The properties currently boast 4.5 million square feet of rentable space that remains 99.2% leased. Although IIPR has issued more stock to raise capital to fund its recent spree of acquisitions, the company seems to be able to consistently grow its profits. As legalization spreads across the United States, IIPR stands to benefit from new markets opening up and further acquisition targets on the horizon. This will allow the company to grow its real estate portfolio along with increasing revenues over the long term. Want More Great Investing Ideas? 9 “BUY THE DIP” Growth Stocks for 2020 How to Trade THIS Stock Bubble? 7 “Safe-Haven” Dividend Stocks for Turbulent Times IIPR shares were trading at $116.04 per share on Friday afternoon, up $4.87 (+4.38%). Year-to-date, IIPR has gained 56.72%, versus a 4.91% rise in the benchmark S&P 500 index during the same period."}]}