{"article": [{"url": "https://stocknews.com/news/cvna-w-etsy-phm-4-top-consumer-cyclical-stocks-on-the-rise/", "published": 1597666100.0, "headline": "4 Top Consumer Cyclical Stocks on the Rise", "body": "Consumer cyclical stocks are primarily dependent on the business cycle and the current economic climate. These stocks range from those in the housing sector to automotive, retail, entertainment, and beyond. The economy is currently in a deep trough, yet some cyclical consumer stocks are ascending. Though the Fed’s spending has propped up the stock market, no one denies that consumer behavior is changing for the time being. Once the Fed’s stimulus fades, certain consumer cyclical stocks will lose value while others stagnate or continue to appreciate it. The following four consumer cyclical stocks are likely to hold steady even if the current economic recession continues longer than expected or leads to a brief depression: Carvana Co. (CVNA), Wayfair Inc. (W), Etsy Inc. (ETSY), and PulteGroup (PHM). 7 \"SAFE HAVEN\" Dividend Stocks for Turbulent TimesCarvana Co. (CVNA) People are turning to e-commerce platforms for just about everything these days. Everyday people are even willing to buy and sell pre-owned automobiles on CVNA’s web-based platform. CVNA services include everything necessary to buy/sell a used vehicle, including financing, inspection, logistics, repair, and sales. CVNA’s POWR Ratings are fantastic: A grades in the Trade Grade and Industry rank categories and B grades in the Peer Grade and Buy & Hold Grade categories. CVNA has an industry rank of seven out of more than 50 Internet stocks. Out of 16 analysts who have reviewed the stock, ten insist it is a Buy while six advise holding, and none recommend selling. CVNA’s second-quarter earnings show a 25% increase in retail unit sales that spiked revenue by 13%, breaking through the billion-dollar benchmark. The bottom line is CVNA will still be able to sell vehicles even if the pandemic drags on for years. Though people are not driving as much as they were before COVID-19, CVNA should hold steady or slowly climb upward as we gradually transition out of the current economic recession. Wayfair Inc. (W) Instead of heading out to brick-and-mortar shopping outlets and risk exposure to the virus, consumers are firing up their laptops, tablets, and smartphones to shop from the comfort of home. W, one of the top sellers of home products, décor, and furniture, has benefitted from the shift to online shopping. Aside from Wayfair.com, W also owns Birch Lane, AllModern, Joss & Main, and Perigold. In total, W sells nearly 20 million products from 12,000+ suppliers. The POWR Ratings reveal W has A grades in all POWR Components, but its Industry Rank grade of B. W is ranked first of more than 30 stocks in the Specialty Retailers industry. W’s most recent quarterly earnings reveal the company’s customers placed more than 12 million orders. This figure represents a hike of more than 100% in sales growth on a year-over-year basis. Furthermore, W’s revenue grew by 84%. All in all, W’s active customer base increased by nearly 50% on a year-over-year basis. Nearly 30 million people actively use the online shopping platform. This figure represented a 40% spike from the same quarter one year ago. It is clear W is winning. Etsy Inc. (ETSY) Years ago, it seemed as though ETSY would remain a niche online shopping website for the DIY crowd. However, the pandemic has put ETSY squarely in the spotlight. Featuring a seemingly never-ending supply of arts, crafts, protective face coverings, and other sundries, ETSY has something for everyone. Now that ETSY has obtained mainstream exposure during the pandemic, it should hover around or move beyond its 52-week high of $141. ETSY’s POWR Ratings are nearly perfect: A grades in all POWR Components but for its Buy & Hold Grade of B. ETSY is ranked 11th of 54 stocks in the Internet category. Out of the 16 analysts who have analyzed ETSY, fifteen recommend buying, none advise holding, and one recommends selling. It is particularly interesting to note ETSY is implementing augmented reality (AR) to make commerce human-oriented. ETSY’s AR technology empowers buyers to see the company’s photographs, prints, and paintings superimposed over their home’s aesthetic, previewing how it will look inside the house before purchase. Look for ETSY’s upward momentum to continue as it amasses a loyal following through the pandemic and beyond. PulteGroup (PHM) The housing market is as hot as ever, even though the country is in the midst of a potentially crippling recession. PHM provides homebuilding and financial services in the United States. Nearly 98% of PHM revenue stems from its homebuilding segment. This segment includes single-family detached homes, condominiums, duplexes, and townhouses. PHM’s forward P/E ratio is 10, meaning it is likely trading below fair value. PHM orders soared this summer, indicating the stock has the upward momentum necessary to break through its 52-week high of $47 and change before autumn approaches. Want More Great Investing Ideas? The Best of StockNews 3 Possible Directions for the Stock Market from Here 9 “BUY THE DIP” Growth Stocks for 2020 CVNA shares . Year-to-date, CVNA has gained 111.84%, versus a 6.07% rise in the benchmark S&P 500 index during the same period."}]}