{"article": [{"url": "https://stocknews.com/news/sam-an-eqt-ag-4-stocks-that-gained-more-than-10-last-week/", "published": 1595851700.0, "headline": "4 Stocks that Gained More Than 10% Last Week", "body": "As earnings reports continued to flow in, stocks were down modestly. The SPDR 500 ETF (SPY) was down 0.28% for the week. The S&P 500 was positive for the year mid-week before pulling back due to tensions with China. U.S. initial jobless claims increased for the first time since March, which raised worries that the rally may soon be coming to an end. Technology stocks were dragged down by Apple (AAPL), Intel (INTC), and other chipmakers. One good news piece last week was that Oxford University and AstraZeneca (AZN) announced that their joint vaccine candidate produced healthy levels of antibodies and T-Cells. In other positive news, some stocks soared during a week of mostly negative news. Four stocks, in particular, were up over 10%. Boston Beer Company (SAM), AutoNation (AN), EQT (EQT), and First Majestic Silver (AG) are four stocks that gained more than 10% last week. 9 \"BUY THE DIP\" Growth Stocks For 2020Boston Beer Company, Inc. (SAM) Boston Beer Company produces and sells alcohol across the globe. The stock gained more than 30% over the last week, closing on Friday at $828.34. The stock’s stellar performance can be attributed to the growth in sales of its Truly Hard Seltzer brand and Twisted Tea collection. It is estimated that the Truly Hard brand may have been the only hard seltzer brand to have gained market share so far this year. For the second quarter of 2020, SAM reported a rise in net revenue of 42% compared to the same period last year. The earnings per share of the company also rose more than 50% year over year to $4.88. The EPS beat the consensus estimate by 100.8%. How does SAM stack up for the POWR Ratings? A for Trade Grade A for Buy & Hold Grade A for Peer Grade A for overall POWR Rating You can’t ask for better. The stock is also ranked #5 out of 29 stocks in the Beverages industry. AutoNation, Inc. (AN) AutoNation focuses on providing new and used vehicle parts and spare parts through its retail stores in the United States. AN had a stellar performance last week. The stock moved close to 23% higher to close the week at $54.70. The company announced plans to increase the number of AutoNation USA stores by 20 over the next three years. This move could help the company capture a larger share of the used-car market. The company has also implemented fully-functional digital capabilities that allow customers to transact with them completely online. For the second quarter, the company’s EPS from continuing operations clocked in at $3.18, which was a significant rise from $1.12 a year ago. The same-store total variable vehicle gross profit per vehicle also saw a rise of 16% compared to the same period last year. AN’s earnings surprise history is impressive, with the stock beating consensus EPS estimates in each of the trailing four quarters. It’s no surprise that AN is rated “Strong Buy” in our POWR Ratings system. It also has an “A” for Trade Grade, Buy & Hold Grade, and Peer Grade and a “B” for Industry Rank . In the 16-stock Auto Dealers & Rentals industry, it is ranked #3. EQT Corporation (EQT) EQT is an energy company that focuses on the exploration, production, and sale of natural gas and crude oil. EQT added more than 11% to its stock price in the last week and closed Friday’s trading day at $14.17. Reportedly, the company is actively working on reducing drilling costs, which could lead to positive free cash flow. The demand for natural gas is also set to rise in the near future, and EQT being the nation’s largest natural gas producer, is well-poised to gain from it. The company is set to announce its second quarter earnings report today. The earnings surprise history for EQT looks pretty good, as the company beat the consensus EPS estimates in three of the trailing four quarters. Out of 96 stocks in the Energy – Oil & Gas sector, EQT is rated #12. First Majestic Silver Corp. (AG) AG is a mining company that focuses on the exploration, development, and production of silver. AG witnessed a stellar rise in the stock price of more than 28% in the last week. The stock closed the week at $13.28. This month, the company announced the completed acquisition of Springpole Silver Stream, which could lead to the company capturing a greater market share. This new agreement has the potential of providing significant upside to the company along with reducing cost and risks. Production of silver was also higher than expected for the company in the second quarter of 2020, despite operational problems due to the spread of the coronavirus. The company also expects to recover lost production during the rest of the year since it has resumed regular production rates. AG’s growth potential is reflected in the POWR Ratings It has a “Strong Buy” rating with an “A” in Trade Grade, Buy & Hold Grade, and Industry Rank. Within the Miners – Silver industry, it’s ranked #4 out of 11 stocks. Want More Great Investing Ideas? 9 “BUY THE DIP” Growth Stocks for 2020 Newly REVISED 2020 Stock Market Outlook 7 “Safe-Haven” Dividend Stocks for Turbulent Times SAM shares were unchanged in after-hours trading Monday. Year-to-date, SAM has gained 115.48%, versus a 1.46% rise in the benchmark S&P 500 index during the same period."}]}