{"article": [{"url": "https://stocknews.com/news/snow-u-frog-3-recent-ipos-to-consider-after-the-pop-and-drop/", "published": 1601467700.0, "headline": "3 Recent IPOs to Consider After the 'Pop and Drop'", "body": "It seems as though just about every IPO receives an abundance of hype, much of which is unwarranted. In particular, tech IPOs are often overhyped. The hype is causing IPOs to repeat the common pattern of popping out of the gate and subsequently dropping. The ‘pop and drop’ phenomenon is not necessarily bad news for investors. Once new IPOs drop, buying opportunities are presented. Here is a quick look at three recent IPOs that initially opened higher than they were priced, subsequently declined, and could now be interesting to consider adding to your portfolio: Snowflake (SNOW), Unity Software (U) and JFrog (FROG). 7 \"SAFE HAVEN\" Dividend Stocks for Turbulent TimesSnowflake (SNOW) Data warehouse stocks have been the apple of investors’ eyes in 2020. SNOW provides such warehousing along with database architecture, parallelization solutions, query optimization and more. SNOW will likely have no trouble bringing in new customers as its platform makes it easy to consolidate data, obtain valuable insights and ultimately make the most of digital information. Clients of all different sizes in a wide array of industries rely on SNOW’s platform. SNOW’s POWR Ratings are highlighted by a “B” Industry Rank grade. SNOW opened around $253, dropped down to $217 and took off, soaring all the way up to $269. If you are still on the fence as to whether SNOW is a solid investment, consider the fact that Warren Buffet holds 15% of the company’s shares. Buffet’s endorsement of SNOW is all you need to buy this stock in full confidence. Look for SNOW to break through $300, possibly by year’s end. Unity Software (U) U opened under $70, moved up to $85, dropped down toward $80 and has moved to $95. There is a good chance U will fall back down to the $85 level or even lower as investors take profits. U’s gaming engine and software solutions are used in game consoles, PCs, tablets and mobile phones. U is worthy of consideration as its gaming engine is used in a wide array of games including the popular Cuphead title. According to TipRanks, the lone analyst who has reviewed U has set a price target for $100 for the stock, indicating it has more than 8% upside. Franco Granda, an analyst with D.A. Davidson put a “Buy” rating on U last week, helping the stock increase by nearly 10%. The clash between Apple and Epic Games sets the stage for more gaming developers to use Unity’s gaming engine as opposed to Epic’s Unreal engine. Scoop up U, hold it for years and you will likely be more than happy with the return. JFrog (FROG) Software development is one of the hottest fields for growth and investor interest. FROG provides open-source software products, products on Google Cloud, Microsoft Azure and even SaaS on AWS. FROG conducts business throughout the United States, Asia and Europe. FROG opened around $65, increased to $77, declined to the $70 level and subsequently spiked to $85. The question begs: where does FROG go from here? Though FROG is growing slower than Snowflake, it is on the cusp of profitability. Furthermore, FROG’s stock is trading at a comparably low valuation. FROG is valued around $7 billion. The company’s stock is priced around 70 times its sales from 2019. In other words, FROG is pricey, yet that is the case with most hot IPOs when they blast out of the gates. Want More Great Investing Ideas? 7 “Safe-Haven” Dividend Stocks for Turbulent Times When Does the Next Bull Run Start? Chart of the Day- See the Stocks Ready to Breakout SNOW shares were trading at $261.40 per share on Wednesday morning, up $2.27 (+0.88%). Year-to-date, SNOW has gained 2.94%, versus a 6.12% rise in the benchmark S&P 500 index during the same period."}]}