{"article": [{"url": "https://stocknews.com/news/msft-twtr-orcl-is-microsoft-twitter-or-oracle-going-to-buy-tiktok/", "published": 1597838900.0, "headline": "Is Microsoft, Twitter or Oracle Going to Buy TikTok?", "body": "Lost somewhat in the aftermath of the pandemic is that China and the U.S. are still in the midst of a trade war. It’s unlikely that there will be any sort of resolution until after the election, and even then, China/U.S. relations have a long way to go when it comes to trade issues. However, there is the occasional reminder that friction remains between the two economic powerhouses. In this case, the topic of dispute concerns a widely popular app called TikTok. The app – a video streaming product popular with the younger crowd – is owned by Chinese company ByteDance. Because of how ubiquitous TikTok has become, there is a vast amount of data collected by the app; this data could at any point be used by the Chinese government. The U.S. considers this a threat to national security. Due to the security concerns, the U.S. has given ByteDance a 90-day window to sell the app to a U.S. company, or TikTok will be banned. Of course, several companies have lined up to make this purchase, as it would be a goldmine for advertisers (see Instagram, for example). 9 \"BUY THE DIP\" Growth Stocks For 2020Microsoft (MSFT) At the moment, we know of three companies that could realistically purchase TikTok. The first one announced was Microsoft (MSFT). The $1.6 trillion company could certainly outbid anyone for the app, and has plenty of experience with social platforms (through its Xbox platform). Twitter (TWTR) Another company that has shown serious interest is Twitter (TWTR). Twitter is a best-of-breed social media company, which makes it a perfect fit for TikTok. However, it is also just a fraction of MSFT’s size, and may not be able to afford the price tag. Oracle (ORCL) Finally, just this week database and enterprise software giant Oracle (ORCL) has entered the bidding race. Oracle doesn’t seem like a good fit for a social media platform, but it has plenty of cash to make the purchase. One thing ORCL does have going for it is experience with data security, which may boost the company’s credentials. Both TWTR and MSFT have seen positive stock price action from the TikTok news. So, it wasn’t a surprise to see ORCL shares get a bump when their interest in TikTok became public. Options trading volume on ORCL also spiked. So what is the options market saying? First off, 175,000 options traded on ORCL the day the TikTok news was announced. That’s over five times the regular volume. More importantly, 89% of the activity was in call options. Generally speaking, call options activity is considered bullish, which suggests the crowd was a big fan of the news. Interestingly, the biggest trade of the day was actually a put options trade. However, the trade appeared to be selling puts, typically representing at least a somewhat bullish view on the stock. The trade was a 1,500 lot of March 2021 50 puts. They were sold for $2.67, with the stock trading around $55. The trader collected $400,000 on the trade, which they will keep in full if ORCL is above $50 next March. At the very least, this trader feels there’s a floor on how far ORCL can fall, possibly due to their willingness to go outside the box to increase their business. While TikTok may not end up at ORCL—MSFT still seems like the most obvious candidate—the company’s interest in TikTok does show that ORCL is trying to diversify growth. Regardless, we’ll know soon enough where TikTok will end up, and it’s sure to be a boon for whichever company that buys it. Want more great investing ideas? Download free the “10-Step Options Trading Checklist” you need before making a trade. The Virtual Trading Pit Is Open: Trade Set-ups, Training, New Trading Ideas How to Try Out Options Without Risking a Penny MSFT shares . Year-to-date, MSFT has gained 34.03%, versus a 5.86% rise in the benchmark S&P 500 index during the same period."}]}