{"article": [{"url": "https://stocknews.com/news/plug-ftv-ph-pnr-will-plug-power-continue-to-make-new-highs/", "published": 1602158900.0, "headline": "Will Plug Power Continue to Make New Highs?", "body": "Plug Power, Inc. (PLUG) develops hydrogen fuel cell turnkey solutions for industrial use across North America and Europe. Its main product lines are GenKey, GenDrive, GenFuel, GenCare and ReliOn. As a key producer of hydrogen as a source of alternative energy, PLUG amassed popularity in recent times. This popularity came on the back of more and more people becoming concerned about climate change and increasing natural catastrophe across the world. From Australian and Californian bushfires to rising numbers of floods and hurricanes, many countries have actively announced shifting to clean energy over the next couple of years. According to Global Market Insights, global hydrogen generation value is expected to grow at a CAGR of 6.3% through 2026. 7 \"SAFE HAVEN\" Dividend Stocks for Turbulent TimesWith the rising popularity of this industry, PLUG is well positioned to soar in the upcoming months, despite already gaining 476.7% year-to-date. This, coupled with several other factors, has helped the stock earn a “Strong Buy” rating in our proprietary rating system. Here’s how our proprietary POWR Ratings system evaluates PLUG: Trade Grade: A PLUG is currently trading above both its 50-day and 200-day moving averages of $12.29 and $6.75 respectively, indicating a golden cross uptrend. Moreover, the stock has gained 95.2% over the past three months, reflecting a solid short-term bullishness. On September 24th, PLUG announced its collaboration with Apex Clean Energy to develop a green hydrogen network across the United States using wind power. This partnership is in tune with PLUG’s goal to decarbonize and use 50% green hydrogen across major industries in the country by 2024. It also partnered with Brookfield Renewable Partners to acquire 100% of Brookfield’s renewable energy supplies. PLUG has standing agreements with Universal Hydrogen and EnergyOR to develop hydrogen powered commercial aircrafts, automated guided vehicles, and unmanned aerial vehicles. PLUG’s second quarter revenues increased 18.3% year-over-year to $68.07 million. Adjusted EBITDA increased 112.6% from the same period last year to $1.22 million. Buy & Hold Grade: A In terms of proximity to 52-week high, which is a key factor that our Buy & Hold Grade takes into account, PLUG is well-positioned. It is currently trading just 0.2% below its 52-week high of $18.26, which it hit on October 7th. PLUG has gained 513.6% over the past three years owing to solid revenue and asset growth. Its revenue grew at a CAGR of 45.4% over the past three years, while total assets increased at a CAGR of 65.2% over this period. In the last few years, people have become increasingly aware of climate change, and are shifting to various renewable energy sources to promote sustainable development. With hydrogen being one of the most efficient green energy sources, many countries across the world have passed legislative bills to adopt the same in some form or other in their production sectors. This trend heavily influenced PLUG’s growth over the past couple of years. Peer Grade: A PLUG is currently ranked #7 out of 58 stocks in the Industrial- Equipment sector. Other popular stocks in this industry are Parker-Hannifin Corporation (PH), Fortive Corporation (FTV) and Pentair plc. (PNR). While PH has gained 7.2% year-to-date, both FTV and PNR returned 6.4% during this period. However, PLUG outperformed these stocks by gaining 476.7% year-to-date. Industry Rank: B The Industrial-Equipment industry is ranked #34 out of 123 industries in the StockNews.com universe. This sector was adversely affected by the coronavirus pandemic, as the country-wide lockdown and resultant economic slump shifted focus from infrastructure development in the initial months. As industrial production came to a virtual stand-still, companies operating in this sector reported massive losses. But the gradual recovery of the economy bodes well for this industry, with growing consumer demand in all spheres. Also, the need for better medical and pharmaceutical infrastructure to overcome the pandemic contributes to the revival of respective companies. Overall POWR Rating: A (Strong Buy) PLUG is rated “Strong Buy” due to its short-and-long-term bullishness, impressive financials and underlying industry strength, as determined by the four components of our overall POWR Rating. Bottom Line PLUG has the potential to soar higher in the upcoming months despite triple digit gains so far this year, based on its solid growth momentum and favorable analyst sentiment. PLUG has an average broker rating of 1.11, indicating favorable analyst sentiment. Out of 9 Wall Street analysts that rated the stock, 8 rated it “Strong Buy.” The consensus revenue estimate of $110.80 million for the third quarter that ended September 2020, indicates an 81.6% improvement year-over-year. The company’s EPS is expected to grow at a rate of 25% per annum over the next five years. Want More Great Investing Ideas? 7 Best ETFs for the NEXT Bull Market What is the Cure for Stock Market Volatility? Chart of the Day- See Christian Tharp’s Stocks Ready to Breakout PLUG shares were trading at $17.66 per share on Thursday afternoon, down $0.56 (-3.07%). Year-to-date, PLUG has gained 458.86%, versus a 8.22% rise in the benchmark S&P 500 index during the same period."}]}