{"article": [{"url": "https://stocknews.com/news/amzn-wmt-tgt-cost-3-companies-challenging-amazons-dominance/", "published": 1601554100.0, "headline": "3 Companies CHALLENGING Amazon's Dominance", "body": "Since the onset of the coronavirus, ecommerce has exploded as the pandemic has caused massive changes in consumer habits. In terms of total consumer spending, ecommercce has gone from 14% to over 30%. Amazon (AMZN) is the major beneficiary as it accounts for 47% of online sales in the United States. The Commerce Department says e-commerce sales in the last quarter were 44% above the comparable quarter last year, accounting for over 20% of total U.S. retail sales. Consequently, AMZN has soared as high as 91% this year to hit its all-time high of $3552.25 earlier this month. The stock presently has a year-to-date gain of 70.4%. 7 \"SAFE HAVEN\" Dividend Stocks for Turbulent TimesAMZN reported an EPS of $10.3 for its recently reported results for the second quarter ended in June 2020. The EPS almost doubled year-over-year and net sales increased 40% year-over-year to $89 billion. AMZN increased grocery delivery capacity by over 160% and tripled grocery pickup locations to support customers during the pandemic. Online grocery sales tripled in the second quarter when compared to the same period last year. AMZN has recently introduced the newest additions to the Eero family. These all-new mesh wi-fi systems feature Wi-Fi 6, the latest technology delivering faster speeds and higher performance. AMZN has also received approval from the Federal Aviation Administration (FAA) which allows it to start testing its drones fleet for commercial delivery. Thanks to the pandemic, AMZN’s cloud services that it provides under the name of Amazon Web Services (AWS) is also booming. The company has also entered into the grocery market which could be a significant growth driver. AMZN has also been expanding into healthcare by acquiring PillPack, by investing in a COVID-19 testing lab, and the introduction of Amazon Halo and Amazon Halo Band that helps customers improve their health and wellness by combining a suite of AI-powered health features providing actionable insights into overall wellness. This signifies AMZN’s dominance in many segments, particularly in e-commerce. However, the stock is being perceived as highly overvalued and such a high share price is restricting retail participation. AMZN is not the only choice for investors seeking to benefit from the surge in online sales in recent months. It could be a good idea to explore some affordable stocks like Walmart Inc. (WMT), Costco Wholesale Corporation (COST), and Target Corporation (TGT) in this space. Each of these stocks is fundamentally sound and is challenging the market dominance of AMZN with their enhanced offerings. Walmart Inc. (WMT) WMT is a discount store and supermarket major that operates more than 11,500 retail and wholesale units in 27 countries worldwide, selling grocery and a variety of general merchandise items to over 256 million customers per week. It also serves its customers through its eCommerce website. The company operates in three segments – Walmart U.S., Walmart International, and Sam’s Club. WMT has recently rolled out its new Walmart+ membership program, through which members will receive free delivery services, fuel discounts, and a host of other benefits, to compete with Amazon Prime services. In recent weeks, WMT has partnered with Quest Diagnostics and DroneUp, a nationwide drone services provider, to deliver select grocery and household essentials, and to test delivery of certain health and wellness products. WMT is in talks with India’s Tata Group for a potential investment of up to $25 billion in a new “super app” for its Indian e-commerce player, Flipkart, which it acquired two years ago. The deal is to boost sales of products currently sold through the Tata group’s retail subsidiaries and online platforms to be able to compete against Reliance Industries’ Jio Platforms and AMZN. In June, WMT partnered with Shopify (SHOP) to expand its third-party merchant network. Roughly 1,200 of SHOP’s merchants will be able to sell their wares on WMT beginning this year, and the platform intends to give more of its over 1 million customers the ability to sell on Walmart.com over time. WMT may also partner with Oracle (ORCL) and TikTok in the cloud soon. The last financial report announced by WMT was for its fiscal second quarter ended July. The top-line grew 5.6% year-over-year to $137.7 billion, led by strength in general merchandise and food. The e-commerce sales grew 97% amid the pandemic. EPS for the quarter came in at $2.27, increasing 80% year-over-year. The company is planning to hire 20,000 temporary associates to meet demand in the upcoming holiday season. It is holding a “Big Save” online event that runs October 11th to 15th, challenging AMZN’s Prime Day sale scheduled this month. Hence, the market expects current year EPS to grow 8.1% compared to the year-ago value. WMT closed yesterday’s trading session at $139.91, gaining 19.3% year-to-date. The stock is up nearly 17% in the past three months, outperforming AMZN’s 14% return in the same period. How does WMT stack up for the POWR Ratings? A for Trade Grade B for Buy & Hold Grade B for Peer Grade A for Industry Rank B for Overall POWR Rating The stock is also ranked #5 out of 18 stocks in the Grocery/Big Box Retailers industry. Costco Wholesale Corporation (COST) COST operates membership warehouses in the United States and internationally. It offers branded and private-label products in a range of merchandise categories. COST currently operates 795 warehouses, including 552 in the United States and Puerto Rico, 101 in Canada, and it opened 13 warehouses in fiscal 2020. E-commerce sales of COST for August grew 101.6% compared to the same month last year. The company continued its steady growth in membership as it opened eight new wholesale centers during the last quarter. Membership households grew by 2.3 million to 58.1 million, for access to bulk products often sold at lower prices than at competitors. Hence, membership revenue grew 5.33% year-over-year. Moreover, COST completed the acquisition of Innovel Solutions, a leading provider of third-party end-to-end logistics solutions with nationwide capabilities, in March this year. The deal gave COST access to 11 distribution centers and over 100 final-mile cross-dock centers. The company also issued $4 billion worth of senior unsecured notes in April to improve its liquidity. Net sales, excluding membership revenue, for the quarter increased 12.5%, to $52.28 billion from $46.45 billion last year. E-commerce sales nearly doubled in the latest quarter, rising 93% from the year-ago quarter. This implied a big jump for a company that has been slow to embrace online sales and has built its business around bulk packages. Moreover, same-day fresh food delivery more than tripled during the same period. EPS for the quarter came in at $3.13, rising 26.7% year-over-year and beating the consensus estimate by 7%. The company is well-positioned amid the economic upheaval of COVID-19 because of a key cost-saving strategy. Hence, the street expects current quarter EPS to grow 12.7% compared to the year-ago quarter. COST closed yesterday’s trading session at $355.0, gaining 21.8% year-to-date. The stock is up more than 17% in the past three months, compared to AMZN’s 14% return in the same period. COST’s POWR Ratings reflect a promising outlook. It has an overall rating of “Strong Buy” with an “A” for Trade Grade, Buy & Hold Grade, Peer Grade, and Industry Rank. Among the 18 stocks in the Grocery/Big Box Retailers industry, it’s ranked #1. Target Corporation (TGT) TGT operates as a general merchandise retailer in the United States and Canada, offering a selection of merchandise, including consumables, seasonal, home products, and apparel. It sells its products through nearly 1,900 stores as well as through its digital channel. TGT has been investing in fulfillment centers such as Drive Up and Shipt which has bolstered the company’s ability to make same-day deliveries. The company is involved in opening small-scale stores in underserved areas to tap into an unsaturated market in both physical stores and e-commerce. TGT has benefitted from a steadily rising cash flow stream. The company is a dividend aristocrat, as it has increased its payout every year since 1974. In contrast, AMZN does not pay dividends at all. Moreover, TGT’s Target Deal Days are scheduled on October 13th and 14th, on the same days when AMZN is holding its Prime Day Sale. The company saw unusually strong market-share gains across all five of its core merchandise categories in the last two quarters. The top-line grew 24.8% year-over-year to $22.7 billion, the strongest the company has ever reported. Digital comparable sales grew by 195% compared to the year-ago quarter. Same-day services grew 273% and accounted for approximately 6% of TGT’s total comparable sales growth. EPS for the quarter came in at $3.35, rising 84.4% year-over-year and beating the consensus estimate by 108.6%. The company is experiencing solid demand and hence, it is working on efficiently managing its supply chain. The street expects TGT’s current-year EPS to grow 12.4% compared to the year-ago quarter. TGT closed yesterday’s trading session at $157.42, after hitting its all-time high of $159.15. The stock has gained 31% in the past three months, significantly outperforming AMZN’s 14% return in the same period. TGT’s strong momentum is reflected in its POWR Ratings. It has a “Strong Buy” with an “A” for Trade Grade, Buy & Hold Grade, Peer Grade, and Industry Rank. Within the Grocery/Big Box Retailers industry, it’s ranked #2 out of 18 stocks. Want More Great Investing Ideas? Do NOT Buy Stocks Before the Election! 7 “Safe-Haven” Dividend Stocks for Turbulent Times Chart of the Day- See Christian Tharp’s Stocks Ready to Breakout AMZN shares were trading at $3,221.26 per share on Thursday afternoon, up $72.53 (+2.30%). Year-to-date, AMZN has gained 74.33%, versus a 6.22% rise in the benchmark S&P 500 index during the same period."}]}