{"article": [{"url": "https://stocknews.com/news/spy-qqq-amzn-will-tech-stocks-continue-to-rise/", "published": 1594123700.0, "headline": "Will Tech Stocks Continue to Rise?", "body": "Assuming today’s gains hold, the “Nasdaq 100 (QQQ)” will have posted gains on six consecutive days — up 15 out of the last 16 and now up 51% from the March lows and registering a 23% for the year-to-date. Zowie! We’ve spilled much ink discussing how the ‘big 5,’ or predominantly, “AAPL (AAPL),” “Amazon (AMZN),” and “Microsoft (MSFT),” which through the combined $4.8 trillion dollar market cap, have come to represent 42% of the QQQ and has accounted for the majority of indices’ performance. 7 \"SAFE HAVEN\" Dividend Stocks for Turbulent TimesBut before we get to whether these recent gains are warranted or sustainable it should be noted there has also been a feeding frenzy in a new crop of tech, especially those in which existing trends of everything online have been accelerated by the COVID. Companies such as “Zoom (ZM)” and “Shopify (SHOP)” and “Square (SQ) which are not even in the S&P 500 Index (SPY), let alone the QQQ, have all gone parabolic with shares doubling over the past few months. And then there is the biggest freak of all, “Tesla (TSLA)” and I mean that in a complementary way one describes an incredible athlete like the NBA player known as ‘the Greek Freak’. Like Antetokounmpo, these companies and their stocks are doing things never seen before and have simply blown QQQ and SPY out of the water. Well, maybe not seen since the dot.com daze and which the bears keep trying to cloud the picture. I know one of the most dangerous phrases in investing is “it’s different this time,” but it really might be. We can start with the fact that having a relatively small cohort representing a large percentage of the indices is actually more normal than an anomaly. It happened during the late 1960’s-1970s with the nifty fifty in which the top 10 names such as Exxon (XOM), Coca-Cola (KO), and even Polaroid (RIP) accounted for nearly 25% of the SPY. It happened again in the late 1990s as the four horsemen such as “Cisco (CSCO)” and “Intel (INTC)” came to dominate mind and money. It seemed they too would grow to the sky. One difference now is the new big five are such an integral part of everyone’s lives; under one umbrella each touches our work, transportation, entertainment, and overall consumption habits. This is unlike the silos in which energy or railroads or even IBMs original computing did. In this sense, they could indeed keep gaining the aforementioned mind and money share. It’s also important to point out that these companies are highly profitable cash machines with fortress balance sheets and trade at reasonable multiples. They have become safe havens in which no-one can predict a scenario in which AAPL or AMZN or MSFT will no longer exist. On the other side of the barbell are the freaks such as ZM, SHOP, and TSLA. At the moment their valuations seem unjustifiable but investors, especially younger ones willing to take more risk, have learned the lesson to let their imagination run free. The prime example being AMZN, in which there were multiple times in its 30-year history drawn in short-seller after the short seller and one could have bought its shares on a 75% drawdown because of a lack of imagination of what it could become. Many people are now looking at TSLA, saying they won’t miss this one and are putting their money where their mouth is. To learn more about Steve Smith’s unique approach to trading and access to his Option360, click here. SPY shares were trading at $315.73 per share on Tuesday afternoon, down $1.32 (-0.42%). Year-to-date, SPY has declined -0.89%, versus a % rise in the benchmark S&P 500 index during the same period."}]}