{"article": [{"url": "https://stocknews.com/news/slv-is-now-the-time-to-buy-or-sell-silver/", "published": 1597234100.0, "headline": "Is Now the Time to Buy or Sell Silver?", "body": "The story of the last month or so has been the rise in precious metals prices. Gold set record highs at more than $2,000 per ounce. And while not at record highs, silver was up over 60% for the year at one point. Whether talking about bullion, futures, or miners, pretty much any type of gold or silver investment was paying off big. Then, on August 11, precious metals tanked. Gold futures dropped nearly 6% for the day, and silver got hit even harder. Silver futures plunged by almost 15% when all was said and done. After performing so well in previous weeks, the fall of silver must have come as a significant shock to investors. None of this is to say that the precious metals run is over. It’s possible this is a brief correction on the road to even higher highs. Only time will tell when it comes to the longer-term performance of precious metals. 9 \"BUY THE DIP\" Growth Stocks For 2020Is there anything we can glean from this recent action in silver? Should investors use this drop as a reason to exit the trade? Or, is the 15% decline in silver prices a reason to load up on the commodity at a discount? One type of analysis you can do in this situation is based on options activity. That is, look at what’s going on in the options market to get some insight into what investors were thinking the day of the big drop. iShares Silver Trust (SLV) Looking at iShares Silver Trust (SLV) on the day of the drop, we can see a massive amount of options volume. Over 1.6 million options traded, which is four times the regular volume. Keep in mind, SLV is the most popular way for investors to gain exposure to silver. The interesting thing is that despite the 14% drop in SLV (it fell slightly less than futures prices), most of the activity in SLV options was on the call side. When call action is extreme, it tends to be a bullish indicator. In this case, 73% of the activity was in calls. Think about it this way: an investor buys calls if they expect the underlying instrument to go up. However, even selling calls (especially out-of-the-money calls) is moderately bullish, such as a covered call trade. One example of a straight-up bullish trade is an inter-market sweep of calls. That’s when the call buyer purchases every call available, across all exchanges, at a certain strike. In this case, a buyer purchased over 5,200 of the October 35 calls for 79 cents when SLV was around $25. The trader used an inter-market sweep and actually paid slightly more than the best ask price (77 cents) to do so. That’s certainly a bullish trade. A lot can happen by October expiration, but buying more than 5,000 calls so far away from the current price definitely makes a statement. That’s not the type of trade that would typically be used as a hedge of a short position. In other words, it does seem to suggest the price of silver could be bouncing back in the next couple of months. Want more great investing ideas? Download free the “10-Step Options Trading Checklist” you need before making a trade. The Virtual Trading Pit Is Open: Trade Set-ups, Training, New Trading Ideas How to Try Out Options Without Risking a Penny SLV shares were unchanged in after-hours trading Wednesday. Year-to-date, SLV has gained 40.41%, versus a 5.92% rise in the benchmark S&P 500 index during the same period."}]}