{"article": [{"url": "https://stocknews.com/news/fb-ntes-spot-zg-4-outperforming-internet-stocks-to-buy-now/", "published": 1599566900.0, "headline": "4 Outperforming Internet Stocks to Buy Now", "body": "Out of all the major sectors, technology has been the strongest. This is evident by the Nasdaq’s 71% gain from the March lows. Additionally, the Nasdaq exceeded its pre-coronavirus highs in June, while the S&P 500 did so in August, and the Russell 2000 has yet to do so. Within tech, one of the strongest groups has been Internet stocks. The Invesco Nasdaq Internet ETF’s (PNQI) year-to-date gain of 45.6% is a testament to the its strong price momentum. In contrast, the Nasdaq is up 27% YTD, and the S&P 500 is 7.5% higher YTD. Facebook, Inc. (FB), NetEase Inc. (NTES), Spotify Technology S.A. (SPOT), and Zillow Group Inc. (ZG) are primed to continue their outperformance in the coming months. 7 \"SAFE HAVEN\" Dividend Stocks for Turbulent TimesFacebook, Inc. (FB) Rising the industry boom, this social networking giant has returned 18.5% over the past three months and 37.8% year-to-date. FB’s second-quarter earnings report reflects how the pandemic has helped it thrive. The company’s net income increased by 98%, income from operations increased by 29%, and total revenue increased by 11% year-over-year during the quarter. The stock has gained about 70% since its March lows. Thirty-seven out of forty-nine Wall Street analysts have a Strong Buy rating on FB. During this period of social distancing, Instagram, Whatsapp, and Messenger are being heavily used to stay connected. FB recently made it possible for users to transfer their Facebook photos and videos to two additional services namely Dropbox (DBX) and Koofr using the new data portability tool. FB’s consensus revenue estimate of $19.69 billion for the quarter ending September indicates a year-over-year increase of 11.5%. FB’s earnings surprise history looks pretty good with the company beating the consensus EPS estimates in three of the trailing four quarters. The company’s EPS is expected to grow by 17.1% per annum over the next five years. FB recently launched Facebook Shop which is a new section in the Facebook app to shop for products and discover businesses. The company is also planning to expand checkout on Instagram for US businesses, which simplifies the purchasing process for customers. How does FB stack up for the POWR Ratings? A for Trade Grade A for Peer Grade A for Industry Rank B for Buy & Hold Grade B for Overall POWR Rating The stock is also ranked #5 out of 57 stocks in the Internet industry. NetEase Inc. (NTES) NTES is an interactive online Internet Services company that primarily focuses on the following segments: E-commerce, online game services, advertisement services, E-mail, and others. NTES has returned 19.2% over the past three months and 59.6% year-to-date. In the second quarter, net revenue increased 25.9% year-over-year and the company reported net income from continuing operations of $4.89 as compared to $3.65 in the year-ago period. NTES also declared a dividend of $1.485 for the quarter. Twenty-eight out of thirty-seven Wall Street analysts have a Strong Buy rating on the stock. Moreover, NTES has a higher average analyst price target than 99.9% of all US stocks in the StockNews.com universe. The company’s online gaming services and NetEase Cloud Music have been doing well. Moreover, NTES Cloud Music secured a multi-year licensing agreement with Universal Music Group recently. The stock has grown more than 60% since hitting its lows in March and it recently hit its 52-week high of $517.65. NTES’s earnings surprise history looks pretty good with the company beating the consensus EPS estimates in each of the trailing four quarters. NTES’s consensus revenue estimate of $2.66 billion for the quarter ending September indicates a year-over-year increase of 27.1%. NTES’s POWR Ratings reflect this promising outlook. It has an overall rating of Strong Buy with a grade of A in Trade Grade, Buy & Hold Grade, Peer Grade, and a B in Industry Rank. Among the 115 stocks in the China industry, it’s ranked #2 Spotify Technology S.A. (SPOT) This digital music-streaming company has returned 29.7% over the past three months and 66% year-to-date. In SPOT’s second quarter, total monthly active users increased 29%, total revenue increased 13% and gross profit increased 10% year-over-year. The stock has gained more than 95% since its March lows. The new multi-year global license agreement between SPOT and Universal Music Group can help both the companies create value for artists and better user experience. SPOT estimates that its operating losses will reduce substantially in the third and fourth quarters. Moreover, it also expects its total monthly active users and revenue to rise gradually by the end of the fourth quarter. The popularity of podcasts could also help steer SPOT’s growth in the long run and the company seems to be taking steps signing up famous personalities such as Joe Rogan and Kim Kardashian for their podcast series. SPOT’s multiyear partnership with Riot Games will bring podcasts and curated playlists for fans. It makes Spotify the official audio streaming partner for League of Legends global events. SPOT’s consensus revenue estimate of $2.37 billion for the quarter ending September indicates a year-over-year increase of 20.5%. SPOT’s EPS is expected to grow 167.7% per annum in the next five years. It’s no surprise that SPOT is rated a Buy in our POWR Ratings system. It also has an A for Trade Grade and Peer Grade. In the 11-stock Entertainment-Radio industry, it is ranked #1. Zillow Group Inc. (ZG) ZG operates real estate and home-related information marketplaces on mobile and the web in the United States. ZG has returned 36.8% over the past three months and 82.4% year-to-date. In ZG’s second quarter, total consolidated revenue grew 28% year-over-year, and traffic to ZG’s mobile apps and websites increased by 12% year-over-year, reaching a record of 218 million average monthly unique users. The company also closed the quarter with the highest cash balance in its history, growing cash and investments to $3.5 billion. The stock has grown by about 210% since its March lows. ZG co-founder and CEO, Rich Barton said, “Zillow’s second-quarter results are even better than we had hoped, and firm up our belief that powerful tailwinds in both real estate and technology are rapidly converging, with Zillow at the nexus.” The company launched a new feature of Builder Ratings and Reviews which will guide new construction home shoppers about the company building their home. Dotloop, an online real estate transaction and productivity optimization platform owned by ZG announced the addition of the California Association of Realtors® Standard Forms, providing the company’s members with greater choice for complete digital transactions. The market expects the company to report an EPS of $0.11 for the quarter ending September 2020, which indicates a significant growth over the year-ago loss per share of $0.12. Also, ZG’s earnings surprise history looks impressive with the company beating the consensus EPS estimates in each of the trailing four quarters. ZG is rated a Buy in our POWR Ratings system. It also has an A for Trade Grade, Peer Grade and Industry Rank, and a B for Buy & Hold Grade. It is also ranked #15 out of 57 stocks in the Internet industry. FB shares were trading at $275.48 per share on Tuesday afternoon, down $7.25 (-2.56%). Year-to-date, FB has gained 34.22%, versus a 5.74% rise in the benchmark S&P 500 index during the same period."}]}