{"article": [{"url": "https://stocknews.com/news/amzn-nvda-shop-atvi-like-amazon-then-youll-love-these-3-stocks/", "published": 1598616500.0, "headline": "Like Amazon? Then You'll Love These 3 Stocks", "body": "Correlation, or “R2,” is defined as a statistic that measures the degree to which two securities move with each other. It is typically used in evaluating a stock’s movements to a benchmark index such as the S&P 500. It is also used to compare different mutual funds or ETFs to help investors diversify their holdings. But what if we used it differently? For instance, to find great stocks to invest in. If we know of a top-performing stock, or maybe even have one in our portfolio, we can look for stocks highly correlated to it. We can still get portfolio diversification as long as the stocks are in different industries. I want to start with a stock that has not only performed well but has strong fundamentals and strong competitive advantage. I can’t think of another stock better for this exercise than Amazon (AMZN). It is not only rated a Strong Buy by our POWR Ratings system, but it passes many of the metrics I used when evaluating stocks. It has strong sentiment, with a three-month return of 41.1% and a six-month return of 80.4%. It has a strong revenue growth history with a five-year growth rate of 27.4%. Next year’s estimate is for 17.9% growth. It is also a wide moat stock, meaning it holds a strong competitive advantage in its industry. 7 Best ETFs for the NEXT Bull MarketNow that we have our target stock, it’s time to find stocks that are highly correlated with AMZN. I plugged AMZN into a website called StockFetcher to find stocks that have moved similarly over the past 180 days. The site provided a list of stocks and ETFs with a similar performance profile to AMZN over the past six months. Out of that list, I chose three stocks that also had strong fundamentals and a Strong Buy rating in our POWR Ratings system: NVIDIA (NVDA), Shopify (SHOP), and Activision Blizzard (ATVI). NVIDIA (NVDA) NVDA is one of the leading designers of graphics processing units that enhance the experience of computing platforms. Its chips are used in various end markets, including high-end PCs for gaming, data centers, and automotive infotainment systems. The company has also broadened its focus to more complex and favorable opportunities, including artificial intelligence and autonomous driving, which leverage the firm’s graphics processing units’ high-performance capabilities. The company has benefited from social distancing as many people continue to work from home, and many children are expected to learn from home starting next month. The company has seen steady growth in gaming due to increased demand in GeForce desktops and notebook GPUs. The firm has a strong line-up of advanced graphics cards that have made it a favorite among PC makers. NVDA’s data center business is also seeing growth because of a surge in Hyperscale demand. The company is looking towards new growth drivers for its data center business, including inference, data science, and machine learning, to consolidate its presence in the market. Like AMZN, NVDA has also seen strong momentum over the past few months, with a three-month return of 48.1%, and a six-month return of 100%. The company has a five-year average revenue growth rate of 22.2% with one year forecasted growth of 18%. NVDA is also an efficient business with a return on equity of 24.4% and a return on invested capital of 21.2%. The company is rated a Strong Buy by our POWR Ratings system. The company has straight “A’s” in every component that makes up the POWR Ratings, including Trade Grade, Buy & Hold Grade, Peer Grade, and Industry Rank. Shopify (SHOP) SHOP is an e-commerce platform for small and midsize businesses to set up stores and sell their products. The company is split into two units: subscription solutions and merchant solutions. Subscription solutions allow SHOP merchants to conduct e-commerce on various platforms, including setting up its website on the back of the company’s technology, or in physical stores and kiosks, or even online on Facebook (FB) and AMZN. The company embodies the growth of the e-commerce industry. Its platform provides merchants a way to sell their goods online, monitor sales, and offer multiple payment solutions. The company also provides a whole assortment of Shopify apps to increase marketing, handle inventory, keep track of finances, and provide customer support. The company sets itself apart from other e-commerce players because it is a brand-oriented platform. It’s not an online marketplace. Merchants can build up their brand, since consumers go to the merchant directly, not to an AMZN or Etsy (ETSY). SHOP is up 40.5% over the past three months and 140.3% over the past six months. The company has had strong revenue growth, with a five-year average rate of 70.3% and a forecasted 31.3% growth rate for next year. It is also very liquid, with a current ratio of 13.7 and $4 billion in cash as of the end of June. The stock is rated a Strong Buy by our POWR Ratings system. It has a grade of “A” in Trade Grade, Buy & Hold Grade, and Peer Grade. It is also the #1 stock in the Internet – Services industry. Activision Blizzard (ATVI) ATVI was formed in 2008 by the merger of Activision, one of the largest console video game makers, and Blizzard, one of the largest PC video game publishers. The combined company is one of the world’s largest video game publishers. Its impressive portfolio includes World of Warcraft, which has more than $8 billion of lifetime sales, and Call of Duty has sold over 175 million copies over the past 12 years. The company had an impressive second quarter with earnings per share of $0.93 compared to the consensus estimate of $0.63. It was a 173.5% increase from the same quarter last year. Revenue came in at $2.08 billion, a 71.9% increase from last year. Growth was driven by strong performances from Call of Duty, World of Warcraft, and Overwatch. Call of Duty in-game net bookings were almost five times higher than they were in the same quarter last year. More people have been playing video games due to social distancing and shelter-in-place orders. Its mobile app, Candy Crush Saga, was again the top-grossing game franchise in the U.S. mobile app store. The popularity of ATVI’s games should drive growth over the long-term. ATVI has shown similar momentum to AZMN, as the stock is up 18.6% over the past three months and 42.7% over the past six months. The company has a five-year sales growth rate of 47.3%, with 38.4% growth forecast for next year. The company is rated a Strong Buy by our POWR Ratings system. It has a grade of “A” for Trade Grade and Buy & Hold Grade, and a “B” for Peer Grade and Industry Rank. ATVI is also the #1 ranked stock in the Entertainment – Toys & Video Games industry. Want More Great Investing Ideas? 7 Best ETFs for the NEXT Bull Market Why Stocks Could Drop 20% in September? 9 “BUY THE DIP” Growth Stocks for 2020 AMZN shares . Year-to-date, AMZN has gained 84.10%, versus a 10.05% rise in the benchmark S&P 500 index during the same period."}]}