{"article": [{"url": "https://stocknews.com/news/uber-lyft-betting-on-a-big-move-in-uber/", "published": 1596629300.0, "headline": "Betting On A Big Move In Uber", "body": "Uber (UBER) & Lyft (LYFT) With all the hoopla over electric vehicles this year, it seems like investors have nearly forgotten about the ridesharing business. There was a time where you couldn’t open up a financial publication without seeing something about Uber (UBER) or Lyft (LYFT). Lately, however, ridesharing has taken a backseat—no pun intended—to the rides themselves. Investors have been obsessed with everything related to electric vehicles. Yet, with UBER earnings coming out Thursday after the close, investors’ focus may return to the ride-sharing industry, at least temporarily. 7 \"SAFE HAVEN\" Dividend Stocks for Turbulent TimesThe thing with ride-sharing is that it has been basically non-existent (at least in the US) with the pandemic raging onward. Not only are many more people working remotely (from home), but even those commuting aren’t likely to use public or shared transportation. From that perspective, it would be easy to assume that UBER (and LYFT) are likely to post nauseating earnings this quarter. On the other hand, at least in the case of UBER, the company has gone all in on food delivery. UBER already had the Uber Eats food delivery service, but it has since purchased Postmates to bolster the company’s market reach. Between the two, UBER now has about 37% market share. And let’s not forget, as much as the pandemic has hurt ridesharing, it has boosted food delivery services by an exponential amount. So what should we expect for UBER’s earnings? Will we see a bloodbath due to a lack of riders? Or, is food delivery going to bring the company out of the morass? Here’s the thing, with options trading, you don’t have to choose a side (or a direction). In fact, that’s exactly what a very well-capitalized trader just did in UBER options. This trader seems to have purchased 10,000 at-the-money straddles expiring in September. A straddle is buying both the put and the call at the same time (and at-the-money means it was the nearest strike to the current stock price). In this case, the September 32 straddle was bought with the stock at $32.35. The cost of the straddle (adding the call and put premiums together) was $5.26 (or $5.2 million total). That price is what the stock has to move to—in either direction—for the trade to make money. Now, $5.26 may seem like a lot for a $32 stock (it equals an expected move of 16%), but don’t forget this is a September straddle, so there are six weeks left until expiration. In other words, someone with a lot of trading capital thinks UBER is going to be moving quite a bit in the next several weeks. The catalyst could be earnings, but it doesn’t have to be. Moreover, the trader isn’t trying to guess the direction, just future volatility. Straddles can be expensive, so this is not a trade to enter into lightly. However, UBER is likely to move at least a few dollars either direction by expiration, so the chances of a total loss of capital are low. Want more great investing ideas? Download free the “10-Step Options Trading Checklist” you need before making a trade. The Virtual Trading Pit Is Open: Trade Set-ups, Training, New Trading Ideas How to Try Out Options Without Risking a Penny UBER shares rose $0.20 (+0.60%) in after-hours trading Wednesday. Year-to-date, UBER has gained 11.63%, versus a 4.25% rise in the benchmark S&P 500 index during the same period."}]}