{"article": [{"url": "https://stocknews.com/news/snow-brk-a-brk-b-goog-ko-why-did-warren-buffett-invest-in-snowflake", "published": 1601294900.0, "headline": "Why Did Warren Buffett Invest in Snowflake?", "body": "Last week, one of the major stories was Snowflake’s (SNOW) blockbuster public debut. In February, SNOW raised money at a valuation of $12.8 billion. During the IPO process, it was expected to go public at $20 billion. Ultimately, SNOW’s shares opened at a $70 billion valuation which exceeded even the most optimistic forecasts. Some interpreted this as the latest example of a frothy bull market especially in software as a service (SaaS) stocks. As evidence, they cited SNOW’s price to sales ratio of 149, and the formidable challenges it faces from legacy cloud providers who aren’t easily going to cede this massive market opportunity to an upstart. Others believe that SNOW is a once in a lifetime, transformative company that deserves this type of valuation due to its leading position in data warehousing and analytics. 7 Best ETFs for the NEXT Bull MarketBerkshires’ Investment in Snowflake Both sides make good points, but one powerful counterpoint to the bearish argument is that Warren Buffett’s Berkshire Hathaway (BRK.A) was an investor in the SNOW IPO. While the company’s story and bright future have been covered in detail, the conglomerate’s $730 million investment in the company at $120 per share is another interesting aspect. At Thursday’s close, this stake was worth $1.6 billion for a more than 100% gain. Traditionally, Buffett has managed Berkshire’s portfolio using value investing principles and eschewing high-multiple, tech stocks for old-school companies with simple businesses that compound value over the long-term. While this perception remains, looking at their actions and public statements reveal that their strategy has been evolving over the years. The SNOW investment is a result of this evolution. It also indicates that SNOW is a special company with many of the attributes that Buffett would appreciate even despite its sky-high valuation. We can learn a lot about Buffett by studying this investment, and we can learn a lot about SNOW by understanding what Berkshire likes about the company. Buffett’s Investing Evolution Buffett’s SNOW investment is the most recent demonstration of how his approach to investing has changed. Buffett started his career as a Benjamin Graham influenced value investor who waited to buy deep value situations. These were companies trading at a low single-digit price-to-earnings ratio and often at a price lower than book value. Occasionally, the cash on their balance sheet exceeded the total market capitalization. Later, he adjusted his style by putting more weight on buying high-quality companies. Going through Buffett’s commentaries and remarks in Berkshire Hathaway’s annual reports and shareholder meetings, it seems there are a couple of factors behind this shift. One is that as Buffett and Berkshire’s value kept growing, the number of investment opportunities declined. These types of opportunities were mainly found in smaller companies or special situations. Many of these Graham-type opportunities were only available in smaller, less liquid stocks which were no longer suitable for Buffett. Another factor is that the markets became more efficient as several Buffett and Graham acolytes were managing money, so these opportunities were arbitraged away. But probably the biggest contributor is that Buffett’s value investments have underperformed his investments in “high-quality” companies. In looking back at his biggest investment successes like Coca-Cola (KO), American Express (AXP), and Geico, Buffett has remarked that the entry price was less important than the quality of the business. Many of his failures such as textiles, newspapers, and Dexter Shoes involved buying assets at rock-bottom prices but it didn’t matter because of poor industry conditions and a weak business model. Therefore, Buffett has often remarked that “it’s better to buy a wonderful company at a fair price than a fair company at a wonderful price.” So, the first major shift in Buffett’s style was going from pure-value investing to putting increasing weight on owning high-quality businesses with less importance on the price paid. The next major evolution is being open to investing in technology companies. As an example, for many years, Buffett was averse to technology, but now, two of his largest positions are Apple (AAPL) and Amazon (AMZN). Apple now accounts for 49% of his portfolio, and he has said that it’s “Berkshire’s third business”. Buffett’s investments in AAPL and AMZN have been great for Berkshire shareholders. Both stocks have more than quadrupled since his initial entry. Further, many of Berkshire’s investments in financials, energy, and insurance have underperformed over the past few years. Snowflake’s Fit Berkshire’s SNOW investment brings to mind his comments about Google (GOOG) at a 2019 shareholder meeting. Buffett remarked that GOOG was a big miss on his part because GEICO had been using Google Ad Words to great success, so he should have been aware of the company’s potential. He said he passed on Google because he thought the company was too expensive at $24 billion when it IPO’d in 2004. However, Google is on pace to earn $25 billion in profits this year, and the stock is many multiples higher. GOOG is also a toll-road business which is another business model that Buffett loves. Google Search remains the best way for companies to connect with customers with buying intent on the Internet. Competition between advertisers also pushes ad rates higher over time. Buying ads on GOOG is the “toll” that companies must pay to reach Google Search users. Snowflake has a similar “toll road” type business since it organizes companies’ data into searchable databases. Snowflake charges on a per-user basis for any time, the company wants to access or analyze their data warehouses. Its product has had remarkable traction in terms of adding users and beating out the legacy providers. Similar to Google, Snowflake’s software will only get more powerful with more users on its platform, uploading more data, and running more analytics. Like Google, GEICO is an early adopter of Snowflake. Reportedly, GEICO CEO Todd Combs led the investment in Snowflake, as the company is a heavy user of its products. Essentially, Berkshire seems determined not to make the same mistake it did with Google. Conclusion The Snowflake investment is another sign of Berkshire’s evolution. Buffett has been able to thrive in all sorts of market environments and economic conditions because he has been able to adapt his strategy with time. Berkshire’s interest in Snowflake is another validation of the company’s powerful product and potential. Given their value origins, the fact that they are willing to pay such a high multiple indicates that they believe the company’s performance will enable it to justify this valuation. Want More Great Investing Ideas? 7 Best ETFs for the NEXT Bull Market Is the Stock Market Correction Over? Chart of the Day- See the Stocks Ready to Breakout SNOW shares were trading at $242.99 per share on Monday morning, up $13.99 (+6.11%). Year-to-date, SNOW has declined -4.31%, versus a 5.21% rise in the benchmark S&P 500 index during the same period."}]}