{"article": [{"url": "https://stocknews.com/news/zm-fb-amzn-msft-csco-ibm-down-20-from-record-highs-is-zoom-video-communications-a/", "published": 1600085300.0, "headline": "Down 20% From Record Highs, Is Zoom Video Communications a Buy?", "body": "Zoom Video Communications (ZM) is one of the hottest stocks in 2020. While the dreaded coronavirus has hurt multiple industries, it acted as a tailwind for collaboration companies that have benefitted from the shift to work from home and learn from home trends. Zoom Video stock is currently trading at $399 a share which is about 20% below its record high of $478. Despite the recent pullback, Zoom shares have gained a staggering 463% year-to-date and are up a whopping 964% compared with its IPO listing price of $36. Let’s take a look to see if the stock can continue to gain momentum in 2020 and beyond. 7 \"SAFE HAVEN\" Dividend Stocks for Turbulent TimesZoom went public in 2019 Zoom stock went public in April 2019 and the enterprise-facing platform has helped millions of people stay connected during these uncertain times. While the company was rocked by privacy issues earlier this year, it gained over 300 million daily meeting participants in April 2020, up from just 10 million in December 2019. We can see why investors have been bullish on the high-growth tech stock and Zoom did not disappoint. In fiscal 2020 (ended in January), Zoom reported sales of $623 million, year-over-year growth of 88%, while its operating cash flow rose almost 200% to $151 million. In fiscal 2020, the company’s net dollar expansion rate for customers with more than 10 employees was over 130%. It ended the year with 641 customers generating over $100,000 dollar in trailing 12-month sales, a growth of 86% year-over-year. If Zoom numbers were excellent in 2020, they have been nothing short of extraordinary in the last two quarters. In fiscal Q2 of 2021, Zoom sales rose 355% year-over-year to $663.5 million, crushing the consensus estimates of $500.5 million. Comparatively, its adjusted net income grew ten-fold and stood at $274.8 million or $0.92 per share, easily above estimates of $0.45. Zoom ended Q2 with 370,000 customers having more than 10 employees, up 458% year-over-year and 988 customers generated ARR (annual recurring revenue) of at least $100,000. The company’s net dollar expansion rate was above 130%, for the ninth consecutive quarter, indicating high customer retention and a willingness to pay for additional Zoom services. Long-term prospects are encouraging During the earnings call, CEO Eric Yuan said, “As remote work trends have accelerated during the pandemic, organizations have moved beyond addressing immediate business continuity needs to actively redefine and embracing new approaches to support a future of working anywhere, learning anywhere, and connecting anywhere. And we continued to see meaningful adoption of Zoom’s video-first unified communication platform across industries and geographies.” While the lockdown restrictions are easing, several companies are willing to let employees work from home which will continue to drive demand for collaboration tools and services. Zoom’s platform aims to make it easy to host meetings and it has integrated its lead-generation model with a go-to-market strategy which has helped the company to drive upgrades to paid offerings in a cost-efficient manner. Zoom’s platform focused on meetings and has expanded to include other solutions. This “land and expand” business model has led to some of the company’s largest deployments. Zoom customers are now purchasing solutions for webinars, room solutions, and the whole Unified Communications as a Service (UCaaS) platform. Further, it is also offering hardware-as-a-service available for Zoom Phone and Zoom Rooms users. The Zoom Phone will be available on several smart displays including Facebook’s (FB) Portal and Amazon’s (AMZN) Echo Show. Zoom is part of an industry that has major players including Microsoft (MSFT), Cisco (CSCO), and IBM (IBM). However, it has managed to grow its customer base and revenue at a robust pace, allowing the company to create its niche in a high growth space. Zoom stock trades at an expensive multiple The market-beating performance of Zoom shares has meant that the stock is now trading a premium. Zoom is valued at a market cap of $109 billion, indicating a price to sales multiple of 45.4x. Its forward price to earnings ratio is also high at 153.8x. However, we can see Zoom’s sky-high valuation is supported by stellar growth. Wall Street analysts covering Zoom expect sales to rise by 286% to $2.4 billion in fiscal 2021 while earnings are forecast to grow a massive 611% to $2.49. Analysts have a 12-month average target price of $402 for Zoom stock, indicating its trading at a discount of 5%. Despite its lofty multiples, analysts remain bullish on Zoom and for good reason. The final takeaway Zoom is now a household name and is well poised to become the go-to platform for enterprises that are embracing the remote-work culture. Alternatively. investors may be worried that the company’s sales growth might decelerate once the pandemic is under control and normalcy resumes. However, the company grew revenue by 88% in fiscal 2020 and is forecast to grow top-line by 30% in 2022. While its wild gains in 2020 might not be sustainable, Zoom remains a solid bet in the upcoming decade given its customer retention rate, stellar growth, and debt-free balance sheet. Hence, any major correction in Zoom’s stock should be viewed as a buying opportunity for long-term investors. Want More Great Investing Ideas? 7 Best ETFs for the NEXT Bull Market Is the Stock Market Correction Over? Chart of the Day- See the Stocks Ready to Breakout ZM shares were trading at $396.12 per share on Monday afternoon, up $13.12 (+3.43%). Year-to-date, ZM has gained 482.19%, versus a 6.23% rise in the benchmark S&P 500 index during the same period."}]}