{"article": [{"url": "https://stocknews.com/news/dxcm-lvgo-tndm-3-top-diabetes-stocks-for-the-second-half-of-2020/", "published": 1594210100.0, "headline": "3 Top Diabetes Stocks for the Second Half of 2020", "body": "Most people would be shocked to learn that more than 34 million Americans are living with diabetes. That figure represents more than 10% of the country’s population. Sadly, more than 200,000 children in the United States have diabetes. Numerous companies are hard at work developing diabetes treatments and tools that relieve the pain of this deadly disease. DexCom (DXCM), Livongo Health (LVGO), and Tandem Diabetes Care (TNDM) are three companies involved in diabetes care that you should keep an eye on as we transition to the second half of 2020. DexCom (DXCM) 9 \"BUY THE DIP\" Growth Stocks For 2020Glucose monitoring systems are helping people with diabetes across the globe. DXCM makes these systems for ambulatory use by diabetics and healthcare providers that treat both diabetic patients and non-diabetic patients. The technology measures the patient blood glucose level continuously by transmitting the information to a smartphone. Nearly 700,000 patients were using DXCM glucose monitoring systems as of the start of 2020. Now that diabetes impacts more people than ever before, DXCM’s blood glucose monitoring technology will prove quite valuable. The economic recession should not impact the demand for DXCM’s diabetes products, as these tools can make the difference between life and death. It will surprise no one that DXCM is one of the top-rated stocks in our momentum-based POWR Ratings system. Overall, it is the #1 ranked stock in the #10 ranked industry (Medical – Devices & Equipment Stocks). Livongo Health (LVGO) Every diabetic patient can benefit from reminders to help them manage their disease. LVGO provides this type of information in a high-tech and reliable manner and that is only one segment of LVGO’s product offerings. LVGO also provides various sorts of digital health tools, including a platform that uses technology and data science to help people battling chronic conditions. As time progresses, more and more businesses will be tapping into LVGO’s services. LVGO management forecasts year-over-year growth upwards of 110% or more. As LVGO member enrollment continues to increase, the stock could reach new heights. LVGO is up nearly 300% year-to-date. LVGO has 4 Aces up its sleeve. By that I mean that all 4 out of 5 scores in our POWR Ratings system is an A for the stock. It is also the #5 ranked stock in the Medical – Services industry. Tandem Diabetes Care (TNDM) It is not often that you find a company making it through the pandemic and recession without a meaningful hit to its operations. TNDM is one of those companies. TNDM executives issued a press release in mid-March, stating its warehouse and manufacturing facilities would continue operating as usual amidst the pandemic. TNDM sales were just under $98 million during the first quarter of 2020. This figure represents a near 50% rise on a year-over-year basis. TNDM’s insulin pump sales grew by nearly 20% during that same period. The company recently agreed to a deal with Abbott Laboratories to provide patients with enhanced diabetes management tools. How does TNDM stack up for the POWR Ratings? A for Trade Grade A for Buy & Hold Grade B for Industry Rank A for Peer Grade A for overall POWR Rating It is also the #10 rated stock in the Medical – Services industry. Want More Great Investing Ideas? 9 “BUY THE DIP” Growth Stocks for 2020 Is the Bull S#*t Rally FINALLY Over? 7 “Safe-Haven” Dividend Stocks for Turbulent Times Top 3 Investing Strategies for 2020 DXCM shares were trading at $429.85 per share on Wednesday afternoon, up $3.99 (+0.94%). Year-to-date, DXCM has gained 96.51%, versus a -1.48% rise in the benchmark S&P 500 index during the same period."}]}