{"article": [{"url": "https://stocknews.com/news/kdp-mnst-tap-ccu-wter-5-beverage-stocks-to-buy-this-summer/", "published": 1594210100.0, "headline": "5 Beverage Stocks to Buy This Summer", "body": "We are in the midst of one of the hottest summers on record in some parts of the country. Many states are seeing temperatures in the 90s. That can make life even more stressful without the fact that there is an invisible virus spreading across the country. Coupled with social unrest and high unemployment, and it is easy to understand why people are so stressed out. Unfortunately, most bars and clubs are closed due to COVID-19, so people are turning to alcohol, energy drinks, water, and other refreshing beverages sold at supermarkets. Companies such as Keurig Dr. Pepper (KDP), Monster Beverage (MNST), Molson Coors Beverage Company (TAP), Compañía de las Cervecerías Unidas (CCU), and Alkaline Water (WTER) could benefit in the weeks and months ahead. Keurig Dr. Pepper (KDP) 7 \"SAFE HAVEN\" Dividend Stocks for Turbulent TimesMany people agree that a cold Dr. Pepper can hit the spot on a hot summer day. When it is hot, people can get tired. That’s where KDP’s Keurig Green Mountain comes in. Its coffee products can provide the boost people need. Snapple beverages are also under the KDP umbrella. KDP brings in $12 billion in yearly revenue thanks to the success of these very popular brands. The POWR Ratings have KDP rated as a Buy with an A Trade Grade and Bs in Peer Grade and Buy & Hold Grade, two components of the POWR Ratings. The stock is also ranked #6 out of 28 stocks in the Beverages industry. The average analyst price target for the stock is $31.33. Monster Beverage (MNST) Energy drink nonbelievers have been proven wrong. It is clear energy drinks are here to stay. They are likely to become even more popular as millennials and Generation Z come of age. MNST distributes and markets energy drinks along with alternative beverages. The company’s success is evident as Coca-Cola owns a 16% equity stake in the company. MNST is one of the top-rated stocks in our momentum based POWR Ratings system. Overall, it is the #1 ranked stock in the Beverages industry. Molson Coors Beverage Company (TAP) It wasn’t that long ago when TAP’s Molson beers were primarily sold in Canada. Today, TAP products also include Coors, Miller Lite, and Blue Moon. This has given the company an inroad to the American market. While hard seltzers are having their moment, don’t discount the appeal of beer in North America. Analysts have an average price target of $46.75 for TAP. TAP appears to be undervalued with a relatively low forward P/E of 12.28. Compañía de las Cervecerías Unidas (CCU) If you are looking for a company that sells a variety of beverages, consider CCU. The company produces everything from mineral water to soft drinks, Chilean wines, and more. This multinational beverage company is primarily focused on selling beverages throughout the South American market. CCU is currently the third-largest beverage business in Argentina. It sells the second most non-alcoholic beverages in Chile and is also the top seller of mineral water in the Chilean market. Alkaline Water (WTER) There is a saying, “Water is the new oil.” Water and protein are the building blocks of life, and our planet has only a limited amount of fresh water. The price of this new “liquid gold” should continue to rise in the years ahead. WTER stands to benefit from this trend. WTER sells alkaline water to stores, markets, retailers, and grocery chains throughout the country. The average analyst price target is $2.25 per share. Want More Great Investing Ideas? 9 “BUY THE DIP” Growth Stocks for 2020 Is the Bull S#*t Rally FINALLY Over? 7 “Safe-Haven” Dividend Stocks for Turbulent Times Top 3 Investing Strategies for 2020 KDP shares were trading at $28.94 per share on Wednesday morning, down $0.18 (-0.62%). Year-to-date, KDP has gained 1.66%, versus a -0.95% rise in the benchmark S&P 500 index during the same period."}]}