{"article": [{"url": "https://stocknews.com/news/fast-lly-lmt-kmb-4-defensive-stocks-to-protect-your-portfolio-during-uncertain-times/", "published": 1600949300.0, "headline": "4 Defensive Stocks to Protect Your Portfolio During Uncertain Times", "body": "The current market correction appears to be picking up steam as all three major indexes had yesterday their worst trading days in weeks. The S&P 500 fell 2.4%, led by a significant drop in the energy and tech sectors. The Energy Select SPDR ETF (XLE) was down 4.5%, and the Technology Select SPDR ETF (XLK) fell 3.1%. This was the lowest level for the S&P 500 since July. The Dow Jones Industrial Average fell 1.9%, and the Nasdaq Composite index fell 3%, which brought the tech-dominated index near a two-month low. The volatile downtrend has made some investors nervous, as expected. One way to ride out this storm is to hold defensive stocks. There are many different types of stocks that could be considered defensive, but I like to focus on three core principles: low beta, consistent dividends, and stable earnings. According to Investopedia, beta is a statistical measure of risk in investments. It measures a stock’s volatility in relation to the stock market. A higher volatile stock has a beta over 1, while a lower volatility stock has a beta below 1. I screened for stocks with a beta below 1, a growing dividend yield, and growing earnings. This screen resulted in four well-known stocks: Fastenal Co (FAST), Eli Lilly and Company (LLY), Lockheed Martin (LMT), and Kimberly-Clark (KMB). 7 Best ETFs for the NEXT Bull MarketFastenal Co (FAST) FAST is a national wholesale distributor of industrial and construction supplies. It distributes products through more than 3,000 stores, mainly located in North America. The company initially sold just fasteners but added new products in 1993, such as tools, material handling, janitorial, electrical, safety and welding supplies. Fasteners remain its largest category, with a third of its sales. The company has been benefiting from higher demand for personal protective equipment products due to the pandemic. FAST has adopted FAST Solutions, an industrial vending process that could revolutionize the industrial distribution system. The firm installs vending machines at a customer’s location and keeps it filled with products they need. Industrial vending is one of the company’s primary growth drivers. It has the potential to increase revenue and profits. The company meets all my requirements for a defensive stock. Its has a current dividend yield of 2.3% and has seen dividend growth of 12.3% over the past five years. Earnings have also been growing at a rate of 10.5% over five years. FAST has a 1-year beta of 0.95 and a 3-year beta of 0.98. The stock is rated a “Buy” by our POWR Ratings system. It has a grade of “B” for Buy & Hold Grade, Peer Grade, and Industry Rank, three of the components that make up the POWR Ratings. FAST is also ranked #22 out of 58 stocks in the Industrial-Equipment industry. Eli Lilly and Company (LLY) LLY is one of the world’s largest pharmaceutical companies, with a diversified product portfolio including Alimta and Verzenio for cancer; Jardiance, Trulicity, Humalog, and Humulin for diabetes; and Taltz and Olumiant for immunology. Its pharmaceutical categories include neuroscience (Zyprexa, Cymbalta, Emgality), diabetes, oncology, immunology, and others (Cialis). The company expects sales growth to be driven by higher demand for Trulicity and Taltz and new product launches in its diabetes business. LLY is also making progress in its efforts to create therapies that treat COVID. Also, the company has been working on building its drug pipeline through business development deals. LLY announced positive results from its Phase 3 trial of its drug Verzenio, which significantly reduced the risk of breast cancer returning when used in combination with adjuvant endocrine therapy. LLY has a dividend yield of 2.0%, which has grown 12.5% over the past three years. Earnings have also increased by 38.6% over three years. In its most recent report, earnings per share came in at $1.89, compared with analysts’ expectation of $1.58. That was a 26% year over year increase from $1.50. The company has a 1-year beta of 0.73 and a three-year beta of 0.73, making this a defensive stock, in my opinion. The company is rated a “Buy” in our POWR Ratings system. It holds grades of “A” in Peer Grade and Industry Rank, and a “B” for Trade Grade and Buy & Hold Grade. The stock is also ranked #28 out of 233 stocks in the Medical-Pharmaceutical industry. Lockheed Martin (LMT) LMT is the largest global defense contractor and is a leader in producing high-end fighter aircraft since it was awarded the F-35 contract in 2001. The company’s largest segment is Aeronautics, which is dominated by the F-35. Its remaining segments include rotary & mission systems, made up of the Sikorsky helicopter business, missiles and fire control, and space systems, which manufactures satellites. The company benefits from strong demand for high-end military equipment in both the U.S. and internationally. An increased budget by the Trump administration should provide an additional boost to the company’s top line. LMT also sees increased demand for its THAAD missiles from Saudi Arabia. Due to its exposure to high priority government programs, the company is not affected by economic downturns. LMT had a strong quarter as earnings per share came in at 5.79, a 15.8% increase year over year. Earnings have been growing at an average annual rate of 21.1% over the past three years. The company also sports a dividend yield of 2.5%, which has increased an average of 9.9% over the past five years. Lockheed currently has a 1-year beta of 0.88 and a 3-year beta of 0.85, indicating less volatility than the market. The company is rated a “Buy” in our POWR Ratings system. It has a grade of “A” for Trade Grade and Peer Grade, and a “B” for Buy & Hold Grade. The stock is also the #4 ranked stock in the Air/Defense Services industry. Kimberly-Clark (KMB) KMB is a leading manufacturer of personal care and tissue products. Its brands include Huggies, Pull-Ups, Kotex, Depend, Kleenex, and Cottonelle. The company sells its products to supermarkets, drugstores, warehouse clubs, retail outlets, high volume public facilities and more. The company also operates K-C Professional, which partners with businesses to provide safe and sanitary products for the workplace. The company has seen a higher demand for its products amid the coronavirus. This boosted sales in the second quarter. Revenue came in at $4.61 billion compared to a consensus estimate of $4.48 billion. Earnings also outperformed with an EPS of $2.20, which was a 31.7% increase year over year. Management is anticipating more growth for the rest of 2020. The company has also been taking steps to lower costs. In 2018, it launched the Global Restructuring and FORCE programs. KMB has a current dividend yield of 3.0%, the highest in this list. Its dividend has grown an average of 4.0% over the past five years. KMB has raised its dividends for 48 straight years. Its earnings growth in the last quarter was not an aberration as its EPS has grown an average of 33.7% over the past five years. The company has a very low 1-year beta of 0.59 and a 3-year beta of 0.55. As KMB’s products typically see stable demand during economic slowdowns, this is an attractive defensive stock. Our POWR Ratings agree, awarding the stock a “Buy” rating. It has a grade of “A” for Industry Rank, and a grade of “B” for Trade Grade, Buy & Hold Grade, and Peer Grade. The company is also ranked #6 out of 34 stocks in the Consumer Goods industry. Want More Great Investing Ideas? 7 “Safe-Haven” Dividend Stocks for Turbulent Times When Does the Next Bull Run Start? Chart of the Day- See the Stocks Ready to Breakout FAST shares were trading at $44.63 per share on Thursday morning, up $0.44 (+1.00%). Year-to-date, FAST has gained 23.15%, versus a 1.70% rise in the benchmark S&P 500 index during the same period."}]}