{"article": [{"url": "https://stocknews.com/news/nvda-docu-run-3-top-tech-stocks-pushing-the-market-higher/", "published": 1598530100.0, "headline": "3 Top Tech Stocks Pushing the Market Higher", "body": "While the domestic economy has yet to show a measurable improvement, the stock markets are continuously moving higher. The S&P 500 has been on a rally and hit another fresh high of $3481.07 yesterday, surpassing its previous record last week. In addition to fiscal and monetary policies, the accelerated pace of digital transformation is a major reason behind the market’s continued rally. So, undoubtedly, tech stocks have been the major beneficiaries. Since the virus-led market crash in mid-March, the tech-heavy Nasdaq composite gained close to 70% versus the S&P 500’s 50% gain. This performance clearly demonstrates the fact that we’re seeing tech-oriented momentum. The technology sector has been driven up by a select group of stocks. The following stocks have contributed to the skyrocketing performance of the tech sector: NVIDIA Corporation (NVDA), DocuSign, Inc. (DOCU), and Sunrun Inc. (RUN). 7 Best ETFs for the NEXT Bull MarketNVIDIA Corporation (NVDA) NVDA’s products and services are visual computing platforms that deal with four markets — Gaming, Enterprise, High Performance Computing & Cloud, and Automotive. The stock has gained about 160% since its March lows, and has gained 25% over the past month. According to founder and CEO Jensen Huang, “Adoption of NVIDIA computing is accelerating, driving record revenue and exceptional growth. Growth in GeForce gaming accelerated as gamers increasingly immerse themselves in realistic virtual worlds created by NVIDIA RTX ray tracing and AI. Our new Ampere GPU architecture is sprinting out of the blocks, with the world’s top cloud service providers and server makers moving quickly to offer NVIDIA accelerated computing. Mellanox grew sharply, driven by the need for high-speed networking in cloud data centers to scale-out AI services. And Mercedes-Benz’s partnership with NVIDIA to power its next-generation fleet of luxury cars — from the computer to the AI software, and from the cloud to the car — is transformative.” For the second quarter ending July 2020, revenue increased 50%, net income increased 79% and earnings per share were up 76% year-over-year. Voyage’s third-generation robotaxi, the G3, used NVDA DRIVE AGX Pegasus for autonomous transportation. Furthermore, NVDA plans to collaborate with the University of Florida to build the world’s fastest AI supercomputer in academia. The consensus EPS estimate of $2.57 for the quarter ending October indicates a year-over-year increase of 44.4%. Also, it is impressive to note that the company beat consensus EPS estimates in each of the trailing four quarters. The revenue estimate of $4.41 billion also indicates an increase of 46.2% over the year-ago quarter. How does NVDA stack up for the POWR Ratings? A for Trade Grade A for Buy & Hold Grade A for Peer Grade A for Industry Rank A for Overall POWR Rating You can’t ask for better. The stock is also ranked #2 out of 86 stocks in the Semiconductor & Wireless Chip industry. DocuSign, Inc. (DOCU) DOCU is a cloud-based transaction products and services company which helps businesses prepare, sign, and manage agreements. Moreover, DOCU offers eSignature as part of the DocuSign Agreement Cloud. For the fiscal first quarter ended April 2020, DOCU reported a net income per share of $0.12 as compared to $0.07 in the same period last year. The company’s total revenue increased 39% and billings increased 59% year-over-year. The stock has been on an upward path since the start of 2019 with minor hiccups along the way. DOCU has returned more than 180% since its March lows and 9% over the past month. DOCU announced its acquisition with Liveoak Technologies in early July which will build on its existing collaboration. The company’s second-quarter fiscal 2021 results will be announced on September 3rd 2020 after the market closes. The market expects the company to report earnings of $0.08 per share for the second quarter, which indicates a 700% increase over the year-ago number. Moreover, DOCU has an impressive earnings surprise history with the company beating consensus EPS estimates in three of the trailing four quarters. DOCU’s EPS is expected to grow 31.2% per annum in the next five years. It’s no surprise that DOCU is rated a Strong Buy in our POWR Ratings system, with a grade of A in Trade Grade, Buy & Hold Grade, and Industry Rank. In the 92-stock Software-Application industry, the stock is ranked #6. Sunrun Inc. (RUN) RUN provides residential solar, storage and energy services. The company has grown more than 445% since its March lows and 23.7% over the past month. In the second quarter, RUN’s customers increased 21% and its net earning assets increased 14% year-over-year. In order to help consumers that are facing issues with high electricity costs and power shutoffs, RUN signed three new agreements with leading community energy suppliers in the Bay Area to provide affordable, clean solar, and battery backup power. SUN also announced a partnership with GRID Alternatives to provide 100% free battery systems for low-income customers in wildfire-prone regions. Moreover, eight out of ten Wall Street analysts have a Strong Buy rating on the stock. RUN’s POWR Ratings reflect this promising outlook. It has an overall rating of a Strong Buy with a grade of A for Trade Grade and Buy & Hold Grade, and a B for Peer Grade and Industry Rank. Among the 14 stocks in the Solar industry, it’s ranked #4. Want More Great Investing Ideas? 7 Best ETFs for the NEXT Bull Market Why Stocks Could Drop 20% in September? 9 “BUY THE DIP” Growth Stocks for 2020 NVDA shares were trading at $508.16 per share on Thursday afternoon, down $2.76 (-0.54%). Year-to-date, NVDA has gained 116.19%, versus a 9.62% rise in the benchmark S&P 500 index during the same period."}]}