{"article": [{"url": "https://stocknews.com/news/zs-spt-apps-estc-4-lesser-known-tech-stocks-that-are-soaring/", "published": 1598443700.0, "headline": "4 Lesser-Known Tech Stocks That are Soaring", "body": "The tech stocks are the leaders of this bull market. In part, it’s due to their revenues remaining resilient and in some cases, accelerating amidst the economic uncertainty. Their above-average growth rates also become more attractive on a relative basis as interest rates decrease and expectations for economic growth decline. The top tech stocks typically get all the attention, but there is plenty of opportunity among smaller companies that have significant upside. Let’s take a look at four lesser-known tech stocks that have increased in value in recent months and weeks: Zscaler (ZS), Elastic N.V. (ESTC), Digital Turbine (APPS) and Sprout Social (SPT). Zscaler (ZS) 7 Best ETFs for the NEXT Bull MarketBusiness operations are moving to the cloud. The transition to the cloud creates the need for cloud-based security solutions. Thus, ZS’s product, dubbed Zero Trust Network Access (ZTNA), is seeing a large increase in customers. ZS’s specialties range from web security to IoT security, vulnerability management, user activity on mobile devices, and beyond. In other words, businesses and governments in need of digital security solutions need not look any further than ZS. ZS dipped to a mere $41 amidst the market-wide sell-off in the spring yet quickly soared nearly $100 in the next four months. The POWR Ratings show ZS has A grades in its Trade Grade and Buy & Hold Grade POWR Components. The stock has B grades in its Peer Grade and Industry Rank Components. ZS is ranked third of 23 stocks in the Software – Security space. The analysts are in love with ZS, rating it as an outperform. Walter Pritchard, an analyst with Citi, recently upgraded his ZS rating from Neutral to Buy, setting a one-year price target of $152 for the stock. This is quite the hike in price target considering Pritchard previously had an $86 price target on the stock. Elastic N.V. (ESTC) It is not easy to explain ESTC’s business. In laymen’s terms, ESTC is best described as a search-oriented business. ESTC provides software that stores and processes information from numerous sources and formats. ESTC also conducts searches, analyses, and provides insightful visualization for clients. ESTC has A POWR Ratings grades across the board but for its Industry Rank of C. The stock is ranked first of 10 in the Software – SAAS category. Out of the 11 analysts who have studied ESTC, 9 insist it is a Buy, two recommend holding and none advise selling. ESTC popped 10% last week after Tyler Radke, an analyst with Citi, issued a Buy rating on the stock. ESTC has 57% YOY revenue growth, a 72% gross profit margin in its most recent quarter, and a price to sales ratio of 17. These are solid numbers all the way around. It should not come as a surprise if ESTC blasts through its 52-week high of $109.55 within the next couple weeks. Digital Turbine (APPS) As time progresses, many more mobile operators need solutions and products tailored to their unique offerings. APPS provides such solutions for mobile operators as well as device OEMs and other groups. APPS offers management solutions for mobile devices with capabilities for targeted app distribution APPS also enhances the user experience through customization, provides an app/content store, mobile payment solutions, and more. The APPS POWR Ratings reveal the stock has A grades in each POWR Rating but for its Buy & Hold Grade of B. APPS is ranked in the top 20 of 90 publicly traded companies in the Software – Application sector. APPS has a reasonable forward P/E ratio of 55.27 because it is a tech stock. The question is how high APPS will go. The stock hovered around $7 before the pandemic then spiked to the $25 level thereafter. APPS is still growing and turning a profit, generating $10 million per quarter. If APPS successfully extends its services to connected TV, its solutions will be used on that many more devices sooner than most investors expected, helping the stock reach new heights. Sprout Social (SPT) Most investors assume Facebook (FB), Twitter (TWTR), Snap (SNAP) and Pinterest (PINS) are the only opportunities to invest in social media. However, SPT is another way to profit from social media’s growing share of ad spending and mind-share. SPT provides analytics, management, listening, advocacy, and customer care solutions to a litany of customers. From corporate brands to agencies and beyond, just about every organization now uses social media to make money. SPT provides solutions for companies to make the most of social media networks ranging from Twitter to Pinterest, Facebook, Instagram, and beyond. Check out the analysts’ take on SPT at TipRanks and you will find eight out of eight rates the stock a Buy. As more companies turn to social media to maximize inbound marketing opportunities, SPT will likely continue to move higher. This is a solid buy-and-hold stock worth holding for years if not decades. Want More Great Investing Ideas? The Best of StockNews 2 Step Process to Sell @ Market Top in September 9 “BUY THE DIP” Growth Stocks for 2020 ZS shares rose $1.74 (+1.28%) in premarket trading Wednesday. Year-to-date, ZS has gained 194.09%, versus a 8.13% rise in the benchmark S&P 500 index during the same period."}]}