{"article": [{"url": "https://stocknews.com/news/dhi-len-phm-tol-lgih-5-top-stocks-to-buy-as-homebuilder-confidence-hits-record/", "published": 1598530100.0, "headline": "5 Top Stocks to Buy as Homebuilder Confidence Hits Record High", "body": "New homes are popping up left and right throughout the land of the free and the home of the brave. Homebuilder confidence has never been higher, even as the economy is mired in a trough that could last through the end of the year. If your portfolio does not have at least one homebuilder stock, it is time to diversify your holdings, and consider a homebuilder stock. There are plenty of publicly traded homebuilders to evaluate. StockNews.com is here to sort through the candidates to highlight the best of the best. The following homebuilder stocks are worthy of a position in your portfolio: D.R. Horton (DHI), Lennar (LEN), Pulte Group (PHM), Toll Brothers (TOL), and LGI Homes (LGIH). 7 \"SAFE HAVEN\" Dividend Stocks for Turbulent TimesD.R. Horton (DHI) Single-family homes are in-demand throughout the entirety of the country. This variety of homes is DHI’s specialty. DHI builds and sells houses in half the nation’s states with a focus on 70 metropolitan markets. The POWR Ratings show DHI has A grades in each POWR component. Furthermore, DHI is ranked 20 stocks in the Homebuilders industry. Out of the 17 analysts who have reviewed DHI, 11 rates it a Buy, six recommend holding, and none advise selling. DHI has a forward P/E ratio of 12.97, meaning it is likely undervalued. As America’s largest homebuilder, DHI is in prime position to benefit from the enormous spike in demand for newly-constructed homes. DHI orders increased by 50% in May, June, and July. The millennial age cohort that previously preferred to rent in urban spaces is now looking to purchase homes in the suburbs. DHI may blast through its 52-week high of $77.45 by the end of September. Lennar (LEN) If you are looking to invest in a homebuilder of single-family attached homes and detached homes that sells residential land and provides financial services, look no further than LEN. This multi-faceted approach to real estate makes LEN quite a unique investment. LEN’s POWR Ratings show the stock has A grades in each component. Furthermore, LEN is ranked above all but one stock in the Homebuilders industry. Out of the 14 analysts who have studied LEN, eight recommend buying, six advise holding, and none insist on selling. Add in the fact that LEN has a comparably low forward P/E ratio of 12.14 and the stock looks that much more attractive. Even if the economy does not recover, the low mortgage interest rates still bode well for LEN. This could be a can’t-lose stock for the foreseeable future. Pulte Group (PHM) If you believe the United States’ homebuilding market will continue to thrive, you should consider PHM. The company has both homebuilding and financial services businesses. What makes PHM different from the rest of homebuilding stocks is its designs include everything from townhouses to duplexes, condominiums, and single-family detached homes. These homes appeal to first-time homebuyers or those transitioning to their second or third home. The POWR Ratings reveal PHM has A grades in each POWR component. PHM is ranked 4th of 21 stocks in the Homebuilders industry. The company’s revenue is up 3% quarterly, fueled by a 6% hike in home closings. Though PHM’s average selling price decreased, it is nothing to worry about as the drop results from the heightened demand for entry-level housing that is priced comparably cheaper than other options. Furthermore, PHM’s gross margins are increasing. Add in the fact that PHM has nearly double the ’19 to ’20 EPS growth of other homebuilders, and you have reason to consider this stock. Toll Brothers (TOL) Investors on the prowl for a builder that constructs a plethora of homes, including traditional houses, attached home communities, golf communities, and urban high-rises, need not look further than TOL. TOL conducts business throughout the northeast, south, and western portions of the United States. The POWR Ratings show TOL has A grades in each POWR Component, but for its Peer Grade, which is a C. Furthermore, TOL is ranked in the top five of the Homebuilder industry. TOL signed new contracts for just under 2,000 units in the second quarter alone. TOL’s deposit activity is up nearly 15% on a year-over-year basis. Furthermore, TOL has around $6 billion of work in its backlog to complete. In other words, TOL is well-positioned for future success. LGI Homes (LGIH) LGIH designs and constructs homes in some of the country’s hottest real estate markets: Texas, Florida, Arizona, North Carolina, Washington, and Colorado. The company builds luxury homes, move-up homes, and entry-level homes. LGIH has nearly perfect POWR Rating components: A grades in each component except Peer Grade. However, LGIH’s cash flow growth on a year-over-year basis is almost 13%, which is higher than most other homebuilders. LGIH has historical earnings per share growth of 30%. This rate is expected to hike upwards of 30.6% this year alone, while the industry average is merely 1.3%. LGIH may move beyond its 52-week high of $123.94 before year’s end. Want More Great Investing Ideas? The Best of StockNews 2 Step Process to Sell @ Market Top in September 9 “BUY THE DIP” Growth Stocks for 2020 DHI shares were trading at $74.95 per share on Thursday morning, up $0.88 (+1.19%). Year-to-date, DHI has gained 43.39%, versus a 9.36% rise in the benchmark S&P 500 index during the same period."}]}