{"article": [{"url": "https://stocknews.com/news/iipr-blk-will-innovative-industrial-properties-expansion-continue/", "published": 1598443700.0, "headline": "Will Innovative Industrial Properties' Expansion Continue?", "body": "Innovative Industrial Properties (IIPR) has had a great year and is executing on their ambitious expansion plans, acquiring properties and leasing them back to the sellers. So far, the stock is up 64% year-to-date, while the economy has been mired in an economic downturn. IIPR recently announced that they entered into an amendment of a lease with a subsidiary of Ascend Wellness Holdings (AWH) at a property located in Barry, Illinois. This amendment has allowed Ascend Wellness Holdings to receive an additional $18 million in funding for the expansion of their regulated cannabis cultivation and processing facilities at the property. The expansion will include a new 90,000 square foot greenhouse facility and further production capacity enhancements for the existing facility located on the property. The lease amendment also adjusted the base rent under the lease. IIPR’s collaboration with AWH stretches much further than just this one particular property. IIPR also owns two other properties in Massachusetts and Michigan. The company’s total investment in properties leased to AWH, is now approximately $119.8 million. 9 \"BUY THE DIP\" Growth Stocks For 2020Paul Smithers, President and Chief Executive Officer of IIPR said, “We are excited to once again expand our long-term real estate partnership with AWH. The AWH management team has done tremendous work in positioning itself as one of the leading MSOs in states that represent tremendous market opportunities, and has continued to execute well on its mission throughout these uncertain times in serving patients and customers with the highest quality products and dedication to patient care and customer service.” IIPR now owns 61 properties located in Arizona, California, Colorado, Florida, Illinois, Maryland, Massachusetts, Michigan, Minnesota, New Jersey, New York, Nevada, North Dakota, Ohio, Pennsylvania, and Virginia. 99.2% of these properties are leased with a weighted-average remaining lease term of approximately 16.0 years. Adding to IIPR’s already impressive 2020, the company saw its aggregate ownership by 13F filers increase nearly 24% to 16.2 million shares from the first quarter. This included almost 235,000 shares bought by Larry Fink’s BlackRock (BLK) and almost 230,000 shares purchased by Steven Cohen’s Point72 Asset Management. Institutional ownership is a strong sign of confidence in the company. Overall, I remain bullish on the stock and believe that the company has what it takes to sustain their recent momentum. Want More Great Investing Ideas? The Best of StockNews 2 Step Process to Sell @ Market Top in September 9 “BUY THE DIP” Growth Stocks for 2020 IIPR shares were trading at $122.78 per share on Wednesday afternoon, down $0.51 (-0.41%). Year-to-date, IIPR has gained 65.83%, versus a 9.00% rise in the benchmark S&P 500 index during the same period."}]}