{"article": [{"url": "https://stocknews.com/news/spy-inx-dia-iwm-qqq-how-to-trade-this-stock-bubble/", "published": 1596629300.0, "headline": "How to Trade THIS Stock Bubble?", "body": "(Please enjoy this updated version of this week’s commentary from the Reitmeister Total Return newsletter). Before we tackle the topic of a possible breakout above 3,300 we need to talk about yesterday’s Members Only webinar. We had another great turnout as we covered topics like: * Why not last 3+ years like late 1990’s? 7 Best ETFs for the NEXT Bull Market* What will bring this bubble this bubble to an end? And likely when? * Presidential Election pattern a negative for stocks * Delayed election results a serious concern which could cause MARKET MAYHEM * Portfolio position review…insights on all 11 of our holdings. * Q&A session covering everything about a dozen additional topics that you will be interested in knowing as well. Certainly watch it if you have not already. And certainly put on the calendar to join us for this monthly call going forward as we have it the first Monday of the month @ 2pm ET. Watch It Now! Because of all the detail put into the webinar yesterday there is no need to rehash what has already been said. This allows us to focus on today’s topic of the likelihood of a breakout above 3,300. Today’s last second surge to 3,306 is far from proof that a breakout is in hand. That is because we have seen many such attempts foiled just one or two sessions later with stocks tumbling back below. Now I will share with you the most likely scenario of what happens now and our corresponding trading strategy. But before I do that, I want to remind everybody the following. First, we are in the midst of a stock bubble with tech stocks being the main beneficiary. Second, that the bear market is not over. It is just hibernating til this bubble has burst and people wake up to the unfortunate reality of the still horrible recession unfolding before us. Again, if it wasn’t horrible, then why has the Government spent 5X more in stimulus than during the Great Recession? And yes, they are on the verge of throwing even more money out of a helicopter into the economy. OK, now that we have these disclaimers properly in place, here is the most probable outcome for the market… Breakout Now Racing Towards All Time Highs GDP declined -32% last quarter and the market raced higher. Q2 Earnings Season showed a 35% drop in corporate earnings and the market raced higher. Coronavirus cases DOUBLED and, you guessed it, the market raced higher. This disconnect from economic reality has all the markings of a stock bubble. So why should the music stop at 3,300? I sense that investors want to touch the all-time high at 3,393 the same way a young child needs to touch stove to learn an important life lesson. Just no amount of lecturing from the adults in the room can prevent it from happening. I believe the timing of this flirtation with the all time highs in mid to late August concurs well with the idea that September is historically the worst month of the year for stocks. And that is all the more true during Presidential Election years as we have now. I discussed the hurdle of the Presidential Election cycle 17 minutes and 30 seconds into yesterday’s webinar. Plus the unique negative twist to this year’s election that comes from all the write in ballots thanks to the Coronavirus and how that may call the election results into question. Indeed that would be a disaster for stocks awaiting final results. Back to the main point, maybe Wednesday or maybe shortly thereafter I suspect the market will break above 3,300 on its way to touch the all time highs. So investors should lean into this with a bit more of long exposure. The most important this is to remember this is very TEMPORARY. Go back to the earlier disclaimer section where we talked about this being a bubble with the bear market’s return at some future date. I believe that will be in September/October. So lean into the bubble as long as you are willing to quickly take your chips off the table and get more defensive. For Reitmeister Total Return members we have the right long positions already on board which is why we keep outperforming the market the last couple months. So the other thing to consider is a move to lighten up our inverse ETF positions for the moment and then reload when the market is more ready to admit to the bearish elements. (We cover this topic more in the Portfolio Review section below). Yes, it is possible that 3,300 does become resistance for a while longer. Or retreat back to 3,200 and then make another breakout attempt. Or even in a surprise move that the bear market could return right here…right now. But with a bubble as we have now, investors just don’t see any negative ramifications to just keep pressing on the gas pedal. And that is why at this stage, only 3% below the all-time highs, that we will likely press up to that level before the bubble bursts and investment sanity is restored. And yes, by investment sanity I mean that traditionally bear markets last much longer because of how long it takes to unwind the pain of a recession. And with that is a repricing of stocks. To believe that the worst economic event in our lifetimes only resulted in a 3 week bear market when the average bear is 13 months long is absolutely fanciful and borderline insane. Aka…the markings of a bubble. The main question at this time is WHEN is the bubble ready to burst. Again, I believe that is September/October because that is when I suspect that this modest bounce in economic data rolls over and goes quite negative once again. Plus that is when we will be faced with the unknowns of the Presidential Election which usually lops 5-10% off stock prices. Portfolio Update Another impressive week for our portfolio as we wound up in the plus column all five days for a total return of +2.2%. Today was one of the more impressive sessions as RTR gained +0.89% vs. +0.36% for the S&P. (Review of the 11 stock and ETF recommendation in the portfolio reserved for Reitmeister Total Return subscribers). What to Do Next? I know its crazy out there. And I am trying my best to help investors make sense and profit from the situation. The best way for me to do that is give you 30 days access to the Reitmeister Total Return. This is my newsletter service where I share more frequent commentaries on the market outlook, trading strategy, and yes, a portfolio of hand selected stocks and ETFs to produce profits whether we have a bull…a bear…or anywhere in between. And right now I continue to strongly believe bear makes a lot more sense than bull as the year progresses. Yet at the same time one has to give a nod to the bubble that is occurring for a select group of stocks. The solution is a unique portfolio I have constructed that provides protection against the bear when it reawakens from hibernation. While at the same time leans into the stocks that are benefiting the most from the current bubble. That explains how we continue to top the market at this time. Just click the link below to see all 11 stocks and ETFs in this uniquely successful portfolio. Plus get ongoing commentary and trades to adjust your strategy as 2020 continues to the wildest market in history. Gladly it can be tamed. About Reitmeister Total Return newsletter & 30 Day Trial Wishing you a world of investment success! Steve Reitmeister …but everyone calls me Reity (pronounced “Righty”) CEO, Stock News Network and Editor, Reitmeister Total Return SPY shares were trading at $331.88 per share on Wednesday afternoon, up $1.82 (+0.55%). Year-to-date, SPY has gained 4.18%, versus a % rise in the benchmark S&P 500 index during the same period."}]}