{"article": [{"url": "https://stocknews.com/news/ccl-cuk-rcl-nclh-why-cruise-stocks-are-getting-crushed-again/", "published": 1596024500.0, "headline": "Why Cruise Stocks Are Getting CRUSHED Again", "body": "Over the past six weeks, cruise stocks have given back a good chunk of their gains off the bottom. Carnival Cruises (CCL) is down 45%, Norweigan Cruise Lines (NCLH) is down 50.5%, and Royal Caribbean (RCL) is down 34.8%. Below is a four-month chart of CCL which shows its recovery off its lows, and the stock’s steady descent lower. 9 \"BUY THE DIP\" Growth Stocks For 2020(source: stockcharts.com) Cruise stocks are at the intersection of several, negative trends. The coronavirus is decimating the travel industry. The ports, where cruises take-off from, have become areas where the virus has hit hardest. Cruise ships are already known to be vulnerable to disease outbreaks due to a ship’s close quarters and ventilation system. In March, the Diamond Princess experienced a coronavirus outbreak. 712 out of 3,711 passengers and crew were infected with 14 people dying. The ship was quarantined for a month with passengers on board, and they were subject to additional quarantines after they disembarked. Recent Developments Due to these factors, the date from which cruising can resume keeps being pushed back. Currently, the CDC has ordered that no cruises are allowed to set sail until September 30 given the difficulties to safely operate due to the pandemic. Early-June marked peak optimism for hopes that the worst was behind us, and the economy would be able to reopen. Spiking case counts in many parts of the country have put that notion to rest. The first wave peaked at around 30,000 cases per day in April and fell to around 15,000 in early-June. As states began to reopen, case counts have increased to over 70,000 per day. Cruise Cancellations In response to this, cruise operators have aggressively cut costs and focused on ensuring there is adequate liquidity to survive the duration of the pandemic. They are basically in a situation, where they will have no revenues, for an extended period. To prepare for this, they have laid-off workers, sold ships, and issued debt and equity. Additionally, they are investing in refitting ships to ensure that “social distancing” protocols can be maintained, upping cleaning standards, and working with health experts on developing testing capabilities. All of these measures are going to eat away at future margins. It means that more space will have to be made for crew, and fewer passengers will board each ship. And, it assumes that the health situation will improve enough to allow for the resumption of cruising, and passengers will feel safe enough to board cruise ships. The Cost of Survival In some way, the situation is analogous to financial stocks following the Great Recession. These stocks had to issue tons of equity and debt to survive the crisis. There was also increased regulation which meant that they were constrained when it came to taking risks and generating profits. As a result, they underperformed for most of the ensuing bull market. For example, below is a 14-year, monthly chart of Citigroup (C) which shows that the stock remains almost 90% off its previous, bull market peak, while the S&P 500 is more than 100% higher. (source: stockcharts.com) A similar outcome is likely for cruise stocks. Their debt loads are higher, and share count has increased which means earnings per share would be less even if operations and bookings go back to normal. To win back the public’s trust and prevent outbreaks, they are going to have to institute protocols like rapid testing and fewer people on board which will translate into decreased revenues. Of course, cruise companies are more focused on survival rather than future profitability, but investors should be aware that their future earnings power is being compromised by the steps, they are taking to ensure survival. Want More Great Investing Ideas? 9 “BUY THE DIP” Growth Stocks for 2020 Newly REVISED 2020 Stock Market Outlook 7 “Safe-Haven” Dividend Stocks for Turbulent Times CCL shares rose $0.11 (+0.77%) in premarket trading Wednesday. Year-to-date, CCL has declined -71.24%, versus a 1.14% rise in the benchmark S&P 500 index during the same period."}]}