{"article": [{"url": "https://stocknews.com/news/crsp-chart-of-the-day-a-rectangle-pattern-develops-in-crispr/", "published": 1597406900.0, "headline": "Chart of the Day: A Rectangle Pattern Develops in CRISPR Therapeutics (CRSP)", "body": "CRISPR Therapeutics (CRSP) is trading in a horizontal channel, also known as a rectangle pattern, and a significant move in the stock is expected soon. CRSP is a gene-editing company that is engaged in the development of CRISPR/Cas9-based therapeutics. CRISPR/Cas9 is a technology that allows for precise, directed changes to genomic DNA. This technology that can repair defective genetic material has game-changing potential. The lead candidate in its pipeline is CTX001, which is an investigational ex vivo CRISPR gene-edited therapy currently being developed for treating TDT and severe SCD. Take a look at the 1-year chart of CRSP below with added notations: 7 \"SAFE HAVEN\" Dividend Stocks for Turbulent Times Chart of CRSP provided by TradingView For the past month, CRSP has been in a sideways trading range. While in the range, the stock has formed a key resistance at $97 (red), and an important level of support at $84 (green). The possible long positions on the stock would be on a breakout above $97. The ideal short opportunity would be on a breakdown below $84. Want to Discover More Great Trades? I have explored virtually every flavor of technical analysis and chart pattern known to mankind. The sad fact is that the vast majority of them don’t work at all. That is why I recently put together this presentation to help investors focus on the only 5 chart patterns that matter…the ones that lead to the most timely and profitable stock trades. Click below to learn these patterns and how to quickly find the 5 to 7 best trades today. 5 WINNING Stock Chart Patterns Have a good trading day! Good luck! Christian Tharp, CMT @cmtstockcoach CRSP shares were trading at $89.67 per share on Friday morning, down $2.07 (-2.26%). Year-to-date, CRSP has gained 47.23%, versus a 5.69% rise in the benchmark S&P 500 index during the same period."}]}