{"article": [{"url": "https://stocknews.com/news/tsla-bdx-betting-against-tesla-has-failed-and-failed-and-failed-again/", "published": 1594210100.0, "headline": "Betting Against Tesla Has Failed and Failed and Failed Again", "body": "Tesla (TSLA) Last Sunday, TSLA CEO Elon Musk tweeted out the message, “Limited edition short shorts now available,” with a picture of red satin shorts. Ouch! 9 \"BUY THE DIP\" Growth Stocks For 2020This was classic Elon, and I mean that for good and for bad. The message was an obvious joke at the expense of Tesla “shorts,” meaning those who had bet against Tesla. Braggadocio or good marketing? Or maybe both. It’s true that Tesla’s stock has rallied explosively. I think of the famous quote attributed to Dizzy Dean: “it ain’t bragging if you can do it.” And done it Musk has. Can you blame Elon for being a little cocky? After all, Tesla just passed Toyota to become the most valuable car company in the world. All the while, market experts have predicted that Tesla’s stock was about to plunge in price. Heck, even Musk said the shares were too high. In May, Musk tweeted that Tesla’s “price is too high imo [in my opinion].” The next day, Tesla dropped 11%, or $16 billion. In a little over a year, shares of Tesla are up 617%. Indeed, betting against Elon has not worked out well. In a recent five-day run, the shares vaulted nearly 40%. Check out the chart: I’ll let you in on a little secret. The reason Wall Street doesn’t like Elon—and believe me, they don’t—isn’t that he makes money. The Street has no problem with that. Nor is Wall Street bothered by his, shall we say, less-than-formal attitude toward the truth. Nope, Wall Street doesn’t care about that either. What Wall Street really doesn’t like is the contempt he has for them. He makes no secret of it. They’d much prefer Musk stay quiet and play by Wall Street’s rules. Instead, Musk plays by his own, and that can get him into trouble. There are plenty of filthy-rich tycoons would don’t much care for Wall Street, but they keep it quiet. I doubt Bezos or Zuckerberg like Wall Street, but they don’t make their contempt front and center the way Musk does. Becton, Dickinson: The Anti-Tesla Becton, Dickinson (BDX) I’ve long been an admirer of Becton, Dickinson (BDX) which I think of being the anti-Tesla. It’s a medical technology company that quietly goes about its business. The reason I say it’s the anti-Tesla is that it quietly and consistently rakes in a good-sized profit without drawing much attention toward itself. This is probably the last company whose stock would be thrashed about in a single day due to a tweet from the CEO. Becton’s last earnings report in May was quite good. The company made $2.55 per share for Q1 which beat expectations by 19 cents per share. The shares gapped up on the news. But the best news lately is that the U.S. Food and Drug Administration just approved for emergency use Becton’s COVID-19 antigen test. The test can produce results in 15 minutes. This is a game-changer. Don’t take my word for it. Dave Hickey, president of Integrated Diagnostic Solutions for BD, calls it “a game-changer for frontline health care workers and their patients.” The diagnostic is available on Becton’s BD Veritor™ System, which is slightly larger than a cell phone. Becton will begin shipping the new test this week. The company expects to ramp-up capacity to two million tests per week by the end of September. Becton is due to report its Q2 earnings in early August. Look for another solid report… and expect them to be humble about it. Want More Great Investing Ideas? Top Dividend Stock to Own! Download Free Report Today Buy These 3 High-Yield Dividend Stocks All Under $15 Buy and Hold These 3 Dividend Stocks Forever TSLA shares rose $9.12 (+0.67%) in after-hours trading Wednesday. Year-to-date, TSLA has gained 226.51%, versus a -0.75% rise in the benchmark S&P 500 index during the same period."}]}