{"article": [{"url": "https://stocknews.com/news/snap-himx-vuzi-3-vr-and-ar-stocks-that-have-major-potential/", "published": 1594210100.0, "headline": "3 VR and AR Stocks With Major Potential", "body": "The future is finally here. We have come a long way from Nintendo’s Virtual Boy console released in 1995. Though Virtual Boy was a miserable failure, the next generation of VR virtual reality (VR) and augmented reality (AR) is likely to dominate the future of gaming. It’s likely to impact learning, shopping, and home-based experiences in all sorts of industries. The transition toward VR and AR has the potential to affect entertainment, recreation, and all facets of life the same way that smartphones and the Internet have done. Three companies that are on the leading edge of this movement are Snap (SNAP), Himax Technologies (HIMX), and Vuzix Corporation (VUZI). Snap Inc. (SNAP) 9 \"BUY THE DIP\" Growth Stocks For 2020If you are over the age of 40, there is a good chance you haven’t used SNAP. And if you’re under the age of 20, you are likely obsessed with SNAP. Snapchat is a social media app, that empowers users to transmit information and images with a self-destruct feature. These temporary messages disappear after a certain amount of time passes following transmission. From these origins, SNAP has created a platform with hundreds of millions of users that spend hours on its site. The company is ambitious and is seeking ways to keep users on its service as long as possible. One way it’s doing so is by building mini-apps on its platform that allow for all types of activities like banking, buying, and selling. In that way, the company is following WeChat’s path which has a dominant position in messaging in China. However, SNAP is also building out its augmented reality. Its fun filters enhance selfies and other images with entertaining aesthetic alterations. SNAP’s Snapchat Spectacles make extensive use of augmented reality technology. So far, they have not been too popular, yet the platform is open to developers who can use the technology that will transform the technology in unpredictable ways. Similar to how smartphone app developers made smartphones even more useful and popular. The company’s saving grace is its 20% year-over-year spike in daily active users, and three-quarters of SNAP daily users use the company’s augmented reality features daily. This means SNAP’s audience is incredibly immersed in its product, and the company has a headstart on its competitors. SNAP’s POWR Ratings are exemplary with a Strong Buy and an “A” in all POWR Components. Additionally, since the March low, the company’s stock has been performing exceptionally well with it more than tripling and breaking out to new, 52-week highs in recent days. Himax Technologies (HIMX) Virtual reality headsets only work if they block out external light, creating the impression that the game player is truly inhabiting a virtual world. HIMX makes the parts necessary to block out exterior light, ensuring the virtual reality headset remains firmly in place for the ultimate escape. Aside from VR components, HIMX also makes parts for flat panel displays. HIMX recently popped as a result of a deal with Google. The POWR Ratings show HIMX has a neutral rating, highlighted by an “A” for Industry Rank and a “B” for Trade Grade and Buy & Hold Grade. The average analyst price target for HIMX is $4.50 which is 20% above its current price. HIMX is a high-risk way to get exposure to VR. If you strongly believe virtual reality will explode in popularity in the next couple of years, you should consider establishing a position. Vuzix Corporation (VUZI) Vuzix is attempting to build a product that is similar to Google Glass but has features that are more geared towards business, government, and defense industries. The POWR Ratings show VUZI has an overall rating of Buy with a “B” in for Trade Grade, Buy & Hold Grade, and Industry Rank. Analysts have a price target of $3.50 for VUZI. VUZI’s stock recently spiked following an announcement highlighting the delivery of a custom optics engine to a US defense contractor. The pressing question is whether this technology can be successfully repurposed for industrial, defense, and consumer use. It will take several years for the technology to reach an affordable price point and meet user expectations, but these buyers are less price-sensitive than consumers. However, if VUZI accomplishes this feat, the stock should break through the $5 barrier and possibly attract suitors as a potential takeover candidate. Want More Great Investing Ideas? 9 “BUY THE DIP” Growth Stocks for 2020 Is the Bull S#*t Rally FINALLY Over? 7 “Safe-Haven” Dividend Stocks for Turbulent Times Top 3 Investing Strategies for 2020 SNAP shares . Year-to-date, SNAP has gained 61.73%, versus a -0.75% rise in the benchmark S&P 500 index during the same period."}]}