{"article": [{"url": "https://stocknews.com/news/ftnt-traders-should-prepare-for-a-strong-move-in-shares-of/", "published": 1601035700.0, "headline": "Traders Should Prepare for a Strong Move in Shares of Fortinet", "body": "Shares of Fortinet (FTNT) have been in a sideways trading range and a rectangle pattern has emerged. FTNT is a cybersecurity vendor that sells products, support, and services to small and midsize businesses, enterprises, and government entities. The company is benefiting from rising demand in security and networking products due to the coronavirus forcing the workforce to work remotely. It is also benefiting from strong growth in its Fortinet Security Fabric, cloud and SD-WAN offerings. Take a look at the 1-year chart of FTNT below with added notations: 7 Best ETFs for the NEXT Bull Market Chart of FTNT provided by TradingView After trending lower from its July peak, FTNT has fallen into a relatively tight, sideways trading range. While in the range, the stock has formed a resistance level at $120 (red), and a level of support at $112.5 (green), thus creating a rectangle pattern. At some point, the stock will have to either break the $120 resistance or the $112.5 support. The possible long position in the stock would be on a breakout above $120. The ideal short opportunity would be on a break below $112.50. Want to See My Favorite Stock Trades Today? The process I use to select these “Chart of the Day” stocks is just the starting point for what I put in my private portfolio. There I take a deeper dive into the stock market outlook. And determine which sectors are likely to outperform. Then and only then to do I pull the trigger on the most timely trades. If you would like to be notified of my best trades, then just click on the link below to get started! See Christian Tharp’s Top Stock Picks Now Have a good trading day! Christian Tharp, CMT @cmtstockcoach FTNT shares were trading at $116.40 per share on Friday morning, up $0.90 (+0.78%). Year-to-date, FTNT has gained 9.03%, versus a 2.26% rise in the benchmark S&P 500 index during the same period."}]}