{"article": [{"url": "https://stocknews.com/news/tsla-baba-nvax-tme-4-stocks-that-rallied-more-than-20-last-week/", "published": 1594642100.0, "headline": "4 Stocks That RALLIED More Than 20% Last Week", "body": "It’s certainly an unusual time for the stock market. It’s no longer surprising to see stocks with $100 billion + market caps making 20% moves in a week. Many are comparing the market action to that of the dot-com bubble. There certainly are many similarities including huge gains for speculative stocks. Disinterest and depressed valuations for industries like energy and financials. 9 \"BUY THE DIP\" Growth Stocks For 2020Most of all, several cult stocks seem to be defying all traditional valuation metrics to keep powering higher. These stocks have generated a tremendous amount of interest and excitement among traders. Only time will tell whether this is the beginning of a frenzy or closer to the end. Such price action typically marks the beginning or end of a trend. Here are 4 stocks which gained 20% over the past week: Tesla, Inc. (TSLA) TSLA has been on a roll, with the stock gaining 23.6% last week. Two major catalysts for the stock over the past week were its inclusion in the S&P 500 (SPY), and CEO Elon Musk’s tweet that the company may start building a small, hatchback version for the European market. Of course, the stock has been a momentum darling that attracts traders as well. It’s been consistently rallying since hitting the year-to-date low level in mid-March during the market crash. TSLA has gained more than 300% since its lows. The company announced more than 90,000 deliveries in the second quarter, which significantly beat market expectations. This makes it one of the few automakers in growth mode as manufacturers like Fiat Chrysler (FCAU), General Motors (GM) and Toyota Motor (TM) had a 30% drop in sales. Considering TSLA’s leading position in electric vehicles, self-driving technology, and batteries, once could reasonably expect this momentum to continue. So, even if valuation looks stretched, the stock still has upside given its explosive growth and leading positions in self-driving technology and batteries. How does TSLA stack up for the POWR Ratings? A for Trade Grade A for Buy & Hold Grade B for Industry Rank A for Peer Grade A for overall POWR Rating You can’t ask for better. The stock is also ranked #1 out of 27 stocks in the Auto and Vehicle Manufacturers Industry. Alibaba Group Holding (BABA) BABA was another big winner of the past week, as it broke out to new, all-time highs. BABA increased by about 20% from last week’s closing price of $223.60. The stock has gained more than 40% since the lows during the market crash in March. The company’s e-commerce business continues to strengthen. It’s also become dominant in the cloud computing category. These factors should translate into further momentum in the stock. It’s no surprise that BABA is rated a “Strong Buy” in our POWR Ratings system. It also has an “A” for Trade Grade, Buy & Hold Grade, Peer, and Industry Rank. In the 115-stock China group, it is ranked #1. Novavax, Inc. (NVAX) NVAX made headlines last week as the company announced that it has been awarded $1.6 billion by the federal government to complete late-stage clinical development and deliver 100 million doses of its COVID-19 vaccine candidate NVX‑CoV2373 as early as late 2020. Investors’ optimism around a potential vaccine from the company helped the stock jump more than 17% on the day the news was announced. Hitting the high level on July 7th indicates a more than 35% gain from last week’s closing price. Even though the stock has lost some value since then as investors take profits, the stock has more upside if its vaccine proves to be successful. Analysts are bullish about the prospects of NVAX and the average price target of $101.20 is 7% above its current price. NVAX is rated a “Buy” in our POWR Ratings system, consistent with its recent momentum. It also has an “A” for Trade Grade, Peer, and Industry Rank, and a “C” in Buy & Hold. Within the Biotech group, it’s ranked #34 out of 338 stocks. Tencent Music Entertainment Group (TME) TME provides one-stop music and entertainment services for smart devices. The stock has gained about 28% since the company announced a partnership with CoMix Wave Films, under which the original soundtrack of seventeen popular animated films will be available on TME’s music platforms on July 2nd. Further, in the first quarter of 2020, the company saw a 50% year over year increase in paid subscribers to 42.7 million. TME also witnessed a 13.3% year-over-year increase in its average revenue per paid subscriber during the quarter. This combination of increasing subscribers and increasing revenue per subscriber is attractive to investors. As a result, the stock has gained more than 80% since hitting its all-time low of $9.22 in March. Analysts have provided an average price target of $18.25 for the stock, which is 6.8% from current levels. The rising demand for TME’s platforms and momentum in its stock price is reflected in its POWR Ratings. TIME is rated a “Strong Buy” with an “A” for Trade Grade, Peer, and Buy & Hold, and a “C” in Industry Rank. Want More Great Investing Ideas? 9 “BUY THE DIP” Growth Stocks for 2020 Top 5 WINNING Stock Chart Patterns 7 “Safe-Haven” Dividend Stocks for Turbulent Times TSLA shares fell $7.06 (-0.47%) in after-hours trading Monday. Year-to-date, TSLA has gained 257.87%, versus a -1.17% rise in the benchmark S&P 500 index during the same period."}]}