{"article": [{"url": "https://stocknews.com/news/unh-hum-moh-mgln-xlv-4-health-care-services-stocks-trading-near-52-week-highs/", "published": 1594642100.0, "headline": "4 Healthcare Stocks Near 52-Week Highs", "body": "Despite the Covid-19 crisis, healthcare companies have seen an impressive rebound in their stock prices. Since the year-to-date low on the stock market on March 23rd, the Health Care Select Sector SPDR ETF (XLV) is trading about 27% higher. Many healthcare stocks look poised to continue pushing towards the upside, as the stock market continues to rally. Here are 4 healthcare stocks to consider adding to your portfolio in 2020: 9 \"BUY THE DIP\" Growth Stocks For 2020Humana Inc. (HUM) Humana is one the largest health insurers in the US. The company’s Medicare business has been doing well and HUM expects an increase of 90,000 members in 2020. HUM is well positioned for long term growth because of some of its buyouts such as Your Home Advantage, Curo and Family Physician group. HUM recently announced a Covid-19 home testing program via LabCorps for its members and has also partnered with Walmart and Quest Diagnostics to increase testing sites. In addition, HUM’s determination to take care of its members through waivers and relief measures could increase customer confidence in its healthcare system. HUM has a strong balance sheet and has been gradually increasing its dividend over the years. Currently, HUM pays an annual dividend of $2.50. In the first quarter, the company’s adjusted earnings per share and revenue increased 20.5% and 18% year over year, respectively. The consensus EPS estimate for the quarter ended June 2020 is $10.11, which indicates an increase of 67.1% from its year-ago number. Also, HUM’s revenue for the quarter is expected to increase 14.7%. The expectations show analysts’ optimism and the same should translate into solid price movement ahead of its earnings release. How does HUM stack up for the POWR Ratings? A for Trade Grade B for Buy & Hold Grade A for Peer Grade B for Industry Rank A for Overall POWR Rating You can’t ask for better. Within the Medical-Health Insurance group, it’s ranked #1 out of 9 stocks. UnitedHealth Group Incorporated (UNH) This diversified health care company operates in two segments: UnitedHealthCare, which provides healthcare coverage, and Optum which focuses on information and technology health services. The company mobilized all its resources for the health and support of its patients, members and partners amid this pandemic. Moreover, UNH recently announced a new therapy called Level2 which integrates digital technology with human health support. It offers personalized support to type2 diabetes patients and predicts potential Covid-19 infections. UNH developed a new FDA approved Covid-19 swab protocol which has improved efficiency and safety while testing. UNH hit its 52-week low of $187.72 in March due to the coronavirus-driven market crash. However, since then the stock has recovered more than 40%. UNH’s return on equity is 23.6% which is a testament to its strong margin profile. The company increased its quarterly dividend by 15.7% in the second quarter. UNH has an annual dividend of $5 and a dividend yield of 1.72%. In the first quarter, revenue increased by 6.8% year-over-year and the reported EPS surpassed the consensus estimate by 2.5%. In fact, the company surpassed the consensus EPS estimates in each of the trailing four quarters. The stock looks pretty attractive ahead of its second quarter earnings release, which is scheduled for July 15th. The market expects ESP and revenue to grow 43.9% and 4.7%, respectively. This optimism should help the stock move higher. UNH is rated “Buy” in our POWR Ratings system. It also has an “A” for Trade Grade and an “B” for Buy & Hold Grade, Peer Rank, and Industry Rank. If that’s not enough, it’s ranked #2 out of 9 stocks in the Medical-Health Insurance industry. Molina Healthcare Inc. (MOH) MOH is a California based Fortune 500 company that provides health insurance services under government programs. At the end of April, MOH entered an agreement worth $820 million to acquire Magellan Complete Care which is one of the business lines of Magellan Health. With the help of Magellan Complete Care, MOH intends to serve more than 3.6 million members in government sponsored healthcare programs across eighteen states. During these uncertain times, while unemployment has been increasing, MOH could get increased member enrollments in its Medicaid business as the health care plans involve coverage to low-income groups. MOH also acquired assets of YourCare Health plan Inc. recently, which will help increase its involvement in the Medicaid market. In the first quarter, premium revenue increased by 8.9% year over year and the medical care ratio increased to 86.3% as compared to 85.3% in the previous year. The stock gained more than 55% since hitting its year-to-date low in March due to the covid-19 market-induced crash. MOH has an impressive earnings outlook as well. The consensus EPS estimate for the second quarter of $4.33 indicates a 39.2% year-over-year increase. Its revenue is also expected to increase 11.9% year over year. MOH’s strong fundamentals are reflected in its POWR Ratings, it has a “Buy” rating with an “A” in Trade Grade and a “B” in Buy & Hold Grade, Peer Grade, and Industry Rank. Within the Medical-Health Insurance group, it’s ranked #3 out of 33 stocks. Magellan Health, Inc. (MGLN) MGLN is a Phoenix based Fortune 500 healthcare management company focused on managed healthcare, pharmacy management and specialty solutions. MGLN soared more than 127% from its 52-week low of $30.60 hit in March due to the market sell-off. MGLN’s sale of Magellan Complete Care to Molina would help the company focus on its other businesses and improve its services. Molina has also entered into a commercial agreement for a few other services with MGLN. In the first quarter, there was a 3.2% year-over-year increase in total net revenue and the reported EPS was 59.7% higher than the consensus estimate. The average analyst price target for MGLN is $85 which represents a potential upside of 20.3%. The consensus EPS estimate for MGLN represents a year-over-year increase of 14%. This is encouraging enough for investors to bet on the stock ahead of its earnings release for the quarter ended June 2020. MGLN’s POWR Ratings reflect this promising outlook. It has an overall rating of “Buy” with an “A” for Trade Grade and a “B” for Buy & Hold Grade. Among the 9 stocks in the Medical-Health Insurance group, it’s ranked #4. Want More Great Investing Ideas? 9 “BUY THE DIP” Growth Stocks for 2020 Top 5 WINNING Stock Chart Patterns 7 “Safe-Haven” Dividend Stocks for Turbulent Times UNH shares were trading at $302.92 per share on Monday afternoon, up $11.69 (+4.01%). Year-to-date, UNH has gained 3.93%, versus a 0.38% rise in the benchmark S&P 500 index during the same period."}]}