{"article": [{"url": "https://stocknews.com/news/wen-is-wendys-ready-to-breakout/", "published": 1602158900.0, "headline": "Is Wendy’s Ready to Breakout?", "body": "Shares of Wendy’s (WEN) have been consolidating for a number of months and a resistance level has formed. If shares were to exceed this level, a breakout should occur. WEN is the world’s third-largest quick-service restaurant. The company derives revenues from two sources: sales at company-operated restaurants and franchise-related revenues. WEN has been benefiting from its transition to a franchised business model. As of the second quarter, WEN had more than 6,800 franchisees. While sales have been slowed by the coronavirus pandemic, the company has been benefiting from international expansion and a re-imaging of its restaurants based on its Image Activation goal to improve customer service. Expansion into emerging markets is poised to drive future growth. 9 \"BUY THE DIP\" Growth Stocks For 2020From a fundamental perspective, the company’s high debt is a concern. At the end of the last quarter, long-term debt stood at $2.2 billion and WEN’s debt to equity ratio currently sits at a high 7.9. WEN has a high return on equity, but a low profit margin, which is inline with its debt profile. The stock is trading at a fairly high P/E of 48.5, but that is in line with the industry average. Growth has certainly been slowed with the virus, as both sales and earnings growth fell over the past year. Earnings are expected to grow 27.8% next year, with the hope that that the pandemic dies down leading to more foot traffic. WEN has shown strong near-term momentum rising 13.6% since September 21st. This has contributed to a “Strong Buy” rating in our POWR Ratings system, with a grade of “A” across the board in the four components that make up the POWR Ratings. Will this momentum help drive WEN’s stock higher? Let’s take a look at the 1-year chart of WEN below with added notations: Chart of WEN provided by TradingView After hitting a high of $24 in February, WEN plunged due to the coronavirus. HOwever, the stock had a “V” shape recover and has been testing the $24 level for the past number of months, creating a resistance level (red). If WEN is able to exceed the resistance level and close above $24, traders can expect a breakout in the stock Want to See My Favorite Stock Trades Today? The process I use to select these “Chart of the Day” stocks is just the starting point for what I put in my private portfolio. There I take a deeper dive into the stock market outlook. And determine which sectors are likely to outperform. Then and only then to do I pull the trigger on the most timely trades. If you would like to be notified of my best trades, then just click on the link below to get started! See Christian Tharp’s Top Stock Picks Now Have a good trading day! Christian Tharp, CMT @cmtstockcoach WEN shares were trading at $23.49 per share on Thursday morning, up $0.20 (+0.86%). Year-to-date, WEN has gained 6.90%, versus a 8.10% rise in the benchmark S&P 500 index during the same period."}]}