{"article": [{"url": "https://stocknews.com/news/apam-ay-bgs-3-top-performing-stocks-with-high-dividend-yields/", "published": 1598962100.0, "headline": "3 TOP PERFORMING Stocks With High Dividend Yields", "body": "The stock market is making new highs, yet the market is as risky as ever. Valuations are at record levels, the upcoming election tends to lead to whipsaw action, September is seasonally weak, the market is overbought, and Congress’ inability to reach a deal on another stimulus package are some of the know risks. Dependable and high-yielding dividend stocks are an attractive proposition for investors, given these conditions. Market volatility already looks like it has bottomed which is often a leading indicator of equity weakness. The CBOE Volatility Index (VIX), which is considered the market’s fear gauge and represents 30-day forward-looking volatility, declined more than 34% over the past six months, it’s up more than 18% over the last five trading days. And, volatility tends to trend higher into the election. 7 \"SAFE HAVEN\" Dividend Stocks for Turbulent TimesInvestors can protect themselves from these risky by investing in companies with strong business growth drivers and steady dividends like Artisan Partners Asset Management Inc. (APAM), Atlantica Yield plc (AY), and B&G Foods, Inc. (BGS). Artisan Partners Asset Management Inc. (APAM) APAM is a global investment management firm that provides a broad range of high value-added investment strategies to sophisticated clients around the world. The stock has returned more than 70% since its March lows. APAM has an annual dividend of $2.68 which yields 6.92%. APAM declared a variable quarterly dividend of $0.67 per share of Class A common stock for the June 2020 quarter which is an increase of 9.8% over the earlier dividend amount. APAM expects to pay a quarterly dividend of approximately 80% of the cash it generates each quarter subject to board approval. Also, the board will consider paying a special dividend after the end of the year. If you care about predictable cash flow, note that APAM reports less variability in its free cash flow than 81.3% of the dividend stocks in the Stocknews.com universe. In the second quarter, APAM’s revenues increased by 1%, and net income increased by 6.7% year-over-year. Moreover, the company’s investment gains on seed investments were $6.6 million as compared to $2 million a year ago. As of July 31st, 2020, APAM’s asset under management totaled $127.8 billion. APAM’s consensus revenue estimate of $220.77 million for the quarter ending September 2020 indicates a year-over-year increase of 8.8%. Also, the market expects the company’s EPS to increase by 15.7% year over year to $0.81. APAM has an impressive earnings surprise history with the company beating the consensus EPS estimates in three of the trailing four quarters. How does APAM stack up for the POWR Ratings? A for Trade Grade A for Buy & Hold Grade A for Peer Grade B for Industry Rank A for Overall POWR Rating You can’t ask for better. The stock is also ranked #5 out of 45 stocks in the Asset Management industry. Atlantica Yield plc – Ordinary Shares (AY) AY is a sustainable infrastructure company that owns a diversified portfolio of contracted assets in the energy and environment sectors. AY has an annual dividend of $1.68 which yields 5.59%. AY declared a dividend of $0.42 per share on July 31st, 2020 which is an increase of 2.4% over the earlier dividend amount. AY’s free cash flow has been growing at a compound average annual rate of 123.6% over the past 4 years which is higher than 93.4% of current US-listed dividend stocks. AY has raised $489 million until July to fund new growth and in the first six months of 2020, its cash available for distribution increased by 2.9% compared to the prior-year period. AY has entered into a non-recourse, project debt financing for approximately €326 million in Helios 1/2, two solar plants with a total installed capacity of 100 MW which will bring an improvement in cost, tenor, and help the company diversify its financing resources. The market expects the company to report an EPS of $0.74 for the quarter ending September, which represents a 72.1% increase over the year-ago number. AY’s consensus revenue estimate of $303.34 million for the same quarter indicates a year-over-year increase of 3.4%. AY’s EPS is expected to grow 49.5% per annum in the next five years The stock has gained more than 40% since its March lows. It’s no surprise that AY is rated a “Strong Buy” in our POWR Ratings system. It also has a grade of “A” in Trade Grade, Buy & Hold Grade, and Peer Grade. B&G Foods, Inc. (BGS) B&G Foods manufactures, sells, and distributes shelf-stable food and household products in the United States, Canada, and Puerto Rico. The stock has returned more than 100% since its March lows. In the second quarter ended June 27th, BGS’s net sales increased 38.1%, adjusted earnings per share increased 86.8% and adjusted EBITDA increased 44.6% year-over-year. BGS has an annual dividend of $1.90 which yields 6.10%. The company declared a regular quarterly cash dividend of $0.475 per share on July 28th, 2020. This is the 64th consecutive quarterly dividend declared since the company’s IPO in October 2004. Free cash flow for BGS has a compound average growth rate of 57.4%, which is higher than 90% of stocks in our dividend set. Kenneth G. Romanzi, President and Chief Executive Officer of B&G Foods said, “During the second half of the year, we remain focused on working closely with our supply chain partners and our customers to ensure that we can continue to provide uninterrupted service and meet the increased demand resulting from the pandemic. At the same time, we will continue our new product innovation and other brand-building efforts as we look to turn some of this pandemic-related increase in demand into long-term growth opportunities for our brands.” The market expects the company to report an EPS of $0.65 for the quarter ending September, which represents a 20.4% increase over the year-ago number. BGS’s consensus revenue estimate of $456.9 million for the same quarter indicates a year-over-year increase of 12.5%. BGS’s EPS is expected to grow by 5.8% per annum in the next five years. BGS’s POWR Ratings reflect this promising outlook. It has an overall rating of “Strong Buy” with a grade of “A” in Trade Grade, Buy & Hold Grade, Peer Grade, and Industry Rank. Among the 57 stocks in the Food Makers industry, it’s ranked #15. Want More Great Investing Ideas? 7 Best ETFs for the NEXT Bull Market Beware Stocks in September? 9 “BUY THE DIP” Growth Stocks for 2020 APAM shares were trading at $39.16 per share on Tuesday afternoon, up $0.45 (+1.16%). Year-to-date, APAM has gained 30.53%, versus a 10.30% rise in the benchmark S&P 500 index during the same period."}]}