{"article": [{"url": "https://stocknews.com/news/w-home-hoft-3-furniture-stocks-benefiting-from-soaring-home-sales/", "published": 1598270900.0, "headline": "3 Furniture Stocks Benefiting from Soaring Home Sales", "body": "Mortgage interest rates are at record lows, and homes sell left and right even though unemployment is well above 10%. There is plenty of pent up demand for homes. The only question is how long this epic home sales run will continue. Even if the housing market cools down in the months ahead, furniture stocks will benefit as new homeowners buy couches, chairs, tables, nightstands, and more to fill their new digs. This means furniture stocks should be stable investments through the next year. The following furniture stocks are likely to increase in value in the next couple of quarters: Wayfair (W), At Home Group (HOME), and Hooker Furniture Corporation (HOFT). 9 \"BUY THE DIP\" Growth Stocks For 2020Wayfair (W) As the top online e-tailer of home goods products, W is worthy of every investor’s consideration. W sells both furniture and home décor. Aside from U.S. operations, W also conducts business in Germany, the United Kingdom, and Canada. W was priced at $27 on March 20. Today, a single share of W sells for $332. W’s winning ways are likely to continue as the red hot home market drives that many more new homeowners to W’s site for furniture, home décor, and additional niceties for living spaces. W will also benefit from the suburbanization trend as that many more people segue from urban centers to the spacious suburbs and rural areas. Suburban homes would look quite barren unless filled with the goods sold by W. W’s net revenue is up more than 80% in the prior quarter, hitting a whopping $4.3 billion. Even if traditional furniture showrooms reopen throughout the United States, W could continue to benefit as its website is always open. At Home Group (HOME) When it comes to home décor stocks, HOME is one of the best companies to own. HOME provides all sorts of home-related products, including furniture, housewares, rugs, mirrors, and more. HOME’s real estate strategy of opening stores with a little more than 105,000 square feet on average ensures that the company can keep 50,000 Stock Keeping Units (SKUs) available at all times. It is also particularly interesting to note that nearly three-quarters of HOME products are private labels, unbranded or created explicitly for HOME stores. The POWR Ratings show HOME is nearly flawless with A grades in each POWR Component category, but its Industry Rank of B. HOME is ranked 7th of 34 stocks in the Specialty Retailers segment. HOME’s forward P/E ratio is under 13, indicating the stock undervalued at its current trading price of $18.93. HOME’s comparable-store sales are up more than 40% on a year-over-year basis. Furthermore, HOME has a dozen more stores now than at this time last year. The company’s net sales are up 50% on a year-over-year basis. HOME could blast through its 52-week high of $19.79 as home sales continue to soar in the ensuing months. Hooker Furniture Corporation (HOFT) Furniture ranges from traditional chairs and couches, entertainment units, wall units, accent pieces, beds, dining room tables/chairs, and other types selling like hotcakes. HOFT makes and imports the metal, wood, and other materials necessary to make these pieces of furniture. HOFT has fantastic POWR Ratings grades with As in Trade Grade and Industry Rank, and a B for Buy & Hold Grade. Analysts have an average price target of $24. HOFT’s next two financial quarters could be stellar, possibly sending the stock back to its pre-COVID trading range of $24 to $26. Want More Great Investing Ideas? The Best of StockNews 2 Step Process to Sell @ Market Top in September 9 “BUY THE DIP” Growth Stocks for 2020 W shares were trading at $336.43 per share on Monday morning, down $4.23 (-1.24%). Year-to-date, W has gained 272.28%, versus a 7.30% rise in the benchmark S&P 500 index during the same period."}]}