{"article": [{"url": "https://stocknews.com/news/vz-pfe-mmm-3-strong-buy-dow-jones-dividend-stocks-yielding-3/", "published": 1599048500.0, "headline": "3 \"Strong Buy\" Dow Jones Dividend Stocks Yielding 3%", "body": "The Dow Jones Industrial Average (DJIA) is a price-weighted index that constitutes 30 blue-chip companies in the United States. While the stocks in the index have a long track record of outperformance, the overall index is underperforming the other major indexes — the S&P 500 and the Nasdaq Composite — so far this year. The DJIA’s almost flat year-to-date return compares to the Nasdaq Composite’s 31.2% return and the S&P 500’s 8.7% gain. The skyrocketing performance of some of the tech stocks have helped the S&P 500 and Nasdaq hit record highs in August. But the DJIA components, primarily major industrial and financial stocks, haven’t generated the same interest, as these industries have not capitalized on the pandemic as some of the major tech players. However, the DJIA has displayed a solid recovery since the market crash in mid-March and is close to showing a positive return year-to-date. If you want to benefit from the index’s revival, there are a number of stocks to choose from based on fundamental strength. But given the predictions of continued market and economic uncertainties, it would be a good idea to consider stocks that offer solid dividend income along with strong fundamentals. If the index fails to continue its recovery, then dividend stocks can at least help you generate a steady income. Verizon Communications Inc. (VZ), Pfizer, Inc. (PFE), and 3M Company (MMM) are three high dividend-paying DJIA stocks with solid fundamentals. 9 \"BUY THE DIP\" Growth Stocks For 2020Verizon Communications Inc. (VZ) VZ provides communications, information and entertainment products and services to consumers, businesses, and governmental agencies. Its segments include Wireless and Wireline. The company pays an annual dividend of $2.46, which yields 4.14%. It has a four-year average dividend yield of 4.67%. The company has been consistently increasing its dividend payout amount after its third quarter each year and has been uniformly paying quarterly dividends since becoming a public company in 1983. Over the past 10 years, the average dividend per share growth rate for VZ has been 3.4% per year. The most recent dividend declared by VZ was $0.615 for its second quarter that ended in June 2020. VZ generated a free cash flow of $10.2 billion in its last reported quarter, registering a 100.8% growth from the comparable quarter last year. The company also generated $14.7 billion cash flow from operating activities during the quarter, accounting for a 68% rise year-over-year. Revenue for the quarter increased 0.8% year-over-year to $132 billion, while net income grew 7.7% year-over-year to $19.3 billion. EPS for the quarter came in at $1.18, beating the consensus estimate by 2.6%. This also indicates a year-over-year increase of 19%. Moreover, with the next-gen B2B application and growing subscriber loyalty, the street expects EPS to grow 3.4% next year. The stock closed yesterday’s trading session at $59.16. It has already recovered more than 17.6% from its March low. How does VZ stack up for the POWR Ratings? A for Trade Grade A for Buy & Hold Grade A for Peer Grade A for Industry Rank A for Overall POWR Rating. You can’t ask for better. It is ranked #1 out of 24 stocks in the Telecom – Domestic industry. Pfizer, Inc. (PFE) PFE develops, manufactures, and sells healthcare products worldwide. Its COVID-19 vaccine candidate BNT162b2, which the company is developing in partnership with BioNTech (BNTX), has recently entered late-stage trials after experiencing positive early data. The company pays an annual dividend of $1.52, which translates into a yield of 4.12%. The company has a four-year average dividend yield of 3.78%. PFE has been reliably increasing its dividend payout amount during the first quarter each year and has been uniformly paying a quarterly dividend. Over the past five years, the average dividends per share growth rate for PFE was 6.7%. The most recent dividend declared by the company was $0.38 in July 2020. The company generated a free cash flow of $3.1 billion in the second quarter, a 52% increase year-over-year. It also reported free cash flow margin of 26%. Operating cash flow for the quarter stood $3.56 billion. It delivered a solid top-line of $11.8 billion with a 6% operational revenue growth from its Biopharma segment. The company reported a net income of $3.4 million and a 29% profit margin for the quarter. EPS for the quarter came in $0.78, beating the consensus estimate by 18.2%. Moreover, PFE has beaten EPS estimates in three of the trailing four quarters, which is impressive. The street anticipates EPS to grow 14% year-over-year next year, but the EPS could skyrocket if the company succeeds in the race to combat this devastating virus by developing an effective vaccine. It’s no surprise that PFE is rated a Buy in our POWR Ratings system. It also has a grade of A for Trade Grade, Peer Grade, and Industry Rank, and a B in Buy & Hold Grade. It is ranked #17 out of 231 stocks in the Medical – Pharmaceuticals industry. 3M Company (MMM) MMM manufactures products related to electronics, telecommunications, industrial, consumer and office, health care, safety, and other markets. It operates through four business segments – Safety and Industrial, Transportation and Electronics, Health Care, and Consumer. MMM pays an annual dividend of $5.88, which translates into a yield of 3.57%. The company has a four-year average dividend yield of 2.85%. The company has been constantly increasing its dividend payout amount during the first quarter each year and has been consistently paying quarterly dividends since becoming a public company in 1983. Over the past 10 years, the average dividend per share growth rate for MMM was 10.9%. The most recent dividend declared by 3M was $1.47 for its third quarter ending in September 2020. This is an increase of 2% year-over-year. Free cash flow for the firm increased 23.5% year-over-year to $1.5 billion in the last reported quarter. The company also generated $1.9 billion in cash flow from operations, a 14% improvement year-over-year. While the company delivered a top-line of $7.18 billion, net income grew 14.5% year-over-year to $1.3 billion. EPS for the quarter came in $2.22, increasing 15.6% year-over-year. Moreover, with the ongoing adjustments to manufacturing and supply chain operations and evolving demand trends, EPS is expected to grow 9.6% next year. The stock closed yesterday’s trading session at $164.8, gaining more than 10.4% over the last six months. Additionally, MMM is trading at a 9.7% discount to its all-time high of $182.55. MMM’s strong momentum is reflected in its POWR Ratings, it has a Buy rating with a grade of A in Trade Grade and Industry Rank, and a B in Buy & Hold Grade and Peer Grade. Within the Industrial – Machinery, it’s ranked #21 out of 59 stocks. Want More Great Investing Ideas? 7 Best ETFs for the NEXT Bull Market Beware Stocks in September? 9 “BUY THE DIP” Growth Stocks for 2020 VZ shares were trading at $60.65 per share on Wednesday afternoon, up $1.49 (+2.52%). Year-to-date, VZ has gained 2.01%, versus a 11.83% rise in the benchmark S&P 500 index during the same period."}]}