{"article": [{"url": "https://stocknews.com/news/intu-splk-payc-3-strong-software-stocks-to-own-for-the-rest-of/", "published": 1595333300.0, "headline": "3 STRONG Software Stocks to Own for the Rest of 2020", "body": "No matter how bad the economy gets, people and businesses will continue to buy software. Even if profits of software makers slightly dip due to decreased consumer and business spending, this healthy growth industry will likely hold firm amidst a potentially deep economic recession. In particular, the following three software stocks are well-positioned for the stretch run this year: Intuit (INTU), Splunk (SPLK), and Paycom (PAYC). Intuit (INTU) 9 \"BUY THE DIP\" Growth Stocks For 2020The digital transition fast-tracked by the coronavirus pandemic has resulted in most business and financial activity being conducted on the web rather than through in-person interactions with other people. INTU provides software financial management software solutions for businesses of varying sizes, accountants, and everyday people. This Mountain View, CA-based company has enjoyed considerable success in the accounting, tax prep, and financial software markets across the past several decades. More than half of INTU’s revenue stems from small business. The tax deadline was delayed until mid-July certainly works in INTU’s favor for a strong finish to 2020. This fintech innovator is transitioning to a platform driven by artificial intelligence (AI), which will make it even more of a powerful force to be reckoned with. The POWR Ratings show INTU is truly elite. INTU has an A Trade Grade and an A Peer Grade. The stock has B grades in the remainder of the POWR Components. All in all, INTU is ranked 6th of 45 stocks in the Consumer Financial Services space. Analysts have a bullish take on INTU : 10 Buy ratings, 2 Hold Ratings and zero Sell ratings along with an average price target of$312.92. INTU is currently trading at $298. There is a decent chance INTU approaches its 52-week high of $314.73 before the end of 2020. Splunk (SPLK) Data collection, organization, and analysis is the equivalent of a modern-day gold mine. In other words, SPLK’s innovative software is essentially a digital gold mining operation. As time progresses, more and more businesses are relying on SPLK to obtain valuable insight into operations through the harnessing and analysis of big data. SPLK’s analysis extends to all data sources and formats, helping customers with the overarching goal of truly informed operational decision-making. SPLK’s price charts are a sight for sore eyes, regardless of the time frame. Despite SPLK’s seemingly never-ending ascension, top analysts are still fairly bullish with 25 recommending investors buy the stock, four suggesting investors hold, and none recommending investors sell. The POWR Ratings reveal PLK is nearly flawless. The stock is ranked 4th of 82 publicly traded companies in the Software – Applications space with an A Peer Grade, Trade Grade, Buy & Hold Grade, and Industry Rank. Though SPLK spiked more than 30% in the first half of 2020, this AI powerhouse is likely to continue its winning ways as we round out the year. SPLK might blow past its 52-week high of $213.26 by the start of fall. Paycom (PAYC) As face-to-face interactions continue to pose considerable health threats, human resources and nearly every other modern-day business component are moving to the cloud. PAYC provides cloud-based software for employee on-boarding, training, management, and compensation. The PAYC POWR Ratings are not as stellar as expected, yet the experts are still bullish on this growth stock. PAYC has B grades in the Buy & Hold and Trade POWR Components, an A Industry Rank, and an overall ranking of 20 out of 82 stocks in the Software – Application industry. PAYC is quickly approaching its pre-covid trading high of $337.74. Take a close look at PAYC’s numbers, and you will find the company is likely to beat earnings once again. PAYC’s quarterly revenue is up more than 20% on a year-over-year basis. Look for even more companies to take advantage of PAYC’s cloud-based HR solutions as social distancing continues in offices throughout America. Want More Great Investing Ideas? 9 “BUY THE DIP” Growth Stocks for 2020 Newly REVISED 2020 Stock Market Outlook 7 “Safe-Haven” Dividend Stocks for Turbulent Times INTU shares were unchanged in after-hours trading Tuesday. Year-to-date, INTU has gained 14.39%, versus a 2.07% rise in the benchmark S&P 500 index during the same period."}]}