{"article": [{"url": "https://stocknews.com/news/spce-3-reasons-virgin-galactic-holdings-will-continue-its-meteoric-rise/", "published": 1601381300.0, "headline": "3 Reasons Virgin Galactic Holdings Will Continue its Meteoric Rise", "body": "Virgin Galactic Holdings Inc. (SPCE) is surging on Wall St. bank recommendations. Virgin Galactic’s commercial space tourism services are closer to becoming reality. The coronavirus-related expansion of the wealth gap may expand the firm’s customer list. Everything that rises, falls – unless it breaks out of gravity’s reach. This may be the case for Virgin Galactic as shares of SPCE shares have leapt by more than 25% since it’s closing price last Friday. This meteoric rise is due to Bank of America’s Ron Epstein joining a lengthening list of buy recommendations on Monday. Epstein initiated coverage of SPCE with a “Buy” rating and a $35 price target. He said, “No company in our coverage universe has anywhere near comparable growth potential.” That triggered Virgin’s fourth-largest leap on record. SPCE Stock Forecast 9 \"BUY THE DIP\" Growth Stocks For 20201) Bank recommendations: Susquehanna also rated SPCE a “Buy” on Monday, making a total of 8 Wall St. banks that have a “Buy” rating on the stock. 2) Leading position: Sir Richard Branson’s company is nearing its inaugural flight – sending the man himself to the edge of space. Virgin Galactic has completed 27 out of 29 milestones and sending Branson on a rocket is planned for the first quarter of 2021. The next space tourism flights are due shortly afterward. The British billionaire has two significant rivals – Elon Musk and Jeff Bezos. Musk is the owner of Tesla and SpaceX, yet the latter firm is busy launching rockets and its founder seems more interested in reaching Mars. Bezos owns Amazon, yet his space firm Blue Origin is significantly behind Branson’s efforts. Virgin’s lead in the space tourism field will likely help it launch its service first – potentially making it synonymous with the industry. 3) Coronavirus effect: The global pandemic – which has recently surpassed one million confirmed deaths – may also boost Virgin Galactic and its stock price. The firm has already sold tickets at prices ranging from $200,000 to $250,000, a sum that very few can afford. The coronavirus has devastated the lives of those with lower incomes but has boosted living standards of those able to work from home. Net savings for those with higher incomes have leapt, as they continued working and were unable to spend. Rising house prices – a side effect of the pandemic and government support – also raised the net worth of those already doing well. That, in turn, increases the pool of potential customers able to purchase flights beyond the skies. Overall, the mix of upbeat bank recommendations, the proximity to launching its first flight, and the effects of the pandemic make SPCE appealing. At its current price of around $20, Virgin Galactic’s share is still far from the peak above $25 recorded in the summer and less than half of the 52-week high of $42.49. 2020 Elections: How stocks, gold, and the dollar could move in four scenarios, nightmare one included SPCE shares were trading at $20.85 per share on Tuesday afternoon, up $0.34 (+1.66%). Year-to-date, SPCE has gained 80.52%, versus a 4.77% rise in the benchmark S&P 500 index during the same period."}]}