{"article": [{"url": "https://stocknews.com/news/cvx-exxon-mobil-chevron-continue-to-provide-significant-upside/", "published": 1593432500.0, "headline": "Exxon Mobil, Chevron Continue to Provide Significant Upside", "body": "A rough time for the energy patch Chevron and Exxon make significant recoveries Three reasons why there is more upside in the two US leading oil companies On April 20, 2020, the price of nearby NYMEX crude oil fell to its lowest level in history when it dropped below zero. WTI is a landlocked crude oil with delivery in Cushing, Oklahoma. Brent futures fell to a low of $16, the lowest of this century, but the price came nowhere near zero because Brent is a seaborne crude oil with more storage capacity. After the demand destruction caused by Coronavirus and OPEC’s decision to abandon production quotas in early March, the price of crude oil plunged, reaching a low in late April. WTI became a bearish hot potato as there was nowhere to store the petroleum. Meanwhile, shares of the leading US oil companies fell to their lows in March, along with the stock market. Exxon (XOM) fell to its lowest price since 2002, and Chevron’s (CVX) low was the lowest level since 2005. By the time the price of crude oil fell to its April lows, both XOM and CVX were on their way higher. 9 \"BUY THE DIP\" Growth Stocks For 2020 A rough time for the energy patch Nearby NYMEX crude oil futures traded in an over $100 per barrel range so far in 2020. The high came in early January at $65.65 per barrel, and the low was on April 20 at negative $40.32. At the end of June 2019, the price of NYMEX futures was at $58.20 per barrel. On June 29, 2020, the price settled at $39.70, 31.8% lower on a year-on-year basis. Source: CQG The monthly chart highlights the decline in the price of the energy commodity from June 2019 and the recovery from the unprecedented April low. Price momentum and relative strength indicators were on either side of neutral territory, but both metrics were rising on June 29. Monthly historical volatility at 120.5% on June 29 was significantly higher than the 44.17% level in June 2019. Massive global production and demand destruction on the back of the worldwide pandemic sent the price of crude oil lower. Even though producers around the world have cut output, the oil market continues to search for balance, and an equilibrium price as the business activity has declined to the lowest level in years. The problem facing the oil market continues to come from the demand side of the fundamental equation. Chevron and Exxon make significant recoveries Oil companies have had a rough time for years as shares have lagged both the price of the energy commodity and the stock market. On a year-on-year basis at the end of June, the price of crude oil was 31.8% lower. Meanwhile, the S&P 500 Index was just over 3% higher at the 3,035 level. Source: Barchart Meanwhile, the Energy Select SPDR (XLE) closed at $63.71 at the end of June 2019 and was trading below the $37 level on June 29, 2020. The XLE holds shares in many of the top oil-related companies, including an almost 44% exposure to Chevron (CVX) and Exxon Mobile (XOM). The XLE fell to a low of $22.88 in March and has recovered by more than 60% over the past three months. Source: Barchart CVX moved from $51.60 to $87.67 since March or around 70% over the period as Chevron outperformed the XLE. Source: Barchart Over the same period, XOM shares moved from $30.11 to $44.27 or over 47% as Exxon Mobile underperformed CVX and the XLE. Three reasons why there is more upside in the two US leading oil companies Chevron and Exxon are the two leading US oil companies. While many other oil-related companies are facing bankruptcy in the current environment, CVX and XOM will be survivors. Three reasons lead me to believe that both companies offer value for shareholders at their current share prices from a long-term perspective. First, bankruptcies in the oil path will allow CVX and XOM to cherry-pick assets over the coming months. CVX has a market cap of almost $164 billion, and XOM’s stands at $187.24 as of June 29. Both companies have the resources to survive and improve their holdings as other companies fall by the wayside. The second reason is that both companies continue to offer shareholders highly attractive yields. XOM was paying a 7.86% dividend at $44.26 per share on June 29. CVX’s dividend was 5.88% at $87.70 per share. Finally, production cuts will eventually balance the crude oil market to reflect the current level of demand. OPEC, Russia, and other world producers have reduced output dramatically to address the demand destruction caused by the coronavirus. At the same time, US production dropped from 13.1 mbpd in March to 11 mbpd as of June 19, a decline of over 16%. The number of operating oil rigs in the US was 188 on June 26, compared to 793 at the same time in 2019. The decline in oil rigs in the US is likely to continue to weigh on production over the coming weeks and months. CVX and XOM have had a rough time, but both are survivors. While the shares of both companies have made significant recoveries from the March lows, they could have plenty of upside over the coming years. I would be a buyer of Chevron or Exxon Mobile on price weakness as the two companies are the best-in-breed in the US oil business. Want More Great Investing Ideas? 9 “BUY THE DIP” Growth Stocks for 2020 Top 3 Investing Strategies for the Year Ahead 7 “Safe-Haven” Dividend Stocks for Turbulent Times XOM shares rose $0.12 (+0.27%) in after-hours trading Monday. Year-to-date, XOM has declined -34.33%, versus a -4.26% rise in the benchmark S&P 500 index during the same period."}]}