{"article": [{"url": "https://stocknews.com/news/ebay-amat-csco-klac-4-nasdaq-stocks-to-buy-now-before-they-rally/", "published": 1600258100.0, "headline": "4 Nasdaq Stocks to Buy NOW, Before They RALLY", "body": "This has been one of the more volatile years that I can remember for the Nasdaq composite index. The index opened the year at 9,039.46 and rose to a closing price of 9,817.18, on February 19th, a gain of 9.41%. Then came fear from the pandemic. The index dropped to a low of 6,631.42 on March 23rd, before closing the day at 6,860.67, a 30.1% loss. Since then, tech stocks have been soaring due to work-from-home and social distancing trends. The index climbed to an all-time high of 12,074.06, before closing September 2nd at 12,056.44, a gain of 75.7%. 7 Best ETFs for the NEXT Bull MarketChart courtesy of Yahoo Finance The tech stocks that had previously been red hot since March reversed course again this month. The Nasdaq Composite has been down five out of the past nine trading days and is down 8% since September 2nd. Whether this is the beginning of a much larger selloff or just short-term weakness, one thing is for sure. Many tech stocks are trading at much more affordable prices than they were last month. This recent weakness provides us a great buying opportunity. There are several tech companies with business models I like trading lower this month and worth a look, such as: eBay (EBAY), Applied Materials (AMAT), Cisco Systems (CSCO), and KLA Corporation (KLAC). eBay (EBAY) As most investors and consumers know, eBay operates as an online shopping site that allows visitors to browse through products listed for sale or at auction. The company has evolved from a small user-based auction site to a worldwide shopping store. Since it separated from PayPal (PYPL) in 2015, its marketplace business is the company’s key growth driver. The company had a strong second-quarter, as more consumers shopped online due to shelter at home orders in many regions. Revenue increased 18% to $2.9 million. This was fueled by a 26% increase in gross merchandise volume, which is the company’s total value of transactions processed. As the company makes the bulk of its revenue through gross merchandise volume, this is a strong sign. EBAY forecasted third-quarter revenue to be between $2.6 billion and $2.7 billion and raised its full-year guidance to $10.6 billion. The company also appointed a new CEO in April. Jamie Iannone, who came from Walmart’s e-commerce division, is looking to implement technology enhancements by focusing on its customers. His plans include applying artificial intelligence to the platform to enhance the experience for buyers and sellers. The stock is currently down 10.4% for the month, and its valuation metrics are looking quite attractive right now with a P/E of 18.4 and an EV/EBITDA of 11.3. The company’s profitability numbers are off the charts with a return on equity of 173.1% and a return on invested capital (ROIC) of 44.1%. The stock is currently rated a “BUY” in our POWR Ratings system. The company holds grades of “B” in Buy & Hold Grade, Peer Grade, and Industry Rank, three out of the four components that make up the rankings. Applied Materials (AMAT) AMAT is one of the world’s largest suppliers of equipment for the fabrication of semiconductors, flat panel liquid crystal displays, and solar photovoltaic cells and modules. Also, the company provides deployment and support services related to the equipment it supplies. Operations are run through three segments: Semiconductor Systems, Applied Global Services, and Display and Adjacent Markets. The company reported a 23% rise in revenue for its fiscal 2020 third quarter. This is due to an increase in demand for semiconductors, which are needed for the cloud, big data, and artificial intelligence. As AMAT makes equipment and manufacturing processes for chipmakers, this has been quite beneficial for the company. In addition to strong revenue growth, was strong profit growth. AMAT’s adjusted net income grew 41%. The company expects $4.6 billion in revenue for the fiscal fourth quarter as it estimates that the semiconductor systems business will grow 31%. This is due to their transition to new chip technologies and gaining market share. AMAT should also see an increase in semiconductor investments as chipmakers need to address the burgeoning demand of artificial intelligence, 5G wireless networks, and the Internet of Things. After today’s close, the stock is down 16.5% month to date. Like EBAY, its valuation metrics look attractive, with a P/E of 16.4 and an EV/EBITDA of 12.1. The company’s profitability figures look great, with a net profit margin of 19.6% and an ROIC of 22.9%. This is a stock I like at an affordable price. Cisco Systems (CSCO) CSCO is an IP-based networking company that offers products and services to service providers, companies, commercial users, and individuals. The company is also expanding its presence in the network security segment. This segment includes products and services that prevent unauthorized access to systems and protect from worms, viruses, and malware. The company is poised to benefit from the strong adoption of its identity and access, advanced threat, and unified threat management security solutions based on increased internet traffic. As more people are working from home, its Webex video conferencing and business productivity offerings have shined. CSCO has seen strength across its WiFi 6 products, and its Catalyst 9000 family of switches are poised for strong demand as well. It should also benefit from a rapid rise in bandwidth consumption. Last year the company launched a networking solution to provide more solutions to cloud data centers. It is creating its own silicon architecture called Cisco Silicon One. CSCO has a nice dividend yield of 3.6% and has continuously raised its annual payout for almost ten years. The stock is 4.9% month to date, with a P/E of 15.3 and an EV/EBITDA of 9.5. With a return on equity of 29.6% and an ROIC if 20.7%, the stock looks attractive to me at this price. KLA Corporation (KLAC) KLAC is an original equipment manufacturer (OEM) of process diagnostics and control equipment and yield management solutions to fabricate semiconductor integrated circuits or chips. The company has a broad portfolio of products that address major PDC subsegments such as photomask inspection, wafer inspection and defect review, and metrology. The company had a strong quarter as both revenue and earnings outperformed analyst estimates and increased year over year. Earnings were up 53.4%, and revenue increased by 15.9%. Growth was led by strength in the foundry and logic segments and the semiconductor process control segment. Services revenue rose 3% year over year, with the company hitting a new record for system installations in a quarter. KLAC is well-positioned for long-term growth as chipmakers will require more advanced PDC tools and fabrication technologies with smaller circuit sizes and more process steps. It has a strong competitive position in inspection and metrology and long-term growth potential in yield management solutions. The firm’s transition to advanced nodes is also expected to drive growth in the future. The stock is down 14.5% for the month. While its trailing valuation metrics are not as attractive as the other companies on this list, its forward P/E is 14.7. The company is also very profitable, with a net profit margin of 21% and an ROIC of 22.0%. As I consider KLAC to have a wide-moat based on its leading position in the PDC segment, I like the stock at its current price of 180.81. Want More Great Investing Ideas? 7 Best ETFs for the NEXT Bull Market Stock Market Outlook: Before & After the Election Chart of the Day- See the Stocks Ready to Breakout EBAY shares . Year-to-date, EBAY has gained 41.19%, versus a 6.35% rise in the benchmark S&P 500 index during the same period."}]}