{"article": [{"url": "https://stocknews.com/news/chwy-w-cvna-coup-4-heavily-shorted-stocks-with-100-ytd-gains/", "published": 1599221300.0, "headline": "4 Heavily Shorted Stocks With 100% YTD GAINS", "body": "It’s always interesting to pay attention to highly-shorted stocks. These stocks can become battlegrounds between bulls and bears with outsized gains depending on which side comes out victorious. Zooming in on highly-shorted stocks that are up more than 100% YTD, means that the bulls have the edge. Most stockholders are in the green, while the shorts are sitting on losses. Either, they will add to their positions or cover which will send shares even higher. Wayfair Inc. (W), Carvana Co. (CVNA), Chewy, Inc. (CHWY), and Coupa Software Incorporated (COUP) are four stocks in which more than 20% of the float is short. 7 \"SAFE HAVEN\" Dividend Stocks for Turbulent TimesWayfair Inc. (W) W engages in e-commerce in the United States and internationally. The company offers a range of furniture, home furnishings, decor, and goods. It provides approximately eighteen million products for the home sector under various brands. The stock has gained more than 205% year-to-date. However, the stock tanked 8.3% yesterday to close the session at $275.70. W has a short float of 24.72%, indicating that the stock has been highly shorted. W reported excellent second-quarter results that were accelerated by the huge growth in at-home shopping amid the health crisis, enabling the company to report a profit and produced significant cash flow. Revenue grew 83.7% year-over-year to $4.3 billion. Net income came in $274 million compared to the year-ago loss of $182 million. The growth led to emerging competition from traditional retailers such as Amazon.com (AMZN). The company is facing immense competition from AMZN which already has a 30% share of the online furniture market. Even AMZN never achieved a revenue and profit growth similar to W. Consequently, W’s overstated revenue and earnings from short-term COVID-related bump is posing an extreme risk. The street expects EPS to decline by 70.4% next year. Moreover, the recent bond offering and share repurchase are also being questioned. However, the stock might witness a short-covering rally. W has a grade of “B” in Trade Grade in our POWR Ratings system. It is ranked #12 out of 34 stocks in the Specialty Retailers industry. Carvana Co. (CVNA) CVNA is an e-commerce platform for buying and selling used cars in the United States. Its platform allows customers to research and identify a vehicle and inspect it using a 360-degree vehicle imaging technology. It operates as a subsidiary of DriveTime Automotive Group, Inc. CVNA gained 115% year-to-date. However, the stock closed yesterday’s trading session at $195.51, after plunging 10.89% in a single day, primarily due to profit booking. The short sellers formed 31.82% of the float. These indicate that the stock is highly shorted. The stock’s momentum is also affected by the recent downgrade of recommendation by the Bank of America (BAC). CVNA had an impressive second quarter as retail car units sold during the quarter increased 25% year-over-year to 55,098. It managed to generate a revenue of $1.12 billion, growing 13% year-over-year, despite the pandemic. CVNA temporarily stopped buying cars from customers during the quarter while it assessed the impact of the pandemic on the industry. But a shift in consumer behavior from higher-priced new cars to more-affordable used cars was witnessed during the quarter, which is unlikely to reverse. This led to inventory constraints, as used car demand has soared lately. Hence, analysts tracking the stock estimate CVNA’s EPS to decline by 28.9% in the current year. CVNA is rated a “Buy” in our POWR Ratings system with an overall grade of “B”. It also has an “A” for Trade Grade and Industry Rank and a “B” for Peer Grade. It is ranked #13 out of 57 stocks in the Internet industry. Chewy, Inc. (CHWY) CHWY is a pure-play e-commerce business in the United States. The company provides pet food, supplies and medications, and other pet-health products and services through its website and mobile application. CHWY has also benefited from the tech rally gaining more than 113% year-to-date. However, the stock fell 11.6% yesterday to close the session at $61.94. The stock has a short float of 26.38%. CHWY added 1.6 million net active customers during the quarter. The company reported $1.62 billion in sales, growing 46% year-over-year as the demand for pet food surged as the pandemic witnessed a rise in animal adoptions and fostering in the first quarter. Yet profitability is still a long way off, as the net loss was $47.87 million, worsening from the year-ago quarterly loss of $29.55 million. Hence, the momentum was short-lived as investors blurred the long-term fundamentals. Hence, while the crisis caused a temporary bump, the street anticipates material deceleration in sales growth in the next few quarters. As per our POWR Ratings, CHWY is a “Buy.” It also holds an “A” in Trade Grade, Peer Grade, and Industry Rank. It is currently ranked #11 out of 34 stocks in the Consumer Goods Industry. Coupa Software Incorporated (COUP) COUP provides a cloud-based spend management platform that connects organizations with suppliers globally, provides greater visibility into and control over how companies spend money, as well as enables businesses to achieve savings that drive profitability. COUP has gained 110.8% year-to-date. However, the stock tanked 6.19% yesterday to close the day’s trade at $308.23. The short sellers formed 31.82% of the float which indicates that the stock is highly shorted. The company has been benefiting from solid uptake of Business Spend Management (BSM) offerings and an expanding customer base. Revenue for its fiscal first quarter increased 46.6% year-over-year to $119 million. Net loss declined to $14.8 million from the year-ago loss of $20.47 million. However, rising operating expenses on product development amid stiff competition is keeping the margins under pressure. Moreover, COVID-19 led macroeconomic weakness is causing reduced spend across the small and medium-sized business (SMB) and this is likely to limit COUP’s growth in the succeeding quarters. The street expects EPS to decline by 27% in the current year. According to the POWR Ratings, COUP is a “Buy.” It also has an “A” for Trade Grade, and a “B” for Buy & Hold Grade, Peer Grade, and Industry Rank. It’s ranked #14 out of 47 Software – Business stocks. Want More Great Investing Ideas? 7 Best ETFs for the NEXT Bull Market Beware Stocks in September? 9 “BUY THE DIP” Growth Stocks for 2020 CHWY shares were trading at $60.90 per share on Friday afternoon, down $1.04 (-1.68%). Year-to-date, CHWY has gained 110.00%, versus a 8.08% rise in the benchmark S&P 500 index during the same period."}]}