{"article": [{"url": "https://stocknews.com/news/acb-is-aurora-cannabis-a-buy-or-a-sell/", "published": 1592914100.0, "headline": "Is Aurora Cannabis a Buy or a Sell?", "body": "It’s been a rollercoaster ride for shareholders of Aurora Cannabis (ACB) since they announced their 12:1 reverse stock split last month. Immediately after the reverse split took place, shares tanked to 52-week lows of $5.30, only to skyrocket to $17 after their earnings release just a few days later. Those highs were short-lived however, as the company has been losing ground recently, trading under $15. 7 Best ETFs for the NEXT Bull Market(Source: Yahoo! Finance) As you can see in the chart above, the $13 level has proved to be a key level of support. So where is the stock headed from here? The bullish case: ACB reported impressive third-quarter results in May. Revenues jumped 18% from the previous quarter due to demand from their solid lineup of consumer products, more specifically their new brand called Daily Special. The Daily Special is a cheaper brand, designed to combat the black market. So far this seems to be working as the company saw a substantial increase in consumer cannabis revenues. ACB has also been drastically reducing operating expenses. They are hoping to generate positive adjusted EBITDA in the Q1 of 2021, though some analysts remain skeptical. After an incompetent mistake in 2019 that temporarily halted their cannabis sales in Germany, ACB is once again selling cannabis once again in Europe and investors are hopeful the company will be able to grow international revenues. Finally, ACB recently acquired Reliva for $40 million. Reliva is a top-selling CBD retail brand in the United States which is sold in over 20,000 stores and is already profitable. The bearish case: Despite writing down over $1 billion worth of goodwill just two quarters ago, ACB is still carrying CA$2.4 billion on their balance sheet, which is more than half of the company’s total assets. And the company has yet to announce a new permanent CEO, which in May they said they’d do in the “next few months.” I fear that the longer it takes, the further the stock could fall. Also, who they select as their CEO is important because if the market is not pleased with the hire, then this much-anticipated news could end up being a catalyst for the stock to move lower. As you can see, there are still many uncertainties surrounding ACB. However, I remain bullish on the company for the long-term for the simple fact that the cannabis sector should continue to grow at a healthy pace, especially once the COVID-19 pandemic is under control. (Disclosure: The author is long ACB) Want More Great Investing Ideas? 9 “BUY THE DIP” Growth Stocks for 2020 Top 3 Investing Strategies for the Year Ahead 7 “Safe-Haven” Dividend Stocks for Turbulent Times ACB shares were trading at $14.45 per share on Tuesday morning, up $0.73 (+5.32%). Year-to-date, ACB has declined -44.25%, versus a -2.18% rise in the benchmark S&P 500 index during the same period."}]}