{"article": [{"url": "https://stocknews.com/news/eoi-spy-msft-amzn-aapl-intc-v-jpm-vz-awp-bit-utf-amt-eqix-pld-awk-duk-our-instant-5-fund-retirement-portfolio/", "published": 1594296500.0, "headline": "Our “Instant” 5-Fund Retirement Portfolio", "body": "The way most folks invest, they’ll need way more than a million bucks to retire—in fact, they’ll need almost double that! No wonder so many people throw up their hands and commit to working till they’re 100. Maybe you’re one of these frustrated souls. With the world in the state it’s in today, I can’t blame you. But what if I told you that you could retire on a lot less? Like 75% less. 7 \"SAFE HAVEN\" Dividend Stocks for Turbulent TimesThat’s right: a fully paid-for retirement on just a $437,500 nest egg. Save up that much and you can look forward to a steady $35,000 in dividends (which is right around the average personal income in the US) year in and year out. And you won’t have to sell a single stock from your portfolio while you’re in your golden years, either. That return is all in dividends. And those payouts all come your way monthly, too. No more waiting three months for your next payout, like you must do with just about every S&P 500 stock. Better still, you’ll be able to keep your entire $437,500 intact. So if you want to leave a lasting legacy for your kids (or grandkids) this is the way to do it. Your 8% Plan for True Financial Independence The math on that dividend income is pretty simple: your $35,000 a year breaks out to just under $3,000 per month. To get that amount from your monthly dividend portfolio, you’ll need a dividend yield of 8% a year. Roughly speaking, someone who saves $1,500 per month (invested in stocks) would save up that $437K in 12 years and seven months, including the returns from putting that $1,500 per month in the market and getting the annualized gains the market historically provides over the long term. If the stock market does better than its long-term average, you could get there faster. So while $437,500 may sound like a lot of money, in reality, it doesn’t have to take as long to save as many assume. At the very least, it definitely doesn’t take the 40-year career we’re typically told we need to be trapped in before we can retire! Now, assuming you’ve saved up your $437,500, where can you put it to replace $35,000 in wages? Here’s a portfolio of five closed-end funds (CEFs) that invest in a variety of assets while paying you a rich monthly income stream. Our “Instant” 5-Fund Retirement Portfolio Ticker Fund Name Asset Class Dividend Yield FAX Aberdeen Asia-Pacific Income Fund Global Bonds 8.6% AWP Aberdeen Global Premier Properties Fund Real Estate 10.1% BIT BlackRock Multi-Sector Income Trust Corporate Bonds 10.1% UTF Cohen & Steers Infrastructure Fund Utilities 8.2% EOI Eaton Vance Enhanced Equity Income Fund Stocks 7.5% AVERAGE 8.9% Let’s go over each one. First, the Aberdeen Asia-Pacific Income Fund (FAX), which focuses on bonds issued by governments and big corporations, with a focus on Asia. We get more global diversification from the Aberdeen Global Premier Properties Fund (AWP), which owns real estate investment trusts (REITs) in America and abroad—so between our first two funds, we’re ensuring we’re investing in the global economy, and not just at home. AWP, for its part, holds 46% of its portfolio outside the US, with major holdings in Japan, Germany and the UK. But within the US, the fund owns some powerhouse REIT names, too. You might be familiar with cell-tower owner American Tower (AMT), data-center REIT Equinix (EQIX) and warehouse owner Prologis (PLD). They’re all among AWP’s top-10 holdings. Next up, we’ll add to our US bond exposure with the BlackRock Multi-Sector Income Trust (BIT), which uses private bonds to pay a 10.1% dividend. Then we’ll move to one of the steadiest sectors in the stock market—utilities—with the Cohen & Steers Infrastructure Fund (UTF), holder of reliable power and water suppliers like NextEra Energy (NEE), American Water Works (AWK) and Duke Energy (DUK). Finally, we’ll wrap up with the Eaton Vance Enhanced Equity Income Fund (EOI) for mainstream US-stock exposure. Its top holdings are all companies every American can name, like Microsoft (MSFT), Amazon.com (AMZN), Apple (AAPL), Intel (INTC), Visa (V), JPMorgan Chase & Co. (JPM) and Verizon (VZ). Pushing Passive Income to the Limit Now, when I started out telling you that I can get you a monthly dividend portfolio yielding 8%, I lied a little. As you may have noticed in the table above, this portfolio yields more than that: 8.9%, in fact, as I write this. That means, if you really wanted to push your savings to the limit, you could retire on just $393,258 if you use all of that 8.9% to replace $35,000 in yearly wages. That would also cut your savings period down from 12 years and seven months to just about 12 years. This isn’t even including higher savings from raises in the future Most financial advisors will tell you it’s impossible to retire so fast. Then they’ll likely steer you away from CEFs and toward lower-yielding alternatives like the SPDR S&P 500 ETF (SPY) and its 1.8% payouts. But going that route means you’d have to save over $1.9 million to replace $35,000 in salary with dividend payments. The better approach? Take the less-traveled path to financial independence by harnessing the income-producing power of CEFs. Want More Great Investing Ideas? Free Report: 5 Bargain Funds with Safe 11% Dividends A “1-Click” Way to Grab Safe 8% Dividends The $43,000 “dividend secret” Wall Street hides from you EOI shares were trading at $14.25 per share on Thursday afternoon, down $0.19 (-1.32%). Year-to-date, EOI has declined %, versus a -1.31% rise in the benchmark S&P 500 index during the same period."}]}