{"article": [{"url": "https://stocknews.com/news/lly-wst-a-xlv-tmo-gild-this-dividend-bull-market-is-borderline-unstoppable/", "published": 1595506100.0, "headline": "This Dividend Bull Market is Borderline Unstoppable", "body": "Quick income quiz—what’s the longest running bull market powering dividend payers? It may be the multi-decade run in healthcare spending. Dividend stocks that are providing products aligned with this megatrend have the types of payouts that we’re looking for in a retirement portfolio: Secure cash flows, with Rising profits to support future dividend growth. At a time when we can no longer take dividend payments for granted, this type of “megatrend support” is becoming a must-have. 7 \"SAFE HAVEN\" Dividend Stocks for Turbulent TimesWe’ll talk about specific stocks in a minute. First, let’s get into the trend and spend. The Centers for Medicare & Medicaid Services provides estimates of US health care spending by sources of funds, such as private healthcare insurance, Medicare and so on. In this year’s report, they project healthcare spending will continue to expand at a healthy clip of 5.4%: Regardless of who has political power, health spending just keeps growing and growing. As money flows into this sector, the rising tide is reflected in an ETF like the Health Care Select Sector SPDR Fund (XLV). It’s up 339% over the past decade, beating S&P 500 by about 70 percentage points. Healthcare Beats the Market Rather than settle for the ETF, we can further enhance our returns by cherry-picking the best companies (and dividend payers) of the lot. Let’s take a run through some of my favorite ideas, including likely “dividend doubles”—stocks that don’t yet pay a high stated yield but will thanks to rapid dividend growth. Big Pharma’s Little Helper Don’t be fooled by West Pharmaceuticals’ (WST) modest 0.3% yield. A few months back we discussed it as one of three little-known dividend growers. I highlighted this undercover stock back in April. Since then, it’s rocketed 55% higher: WST Becomes a Bit More “Known”: +55% in Just 3 Months The firm is about as vanilla as they come, which is perfect for us level-minded dividend investors. West Pharmaceuticals creates the packaging for vital treatments, whether that’s vials and stoppers, or more complex delivery systems such as self-injecting platforms, cartridges and intradermal products. As I said then: West Pharmaceuticals isn’t going to create the first coronavirus vaccine. But it’s entirely possible that a vaccine might come in a West Pharmaceuticals-made vial. Again, a boring business, but also an extremely vital one that will see demand no matter what. And the stock acts like it. A couple weeks later, West Pharmaceutical produced a wide earnings beat ($1.01 vs. $0.82 expected) thanks to a strong organic growth report. This is a stellar business, but the stock has entered some awfully thin air. Its share appreciation has lapped its dividend growth several times over, and shares now trade for more than 70 times forward earnings estimates. Markets never move in a straight line. This is a good one to consider on a pullback. You Can’t Go Vertical Forever Two High-Potential Dividend Growers Like West Pharma, Agilent Technologies (A), which has a 0.8% yield, and Thermo Fisher Scientific (TMO), which has a 0.2% yield, aren’t responsible for front-line brand names you and I will know, but they’re still making “must have” products for the healthcare sector. Agilent, which was spun out from Hewlett-Packard back in 1999, is a full-service lab supplier, from products to software to services. It offers everything from cell analysis and next-gen sequencing to instrument repair and laboratory management. Thermo Fisher, meanwhile, has a laundry list of offerings, including DNA testing kits, centrifuges and cryogenics. They also boast similar stock profiles right now: encouraging dividend growth, conservative payout ratios (23% for A, a mere 7% for TMO), and (unfortunately) rich valuations. Great Returns, But Overbought at the Moment Agilent’s trading at 27 times forward earnings estimates and Thermo Fisher, meanwhile, is sitting at a 31 forward P/E. These are very good companies, but they are trading at high levels at the moment. Current Pharma Dividends Up to 3.5% For income investors who need yield today, let’s consider the established Big Pharma and Big Biotech names. Eli Lilly (LLY), which as a 1.8% yield, has many potential catalysts at the moment. For one, Eli—behind products such as type 2 diabetes treatment Trulicity, plaque psoriasis medication Taltz and breast cancer drug Verzenio—is coming off a standout Q1. LLY reported 15% sales growth and actually raised its profit outlook for 2020 while most other companies were pulling their guidance. It also spent the quarter taking several steps in examining several existing products to treat or prevent COVID-19. Eli Lilly, which was actually booted from the Dividend Aristocrats in 2009 after freezing its payout, resumed dividend growth in 2015 and has since boosted its quarterly checks by 48%. The payout ratio is a safe 43%, so investors can expect good (but probably not spectacular) hikes in the coming years. Here, too, LLY has gotten a little away from itself, and away from its dividend growth. Its forward P/E of 25 is a bit rich for a slow grower like Lilly. Lilly’s Price Overshot Its Payout Unlike these other healthcare plays, an expensive price is not an issue with Gilead Sciences (GILD), which has a 3.5% yield. Shares are due to “catch up” with its dividend, which has been raised every year while the stock price has done nothing: Gilead’s Price Should Catch up With Its Payout Gilead—which develops antivirals for hepatitis B and C, HIV and influenza—became a victim of its own success. It created blockbuster cures for hepatitis C, which was great for patients but bad for those drugs’ business longer-term. GILD’s 2019 revenues of $22.5 billion were off 30% from 2015 sales of $32.6 billion. But importantly, those sales were up from 2018, stopping years of declines. That improvement is expected to come from remdesivir, its COVID-19 treatment that has been granted emergency-use approval by the FDA. But it also has a lot of potential in its HIV franchise, including its investigative treatment lenacapavir, which has produced some positive data in recent months. GILD now trades at just 12 times forward estimates. It yields well above 3% on a payout that has expanded by nearly 60% over the past five years, and it’s still only shelling out 41% of its profits to maintain that dividend. Want More Great Investing Ideas? Your Early Retirement Portfolio: 7.7% Dividends—Every Month—Forever How to Retire on 10% Dividends Paid Monthly The Simple (and Safe) Way to Earn 15% Every Year from Stocks LLY shares . Year-to-date, LLY has gained 24.11%, versus a 1.38% rise in the benchmark S&P 500 index during the same period."}]}