{"article": [{"url": "https://stocknews.com/news/fhb-insw-este-gifi-4-downgraded-stocks-to-avoid/", "published": 1599048500.0, "headline": "4 DOWNGRADED Stocks to AVOID", "body": "The stock market is in the midst of an unprecedented bull market run. Investors should not get caught up in the euphoria. Instead, it’s a good time to cut out any weak stocks from your portfolio. Stocks that lag during a bull market can see the biggest losses in the ensuing bear market. Our exclusive POWR Rating system can help you identify both underpriced and overpriced stocks. It rates stocks on a daily basis using a variety of fundamental, technical, and quantitative inputs. 9 \"BUY THE DIP\" Growth Stocks For 2020The following stocks were recently downgraded in the POWR Ratings: First Hawaiian (FHB), International Seaways (INSW), Earthstone Energy (ESTE), and Gulf Island Fabrication (GIFI). First Hawaiian (FHB) When the economy is humming along, banks are a fairly solid investment. However, the current economic trough is hurting the likes of FHB. Banks are hesitant to lend money. Borrowers are defaulting on loans. With few avenues for profit, FHB and fellow banks are merely trying to survive the economic storm. As a result, FHB has been downgraded to a Strong Sell rating. However, there is some hope as FHB also provides wealth management, trust, and insurance services. FHB has a ranking of 44 out of 51 stocks in the Pacific Regional Banks sector. Furthermore, the stock has F grades in its Trade Grade and Buy & Hold Grade POWR Components. The stock’s price returns are in the red but for the exception of 2019. In fact, FHB has a six-month price return of -23.34%. The top analysts are bearish on FHB, setting an average price target of $16, meaning it has about a 3% downside. International Seaways (INSW) Tanker companies had a good run yet the time has come to divest from this line of business. In particular, INSW is no longer worthy of your investing dollars. Use your mind’s eye to envision what the future will be like half a decade down the line. Crude oil and petroleum will be out while green, renewable energy will be en vogue. This means the likes of INSW will inevitably decrease in value. INSW has F grades in the POWR Components of Trade Grade and Buy & Hold Grade. The stock is ranked 30th of 46 in the Shipping category. Though INSW had a ’19 price return in the green, the stock’s price returns are in the red in nearly every other time period. The stock’s year-to-date price return is -46%. Furthermore, INSW has a three-month price return of -21.74%. Earthstone Energy (ESTE) Oil and gas is no longer the apple of investors’ eyes. ESTE explores North Dakota and Montana for such fossil fuels. Though the fossil fuel industry will still likely prove profitable for the next couple of years, it is clearly being supplanted by green energy, meaning it will be difficult for ESTE to make money unless it pivots toward renewable forms of energy. The POWR Ratings reveal ESTE has F grades in The Trade Grade and Buy & Hold Grade POWR Components. ESTE is ranked 64th of nearly 100 stocks in the Energy – Oil & Gas industry. ESTE has price returns in the red but for ’19. The stock’s price return across the past six months is -20%. Furthermore, ESTE’s price return in the prior three years is -71%. ESTE has not recovered from its coronavirus selloff this past spring. The stock has only slightly inched upward from a dollar and change to just under $3. ESTE traded well above the $3 mark prior to the pandemic. If you own this stock, cut bait now and don’t look back. Cue Biopharma (CUE) CUE creates biologics specifically for the selective modulation of the immune system with the overarching goal of treating autoimmune disorders and cancer. The POWR Ratings show CUE has F grades in its POWR Components and a D Peer Grade. CUE is ranked in the bottom half of more than 230 stocks in the Medical – Pharmaceuticals space. CUE has a six-month price return of -18% and a three-month price return of -37%. CUE traded between $10 and $15 all the way up until early 2020 when it moved up beyond $15, breaking through $20 in April and eventually hitting $30. However, the stock has sold off since reaching this level due to a lack of progress with its biologics. CUE has not provided investors with sufficient reason to buy its stock in recent months. Savvy investors will avoid this stock until some positive news is released or until it moves back to its yearly low of $7. FHB shares were trading at $16.36 per share on Wednesday afternoon, up $0.06 (+0.37%). Year-to-date, FHB has declined -40.93%, versus a 11.90% rise in the benchmark S&P 500 index during the same period."}]}