{"article": [{"url": "https://stocknews.com/news/tsla-f-gm-fcau-tm-is-tesla-a-car-maker-or-a-tech-company/", "published": 1597752500.0, "headline": "Is Tesla a Car Maker or a Tech Company?", "body": "TSLA has been on a roll and is much more than a car manufacturer A recipe for the company to join the trillion-dollar market cap club Space X and The Boring Company- The Potential Is Compelling 7 \"SAFE HAVEN\" Dividend Stocks for Turbulent TimesElon Musk- A character but the next potential king of technology stocks, move over Jeff Bezos The number of electric vehicles on the road has exploded over the past years. While many automobile makers offer EVs and are introducing new models with longer battery duration, Tesla (TSLA) is at the forefront of the industry. Elon Musk has emerged as a modern-day Thomas Edison. The engineer, originally from Pretoria, South Africa, has become a billionaire. At the $1650 per share level, TSLA’s market cap was around the $308 billion level at the end of last week. Other US leading car manufacturers have market caps that are a fraction of TSLA’s. Ford’s (F) was at $28 billion, General Motors’ (GM) at below $40 billion, and Fiat Chrysler’s (FCAU) at $23.13 billion. Together, the three US companies were worth less than one-third of TSLA’s market cap. Toyota Motors (TM) was worth just under $189 billion. Aside from automobiles, Mr. Musk has his fingers in other businesses. His Space X company is on a course to explore and put a person on Mars. Space X has had several successful launches. The Boring Company is working on high-speed travel and has already dug a tunnel in Las Vegas that will be operational soon. It may be only a matter of time before his companies challenge the technology leaders with an over $1 trillion combined market cap. Car manufacturing, space exploration, and high-speed underground travel have become a marvel of technology engineering under Elon Musk. His wealth continues to grow with the successes of his companies. Many devotees that followed and believed in him have seen the value of their investments soar. TSLA has been on a roll and is much more than a car manufacturer There are few analysts and market participants that do not have a strong opinion on the price level of TSLA shares. Elon Musk has become a cult figure for supporters of TSLA and devotees of their products. Meanwhile, a group of investment professionals and traders believed that the company was running on fumes, and it would run out of cash. They have been dead wrong. The devotees have prospered beyond their wildest dreams. TSLA came public on June 29, 2010. The initial public offering was at $17 per share. The shares opened at $19 and reached a low of $14.98 the month after the IPO. Since then, the stock has rewarded believers in the company handsomely. Source: Barchart The chart shows that TSLA shares steadily rose, reaching a high of $389.61 in September 2017. After a dip that took the price to a low of $176.99 per share in June 2019, the stock went parabolic. The latest high came in July at $1794.99, and TSLA was trading at over the $1650 level at the end of last week, 97 times the IPO price a decade ago. TSLA is an EV manufacturer, but it is also a technology company on the cutting edge of environmentally friendly engineering. The company has beat analyst earnings estimates over the past four consecutive quarters. Source: Yahoo Finance The chart illustrates the better than projected earnings for TSLA. In Q2 2020, the company posted EPS of $2.18 per share compared to a consensus estimate of only three cents. In Q3, analysts have boosted their projection to $2.67 per share. A survey of twenty-eight analysts on Yahoo Finance expects a massive range of $87 to $2608 per share with an average of $1256.25, far below the current level of the stock. Elon Musk owns the EV market, and his detractors have eaten crow. Those who bet against him have lost their shirts. TSLA is far more than a car manufacturer. The leader and chief engineer has his fingers in two other pies that could lift the company to another level over the coming years. A recipe for the company to join the trillion-dollar market cap club Two of Elon Musk’s other projects that have incredible potential and are not publicly traded companies. At the end of last week, TSLA’s market cap stood at over $307 billion, a far cry from the tech leaders in the trillion or above the trillion and a half market cap level. However, Musk’s plans for space and underground on earth could become the businesses that vault the company into the trillion-dollar club. The growing success of Space and The Boring Company could vault Mr. Musk’s portfolio into the stratosphere. The potential for a combined market cap that surpasses Amazon (AMZN) at over $1.57 trillion and Apple (AAPL) at just below $2 trillion is rising. Space X and The Boring Company- The Potential Is Compelling Space X’s mission is “going out there and being among the stars,” according to ts founder, Elon Musk. The company is returning human spaceflight to the United States. According to its website, Space X has already had 94 successful launches, 57 landings, and 39 reflown rockets. The company is leading the race to be the first to put a human on Mars. The new branch of the US military, the SpaceForce, means that the company is in a position to secure valuable government contracts over the coming years. The Boring Company is an infrastructure and tunnel construction company. The inspiration for the company was Elon Musk’s frustration with the traffic in Los Angeles, California, and the limitations with the current two-dimensional transportation network. The company has three product lines including, one or multiple twelve-foot inner diameter tunnel(s), project engineering and planning documentation, and environmental review and permitting. The company constructed a test tunnel in Hawthorne, California. It also built a loop system for the Las Vegas Convention Center. The potential for a tunnel system that allows for high-speed travel that avoids traffic could revolutionize the transportation system in the US and worldwide. Elon Musk- A character but the next potential king of technology stocks, move over Jeff Bezos Elon Musk’s three businesses address environmental and practical problems facing the world. Tesla is an on-ground alternative energy solution that lowers the requirements for fossil fuels. Space X opens up the potential for space travel and the potential for colonization. The Boring Company is an underground solution that provides efficiency for travel and commuting. The three companies have the potential to rise above other technology companies when it comes to the combined market cap in the coming years. Mr. Musk is a driven innovator who embraces competition. Like the Hatfield and McCoy’s, rivalries in the technology industry are nothing new. Bill Gates and Steve Jobs were at each other’s throats when Apple and Microsoft were up and coming companies. Tim Cook and Facebook’s Mark Zuckerberg have been openly feuding for years. Elon Musk and Jeff Bezos, the founder of Amazon and the world’s wealthiest person, are not fond of each other. Both are competing for a leading role in Space. Meanwhile, Mr. Musk appears to enjoy poking other successful billionaires. He once said that his conversations with Bill Gates were “underwhelming” and tweeted that “Billy G is not my lover” and “The rumor that Bill Gates & I are lovers is completely untrue.” Musk has called Jeff Bezos a “copycat.” Elon has also made unflattering comments about Warren Buffett saying the Oracle of Omaha is “overrated,” and Buffett’s concept of economic moats is “lame.” Musk is not “the biggest fan” of Buffett. He characterized Buffett’s work as “boring” as he tries to figure out “does Coke or Pepsi deserve more capital.” Jeff Bezos is currently the wealthiest person on earth. Elon Musk has the potential to surpass him over the coming years as the combination of TSLA, Space X, The Boring Company, and his future innovations put him in a different class. I expect anything he touches to be golden over the coming years and decades. Want More Great Investing Ideas? The Best of StockNews 3 Possible Directions for the Stock Market from Here 9 “BUY THE DIP” Growth Stocks for 2020 TSLA shares were trading at $1,870.32 per share on Tuesday morning, up $34.68 (+1.89%). Year-to-date, TSLA has gained 347.09%, versus a 6.40% rise in the benchmark S&P 500 index during the same period."}]}