{"article": [{"url": "https://stocknews.com/news/uri-acm-expo-3-infrastructure-stocks-that-will-hold-up-for-the-rest/", "published": 1594642100.0, "headline": "3 Infrastructure Stocks That Should Hold up for the Rest of 2020", "body": "Infrastructure stocks are getting more attention as there is renewed talk of rebuilding America’s infrastructure. With millions of unemployed and little hope for the service industry to rebound in the near term, economists suggest that the federal government hire the unemployed to rebuild the country’s infrastructure. Furthermore, Joe Biden has a sizable lead on Donald Trump in the race for the presidency. Biden has stated he would like to rebuild America’s infrastructure, an effort sure to have considerable support from Biden’s supporters and a potential blue Congress. If America’s infrastructure is to be rebuilt, private industry must be involved to some extent. Contracts will be doled out, and engineering expertise will be tapped into. Let’s take a look at some of the most appealing stocks in the Industrial – Services category: United Rentals (URI), AECOM (ACM), and Exponent (EXPO). 7 Best ETFs for the NEXT Bull MarketUnited Rentals (URI) Heavy machines, hand tools, and other building equipment will be used far and wide in an infrastructure rebuild. URI provides 20,000 classes of this equipment for rent. URI rents the equipment to construction businesses, industrial companies, municipalities, utility providers, and other companies. The POWR Ratings have URI ranked second out of 35 stocks in the Industrial – Services segment. URI has an A Peer Grade and B Grade for the Trade and Buy & Hold components. The top analysts have set a price target of $160 for URI. URI has a forward P/E ratio of 12.32, so there are no value concerns of note. Furthermore, URI has an unbroken earnings streak intact. Consider adding this out-performer to your portfolio before the election. AECOM (ACM) If you follow the stock market or transportation industry, you have most likely heard of Elon Musk’s’ hyperloop being built beneath Los Angeles. However, Musk is not the only player in the hyperloop game. ACM is also developing its hyperloop for futuristic high-speed transportation. ACM engineers plan and build large-scale projects ranging from the fore-mentioned hyperloop to bridges, highways, airports, and stadiums. If America’s infrastructure is to be rebuilt, ACM will likely play a central role. The POWR Ratings have ACM ranked in the top half of stocks in the Industrial – Services category. The stock has a solid Buy & Hold Grade and a ’19 price return of nearly 63%. The analysts have set a price target of $45.50 for ACM. Look for ACM to trend toward its 52-week high of $52.40 as we move toward the election. Exponent (EXPO) Infrastructure projects require the assistance of engineering consulting firms. EXPO is one of the leading engineering consulting groups. EXPO’s engineering gurus provide creative solutions to complicated construction, planning, and design challenges. The company employs engineers, scientists, regulatory consultants, and business consultants. The POWR Ratings have EXPO rated #1 of 35 publicly traded companies in the Industrial – Services category. EXPO has As in almost all of the POWR Components. EXPO has an average analyst price target of $94. Though Wall Street analysts anticipate a year-over-year reduction in earnings next quarter, EXPO is still worth a close look, especially if you believe America will resort to construction and rebuilding to stimulate the economy. EXPO dipped down to $60 during the coronavirus sell-off, bounced right back up to $73, and subsequently cratered back down toward $60 in a month. However, the stock has rebounded, and soared past the $80 threshold before plateauing in the mid-$70s. Want More Great Investing Ideas? 9 “BUY THE DIP” Growth Stocks for 2020 Top 5 WINNING Stock Chart Patterns 7 “Safe-Haven” Dividend Stocks for Turbulent Times URI shares were trading at $152.59 per share on Monday afternoon, up $4.76 (+3.22%). Year-to-date, URI has declined -8.50%, versus a 1.00% rise in the benchmark S&P 500 index during the same period."}]}