{"article": [{"url": "https://stocknews.com/news/orcl-lly-ebay-cor-4-dividend-stocks-to-buy-if-there-is-a-second/", "published": 1593778100.0, "headline": "4 Dividend Stocks to Buy if There is a Second Market Crash", "body": "The spread of the coronavirus in the US has caused widespread uncertainty in the markets. This led to a market crash that many companies have yet to recover from. Since the number of cases in the US are still on the rise, fears in the market have yet to be subsided. Going by commentary from analysts and economists, it appears that we may still witness another stock market crash that could last even longer than the first one. You should adjust your portfolios accordingly. One of the safer ways to invest is to buy stocks that have a long track record of providing shareholders large dividends. This typically provides income for investors in the form of quarterly payments. Here are four dividend stocks to consider. 7 Best ETFs for the NEXT Bull MarketOracle (ORCL) Oracle is a technology company that provides a wide range of software and hardware solutions. It focuses on database and middle-ware software along with cloud infrastructure and hardware systems. The company is currently in the midst of executing its plans to launch 36 second generation cloud regions by the end of 2020. It has recently opened a second cloud region in India. This move could pivot ORCL to play a greater role in the ongoing cloud services adoption. ORCL is one of the more stable US stocks in terms of volatility. Its volatility is greater than only 0.69% of other stocks. This could bode well for investors if a second market crash does happen, since the stock is likely to see wild price changes. ORCL has a Dividend Yield of 1.72%. The company increased its dividend by 26.32% in April 2019 and has maintained that level since. This stock has a Strong Buy rating in the StockNews.com POWR Ratings It also has a Buy & Hold Grade of A, which shows that the stock is expected to be bullish over the term. Eli Lilly and Company (LLY) Eli Lilly is a pharmaceutical company that operates in both human and animal medicine. LLY currently has a drug in Phase 3 trials called Olumiant. If successful, this drug could work as a possible treatment for the coronavirus. LLY could see gains in the near term if the drug hits the market. LLY increased its dividend by 14.73% in February 2020, and has been increasing its dividend over the last 10 years. LLY currently has a Dividend Yield of 1.8%. The stock has a Strong Buy Rating in the POWR Ratings. It is also ranked #1 out of 214 stocks in the Pharmaceutical industry. EBay (EBAY) EBay is an international e-commerce platform that needs no introduction. The company has a current market cap of almost $37 billion. EBAY has experienced a 26% year-over-year increase in its gross merchandising volume. This growth has largely been driven by the spread of the coronavirus and the resulting increase of online shopping. EBAY has a Dividend Yield of 1.18%. The company increased its dividend by 14.29% in February of this year. EBAY has a Strong Buy rating in the POWR Ratings. This stock also has a grade of A for each of the four components that make up the POWR Ratings. CoreSite Realty (COR) COR focuses on construction and management of data centers. This includes communication technology such as servers, storage devices, switches, routers, and fiber optic equipment. The company’s clients include some of the largest Silicon Valley companies, including Amazon (AMZN), Microsoft (MSFT), and Alphabet (GOOGL). The company’s bottom line has not suffered like others during this pandemic. This high yield dividend stock, unlike other blue-chip companies, has not suspended its dividend payouts. The company has a Dividend Yield of 3.92%. COR increased its dividend in June 2019 by 10.91%, and has maintained the same level since. COR has a Strong Buy rating in the POWR Ratings. Want More Great Investing Ideas? 9 “BUY THE DIP” Growth Stocks for 2020 Is the Bull S#*t Rally FINALLY Over? 7 “Safe-Haven” Dividend Stocks for Turbulent Times Top 3 Investing Strategies for 2020 ORCL shares were trading at $55.94 per share on Friday afternoon, up $0.45 (+0.81%). Year-to-date, ORCL has gained 6.56%, versus a -1.99% rise in the benchmark S&P 500 index during the same period."}]}