{"article": [{"url": "https://stocknews.com/news/khc-gis-hrl-mkc-4-food-stocks-that-are-heating-up/", "published": 1594901300.0, "headline": "4 Food Stocks That Are HEATING UP", "body": "During the coronavirus and subsequent shut downs, certain food stocks were rare winners, as people were staying home and cooking more. This has led to increased sales for “pantry staples” like Kraft Heinz (KHC), General Mills (GIS), Hormel (HRL), and McKesson (MKC). Another catalyst for these stocks was that defensive stocks tend to outperform, when investors anticipate recession due to their healthy dividends and less economically-sensitive businesses. Both factors turned out to be true for these stocks, as they are all above their pre-coronavirus levels. These gains are likely to persist, as increasing coronavirus case counts will lead to another round of potential shutdowns and self-quarantining. Additionally, the weakness in interest rates will make these stocks attractive to income-oriented investors. 7 Best ETFs for the NEXT Bull MarketThese are the best four food stocks: The Kraft Heinz Company (KHC) KHC is one of the leading food and beverage companies with a diverse portfolio of iconic and emerging brands. KHC has been focused on growing its business across all segments by investing in product development and its e-commerce platform. The company has also been undertaking measures to augment efficiency in supply chain management and control costs. The higher pricing in the United States and international segments has increased KHC’s overall pricing 1.6% year over year in the first quarter. Net sales were up 3.3% and operating income increased 37.1% year over year. KHC currently pays an annual dividend of $1.60, which yields 4.8% based on its current price. While the company cut its quarterly dividend in 2019, the current dividend yield remains attractive for income investors given the current 10-year yield of 0.63%. The company should be able to sustain the current dividend level, as it has been witnessing continued growth in free cash flow. Moreover, KHC has an impressive earnings surprise history with the company beating consensus EPS estimate in each of the trailing four quarters. KHC has been showing a bullish trend and is up by more than 40% from its March lows. How does KHC stack up for the POWR Ratings? A for Trade Grade A for Buy & Hold Grade B for Peer Grade B for Industry Rank A for Overall POWR Rating You can’t ask for better. The stock is also ranked #1 out of 56 stocks in the Food Makers industry. General Mills Inc. (GIS) GIS continues to meet short-term opportunities by matching elevated demand and has plans for long-term growth which involves investments in innovation, strategic capabilities and brand development. The increased demand for at-home food and the pet-segment products has driven GIS’s net sales growth. During the Covid-19 pandemic, General Mills’ manufacturing and distribution facilities worked without any hindrance and met the rise in demand for its products. GIS is focused on maintaining strong service levels and has adapted its website to fuel e-commerce sales. For fiscal 2021, GIS aims to increase brand penetration, strengthen customer partnerships, gain market share and reduce its leverage for a better financial position. GIS has refinanced its short-term debt to remain prepared for any liquidity crisis. In the fourth fiscal quarter ended May 31st, net sales increased 21% and operating profit increased 16% year over year. GIS has an impressive earnings surprise history with the company beating consensus estimates in each of the trailing four quarters. The consensus EPS estimate of $0.87 for the quarter end August 2020 indicates a year-over-year increase of 10.1%. The revenue estimate of $4.19 billion also indicates an increase of 4.7% over revenue a year ago. Since its March lows, GIS has grown by more than 20%. GIS’s strong financials are reflected in its POWR Ratings, it has a “Strong Buy” rating with an “A” in Trade Grade, Buy & Hold Grade, Peer Grade, and an “B” in Industry Rank. Within the Food Makers group, it’s ranked #2 out of 56 stocks. Hormel Foods Corporation (HRL) HRL is a global food company which is present across 80 countries worldwide with more than 30 brands. The increased demand for Jennie-O lean ground products, SPAM luncheon meat and other branded retail products during this period significantly benefited HRL. In an attempt to provide safe and nutritious food for dysphagia diets, HRL recently launched new THICK & EASY IDDSI Level 5 Ready Meats. The company sees an opportunity in creating food products for under-served markets. HRL has grown by more than 22% since its 52-week low in March. HRL is well positioned financially with limited debt and consistent cash flows. In the second fiscal quarter ended April 26th, net sales were up 3% and cash flow from operation was up 102% year over year. HRL has a dividend yield of 1.94% and a payout ratio of 54.4%. The consensus revenue estimate for the quarter ended July 2020 indicates a 3.8% increase over the year-ago number. It’s no surprise that HRL is rated “Strong Buy” in our POWR Ratings system. It also has an “A” for Trade Grade and Buy & Hold Grade and an “B” in Peer Grade and Industry Rank. In the 56-stock Food Makers industry, it is ranked # 3. McCormick & Company, Incorporated (MKC) MKC is an American Fortune 1000 food company that manufactures condiments, flavorful products, seasonal mixes and spices. MKC leads the global flavor market with a differentiated flavor portfolio which is delivered across all channels. Although the flavor segment was adversely affected due to more consumers cooking at home, its consumer segment performed well due to higher demand. Although,the stock price has spiraled down over the past few years, this year could be a turning point for MCK due to the increased demand for its products in the “new normal.” In the second quarter ended May 31st, MCK’s sales increased 8%, operating income was up 24% and adjusted earnings per share rose 27% year over year. The company also generated a strong cash flow. The year-to-date net cash provided for operating activities was $356 million at the end of the second quarter as compared to $314 million in the previous year. In fiscal 2019, the company recorded the eighth consecutive year of record cash flow from operations and the 34th consecutive year of dividend increase. The company pays an annual dividend of $2.48, which equates to a yield of 1.31% based on its current price. MKC’s POWR Ratings reflect a promising outlook. It has an overall rating of “Strong Buy” with an “A” for Trade, Buy & Hold and Peer Grade and an “B” for Industry Rank. Among the 56 stocks in the Food Makers group, it’s ranked #4. Want More Great Investing Ideas? 9 “BUY THE DIP” Growth Stocks for 2020 Newly REVISED 2020 Stock Market Outlook 7 “Safe-Haven” Dividend Stocks for Turbulent Times KHC shares were trading at $34.39 per share on Thursday afternoon, up $1.24 (+3.74%). Year-to-date, KHC has gained 10.30%, versus a 0.72% rise in the benchmark S&P 500 index during the same period."}]}