{"article": [{"url": "https://stocknews.com/news/hd-low-shw-swk-remodel-your-portfolio-with-these-top-4-home-improvement-stocks/", "published": 1599653300.0, "headline": "“Remodel” Your Portfolio With These Top 4 Home Improvement Stocks", "body": "The pandemic has altered the lifestyle of people across the world drastically, with social distancing being the new norm. Most people have shifted to working and learning from home during this time, causing them to spend more time indoors. Sith so many parts of the economy shut down or limited, it’s no surprise that there’s increased spending on housing and home improvement projects. According to a U.S. Census Bureau report, home centers, hardware stores, garden centers, and building materials suppliers realized a 22.6% year-over-year increase in sales, as 57% of homeowners partook in home improvement projects in the first three months of the pandemic. Given that social distancing and work-from-home are going to stay in place until early or mid-20121, the demand for home improvement products is expected to continue rising in the upcoming months, with people upgrading their living spaces. Hence, companies such as The Home Depot, Inc. (HD), The Sherwin-Williams Company (SHW), Lowe’s Companies, Inc. (LOW), and Stanley Black & Decker, Inc. (SWK) are expected to grow through the remainder of 2020. 9 \"BUY THE DIP\" Growth Stocks For 2020The Home Depot, Inc. (HD) As one of the largest retailers of home improvement products in the United States, the company offers its products to both do-it-for-me customers and third-party installers. HD’s strong financial foundation and brand reputation allowed the stock to fare well even during the pandemic. It gained more than 100% since hitting its 52-week low of $140.63 in March. HD hit its 52-week high of $292.95 in August. To keep up with the rising demand for home improvement products amid lockdown, HD announced the opening of three new distribution centers in Georgia. This was part of its ongoing $1.2 billion investment plan to expand its operations and market presence across the country. HD also increased its investment in the outdoor power categories group, in response to surging demand for products across the country. HD reported a 23.4% year-over-year improvement in its net sales to $38.05 billion for the second quarter ended August 2020. Gross profit of $12.94 billion improved 24.1% from the same period last year. Operating income increased 23.9% over the year-ago period to $6.06 billion. Net earnings of $4.33 billion improved 24.5% from its year-ago value. Cash and cash equivalents balance of $14.32 billion increased 456.2% year-over-year. HD had an impressive asset turnover ratio (also known as sales to total assets ratio) of 1.46 at the end of the quarter. This implies HD generated $1.46 for every dollar held as assets in the second quarter this year. HD’s net income improved at a CAGR of 12% over the past three years, while diluted EPS grew at a CAGR of 16.2% over the same period. The consensus EPS estimate of $2.95 for the fiscal second-quarter ending October 2020 indicates a 16.6% growth year-over-year. HD has an impressive earnings surprise history as well, as it beat the street EPS estimates in three out of trailing four quarters. The consensus revenue estimate of $31.13 billion for the quarter indicates a 14.3% rise from the same period last year. How does HD stack up for the POWR Ratings? A for Trade Grade B for Buy & Hold Grade B for Peer Grade A for Industry Rank B for Overall POWR Rating. It is ranked #12 out of 68 stocks in the Home Improvement & Goods industry. The Sherwin-Williams Company (SHW) SHW manufactures, sells, and distributes paints, stains, supplies, equipment, and floor coverings under three main segments – America Group, Consumer brands group, and performance coating group. Its customer base includes retail, industrial, commercial, and professional buyers. As people are forced to spend more time indoors during this pandemic, the demand for SHW’s products has risen significantly. SHW’s EBITDA of $979 million increased 7.8% year-over-year in the second quarter ended June 2020. Diluted income per share increased by 28.8% from the year-ago value to $6.48 per share. Net sales in the consumer brands group increased by 21.8% year-over-year to $980.20 million in the second quarter. Segment profit increased 68.7% from the year-ago value to $237.40 million. SHW’s net operating cash balance of $1.07 billion increased by 42% year-over-year. Diluted EPS grew at a CAGR of 14.2% over the past three years, while net income grew at a CAGR of 14.9% during the same period. The consensus EPS estimate of $7.18 for the third quarter ending September 2020 indicates a 7.9% improvement year-over-year. Moreover, SHW has an impressive earnings surprise history, as it beat street EPS estimates in three out of trailing four quarters. The consensus revenue estimate of $4.91 billion indicates a slight improvement from the year-ago value. SHW has gained more than 105% since hitting its 52-week low of $325.43 in March. The stock hit its 52-week high of $676.03 in August. SHW is rated a Strong Buy in our POWR Ratings system, with a grade of A in Trade grade, Buy & Hold Grade, Peer Grade, and Industry Rank. It is also ranked #1 out of 68 stocks in the Home Improvement and Goods industry. Lowe’s Companies, Inc. (LOW) LOW is a home improvement retailer operating in the United States, Canada, and Mexico. Its line of products caters to home construction, maintenance, repair, remodel, and decoration. LOW announced the expansion of its supply chain network on August 12th to support the growing demand for its products, as well as improve its home delivery system amid the healthcare crisis. In this regard, LOW plans to build 50 cross-dock delivery terminals, 7 bulk distribution centers, and 4 e-commerce fulfillment centers in the next 18 months. This venture is a part of its $1.7-billion expansion plan which began in 2018. On July 27th, LOW partnered with HomeAdvisor to promote its Pros Loyalty subscription program. Under the agreement, LOW’s Pro Loyalty members will get free year-long access to HomeAdvisor’s subscription program. It has also partnered with EGO to provide outdoor power equipment on Low’s websites and stores. LOW entered into a joint venture agreement with the Highfield Investment group to open a 1,230,000 square feet distribution center in Calgary Canada worth $120 million. LOW delivered impressive results in the second quarter ended July 2020, as net sales increased 3% year-over-year to $27.30 billion, with a 34.2% year-over-year rise in U.S. comparable sales. Net earnings grew 68.8% from the same period last year to $2.82 billion, while operating income increased 65.9% to $3.95 billion. With such expansion plans in place, LOW expects to profit significantly from the rising demand for home improvement products. LOW’s consensus EPS estimate of $1.88 for the third quarter ending October 2020 indicates a 33.3% improvement year-over-year. Moreover, LOW surpassed the street estimates in each of the trailing four quarters, which is impressive. The consensus revenue estimate of $20.57 billion for the ongoing quarter indicates an 18.3% increase year-over-year. LOW gained more than 150% since hitting its 52-week low of $60 in March to hit its 52-week high of $152.24 in August. LOW has an overall rating of Buy in our POWR Ratings system, consistent with its strong business model and expansion plans. It also has an A in Trade Grade and Industry Rank, and a B in Buy & Hold Grade and Peer Grade. It is also ranked #13 out of 68 stocks in the Home Improvement & Goods industry. Stanley Black & Decker, Inc. (SWK) SWK is a manufacturer of power and industrial tools, comprehensive security systems, and mechanical access solutions. It operates through three main segments – Tools & Storage, Security, and Industrial. SWK has been named as one of the 100 workplaces for Innovators according to Fast Company. On August 4th, SWK entered into a strategic partnership with Evolv Technology to upgrade its security systems with AI-backed touchless security screening. The pandemic affected SWK’s sales in the commercial segment, as offices remained shut during the lockdown between March and May. Its net earnings of $238.70 million in the second quarter ended June 2020 declined slightly year-over-year. However, diluted EPS grew 18% year-over-year. The gross profit margin improved by 33.1% in the trailing twelve months, while the EBITDA margin improved 15% during the same period. With the gradual reopening of workplaces in the second half of 2020, analysts expect SWK to witness an increase in demand for its products. The consensus revenue estimate of $3.85 billion for the third quarter ending September 2020 indicates a 5.9% improvement year-over-year. The consensus EPS estimate of $2.47 indicates a 16% growth from the year-ago value. Also, SWK beat the street EPS estimates in each of the trailing four quarters which bodes well for the stock. SWK has gained more than 120% since hitting its 52-week low of $70 in March. SWK’s strong fundamentals are reflected in its POWR Ratings. It has a Buy rating with an A in Trade Grade and Industry Rank, and B in Buy & Hold Grade and Peer Grade. In the 68-stock Home Improvement & Goods industry, SWK is ranked #14. Want More Great Investing Ideas? 7 Best ETFs for the NEXT Bull Market Will Stocks Fall into Historical September Slump? 9 “BUY THE DIP” Growth Stocks for 2020 HD shares were unchanged in after-hours trading Wednesday. Year-to-date, HD has gained 29.15%, versus a 6.66% rise in the benchmark S&P 500 index during the same period."}]}