{"article": [{"url": "https://stocknews.com/news/cfg-ayi-xlnx-trgp-mpc-top-5-large-cap-dividend-stocks-for-june-30-2020/", "published": 1593518900.0, "headline": "Top 5 Large Cap Dividend Stocks for June 30, 2020", "body": "The top winners in the large cap US dividend space for Tuesday, June 30, 2020 are CFG, AYI, XLNX, TRGP, and MPC. Below is a recap of how they fared. Citizens Financial Group Inc (CFG) Daily Price Recap Citizens Financial Group Inc is up 7.27% ($1.71) since yesterday, marking the 2nd day in a row it has gone up. The change in price came along side change in volume that was up 0.22% from previous day, but down 52.89% from the Monday of last week. The daily price chart of Citizens Financial Group Inc below illustrates. Its equity discount rate is lower than 10.73% of US dividend stocks. 7 Best ETFs for the NEXT Bull MarketIs CFG a Buy, Hold or Sell? See the POWR Ratings now! Acuity Brands Inc (AYI) Daily Price Recap Acuity Brands Inc came into today up 7.18% ($6.41) from the open of the day prior, marking the 2nd day in a row an upward move has occurred. The price move occurred on stronger volume; specifically, yesterday’s volume was up 122.34% from the day prior, and up 123.38% from the same day the week before. Below is a daily price chart of Acuity Brands Inc. Dividend investors may wish to pay attention to the dividend discount model value score of dividend stocks, and for AYI, its higher than that of 3.65% of US dividend-issuing stocks. Make investment decisions regarding AYI using the data that counts. Learn more about POWR Ratings. Xilinx Inc (XLNX) Daily Price Recap Xilinx Inc closed the day prior up 6.99% ($6.43); this denotes the 2nd day in a row an increase has occurred. As for how volume fared, yesterday’s volume was up 340.58% from the previous day (Sunday), and up 44.9% from Monday of the week before. Here is a daily price chart of Xilinx Inc. As for XLNX’s dividend discount model value score, it is currently higher than that of approximately 32.36% US dividend payers. What is the outlook for XLNX? Use POWR Ratings for clearer insight into price direction. Targa Resources Corp (TRGP) Daily Price Recap Targa Resources Corp is up 6.87% ($1.29) since the previous day, marking the 2nd day in a row it has gone up. The price move occurred on volume that was up 65.38% from the day prior, but down 19.1% from the same day the week before. The daily price chart of Targa Resources Corp below illustrates. As for TRGP’s annual compound dividend growth rate, it is currently higher than that of approximately 84.57% US dividend payers. Is TRGP a Buy, Hold or Sell? See the POWR Ratings now! Marathon Petroleum Corp (MPC) Daily Price Recap Marathon Petroleum Corp closed the day prior up 5.59% ($1.98); this denotes the 2nd day in a row an upward move has occurred. The change in price came along side change in volume that was up 39.3% from previous day, but down 75.17% from the Monday of last week. Let’s take a look at the daily price chart of Marathon Petroleum Corp. As for MPC’s beta, it is currently lower than that of approximately 4.27% US dividend payers. Make investment decisions regarding MPC using the data that counts. Learn more about POWR Ratings. To further your research on dividend stocks, check out our list of dividend stocks sorted by yield. Want More Great Investing Ideas? 9 “BUY THE DIP” Growth Stocks for 2020 Is the Bull S#*t Rally FINALLY Over? 7 “Safe-Haven” Dividend Stocks for Turbulent Times Top 3 Investing Strategies for 2020 CFG shares rose $0.06 (+0.24%) in after-hours trading Tuesday. Year-to-date, CFG has declined -36.09%, versus a -3.21% rise in the benchmark S&P 500 index during the same period."}]}