{"article": [{"url": "https://stocknews.com/news/amzn-shop-w-etsy-hsbc-wmt-fb-4-internet-stocks-making-new-all-time-highs/", "published": 1596456500.0, "headline": "4 Internet Stocks Making New, All-Time Highs", "body": "The e-commerce industry has seen a strong rise in orders across almost all consumer segments as customers continue to shop from home. As a result, stocks with a strong e-commerce footprint, have shown tremendous price momentum, with many stocks hitting all-time highs last month. Even as brick and mortar stores started to reopen with the relaxation of restrictions in many states, the demand for online shopping is here to stay. According to Adobe’s (ADBE) Digital Economy Index report, the first six months of 2020 has seen a spending of $368.8 billion on online platforms, and June saw a 76.2% year-over-year increase in online spending in the United States. Many companies have been forced to adapt to a digital marketplace in order to meet customer demands during this period. The pandemic has created a significant shift towards internet shopping, which has been a boon for internet stocks. Here are four Internet stocks that have hit their all-time highs and could hit new highs in the coming months: Amazon.com, Inc. (AMZN), Shopify Inc. (SHOP), Wayfair Inc. (W), and Etsy, Inc. (ETSY). 7 Best ETFs for the NEXT Bull MarketAmazon.com, Inc. (AMZN) AMZN’s exceptional second-quarter results are a testament to the company’s solid performance amid these uncertain times. Net sales for the quarter increased 40% year over year, and trailing-twelve-month operating cash flow grew 42% compared to a year ago. Furthermore, EPS increased to $10.30 from $5.22 a year ago. In July, AMZN announced the general availability of services such as Amazon Fraud Detector, Contact Lens, Interactive Video Service, and AWS IoT SiteWise. These, along with the recent announcement of a multi-year global agreement with HSBC Holdings plc (HSBC), in which its technology will be used by the bank to deliver new personalized banking services, should keep investors encouraged. AMZN recorded a new all-time high of $3,344.29 on July 13th and has grown more than 85% since its March lows. AMZN’s EPS is expected to grow 36% per annum over the next five years. How does AMZN stack up for the POWR Ratings? A for Trade Grade A for Buy & Hold Grade A for Industry Rank B for Peer Grade A for Overall POWR Rating You can’t ask for better. The stock is also ranked #1 out of 54 stocks in the Internet Group. Shopify Inc. (SHOP) SHOP is a Canadian e-commerce company with a market cap of $120.78 billion. Amy Shapero, Shopify’s CFO said, “The strength of Shopify’s value proposition was on full display in our second quarter. With our strong balance sheet and through prudent capital allocation, we remain well-positioned to continue solving critical pain points for our merchants and contribute to their success for years to come.” Since its March lows, the stock has gained more than 215% and hit its all-time high of $1107.92 on July 29th. In the second quarter, total revenue increased 97%, gross merchandise volume increased 119%, and gross profit was up 83% year over year. SHOP helped widen their merchant’s market reach through the Walmart (WMT) and Facebook (FB) channels. There was also a surge in shipping adoption as order volumes increased due to the e-commerce shift. SHOP has an impressive earnings surprise history with the company beating consensus EPS estimate in three of the trailing four quarters. The consensus EPS estimate for the quarter ending September 2020 of $0.42 reflects an improvement from its year-ago loss per share of $0.29. SHOP’s consensus revenue estimate of $642.94 million for the quarter indicates a year-over-year increase of 64.6%. SHOP’s POWR Ratings reflect this promising outlook. It has an overall rating of “Buy” with an “A” for Trade Grade and a “B” for Buy & Hold Grade, Peer Grade, and Industry Rank. Among the 34 stocks in the Internet-Services group, it’s ranked #9. Wayfair Inc. (W) Wayfair is one of the world’s largest e-commerce destinations for home products that has been benefiting from the online shopping trend amid the pandemic. The stock hit its all-time high of $267.43 on July 31st and is up by more than 1000% since its March lows. Perigold, which makes home décor and furnishing luxury products, is part of Wayfair’s brand portfolio. This luxury marketplace has added under 100 new home brands to its roster, which includes furniture and décor resources. W’s consensus revenue estimate of $4 billion for the quarter end June indicates a year-over-year increase of 70.8%. The consensus EPS estimate of $0.82 for the quarter compares to a loss of $1.35 per share reported a year ago. Moreover, W’s EPS is expected to grow 14% per annum in the next five years. In the first quarter this year, the number of active customers in W’s direct retail business increased 28.6% year over year, and there was a 27.9% increase in orders placed by existing customers over the same time period. W’s strong price momentum is reflected in its POWR Ratings. It has a “Strong Buy” rating with an “A” in Trade Grade, Buy & Hold Grade, and Peer Grade, and a ”B” in Industry Rank. Within the Specialty Retailers industry, it’s ranked #1 out of 33 stocks. Etsy, Inc. (ETSY) ETSY is a two-sided — buyers and sellers — online marketplace operating in the United States, the United Kingdom, Canada, Australia, France, and Germany. The stock hit its all-time high of $118.48 on July 31st this year, indicating a growth of almost 295% since its March lows. In the first quarter, total revenue was up 34.7%, and gross profit was up 24.8% year over year. There was also a surge in the number of active buyers and sellers, which increased 16.4% and 26.4% year over year, respectively. Reverb, a wholly-owned subsidiary of ETSY, recently announced the revision of its selling fee, which will help the online marketplace make investments in marketing initiatives, customer support, and seller tools attracting buyers to the site and also enhancing the visibility of sellers. The market expects the company to report EPS of $0.39 for the quarter ending June 2030, indicating a 178.6% increase over the year-ago number. Moreover, ETSY’s consensus revenue estimate of $329.75 million for the quarter indicates a year-over-year increase of 82.1%. It’s no surprise that ETSY is rated a “Strong Buy” in our POWR Ratings system. It also has an “A” for Trade Grade, Buy & Hold Grade, and Industry Rank, and a “B” for Peer Grade. In the 54-stock Internet industry, it is ranked #10. Want More Great Investing Ideas? 9 “BUY THE DIP” Growth Stocks for 2020 How HIGH Can This Tech Bubble Fly? 7 “Safe-Haven” Dividend Stocks for Turbulent Times AMZN shares were trading at $3,126.58 per share on Monday afternoon, down $38.10 (-1.20%). Year-to-date, AMZN has gained 69.20%, versus a 3.42% rise in the benchmark S&P 500 index during the same period."}]}