{"article": [{"url": "https://stocknews.com/news/run-wkhs-azre-peix-4-green-energy-stocks-to-grow-your-portfolio/", "published": 1600690100.0, "headline": "4 Green Energy Stocks to GROW Your Portfolio", "body": "Climate change is one of the biggest issues of this age. From rising forest fires in California to rampant hurricanes, the weather is having massive impacts on our way of life. Although 64% of Americans have stated that protecting the environment should be a top priority for the government, there is a big divide on what steps should be taken. Electricity generation accounts for 27% of the global carbon emissions, while transportation is responsible for 28% of greenhouse gas emissions, according to the United States Environmental Protection Agency (EPA). Add to this the increased efficiency and falling cost of alternative energy including solar and electric vehicles. Investing in these technologies is one area of bipartisan agreement. Many countries are also determined to reduce pollution to improve the quality of life and health of its citizens. Therefore, companies such as Sunrun, Inc. (RUN), Workhorse Group, Inc. (WKHS), Azure Power Global Ltd. (AZRE), and Pacific Ethanol, Inc. (PEIX) are expected to continue gaining and investing in their stocks are likely to result in greater gains in the coming months. 9 \"BUY THE DIP\" Growth Stocks For 2020Sunrun, Inc. (RUN) RUN develops, manufactures, and markets solar energy systems for residential projects across the United States. It also provides after-sale services such as installation and maintenance to its customers. RUN sells its products through direct to customer approach, online website, retail supply, canvassing and partner network, and referral. It was recently added to the S&P MidCap 400 index in the Industrials sector. RUN announced the acquisition of competitor Vivint Solar on July 6th, establishing the former as the leading solar energy service provider in the country, with a user base of more than 500,000. It has also entered into community choice aggregators (CCAs) in California to collective power one million homes in the Bay Area. RUN, SK, E&S, and other affiliated companies co-invested in new venture plans on July 29th to accelerate the adoption of renewables for electrifying houses across the country. RUN’s gross earning assets increased 18% year-over-year to $580 million in the second quarter ended June 2020. Net earning assets increased 14% from the prior-year value to $1.60 billion. Customer agreements and incentives revenue increased 15% from the year-ago value to $106.10 million. RUN has gained more than 500% since hitting its 52-week low in March. The stock hit its 52-week high of $63.93 in September. How does RUN stack up for the POWR Ratings? A for Trade Grade A for Buy & Hold Grade B for Peer Grade A for Overall POWR Rating. It is also ranked #1 out of 14 stocks in the Solar industry. Workhorse Group, Inc. (WKHS) WKHS builds high-performance batteries, electric cars, and aircraft in the United States. It also develops cloud-based, real-time telematics monitoring systems to optimize energy usage and monitor the efficiency of its automobiles and aircrafts. It is an original equipment manufacturer (OEM) and supplies its products in the market through its primary distributor, Ryder System, Inc. WKHS is the first and only medium battery electric vehicle OEM with approval from the Environmental Protection Agency and California Air Resources Board to sell its products across the country. WKHS entered into a strategic partnership with Hitachi Group to assess its operations and supply chain capabilities as well as develop a national dealer network across the country. WKHS’ net sales rose 1569.2% to $91,942 in the second quarter ended June 2020. It had a cash balance of $105 million at the end of the quarter, primarily due to a $70 million financing deal with an institutional investor. WKHS was added to the Russell 3000 index in June 2020 as well. The consensus revenue estimate of $2.30 million for the third quarter ending September 2020 indicates a 57,400% increase year-over-year. WKHS has gained more than 2000% since hitting its 52-week low of $1.32 in march. The stock hit its 52-week high of $30.88 in September. WKHS is rated a “Strong Buy” in our POWR Ratings system, consistent with its sound business model and impressive growth momentum. It has a grade of “A” in Trade Grade, Buy & Hold Grade, Peer Grade, and Industry Rank. In the 29-stock Auto & Vehicle Manufacturers industry, it is ranked #4. Azure Power Global Ltd. (AZRE) AZRE owns and operates solar power plants in India under long-term contracts with government agencies, non-governmental energy distribution companies, and commercial customers. It has 43 utility-scale projects and multiple commercial rooftop projects with a combined capacity of 1,808 MWp. AZRE has been named the most sustainable company in the solar energy industry by the World Finance magazine. It has also been ranked as the top 10th global renewable power producer by Sustainalytics. AZRE’s Operating Megawatts increased 12% year-over-year to 1,809 MWs in the fiscal first quarter ended June 2020. Operating and Committed Megawatts increased 112% from its year-ago value to 7,115 MWs. Revenue increased by 16% from the same period last year to $52.20 million. Non-GAAP adjusted EBITDA rose 29% year-over-year to $43.70 million. The consensus revenue estimate of $43.90 million for the fiscal second quarter ending September 2020 indicates an 8.9% increase year-over-year. AZRE’s EPS is expected to grow 108% annually over the next 5 years. AZRE has gained more than 180% since hitting its year-to-date low of $11.75 in January. The stock hit its 52-week high of $33.02 in August. AZRE is rated a “Strong Buy” in our POWR Ratings system, consistent with its sound business model and impressive financials. It has an “A” in Trade Grade, Buy & Hold Grade, and Peer Grade. It is also ranked #3 out of 14 stocks in the Solar industry. Pacific Ethanol, Inc. (PEIX) PEIX produces and supplies low-carbon renewable energy fuels across the United States. It operates through two main segments – Production and Marketing, and mainly manufactures ethanol across nine wholly-owned manufacturing plants. On July 27th, PEIX announced the expansion of the production capacity of its high-quality USP ethanol to 140 million gallons per year at the Illinois plant. PEIX reported impressive financials for the second quarter ended in June 2020. Gross profit increased 685.4% year-over-year to $31.18 billion. Net income rose significantly to $14.85 billion from the $8.29 billion loss during the same period last year. The consensus EPS estimate of $0.22 for the third quarter indicates a significant rise from the negative EPS reported in the same period last year. PEIX gained more than 990% year-to-date to hit its 52-week high of $7.24 in September. On August 6th, the company received affirmative NASDAQ compliance determination as its share prices rose above $1 since the last week of July. It is no surprise that PEIX is rated a “Strong Buy” in our POWR Ratings system, with an “A” in Trade Grade, Buy & Hold Grade and Peer Grade, and “B” in Industry Rank. It is also ranked #3 out of 27 stocks in the Agriculture industry. Want More Great Investing Ideas? 7 Best ETFs for the NEXT Bull Market Is the Stock Market Correction Over? Chart of the Day- See the Stocks Ready to Breakout RUN shares were trading at $59.35 per share on Monday afternoon, down $1.51 (-2.48%). Year-to-date, RUN has gained 329.76%, versus a 1.34% rise in the benchmark S&P 500 index during the same period."}]}