{"article": [{"url": "https://stocknews.com/news/wfc-gs-ms-bac-ubs-pnc-xlf-kre-wall-street-profits-as-main-street-suffers/", "published": 1595419700.0, "headline": "Wall Street Profits as Main Street Suffers", "body": "It’s important that investors pay attention to the growing divide within the financial sector between Wall Street banks and Main Street banks. Banks that generate a significant portion of their income from Wall Street are thriving but more consumer-focused banks are suffering as the main street economy suffers because of the coronavirus pandemic. Last week’s Q2 earnings report makes this clear: 9 \"BUY THE DIP\" Growth Stocks For 2020 (source: CNBC.com) Banks such as Morgan Stanley (MS) and Goldman Sachs (GS) have been able to find success this past quarter because capital markets are very strong: the stock market has seen a massive rally since bottoming out on March 23rd, the robust IPO market has returned, and corporations able to borrow at record-low rates. In the second quarter, GS reported revenue of $13.3 billion which was 41% higher than the previous year. MS posted $10.2 billion in revenue for the quarter which was a 32% increase from 2019’s Q2. In contrast, banks whose businesses primarily rely on individuals and small businesses, like Wells Fargo (WFC) and Bank of America (BAC), are challenged because unemployment is at 11%, small business bankruptcies are accelerating, and economic confidence has plummeted. WFC had to cut its dividend and if there is an increase in defaults then other banks may have to follow. Compare this to GS which increased its dividend. It’s not a coincidence that GS and MS are rated as Buys by our POWR Ratings system, while WFC has a Strong Sell rating, and BAC has Neutral rating. Anticipating a Wave of Defaults As a result of the economic weakness, banks have set aside billions in reserves to cushion against defaults. In total, banks with a blend of capital markets and banking like JPMorgan (JPM), Bank of America, Wells Fargo, and Citi (C) have set aside $21 billion in loan-loss reserves by $21 billion. Regional banks whose businesses are even more concentrated on banking like PNC (PNC), and US Bancorp (USB) have set aside $10 billion in loan-loss reserves. The tone of management commentary was also cautious about the economic outlook given several uncertainties like the virus’ continued spread, Congress’ decision on the enhanced unemployment benefits, and the economy’s ability to recover from this shock. Significant challenges for these banks remain past the threat of defaults. Lending is less profitable due to lower interest rates. Banks borrow based on short-term rates and lend based on long-term rates. Currently, the spread between the 3 month Treasury bill and 10-year Treasury note is 0.45%. Additionally, there is decreased demand for loans given the weak economy. Further, the boom in mortgage refinancing also dents bank profits as they are trading higher-interest loans for lower-interest ones. Regional Banks Even Worse-Off While the situation is tough for banks like Wells Fargo and Bank of America, it’s even bleaker for regional banks like PNC and UBS. WFC and BAC have trading and wealth management divisions that can negate some of the weaknesses in banking, but regional banks have minimal exposure to capital markets. Their profits are much more connected to the health of the “real economy” and the yield curve which are weak and flat, respectively. Below is a chart of the regional banks (KRE) versus the broader financial sectors ETF (XLF) and the S&P 500: (source: stockcharts.com) KRE is 35% off its 52-week highs, while the XLF is 20% lower, and the S&P 500 is 4% below its highs. Looking Ahead It’s difficult to imagine what will cause a reversal in this trend. While it’s quite easy to imagine what could cause these trends to get worse, like Congress failing to pass another round of fiscal stimulus or the virus’ spread getting even worse, leading to another round of shutdowns. In terms of the yield curve, the Fed has already pledged to keep rates low until 2022 which indicates that refinancing and lending will weigh on earnings. Further, FOMC Chair Powell has discussed that “yield curve control” might be the Fed’s next step in the stimulus which would essentially lead to capping long-term rates at a certain amount. The chart below shows the aggressiveness of the Fed and also the slowdown in economic activity. (source: Federal Reserve) Money supply has exploded higher to record levels, while the velocity of money has declined. This chart encapsulates the challenge for Main Street banks and the bright outlook for Wall Street. The Fed stimulates based on its assessment of the “real economy”, however, Wall Street is the mechanism through which this stimulus flows into the economy. This results in soaring asset prices, increases in capital markets activity like investment banking, M&A, and share buybacks, and trading activity. However, if economic metrics like unemployment, wages, or growth fail to meaningfully respond to the Fed’s stimulus then it increases the dose which leads to even more profits for Wall Street. This is exactly what’s happening. The economic recovery has been weak and uninspiring. The Fed is going to take even more aggressive measures to combat the malaise. It’s uncertain whether it will be enough to alter the economy’s trajectory, but it will likely lead to more gains for Wall Street. Want More Great Investing Ideas? 9 “BUY THE DIP” Growth Stocks for 2020 Newly REVISED 2020 Stock Market Outlook 7 “Safe-Haven” Dividend Stocks for Turbulent Times WFC shares . Year-to-date, WFC has declined -49.67%, versus a 2.60% rise in the benchmark S&P 500 index during the same period."}]}