{"article": [{"url": "https://stocknews.com/news/rcl-ual-ccl-spy-3-worst-performing-stocks-on-the-sp-500-year-to-date/", "published": 1596802100.0, "headline": "3 Worst Performing Stocks on the S&P 500 Year-to-Date", "body": "It is important to keep an eye on stocks that could ruin your portfolio. So, identifying stocks in the hardest hit industries and avoiding them is as important as investing stocks with immense upside potential. Among others, the airline and cruise industry were ravaged by the pandemic. It’s hard to predict a reasonable recovery for stocks in these two industries over the short term. The Centers for Disease Control and Prevention (CDC) announced in mid-July the extension of a no sail order for cruise ships until September 30th, 2020. The airline industry is also experiencing reduced traffic. The only hope for these two industries to get back to pre-COVID business levels is a potential cure or vaccine for the coronavirus. 9 \"BUY THE DIP\" Growth Stocks For 2020The SPDR S&P 500 ETF (SPY) has only gained a little over 3% year-to-date. Royal Caribbean Cruises Ltd. (RCL), United Airlines Holdings, Inc. (UAL) and Carnival Corporation (CCL) are three S&P 500 stock that have been responsible for dragging the index down. Royal Caribbean Cruises Ltd. (RCL) RCL has recently announced that it would be extending the suspension cruises, including those departing on or before October 31st, except cruises sailing from China and Australia. In the first quarter, GAAP net loss was $1.4 billion compared to an income of $249.7 million a year ago. Furthermore, RCL’s long term debt of $12.27 billion, as reported in the first quarter, is a worry for investors. The stock has plummeted by more than 60% year-to-date. RCL has a dismal earnings surprise history with the company failing to surpass consensus EPS estimates in three of the trailing four quarters. The company’s consensus revenue estimate of $43.5 million for the quarter ending in June 2020 indicates a year-over-year decline of 98.5%. Also, the market expects the company to report a loss per share of $4.82 for the quarter end, which represents a significant decrease over the year-ago earnings per share of $2.54. RCL’s POWR Ratings are consistent with this bleak outlook. It has an overall rating of Sell with an F for Industry Rank, Trade Grade, and Buy & Hold Grade. United Airlines Holdings, Inc. (UAL) UAL’s second quarter was the most difficult financial quarter in its 94-year history. Total operating revenues were down 87.1% year-over-year, and the company recorded a net loss of $1.6 billion compared to its previous year’s net income of $1.052 billion. UAL is down by more than 60% year-to-date. The company said, contingent on demand, it would furlough 2,250 pilots between October and December and another 1,650 next year. UAL’s consensus revenue estimate of $2.75 billion for the quarter ending September 2020 indicates a year-over-year decline of 75.8%. Also, the market expects the company to report a loss per share of $7.37 for the quarter, which compares to the year-ago earnings per share of $4.07. UAL’s poor prospects are also apparent in its POWR Ratings, which gives it a Strong Sell rating. It also has an F for Trade Grade, Buy & Hold Grade, and Industry Rank. Within the Airlines industry, it’s ranked #11 out of 22 stocks. Carnival Corporation (CCL) Recently, the relaunch of CCL’s AIDA cruises has been delayed as they have not received approval from their registered country, Italy. There has also been a class action complaint filed by many law firms on behalf of shareholders accusing CCL to have violated federal security laws. In the first quarter, sales decreased 2.7%, and consolidated operating income was down 2.2% year-over-year. The stock has dropped by more than 70% year-to-date. CCL’s consensus revenue estimate of $256.18 million for the current quarter represents a year-over-year decrease of 96.1%. Also, the market expects the company to report a loss per share of $2.16 for the current quarter, representing a significant reduction over the year-ago earnings per share of $2.63. CCL’s EPS is expected to decline by 35.1% per annum in the next five years. According to the POWR Ratings, CCL is a Strong Sell. It also has an F for Trade Grade, Buy & Hold Grade, and Industry Rank. It’s ranked #3 out of 5 stocks in the Travel-Cruises industry. Want More Great Investing Ideas? 9 “BUY THE DIP” Growth Stocks for 2020 How to Trade THIS Stock Bubble? 7 “Safe-Haven” Dividend Stocks for Turbulent Times RCL shares fell $0.04 (-0.08%) in after-hours trading Friday. Year-to-date, RCL has declined -60.59%, versus a 5.02% rise in the benchmark S&P 500 index during the same period."}]}