{"article": [{"url": "https://stocknews.com/news/gold-au-kgc-hmy-4-mining-stocks-to-buy-as-gold-surpasses-all-time-highs/", "published": 1596110900.0, "headline": "4 Mining Stocks to Buy as Gold Surpasses All-time Highs", "body": "The price of gold just keeps on climbing amidst growing economic, social and governmental uncertainty. The question is not whether the price increase is justified but how high it will go. If investors gradually shy away from buying stocks, it is quite possible even more money will be parked in the safe haven of gold, sending its price to even higher highs. Therefore, mining stocks are worth a closer look as the gold rush plays out. Let’s take a look at four of the most attractive mining stocks: Barrick Gold Corporation (GOLD), AngloGold Ashanti Limited (AU), Kinross Gold Corporation (KGC) and Harmony Gold Mining Company (HMY). Barrick Gold Corporation (GOLD) 7 \"SAFE HAVEN\" Dividend Stocks for Turbulent TimesInvestors have the opportunity to invest in the world’s largest gold mining business in Barrick Gold (GOLD). GOLD’s operations span five continents. GOLD mined nearly six million ounces of gold along with more than 400 million pounds of copper last year alone. The POWR Ratings show GOLD has A grades in each POWR Component but except the Peer Grade. GOLD has an industry rank of #2 out of 30 stocks in the Miners – Gold category. The analysts have established a price target of $30.65 for GOLD, which is currently about 8% away from its current price. Do not be scared away by the fact that GOLD’s price has increased more than 50% this year alone. It costs GOLD merely $954 to mine a single ounce of the precious metal in terms of all-in sustaining costs (AISC). GOLD should continue to shine as the price of the precious metal continues to rise. AngloGold Ashanti Limited (AU) If you are on the prowl for a mining stock that has its metaphorical eggs spread out across a couple baskets, AU is worth your analysis. AU has gold mining operations in 10 countries. AU also produces sulphuric acid and uranium oxide. The POWR Ratings reveal AU has perfect A grades across each POWR Component. AU is ranked in the top five of 30 stocks in the Miners – Gold category. Though AU has exceeded the analysts’ price target of $33, those who have reviewed the stock insist it is a buy as it has zero Hold or Sell ratings. Add in the fact that AU has a reasonable forward P/E ratio of 19 and the stock becomes even more tempting. Kinross Gold Corporation (KGC) When it comes to pinpointing the location of gold and extracting it with efficiency, few companies top KGC. KGC mines and processes gold and silver ore throughout North and South America, Russia and other parts of the world. KGC has flawless POWR Ratings with A grades in each POWR Component. KGC is ranked in the top 10 of 30 stocks in the Miners – Gold category. The top analysts have set a price target of $9.41 for KGC, which is nearly 7% from its current price. Of the eight analysts that cover the stock, five recommend buying KGC while three recommend holding. None of the eight analysts advise selling KGC. Add in the fact that KGC has quite the low forward P/E ratio of 14 and it is hard to pass up this mining superstar. Harmony Gold Mining Company (HMY) Gold mining companies intent on maximizing profit do more than merely mine the yellow metal. Truly comprehensive gold mining companies explore, mine, process, refine and smelt gold. HMY conducts each of these processes. The POWR Ratings show HMY has an A grade in the Trade Grade and Industry Rank POWR Components. HMY also has a B grade in the Buy & Hold Grade POWR Component. HMY is another mining stock with an enticing low forward P/E ratio. At the moment, HMY’s forward P/E ratio is slightly above 13, meaning it has considerable value at its current trading price of $6 and change. Look for HMY to break through its 52-week high of $7.61 as the economic recession continues through the end of the summer and even more money moves into gold mining stocks. Want More Great Investing Ideas? 9 “BUY THE DIP” Growth Stocks for 2020 How HIGH Can This Tech Bubble Fly? 7 “Safe-Haven” Dividend Stocks for Turbulent Times GOLD shares were trading at $28.04 per share on Thursday morning, down $0.74 (-2.57%). Year-to-date, GOLD has gained 51.78%, versus a 0.80% rise in the benchmark S&P 500 index during the same period."}]}