{"article": [{"url": "https://stocknews.com/news/pypl-etsy-mdb-3-top-growth-stocks-to-invest-1000-in-a-market/", "published": 1601899700.0, "headline": "3 Top Growth Stocks to Invest $1,000 in a Market Selloff", "body": "The COVID-19 pandemic has wreaked havoc on both our personal and professional lives since the start of 2020. Equity markets have been extremely volatile and uncertainty continues to loom large as we head into the fourth quarter of the year. It is quite possible that another market crash is on the cards given falling GDP figures and high unemployment rates. Whether or not the market corrects once again, investors can take advantage of underlying conditions to identify quality growth stocks and hold them over the long-term. When it comes to investing in growth stocks, just a handful of companies have the potential to grow your wealth multifold and generate market-beating returns. Here we take a look at three such stocks that you can buy for long-term gains: Paypal (PYPL), Etsy (ETSY), and MongoDB (MDB). 7 Best ETFs for the NEXT Bull MarketA digital payment company The first stock in the list is PayPal (PYPL), a fintech company, and one of the largest digital payments platforms in the world. PayPal’s platform enables digital and mobile payments for consumers and merchants all around the globe. It has a portfolio of payment solutions that include PayPal, PayPal Credit, Venmo, Xoom, Braintree, and iZettle. This product expansion has helped the company increase revenue and earnings at an astronomical pace over the years. PayPal’s revenue has increased from $10.8 billion in 2016 to $17.8 billion in 2019. Analysts expect revenue to grow by 20.4% to $21.4 billion in 2021 and 19.3% to $25.5 billion in 2022. In 2019, PayPal managed to increase its active accounts by 14% to 305 million. Comparatively, it processed 12.4 billion payment transactions, up 25% while total payment volume processed grew 23% year-over-year to $712 billion. In the second quarter of 2020, PayPal’s total payments volume rose 29% to $222 billion and it added 21.3 million new users as well. The company expects to add 70 million net new active accounts in 2020. The COVID-19 pandemic has acted as a major tailwind for e-commerce companies and this has also helped PayPal add users at a stellar pace in 2020. Its revenue rose 22% to $5.6 billion while free cash flow grew by an enviable 112% to $2.2 billion. PayPal’s robust revenue and earnings growth in the last five years has meant the stock is up 500% since October 2015. PayPal stock is trading at a forward price to earnings multiple of 51x which might be considered expensive. However, analysts forecast earnings to grow by 24% annually in the next five years. An e-commerce platform The COVID-19 pandemic has changed consumer behavior drastically in a matter of a few months. Total e-commerce sales now account for 16% of retail sales, up from 11% at the end of 2019. This meant e-commerce platforms such as Etsy (ETSY) have experienced staggering growth this year, while traditional retail stores have been decimated. Etsy is an online marketplace for unique and creative goods. It connects millions of buyers and sellers all over the world and ended Q2 with 60.3 million active buyers and 3.1 million active sellers. In the last 12-months, Etsy has generated over a billion dollars in sales. While the company’s revenue rose 35% year-over-year in Q4 of 2019, it accelerated to an astounding 137% in the June quarter. Etsy has estimated its total addressable market at $100 billion and given the company’s gross merchandise volume of $6.9 billion in the last four quarters, it has enough potential to drive top-line growth higher. Etsy is now expanding into other retail verticals including apparel and personal care products. It is also investing heavily in machine learning and algorithms which makes it easy for the consumer to find relevant products and improve customer engagement. The e-commerce platform’s growth should normalize as retail stores reopen. However, investors can be assured of double-digit growth rates over the next few years given the accelerated shift to online shopping. Etsy stock has returned close to 350% since bottoming out in March this year which means it is trading at a forward price to sales multiple of 10.5 and a price to earnings multiple of 68. However, its earnings growth is forecast at 57% annually over the next five years. A database heavyweight The third stock on the list is an enterprise-facing database storage company MongoDB (MDB). The company was founded in 2007 and aims to address concerns of legacy databases that operate on a row and column format. The exponential growth in data has made legacy database platforms irrelevant which has enabled application-developer-centric companies like MongoDB to come to the fore. MDB’s database platform was built to handle reams of unstructured data on the cloud and counts tech giants such as Adobe and Google as its customers. The company’s primary revenue driver is its Atlas business which allows customers to scale up databases enabling it to grow overall sales at an annual growth rate of 61% in the last three years. Despite lower enterprise spending amid COVID-19, MDB has grown sales by 46% and 39% in the last two quarters. According to research reports, the global database market might reach $100 billion by 2023. Given MongoDB’s expected sales of $553 million in fiscal 2021, we can see the company is well poised to crush market returns in the upcoming decade. MongoDB stock remains unprofitable and is trading at an expensive forward price to sales multiple of 25. It has returned 680% since the stock went public back in October 2017. The final takeaway Though these three stocks could be considered expensive at current multiples, no industry expert can accurately predict a stock market crash. And these three companies have secular tailwinds and expanding addressable markets which will drive revenue and profitability growth for the long-term. Want More Great Investing Ideas? Do NOT Buy Stocks Before the Election! 7 “Safe-Haven” Dividend Stocks for Turbulent Times Chart of the Day- See Christian Tharp’s Stocks Ready to Breakout PYPL shares were trading at $195.54 per share on Monday afternoon, up $3.63 (+1.89%). Year-to-date, PYPL has gained 80.77%, versus a 6.52% rise in the benchmark S&P 500 index during the same period."}]}