{"article": [{"url": "https://stocknews.com/news/pypl-intu-gdot-3-covid-proof-financial-stocks-to-buy-now/", "published": 1594382900.0, "headline": "3 Covid-Proof Financial Stocks to Buy NOW", "body": "Like other industries, the financial services industry was hit hard by the pandemic. This is evident from the iShares U.S Financial Services ETF’s (IYG) 22.3% year to date loss which is much steeper than the S&P 500’s loss of 2.4% over the same time period. However, the performance of a few financial stocks have been really impressive since the beginning of the pandemic, as they operate largely on digital platforms, online portals, and software systems. Amid the rising spread of the deadly virus, people are depending more on these platforms. The shift from physical to digital payment transactions has been rising with individuals and businesses trying to avoid exposure to the virus. 9 \"BUY THE DIP\" Growth Stocks For 2020Here are three financial stocks that should continue to move higher through the remainder of 2020: PayPal Holdings Inc. (PYPL) PYPL provides a secure online payments platform along with its Venmo mobile payment service. There has been an apparent shift from physical to mobile payments over the years and this shift has gathered momentum due to the Covid-19 pandemic. PYPL’s digital payment platform has become an essential service that has witnessed a 17% year-over-year increase in active accounts in the first quarter. PYPL’s Honey acquisition, an online browser extension company that provides coupons on e-commerce sites, would simplify the online shopping experience for customers. With more than 300 million customers across 200 markets, PYPL has a strong business continuity in the global economy. Since its March lows, the stock has more than doubled to $183.23 per share. The company reported a free cash flow of $1.3 billion in the first quarter, which represents a 60% year-over-year growth. PYPL has returned 69.4% year to date. How does PYPL stack up for the POWR Ratings? A for Trade Grade A for Buy & Hold Grade A for Peer Grade B for Industry Rank A for overall POWR Ratings It ranks #1 out of 45 in the Consumer Financial Services industry Intuit Inc. (INTU) INTU provides financial management solutions through its global platform with products such as QuickBooks, Mint, and TurboTax. INTU is getting ready to become an AI-driven platform, and it has recently laid off 715 employees to focus on enhancing its AI capabilities. INTU is looking to build for the future and has plans to increase sales and improve customer experience. This year, INTU announced that it would acquire Credit Karma, an American personal finance company, in a $7.1 million deal to enhance its personal finance offerings. This would be the company’s largest acquisition ever. INTU’s ruthless approach to grow and adapt its infrastructure to future market needs makes the stock an attractive choice for investors. INTU has returned 11.5% over the past year and 18.2% year to date. The stock has an annual dividend of $2.12 and a 35.5% payout ratio. Our POWR Ratings system rates INTU a Strong Buy. It has a grade of A for all POWR components except Industry Rank in which it has a grade of B. In the Consumer Financial Services Industry, it’s ranked #2 out of 45 stocks. Green Dot Corp. (GDOT) GDOT’s price consistently nosedived throughout 2019 due to poor investment and business decisions. However, GDOT started recovering at the beginning of 2020. GDOT is determined to ensure that this comeback is sustained and leads to better performance. The company announced a new CEO, Greg Quarles for Green Dot bank, and a new CEO, Dan Henry for the Green Dot Corporation. GDOT’s Banking as a Service (BaaS) platform has attracted large companies such as Uber (UBER), Apple (APPL), Walmart (WMT), and Intuit (INTU) to enter into multi-year agreements with GDOT. Furthermore, GDOT would most likely gain in terms of more customers and reduced competition due to the fall of German fintech Wirecard, which is suspected of financial fraud. GDOT has returned 106.4% over the past six months and 112.6% year to date. In the first quarter this year, the GDOT’s operating revenue increased 6.4% year over year. GDOT is approaching its 52-week high of $52.13, which could mean a bullish trend. Our POWR Ratings system has GDOT as a Strong Buy. It has a grade of A for all POWR components except Industry Rank in which it has a grade of B. In the Consumer Financial Services Industry, it’s ranked #4 out of 45 stocks. PYPL shares were trading at $177.57 per share on Friday afternoon, down $5.66 (-3.09%). Year-to-date, PYPL has gained 64.16%, versus a -0.63% rise in the benchmark S&P 500 index during the same period."}]}