{"article": [{"url": "https://stocknews.com/news/atvi-kr-bgs-med-4-dividend-stocks-to-fund-your-retirement/", "published": 1598270900.0, "headline": "4 Dividend Stocks to Fund Your Retirement", "body": "The dovish stance of the Fed has adversely affected retirement portfolios containing fixed income securities. As a result, individuals are focusing towards dividend paying stocks to ensure a higher regular income. Of course, no one likes shifting their investments to dividend stocks if there are chances of high capital loss. So, it’s prudent to add good dividend-paying stocks that are fundamentally strong enough to escape market downturns. With trillions of dollars provided by the government as incentive to boost business operations, and the gradual recovery of the economy from the virus-led slowdown, companies such as Activision Blizzard, Inc. (ATVI), The Kroger Co. (KR), B&G Foods, Inc. (BGS) and Medifast, Inc. (MED) are likely to gain significantly in the upcoming months of 2020. 7 \"SAFE HAVEN\" Dividend Stocks for Turbulent TimesThese companies have a reliable dividend payout history, which is beneficial for individuals relying heavily on dividend income. Activision Blizzard, Inc. (ATVI) ATVI develops and distributes content and services on video game consoles, personal computers, and mobile devices in the Americas, Europe, the Middle East, Africa, and the Asia Pacific. Operational since 1979, the most famous product franchises owned by ATVI include Call of Duty, World of Warcraft, Diablo, Hearthstone, Overwatch, and Candy Crush. As one of the most popular gaming platforms worldwide, ATVI had a monthly active user base (MAU) of 428 million as of June 30th. With virtual gaming gaining popularity during these unprecedented times, ATVI’s impressive second-quarter results indicate its dominating position in this market. ATVI’s net revenues increased 37.8% to $1.93 billion in the second-quarter ended June 2020. Net revenue from digital channels of $1.59 billion increased 45.8% from the year-ago value. ATVI pays an annual dividend of $0.41 per share, which yields 0.49% based on its current price. With a negative debt balance, ATVI has enough cash flow to sustain its dividend payouts for a prolonged time period. In fact, ATVI has increased its dividend payouts consistently every year since 2010. With the new normal here to stay, the gaming industry is expected to grow in the remaining months of 2020. In this regard, ATVI net bookings are expected to be $1.65 billion in the third quarter ending September 2020. To reach this target, ATVI raised $2 billion in unsecured senior notes as of August 10th for financing and general corporate purposes. The consensus EPS estimate of $0.64 for the third-quarter ending September quarter indicates a 100% rise year-over-year. Also, ATVI has an impressive earnings surprise history, as it beat the street revenue estimates in each of the trailing four quarters. The consensus revenue estimate of $1.69 billion for the upcoming quarter indicates a 39.8% growth from the same period last year. ATVI gained more than 70% to hit its 52-week high of $ 87.73 in August since hitting its year-to-date low of $$50.51 in mid-March. How does ATVI stack up for our POWR Ratings? A for Trade Grade A for Buy & Hold Grade B for Peer Grade B for Industry Rank A for overall POWR Rating You can’t ask for better. ATVI is also ranked #1 out of 13 stocks in the Entertainment – Toys & Video Games industry. The Kroger Co. (KR) KR is a retail seller of processed food items and medicines through a chain of supermarkets, multi-department stores and price impact warehouse stores across the United States. Its marketplace stores offer groceries, healthcare and beauty products, general merchandise and fuel. KR pays an annual dividend of $0.71, which yields 2.01% based on its current price. Its trailing twelve-month cash flow balance is higher than 91.3% of dividend paying stocks listed in the Stocknews.com universe. KR’s price volatility is lower than 92.6% of U.S. stocks in our set, implying a relatively stable dividend yield. Also, its strong cash flow position ensured steady dividend payouts every quarter for the last seven years. The consensus EPS estimate of $0.50 for the fiscal second-quarter ended July 2020 indicates a 13.6% rise year-over-year. Moreover, KR beat the street EPS estimates in three out of trailing four quarters, which is impressive. The consensus revenue estimate of $29.62 billion for the about-to-be-reported quarter indicates a 5.2% year-over-year improvement. KR has gained more than 35% since hitting its year-to-date low of $26.72 in January. The stock hit its 52-week high of $36.89 in August. It’s no surprise that KR is rated “Strong Buy” in our POWR Ratings system, with an “A” in Trade grade, Buy & Hold Grade and Industry Rank. In the 18-stock Grocery/ Big Box Retailers industry, KR is ranked #5. B&G Foods, Inc. (BGS) BGS manufactures and supplies frozen foods, canned food items and other perishables across the United States, Canada and Puerto Rico. Due to its integrated supply chain network across areas of operation, BGS remained profitable despite the virus driven recession. For the second-quarter ended June 2020, BGS’s net sales increased 38.1% year-over-year to $512.50 million. The company’s net income of $44.90 million increased 146.1% from the same period last year. BGS’s free cash flow CAGR of 57.36% is higher than 90% dividend stocks in the Stocknews.com universe, ensuring sustainable quarterly dividend payouts every year. BGS pays $1.90 to its shareholders annually as dividend, which yields 6.32% on its current price. The consensus EPS estimate of $0.65 for the third quarter ending September 2020 indicates a 20.3% rise year-over-year. The street revenue estimate of $456.90 million for the upcoming quarter indicates a 12.5% increase from the year-ago value. BGS gained more than 195% since hitting its 52-week low of $10.39 in March. The stock hit its 52-week high of $30.95 in August. It’s no surprise that BGS is rated “Strong Buy” in our POWR Ratings system. It also holds an “A” in Trade Grade, Buy & Hold Grade and Industry Rank, and a “B” in Peer Grade. It is ranked #14 out of 56 stocks in the Food Makers industry. Medifast, Inc. (MED) MED is a retail distributor of consumable health and nutritional products which aid in weight management and weight loss. It operates under Medifast, OPTAVIA, Thrive by Medifast, Optimal health by Take Shape for life and flavors of home brands. MED’s net revenue of $220 million in the second-quarter ended June 2020 increased 17.6% from its prior-year period, while net income grew 2.6% year-over-year to $21.90 million. MED’s EBITDA-to-net-debt ratio of 97,295,000 is better than 90.9% of the stocks in the Stocknews.com universe. The company has a higher cash reserve than debt. MED currently pays an annual dividend of $4.52, which yields 2.74%. The company has continuously increased its dividend payouts every year since 2015. The consensus EPS estimate of $2.37 for the third-quarter ending September 2020 indicates a 79.5% improvement year-over-year. Moreover, MED has an impressive earnings surprise history, as it beat the street EPS estimates in three out of trailing four quarters. The consensus revenue estimate of $235.12 million indicates a 23.7% year-over-year increase. MED gained more than 270% to hit its 52-week high of $183.54 in August since hitting its 52-week low of $49.03 in March. MED is rated “Buy” in our POWR Ratings system, with a “B” in Trade Grade and Buy & Hold Grade. It is currently ranked #4 out of 14 stocks in the Medical – Consumer Goods industry. Want More Great Investing Ideas? The Best of StockNews 2 Step Process to Sell @ Market Top in September 9 “BUY THE DIP” Growth Stocks for 2020 ATVI shares were trading at $82.66 per share on Monday afternoon, down $0.55 (-0.66%). Year-to-date, ATVI has gained 40.03%, versus a 7.40% rise in the benchmark S&P 500 index during the same period."}]}