{"article": [{"url": "https://stocknews.com/news/aapl-stne-siri-gold-brk-a-3-warren-buffett-stocks-to-buy-for-2020-and-beyond/", "published": 1598270900.0, "headline": "3 Warren Buffett Stocks to Buy for 2020 and Beyond", "body": "When it comes to long-term investing, few have managed to match Warren Buffett’s ability to pick exceptional stocks. Buffett’s winning picks have made him one of the most successful investors over the last five and a half decades. Whether they are outright acquisitions or a minority stake, Buffett’s investments are closely watched by Wall Street. In the most recent filing for the Buffett-owned Berkshire Hathaway (BRK.A), the company disclosed it bought 20.91 million shares of Barrick Gold (GOLD) worth $613.2 million, indicating a 1.2% stake in the gold miner. Shortly after the filing, Barrick Gold stock gained 11%, adding to its year-to-date gains of 50%. The Oracle of Omaha has also created massive wealth for Berkshire investors. Between 1965 and 2019, the stock generated annual returns of over 20% which means a $1,000 investment in Berkshire Hathaway in 1965 would have ballooned to $27.4 million in 2019. 7 Best ETFs for the NEXT Bull MarketWarren Buffett focuses on companies that manage to grow revenue and net profit at a steady rate and that have a capable leadership team. Let’s take a look at three such stocks that investors can look to buy right now and hold for the upcoming decade. A technology giant The first stock on the list is Apple (AAPL), a company that recently touched a $2 trillion valuation. Shares of Apple are trading at $505 and have returned more than 66% year-to-date. Apple has doubled its trillion-dollar valuation in less than two years and is Warren Buffett’s top holding. Berkshire Hathaway owns 250.86 million shares of Apple worth $124 billion, indicating a 5.9% stake in the tech behemoth. It is Berkshire’s largest investment and accounts for over 50% of the company’s total portfolio cumulatively valued at $246 billion. In the last 10 years, Apple stock has returned 1,320% and has enough steam left given the company’s multiple growth drivers. Apple’s Services revenue has been its fastest-growing segment for a few years now. The Services business has several subscription verticals including Apple Music, Apple TV+, Apple Arcade, and Apple Care. This portfolio will ensure a steady stream of recurring income across business cycles and will help mitigate volatility from its hardware segment. Analyst upgrades Apple stock The iPhone continues to remain Apple’s largest business segment and accounted for over 40% of sales in the most recent quarter. According to Wedbush analyst Daniel Ives, the upcoming iPhone 12 ‘supercycle’ is a near-term tailwind for revenue growth. Despite tepid consumer demand amid COVID-19, Apple has a “once in a decade” opportunity in the next 12 to 18 months with regards to iPhone sales. Ives has forecast that 350 million of the 950 million iPhones are part of the upgrade cycle. China, which is a huge market, will account for 20% of these upgrades once the iPhone 12 is launched. Ives maintained an outperform rating on the stock with a price target of $515 and a “bull case” price target of $600. Apple is also the largest player in wearable segments with market-leading products including the Apple Watch and AirPods. The COVID-19 pandemic and the shift to remote work will continue to drive demand in Apple’s other hardware business segments such as the MacBook and iPad. A bet on Brazil and Latin America Berkshire Hathaway owns 14.1 million shares of StoneCo (STNE) worth $706 million, indicating a 4.4% stake in the company. StoneCo is a Brazil-based financial technology solutions provider that allows enterprises to conduct e-commerce across online, in-store, and mobile channels. Its cloud-based platform helps companies get paid and grow their businesses. Despite the COVID-19 pandemic, StoneCo’s Q2 revenue growth stood at 14% year-over-year with an adjusted pre-tax margin of 30%. This was higher than the adjusted pre-tax margin guidance of between 20% and 24% that StoneCo provided in its last earnings call. StoneCo said its Q2 results, “Reflect both a stronger recovery in our clients’ businesses than previously anticipated as well as our execution capabilities and client diversification effects.” StoneCo’s financial platform accelerated its growth rate with digital banking open accounts touching 285,000 clients in July. Further, its banking services revenue was up 3.5x times in just one month between June and July. StoneCo recently announced a $1.1 billion deal to acquire Linx, another Brazil-based company that provides retail management software to online and traditional stores. We can see that StoneCo is looking to grow aggressively via acquisitions as well. E-commerce has tremendous potential for growth in Brazil in the upcoming decade. In 2019, total e-commerce retail sales accounted for less than 5% of total sales in the country and the ongoing pandemic will accelerate this trend in other Latin American countries as well, which will be a major revenue driver for the firm. STNE stock is trading at a forward price to earnings multiple of 94x but analysts also expect it to grow earnings by 77.4% in 2021. StoneCo’s expanding addressable market, Latin America’s growing middle class, and improving bottom-line make it a top stock to buy right now. A satellite radio provider Berkshire Hathaway owns 50 million shares of Sirius XM Holdings (SIRI) worth $291 million, indicating a 1.2% stake in the company. Sirius XM has been one of the top-performing stocks in the last decade and has gained close to 500% since August 2010. Sirius is a leading satellite radio provider and has a market cap of $25.2 billion. Sirius is a low-priced stock and priced at $5.82 per share. It traded at a reasonable valuation despite stellar returns since 2010. The stock has a forward price to sales multiple of 3.25x and a price to earnings multiple of 25.3x. According to research firm CSImarket, Sirius has a massive 88% share in the satellite radio space in the U.S. and generates the majority of sales via car-based subscriptions. Sirius is another company that has grown inorganically. It acquired Pandora for $3.5 billion in stock in 2019 and spent over $400 million in acquisitions this year, including a minority stake in open audio platform SoundCloud worth $75 million. Sirius has managed to increase earnings at a rate of 22.4% in the last five years by focusing on share buybacks that reduced its total outstanding shares. The company’s board recently authorized another $2 billion in share repurchases that are expected to drive earnings higher in the upcoming quarters. Want More Great Investing Ideas? The Best of StockNews 2 Step Process to Sell @ Market Top in September 9 “BUY THE DIP” Growth Stocks for 2020 AAPL shares were trading at $503.18 per share on Monday morning, up $5.70 (+1.15%). Year-to-date, AAPL has gained 72.54%, versus a 7.29% rise in the benchmark S&P 500 index during the same period."}]}