{"article": [{"url": "https://stocknews.com/news/spy-cboe-6-rookie-trading-mistakes-to-avoid/", "published": 1599826100.0, "headline": "6 Rookie Trading Mistakes to Avoid", "body": "It’s been a wild week with major indices suffering a 10% decline in just 3 days — the swiftest ‘correction’ from all-time highs on record. For many of the people that recently joined the ranks of active trading, it was probably a painful lesson that stocks can also go down. Those who have been adding options trading to their arsenal — in an attempt to turbo-charge profits — discovered that leverage can cut both ways. On this relatively quiet Friday, it’s probably a good time to review what I consider are the top rookie mistakes of trading options. Learn the Options Trading Approach that our market experts are raving about! Claim your SPECIAL One-Month $19 Trial Offer to the Options360 Service Buying ‘Lottery’ Tickets Too often, new traders opt for buying way out-of-the-money options because they are attracted by its low-notional dollar amount. They perceive them as a “bargain” and a good way to gain options leverage. But, the low cost doesn’t mean that they are “cheap.” In fact, out-of-the-money options usually have higher implied volatility than those that are closer to the money (near the underlying stock price). Therefore, in relative terms, they’re “expensive.” Out-of-the-money options also come with a much lower delta — meaning it will take a much larger price move in the underlying shares to cause a value increase in the option. The probability that they’ll deliver a profit diminishes the further out-of-the-money you go. Remember, something like 80% of all options expire worthless. 7 Best ETFs for the NEXT Bull MarketOnce in a while, it’s OK to make a calculated risky bet, as there might be a takeover or news event that’ll catapult a stock higher. But, for your bread and butter trading, it’s best to stick to strikes that are near-the-money. Swinging for the Fences Ahead of Earnings When people talk about trading options, the conversation usually turns to ultra-risky strategies. By far, the most common of these is buying calls or puts options, ahead of an earnings number in the hopes of hitting a home run. The upside of being right about such an unpredictable event is a big, fat profit. The downside when you’re wrong? That’d be 100%. As in, when the underlying stock gaps against you, the options are left worthless. There is nothing wrong with making the occasional speculative bet if you understand the risk involved. But, I’d suggest you use spreads to minimize the impact of the post-earnings premium crush (PEPC), which occurs following the event. This brings us to #3. Failing to Understand Implied Volatility Being wrong on a stock’s direction is a really easy way to lose money. But, there’s a third, and perhaps even more frustrating way to lose money with options: failing to understand the intricacies of option pricing. One of the biggest mistakes new options traders make is not accounting for implied volatility, which is a measure of the expectation or probability of a size move within a given time frame. Simply put, implied volatility provides a gauge as to whether an option is relatively cheap or expensive based on past underlying stock price action. It’s among the most important components of option pricing. In order to consistently make money trading options, one must attain a basic understanding of implied volatility. [Labor Day Sale Extended] Claim your SPECIAL One-Month $19 Trial Offer to the Options360 Service Failing to Understand Time Decay Traders also commonly fail to realize that options are a wasting asset. A very important component in an option price is the time until expiration. As time goes by, the value of that time decays, with a negative impact on the option itself. If you buy calls or puts outright, and the underlying stock moves slowly in your direction, the option may not gain in value. However, a basic understanding of option pricing and a variety of trading strategies will allow you to offset the time decay impact — or even turn it into your advantage. Ignoring the Power of Compounding Small Gains Above, we referenced the risk associated with swinging for the fences with options. The less-sexy but far more lucrative reality is that the best options traders grind out steady profits using a wide variety of strategies. They aim to consistently earn 2% to 4% a month, with an occasional kicker from speculative bets. Two percent per month doesn’t sound like a lot but compounded annually, it adds up to 27%. That’s more than 3x the average S&P 500’s historical return! Stretch that monthly gain from 2% to 4%, and the annualized profit is on the order of 60%. The important takeaway here is not the idea of making an annual profit of 60%. It’s the power of consistently hitting high-probability singles rather than swinging for low-probability home runs every time we step up to the plate. Extreme risk-taking could mean that you’re up 100% in a month, and down 50% the next. If you do that then you’re right back where you started — but with an ulcer and on heart medication (figuratively speaking). There is plenty of room for speculation with options, but to stay ahead of the game, you have to pick your spots wisely. Failing to Diversify Ideally, no single position should represent more than 5% of a portfolio. My personal options account typically carries six to 10 positions at a time. These can run from complex, multi-strike hedged positions with four to six months until expiration, to speculative plays based on unusual activity or an upcoming event that will be held for just a few days. Why? Because again, I never want to get knocked out of the game on one trade or allow a position to get so large that it could threaten gains elsewhere if things go south. When people go broke trading options, it’s usually because they not only swung for the fences but put far too much money into that single trade. CLICK HERE for a one-month trial to the Options360 Service for just $19! Want More Great Investing Ideas? 7 Best ETFs for the NEXT Bull Market Will Stocks Fall into Historical September Slump? 9 “BUY THE DIP” Growth Stocks for 2020 SPY shares were trading at $331.50 per share on Friday afternoon, down $2.39 (-0.72%). Year-to-date, SPY has gained 4.06%, versus a % rise in the benchmark S&P 500 index during the same period."}]}