{"article": [{"url": "https://stocknews.com/news/crm-orcl-3-reasons-why-salesforce-will-continue-to-move-higher/", "published": 1598357300.0, "headline": "3 Reasons Why Salesforce Will Continue to Move Higher", "body": "An IPO in 2004 at $11 per share The stock has been a star performer- A lawsuit hangs over the company Reason one- A change in the workforce post-pandemic- An expanding addressable market 7 Best ETFs for the NEXT Bull Market&nbsp Reason two- CRM has been profitable Reason three- Excellent management Salesforce.com, Inc. (CRM) is a technology company that helps its customers unite marketing, sales, commerce, service, and IT teams, Marc Benioff founded Salesforce in 1999. He created the 1-1-1 model of philanthropy, which leverages the resources of Salesforce to improve communities worldwide. More than 9,000 companies have adopted the model through the Pledge 1% movement. Benioff spent thirteen years at Oracle Corporation (ORCL), where he rose through the ranks to become the youngest vice president in company history. At fourteen, he sold his first price of software, “How to Juggle” for $75. He founded his first company, Liberty Software, which created video games at just fifteen years old. Today, over 150,000 companies of all sizes are growing their businesses with Salesforce products. The current environment in the post-COVID-19 world presents a unique environment for CRM, and the prospects for the shares look bright. As of the end of last week, CRM had a slightly larger market cap than ORCL. An IPO in 2004 at $11 per share CRM is a US cloud-based software company with its headquarters in San Francisco, California. The company came public sixteen years ago with the initial public offering priced at $11 per share. On the first day of trading, the shares closed at $17.20. A decade later, CRM was trading at an adjusted price of over $50 per share after a 4-1 stock split in 2013. At $207.53 per share on August 21, CRM has a market cap of almost $187 billion. Approximately 5.75 million shares change hands on average each day. The stock has made higher lows and higher highs since 2004. The stock has been a star performer- A lawsuit hangs over the company The ascent of CRM shares has been nothing short of incredible. At a split-adjusted price of $207.53 at the end of last week, the shares were over seventy-five times higher than at the time of the company’s IPO. Source: Yahoo Finance As the chart shows, CRM rose to a high of $195.72 in February 2020 before the risk-off period on the back of COVID-19 pushed the stock to a low of $115.29 in March. Since then, it climbed to an even higher high with the latest peak at $210.11 on August 20. The stock was trading just below the high last Friday. Meanwhile, Salesforce and Oracle are the focus of a $10 billion call-action lawsuit in the European Union. The General Data Protection Regulation (GDPR) sets out the framework for the way technology companies process and share personal data to sell online advertising. The Privacy Collective, a European non-profit foundation that claims compensation for the wrongful use of personal data is accusing CRM and ORCL of misusing personal data through their third-party cookies, “Bluekai” and “Krux,” which are used to track, monitor, and collect the personal data of internet users and share it in the process of real-time bidding. The cookies are hosted on popular websites, including Amazon, Booking.com, Dropbox, Reddit, and Spotify. The Privacy Collective is accusing the CRM and ORCL of facilitating sales via harmful ads, holding personal information that consumers did not consent to shares, and inconsistently securing personal data. CRM and ORCL have said they will vigorously defend against what the companies call “baseless claims.” The lawsuit aside, the prospects for CRM shares remain bullish for three critical reasons. Reason one- A change in the workforce post-pandemic- An expanding addressable market COVID-19 will leave lasting changes to the global economy. Companies will learn to do more with less. If we learned one thing from the pandemic, it is the legacy will continue to hasten the demise of retail businesses. Social distancing has bolstered online shopping, and the trend that began years ago will continue to increase the change in consumer behavior exponentially. New businesses that take advantage of what is a new normal will open and thrive. The services offered by Salesforce are likely to benefit from an expanding addressable market. The economy is changing and evolving, and CRM is perfectly positioned to take advantage in the future. Reason two- CRM has been profitable Source: Yahoo Finance As the chart shows, CRM has been consistently profitable over the past four quarters. The company has also beat analyst estimates in each reporting period. During the challenging second quarter, the company earned 70 cents per share. The current consensus estimate for Q3 is for a profit of 67 cents per share. Given CRM’s record, the earnings are likely to continue to exceed the projections. A survey of thirty-seven analysts on YahooFinance has an average target of $204.97 per share for CRM. The range is from $120 to $242. The stock was trading just slightly above the target on August 21. The earnings record is another supportive factor for Salesforce. Reason three- Excellent management Marc Benioff, the Chairman, and CEO has a long record of success in guiding CRM. His Co-Founder, Parker Harris, drives the company’s technology vision and architecture. Together with Benioff, Dave Moellenhoff, and Frank Dominguez, Harris founded Salesforce in 1999. He founded Left Coast Software in 1996, where he developed cloud computing expertise. Harris acquired experience in salesforce automation at Metropolis Software, an early pioneer in the business. Marc Hawkins is the President and CFO of the company. He has over three decades of experience leading finance organizations at global software and technology companies, including Autodesk, Logitech, Dell, and Hewlett-Packard. Benioff and Harris are members of the company’s board of directors. The board is highly diversified, with Colin Powell, the former US Secretary of State and Chairman of the Joint Chiefs of Staff, a member. The executive team and board of directors create a highly experienced group of talented people to guide CRM through an exponential growth period. Salesforce has created a franchise in its niche in the technology industry. The shares should continue to appreciate in the current environment. On Friday, one analyst initiated coverage of CRM with a sell recommendation. I believe any correction in the shares would be a compelling buying opportunity for the future. The trend is always your best friend in markets, and it is higher for CRM shares. Want More Great Investing Ideas? The Best of StockNews 2 Step Process to Sell @ Market Top in September 9 “BUY THE DIP” Growth Stocks for 2020 CRM shares were trading at $215.93 per share on Tuesday afternoon, up $7.47 (+3.58%). Year-to-date, CRM has gained 32.77%, versus a 7.66% rise in the benchmark S&P 500 index during the same period."}]}