{"article": [{"url": "https://stocknews.com/news/wmt-unp-lin-3-leading-dividend-stocks-for-investors-preparing-for-sector-rotation/", "published": 1601035700.0, "headline": "3 Leading Dividend Stocks for Investors Preparing for Sector Rotation", "body": "When tech stocks kept climbing this summer, it made investors wonder whether the sectors that remained undervalued after the pandemic-triggered crash would ever have their day. But now, as September draws to a close, we’re beginning to see initial indications of a stock market sector rotation: returns show the rotation out of tech, and into consumer discretionary stocks, has begun. Recent volatility in the stock market is a strong sign of this shift. I use the S&P Global Ratings market sectors to look at where investor dollars are flowing. For both this year to date and the past one year, Information Technology and Consumer Discretionary have been the top two sectors, far outperforming the other nine sectors. Sector results have shifted. Information Technology is now next-to-worse for the last 30 days, and Consumer Discretionary has fallen to the middle of the pack. For returns, the two sectors are down 6.04% and 4.17%, respectively, over the last thirty days. (As of market close on 9/24/20.) 7 \"SAFE HAVEN\" Dividend Stocks for Turbulent TimesLeading in September are the sectors of Materials, Industrials, and Consumer Staples. The three are also negative for the month, but are doing relatively better than the two formerly-hot sectors. That shift in relative performance may be the sign of a rotation out of the hot, overvalued sectors and into undervalued industries that will do well as the economy returns to a more normal footing. Even with these early signs of rotation; the Energy sector remains in the dumps. It has been the worst-performing sector for the month, year-to-date, last full year, five-years, and decade. Energy did show signs of life with strong share price gains in the final months of 2019. Then the outbreak of the coronavirus pandemic in January threw the sector again under the bus. But not all is lost for energy: in my Dividend Hunter service, I continue to recommend the most secure energy midstream stocks. We are collecting up to 20% yields while waiting for the rest of the sector to have its day again. Here are the three largest companies out of the three leading in September S&P market sectors: Walmart Inc. (WMT) The leader in the Consumer Staples sector is Walmart Inc. (WMT). Besides its tremendous retail footprint, Walmart is working to give Amazon a run for its money in the online sales world. While Amazon sports a P/E of over 100, Walmart trades for 24 times earnings. Walmart has also increased its dividend for 47 straight years. The current yield is 1.6%. Union Pacific Corp. (UNP) Industrials are led by Union Pacific Corp. (UNP), the $130 billion market cap railroad company. The Union Pacific share price is up 70% since the March lows, and the shares trade at a 25 P/E ratio. Union Pacific has grown its dividend for 13 consecutive years. Shares yield 2.0%. Linde plc (LIN) The largest company in the Materials sector is Linde plc (LIN). I confess I was not familiar with this $122 billion market cap stock. Linde is an American-German, Irish-domiciled multinational chemical company formed by the merger of Linde AG of Germany and Praxair of the United States. Linde is the world’s largest industrial gas company and has over 600 affiliated companies worldwide. Shares of Linde trade at a 30 P/E ratio, and the current yield is 1.65%. Want More Great Investing Ideas? Top Dividend Stock to Own! Download Free Report Today Buy These 3 High-Yield Dividend Stocks All Under $15 Buy and Hold These 3 Dividend Stocks Forever WMT shares fell $0.65 (-0.47%) in after-hours trading Friday. Year-to-date, WMT has gained 17.01%, versus a 3.60% rise in the benchmark S&P 500 index during the same period."}]}