{"article": [{"url": "https://stocknews.com/news/spy-baba-unp-vz-pg-len-5-stocks-to-buy-if-the-market-crashes-again/", "published": 1600949300.0, "headline": "5 Stocks to Buy if the Market Crashes Again", "body": "Since topping in early September, stock market sentiment has gone from frothy to bearish. The market has endured a few days of heavy selling pressure, and every rally attempt has rolled over. As the chart below shows, the SPDR S&P 500 ETF (SPY) has been making lower lows. 7 \"SAFE HAVEN\" Dividend Stocks for Turbulent Times Despite the steady move lower, the market still hasn’t reached capitulation by many measures, which would be a more clear indicator of a meaningful inflection point. The Volatility Index (VIX) has been tepid on this move lower, not making a higher high despite SPY dropping by 6%. There was no increased volume nor was there a spike in the put/call ratio. Bearish Developments Some of the factors driving the selling in stocks are uncertainty about the upcoming election, failure to reach agreement on a stimulus deal, and another round of coronavirus-induced lockdowns in many countries. There tends to be bearish seasonal factors in the months before a Presidential election, and this year is no different. If anything, the situation is even more intense given the coronavirus, questions about voting, a vacancy at the Supreme Court, rioting in some parts of the country, and the polarized nature of the electorate. The vacancy in the Supreme Court is adding more fuel to a tense political environment. It also decreases the odds of both sides reaching a deal on a stimulus package. This could lead to lower aggregate demand and lower earnings in the next, few quarters especially if financial markets are underestimating the damage done to small businesses. The selling in stocks has also been broad-based. Many of the market-leading, growth stocks are off 10-20% off their recent highs. There’s also been selling in the sectors that have been laggards like airlines, small-caps, energy, and banks. One reason is the recent round of lockdowns in European countries and Israel that were on the path to normalization. This may mean that the V-shaped economic recovery may not continue. Chance of a Market Crash? This month has demonstrated that extreme frothy markets can have brutal corrections. Above, the one-year chart of SPY shows that the market’s uptrend from the March lows remains intact, and there’s room to go lower without it being threatened. However, there’s always the chance of things getting worse especially with the number of bearish forces pressuring the market, and the lack of positive catalysts given that the market’s big rally off the March lows has created high expectations for growth and earnings. If the stock market continues to go lower and even potentially crashes, you want to have a list of high-quality stocks to consider buying. A good company will outperform in the long-term, so a market crash is a potential opportunity to add exposure at a discount. Five high-quality stocks to buy in the event of a market crash are Procter & Gamble (PG), Verizon Communications (VZ), Union Pacific (UNP), Alibaba (BABA), and Lennar (LEN). Procter & Gamble (PG) The most likely reason for a market crash is that if economic conditions deteriorate. This could happen especially as the expiration of the stimulus and failure to pass a new one makes the country more vulnerable to a negative economic shock. In this event, defensive sectors like consumer staples would outperform. These companies sell items that don’t really fluctuate based on the economy. Items like toothpaste, household items, and cleaning supplies. Among consumer staples, PG is one of the strongest candidates. It pays an above-average dividend yield of 2.3% and has a forward price to earnings ratio of 23. It’s also been exhibiting relative strength as it’s trading 10% above its pre-coronavirus levels and is less than 5% off its September highs. The POWR Ratings are also constructive on the stock as it has a “Strong Buy” rating with an “A” in every category including Trade Grade, Buy & Hold Grade, Peer Grade, and Industry Rank. Among Consumer Goods stocks, it’s ranked #1 out of 34. Verizon Communications (VZ) VZ is another defensive stock with an above-average dividend yield. It has a 4.3% yield, a forward price to earnings ratio of 12 with 14.8% profit margins. It’s the perfect type of stock to own during bearish market conditions. (BABA is one of the stocks currently in Steve Reitmeister’s Total Return portfolio. Learn more here.) The POWER Ratings are also bullish on the stock as it’s rated a Strong Buy. It has an “A” in every category including Trade Grade, Buy & Hold Grade, Peer Grade, and Industry Rank. Among Domestic Telecom, it’s ranked #1 out of 24. Union Pacific (UNP) Another pocket of strength in the market is transportation. Within the sector, railroad stocks have the best combination of fundamentals and technicals. Among railroad stocks, Union Pacific is one of the strongest stocks. It’s exhibited strong price action as it broke out to new highs. During this market correction, it’s managed to hold onto these gains despite many stocks having steeper losses. How does UNP stack up for the POWR Ratings? A for Trade Grade A for Buy & Hold Grade A for Industry Rank A for Overall POWR Rating. It is ranked #1 out of 14 railroad stocks. Alibaba (BABA) Historically, market crashes have been great opportunities to accumulate stocks in companies with good businesses. An indication of a good business is high growth rates and rapidly expanding total markets at reasonable valuations. BABA fits many of these parameters since it has a forward price to earnings ratio of 22 which is cheaper than the S&P 500’s 26. It has sales growth of 33% and gross margins of 44% which is also significantly better than the S&P 500. It has a leading position in fintech, e-commerce, and cloud computing. All of these are growing industries with considerable upside given the bigger Asian market. BABA is rated a Buy. It has an “A” for Trade Grade and Peer Grade with a “B” for Buy & Hold Grade and Industry Rank. It’s ranked #8 out of 115 Chinese stocks. Lennar (LEN) Using market crashes to invest in sectors with strong secular growth characteristics can lead to good results. So, it could be worth considering housing stocks if the market tumbles. The housing market’s strengths are powered by demographics trends, historically low mortgage rates, and low housing supply. Rising home prices will lead to more home building and benefits companies like LEN. LEN is reasonably priced with a forward price to earnings ratio of 9.8. Since the housing market bottomed just over a decade ago, it’s had a consistent record of compounding earnings and revenue growth. Its revenue has grown seven-fold over the last decade which shows the business has expanded and is poised to take advantage of higher prices. Want More Great Investing Ideas? 7 Best ETFs for the NEXT Bull Market Is the Stock Market Correction Over? Chart of the Day- See the Stocks Ready to Breakout The POWR Ratings rate LEN a Strong Buy. It has an “A” for Trade Grade, Buy & Hold Grade, and Peer Rank with a “B” for Industry Rank. Among home builders, it’s ranked #2 out of 21. SPY shares . Year-to-date, SPY has gained 1.95%, versus a % rise in the benchmark S&P 500 index during the same period."}]}