{"article": [{"url": "https://stocknews.com/news/rol-apd-ccj-au-auy-top-5-large-cap-dividend-stocks-for-july-7-2020/", "published": 1594123700.0, "headline": "Top 5 Large Cap Dividend Stocks for July 7, 2020", "body": "The top winners in the large cap US dividend space for Tuesday, July 7, 2020 are ROL, APD, CCJ, AU, and AUY. Below is a recap of how they fared. Rollins Inc (ROL) Daily Price Recap 45.62 was the closing price of the day for Rollins Inc, resulting in today being one in which price moved up 6.71% ($2.87) from the day prior. The price move occurred on stronger volume; specifically, yesterday’s volume was up 111.54% from the day prior, and up 123.74% from the same day the week before. The daily price chart of Rollins Inc below illustrates. Its dividend discount model value score is higher than 40.71% of US dividend stocks. 9 \"BUY THE DIP\" Growth Stocks For 2020Is ROL a Buy, Hold or Sell? See the POWR Ratings now! Air Products & Chemicals Inc (APD) Daily Price Recap Air Products & Chemicals Inc closed the previous day up 6.52% ($16.22); this denotes the 6th day in a row an increase has occurred. The price move occurred on stronger volume; specifically, yesterday’s volume was up 123.89% from the day prior, and up 194.44% from the same day the week before. Here is a daily price chart of Air Products & Chemicals Inc. Dividend investors may wish to pay attention to the dividend discount model value score of dividend stocks, and for APD, its higher than that of 32.88% of US dividend-issuing stocks. Is APD a Buy, Hold or Sell? See the POWR Ratings now! Cameco Corp (CCJ) Daily Price Recap Cameco Corp closed yesterday up 4.05% ($0.42); this denotes the 2nd day in a row it has gone up. The change in price came along side change in volume that was down 11.11% from previous day, but up 16.62% from the Monday of last week. Let’s take a look at the daily price chart of Cameco Corp. As for CCJ’s dividend yield, it is currently higher than that of approximately 5.46% US dividend payers. Make investment decisions regarding CCJ using the data that counts. Learn more about POWR Ratings. Anglogold Ashanti Ltd (AU) Daily Price Recap Anglogold Ashanti Ltd came into today up 3.37% ($1) from the open of the previous day, marking the 2nd day in a row an upward move has occurred. The price move occurred on stronger volume; specifically, yesterday’s volume was up 74.93% from the day prior, and up 102.29% from the same day the week before. The daily price chart of Anglogold Ashanti Ltd below illustrates. Dividend investors may wish to pay attention to the beta of dividend stocks, and for AU, its lower than that of 98.09% of US dividend-issuing stocks. Is AU a Buy, Hold or Sell? See the POWR Ratings now! Yamana Gold Inc (AUY) Daily Price Recap The back and forth price flow continues for Yamana Gold Inc, which started today off at 5.53 US dollars, up 3.36% ($0.18) from the previous day. The price move occurred on stronger volume; specifically, yesterday’s volume was up 13.43% from the day prior, and up 5.15% from the same day the week before. Let’s take a look at the daily price chart of Yamana Gold Inc. Dividend investors may wish to pay attention to the beta of dividend stocks, and for AUY, its lower than that of 97.24% of US dividend-issuing stocks. Is AUY a Buy, Hold or Sell? See the POWR Ratings now! To further your research on dividend stocks, check out our list of dividend stocks sorted by yield. Want More Great Investing Ideas? 9 “BUY THE DIP” Growth Stocks for 2020 Is the Bull S#*t Rally FINALLY Over? 7 “Safe-Haven” Dividend Stocks for Turbulent Times Top 3 Investing Strategies for 2020 ROL shares . Year-to-date, ROL has gained 38.26%, versus a -1.51% rise in the benchmark S&P 500 index during the same period."}]}