{"article": [{"url": "https://stocknews.com/news/ncr-key-resistance-and-support-levels-emerge-in-ncr-corp-ncr/", "published": 1598357300.0, "headline": "Key Resistance and Support Levels Emerge in NCR Corp. (NCR)", "body": "NCR Corp. (NCR) is trading in a horizontal channel, also known as a rectangle pattern. Traders should be ready for the stock to breakout or breakdown in the near future. NCR designs and services automated systems that streamline interactions between businesses and consumers. The company is the largest global vendor of ATMs and also sells point-of-sale terminals and self-service check-out systems for retail stores, airlines, and hotels. While the company is seeing a decline in ATM revenues from the coronavirus, hit is being offset by a strong demand for software and service solutions across banking and financial services. Take a look at the 1-year chart of NCR below with added notations: 7 \"SAFE HAVEN\" Dividend Stocks for Turbulent Times Chart of NCR provided by TradingView After finishing up its steep drop in March, NCR moved into a trading range and a rectangle pattern was formed. The stock has a key resistance area around $22 (red), and an important area of support at $16 (green). At some point, the stock will have to break either the $22 mark or the $16 one. When that happens, a possible long position could be initiated after a close above $22 or a short trade could be entered after a close below $16. Want to Discover More Great Trades? I have explored virtually every flavor of technical analysis and chart pattern known to mankind. The sad fact is that the vast majority of them don’t work at all. That is why I recently put together this presentation to help investors focus on the only 5 chart patterns that matter…the ones that lead to the most timely and profitable stock trades. Click below to learn these patterns and how to quickly find the 5 to 7 best trades today. 5 WINNING Stock Chart Patterns Have a good trading day! Good luck! Christian Tharp, CMT @cmtstockcoach NCR shares were trading at $20.96 per share on Tuesday morning, up $0.33 (+1.60%). Year-to-date, NCR has declined -40.39%, versus a 7.57% rise in the benchmark S&P 500 index during the same period."}]}