{"article": [{"url": "https://stocknews.com/news/amzn-baba-amazon-vs-alibaba-which-stock-is-a-better-buy/", "published": 1601294900.0, "headline": "Amazon vs. Alibaba: Which Stock is a Better Buy?", "body": "Amazon.com, Inc. (AMZN) and Alibaba Group Holding Ltd. (BABA), two of the world’s top e-commerce and cloud infrastructure companies, have been thriving amid the pandemic due to the ability of their offerings to facilitate the “new normal” way of living. As people have been forced to stay home due to the pandemic, certain activities such as shopping and working have changed significantly. More people are shopping online than ever before. Both of these companies are prime beneficiaries of this trend. Both have also generated significant returns over the past five years. While AMZN returned 490% over this period, BABA gained 355%. In terms of year-to-date performance, AMZN is a clear winner with 67.5% returns versus BABA’s 27.2%. 7 \"SAFE HAVEN\" Dividend Stocks for Turbulent TimesBut which of these stocks is the better pick now? Let’s find out. Business Structure and Latest Movements AMZN generates the majority of its revenues from its e-commerce platform. Amazon Prime Video, Alexa personal assistant and ecosystem, and Amazon Web Services (AWS) are the other revenue sources for the company. The stock has largely been benefitting from the pandemic due to its e-commerce business, which has witnessed rapid growth as people are ordering essentials online to stay away from the virus. The company’s cloud computing platform has also been in high demand due to the accelerated pace of digital transformation adopted by businesses across the globe. The company has recently received approval for the use of drones as part of their delivery operations. This move could help the company make faster deliveries in a more cost-effective manner. Also, AMZN’s entry in grocery and its initiatives to fortify its position as an online grocer powerhouse could significantly boost its revenue growth in the new normal. BABA is widely known as the Amazon of China due to its dominance in the e-commerce sector in China and forays into cloud services. Similar to AMZN, Alibaba generates most of its revenue from its e-commerce business. Brick-and-mortar commerce stores, cloud and digital media are the other sources of the company’s revenues. BABA has recently announced that its logistics arm Cainiao has launched a new logistics package service which would allow the company’s vendors to directly send packages from Chinese warehouses to buyers in Malaysia. This move could significantly boost the company’s operations in South-East Asia. The company is also developing robots for last-mile delivery which will ease operations in the future. Recent Financial Results In the second quarter that ended in June 2020, AMZN’s revenue surged 40% year-over-year to $88.9 billion on the back of a huge surge in order volumes. The company’s EPS grew 97.3% to $10.3. AMZN increased its grocery delivery capacity by over 160% to cater to the threefold surge in online grocery demand. The e-commerce giant also saw a 29% year-over-year surge in Amazon Web Services (AWS), as companies shifted their work to the cloud to facilitate remote working. Moreover, it saw a 29% uptick in its subscription services like Amazon Prime videos. BABA’s revenue for the quarter grew 34% year-over-year and a significant portion of the revenue increase came from its e-commerce business. The company’s cloud computing revenue grew 59% year-over-year. BABA’s earnings per ADS grew 17.1%. Here AMZN is in an advantageous position. Past and Expected Financial Performance AMZN’s revenue and EPS grew at a CAGR of 28.9% and 87.8%, respectively, over the past 3 years. Also, the CAGR of the company’s free cash flow has been 54.2%. The market expects the company’s revenue to increase 32.1% in the current quarter, 31.3% in the current year, and 18% next year. AMZN’s EPS is expected to grow 71.4% in the current quarter, 37.6% in the current year, and 40.1% next year. Moreover, its EPS is expected to grow at a rate of 36% per annum over the next five years. On the other hand, BABA’s revenue and EPS grew at a CAGR of 46% and 49%, respectively, over the past 3 years. The CAGR of the company’s free cash flow has been 18.1%. The market expects BABA’s revenue to increase 53.7% in the current quarter, 35.6% in the current year and 25.6% next year. The company’s EPS is expected to grow 14.6% in the current quarter, 22.9% in the current year and 24.8% next year. Moreover, BABA’s EPS is expected to grow at a rate of 3.35% per annum over the next five years. AMZN has an edge over BABA here as well. Profitability AMZN’s revenue is more than four times of what BABA generates. But BABA is the more profitable with a gross profit margin of 44.5% versus AMZN’s 40.3%. Moreover, BABA’s ROE and ROA of 21.51% and 5.5% compare favorably with AMZN’s 20.79% and 4.65% respectively. Valuation In terms of forward P/E, AMZN is currently trading at 97.34x, 236% more expensive than BABA which is currently trading at 28.96x. Though AMZN is less expensive in terms of price to sales ratio (P/S) (4.79x versus BABA’s 9.26x), its forward PEG of 27.6x is 89% higher than BABA’s 1.46x. In terms of trailing-12-month price/cash flow, AMZN’s 30.27x is 14.5% higher than BABA’s 26.43x. Though AMZN looks much more expensive compared to BABA, it’s worth paying this premium considering AMZN’s significantly higher earnings growth potential. POWR Ratings Both AMZN and BABA are rated a “Buy” in our proprietary POWR Ratings system. Here are how the four components of the POWR Ratings are graded for AMZN and BABA: AMZN has a “B” for Buy & Hold Grade and Peer Grade, and a “C” for Trade Grade and Industry Rank. In the 57-stock Internet industry, it is ranked #12. BABA has an “A” for Trade Grade and Peer Grade, and a “B” for Buy & Hold Grade and Industry Rank. It is ranked #8 in the 115-stock China group. The Winner While both AMZN and BABA are good long-term investments considering their market dominance and continued expansions, AMZN appears to be a better buy based on the factors discussed here. While BABA is a relatively cheaper option to bet on the immense growth potential of the e-commerce and cloud markets, AMZN is a proven winner and its premium valuation is justified given its earnings growth potential. Want More Great Investing Ideas? 7 “Safe-Haven” Dividend Stocks for Turbulent Times When Does the Next Bull Run Start? Chart of the Day- See the Stocks Ready to Breakout AMZN shares rose $5.95 (+0.19%) in after-hours trading Monday. Year-to-date, AMZN has gained 71.77%, versus a 5.32% rise in the benchmark S&P 500 index during the same period."}]}