{"article": [{"url": "https://stocknews.com/news/penn-ctrn-sah-wdfc-4-upgraded-stocks-to-buy-as-the-market-dips/", "published": 1599826100.0, "headline": "4 UPGRADED Stocks to Buy as the Market Dips", "body": "Stocks have encountered some selling pressure over the past week. The Nasdaq is now down over 10% from its peak. This is likely to be a buying opportunity given the continued improvement in the economy’s figures from a month to month perspective, and the Fed’s easy-money policy. POWR Ratings can help you figure out the best stocks to buy. Stocks that get upgraded during poor market conditions have better odds of outperformance. d of the week. 7 \"SAFE HAVEN\" Dividend Stocks for Turbulent TimesLet’s take a look at a couple of the latest stocks upgraded in the POWR Ratings that stand a good chance of trading higher into year-end: Penn National Gaming (PENN), WD-40 (WDFC), Sonic Automotive (SAH), and Citi Trends (CTRN). Penn National Gaming (PENN) The gaming stocks have been quite volatile amidst the pandemic as everyone seems uncertain as to whether the casinos will fully reopen across the entirety of the country and the extent to which they will resume regular operations. It appears as though most casinos will reopen this year, albeit with limited occupancy. PENN owns and manages both gaming and racing businesses highlighted by video gaming terminals. In particular, PENN provides the masses with popular slot machines. PENN was recently upgraded in the POWR Ratings to a Strong Buy as casinos are reopening throughout the country. Even the “Nanny State” of New York is reopening its state-run casinos this week. The POWR Ratings show PENN has A grades in each POWR Component but for its Industry Rank of C. Furthermore, PENN is ranked #1 of more than 20 stocks in the Entertainment – Casinos/Gambling category. It is hard to believe this stock dipped down to around $5 in March. PENN is up a whopping 51.5% in August alone. PENN’s relationship with Barstool Sports should help the stock move toward its 52-week high of $59.10 as long as the NFL season is played to completion. WD-40 (WDFC) It is quite rare that a publicly-traded company excels selling a single product. This is the case with WDFC, the company behind WD-40 that you likely have in your basement or below your sink. That much more WD-40 will be sold now that most people have tapped into their supply while home during the pandemic. The POWR Ratings reveal WDFC has A grades in each POWR Component but for its Peer Grade of B. WDFC is ranked 5th of 68 stocks in the Home Improvement & Goods category. Furthermore, WDFC price returns are in the green in every single period. WDFC’s price returns are highlighted by a +95.15% return across the past three years. The analysts are bullish on WDFC, setting a price target of $233, indicating the stock has more than 15% upside. The bottom line is WDFC is a recession-resistant stock. People will buy WD-40 no matter how bad the economy gets. Furthermore, the decreasing price of oil will reduce WDFC’s overhead, helping its gross margins expand all the more. Sonic Automotive (SAH) The car market is picking back up now that the masses are returning to work and the economy is getting back to at least a semblance of normal. SAH sells both new and used vehicles, replacement parts, and more. SAH also provides vehicle maintenance, paint services, repair services, and extended warranties. The POWR Ratings show SAH has A grades in each POWR Component but for its Peer Grade and Industry Rank which are graded as Bs. SAH is ranked in the top five of 16 stocks in the Auto Dealers & Rentals category. SAH has a fairly low forward P/E ratio of 13, meaning the stock is likely slightly undervalued at $44.59. SAH has price returns in the green since ’19 moving forward. SAH’s six-month price return was 145.22%. The stock’s three-month price return was just under 60%. Citi Trends (CTRN) CTRN sells apparel and accessories. Now that the economy is reopening and school is starting back up, fashion matters once again. CTRN has the potential to pop in the weeks and months ahead. The POWR Ratings show CTRN has A grades in each POWR Component but for its Industry Rank of B. CTRN is ranked second of 65 stocks in the Fashion & Luxury category. CTRN’s price returns are in the green through ’19 and ’20, highlighted by a three-month price return of 52.61%. CTRN has bounced back quite nicely since dipping to $7 amidst the market-wide selloff. Though CTRN has not yet moved back to its pre-COVID price of $24 per share, it should test that high in the months ahead as fashion-conscious consumers make that many more public appearances following a lengthy quarantine. Want More Great Investing Ideas? 7 Best ETFs for the NEXT Bull Market Will Stocks Fall into Historical September Slump? 9 “BUY THE DIP” Growth Stocks for 2020 PENN shares were trading at $58.06 per share on Friday afternoon, down $4.40 (-7.04%). Year-to-date, PENN has gained 127.15%, versus a 4.40% rise in the benchmark S&P 500 index during the same period."}]}