{"article": [{"url": "https://stocknews.com/news/doyu-tcehy-huya-3-esports-stocks-that-could-soar-this-summer/", "published": 1594123700.0, "headline": "3 Esports Stocks That Could Soar This Summer", "body": "Esports are all the rage these days as younger millennials and Generation Z come of age. A large number of youngsters are bypassing athletics for competitions in the electronic realm. If you do not yet have esports stocks in your portfolio, there is still time to add them before this industry reaches its full potential. Some argue the popularity of esports will increase exponentially as the screen-addicted youth continue to migrate away from regular sports. DouYu (DOYU), Tencent Holdings (TCEHY), and HUYA International Holdings (HUYA) are three video game stocks that will benefit from esports’ explosive popularity in the years to come. 9 \"BUY THE DIP\" Growth Stocks For 2020DouYu International Holdings (DOYU) Content creation is DOYU’s specialty. This company operates from an exclusive contract model in which it inks video game streamers to lengthy contracts in exchange for a portion of their salary and online “gift” revenues paid by adoring fans. 60% of DOYU revenue came from its exclusive streaming talent last year. DOYU has the exclusive rights to stream nearly 30 tournaments throughout China including popular games such as DOTA 2, PUBG, and League of Legends. DOYU has a business model that wouldn’t make sense to many, older people. However, it stands to profit from the growing popularity of sports in China. Its POWR Ratings have the stock rated a Buy. It has an “A” for Trade Grade, Peer Grade, and Industry Rank with a “B” for Buy & Hold Grade. Among Chinese stocks, it’s ranked 7th of 33. Tencent Holdings (TCEHY) You have the opportunity to invest in the world’s largest video game company for $68 per share with TCEHY. All in all, it has a market cap of nearly $650 billion with sales representing about 20% of the worldwide video game market. TCEHY has full or partial ownership of numerous video game developers, publishers, and streaming websites. Companies in TCEHY’s portfolio include Epic Games, Riot Games, Ubisoft, Activision Blizzard (ATVI), Funcom, and Kakao. Riot Games is particularly important as it’s responsible for the uber-popular League of Legends title. This multiplayer web-based battle game grosses more than any other PC esports title. Riot has several more titles on the horizon sure to prove popular amongst esports players. Furthermore, TCEHY has a partial ownership game in Epic Games, the group that publishes the insanely popular Fortnite game. Fortnite players earned more in prize money than any other esport this past year. TCEHY’s Epic Games also acquired Psynoix, the maker of the Rocket League game that just about every esport participant has played at least once. Simply put, you must own owning TCEHY to get the broadest exposure to esport stocks. Though the average analyst price target for TCEHY is 10% less than its current trading price, it is quite telling that eight analysts rate the stock as a Buy while none rate it as a Hold or Sell. HUYA (HUYA) If you were to have predicted back in the early aughts that people around the world would tune in to online streams of video game action, few would have believed you. The rise of Justin.TV, which later became Twitch has proved the doubters wrong. It is now possible to make big bucks simply hosting video game streams on the web rather than making the software behind the games. HUYA provides such video broadcasts inclusive of esports as well as reality TV programming, music, and more. The POWR Ratings have HUYA ranked in the top third of all China stocks, which is meaningful considering the number of strong Chinese stocks in the market. HUYA had a 2019 price return of nearly 16%. So far this year, it’s up nearly 25%. US investors can’t directly invest in Twitch since it’s owned by Amazon (AMZN), but HUYA is the closest thing to the public markets. For a tech stock, HUYA has a relatively low forward P/E ratio of 27.83. Nearly 300 million people in China watch live video game stream every single year. HUYA had more than 151 million active monthly users in the first quarter’s end. This figure represents a 22% increase compared to the year prior. In other words, HUYA is emerging as China’s version of Twitch with a 50% share of this booming market. HUYA has year over year revenue growth just under 50%, net income that increased twofold on an annual basis, and a revenue increase of nearly 75%. All in all, HUYA hosted more than 120 esports tournaments and other video game-related events in 2019. This stock is unquestionably a buy for the long-term. Want More Great Investing Ideas? 9 “BUY THE DIP” Growth Stocks for 2020 Is the Bull S#*t Rally FINALLY Over? 7 “Safe-Haven” Dividend Stocks for Turbulent Times Top 3 Investing Strategies for 2020 DOYU shares were trading at $12.66 per share on Tuesday afternoon, up $0.22 (+1.77%). Year-to-date, DOYU has gained 49.47%, versus a -0.72% rise in the benchmark S&P 500 index during the same period."}]}