{"article": [{"url": "https://stocknews.com/news/baba-pypl-sq-3-stocks-that-could-soar-with-the-ant-group-ipo/", "published": 1599221300.0, "headline": "3 Stocks That Could SOAR with the Ant Group IPO", "body": "The whole world is anxiously waiting for the Ant Group’s IPO in China, which could potentially be the world’s largest ever IPO in history. Billionaire and founder of the Alibaba Group Holding Ltd. (BABA), Jack Ma, surely knows a secret about IPOs, as he previously shattered all records by raising $25 billion through BABA’s IPO in 2014. He was later dethroned by Saudi Aramco’s IPO, by a margin of $1 billion. Expected to take place in late September or October, this IPO could help Ant raise $30 billion, with simultaneous listings on the Hong Kong and Shanghai stock exchanges. BABA’s affiliate Ant Group, which is valued at approximately $210 billion, is the currently biggest fintech company in the world, and is expected to grow even more following its IPO. Rising analyst optimism about this IPO could drive the share price of parent company BABA, the US digital payment player PayPal Holdings, Inc. (PYPL), and Square, Inc. (SQ). 9 \"BUY THE DIP\" Growth Stocks For 2020Alibaba Group Holding Ltd. (BABA) With a market capitalization of more than $750 billion, BABA is the one of the largest e-commerce platforms in the world. It has operations in four primary segments – Core Commerce, Cloud Computing, Digital Media and Entertainment and Innovation Initiative and others. BABA owns and manages both wholesale and retail marketplaces, third party online and mobile commerce platforms, monetization platforms as well as internet platforms for healthcare products, among others. BABA’s co-founder and former chairman Jack Ma also co-founded Ant group, which was formerly known as Alipay. BABA currently is the biggest stakeholder in the Ant group, with a 33% ownership. The two companies are strategic partners, as Ant financial services on the BABA platform is its largest revenue source. With a successful IPO of the Ant group, BABA is expected to gain access to the international markets. Also, Ant pays periodic royalties to BABA, which might increase upon successful public offering. BABA’s digital technology and intelligence backbone Alibaba Cloud aims to be the world’s leading digital intelligence platform by 2023. On July 2nd, BABA announced that 38% of the Fortune 500 companies use Alibaba Cloud as their preferred cloud service provider. On August 11th, BABA signed a memorandum of understanding (MoU) with Total (China) Investment. The two companies agreed to a strategic collaboration to drive the digital transformation of their operations in China and globally. BABA has a significant stake in electric vehicle maker XPeng, which gained more than 40% since going public on the New York Stock Exchange. BABA reported impressive financials in the fiscal first quarter that ended in June 2020, stating that it completely recovered from the coronavirus shock. Revenues increased 34% to $21.76 billion. Mobile monthly active users increased 3.3% quarter-over-quarter to 874 million. Income from operations increased 43% from the year-ago value to $4.91 billion, while adjusted EBITDA rose 30% during the same time to $7.22 billion. Non-GAAP net income rose 28% from the same period last year to $5.58 billion. Its net cash from operating activities increased 48% year-over-year to $7.09 billion. The consensus EPS estimate of $2.13 for the second fiscal quarter ending September 2020 indicates a 15.1% rise year-over-year. Also, BABA has an impressive earnings surprise history, as it beat the street EPS estimates in each of the trailing four quarters. The consensus revenue estimate of $23 billion for the ongoing quarter indicates a 53.7% increase from the year-ago value. BABA gained more than 70% since hitting its year-to-date low of $169.95 in March. The stock hit its 52-week high in August. It’s no surprise that BABA is rated a Strong Buy in our POWR Ratings system, with an A for Trade Grade, Buy & Hold Grade, and Peer Grade, and a B for Industry Rank. It is also ranked #1 out of 115 stocks in the China industry. PayPal Holdings, Inc. (PYPL) PYPL is one of the biggest financial services and digital payments companies used by merchants worldwide for transactions in different currencies, having a market cap of $236.082 billion. It allows users to hold and withdraw funds from their bank account and hold balances in multiple currencies. PYPL is the parent company of Venmo, Braintree and Paypal Credit. The Ant IPO is expected to work favorably for the digital payments and fintech industry, so PYPL is expected to get enhanced investors’ attention post the IPO. PYPL has gained popularity among the masses during the pandemic, as the focus is radically shifting to technology-oriented services. PYPL’s digital wallet has more than 130 million active accounts in the United States and 7 million active accounts in Canada. It recently partnered with RentMoola to ensure secure financial transactions and integrated solutions towards rental and utility bill payments. PYPL announced hands-free QR code technology collaboration with CVS pharmacy to ensure safe transactions. This feature is available on Venmo application as well. On August 4th, PYPL introduced a new “Pay in 4” product suite, allowing customers to pay for their purchases in 4 instalments without accruing any interest. PYPL’s second-quarter results were the strongest to date. Total payment volume of $222 billion increased 29% year-over-year while its revenue grew 22% to $5.26 billion year-over-year. Its net income grew 17% year-over-year to $1.53 billion. PYPL added 21.30 million new accounts during the quarter, marking a record for the company. PYPL’s cash flow from operations and free cash flow grew 103% and 112% year over year, respectively. This momentum is expected to continue in the third quarter as well, as PYPL estimates its total payment volume to grow by 30% year over year on spot basis. PYPL expects to add more than 70 active million accounts in the upcoming quarter. The consensus EPS estimate of $0.94 indicates a 54 % increase year over year in the third quarter. PYPL managed to beat the street estimates in three out of trailing four quarters, which is impressive. The consensus revenue estimate of $5.40 billion indicates a 23.3% rise from the same period last year. PYPL has gained more than 140% since hitting its 52-week low of $82.07 in March. The stock hit its 52-week high of $199.40 in August. PYPL is rated a Strong Buy in our POWR Ratings system, with a grade of A in Trade Grade, Buy & Hold Grade, Peer Grade and Industry Rank. It is also ranked #3 out of 45 in the Consumer Financial Services industry. Square, Inc. (SQ) SQ is an e-commerce ecosystem facilitating payments and point of sale (POS) solutions internationally. It integrates software and hardware to allow sellers to turn their mobiles into computing devices processing point-of-sale payments directly. It’s hardware product is designed to read the EMV and magnetic stripe on cards, and Square stand and Square register software. Ant’s IPO has built positive investor sentiment in the digital payments industry. With Ant’s IPO potentially surging online transaction rates and retail purchases across the globe, SQ is likely to witness an increase in its average daily user base as well. As a well-established company and a major player in the U.S. markets, SQ shares are expected to gain significantly as the Chinese fintech company goes public. In the era of digitization, cash payments have significantly reduced. This bodes well for SQ, which delivered impressive reports in the second quarter that ended in June 2020. Total net revenue increased 64% year-over-year to $1.92 billion, while gross profit rose 28% from the year-ago value to $597 million. Cash App ecosystem’s gross profits grew 167% from the same period last year to $28 million, with an active monthly user base crossing 30 million. The consensus revenue estimate of $2.05 billion for the third quarter ending September 2020, indicates a 239.7% growth year-over-year. Also, SQ has an impressive earnings surprise history, as it beat the street EPS estimates in three out of trailing four quarters. SQ has gained more than 425% since hitting its 52-week low of $32.33 in March. The stock hit its 52-week high of $170.61 in September. It’s no surprise that SQ is rated a Buy in our POWR Ratings system. It has an A for Trade Grade and Buy & Hold Grade, and a B for Peer Grade and Industry Rank. In the 186-stock Financial Services (Enterprise) industry, SQ is ranked #21. Want More Great Investing Ideas? 7 Best ETFs for the NEXT Bull Market Beware Stocks in September? 9 “BUY THE DIP” Growth Stocks for 2020 BABA shares were trading at $281.90 per share on Friday afternoon, down $0.60 (-0.21%). Year-to-date, BABA has gained 32.91%, versus a 8.11% rise in the benchmark S&P 500 index during the same period."}]}