{"article": [{"url": "https://stocknews.com/news/nee-bep-sedg-hcch-4-green-energy-stocks-to-keep-on-your-radar/", "published": 1594210100.0, "headline": "4 Green Energy Stocks to Keep on Your Radar", "body": "Green energy is in vogue as our species pivots away from destructive fossil fuels toward renewable energy sources. It won’t be long until gas-powered vehicles are replaced with electric, self-driving cars. Investors are responding to this transformation by shifting their money away from oil and gas companies and moving them into green energy stocks. This puts companies such as NextEra Energy (NEE), Brookfield Renewable Partners (BEP), Solaredge Technologies (SEDG), and HL Acquisitions Corp (HCCH) in an excellent spot to benefit as we transition away from fossil fuels toward green forms of alternative energy. NextEra Energy (NEE) 9 \"BUY THE DIP\" Growth Stocks For 2020Electric energy is one form of green energy that could power our future. It will recharge vehicle batteries and power other aspects of our society as we move into a high-tech tomorrow. NEE generates, transmits, distributes, and sells electric power to retail and wholesale customers in North America. The company’s primary subsidiary, FPL, is a utility that generates and distributes electrical energy. NEE creates energy through various means such as solar, wind and nuclear. NEE has a fairly low forward P/E ratio of 27. NEE is a top-rated stock in our momentum-based POWR Ratings system. Overall it is the #1 ranked stock in the Utilities industry. The average analyst price target for NEE is $260. Brookfield Renewable Partners (BEP) If you are looking to invest in a business with an entire portfolio of renewable power facilities, BEP may be a stock for you. The company owns renewable power sites with nearly 200 hydroelectric stations, almost a dozen wind facilities, and several natural gas-fueled plants. BEP owns nearly 20,000 MW worth of renewable energy assets. The company has numerous contracts with utility providers, ensuring it can pay its annual 4.4% dividend. BEP management has established dividend target growth between 5% and 10%. The company’s facilities are located throughout the United States, Brazil, and Canada. BEP is doing quite well in the POWR Ratings with a Buy Rating. It is also the #1 ranked stock in MLPs industry, which comprises companies that own and operate contracted clean energy projects. Solaredge Technologies (SEDG) Solar photovoltaic technology is a technology that converts sunlight into direct current electricity using semiconductors. It is dependent on DC optimized inverters, which SEDG sells. SEDG also provides power optimization tools and a monitoring platform based on the cloud. The company offers solutions for both commercial and residential solar installations. Solar power is likely to be an in-demand commodity as this form of renewable energy is available at a low price, and will always be available. SEDG stands to benefit this. How does SEDG stack up for the POWR Ratings? A for Trade Grade A for Buy & Hold Grade B for Industry Rank B for Peer Grade A for overall POWR Rating It is the #1 rated stock in Solar industry. HL Acquisitions Corp (HCCH) HCCH is a blank check company, meaning it has no specific business plan or purpose. The company intends to acquire or enter into contractual arrangements with other similar businesses. Its primary focus is to figure out how to extract hydrogen from water. If HCCH can accomplish that, its technology will lead the world into a much cleaner and sustainable green energy era. HCCH plans on making this Utopian future a reality through its acquisition of Fusion Fuel, a company working toward developing technology that extracts hydrogen in a clean and cost-efficient manner for mass use. Want More Great Investing Ideas? 9 “BUY THE DIP” Growth Stocks for 2020 Is the Bull S#*t Rally FINALLY Over? 7 “Safe-Haven” Dividend Stocks for Turbulent Times Top 3 Investing Strategies for 2020 NEE shares were trading at $250.89 per share on Wednesday afternoon, up $4.17 (+1.69%). Year-to-date, NEE has gained 4.72%, versus a -1.37% rise in the benchmark S&P 500 index during the same period."}]}