{"article": [{"url": "https://stocknews.com/news/mcd-dpz-cmg-dnkn-4-restaurant-stocks-with-mouth-watering-potential/", "published": 1600776500.0, "headline": "4 Restaurant Stocks With “Mouth-Watering” Potential", "body": "The pandemic has left a long-lasting impact on the restaurant industry. From a complete lockdown to social distancing norms, reduced business operations have led to a $120 billion loss in sales in the first three months of the pandemic, according to the National Restaurant Association (NRA). However, in order to support the recovery of this sector, the NRA has requested low-interest loans and subsidies, as well as reduced taxes from central and state governments. This, combined with an efficient delivery system and drive-thru service, can help the industry recover from pandemic-led losses. However, fast food restaurants have fared well during this pandemic, as these food chains already have a well-established delivery and drive-thru system. Fast food consumption has relatively increased over the past couple of months, as people are substituting dining in restaurants with take away from fast food chains. As coronavirus is not food-borne, eating take-out has become popular across the country. Companies such as McDonald’s Corporation (MCD), Chipotle Mexican Grill, Inc. (CMG), Domino’s Pizza, Inc. (DPZ), and Dunkin’ Brands Group, Inc. (DNKN) have generated profits in the last reported quarters, despite weakness in the industry. Many of them have also expanded their business by opening new franchise restaurants across the country and internationally. As the risk of catching the virus is increasing with each day, the popularity and thereby revenue and earnings of these companies are expected to increase over the upcoming months. 7 Best ETFs for the NEXT Bull MarketMcDonald’s Corporation (MCD) MCD is one of the most popular fast-food joints in the world, operating through the following segments — United States, International Lead markets, High Growth markets, foundational markets, and corporate. MCD recently entered a partnership with zero-waste platform Loop to establish reusable packages in the United Kingdom. MCD is the first company in the fast-food industry to pilot reusable packaging to minimize environmental pollution. As of June 30th, 99% of MCD restaurants in the United States are fully operational, while 94% of the international stores are now open. However, the decline in seating capacity amid the social distancing norms have adversely affected second quarter results. Despite the pandemic driven business constraints, MCD generated $3.76 billion in revenues and $483.80 million in net income in the second quarter that ended in June 2020. MCD’s EPS is expected to grow at 3.9% per year over the next five years. MCD has gained more than 80% since hitting its 52-week low of $124.23 in March. The stock hit its 52-week high of $226.72 in September. How does MCD stack up for the POWR Ratings? A for Trade Grade A for Buy & Hold Grade A for Peer Grade A for Industry Rank A for Overall POWR Rating. You can’t ask for better. It is also ranked #1 out of 49 stocks in the Restaurants industry. Chipotle Mexican Grill, Inc. (CMG) Headquartered in the United States, CMG is a Mexican fast-food restaurant chain operating in North American and European countries. CMG restaurants can be classified as: at the end of a line retail outlets (end-caps), in a line retail outlet (in-lines), free standing, and other. CMG introduced its drive-thru facility Chipotlane in 11 of the new restaurants opened in 2020. Out of its estimated new employee hiring of 10,000 this year, CMG has already appointed 8,000. Moreover, CMG recently launched a new avocado dyed clothing and accessories line, with first access given to 15 million Chipotle Rewards members. CMG’s second-quarter results were impressive. Digital revenue increased 216.3% year-over-year during the quarter, accounting for 60.7% of its total revenue. Net sales increased 6.4% month-to-date (through July 23rd). CMG opened 37 new restaurants, including relocations, during this quarter, while 3 restaurants were permanently closed. The company also has substantial cash holdings and untapped credit, which will help it brave through the crisis. The consensus revenue estimate of $1.58 billion for the third quarter indicates a 12.6% rise year-over-year. Also, CMG has an impressive earnings surprise history, as it beat the street EPS estimates in each of the trailing four quarters. CMG has gained more than 230% since hitting its 52-week low of $415 in March. The stock hit its 52-week high of $1384.46 in September. CMG is rated a “Buy” in our POWR Ratings system, consistent with its strong business model and solid financials. It holds a grade of “A” for Peer Grade and Industry Rank, and a “B” for Trade Grade and Buy & Hold Grade. It is also ranked #4 out of 49 stocks in the Restaurants industry. Domino’s Pizza, Inc. (DPZ) DPZ is a pizza restaurant chain operating in three segments — domestic, international franchise, and supply chain. It services 85 markets across the world, and currently holds a 19% market share in the global quick pizza service category. DPZ has been recently added to the S&P 500 GICS Restaurant Sub-industry index. On July 21st, Dash Brands invested $40 million in DPZ to facilitate its expansion in China. In the fiscal first quarter of 2021, Dash is expected to invest another $40 million as part of the agreement. With DPZ’s market presence in China growing significantly, with over 30% growth over the past few years, this investment will allow the company to expand its operations across the country. DPZ also partnered with Vonage Holdings Corporation (VG) to incorporate cloud communications solutions for efficient digital ordering services. DPZ’s global retail sales increased 5.7% year-over-year in the second quarter. Same store sales in the United States increased 16.1% from the year-ago value, while international same store sales increased 1.3% from the same period last year. Revenue increased 13.4% year-over-year to $108.40 million. Net income increased 28.5% year-over-year to $118.70 million, while diluted EPS increased 36.5% from the year-ago value to $2.99. The consensus EPS estimate of $2.71 for the third quarter that ended in September 2020 indicates a 32.2% increase year-over-year. Moreover, DPZ beat the street EPS estimates in three out of trailing four quarters, which is impressive. The consensus revenue estimate of $943.77 million indicates a 14.5% rise from the same period last year. DPZ has gained more than 55% since hitting its year-to-date low of $270.08 in February. The stock hit its 52-week high of $424.72 in August. It’s no surprise that DPZ is rated a “Strong Buy” in our POWR Ratings system, with a grade of “A” for Trade Grade, Buy & Hold Grade, Peer Grade, and Industry Rank. In the 49-stock Restaurants industry, DPZ is ranked #6. Dunkin’ Brands Group, Inc. (DNKN) DNKN owns and operates a franchise of quick service restaurants under Dunkin’ Donuts and Baskin Robbins brands. It operates through four segments – Dunkin’ Donuts U.S., Dunkin Donuts International, Baskin Robbins U.S., and Baskin Robbins International. Despite the effects of the pandemic on DNKN’s business operations, the company managed to generate $287.40 million in revenues and $36.50 million in net income for the second quarter. To revive its business operations as the United States gradually reopens, DNKN has launched several short-term offers for free coffee and donuts for its members, as well as free home delivery for orders above $10. Though the consensus EPS estimate of $0.80 for the third quarter ending September 2020 indicates a year-over-year decline, DNKN beat the street EPS estimates in each of the trailing four quarters, which bodes well for the stock. DNKN has gained 95% since hitting its 52-week low of $38.51 in March. DNKN’S strong fundamentals are reflected in its POWR Ratings. It has a “Strong Buy” rating with a grade of “A” in Trade Grade, Buy & Hold Grade, Peer Grade, and Industry Rank. In the 49 stock Restaurants sector, DNKN is ranked #2. Want More Great Investing Ideas? 7 Best ETFs for the NEXT Bull Market Stock Market Outlook: Before & After the Election Chart of the Day- See the Stocks Ready to Breakout MCD shares were trading at $215.74 per share on Tuesday afternoon, down $0.67 (-0.31%). Year-to-date, MCD has gained 11.24%, versus a 3.14% rise in the benchmark S&P 500 index during the same period."}]}