{"article": [{"url": "https://stocknews.com/news/spy-inx-dia-iwm-qqq-stock-market-outlook-before-after-the-election/", "published": 1600258100.0, "headline": "Stock Market Outlook: Before & After the Election", "body": "(Please enjoy this updated version of my weekly commentary from the Reitmeister Total Return newsletter). I am no longer expecting a return of the bear market. That is the first time I have said that out loud, but an important proclamation after several months bemoaning the insanity of the stock markets rise. More accurately stated we need a serious right sizing of valuations after a mini-stock bubble formed. Quite possibly 3,000 is the bottom of this move. Maybe a touch lower. But in essence I am removing my expectation for stock prices to get down to 2,500 to 2,700. 7 \"SAFE HAVEN\" Dividend Stocks for Turbulent TimesWhy the change in outlook? We simply have spent too much time in bullish territory. And while that happened there actually were some improvements in the fundamentals. For example, Q2 earnings season was much better than expected with earnings estimates coming up for the rest of the year. Plus the rolling over of economic data in September I was looking for is simply not happening. Yes, jobless claims are still too high. And overall the economy year over year is in really bad shape. However, day by day the economy is healing from the Coronavirus. This shows up in many places like more air travel. Yes, still WAY down from pre-Coronavirus, but getting better week by week. Ditto for restaurant reservations. And many other metrics that point to the US economy slowly, but surely on the mend. So yes, stock prices went WAY TOO HIGH…WAY TOO EARLY. And right now we are seeing the air come out of that bubble. In essence the market is in the process of rightsizing stock prices to about the place they should be at this stage of the recovery. Yes, if there really is a much bigger second wave of the Coronavirus in the Fall and Winter. Or if the virus mutates and becomes more deadly, then it will lead to more isolation and economic shutdowns that harm company profitability and should lead to lower share prices then I state above. But for now the odds of that are lower than the expectation of a continued healing of the economy. So this change in outlook also equates to a change in our trading plan. That is best understood breaking it down into 2 phases: Before vs. After the election. Before the Election Trading Plan I still believe the odds of market downside before the election is greater than upside. Part of that is about the need to right size stock prices after the stock bubble. Another part is about the uncertainty that comes with all Presidential elections. Another part is that THIS election comes with a serious increase in write in ballots which has both parties ready to contest the election results. (Those last 2 points were covered in great detail in the August 2020 RTR Members Only Webinar). The past patterns show to not get lured into the seeming ferocity of the rallies. That is because the election pattern goes kind of like this: Fall > Bounce > Fall > Bounce > Fall, Fall, Fall The pattern of bounces after the fall happens many, many times. But in the end it seems to tumble into the date of the election. That is why I am resisting buying any bounce as I believe they will be short lived. Overall I expect a breakdown below the 50 day moving average at 3331 and likely test the 200 day moving average at 3100. That may be the full extent of the pain. But I suspect that once the momentum picks up to the downside that 3,000 is an important psychological level that may need to be tested to form a buyable bottom. A move to 3,000 = 16% correction from the recent peak. So not quite a bear market…but plenty healthy adjustment in stock prices from the mini-bubble that we experienced beforehand. And plenty big enough move to trade in our portfolio. However, if we hit these lower levels well before the election it will be hard to buy into stocks given the aforementioned risk of a contested election. So let me put it another way… Downside makes more sense than upside prior to the election. Unfortunately the risk of a contested election is too high to buy the dip on stocks before the final results are in. Because if the results are contested, then easy to see another 5-10% downside unfold rather quickly. If not contested, and we have an undisputed Presidential winner, then the market bounces back as it normally does after the election. After the Election Trading Plan The final election results are at the earliest seven weeks away. And if the election is contested that date could get pushed out for weeks or even months into the future. So given what we know now about the economic outlook and state of the Coronavirus, then stocks should rally after the election. No…not another non-stop five month rally with 60% gains. More of an immediate bounce that settles into a fairly tame +5-10% a year pace for the broader market. The less than stellar results is because the big gains that result at the start of a bull market are already in hand. That fits in with the “too much, too soon” theme noted earlier. So I would expect a fairly tame bull market for the next 1-2 years until the economy and earnings prospects play catch up with already elevated valuations. So if the broader market is offering up fairly lackluster results, then where does an investor find outperformance? When the market indices don’t rise much it is called a “stock pickers market”. Meaning that those who select the right stocks in the right groups will find outperformance. To be honest, that has always been my favorite environment because I believe the odds are titled in my favor. The main thing I expect to take place is a change in market leadership. Tech stocks will take the back seat for a while. Same with any company that saw its prospects brighten because of the social distancing caused by the Coronavirus. Those trades are pretty well played out and overpriced. That money should rotate to the groups that benefit the most from a recovering economy and coronavirus being less and less the center of our daily lives. Meaning a return to normalcy. Here I am talking about all the groups like travel, leisure, restaurants, retail, banks and maybe energy. Stock pickers can also dabble in other groups looking for the for the right blend of growth and reasonable valuation. That is the typical path to outperformance in a subdued bull market that is likely on the horizon. As with all of our plans, this is what makes sense now given the facts in hand. We will continue to monitor the situation and adjust accordingly. What To Do Next? Right now my Reitmeister Total Return portfolio has already taken steps to protect against the correction that likely will extend into the November election. All in all we have 9 positions that are just right for the times. 3 stocks that are uniquely built to excel during the Coronavirus recession. 3 precious metals ETFs because when the US government and Fed throw money out of a helicopter it devalues the dollar and makes precious metals all the more valuable. 3 inverse ETFs that rise as the market falls. This has been our saving grace the past couple weeks as the market tumbled from recent highs. And likely will continue to rise in value as this correction has not yet run its course. But let’s be honest with ourselves. Its crazy out there! That’s why I am trying my best to help investors make sense of it all and profit from whatever scenario comes our way. The best way for me to do that is give you 30 days access to the Reitmeister Total Return. This is my newsletter service where I share more frequent commentaries on the market outlook, trading strategy, and yes, a portfolio of hand selected stocks and ETFs to produce profits whether we have a bull…a bear…or anywhere in between. As shared above, we properly called an end to the stock bubble in September and already aligned our portfolio to protect against the downside. That explains how we continue to handily top the market at this time while others are seeing dramatic losses. Just click the link below to see all 9 stocks and ETFs in this uniquely successful portfolio. Plus get ongoing commentary and trades to adjust your strategy as 2020 continues to the wildest market in history. Gladly it can be tamed. About Reitmeister Total Return newsletter & 30 Day Trial Wishing you a world of investment success! Steve Reitmeister …but everyone calls me Reity (pronounced “Righty”) CEO, Stock News Network and Editor, Reitmeister Total Return SPY shares rose $1.82 (+0.54%) in premarket trading Wednesday. Year-to-date, SPY has gained 7.37%, versus a % rise in the benchmark S&P 500 index during the same period."}]}