{"article": [{"url": "https://stocknews.com/news/cat-dhr-de-3-robust-industrial-stocks-to-diversify-your-portfolio/", "published": 1599048500.0, "headline": "3 Robust Industrial Stocks to Diversify Your Portfolio", "body": "The industrial sector has proved to be pretty resilient despite the major disruption earlier this year due to the coronavirus. Many leading indicators are showing strength like the iSM new Orders Index, commodity prices, and transportation stocks. Further gains can be expected. Valuations remain reasonable, and there are looming catalysts as demand continues to normalize. The stocks in this sector belong to a wide range of segments such as construction, agriculture, technology, life sciences, electronics, specialty products, and more. So, if you want to ride the solid recovery of the sector, you may consider adding Danaher Corporation (DHR), Caterpillar, Inc. (CAT), and Deere & Company (DE) to your portfolio. 7 Best ETFs for the NEXT Bull MarketDanaher Corporation (DHR) DHR is a global science, technology, and innovation company that focuses on improving the quality of life. The stock has gained about 70% since its March lows and even hit its 52-week high of $209.38 recently. Seventeen out of twenty Wall Street analysts have a ‘Strong Buy’ rating on the stock. In the second quarter ending July 3rd, 2020, adjusted earnings per share increased 32%, revenues increased by 19%, and free cash flow increased 41% year-over-year. DHR’s acquisition of Cytiva has been beneficial for the company’s growth. Moreover, DHR anticipates core revenue growth including Cytiva to be in the mid to high single-digit range for the third quarter. DHR’s consensus revenue estimate of $5.49 billion for the quarter ending September 2020 indicates a year-over-year increase of 9.1%. With Covid-19 cases increasing rapidly, Beckman Coulter, an operating company of DHR recently announced the SARS-CoV-2 IgM Antibody Test. As the need for diagnostics products is continuously increasing, the company could significantly benefit. Reflecting this potential, the market expects the company to report a year-over-year EPS rise of 28.3% for the current quarter. DHR has an impressive earnings surprise history with the company beating the consensus EPS estimates in three of the trailing four quarters. How does DHR stack up for the POWR Ratings? A for Trade Grade A for Buy & Hold Grade A for Industry Rank B for Peer Grade A for Overall POWR Rating The stock is also ranked #1 out of 60 stocks in the Industrial-Machinery industry. Caterpillar, Inc. (CAT) CAT manufactures and sells construction and mining equipment, diesel and natural gas engines, and industrial gas turbines. The stock has been rising since hitting its 52-week low of $87.50 in March and is up by more than 60%. Moreover, CAT has returned 28.8% over the past year and 14.1% over the past three months. CAT’s EPS grew at an annualized rate of 26.5% over the past five years and the market expects the company’s EPS to increase by 39.7% next year. CAT has enough financial flexibility and ended the second quarter with $8.8 billion of enterprise cash and $18.5 billion of available liquidity sources. The company has an annual dividend of $4.12 which yields 2.82% It’s no surprise that CAT is rated a “Strong Buy” in our POWR Ratings system. It also has an “A” for Trade Grade, Buy & Hold Grade, Peer Grade, and Industry Rank. In the 60-stock Industrial-Machinery industry, it is ranked #2. Deere & Company (DE) DE provides advanced technology, products, and services for agriculture and construction. The stock has gained more than 90% since its March lows. DE recently completed an acquisition of Unimil, a leading Brazilian company in the aftermarket service parts business for sugarcane harvesters which will help strengthen the company’s production systems as well as its operating model. DE has added a new 5-meter model to its line-up and also updated other Zero Series Mower Conditioners. The company also announced the availability of its Mulcher Hydraulics Conversion Kit for the 843L and 843L-II Wheeled Feller Bunchers to enhance the versatility of its machines. DE has increased its yearly net income forecast to about $2.25 billion. Moreover, the company’s new smart-industrial operating model is already showing positive signs. DE has an impressive earnings surprise history with the company surpassing consensus EPS estimates in each of the trailing four quarters. Moreover, the market expects the company’s EPS to increase 37% next year and 8.5% per annum in the next five years. DE’s POWR Ratings reflect a promising outlook. It has an overall rating of “Strong Buy” with an “A” for Trade Grade, Buy & Hold Grade, Peer Grade, and Industry Rank. Among the 60 stocks in the Industrials – Machinery industry, it’s ranked #3. CAT shares were trading at $147.92 per share on Wednesday afternoon, up $1.87 (+1.28%). Year-to-date, CAT has gained 2.55%, versus a 11.89% rise in the benchmark S&P 500 index during the same period."}]}