{"article": [{"url": "https://stocknews.com/news/adbe-wday-ddog-net-4-upgraded-cloud-computing-stocks/", "published": 1596542900.0, "headline": "4 UPGRADED Cloud Computing Stocks", "body": "With the risks related to the pandemic and the consequent lockdown restrictions, corporations and individuals have shifted to a work-from-home culture. As a result, the demand for secure cloud computing platforms has increased in the global market. As a result, cloud computing companies have been soaring. The First Trust Cloud Computing ETF (SKYY) is trading up 32% year-to-date. With no end in sight as to when people will be heading back to office, here are four cloud computing stocks, recently upgraded by our POWR Ratings system, that could continue to rally for the foreseeable future: Adobe, Inc. (ADBE), Workday Inc. (WDAY), Datadog Inc. (DDOG) and CloudFlare Inc. (NET). 7 \"SAFE HAVEN\" Dividend Stocks for Turbulent TimesAdobe, Inc. (ADBE) ADBE is a diversified software company operating in three major segments – Digital Media, Digital experience and publishing. Its subscription service known as Creative Cloud gives members access to all the latest versions of premium creative products. ADBE services in the field of digital marketing, web application development, OEM printing, market automation, etc. ADBE has witnessed a rise in demand for its products during the pandemic, as the focus shifted to cloud platforms. It launched Adobe Digital Economy Index, which acts as a real time barometer, analyzing trillions of online transactions across 100 million product stock keeping units in 18 categories. ADBE partnered with International Business Machines Corporation (IBM) and Red Hat to accelerate digital transformation, as most companies are shifting to cloud-based services for executing their core work. The strategic partnership will also help ADBE develop products which provide real time data security for regulated industries. ADBE generated record revenues in its second quarter that ended May 29th. Revenue increased 14% year-over-year to $3.13 billion. Digital Media segment revenue increased 18% year-over-year to $2.23 billion. Digital experience segment’s quarterly subscription revenues grew 8% year-over-year to $707 million. ADBE’s revenue estimate for the third quarter ending in August indicates a 11.3% rise year-over-year. The consensus EPS estimate of $2.45 indicates a 17.5% growth over the year-ago number. Moreover, ADBE surpassed street EPS estimates in each of the trailing four quarters, which is impressive. ADBE hit its 52-week low of $255.13 on March 18th, but the stock has gained more than 80% since then, hitting its 52 -week high of $470.61 on July 13th. How does ADBE stack up for POWR Ratings? A for Trade Grade A for Buy & Hold Grade B for Peer Grade A for Industry Rank. A for Overall POWR Rating. You can’t ask for better. It is ranked #2 out of 82 stocks in the Software-Application industry. Workday, Inc. (WDAY) WDAY provides strategic enterprise cloud applications for managing business functions and optimizing financial and human capital resources internationally. Its Workday Financial Management Application helps companies develop ledger, accounts payable and receivable, cash, asset, revenue, and grants management. WDAY’s human capital management (HCM) manages workforce lifecycle and employee benefits administration. Its cloud application includes Skills Cloud, Business Planning Cloud and Workday Prism Analytics. It has been named a Leader in Gartner Magic Quadrant for cloud core financial management for four years in a row, based on its completeness of vision and ability to execute. WDAY introduced Workday People Experience to its HCM cloud application for a comprehensive HR service delivery application. It recently integrated with North American Health Operating System ‘League’ to increase efficiency and accuracy of its employee benefit enrollment program. WDAY expanded its operations in Mexico, which had a growing community of 3,200 customers on June 16th. It recently partnered with Salesforce to ensure safe reopening of offices around the country. This partnership aims to curb the spread of coronavirus among employees through a safe and workplace environment. WDAY also partnered with Microsoft Corporation (MSFT) to develop efficient enterprise planning in the cloud and provide business solutions to customers. The street EPS estimate of $0.66 for the quarter that ended in July 2020 indicates a year-over-year increase of 50%. Also, WDAY surpassed the street EPS estimates in three out of four trailing quarters, which bodes well for the stock. WDAY gained more than 65% since hitting its 52-week low of $107.75 in March. WDAY stock is rated “Buy” under our POWR Ratings system, with an “A” in Industry Rank, and “B” in Trade Grade and Buy & Hold Grade. Out of 82 stocks in the Software Application industry, it is ranked #25. Datadog, Inc. (DDOG) DDOG is a monitoring and analytics SaaS platform providing automated infrastructure and application performance monitoring, log management and advanced analytics services. DDOG was named Customers’ Choice in “May 2020 Gartner Peer Insights ‘Voice of the Customer’: IT Infrastructure Monitoring Tools.” On July 30th DDOG announced support for log data via Amazon Kinesis Data Firehose, which loads streaming data into data lakes, data stores and analytics tools. It also teamed up with Amazon Web Services (AWS) to provide support for Amazon Elastic File System for AWS lambda. DDOG’s monitoring and security platform for cloud applications have introduced general availability of private locations for synthetic monitoring. DDOG received FedRAMP Low Impact SaaS Authorization on June 19th, which will allow U.S. federal departments and agencies to adopt DDAY’s cloud platform. DDOG has surpassed consensus EPS estimate in three of the four trailing quarters, which is impressive. And the company hit its 52-week high of $98.99 on July 9th and gained more than 240% since hitting its year-to-date low in March. DDOG is rated a “Strong Buy” stock in our POWR Ratings system, consistent with its impressive performance throughout the first half of 2020. It has an “A” in Trade Grade and Buy & Hold grade, and “B” in Peer Grade and Industry Rank. It is currently ranked #4 out of 47 stocks in the Software- Business Group. CloudFlare, Inc. (NET) NET is a cloud platform offering a range of network services such as cloud firewall, bot management, SaaS services, Infrastructure protection, rate limiting etc. to businesses worldwide. NET released Cloudflare Workers Unbound as a secure serverless computing platform to facilitate the work from home vulture. This cost-effective software upgrade allows users to save 75% of the workload running on legacy centralized serverless platforms. On May 6th, NET entered into a partnership with Kentik platform to enhance cyber security systems. It integrates network traffic intelligence to mitigate distributed denial-of-service (DDoS) attacks. NET recently opened an office in Tokyo to expand and support its business in the Asia-Pacific region. To this end, NET entered into a strategic partnership with China’s intelligence provider JD Cloud & AI to provide secure cloud computing services to companies globally. Such intensive business expansion projects are expected to lead to impressive performance for the company. NET gained more than 170% since hitting its year-to-date low of $15.05 in mid-March. NET is rated a “Strong Buy” stock in our POWR Ratings system, consistent with its strong business model and sound expansion policy. It has an “A” in Trade Garde and Buy & Hold Grade, and “B” in Peer Grade and Industry Rank. In the 23 stocked Software- Security group, NET is currently ranked #5. Want More Great Investing Ideas? 9 “BUY THE DIP” Growth Stocks for 2020 How HIGH Can This Tech Bubble Fly? 7 “Safe-Haven” Dividend Stocks for Turbulent Times ADBE shares were unchanged in after-hours trading Tuesday. Year-to-date, ADBE has gained 35.51%, versus a 3.60% rise in the benchmark S&P 500 index during the same period."}]}