{"article": [{"url": "https://stocknews.com/news/ups-fdx-expd-3-strong-buy-transportation-stocks-delivering-the-goods/", "published": 1601035700.0, "headline": "3 STRONG BUY Transportation Stocks ‘Delivering the Goods’", "body": "Certain transportation companies have performed well so far this year despite significant supply-side problems caused by the pandemic. The leading names have all managed to deliver better than expected results in their last reported quarter. These companies have experienced a growth in demand thanks to the accelerated growth in e-commerce which has more than offset other weaker areas. Small and medium-sized businesses are using shipping and courier services to deliver their products. Leading shipping companies such as United Parcel Service, Inc. (UPS), FedEx Corporation (FDX), and Expeditors International of Washington, Inc. (EXPD) have managed to thrive during this brutal period and look set to continue their outperformance for the foreseeable future. 7 \"SAFE HAVEN\" Dividend Stocks for Turbulent TimesUnited Parcel Service, Inc. (UPS) UPS operates as a package delivery, transportation, logistics, and financial services company. It works in domestic delivery, international delivery, and supply chain and freight services. UPS stock has performed well so far this year, delivering returns of 37%. The company had a better-than-expected second quarter, recording revenue growth of 13.4% year-over-year. The company’s average daily volume increased by 22.8% during the same period. The high demand for its services has led to the company charging a holiday fee for large deliveries, which could work well for the company’s bottom line. The rising popularity of e-commerce has been helping UPS experience solid business growth. The company’s revenue is expected to grow by 9% this year and 4.8% next year. The company’s EPS is estimated to rise 13.4% next year and at a rate of 7.3% per annum over the next five years. How does UPS stack up for the POWR Ratings? A for Trade Grade A for Buy & Hold Grade B for Peer Grade A for Industry Grade A for Overall POWR Rating The stock is also ranked #1 out of 9 stocks in the Air Freight & Shipping industry. FedEx Corporation (FDX) FDX is a domestic and international shipping and freight company. The company also provides services related to customs brokerage, ocean, and freight forwarding services, international trade advisory services, customs-trade against terrorism program, and customs clearing services. The stock has delivered returns of 62.5% so far this year. FDX has also benefited from the larger than usual e-commerce volumes. The company recently announced its results for the first quarter ended August 31st, in which the company saw revenues of $19.3 billion which was an increase from $17 billion a year ago. The company has also stated that its subsidiaries FedEx Express, FedEx Ground, and FedEx Freight will increase its shipping rates from January 4th, 2021. According to the company, the proceeds from the increased rates will go towards fleet maintenance and technology innovations. FDX’s revenue is expected to grow by 10.7% this year and 4.9% next year. The company’s EPS is estimated to rise 66.1% this year and at a rate of 26.1% per annum over the next five years. It’s no surprise that FDX is rated a “Strong Buy” in our POWR Ratings system, with a grade of “A” in Trade Grade, Buy & Hold Grade, Peer Grade, and Industry Rank. In the 9-stock Air Freight & Shipping industry, it is ranked #2. Expeditors International of Washington, Inc. (EXPD) EXPD is a global logistics company. Its services include customs brokerage, cargo insurance, vendor consolidation, order management, warehouse distribution, time-definite transportation, and customized logistics services. EXPD’s stock has gained 14.5% so far this year. During the second quarter, the company’s revenue saw an increase of 27% while its operating income increased by 29%. The company has acquired a Fleet Logistics Digital Platform that will support their online shipping platform, Koho. Koho allows users to book, manage, track, and quote their shipments online. This move is part of a larger strategy for the company to go digital. EXPD’s revenue is expected to grow by 10% this quarter and 10.8% this year. The company’s EPS is estimated to rise by 9.1% this year and at a rate of 6.6% per annum over the next five years. EXPD’s strong fundamentals are reflected in its POWR Ratings, it has a “Strong Buy” rating with an “A” in Trade Grade, Buy & Hold Grade, and Peer Grade. In the 9-stock Air Freight & Shipping industry, it is ranked #3. Want More Great Investing Ideas? 7 Best ETFs for the NEXT Bull Market Is the Stock Market Correction Over? Chart of the Day- See the Stocks Ready to Breakout UPS shares were trading at $166.12 per share on Friday afternoon, up $5.71 (+3.56%). Year-to-date, UPS has gained 45.74%, versus a 3.60% rise in the benchmark S&P 500 index during the same period."}]}