{"article": [{"url": "https://stocknews.com/news/ccl-cuk-rcl-nclh-3-cruise-stocks-falling-back-to-earth/", "published": 1593605300.0, "headline": "3 Cruise Stocks Falling Back to Earth", "body": "With the coronavirus still a threat, would you feel comfortable on a cruise ship? Given what we know about the virus and previous instances of diseases rapidly spreading on ships, it’s no surprise that the cruise industry is facing an existential crisis. What is surprising is the group’s more than 100% gain between mid-May and early-June. Before this move, the cruise stocks had rebounded off their March lows but remained range-bound. 7 Best ETFs for the NEXT Bull MarketThe breakout from this range was largely due to retail traders piling into the sector in hopes that the coronavirus was receding, and the economy would be able to quickly normalize. Adding fuel to the fire was high short interest and bearish sentiment. In recent weeks, these gains have been nullified as cruise stocks have fallen by 35% on average as reality sets in. Here are 3 cruise stocks that have fallen back to Earth: Carnival Corporation (CCL) (source: stockcharts.com) The chart above of CCL demonstrates its recent price action and returns to its trading range. Since the March lows, nearly every stock in the market is higher. Many of these stocks’ fundamentals have improved due to a change in consumer and business behavior. Others are benefitting from stimulus from the Fed and the federal government. However, the cruise stocks’ fundamentals have deteriorated. These are businesses with massive liabilities, $13.1 billion in CCL’s case, that are simply not earning any cash right now. The CDC has halted all cruises until July 24, and this order is likely to be extended given recent developments. The Cruise Line International Association said no cruises will sail until mid-September, at least. In the future, earnings will likely be impaired due to many being unwilling to take the risk of exposure on a cruise ship. Even if cruises are allowed to resume operations later this year, it will only happen with social distancing guidelines in place. This will be particularly challenging since the business model is about cramming as many people as possible into small, tight quarters. CCL’s POWR Ratings are consistent with this grim picture as it has a “Strong Sell”. It also has an “F” in Trade Grade, Industry Rank, and Buy & Hold Grade with a “C” in Peer Grade. Among the Cruise sector, it’s ranked #3 out of 5. Norweigan Cruise Line Holdings (NCLH) NCLH is up 146% from its March low and 36% off its June high. The stock’s resilience is mystifying given the flow of bad news, resurgence of coronavirus case counts in port cities, credit downgrades, and flurry of analyst warnings. With revenues plunging, NCLH has been forced to tap the credit markets for financing on onerous terms. In May, the company raised $2 billion by issuing stock and debt with interest rates between 6% and 12%. This does give the company $2.2 billion in liquidity which ensures that it can survive the next 12 months even with zero in revenues. NCLH is rated a “Strong Sell” by the POWR Ratings. It also has an “F” in Trade Grade, Industry Rank, and Buy & Hold Grade with a “C” in Peer Grade. Among Cruise stocks, it’s ranked #4 out of 5. Royal Caribbean Cruises (RCL) Another issue for cruise operators is that they are not headquartered in the US but the Caribbeans. This is advantageous in many ways. They can shield tax liabilities and not follow labor laws, but it’s a major problem at the current moment because they can’t benefit from government assistance like the airlines. RCL is “on watch” at S&P Global and expected to be downgraded to junk status. The company has also been forced to raise money by issuing $3.3 billion in debt using its ships as collateral to give it a financial cushion. Its recent earnings report was dour with management estimating monthly cash burn between $250 and $275 million. It posted a net loss of $1.44 billion compared to a $249.7 million profit in the same quarter in 2019. The company is also writing down the value of its assets. Along with a poor outlook and deteriorating fundamentals, RCL is rated a “Strong Sell” by POWR Ratings. It also has an “F” in Trade Grade, Industry Rank, and Buy & Hold Grade with a “C” in Peer Grade. Among Cruise stocks, it’s ranked #1 out of 5. Want More Great Investing Ideas? 9 “BUY THE DIP” Growth Stocks for 2020 Is the Bull S#*t Rally FINALLY Over? 7 “Safe-Haven” Dividend Stocks for Turbulent Times Top 3 Investing Strategies for 2020 CCL shares were trading at $16.52 per share on Wednesday afternoon, up $0.10 (+0.61%). Year-to-date, CCL has declined -67.12%, versus a -2.35% rise in the benchmark S&P 500 index during the same period."}]}