{"article": [{"url": "https://stocknews.com/news/adbe-docu-sap-3-software-stocks-for-the-second-half-of-2020/", "published": 1594037300.0, "headline": "3 Software Stocks for the Second Half of 2020", "body": "So far, the software sector has been immune to the coronavirus with many software companies seeing an increase in revenues. The shift to remote work is driving demand for these companies’ products as they become a necessity for companies to operate. And many companies are seeing more efficiency with lower costs which will make these products even more entrenched. This is a departure from the consensus which thought that weakness among businesses would lead to cutbacks for spending on software products. Thus the short-term picture looks surprisingly constructive for the sector. Longer-term, as companies and individuals shift more of their operations to digital infrastructure, software stocks look promising. 9 \"BUY THE DIP\" Growth Stocks For 2020The Dow Jones US Software Index has delivered a YTD return of 27.1% in contrast, the Dow Jones Industrial Average Index is down 9.5%. Unlike most stocks, software stocks are higher now than they were before the coronavirus. Given their fundamentals and this short-term catalyst, there’s good reason to expect the momentum to continue. Here are the top software companies for the second half of 2020: Adobe (ADBE) Most people know Adobe thanks to .pdf files and Photoshop, however, the company provides a range of software solutions for marketers, application developers, and enterprises. Recently, ADBE has also entered into the cloud computing space, which is witnessing high levels of growth, as companies increase cloud spending. Its last earnings report showed that its Digital Media segment, which includes its Creative Cloud and Document Cloud divisions, increased revenue by 22% on an annual basis. Even though Adobe is facing stiff competition in the space from the likes of Amazon (AMZN) and Google (GOOGL), it has carved a growing niche for itself by targeting creatives and marketing professionals. Apart from the Creative Cloud, Adobe has diversified its offerings by releasing the Experience Cloud which delivers tools for advertising, analytics, and commerce. ADBE has delivered a YTD return of 34.3% despite the turbulent market. Our POWR Ratings system gives ADBE a Strong Buy. It has an “A” for Trade Grade, Buy & Hold Grade, Industry Rank, and Peer Grade. Among software companies, it’s ranked #2 out of 82. SAP SE ADS (SAP) SAP is one of the largest software companies in the world. It is the world’s largest enterprise software company, and the company claims that 77% of the world’s transaction revenue touches an SAP System. Some of the features of its product are analytics software, inventory management, and solutions for commerce, finance, asset management, human resource, marketing, and sales. Recently, the company has rapidly shifted its offerings to the cloud to position itself for the future. Its first-quarter revenue for its cloud services was $2.2 billion. The company recently announced an industry cloud developed in partnership with IBM (IBM) to take on the leading cloud companies like Microsoft (MSFT) and Amazon.com (AMZN). SAP has a Strong Buy for its overall POWR Ratings, along with an “A” for each of the four POWR components including Trade Grade, Buy and Hold Grade, Industry Rank, and Peer Grade. SAP has an Industry Rank of #4 out of 82 other software companies. DocuSign (DOCU) DOCU provides cloud-based transaction products that allow companies and individuals to remotely enter into agreements. The company is playing an essential role in companies doing business on the Internet, remote work, and enables social distancing. Its principal offering is an e-signature solution that enables clients to digitally sign documents. DOCU has delivered a YTD return of 157.7% and is up 266.6% over the last 12 months. Its last earnings report in June painted a strong picture for the future as well with an increase in the number of customers and revenue per customer which translates into accelerating revenues. 95% of the company’s revenue is recurring which means DOCU does a great job of holding onto its customers. It witnessed a sequential growth in billings of 59% in the last quarter surpassing most expectations. This growth has been powered by increasing remote working environments that demand the use of e-signatures. POWR Ratings has given DOCU a Strong Buy. Unsurprisingly, the company has an “A” for Trade Grade, Buy & Hold Grade, Peer Grade, and Industry Rank. DOCU is another high-performing software company with a StockNews.com Industry Rank of #5 out of 82 companies in the space. Want More Great Investing Ideas? 9 “BUY THE DIP” Growth Stocks for 2020 Is the Bull S#*t Rally FINALLY Over? 7 “Safe-Haven” Dividend Stocks for Turbulent Times Top 3 Investing Strategies for 2020 ADBE shares were trading at $452.67 per share on Monday afternoon, up $9.72 (+2.19%). Year-to-date, ADBE has gained 37.25%, versus a -0.84% rise in the benchmark S&P 500 index during the same period."}]}