{"article": [{"url": "https://stocknews.com/news/tsla-unh-noc-xom-2-election-stocks-for-a-biden-win-and-2-for/", "published": 1601381300.0, "headline": "2 Election Stocks for a Biden Win and 2 for a Trump Win", "body": "Tonight is the night that many political pundits have been waiting for, the first presidential debate between President Trump and the former Vice President. With Biden leading in the polls, this is a chance for the President to try and change his campaign’s direction. Debates don’t typically result in significant market moves, but this night could be different. The markets have been down this month and experiencing volatility as we head into the campaigns’ home stretch. All three major market indices are currently down today as investors wait to see what the candidates have to say. While the debate may provide some clarity to investors, many people have already decided who they are voting for. As anything could happen between now and election day, I thought I would look at a couple of stocks that could benefit from a Biden win and a couple that stands to benefit from a Trump win. The stocks I have chosen are companies that should benefit over the next four years based on policies likely to be enacted by the two candidates. If Biden wins, I believe Tesla (TSLA) and UnitedHealth (UNH) should benefit, while Northrop Grumman (NOC) and Exxon Mobil (XOM) should benefit from a Trump win. 9 \"BUY THE DIP\" Growth Stocks For 20202 Election Stocks for a Biden Win Tesla (TSLA) TSLA had been flying high this year until September 1st when it started to plummet and had its worst single-day loss ever on September 8th. If you have read my previous articles on TSLA, I felt that the company was wildly overvalued from a fundamental perspective. While the stock has dropped in price this month, I still think it is overvalued. But there is no denying that it won’t benefit from a Biden presidency. The former Vice President is very keen on transitioning into clean energy, and TSLA is the dominant company in electric vehicles. The bullishness around the company would likely not only continue in a democratic administration but send the stock soaring again. When you throw in TSLA’s solar ambitions and its goal of building a million-mile battery, the sky’s the limit under Biden. Investors are expecting an update later this week from the company on its Q3 production and deliveries. Expectations are that the company will set production records in the quarter. TSLA is rated a “Buy” in our POWR Ratings system. It holds a grade of “A” in Trade Grade, and a “B” in Peer Grade and Industry Rank. These are three out of the four components that make up the POWR Ratings. The stock is also ranked #4 in the Auto & Vehicle Manufacturers industry. UnitedHealth (UNH) In addition to clean energy, a democratic administration will also be focused on healthcare and building upon the Affordable Care Act. This bodes well for the managed healthcare industry. UNH is the largest private health insurance provider in the United States, offering nearly 50 million members medical benefits. The company, a leader in employer-sponsored and government-backed insurance plans, has obtained massive scale in managed care. While many Republicans argue that Biden will cater to his party’s progressive wing and try to implement a “Medicare for All” plan, the former Vice President has stated that he prefers adding a public option. As long as the Affordable Care Act stays in place, a company such as UNH should benefit significantly. UNH has some of the top healthcare systems under its roof. It has the largest private health insurer in UnitedHealthcare, one of the largest pharmacy benefit managers in OptumRx, a large service provider in OptumHealth, and a popular health analytics franchise in OptumInsight. Revenue for all four segments should see robust revenue growth in a Biden administration. UNH is rated a “Buy” in our POWR Ratings system. It has grades of “A” for Buy & Hold Grade and Peer Grade, and “B” for Trade Grade and Industry Rank. It is also the #1 ranked stock in the Medical – Health Insurance industry. 2 Election Stocks for a Trump Win Northrop Grumman (NOC) NOC is a defense contractor with segments in aeronautics, mission systems, defense services, and space systems. Defense companies typically do quite well in Republican administrations as aggressive military spending has been a priority for Republican presidents. It hasn’t been any different under President Trump. Shortly after becoming President, Trump added more than $200 billion to the defense budget for fiscal years 2017 through 2019. Then in December of 2019, he signed a $738 billion defense bill for fiscal 2020. This should undoubtedly continue under a second Trump administration. NOC is one of the largest defense companies and one of the most important contractors for the U.S. Department of Defense The company has a strong position in the Air Force, Space & Cyber Security programs, which allows it to get hefty contracts from the Pentagon. Approximately 95% of its revenue comes from government contracts (83% federal). As long as President Trump remains in office, this company’s future growth looks enticing. The stock is rated a “Buy” in our POWR Ratings system. It holds a grade of “A” in Peer Grade, and a “B” for Trade Grade and Buy & Hold Grade. It is also ranked #5 in the Air/Defense Services industry. Exxon Mobil (XOM) In addition to defense stocks, energy stocks should also see massive growth in a Trump administration. While energy stocks like XOM have suffered this year due to the coronavirus pandemic, the company should see a huge turnaround in a second Trump administration. His current administration has rollbacked several environmental protections, which has directly benefited the oil & gas industry. The President has pledged to support the industry during its time of need. That may include further deregulation, which could help bolster companies such as XOM. Keep in mind that the pandemic is likely a short-term event, so I expected XOM to bounce back over the next couple of years, especially with Trump as Commander and Chief. In the meantime, the company plans on maintaining dividends by reducing operating expenses and deferring capital investments. XOM is the energy company best positioned to weather the current storm and maintain its dominant stature in the energy sector when oil prices shoot back up. Let’s not forget that fossil fuels are not gone yet. Even as many companies shift towards green energy, we will still need oil and gas for the foreseeable future while we transition into alternative energy. If you believe President Trump will win a second term, XOM can be had at a seventeen-year low and could provide a lucrative upside. Want More Great Investing Ideas? 7 “Safe-Haven” Dividend Stocks for Turbulent Times When Does the Next Bull Run Start? Chart of the Day- See the Stocks Ready to Breakout"}]}