{"article": [{"url": "https://stocknews.com/news/nflx-amd-lrcx-fnv-4-growth-stocks-to-buy-on-the-dip/", "published": 1599221300.0, "headline": "4 Growth Stocks to BUY on the Dip", "body": "After witnessing the best August in decades, and a strong recovery from its March low, the S&P 500 has been trending downwards over the last few days. This provides a buying opportunity as shares become a little more affordable. The market still holds potential to grow, according to many analysts. Trying to time the market due to elevated valuations is hard to achieve, especially since interest rates are so low. low-rate environment, So, the best strategy might be to focus on fundamentals rather than temporary external factors. Growth stocks have already contributed significantly to the recovery of the stock market, which can be seen from the performance of the SPDR Portfolio S&P 500 Growth ETF’s (SPYG) 65.6% gain since hitting its low in mid-March. This extraordinary performance of the growth stocks has been driven by technological advances and strong fundamentals. And these factors should keep driving these stocks higher. Here are four growth stocks that could rise even further in the months ahead: such as Netflix, Inc. (NFLX), Advanced Micro Devices, Inc. (AMD), LAM Research Corporation (LRCX), and Franco-Nevada Corporation (FNV). 7 Best ETFs for the NEXT Bull MarketNetflix, Inc. (NFLX) NFLX needs no introduction. This streaming company has made a name for itself through the popularity of its original programming, and is the market leader in streaming platforms. NFLX has largely benefitted from people spending more time at home due to the global health crisis. The stock has gained 62% so far this year, and is trading at near all-time highs. The company has added 10.1 million subscribers to the platform in the second quarter of 2020, which is a growth of 27.3% year-over-year. NFLX is looking to expand its global reach by offering mobile-only lower-cost subscriptions and through bundled offerings with ISPs and MVPDs. The revenue of the company is expected to grow by 23.4% in 2020, and by 17.4% in 2021. The company’s EPS is estimated to grow by 49.6% in the current year, and by 42.4% next year. How does NFLX stack up for the POWR Ratings? A for Trade Grade B for Buy & Hold Grade A for Peer Grade A for Industry Rank B for Overall POWR Rating The stock is also ranked #7 out of 57 stocks in the Internet industry. Advanced Micro Devices, Inc. (AMD) AMD develops, manufactures, and markets semiconductor devices such as computer processors and graphics processors. AMD has been one of the best performing technology stocks over the last few years. The stock has returned 80% so far this year, despite disruptions to its supply-side caused by the spread of the coronavirus. The company has recently launched an entry-level GPU (Graphics Processing Unit) called the Radeon RX 5300, which is a more cost-effective alternative to a comparable offering by NVIDIA (NVDA). The company has entered into agreements with Microsoft (MSFT) and Sony (SNE) to provide custom GPUs and processing units for their upcoming consoles. AMD’s revenue is expected to rise by 32.4% in the current year, and by 22.8% next year. The company’s EPS is estimated to grow by 70.3% in 2020, and by 51.4% in 2021. It’s no surprise that AMD is rated a “Buy” in our POWR Ratings system, with a grade of A in Trade Grade, Peer Grade, and Industry Rank. In the 86-stock Semiconductor & Wireless Chip industry, it is ranked #9. LAM Research Corporation (LRCX) LRCX designs, develops, manufactures, and markets semiconductor manufacturing equipment for making integrated circuits and processors. The company’s major products called Vector, Sabre, and Kiyo are sold around the world to enterprise customers. LRCX has delivered a year-to-date price return of 16.8%, and its stock price has recovered from the dip caused by the global health crisis. The company is highly involved in the production of memory and storage devices. And this market is poised for significant growth due to developments in the Internet of Things (IoT), cloud computing, and big data. LRCX has entered into a partnership with 3D printer manufacturer VELO3D for the development of 3D metal printing for semiconductor applications. LRCX’s revenue is expected to grow by 23.9% in the current year, and by 8.5% next year. The company’s EPS is estimated to rise by 31.9% in the current year and by 14.6% next year. LRCX’s strong fundamentals are reflected in its POWR Ratings. It is rated a Buy, with a grade of A for Industry Rank. Within the Semiconductor & Wireless Chip industry, it’s ranked #11 out of 86 stocks. Franco-Nevada Corporation (FNV) FNV is a gold-focused royalty and stream company that operates in the US, Canada, and internationally. The company has no debt and has a diverse portfolio of cash-flow producing assets. The company has a strong potential for growth thanks to its 240 exploration and development royalties. FNV has delivered a year-to-date price return of 44%. The company has entered into an agreement to acquire a 1% NSR for $100 million with reference to all the minerals produced from the Alpala copper-gold-silver project in Northern Ecuador. FNV has also raised $66.8 million through issuance of shares. The company is estimated to witness EPS growth of 14.9% in the current year and 6.5% next year. FNV is also expected to see a rise in revenue of 11.7% in the current year and 3.7% next year. It’s no surprise that FNV is rated a Buy in our POWR Ratings system. It has a grade of B in Trade Grade, Buy & Hold Grade, and Industry Rank. In the 30-stock Miners- Gold industry, it is ranked #7. Want More Great Investing Ideas? 7 Best ETFs for the NEXT Bull Market Beware Stocks in September? 9 “BUY THE DIP” Growth Stocks for 2020 NFLX shares were trading at $512.22 per share on Friday afternoon, down $13.53 (-2.57%). Year-to-date, NFLX has gained 58.30%, versus a 7.75% rise in the benchmark S&P 500 index during the same period."}]}