{"article": [{"url": "https://stocknews.com/news/avgo-amt-cci-chtr-4-5g-stocks-that-tower-above-the-rest/", "published": 1596715700.0, "headline": "5G Stocks That \"Tower\" Above the Rest", "body": "5G is the next “big” growth driver of the telecom industry. Mobile carriers are aggressively spending to upgrade infrastructure to prepare for the first generation of 5G-enabled devices. 5G is going to lead to more capabilities for smartphones and unlock the next wave of consumer and enterprise applications. thing expected to revolutionize the communication industry around the globe. Several countries Deploying this technology will enable the global economy to churn out $13.2 trillion in output by 2035, as per the Informa Tech report. 5G sales are expected to reach $11.2 trillion by 2026. 7 \"SAFE HAVEN\" Dividend Stocks for Turbulent TimesBroadcom Inc. (AVGO), American Tower Corporation (REIT) (AMT), Crown Castle International Corporation (CCI) and Charter Communications, Inc. (CHTR) are some of the best companies in the United States competing in the 5G race. Broadcom Inc. (AVGO) AVGO is an analog and digital semiconductor manufacturer based in the United States. It also has valuable IP which it licenses to other companies. Products and IP from Broadcom are extensively used in private broadband connections, data center networking, set-top boxes, smartphones and other telecommunication equipment, factory automation, alternative energy systems, and power systems, etc. AVGO has huge growth potential, due to the 5G upgrade cycle. As semiconductors are a vital component of the infrastructure for the upcoming network, demand is increasing. Despite the pandemic, AVGO not only managed to keep its operations afloat but also increased its revenues 4% year over year to $5,742 million in the second quarter ended May 3rd. It reported record cash flow of over $3 billion, which is a 205.7% improvement from its year-ago number. AVGO pays an annual dividend of $13, which yields 3.96% based on its current price. It had increased its dividend by 22.6% in the last quarter of 2019 and has managed to retain that amount even during the economic slump caused by the pandemic. The consensus EPS estimate of $5.23 for the current quarter ending July 31st indicates a year-over-year rise of 1.4%. Its street revenue estimate of $5.76 billion shows a 4.5% increase year over year. AVGO shares increased more than 100% after hitting its 52-week low on March 18th. This strong recovery can be attributed to AVGO’s growth momentum and advanced business model. How does AVGO stock up for the POWR ratings? A for Trade Grade A for Buy & Hold grade B for Peer Grade A for Industry Rank A for Overall POWR rank AVO is also ranked #3 out of 86 stocks in the Semiconductor and Wireless Chip industry. American Tower Corporation (REIT) (AMT) AMT is one of the best-performing REITs during this pandemic, gaining more than 40% since hitting its 52-week low of $174.32 on March 23rd. The quick upswing can be attributed to surging demand for data centers across the country with an increasing move of corporations and individuals to digital platforms. AMT is also playing a vital role in the upcoming 5G network. Hence, AMT’s revenues are expected to continue rising. For the second quarter ended June 2020, AMT’s net revenue came in at $1913 million, up 1.2% year over year. AMT’s property revenue grew 2.4% during the same time, with more than 500 towers being constructed globally. Its net income grew 3.2% year over year to $4.48 billion during the quarter. AMT’s EPS is expected to grow at 15% annually over the next 5 years. AMT has a dividend yield of 1.69%. The company has been consistently increasing dividends since 2012 and should be able to continue doing so given its increasing cash flow. AMT’s free cash flow has increased for 11 consecutive quarters. AMT is rated “Strong Buy” in our POWR Ratings system, consistent with the strength in its financials. It also has an “A” for Trade Grade, Buy & Hold Grade and Peer Grade, and “B” in Industry Rank. It is ranked #1 out of 50 stocks in the REITs- Diversified industry. Crown Castle International Corporation (REIT) (CCI) CCI owns, operates, and leases more than 40,000 cell towers across the United States and Peurto Rico. It has approximately 80,000 miles of fiber cells and wireless infrastructure. The REIT industry has suffered tremendously since the onset of the pandemic, as commercial usage of properties has declined due to the workforce adapting to the work from home culture. Nonetheless, CCI has managed to thrive in such challenging conditions due to its primary focus on data cell towers. With the upcoming 5G technology, CCI has reported an influx of revenue in the first two quarters of 2020 as data centers are investing heavily in acquiring additional infrastructure to ensure widespread connectivity. For the second quarter ended June 2020, CCI’s site rental revenues increased 44% year over year to $1,319 million. Its AFFO increased by 3.3% to $609 million. CCI currently pays $4.80 per share annually, which yields 2.89% based on its current price. It is a valuable dividend stock in the Stocknews.com universe, having issued more dividends than 93% of other companies in the same category. As investment activities in the 5G sector are increasing rapidly, CCI CEO Jay Brown expects the company’s AFFO per share to rise at least 7% in the next two quarters. CCI’s earnings are expected to grow 19.5% annually in the next five years. CCI hit its 52-week of $114.18 on March 24th and gained more than 40% since then. CCI is rated a “Buy” in our POWR Ratings system, with an “A” in Trade Grade and Peer Grade and “B” in Buy & Hold Grade. It is ranked #5 in the 41-stocked Real Estate Services industry. Charter Communications, Inc. (CHTR) CHTR is a telecommunications company providing cable services for residential and commercial use. It also provides internet services through high-performance wireless routers in three categories – in-home WiFi, out-of-home WiFi, and Spectrum WiFi. CHTR is a registered bidder in the U.S. Federal Communications auction for a lucrative spectrum that can be used for the upcoming 5G technology. It partnered with the National Urban League (NUL) and National Action Network (NAN) to support small businesses and minority communities across the United States. CHTR will benefit significantly from the growth of these communities. CHTR reported $11.7 billion in revenues for the second quarter, indicating a year-over-year rise of 3.1%. Its residential revenues grew 4.1%, while mobile revenues increased 96.1% from its year-ago numbers. As a result, its net income amounted to $766 billion, indicating a 143.9% increase compared to the second quarter of 2019. The company’s consolidated free cash flow increased $0.8 billion or 72.7% year over year. The consensus EPS estimate of $3.02 for the third quarter indicates a 73.5% rise. Also, CHTR managed to surpass market estimates in three of the trailing four quarters, which is impressive. The consensus revenue estimate for the third quarter indicates a 5.1% increase year over year. CHTR gained more than 70% to hit its 52-week high of $603.60 on August 5th after hitting its 52-week low of $345.67 on March 18th. It’s no surprise CHTR is rated “Strong Buy” in our POWR Ratings system. It holds an “A” in Trade Grade, Buy & Hold Grade, Peer Grade, and “B” in Industry Rank. Out of 14 stocks in the Entertainment – TV Internet Providers industry, it is ranked #1. Want More Great Investing Ideas? 9 “BUY THE DIP” Growth Stocks for 2020 How to Trade THIS Stock Bubble? 7 “Safe-Haven” Dividend Stocks for Turbulent Times AVGO shares rose $0.34 (+0.10%) in after-hours trading Thursday. Year-to-date, AVGO has gained 7.02%, versus a 4.94% rise in the benchmark S&P 500 index during the same period."}]}