{"article": [{"url": "https://stocknews.com/news/halo-ego-bsig-3-value-stocks-to-balance-your-portfolio/", "published": 1598270900.0, "headline": "3 Value Stocks to BALANCE Your Portfolio", "body": "Given the stock market’s 66% rally from its March lows, many stocks are now expensive and overextended. These companies have to keep delivering earnings growth to justify their higher multiples. This is tenuous given the number of uncertainties including the coronavirus, Congress’ ability to pass another round of stimulus, and the upcoming election. However, the market is still offering opportunities to buy value stocks with upside. These stocks can provide a good balance to your portfolio since they will probably outperform if the market falls lower. Additionally, the outperformance of growth stocks relative to value stocks has become the most extreme, since the dotcom bubble peaked in 2000. After the dotcom bubble popped, value stocks outperformed by a significant margin over the next few years. Halozyme Therapeutics, Inc. (HALO), Eldorado Gold Corporation Ordinary Shares (EGO), and BrightSphere Investment Group Inc. (BSIG) are three value stocks that are worth considering for your portfolio. 7 \"SAFE HAVEN\" Dividend Stocks for Turbulent TimesHalozyme Therapeutics, Inc. (HALO) This biopharmaceutical company has an EV/EBITDA ratio of -68.3 and a cash/share ratio of 2.78, both lower than their respective industry averages. The average analyst price target of HALO is $33.2 which represents a potential upside of 16.5%. In the second quarter, HALO’s revenue increased 41.2% year-over-year and the company recorded net income per share of $0.19 as compared to a loss per share of $0.10 a year ago. The stock has grown about 120% since it hit its 52-week low of $12.71 in mid-March. There were two U.S. FDA approvals and one EMA Approval received by HALO’s partners for products utilizing Halozyme’s ENHANZE® Technology. Moreover, the company recently announced the FDA Approval for Roche’s Phesgo™. HALO’s consensus revenue estimate of $60.15 million for the quarter ending September 2020 indicates a year-over-year increase of 30.1%. The market expects the company to report an EPS of $0.19 for the same quarter, which represents a significant improvement over the year-ago loss per share of $0.17. Also, HALO’s EPS is expected to grow 58% per annum in the next five years. How does HALO stack up for the POWR Ratings? A for Trade Grade A for Buy & Hold Grade A for Peer Grade A for Overall POWR Rating The stock is also ranked #7 out of 359 stocks in the Biotech industry. Eldorado Gold Corporation Ordinary Shares (EGO) Eldorado is a gold and base metals producer with mining, development and exploration operations in Turkey, Canada, Greece, Romania, and Brazil. The stock has gained more than 110% since its March lows. EGO has a Price/Book ratio of 0.53 and a forward P/E ratio of 11.23, both lower than their respective industry averages. EGO has an average analyst price target of $14.14 which represents a potential upside of 24.5%. In the second quarter, total revenue increased 47%, and adjusted net earnings attributable to shareholders were $43.8 million as compared to an adjusted net loss of $3.5 million in the prior-year period. Furthermore, the company witnessed a significant increase in gold production, free cash flow, and EBITDA. The company is maintaining its 2020 annual guidance of 520,000-550,000 ounces of gold at an all-in sustaining cost of $850-950 per ounce sold. Six out of twelve Wall Street analysts have a ‘Strong Buy’ rating on the stock. EGO has a rating of B in Trade Grade and Industry Rank according to our POWR Ratings system. BrightSphere Investment Group Inc. (BSIG) BSIG, which is a diversified global asset management company, has a Debt/Equity ratio of 0.09 and a Price/Sales ratio of 1.41, both lower than their respective industry averages. The average analyst price target of BSIG is $16.5 which represents a potential upside of 23.2%. BSIG has returned more than 260% since its March lows. Suren Rana, BSIG’s President, and CEO said, “After the quarter-end, we announced divestitures of our Barrow Hanley and Copper Rock affiliates. We expect these divestitures to enhance the company’s organic growth profile as our remaining business has historically produced positive net flows. Pro forma for the divestitures, Quant & Solutions and Alternatives business segments would have accounted for 88% of Adjusted EBITDA for Q2 2020. Additionally, the portion of our revenue under long-term contracts would have increased to 29% for Q2 2020. $335 million of expected net proceeds from the sale would provide us capital to reduce debt and repurchase shares which could result in double-digit accretion to 2021 ENI per share.” The company expects to reach targeted AUM growth in the Alternatives segment with an approximate two-quarters delay in timing. Also, Quant and Solutions demonstrated strong investment performance with 47%, 48%, and 88% of strategies by revenue beating their benchmarks over the prior 3, 5, and 10-year periods. BSIG has an impressive earnings surprise history with the company surpassing consensus EPS estimates in each of the trailing four quarters. The market expects the company to report an EPS of $0.41 for the quarter ending September 2020, which represents a marginal growth over the year-ago number. BSIG’s POWR Ratings reflect this promising outlook. It has an overall rating of “Buy” with an “A” for Trade Grade and Peer Grade and a “B” for Buy & Hold Grade and Industry Rank. Among the 45 stocks in the Asset Management industry, it’s ranked #12. Want More Great Investing Ideas? The Best of StockNews 2 Step Process to Sell @ Market Top in September 9 “BUY THE DIP” Growth Stocks for 2020 HALO shares . Year-to-date, HALO has gained 57.53%, versus a 7.64% rise in the benchmark S&P 500 index during the same period."}]}