{"article": [{"url": "https://stocknews.com/news/lmt-noc-hei-bah-ktos-5-top-rated-defense-stocks-to-buy-now/", "published": 1600344500.0, "headline": "5 Top-Rated Defense Stocks to Buy NOW!", "body": "The defense industry is one of the safer places to place your money as the market undulates. However, there are seemingly countless defense stocks to choose from, many of which are overvalued. If you are on the fence as to how to invest your money, you are not alone. Tech stocks are overpriced, money is gradually moving to value stocks, and plenty of uncertainty surrounding the economy. Defense stocks are a happy medium between growth and value. Let’s take a look at five defense stocks with bullish outlooks: Lockheed Martin (LMT), Northrop Grumman Corporation (NOC), Heico Corporation (HEI), Booz Allen Hamilton (BAH), and Kratos Defense & Security (KTOS). 7 Best ETFs for the NEXT Bull MarketLockheed Martin (LMT) LMT is one of the largest defense contractors in the world. Both domestic and international governments use LMT’s tech systems and military weapons. The POWR Ratings reveal LMT has “A” grades in its Trade Grade and Peer Grade components along with a “B” for Buy & Hold Grade. LMT is ranked 4th of 65 stocks in the Air/Defense Services industry. TipRanks’ average analyst price target for LMT is $435, which is 10% higher than its average price. Furthermore, LMT has a fairly low forward P/E ratio of 16.27, indicating it is likely undervalued at its current trading level. Though LMT has bounced back from its coronavirus selloff, it has not yet moved back to its pre-COVID price of $440. LMT is making progress toward making its much-anticipated hypersonic weapons that will move faster than sound. The company also recently won a $29 million deal to build MH-60R aircraft sensors. Northrop Grumman Corporation (NOC) Few defense stocks compare to NOC. This high-flyer has been a top-performer for decades. NOC develops, manufactures, and sells a wide array of systems, aircraft, information technology, and space technology to the United States Department of Defense and customers across the globe. With a forward P/E ratio of a surprisingly low 15.05, an average analyst price target of $406.88, and “A” and “B” grades in three of the four POWR Ratings components, NOC is attractive in all regards. If NOC reaches the $400+ price target, it will have increased in value by more than 20%. ASA recently selected NOC to build its Lunar Gateway, a space station that will orbit the moon. Furthermore, trilateral talks pertaining to nuclear weapons will not jeopardize NOC’s revenue from its intercontinental ballistic missiles. Heico Corporation (HEI) Aircraft components and engines will be necessary far into the future, setting the stage for the likes of HEI to reach new heights. HEI makes jet engines/components and the electronic equipment used for aviation purposes, in the defense industry, telecom industry, and space industry. In short, there is a good chance most military, business, regional and commercial aircraft have at least one HEI product. The POWR Ratings show HEI has a grade of “A” for Peer Grade and a “B” for Trade Grade. HEI is ranked 6th of 65 stocks in the Air/Defense Services industry. HEI is gradually moving back toward its pre-COVID trading price of $130. The stock neared $120 in June only for profit-taking to send it back down below $100. HEI earnings and sales recently beat analyst estimates. HEI should rise once air travel gradually returns to normal. Booz Allen Hamilton (BAH) Tech consulting will be big business in both the United States and abroad for the foreseeable future. BAH provides consulting pertaining to tech and defense strategy. BAH also provides management consulting in civil markets to boot. The POWR Ratings show BAH has “A” grades in three out of the four POWR component. BAH is ranked first of 65 stocks in the Air/Defense Services industry. TipRanks reports the average analyst price target for BAH is $88.75, which is 6% higher than its current price. Though BAH recently approached its 52-week high of $89, the stock subsequently sold down to the low $80s. Both Donald Trump and Joe Biden have stated they will not significantly cut the defense budget if elected, helping BAH hold its gains. Kratos Defense & Security (KTOS) The U.S. government, the communications industry, and enterprise clients pay for KTOS drones, security systems engineering/integration services, network deployment services, and technical services. The POWR Ratings show KTOS has “A” grades in each POWR component except for Industry Rank. KTOS is ranked second of 65 stocks in the Air/Defense Services industry. Analysts have set a price target of $24. If KTOS hits his level, it will have popped more than 11%. There is a chance Lockheed Martin or another top defense industry stalwart makes a play for KTOS at some point in the next year or two. Want More Great Investing Ideas? 7 Best ETFs for the NEXT Bull Market Stock Market Outlook: Before & After the Election Chart of the Day- See the Stocks Ready to Breakout LMT shares fell $3.58 (-0.91%) in premarket trading Thursday. Year-to-date, LMT has gained 2.54%, versus a 4.49% rise in the benchmark S&P 500 index during the same period."}]}