{"article": [{"url": "https://stocknews.com/news/spy-qqq-5-trading-myths-busted/", "published": 1597925300.0, "headline": "5 Trading Myths Busted", "body": "Clichés and aphorisms become such because they usually contain a kernel of truth, and typically come packaged in a short and pithy easy-to-remember statement. The world of trading and investing are littered with such utterances. Often, it contains a rhyme of some kind, such as “Sell in May and go away,” which rests on the belief that summer is a seasonally soft period where stocks underperform relative to other months. There is indeed some data to back this up. But, the difference between August, the historically worst month, and November/December which is the strongest is less than an average of 1%, over the past 50 years. If you look back over the past three years, gains between May and August have actually been 5.6% higher than November and December. This August, the major indices, such as “SPDR S&P 500 (SPY)” and “Nasdaq Power Shares (QQQ),” are up a whopping 5.3% and 6.5%, respectively, in the first two weeks alone! Here are five other ‘bon mots” regarding trading and investing, which have gained more credence beyond their actual kernel, as a general truism. 1.“The trend is your friend.” 9 \"BUY THE DIP\" Growth Stocks For 2020This is certainly true to an extent especially over the last decade as algorithmic trading has become an increasing force in a hedge fund or actively managed accounts. These funds are basically set up to trigger buys (or sales) as stocks gain (or lose) momentum especially as new highs (or lows) are made. There has also been a decided shift of even longer-term funds favoring growth (i.e. technology) overvalue (cyclical sectors such as energy), which can become a self-fulfilling process. That is until another saying comes into play; which is, “trend is your friend until the bend in end.” Meaning, when the momentum stops, the declines can be fast and furious. And there is another saying, “stocks take the escalator up but the elevator down.” For my part, it has taken me years to take a “go with the trend” approach and a willingness to get long or take bullish positions in stocks that have already run up or hit new highs. But, I still have a cautious nature, particularly given the nature of options, and I make sure to apply an options strategy that has a well-defined risk/reward profile. Learn more about my “3-P” approach and get a $19 trial for Options360 2. Let your winners run and cut the losers.” I always take my solid wins when they are in the money. I’m not training racehorses, I’m managing money. And again, the nature of options is the fact that they come with an expiration date. Occasionally, I might roll a position to gain more time. But, for the most part, I set up each trade with well-defined parameters for entry and exit targets. Once they are achieved, the position is closed. 3.”Don’t add to a losing trade.” Given most of my trades are relatively short-term, I rarely go out to expirations beyond three months, and as mentioned above, if a set plays out in two days or two weeks, I’m gone like the wind and close the position. So, while I usually don’t ‘average down,’ every now and then I take a position in which I have a broader opinion beyond the near-term technical or options-related set up and I will initiate the trade with a “half-size” in anticipation adding, as price moves against me. Or as I put it, presents an even more attractive price. For example, I and the Option360 service initiated a bearish position in “Moderna (MRNA)” two months ago using a put spread with an October expiration when the stock hit $80 and then added additional contracts two weeks later — when it spiked to $96. Shares are now below $70 and the position is showing a nice profit. My target to exit is $60 per share which would deliver a 450% profit. To be fair, this approach proved disastrous in “Tesla (TSLA)” in 2016 when I started a bearish position with a six-month horizon. This was when shares were just under $200. I added a month later when it hit $230. I threw in the white flag with a substantial loss when it crossed above $250. I’ve not traded TSLA since. 4. “Always be contrarian.” This also comes with corollary sayings such as, “don’t try to catch a falling knife,” or more appropriately, to the current environment, “don’t stand in front of a charging bull.” My nature is to buy dips and sell rips. But, unless there is discernible support or resistance, I steer clear trying to pick tops or bottoms. In sports, this is sometimes referred to as ‘hero ball.’ It’s wonderful when you nail it. But, the probabilities are not in your favor. Likewise, data shows hopping on winning trades, or once the aforementioned ‘trend’ is established, delivers superior and more consistent returns over time. 5.”Be impartial, don’t let your feelings/psychology affect your trading.” As someone that uses technical analysis and applies the math-based probabilities that come with option strategies, I mostly adhere to the notion that emotions should not come into play in your decision-making process. But, we’re all human and sometimes a trade doesn’t feel right even if none of your parameters have been violated. In this case, it might pay to listen to your gut, because it might mean the type of trade or strategy just doesn’t sit right for your style. Don’t fight your instinct or comfort level. If you’re constantly checking a position minute to minute, or losing sleep, it might be costing you dollars. But, it’s extracting mental capital and preventing you from focusing on better opportunities. Which brings us the most important point I can make. People that might be good traders, listen to others making rules and often quit. Find your trading personality. Could be 5 minutes, could be long gamma, could anything. In establishing each individual trade, I always use the options strategy that best aligns with your thesis. In a broader sense, find the style, whether it be steady income credit spreads or leveraged volatility trades that best suits your personality. Learn more about my 3-P approach and get a $19 trial to the Option360 service. Want More Great Investing Ideas? The Best of StockNews 2 Step Process to Sell @ Market Top in September 9 “BUY THE DIP” Growth Stocks for 2020 SPY shares were trading at $337.73 per share on Thursday morning, up $0.50 (+0.15%). Year-to-date, SPY has gained 6.01%, versus a % rise in the benchmark S&P 500 index during the same period."}]}