{"article": [{"url": "https://stocknews.com/news/pool-lil-bc-3-cool-stocks-set-to-benefit-from-a-hot-summer/", "published": 1597838900.0, "headline": "3 \"COOL\" Stocks Set to Benefit from a Hot Summer", "body": "The summer of 2020 has indeed put a damper on recreational plans, as most of us are stuck in our houses. However, for many families, this has given them the perfect opportunity to bond, and plan fun activities with their parents, siblings, and children. Swimming, boating, and picnics in the park have always been some of the most popular activities of summer. It can still be undertaken during such unprecedented times, provided you comply with the social distancing norms. As a result, the popularity of building a personal pool and purchasing or renting boats have risen among families so that they can enjoy themselves, while being safe. As the development of an effective vaccine is still underway, the demand for such recreational products and services is likely to increase until the fall sets in. As a result, companies such as Pool Corporation (POOL), Lennox International, Inc. (LII), and Brunswick Corporation (BC) should experience higher revenues and profits. 7 Best ETFs for the NEXT Bull MarketPool Corporation (POOL) POOL distributes swimming pool supplies, equipment, and related leisure products in North America, Europe, South America, and Australia. As the world’s largest distributor of swimming pool supplies, POOL’s net revenues rose 14% year-over-year to $1.28 billion in the second quarter ending June 2020. This increase can be attributed to a higher demand for residential pool usage due to mild weather and closed schools. POOL’s quarterly gross profit increased 13% to a record value of $373.50 million. Its operating income reached $205.90 million during the second quarter, increasing 19% year-over-year. Demand for construction and remodeling of swimming pools has helped POOL offset losses caused by stay at home and social distancing norms. As the lockdown restrictions were eased in late April and early May, POOL’s sales have skyrocketed. The consensus EPS estimate of $2.17 for the third quarter indicates an 11.2% improvement year-over-year. Moreover, POOL beat the street EPS estimates in each of the trailing four quarters, which is impressive. The consensus revenue estimate for the upcoming quarter is $996.43 million, indicating a 10.9% rise year-over-year. POOL hit its 52-week low of $160.35 in March due to an overall dip in the market. It gained more than 105% since then to hit its 52-week high of $331.12 in August. How does POOL stack up on our POWR Ratings? A for Trade Grade A for Buy & Hold Grade A for Peer Grade B for Industry Rank A for Overall POWR Rating You can’t ask for better. POOL is also ranked #2 out of 33 stocks in the Athletics and Recreation industry. Lennox International, Inc. (LII) LII provides develops, designs, and manufactures a range of climate control solutions such as air conditioners, ventilators, refrigerators and heaters. It operates through three main segments, namely Residential Heating and Cooling, Commercial Heating, and Cooling and Refrigeration. LII markets its products through direct sales, company owned parts and supplies stores, and distributors in the United States, Canada and Europe. LII recently raised an aggregate of $600 million by offering two classes of senior notes due in 2025 and 2027, respectively. Such funds will help LII reduce its indebtedness under the revolving credit facility, as well as finance business operations in the upcoming months. LII was adversely affected by the pandemic-led crisis, as evident from its second-quarter lows. However, it managed to stay afloat and generated profits during this time. The company generated adjusted segment profit of $153 million for the second quarter ending June 2020. LII cash and cash equivalents balance improved tremendously, reflecting the company’s strong liquidity position. Its net cash from operations increased 250% year-over-year to $105 million. Free cash flow of $87 million improved 335% from the prior-year quarter. Though LII’s performance in the second quarter of 2020 was lower compared to the same period last year, it managed to hold its position amid the recession. It surpassed the sell side analysts’ EPS estimate by 12.9% in this quarter. LII’s EPS is expected to grow at 1.35% per year over the next five years. LII gained more than more than 70% to hit its 52-week high $281.09 in August after hitting its 52-week low of $163.40 in March. It’s no surprise LII is rated a Strong Buy in our POWR Ratings system. It also has a grade of A in Trade Grade, Buy & Hold Grade, and Industry rank. Within the 59-stock Industrial- Machinery industry, LII is ranked #16. Brunswick Corporation (BC) BC is globally known for its recreational marine products. The company is involved in designing, manufacturing, and supplying marine engines, boats and various parts and accessories of marine electronics and control integration systems. BC’s Freedom Boat club gained popularity during the second quarter ending June 2020, as over 4,600 new members were added to the club, bringing the total to 33,000 memberships worldwide. The freedom fleet currently comprises over 3,000 boats. BC’s mid-season pipeline inventory hit a record low over 20 years this quarter, declining 34% from its year-ago value. With the recovery of demand, BC’s second quarter results surpassed the market expectations. In this regard, CEO David Foulkes said, “Our second quarter performance again demonstrated the power of our marine-focused portfolio despite the unprecedented disruption to the global economy resulting from the COVID-19 pandemic.” The cash and marketable securities balance of $553.90 million at the end of the second quarter increased 66.4% from year end 2019 level. The consensus EPS estimate of $1.33 for the third quarter ending September 2020 indicates a 20.9% improvement year-over-year. BC has an impressive earnings surprise history as well, as the company beat the street EPS estimates in each of the trailing four quarters. The consensus revenue estimate of $1.07 billion indicates a 7.8% improvement year-over-year. BC gained more than 190% to hit its 52-week high of $73.99 in July since hitting its 52-week low in March. BC is rated a Buy in our POWR Ratings system, with a grade of B in Trade Grade, Buy & Hold Grade, and Industry Rank. It is ranked #11 out of 33 in the Athletics and Recreation industry. Want More Great Investing Ideas? The Best of StockNews 2 Step Process to Sell @ Market Top in September 9 “BUY THE DIP” Growth Stocks for 2020 POOL shares were trading at $325.62 per share on Wednesday afternoon, down $2.43 (-0.74%). Year-to-date, POOL has gained 54.41%, versus a 6.25% rise in the benchmark S&P 500 index during the same period."}]}