{"article": [{"url": "https://stocknews.com/news/jnj-v-ma-nke-4-high-quality-stocks-to-buy-if-the-market-crashes/", "published": 1594728500.0, "headline": "4 HIGH QUALITY Stocks to Buy if the Market Crashes", "body": "The market crash earlier this year has made some investors wary of keeping their money in the market. Although the major market indices have rebounded, the rising trend of coronavirus cases and the economy’s uncertainty is rattling investors again. Many fear that there is another market crash around the corner. If stocks do crash again, it helps to be prepared. One idea is to invest in high-quality stocks. Companies that fit the quality mold typically have stable earnings and stronger balance sheets. These types of stocks have a history of performing better in adverse market conditions. Here are four high-quality stocks that can weather any economic storm: 9 \"BUY THE DIP\" Growth Stocks For 2020Johnson & Johnson (JNJ) JNJ is a household name due to its long history of providing consumers with various products, including medical devices and pharmaceutical drugs. The company has been in business for over 130 years and is one of the world’s largest companies, with a $377 billion market cap. JNJ has grown its dividend for more than 50 years in a row. The company, which has a net profit margin of 20.8%, is built to weather recessions and market crashes. One focus for this year is its development of Ad26.COV2-S, a potential COVID-19 vaccine. Last month, JNJ announced that a phase 1/2a clinical trial of the vaccine would begin this month. It is also looking to start Phase 3 trials ahead of schedule. If approved, the company plans to release over a billion doses through 2021. JNJ is a top-rated stock in our momentum-based POWR Ratings system. It currently has a Buy rating. Overall, it is the #16 ranked stock out of 213 Medical – Pharmaceutical stocks. Visa (V) V is one of the biggest companies in the U.S. Like JNJ; it is also a safer stock to own when the market goes down. The company was initially hurt by the lack of spending at the beginning of the lockdown but rebounded nicely as people began making purchases from home. The company has an ability to change with the economy. V is a leader in digital transactions. It helps consumers and businesses complete secure digital payment transactions. The company is also expanding its product options. Earlier this year, V paid more than $5 billion to acquire Plaid, a company whose platform enables its users to connect their bank accounts to apps. V rewards its stockholders with dividends and share buybacks. V posted earnings of $1.38 a share for the second quarter. Its revenue rose by 6.6% to $5.85 billion. V has a Buy rating in our POWR Ratings system. It has A or B grades in all four components that make up the POWR Ratings, including Trade Grade, Buy & Hold Grade, Peer Grade, and Industry Rank. It is also the #6 ranked stock in the Consumer Financial Services industry. Mastercard (MA) MA is another well-known name in the digital payments market. It is the second-largest payment processor globally (it operates in over 200 countries). It has an excellent track record of growth. Its three-year average revenue growth is 12.3%, while its three-year average EPS growth is 24.6%. Like Visa, MA is benefited as the corona pandemic has accelerated the trend towards digital payments as most people are making purchases from home. The idea of eliminating cash has also been thrown into the conversation due to the spread of germs and should benefit the company as well. MA has also gained from the rise of e-commerce, which was gaining steam before the pandemic struck. Most online purchases are made with credit and debit cards. MA collects fees on every transaction, so it is poised to benefit from this trend in the long run. The company recently made an acquisition of its own by purchasing financial data firm Finicity for $825 million. This should help to strengthen its banking capabilities. MA is rated a Buy by our POWR Ratings system. It has B grades across the board in the components that make up the POWR Ratings system. It is also the #7 ranked stock in the Consumer Financial Services industry. Nike (NKE) NKE needs no introduction. It is a global brand that has dominated footwear for decades, and I don’t see that changing anytime soon. We are amid a recession, and the stock’s current price of $96 is close to its 52-week high of $105.62. The company took a brief hit at the beginning of the lockdown but managed to outpace its competitors due to its digital storefront and its ability to sell directly to customers. NKE also released an app called the Nike Commerce App, which allows consumers to find customized product solutions while providing marketing data to the company. The company, which is a very high return on equity of 47.7%, has two growth drivers that I believe can help it weather this recession and another possible crash. First, NKE is making inroads into women’s apparel. The company only has a 10% market share, but that product line is growing faster than its men’s line. Another product line that should keep NKE business booming for the foreseeable future is its Jordan brand, which generated $3.6 billion for its fiscal year 2020. NKE is rated a Buy by our POWR Ratings system. It holds grades of A for Trade Grade and Buy & Hold Grade, and is ranked the #8 stock in the Athletics & Recreation industry. Want More Great Investing Ideas? 9 “BUY THE DIP” Growth Stocks for 2020 Top 5 WINNING Stock Chart Patterns 7 “Safe-Haven” Dividend Stocks for Turbulent Times JNJ shares were trading at $147.97 per share on Tuesday afternoon, up $2.76 (+1.90%). Year-to-date, JNJ has gained 2.79%, versus a 0.14% rise in the benchmark S&P 500 index during the same period."}]}