{"article": [{"url": "https://stocknews.com/news/sq-pypl-2-fintech-stocks-for-july/", "published": 1594123700.0, "headline": "2 Fintech Stocks for July", "body": "Fintech, short for “financial technology,” is any software or algorithm that is used to improve financial services. You use fintech when you transfer a friend $10 on Venmo to settle a bill for lunch, use your phone to pay for your groceries at the supermarket, and/or bank through a mobile app. Fintech is growing fast, and the industry is full of innovation and opportunities for investors and entrepreneurs. 7 \"SAFE HAVEN\" Dividend Stocks for Turbulent TimesBanks and financial institutions are already realizing that their survival is dependent on keeping up with these changes. For example, Goldman Sachs (GS) has 33,000 employees and more than a quarter of them are software engineers. Younger people are comfortable handling all their banking from their phones. Fintech stocks have been surging in 2020. The growth of many of these companies has not been hindered by the coronavirus recession. If anything, Covid-19 has led to more growth. Here are two fintech stocks that could surge in July: Square (SQ) SQ is an innovator in mobile payments. It started with making credit card readers for small businesses and has expanded into several adjacent fields including financial services, analytics, peer to peer payments, and payroll services. In the past year, SQ has seen a surge in users, as it became the easiest way for people to buy crypto through its Cash app. SQ’s Cash app is the fastest-growing part of the company with more than 30 million users. In the last quarter, the unit generated $528 million in revenue and $183 million of profit. The digital payments market is expected to grow from $4.7 trillion in 2020 to $6.7 trillion in 2023, and Square has an entrenched and growing position. The stock is up 225% since its March low. YTD, it’s 93% higher. The stock’s POWR Ratings reflect this promising outlook as it has a “Buy” rating with an “A” for Trade Grade and Peer Grade and a “B” for Buy & Hold Grade and Industry Rank. Among the Financial Services (Enterprise) group, it’s ranked #19 out of 134. Paypal (PYPL) In many ways, PYPL was the original innovator which created a lot of the financial plumbing which made online business possible. The company acts as an intermediary between buyers and sellers to make online transactions trusted and seamless. Through this, it helps sellers increase conversions and profits. From this role, PYPL has added more services for its customers including lending and analytics. PYPL also has exposure to the booming digital payments market through Venmo and Paypal users. In sum, the company has 365 million users between both products. It’s also introducing a feature that will allow users to buy cryptocurrencies which are leading to a boost in its stock price. PYPL is up 114% since its March low. YTD, the stock is up 64%. It has a valuation of $207 billion, but it’s growing sales by 12%. It also has impressive gross margins of 43%. As an integral part of the Internet economy, Paypal will thrive as it continues to be a larger part of the economy. So far, PYPL has been more focused on growth rather than profitability but it has several levers it can turn to increase profits which it’s starting to implement. EPS per share is expected to rise from $1.58 this year to $4.13 next year with an average annual increase of 15% over the next 5 years. Want More Great Investing Ideas? 9 “BUY THE DIP” Growth Stocks for 2020 Is the Bull S#*t Rally FINALLY Over? 7 “Safe-Haven” Dividend Stocks for Turbulent Times Top 3 Investing Strategies for 2020 SQ shares were trading at $126.03 per share on Tuesday morning, up $7.06 (+5.93%). Year-to-date, SQ has gained 101.45%, versus a -0.52% rise in the benchmark S&P 500 index during the same period."}]}