{"article": [{"url": "https://stocknews.com/news/nkla-fe-mrna-ino-intc-5-stocks-that-dropped-more-than-10-last-week/", "published": 1595851700.0, "headline": "5 Stocks That Dropped More Than 10% Last Week", "body": "Though the overall market has been surprisingly resilient in the face of the coronavirus pandemic, last week the S&P 500 was in the red. Though the losses were modest, the SPDR S&P 500 ETF Trust (SPY) was only down 0.28%, some of the stocks which had been high flyers in previous weeks and months experienced much more severe retracements. Nikola (NKLA), FirstEnergy (FE), Moderna (MRNA), Inovio Pharmaceuticals (INO), and Intel (INTC), saw losses of 10% or more in their share price last week. In this article, we investigate why each stock sold-off so investors can determine whether or not these moves are buying opportunities or the beginning of a continued downtrend. Nikola Corp. (NKLA) 9 \"BUY THE DIP\" Growth Stocks For 2020NKLA lost more than 35% last week to close at $29.92 on Friday. The reason for the plunge is this electric transportation systems provider announced the redemption of all of its outstanding warrants. NKLA’s plan to issue about 23 million new common stock over the next month with the help of this redemption made investors concerned about dilution. The warrants were issued under the Warrant Agreement by and between the VectoIQ Acquisition Corp. and Continental Stock Transfer & Trust Company on May 15, 2018. NKLA’s POWR Ratings are consistent with investors’ apprehensions. It has an overall rating of “Sell” and an “F” for Buy & Hold and Trade Grade with a “D” for Peer Grade. Within the Auto & Vehicle Manufacturers group, it’s ranked #22 out of 27. FirstEnergy Corp. (FE) This well-known electricity provider is being investigated on the grounds of security law violation and fraudulent statements the company made with regard to business practices, financial prospects and internal controls. There have been allegations that FE supported the campaign of Larry Householder, who in return accepted $60 million in bribes tied to a state funded bailout for FE’s nuclear and coal plants. Householder has been federally charged along with few other individuals involved and the ongoing investigation on FE has made the stock lose value. FE has declined by about 30% last week to close the week at $29.48. The decline can also be attributable to a weak earnings picture. FE’s consensus revenue estimate of $2.96 billion for the current quarter indicates a year-over-year decline. The company also has a negative earnings growth estimate of 2.4% per annum for the next five years. FE’s poor prospects are also apparent in its POWR Ratings which gives it a “Sell” rating. It also has an “D” for Trade Grade, Buy & Hold Grade, and Peer Grade. It ranks #53 out of 61 stocks in the Utilities-Domestic industry. Moderna, Inc. (MRNA) In the last week, MRNA lost more than 20% to close on Friday at $73.21. Moderna lost a patent battle against Arbutus Biopharma (ABUS) in the presence of the U.S. Patent Trial and Appeal Board. The contention was with regard to ‘‘069 patent’ which is based on lipid nanoparticles. This is a cause of concern for Moderna and could be a hurdle for MRNA’s Covid-19 candidate. MRNA’s effort to refute the patent could be sign that the company sees the patent as threat for its pipeline. This failed attempt of the patent challenge has created a cloud of doubt in investors’ minds. Furthermore, the positive developments of MRNA’s competitors with respect to vaccine candidates for Covid-19 is adding pressure on the company. However the possibility of a successful Covid-19 candidate reflects a promising outlook on MRNA’s POWR Ratings. It has an overall rating of “Buy” with an “A” for Trade Grade, Peer Grade and Industry Rank. Among the 338 stocks in the Biotech group, it’s ranked #16. Inovio Pharmaceuticals, Inc. (INO) INO is starting to be perceived as a risky stock by investors as the company is behind a number of its competitors in the race to find a Covid-19 vaccine. Also the trials for INO’s vaccine candidate have not been convincing enough considering the sample size. Furthermore, even though there were a few encouraging signs, INO did not mention the number of participants that generated neutralizing antibodies which concerned investors. As a result, INO lost about 20% last week at Friday’s trading session at $21.91. Moreover, INO’s earnings surprise history looks dismal, as the company could not surpass the consensus EPS estimates in three of the trailing four quarters. According to the POWR Ratings, INO is rated “Neutral.” It has an “A” for Industry Rank, ”B” for Peer Grade, ”C” for Trade Grade and “D” for Buy & Hold Grade. It’s ranked #94 out of 338 stocks in the Biotech group. Intel Corporation (INTC) In it’s earnings call last week, INTC announced that its 7 nanometer chips CPU product timing would be delayed by approximately six months. This delay, and the CEO’s comments with regard to outsourcing production, was a surprise for investors as the company has been relying on its in-house manufacturing for such a long time. This delay will give competitive rivals an added advantage. In addition, there have been investigations announced against INTC for violation of security laws. As a result, shares of INTC plunged by more than 15% last week. Moreover, INTC’s consensus revenue estimate of $18.17 billion for the current quarter indicates a year-over-year decline of 5.3%. INTC has a “Neutral” rating according to our POWR Ratings system. It has a “C” grade for Buy & Hold Grade and “D” for Peer Grade. It ranks #50 out of 86 stocks in the Semiconductor & Wireless Chip industry Want More Great Investing Ideas? 9 “BUY THE DIP” Growth Stocks for 2020 Newly REVISED 2020 Stock Market Outlook 7 “Safe-Haven” Dividend Stocks for Turbulent Times NKLA shares were trading at $33.76 per share on Monday afternoon, up $3.84 (+12.83%). Year-to-date, NKLA has gained 227.13%, versus a 1.28% rise in the benchmark S&P 500 index during the same period."}]}