{"article": [{"url": "https://stocknews.com/news/bill-crwd-2-tech-stocks-to-buy-on-dips/", "published": 1596110900.0, "headline": "2 Tech Stocks to Buy on Dips", "body": "It’s been an incredible four months for the Nasdaq Composite (QQQ), with the index gaining 58% in less than 90 trading days, one of its best performances in history. This relentless rally has bred many winners in the tech space, but it’s also pushed sentiment to lofty levels, with bullish sentiment now considerably higher than February of this year. Generally, this is not a great sign short-term, as high levels of bullish sentiment often leads to rallies running into selling pressure. Therefore, I would not be surprised if the 11,000 level on the Nasdaq Composite was a brick wall until the end of summer. However, if we do get a sharp correction, I expect it to be a buying opportunity, and this is why it’s worth building up one’s shopping lists now to prepare ahead of time. The names I prefer to own are those with the most disruptive products with the highest sales growth, and two names currently fit this bill. 7 \"SAFE HAVEN\" Dividend Stocks for Turbulent Times (Source: Company Website) The two names discussed in this article have little in common other than being software companies, but both sport outstanding sales growth, with revenue growth rates that place them among the top 50-growth stocks on the US Market. These two companies are Bill.com (BILL) and Crowdstrike (CRWD), and both hit new all-time highs in Q2 despite the overall market turbulence. Bill.com is an innovative company that makes it easier for businesses to focus on what’s important by automating much of their accounts payables and account receivables tasks. Meanwhile, Crowdstrike is a leader in Software Security, with the company seeing an additional tailwind from the work-from-home movement. Generally, the best-performing companies have gone public in the past ten years and have superior revenue growth, and Bill and Crowdstrike offer both. Let’s take a closer look at them below: (Source: YCharts.com, Author’s Chart, Company Website) As we can see in the above chart, Bill.com has seen incredible sales growth over the past two years, with Q4 2018 revenue coming in at $16.4 million, and fiscal Q3 2020 revenue up to $41.2 million. This translates to more than 150% growth in quarterly revenue in less than two years, and Q1 2021 estimates (December quarter) are expected to hit a new high at $43.1 million. Assuming the company beats its Q4 2020 forecasts, this will translate to 60% growth year-over-year, making Bill.com of the fastest-growing companies trading on the US Market currently. It’s worth noting that this growth is occurring at the same as some small businesses are struggling due to COVID-19, and that is Bill.com’s primary target market. However, many companies that have seen the day-to-day business become even more time-consuming and scattered due to COVID-19 are even more incentivized to use Bill as it simplifies processes that steal time from a company, and it can also save costs by replacing staff that would otherwise take care of these duties. With corporate prices starting at $69/month, it’s a no-brainer for most businesses. Bill.com estimates its total addressable market at $30 billion, and it’s barely even scratched the surface here. For investors that believe that paper cheque writing is going to see the same disruption we’ve seen as book stores, cable TV, and taxis have experienced, the company is the go-to way to play this movement. While the stock is a little expensive at $90.00 or above 35x sales, I believe any dips below $78.00 should provide low-risk buying opportunities. (Source: YCharts.com, Author’s Chart, Company Website) Moving over to Crowdstrike, the company is a growth powerhouse and is one of the top-10 growth companies in the US Market currently. While we don’t yet have positive annual earnings per share [EPS] on the table, FY-2020 annual EPS estimates are now projecting EPS of $0.22. This should open up Crowdstrike to new funds, which often wait for positive earnings before building sizeable positions. Crowdstrike reported Q1 2020 revenue of $178.1 million, up 85% year-over-year and over 17% sequentially, and Q2 2020 estimates are forecasting another new all-time high in revenues of $189.3 million. While the stock may seem quite expensive at 35x sales, I generally will be a little more lenient on valuation when it comes to companies consistently growing sales by either 75% or more year-over-year, or above 10% sequentially. Let’s take a look at the technical picture: (Source: TC2000.com) As we can see from the technical picture above, Crowdstrike just broke out of a massive stage 1 IPO base, and these bases typically offer a tremendous upside for investors when it comes to the best growth stocks. DocuSign’s (DOCU) stage 1 IPO base breakout showed up at $70.00, and the stock has more than doubled since, and Livongo’s (LVGO) stage 1 IPO base breakout showed up at $45.00, and it’s also more than doubled this year. While there’s no guarantee that Crowdstrike’s will play out similarly, I would expect buyers to show up to support the stock if we re-test this breakout level. Therefore, I believe any pullbacks below $98.00 will provide low-risk buying opportunities. (Source: TC2000.com) Given that the market remains a little extended, I don’t see any reason to rush in and pay top dollar for BILL or CRWD here. However, if we could see a pullback in either name of 10% to 12%, I believe this would provide a low-risk area to start a position in either stock or add exposure. Based on Bill.com and Crowdstrike’s market-leading growth rates, strong technical pictures, and disruptive technologies, they remain two names among my watchlist of top 50 growth stocks for 2020. Therefore, for investors looking for growth names that are still in their earlier to mid-innings, both BILL and CRWD are two opportunities worth keeping on one’s radar. Disclosure: I am long DOCU, LVGO, BILL, and short QQQ Disclaimer: Taylor Dart is not a Registered Investment Advisor or Financial Planner. This writing is for informational purposes only. It does not constitute an offer to sell, a solicitation to buy, or a recommendation regarding any securities transaction. The information contained in this writing should not be construed as financial or investment advice on any subject matter. Taylor Dart expressly disclaims all liability in respect to actions taken based on any or all of the information on this writing. Want More Great Investing Ideas? 9 “BUY THE DIP” Growth Stocks for 2020 How HIGH Can This Tech Bubble Fly? 7 “Safe-Haven” Dividend Stocks for Turbulent Times BILL shares were trading at $91.07 per share on Thursday afternoon, down $0.33 (-0.36%). Year-to-date, BILL has gained 139.34%, versus a 1.64% rise in the benchmark S&P 500 index during the same period."}]}