{"article": [{"url": "https://stocknews.com/news/apha-acb-cgc-is-aphria-the-1-cannabis-stock-for-the-rest-of/", "published": 1595938100.0, "headline": "Is Aphria the #1 Cannabis Stock for the Rest of 2020?", "body": "There has been a debate among investors about which Canadian producer will come out on top, as the cannabis sector tries to recover from a long bear market. My belief is that it comes down to financial health, profitability, and consistent execution from management. This provides the perfect combination for success during these difficult times. There’s reasons to believe that Aphria (APHA) could be the winner. The company has a very healthy cash position, and it has already provided multiple quarters of profitability, as most cannabis companies are fighting to cut costs and achieve just a single positive quarter. APHA shares jumped more than 12% on Monday after Cantor Fitzgerald’s Pablo Zuanic reiterated his Overweight rating for APHA and raised his price target from $7.84 to $8.21. He believes the company is gaining recreational market share in Canada and will likely beat consensus fourth-quarter sales estimates by roughly $2.24 million. He also predicts that APHA will record a 25% sales increase. APHA has multiple best-selling and award-winning brands sold across Canada that serve the medical and recreational cannabis markets. 7 \"SAFE HAVEN\" Dividend Stocks for Turbulent TimesZuanic stated, “We think LPs like APHA, with positive EBITDA, consistent domestic rec/med market share gains, and which are sensibly building businesses overseas will outperform.” Zuanic also stated that COVID-19 related operating disruptions during the quarter likely weighed on cannabis EBITDA margins. He estimates that cash burn will improve sequentially from CAD 91 million in the third quarter to just CAD 34 million in the fourth quarter. He is projecting net cash of CAD 128 million. Overall, APHA has what it takes to be the number one large-cap Canadian licensed producer in the marketplace as it consistently delivers results. APHA is narrowing the gap on Aurora Cannabis (ACB), and Canopy Growth (CGC) as both companies fight for just one profitable quarter, while APHA continues to outperform. Keep an eye out for APHA tomorrow, July 29th, as it releases its fourth-quarter earnings. Disclosure: The author is long APHA Want More Great Investing Ideas? 9 “BUY THE DIP” Growth Stocks for 2020 Newly REVISED 2020 Stock Market Outlook 7 “Safe-Haven” Dividend Stocks for Turbulent Times APHA shares . Year-to-date, APHA has gained 14.94%, versus a 0.81% rise in the benchmark S&P 500 index during the same period."}]}