{"article": [{"url": "https://stocknews.com/news/panw-zs-net-3-cybersecurity-stocks-on-the-verge-of-new-highs/", "published": 1596456500.0, "headline": "3 Cybersecurity Stocks on the VERGE of New Highs!", "body": "The increased dependence of corporates and individuals on virtual platforms increases vulnerability to cyber-attacks. Thus, companies’ spending on cybersecurity and cloud security is growing with these trends. Over the last 10 years, cybersecurity spending has increased by 150%. Over the last three years, cloud security spending has increased by 180%. As more data and apps migrate to the cloud, and the cloud becomes integral to all types of operations, keeping the digital infrastructure and networks secure is paramount. One security breach can paralyze a company or lose valuable trade secrets. Compromising customer information can cause serious damage in terms of trust, reputation, and liability. 7 Best ETFs for the NEXT Bull MarketThe demand for cybersecurity was on the rise even before the coronavirus and increase in remote work. However, the demand for security software and services is much higher now as cloud migration has accelerated. According to a Forbes article, enterprises are expected to spend $12.6 billion on cloud security by 2023, compared to $5.6 billion spent in 2018. Palo Alto Networks (PANW), Zscaler (ZS), and Cloudflare (NET) are three stocks that will benefit from the rise in demand. Palo Alto Networks, Inc. (PANW) PANW provides enterprise-level security platforms to corporations, government entities, and service providers. The company has recently unveiled a new cloud location in Singapore to provide local data residency and cater to the cybersecurity needs of the wider Asia-Pacific market. Earlier, the company announced the development of the world’s foremost Next-Generation Firewall, powered by machine learning. This could position PANW as a leader in the cybersecurity space. PANW has hit 52-week highs of $255.92 on the last trading day of July, and this momentum could keep going. PANW has also been performing pretty well in the “new normal,” and it has added more than 100% to its stock price since this year’s low of $125.5 hit on March 18th due to the virus-driven market crash. The consensus revenues estimate for the quarter ended July indicates a year-over-year increase of 14.3%. PANW’s earnings surprise history is impressive as well with the company beating consensus EPS estimates in each of the trailing four quarters. How does PANW stock up for the POWR Ratings? A for Trade Grade A for Buy & Hold Grade B for Peer Grade B for Industry Rank A for Overall POWR Rating You can’t ask for better. The stock is also ranked #1 out of 23 stocks in the Software – Security industry. Zscaler, Inc. (ZS) ZS offers a software-as-a-service cybersecurity platform to enterprise customers worldwide. The company’s offering is used in the consumer goods, transportation, airline, healthcare industries, and more. ZS has acquired Edgewise Networks which was a startup focused on enabling secure communications through cloud applications and datacenter networks. ZS’s Zscaler Private Access became the first zero-trust remote access service to gain a certification from the Federal Government for cloud-security. ZS hit its 52-week high last Friday and closed the session at $129.85. ZS’s recent price performance reflects its ability to capitalize on the recent trend to go digital. The stock has gained more than 250% since hitting a year-to-date low in mid-March. The consensus revenue estimate for ZS indicates an increase of 37.4% over the year-ago number. Moreover, the earnings surprise history for ZS looks pretty good, as the company beat consensus EPS estimates in each of the trailing four quarters. It’s no surprise that ZS is rated “Strong Buy” in our POWR Ratings system. It also has an “A” for Trade Grade, Buy & Hold Grade, and Peer Grade. In the 23-stock Software – Security industry, it is ranked #3. Cloudflare, Inc. (NET) NET offers cloud-based services to make websites more secure. It also offers a variety of software products in video streaming, advanced security, insights, and other spaces. NET has recently announced the launch of its serverless cloud-computing platform called Workers Unbound which aims to be cheaper and faster than competitors such as Amazon Web Services, Google Cloud, and Microsoft Azure. This development could position NET as a leader in this space. NET has also opened new offices in Japan to cater to its businesses in the Asia-Pacific region. NET is currently trading at $41.62, near its 52-week high of $42.60. The stock has recovered more than 150% since hitting its year-to-date low in mid-March due to the overall dip in the market. The company’s strong recovery could be part of a growth momentum that could last well for the rest of 2020. NET has an impressive earnings surprise history with the company surpassing or meeting consensus EPS estimates in the last three quarters. NET’s strong fundamentals are reflected in its POWR Ratings, it has a “Strong Buy” rating with an “A” in Trade Grade and Buy & Hold Grade. Within the Software – Security group, it’s ranked #4 out of 23 stocks. Want More Great Investing Ideas? 9 “BUY THE DIP” Growth Stocks for 2020 How HIGH Can This Tech Bubble Fly? 7 “Safe-Haven” Dividend Stocks for Turbulent Times PANW shares were unchanged in after-hours trading Monday. Year-to-date, PANW has gained 10.02%, versus a 3.21% rise in the benchmark S&P 500 index during the same period."}]}