{"article": [{"url": "https://stocknews.com/news/asan-work-team-smar-pltr-should-you-buy-the-asana-direct-listing/", "published": 1601467700.0, "headline": "Should You Buy the Asana Direct Listing?", "body": "Along with Palantir (PLTR), Asana (ASAN) is going public with a direct listing today. The company is planning to open trading at a price of $28 per share, which would give it a valuation of about $4.3 billion. Asana makes communication and collaborative tools for companies of all sizes. Its goal is to help companies become more organized, efficient, and streamline workflow and communication. Like many cloud-based software tools, the demand for its products has increased with the increase in remote work. Company Information 7 Best ETFs for the NEXT Bull MarketSince its founding in 2008, ASAN has become a leading player in the enterprise collaboration market. Currently, the total size of this market is estimated to be $35 billion this year but will grow to $48 billion by 2024. Asana has 82,000 customers, 2.1 million paid users, and 3.5 million free users. Like Slack, the company has been successful in converting free users into paid users over time as companies become increasingly reliant on the platform. Some of its major customers include AT&T (T), Google (GOOG), NASA, and AutoDesk (ADSK). About 40% of its revenue comes from outside of the US and the company is investing in international expansion. It’s also been successful in growing the number of customers paying the company more than $50,000 per year. Based on Asana’s S-1 filing, nearly 70% of the Fortune 500 is using the free or paid version of Asana. Its major competitors are Monday.com, Trello, Atlassian (TEAM), and Smarthseet (SMAR). Project management and collaboration is a fast-growing market. Once a project management tool is adopted by a company, there’s a good chance customers stay on the platform since their data and work is already on the platform. Further, there’s a switching cost that goes up with more time. Asana’s Story Asana was founded by Facebook (FB) co-founder Dustin Moskovitz, and he remains the CEO. It’s a testament to his belief in this idea that he’s devoted his efforts for such a long time given that his FB proceeds give him almost limitless opportunities. Asana is modeled after Facebook’s own internal tools which it developed to help its workers become more efficient and effective. Asana’s software is applicable in any industry in any part of a company. This image from its website shows the various use cases for its software: (source: Asana) The company had noticed that workers were spending too much time “working on work” rather than working on the most critical items. According to Asana, the average knowledge worker spends 60% of their time “working on work”. In its S-1 filing, ASAN said, “Instead of spending time on work that generated results, they were spending time in status meetings and long email threads trying to figure out who was responsible for what.” In response, Asana has developed workplace communication and planning software to coordinate workflow. The goal is to link strategy, execution, time spent, and address the question of who is doing what when. The company sees its products like the next-generation version of emails and spreadsheets. Asana’s Financials In Asana’s last fundraising round, the company was valued at $1.5 billion and raised money from luminaries like Peter Thiel’s Founders Fund and Benchmark Capital. Looking at its list of investors from past fundraising rounds, there are many well-known names like Andreesen Horowitz, Sam Altman, Mark Zuckerberg, Eric Reis, and Sean Parker. In total, the company has raised $413 million. This is a validation of its idea and leadership team. It’s also a competitive advantage in selling their software. Asana’s growth has been slow and steady. When it started, there was no established market for this type of software. Asana has grown with the market and will outperform in the long run if it can convert free users into paid users and increase use and dependency on the product. Of course, it can only do this if it can deliver on its core promise to help users save time and accomplish their goals more effectively. But, it’s gaining traction. It’s currently generating $200 million in annual, recurring revenue which is growing at a 60% year over year rate. This is quite impressive given that Asana’s revenue base is quite sticky. Bull Case By traditional valuation metrics, Asana’s stock is certainly overvalued given its expected price to sales ratio of 15. However relative to peers, it looks attractive. The stock is growing revenues at 85% and has 86% gross margins. Stocks with these characteristics have outperformed during the past few years. Additionally, the stock is the leader in an expanding market – workforce collaboration. Since it helps companies become more efficient and productive, companies will be willing to spend on it. Once Asana becomes entrenched in an organization, it will have pricing power and a platform to sell new features or products. For obvious reasons, the coronavirus has caused a big jump in adoption. Bear Case The bears would argue that there’s no guarantee of success that Asana beats out its competitors. High multiples mean high expectations. If a company fails to meet lofty expectations, they can see deep pullbacks due to multiple contraction and a lower earnings outlook. Recent direct listings like Slack (WORK) and Spotify (SPOT) saw losses in their first, few months of trading. In contrast, IPOs tend to be better received as the process limits supply and the underwriters generate demand. Verdict Overall, Asana is a very attractive stock due to its growth and potential to become an integral tool for many companies that results in net positive outcomes. It has about 1% penetration in a $32 billion market that is growing 20% annually. At its current valuation, buying the stock is a bet that the company can continue effectively adding users and monetizing them. While the stock’s story is attractive and has the ingredients of an outperformer during a bull market, the recent results of direct listings mean that investors can probably get a better entry price if they remain patient and wait for a dip in the share price. Want More Great Investing Ideas? 7 “Safe-Haven” Dividend Stocks for Turbulent Times When Does the Next Bull Run Start? Chart of the Day- See the Stocks Ready to Breakout"}]}