{"article": [{"url": "https://stocknews.com/news/crm-now-wday-okta-4-saas-companies-that-should-continue-to-outperform-in-2020/", "published": 1594296500.0, "headline": "4 SaaS Companies That Should Continue to Outperform in 2020", "body": "The BVP Nasdaq Emerging Cloud Index, which tracks the movement of public companies involved in the cloud software space, has witnessed a year-to-date (YTD) growth of 61%. And the iShares Expanded Tech-Software Sector ETF (IGV) is up 28% YTD. This is quite impressive when you compare it to the YTD performance of the S&P 500, which has lost more than 2%. The reason for this massive growth in the software sector is that the marketplace has seen increased corporate spending on cloud computing, digital transformation, big data analytics and artificial intelligence. Also, because the margins for software stocks are getting a boost from cost containment efforts due to the coronavirus. 7 \"SAFE HAVEN\" Dividend Stocks for Turbulent TimesWithin the software space, SaaS (software-as-a-service) stocks standout because they have the highest percentage of subscription-based recurring revenue. And as companies are forced to shift from on-premise software to applications in the internet cloud, SaaS stock will benefit. Here are four SaaS stocks that should continue to outperform in 2020: Salesforce.com Inc. (CRM) Salesforce is an enterprise cloud services provider that works in six core areas — marketing automations, sales automation, community management, customer support, analytics, and a cloud platform for building custom applications. CRM beat the consensus EPS estimate in each of the past four quarters. The company has recently introduced Salesforce Anywhere which could significantly improve the features of its productivity suite. CRM has delivered a YTD price return of 23.1% along with positive price returns for the one-month, six-month, one-year, and three-year time periods. In 2019, CRM gained 18.7%. How does CRM stack up for the POWR Ratings? A for Trade Grade A for Buy & Hold Grade A for Industry Rank B for Peer Grade A for overall POWR Rating ServiceNow Inc. (NOW) ServiceNow is a global provider of cloud-based services for enterprises. NOW focuses on automation of processes involved in HR, IT, marketing, finance, and legal. Recently, the company has partnered with Zoom (ZM) and will provide customer service management for Zoom’s users. This move highlights the value of the company’s Now platform and could spearhead further growth for the company. NOW has experienced a YTD price return of 50.6%. It has also been growing consistently with positive price returns in the one-month, six-month, one-year, three-year, and five-year time periods. NOW has an overall POWR Rating of A along with A for all four of the POWR components. This indicates a Strong Buy for the fast-growing company. Workday Inc. (WDAY) WorkDay is a cloud software provider that focuses on human resources and finance. WDAY works with the world’s largest organizations to deliver analytics applications as well. WDAY recently launched operations in Mexico, and it was named as a Leader in Gartner Magic Quadrant for the fourth year in a row. WDAY has witnessed a YTD price return of 20.5%. It has also grown consistently with positive price returns in the one-month, six-month, and three-year time periods. This company has been accorded an overall POWR Rating of B which indicates a Buy. It has an A for Trade and Industry Rank and a B for Buy & Hold and Peer Grade. Okta Inc. (OKTA) Okta provides a range of tools and services for IT professionals and developers. It allows for an integrated system through which users can connect along with multi-factor authentication, universal directory products, lifecycle management, and flexible administration. Fortune Business Insights estimates that the size of the global identity and access management market which was USD 9.5 billion will expand to USD 24.8 by the end of 2026, which would be a CAGR of 13.2% for the forecast year. This identifies a strong potential for growth for OKTA. The company has also been seeing increasing revenue at a CAGR of 44% in the last three years. OKTA has delivered a YTD price return of 90.5% along with positive price returns for the one-month, six-month, one-year, and three-year time periods. The company has an overall POWR Rating of A along with As for all four of the POWR components which are Trade, Buy & Hold, Peer Grade, and Industry Rank. Want More Great Investing Ideas? 9 “BUY THE DIP” Growth Stocks for 2020 Is the Bull S#*t Rally FINALLY Over? 7 “Safe-Haven” Dividend Stocks for Turbulent Times Top 3 Investing Strategies for 2020 CRM shares fell $0.24 (-0.12%) in after-hours trading Thursday. Year-to-date, CRM has gained 23.43%, versus a -1.32% rise in the benchmark S&P 500 index during the same period."}]}