{"article": [{"url": "https://stocknews.com/news/cvna-kmx-an-carg-4-used-vehicle-stocks-that-will-thrive-during-a-recession/", "published": 1597061300.0, "headline": "4 Used-Vehicle Stocks That Will Thrive During a Recession", "body": "The used vehicles market is gaining traction with each passing day as the country slowly exits lockdown and people adjust to life under the new normal. Owing to the quick spread of the disease which led to several social distancing guidelines, people who previously used public transportation for their commute are apprehensive to use it now due to potential exposure to the deadly virus. As an appealing alternative, people are turning toward the used car market as a safe way to meet their transportation needs. Companies operating in this sector are also fueling the demand for used vehicles by alluring potential customers on online platforms with several affordable financing options. A survey conducted by CarGurus, Inc. (CARG), an online marketplace for new and used cars, supports this fact. The survey found that 61% of people shopping for cars were willing to purchase vehicles online, compared to 32% in the pre-pandemic period. Among others, Carvana Co. (CVNA) has invested over $2 billion since 2013 to create a strong online presence, which is paying off now. Also, CarMax, Inc. (KMX) spent $300 million to develop a digital networking platform to gain from this rising demand. 7 \"SAFE HAVEN\" Dividend Stocks for Turbulent TimesCompanies such as Carvana, CarMax, Autonation, Inc. (AN) and CarGurus, Inc. (CARG) are the biggest names in the used vehicle industry who stand to gain significantly from the current market. In fact, their stocks have gained more than 100% since the March lows, representing investor faith in these stocks. Carvana Co. (CVNA) CVNA is an e-commerce platform facilitating the purchase and sale of second-hand cars in the United States. It allows customers to research and inspect cars with its 360-degree vehicle imaging technology before purchasing it. CVNA also provides financing and warranty coverage services to its users. CVNA’s performance in the second quarter ending June 2020 was impressive, as evident from its 13% year-over-year growth in revenue to $1.11 billion. It sold 55,098 retail units in this quarter, indicating a 25% increase year-over-year. Total gross profit increased by 9% from the year-ago number to $150 million. CVNA opened 100 new markets in the second quarter, and is currently servicing 73.2% of the United States population through 261 markets. It raised $1.06 billion in net proceeds through two equity offerings during this period. The company launched a direct purchase platform called CarvanaACCESS for wholesale buyers. The consensus revenue estimate of $1.45 billion for the third quarter indicates a 32.2% improvement year-over-year. CVNA’s EPS is expected to grow at 100% annually over the next five years. CVNA gained more than 900% to hit its 52-week high of $222.45 since hitting its 52-week low of $22.16 on March 19th. How does CVNA stack up for the POWR Ratings? A for Trade Grade B for Buy & Hold Grade B for Peer Grade A for Industry Rank You can’t ask for better. It is also ranked #7 out of 54 stocks in the Internet industry. CarMax, Inc. (KMX) KMX is the largest retail operator of used vehicles in the United States. It has two segments – CarMax Sales Operations and CarMax Auto Finance. Besides the sale of used cars and other vehicles, KMX also provides repair services and alternative financing options to potential buyers. On April 14th, KMX launched contactless curbside pickup service, to facilitate purchase and sale of used vehicles between two parties while maintaining the social distancing norms. KMX also extended the duration of its warranty on newly purchased cars. KMX reported a 1030.5% quarter-over-quarter increase in its cash and cash equivalents balance in the quarter end May 31st results. It had an unused revolving credit balance of $1.08 billion, indicating an 8.2% rise quarter-over-quarter. KMX’s EPS is expected to grow at 12.4% annually over the next five years, in tune with the rising popularity of used cars. KMX gained more than 170% since hitting its 52-week low of $37.59 on March 18th. KMX is rated Strong Buy in our POWR Ratings system, consistent with its growth potential and sound business model. It has an A in Trade Grade and Buy & Hold Grade, and a B in Peer Grade and Industry Rank. In the 16-stocked Auto Dealers and Rentals industry, KMX is ranked #2. AutoNation, Inc. (AN) AN is an automotive retailer supplying new and used vehicles across the United States. It also sells parts and provides maintenance services to its customers. It sells related insurance products as well as facilitating financing through third party sources. AN’s adjusted net income from ongoing purchases increased 14% year-over-year to $123.90 million in the second quarter ending June 2020. Its same-store total variable vehicle gross profit per vehicle of $585 million indicates a 16% rise from its year-ago number. Income from the domestic segment increased 25% year-over-year to $82 million in the second quarter, while income from the import segment increased 8% year-over-year to $88 million. The consensus EPS estimate of $1.53 for the third quarter indicates a 39% increase year-over-year. Moreover, AN surpassed the street estimates in each of the trailing four quarters, which is impressive. AN hit its 52-week low of $20.59 on March 18th amid the pandemic driven market crash, and gained more than 155% since then. It’s no surprise that AN is rated a Strong Buy in our POWR Ratings system. It has an “A” for Trade Grade and Buy & Hold Grade, and a B for Peer Grade and Industry Rank. It is also ranked #5 out of 16 stocks in the Auto Dealers and Rentals industry. CarGurus, Inc. (CARG) CARG is an online automotive market where consumers can look up new and used car listings from sellers and dealers. In addition to the United States, CARG also has operations across Canada, United Kingdom, Germany, Italy, and Spain. CARG’s GAAP operating income was $8.70 million for the second quarter ending June 2020, indicating a 148.5% increase from its year ago value. Its non-GAAP cash flow from operations increased 55% year-over-year to $24.80 million. Its non-GAAP free cash flow increased 80.6% year-over-year to $22.40 million during the same time. CARG estimates its third quarter revenues to be in the range of $132-$135 million. Its expected non-GAAP operating income range is $29 to $35 million. CARG has an impressive earnings surprise history, as it surpassed the consensus estimates in three of trailing four quarters. Its EPS is expected to grow 40% annually over the next five years. CARG gained more than 110% since hitting its 52-week low of $14.29 on March 18th. CARG a grade of A for Industry Rank and a grade of B for Trade Grade. In the 54-stocked Internet industry, CARG is ranked #22. Want More Great Investing Ideas? 3 Possible Directions for the Stock Market from Here How to Trade THIS Stock Bubble? 9 “BUY THE DIP” Growth Stocks for 2020 CVNA shares were unchanged in after-hours trading Monday. Year-to-date, CVNA has gained 106.54%, versus a 5.27% rise in the benchmark S&P 500 index during the same period."}]}