{"article": [{"url": "https://stocknews.com/news/ame-chart-of-the-day-ametek-ame/", "published": 1593605300.0, "headline": "Chart of the Day: Ametek (AME)", "body": "Ametek Inc. (AME) engages in the manufacture of electronic instruments and electromechanical devices. Top research laboratories are using their solutions to assist in the development of vaccines and antibodies, so the company is critical to vaccine corona vaccine efforts. AME has been deemed an essential or life-sustaining business. The company also can withstand an economic downturn with $1.8 billion in liquidity and $1.25 billion cash on hand. AMA owns a significant market share in its industry as it can produce and deliver high-quality products at competitive prices. As of the end of 2019, its revenues grew at an annual growth rate 5.1%. EPS grew at a rate of 11.6%. AME delivered sound first-quarter results, which was highlighted by excellent operating performance. The firm’s strategy emphasizes growth through acquisitions and new product development. The company is well-positioned to improve China’s growth by the end of the year as its products support in-demand thermal nuclear power plants and environmental cleanup. 7 \"SAFE HAVEN\" Dividend Stocks for Turbulent TimesManagement has an excellent track record of executing its strategy of acquisition-driven growth, sound operational execution, and free cash flow generation. AME should continue to benefit from its acquisition strategy and growth investments. The Tale of the Tape Take a look at the 1-year chart of Ametek below with the added notations: Chart of AME provided by TradingView AME has formed an important level of support at the $85 mark (blue) over the past month or two. The level was resistance back in April and May, and then support a couple of times in June already. T In the past month, shares of AME have bounced off $85 twice, thus creating a level of support. A level of support is created when a downtrend in an asset, in this case a stock, stops or pauses more than one time at a particular price. A support level often signifies that there is buying interest at that price. If the $85 support level for AME is broken, traders could look to short the stock, with the expectation that we will see continued momentum to the downside. Before making any trading decision, decide which side of the trade you believe gives you the highest probability of success. Do you prefer the short side of the market, long side, or want to be in the market? If you haven’t thought about it, review the overall indices themselves. For example, take a look at the S&P 500. Is it trending higher or lower? Has it recently broken through a key resistance or support level? Making these decisions ahead of time will help you decide which side of the trade you believe gives you the best opportunities. No matter your strategy or when you decide to enter, always remember to use protective stops, and you’ll be around for the next trade. Capital preservation is always key! Good luck! Christian Tharp, CMT @cmtstockcoach Stock Trading & Investing for Everyone Want More Great Investing Ideas? 9 “BUY THE DIP” Growth Stocks for 2020 Is the Bull S#*t Rally FINALLY Over? 7 “Safe-Haven” Dividend Stocks for Turbulent Times Top 3 Investing Strategies for 2020 AME shares were trading at $88.83 per share on Wednesday morning, down $0.54 (-0.60%). Year-to-date, AME has declined -10.56%, versus a -2.61% rise in the benchmark S&P 500 index during the same period."}]}