{"article": [{"url": "https://stocknews.com/news/msft-sne-ttwo-3-video-game-stocks-that-belong-in-your-portfolio/", "published": 1593605300.0, "headline": "3 Video Game Stocks That Belong in Your Portfolio", "body": "It might be a while until people feel entirely comfortable in social settings as the coronavirus has moved its way down to the south and back to the west. This has led to more restaurant, store, and school closings. States still aren’t sure if secondary or post-secondary schools will be in session by the fall. This points towards more time spent at home. Children throughout the United States and beyond will be playing video games, watching TV, and surfing the internet. That’s why this could be a perfect time to consider long-term investments in the following video game companies: Microsoft (MSFT), Sony (SNE), and Take-Two Interactive Software (TTWO). Microsoft (MSFT) 9 \"BUY THE DIP\" Growth Stocks For 2020When investors think of Microsoft, most people immediately think of the software company’s Office Suite products and Windows operating systems. However, MSFT does much more than merely provide computing tools for office workers. This tech giant also has a strong video game business. The new XBOX video game console, dubbed Series X, will likely be available this November. The console will go head-to-head with Sony’s (SNE) PlayStation 5. Though Sony and Nintendo (OTC:NTDOY) currently have the best-selling gaming consoles, MSFT’s Series X console has superior technical specs compared to both the Nintendo Switch and the PlayStation 5. Microsoft also has an assortment of successful first-party games ranging from the Age of Empires to Microsoft Flight Simulator, to Gears and Forza. As long as MSFT’s outside developers take full advantage of the Series X’s impressive hardware capabilities, the company’s video game business could help propel the stock to new heights by the end of the year, if not sooner. MSFT stock has returned 207.51% over the past three years. POWR Ratings has MSFT ranked first out of 82 stocks in the Software – Application industry with A grades in every single POWR Component that makes up the overall POWR Ratings. Sony (SNE) The video game wars have focused on dethroning SNE’s PlayStation console. Though Nintendo’s Switch recently emerged as the most coveted console, everything will change once the PlayStation 5 is released this November. Investors looking for a video game stalwart that provides players with the opportunity to game in virtual reality should consider this reasonably priced stock. Though PlayStation VR did not sell that well with PlayStation 4, it has an excellent chance to do well with the PlayStation 5. The gaming public is craving an immersive escape now more than ever. The only question is how many PlayStation 5 games will support virtual reality game-play. After taking a look at the early footage of PlayStation 5 games, you may question whether you are watching the real world or a video game. Sony’s brass deserves credit for creating hardware that generates nearly realistic graphics. POWR Ratings have SNE ranked above every other stock in the Entertainment – Media Producers category. The company has a POWR Grade of A in every component except its Industry Grade. The stock has returned 82.90% price over the past three years. SNE has a reasonably low forward P/E ratio of 22 for its industry, so it’s easy to understand why so many investors are bullish on this entertainment company. Take-Two Interactive Software (TTWO) When it comes to video game creators, few compare to TTWO. If you look at TTWO’s titles, you will find Grand Theft Auto, the NBA 2K series, Borderlands, and Civilization. Each of these are incredibly popular. Grand Theft Auto is especially lucrative, generating cash at the point of initial purchase and through in-game purchases. TTWO is likely to earn more than $3 billion in fiscal year 2020. Around half the company’s revenue stems from the United States market. One thing that needs to be considered though, is that fans might not upgrade to new editions if they perceive only moderate improvements in the games. TTWO has a Buy rating in the POWR Ratings and is ranked #4 out of 13 Video Games & Toys stocks. The analysts’ average price target for TTWO is $152.82, indicating a possible 10% upside. Want More Great Investing Ideas? 9 “BUY THE DIP” Growth Stocks for 2020 Is the Bull S#*t Rally FINALLY Over? 7 “Safe-Haven” Dividend Stocks for Turbulent Times Top 3 Investing Strategies for 2020 MSFT shares fell $0.20 (-0.10%) in after-hours trading Wednesday. Year-to-date, MSFT has gained 30.52%, versus a -2.53% rise in the benchmark S&P 500 index during the same period."}]}