{"article": [{"url": "https://stocknews.com/news/nvr-masi-neo-wk-4-upgraded-stocks-to-ride-the-q4-rally/", "published": 1602245300.0, "headline": "4 UPGRADED Stocks to Ride the Q4 Rally", "body": "The market is in an interesting place. We have very strong price action with the market melting up and the Russell 2000 (IWM) leading. This is despite expectations that the market would see some selling due to the upcoming election, failure to reach an agreement on a stimulus package, and rising coronavirus case counts. This type of market action implies that the bad news has already been discounted. Under these conditions, traders and investors should look to buy fundamentally sound stocks. Our POWR Ratings can help you identify these stocks. Let’s take a look at four of the more intriguing POWR Rating upgrades: NVR (NVR), Masimo (MASI), NeoGenomics (NEO), and Workiva (WK). NVR (NVR) Building and selling homes, condos, and townhouses are one of the better ways to make money in 2020. This is NVR’s business. With homes selling like gangbusters, NVR is raking in the cash. The company’s homes are mainly built on a pre-sold basis. NVR also has a mortgage banking service and title service business. 9 \"BUY THE DIP\" Growth Stocks For 2020Chances are you have seen NVR operating under the moniker of Ryan Homes, Heartland Homes, and/or NVHomes. The POWR Ratings show NVR has A grades in the Buy & Hold and Trade grade components. The stock is ranked 12th of 21 in the Homebuilders space. Home construction in the United States was up more than 22% this summer. Building permit applications are up nearly 20% from June. This is the perfect time to own homebuilder stocks such as NVR. Masimo (MASI) Health monitoring systems have quickly advanced, proving capable of accurately measuring everything from pulse rate to blood oxygen saturation levels. MASI makes such systems. The company’s systems also monitor blood constituency including total hemoglobin, breathing, and brain activity. MASI has A grades in each POWR Rating component. The stock is ranked in the top 25 of 140 in the Medical – Devices & Equipment category. Of the seven analysts who have studied MASI, five recommend buying it while two recommend holding and none advises selling. MASI’s quarterly revenue is up more than 30% on a year-over-year basis. MASI’s system shipments are also up 174% on a year-over-year basis. The strong demand combined with the aging baby boomer segment of the population should help MASI return to its 52-week high of $258 by year’s end. NeoGenomics (NEO) Genetics diagnostic testing specialists waging war against cancer are at the forefront of medical technology. Such testing is the fastest growing lab industry segment. NEO testing services range from molecular genetic testing to cytogenetics, flow cytometry, anatomic pathology, and fluorescence in-situ hybridization. NEO helps hospital personnel, urologists, pathologists, oncologists, and other medical professionals do their jobs that much better. NEO is a POWR Ratings beast with A grades in the Buy & Hold and Trade components along with B grades in the remaining components. Furthermore, NEO is ranked in the top 20 of 58 publicly traded companies in the Medical – Diagnostics/Research category. TipRanks shows the average analyst price target for NEO is $42.57, indicating it has a 10% upside. Even if NEO’s business falters amidst the recession, the company’s balance sheet is in tip-top shape with $331 million in cash. Ride NEO’s profitable growth wave to new heights and you will be more than happy with your investment. Workiva (WK) Cloud platforms that help businesses gather, analyze, and manage important business data in a near-instantaneous manner are becoming that much more important as business shifts to the web. WK provides such solutions. WK clients include those in a wide array of industries ranging from telecom to transportation, consumer goods, real estate, media, financial services, energy, healthcare, and beyond. WK has A grades in two of the four POWR Components (Buy & Hold and Trade) along with a top 20 rank in the Software – Business space. WK’s price return year-to-date is 39%. WK had a 2018 price return of 67%. The stock’s three-year price return is 164%. The icing on the cake is the analysts’ average price target of $65.25, meaning WK is poised to pop another 10%. Want More Great Investing Ideas? 7 Best ETFs for the NEXT Bull Market What is the Cure for Stock Market Volatility? Chart of the Day- See Christian Tharp’s Stocks Ready to Breakout NVR shares were trading at $4,366.20 per share on Friday afternoon, up $17.80 (+0.41%). Year-to-date, NVR has gained 14.65%, versus a 9.38% rise in the benchmark S&P 500 index during the same period."}]}