{"article": [{"url": "https://stocknews.com/news/ipgp-brks-entg-3-mid-cap-semiconductor-stocks-near-52-week-highs/", "published": 1595246900.0, "headline": "3 Mid-Cap Semiconductor Stocks Near 52-Week Highs", "body": "Semiconductors are used in electronic circuits and form the backbone of most electronic devices. Semiconductors are crystals made up of materials such as silicon. Because they have a unique structure that allows conductivity to be controlled through stimulation such as electric currents, they can amplify and produce light from electricity. This is useful in the manufacturing of electronic devices. During the beginning of the coronavirus pandemic, semiconductors stocks plummeted. The iShares PHLX Semiconductor ETF (SOXX) fell 34% from February 19th to March 20th. The market feared the pandemic would destroy demand in semiconductors, but it turns out that the demand in the cloud market from work from home activities, increased demand in semiconductors. That demand should continue as long as the pandemic grips the globe. There are many different sizes of semiconductor stocks. For instance, a mid-cap stock typically has a market capitalization or value between $2 and $10 billion. These stocks are typically in the middle of the growth curve so that investors can take advantage of their growth prospects without the increased risks of small-cap stocks. 7 Best ETFs for the NEXT Bull MarketHere are three mid-cap semiconductor stocks that are almost near their 52-week highs: IPG Photonics Corporation (IPGP) IPGP manufactures high power fiber lasers and amplifiers used in material processing and diverse applications. This $9.3-billion stock has been performing pretty well in the “new normal” environment and hit its 52-week high of $176.73 last Friday. It has added approximately 70% to its stock price since its April lows. IPGP’s impressive price momentum could be an indication of bullish trends in the coming months. The recent events have been encouraging enough for investors. IPGP recently announced the new YLR-U series near-infrared 1 μm fiber lasers, which has a record power to volume ratio. The company’s Senior Vice President of Worldwide Sales and Marketing Trevor Ness commented on this new fiber laser series that, “With the launch of our new ultra-compact YLR-U Series, IPG is once again raising the bar for leading-edge performance in the industrial laser sector. These solutions provide the best customer value proposition on the market bar none.” IPGP surpassed the consensus EPS estimate for the first quarter by 257.9%, and its earnings are expected to grow 13.6% annually over the next five years. How does IPGP stack up for the POWR Ratings? A for Trade Grade A for Buy & Hold Grade A for Peer Grade B for Industry Rank A for Overall POWR Rating You can’t ask for better. The stock is also ranked #1 out of 51 stocks in the Technology-Communication/Networking industry. Brooks Automation, Inc. (BRKS) BRKS, which has a market cap of $3.3 billion, is a provider of semiconductor manufacturing solutions and life science sample-based solutions worldwide. There has been a surge in demand for life science products required for Covid-19-related research. Also, the chip-manufacturers’ requirements have been driving the demand for semiconductor solutions from BRKS. The company’s diversified revenue streams have helped accelerate its revenue growth since 2018. BRKS is approaching its 52-week high and has recovered more than 74% since hitting its 52-week low in mid-March due to the overall dip in the market. The company’s strong recovery could be part of a growth momentum that could last well for the rest of 2020. In the second quarter of fiscal 2020 ended March 31st, revenue increased by 11%, and EPS increased by 140% year over year. The earnings surprise history for BRKS looks pretty good, as the company beat the consensus EPS estimates in three of the trailing four quarters. BRKS has strong financial flexibility with $198 million in net cash at the end of the fiscal second quarter. BRKS’s POWR Ratings reflect a promising outlook. It has an overall rating of “Buy” with an “A” for Trade Grade and Industry Rank and a “B” for Buy & Hold Grade. Among 86 stocks in the Semiconductor & Wireless Chip industry, it ranks #39. Entegris, Inc. (ENTG) ENTG is a provider of process solutions and advanced materials for semiconductor and high-tech industries. This $7.9-billion company recently announced its acquisition of Global Measurement Technologies and its manufacturing partner Clean Room Plastics. Global Measurement Technologies produces high precision analytical instruments used in the semiconductor manufacturing process. This acquisition strengthens ENTG’s position in the semiconductor market. This, along with increased demand for its products with individuals and corporates going digital, has helped the stock gain more than 40% since hitting its March lows to reach its 52-week high of $64.90 on June 5th. In the first quarter ended March 28, 2020, revenue increased 5%, and EPS increased 88% year over year. ENTG’s earnings surprise history looks impressive, with the company surpassing the consensus EPS estimates in three of the trailing four quarters. The market also expects the company to report EPS of $0.48 for the quarter ended June 2020, which represents a 23.1% growth over the year-ago number. Moreover, ENTG’s consensus revenue estimate of $417.4 million for the quarter indicates a year-over-year increase of 10.2%. It’s no surprise that ENTG is rated “Buy” in our POWR Ratings system. It also has an “A” for Industry Rank and a “B” for Trade Grade and Buy & Hold Grade. It ranks #35 out of 86 stocks in the Semiconductor & Wireless Chip industry. Want More Great Investing Ideas? 9 “BUY THE DIP” Growth Stocks for 2020 Newly REVISED 2020 Stock Market Outlook 7 “Safe-Haven” Dividend Stocks for Turbulent Times IPGP shares were trading at $179.08 per share on Monday afternoon, up $3.16 (+1.80%). Year-to-date, IPGP has gained 23.57%, versus a 1.63% rise in the benchmark S&P 500 index during the same period."}]}