{"article": [{"url": "https://stocknews.com/news/shop-crm-meli-3-growth-stocks-to-buy-after-the-markets-recent-selloff/", "published": 1600862900.0, "headline": "3 Growth Stocks to Buy After the Market's Recent Selloff", "body": "Growth stocks remain a compelling buy in an environment that is volatile and uncertain. While several sectors have been impacted due to COVID-19, tech stocks have been immune to the virus. The S&P 500 Index is up 2.6% year-to-date while the tech-heavy NASDAQ has returned an impressive 15% in 2020. However, industry experts believe the stock market is not in sync with the economy that is under tremendous pressure following lockdown measures and business shutdowns. The rising unemployment rates have led to lower consumer demand and while federal governments have paid billions of dollars in benefits, it will provide temporary relief to individuals and businesses. The fall in global GDP has led to a slight correction in equity markets in September 2020. However, the recent weakness also provides investors an opportunity to buy quality growth stocks at a cheaper valuation. 7 Best ETFs for the NEXT Bull MarketHere we look at three such growth stocks that should be on the radar of long-term investors. An enterprise cloud computing company The first company on the list is Salesforce (CRM) an enterprise-facing cloud computing company that focuses on providing customer relationship management solutions. It has six core cloud services that include sales force automation, customer service and support, marketing automation, analytics, community management, and a platform for building custom applications. Salesforce reported revenue of $5.2 billion in its fiscal quarter ended in July, up 30% year-over-year compared with sales of $4 billion in the prior-year quarter. Its pre-tax profit rose 400% to $839 million indicating high operating leverage. The quarter ended in July was the first time Salesforce reported $5 billion in quarterly revenue and the company forecast sales between $5.24 billion and $5.25 billion in fiscal Q3 as well. There is a chance that Salesforce might see a drop in demand for its services if enterprises cut spending due to a sluggish macro environment, which will impact its stock price. Salesforce stock has returned 246% in the last five years and 735% in the last 10 years. This means Salesforce is valued at a market cap of $225 billion and trading at a forward price to sales multiple of 12x and a forward price to earnings multiple of 66x. Despite macro challenges, Salesforce has managed to increase its revenue, cash flow, and earnings guidance for fiscal 2021 and we can see why investors are willing to pay a hefty premium for the stock. Analysts tracking Salesforce stock have a 12-month average price target of $273 which is 10.5% higher than the current trading price. Out of 45 analysts tracking the company, 41 recommend a buy on Salesforce. A Latin American giant Another stock that has crushed market returns in the last few years is MercadoLibre (MELI). This company hosts e-commerce platforms in Latin America. It also offers MercadoLibre Marketplace which is an automated e-commerce service where it allows businesses and individuals to list items and conduct online purchases at a fixed price or in an auction-based format. MercadoLibre has a massive presence in Latin America, one of the fastest-growing regions in terms of consumption and internet penetration. Online sales in Latin America accounted for just 5% of total retail sales in 2019 and this number is expected to move up rapidly in the upcoming decade. The COVID-19 pandemic has already altered consumption and buying patterns as people are shopping online due to shutdowns and social distancing measures. The pandemic has in fact acted as a tailwind for several e-commerce companies that have seen a significant surge in demand. Further, Mercado Pago, the company’s payment service will be a key driver of revenue growth as digital transactions are expected to gain pace. In Q2, the company increased sales by 123% year-over-year and analysts expect this growth to be above 50% for 2020. MELI has a market cap of $52.75 billion indicating a forward price to earnings multiple of 15x. Analysts tracking MercadoLibre have a 12-month average target price of $1,206 which indicates an upside potential of 13.7% from its current trading price. A Canadian e-commerce giant When you talk about growth stocks it is difficult to ignore Shopify (SHOP). The e-commerce company is now Canada’s largest firm in terms of market cap and is valued at $115 billion. Shopify has generated staggering wealth for early investors and is trading 5,500% above its IPO price. The stock is up 2,700% in the last five years which also means it is trading at lofty valuations. Shopify stock has a sky-high price to sales multiple of 44x and its price to earnings multiple stands at 390x. However, these multiples are supported by astounding growth rates. Shopify’s Q2 sales were up 97% year-over-year while the gross merchandise value (GMV) on its platform rose 119%. While analysts expected the firm to post earnings per share of $0.01 in Q2, Shopify reported $1.05 in adjusted earnings, crushing Wall Street estimates. The company claims to be the second-largest eCommerce platform in North America and remains a solid long-term bet given its expanding addressable market, secular growth trends, and expansion of its merchant base. Shopify stock is trading at $954 which is 17% below its record high. Analysts tracking the stock have a 12-month average target price of $1,100 indicating an upside potential of 15%. Out of 29 analysts tracking Shopify, 18 have a “buy” recommendation while 10 recommend a “hold” and one recommends a “sell”. The final takeaway The three companies discussed here are expensive stocks and might move lower in a broader market sell-off. However, their recovery will be just as swift given their huge market presence and enviable growth rates. Want More Great Investing Ideas? 7 Best ETFs for the NEXT Bull Market Stock Market Outlook: Before & After the Election Chart of the Day- See the Stocks Ready to Breakout SHOP shares were trading at $943.80 per share on Wednesday morning, down $10.45 (-1.10%). Year-to-date, SHOP has gained 137.39%, versus a 3.70% rise in the benchmark S&P 500 index during the same period."}]}