{"article": [{"url": "https://stocknews.com/news/mdb-gh-nova-3-growth-stocks-ready-to-reach-new-heights/", "published": 1600776500.0, "headline": "3 Growth Stocks Ready to Reach “New Heights”", "body": "Growth stocks are all the rage as new investors enter the market, and money continues to flow toward tech companies. Even if the pendulum swings back toward value stocks, there will always be considerable interest in growth stocks simply because they have comparably more potential for explosive growth and massive profits. The question is which growth stocks are worthy of your investing dollars. Take a close look at growth stocks, zero in on those in the tech sector, and you will likely find most have increased considerably in recent months. Though most growth stocks have soared since the pandemic sell-off ended, there is still the potential for some to reach new heights. Below, we shine a spotlight on the following four growth stocks worth closer analysis: MongoDB (MDB), Guardant Health (GH), and Sunnova Energy (NOVA). 7 \"SAFE HAVEN\" Dividend Stocks for Turbulent TimesMongoDB (MDB) Organizations in myriad industries rely on database platforms for a wide variety of purposes. MDB provides such platforms for healthcare, financial services, entertainment, media, telecom, and government spaces. MDB has solid POWR Rating component grades, highlighted by a “B” for Industry Rank. Check out the analysts’ take on MDB, and you will find they are quite bullish, setting a price target of $284.20, which is 32% higher than its current price. If you look at MDB’s price chart since the coronavirus sell-off, you will see that it took off from its low of $98. The stock steadily climbed upward, reaching $250 only to sell-off in recent weeks as investors have taken profits off the table. Today, MDB is priced at $214. Though MDB has some formidable opponents in Oracle (ORCL) and Microsoft (MSFT), its platform is built to handle particularly unorganized and challenging data, proving capable of operation from anywhere, even the cloud. MDB’s Atlas is its primary growth catalyst. Atlas empowers customers to scale databases with ease. MDB’s brass believes the company will be a disruptor for the foreseeable future, ultimately serving as a growth story that continues to provide stable returns in the long run. Guardant Health (GH) Suppose you could travel through time 20 or 30 years into the future. In that case, you might find advanced analytics, expansive data sets, and proprietary blood tests all played essential roles in beating cancer. GH provides each of these tools with the overarching goal of solving the puzzle that is cancer. The POWR Ratings reveal GH has “A” grades in each POWR component except Industry Rank, which has a grade of “B”. GH is ranked in the top 10 of 138 stocks in the Medical – Device & Equipment sector. TipRanks reveals that analysts set a price target of 117.50, which is 15% higher than its current price. GH soared to $96 after its spring dip, fell right back down to the $70s, and bounced up to triple digits in recent weeks. GH’s liquid biopsies have the potential to identify cancer within DNA faster than any other method, monitor for recurrences, and ultimately help scientists win the battle against cancer. GH products have boosted sales at two times the level of Tesla’s growth over the past three years. This is a growth stock to keep an eye on. Sunnova Energy (NOVA) The solar energy sector has been on fire for several months. NOVA is a particularly interesting play in this space. This company provides solar power and energy storage for residential properties. NOVA’s POWR Ratings are fantastic, highlighted by “A” grades in Peer Grade and Trade Grade. Ou of 60 stocks in the Energy – Services industry, NOVA is ranked third. NOVA’s solar-as-a-service strategy is relatively unique as it enlists the assistance of local installers who do the grunt work. This sets the stage for NOVA to make money and sell its ever-expanding customer base even more products/services down the line. TipRanks reports that analysts have a bullish outlook on the stock, with nine out of nine analysts recommending the stock as a Buy, with a price target of $28.33. Want More Great Investing Ideas? 7 Best ETFs for the NEXT Bull Market Stock Market Outlook: Before & After the Election Chart of the Day- See the Stocks Ready to Breakout MDB shares were trading at $217.34 per share on Tuesday morning, down $5.20 (-2.34%). Year-to-date, MDB has gained 65.14%, versus a 3.01% rise in the benchmark S&P 500 index during the same period."}]}