{"article": [{"url": "https://stocknews.com/news/xlk-xlv-xhb-ipo-4-etfs-setting-up-for-a-breakout-in-2021/", "published": 1602072500.0, "headline": "4 ETFs Setting Up For a Breakout in 2021", "body": "A major topic of discussion among investors is the apparent disconnect between the stock market and the real economy. Despite the economic weakness, the Dow Jones Industrial Average has gained 22.5% and the S&P 500 returned 25.7% in the past six months. While there’s disagreement about the exact reasons behind the booming stock market, most analysts expect the market to continue higher in 2021. The major drivers of the economic recovery are the reopening of businesses, resumption of normal economic activity, and government stimulus. Both monetary and fiscal stimulus will likely be deployed if the economy encounters any rough patches. The biggest gainers are expected to be the technology, healthcare, housing, and consumer packaged goods industries. Thus, investing in ETFs such as SPDR Select Sector Fund – Technology (XLK), Health Care Select Sector SPDR Fund (XLV), SPDR S&P Homebuilders 500 ETF (XHB), and Renaissance IPO ETF (IPO) help investors gain all-round exposure to the stocks with the highest growth potential. 7 \"SAFE HAVEN\" Dividend Stocks for Turbulent TimesSPDR Select Sector Fund – Technology (XLK) XLK is one of the most popular ETFs investing in large-cap tech companies based in the United States. This State Street ETF is one of the best-performing ones so far in 2020 with $33.51 billion assets under management (AUM), as the growth pace of the technology and telecom industry has accelerated during the pandemic. Apple Inc. (AAPL) is the biggest holding of this ETF, constituting 23.6% of the total portfolio. Microsoft (MSFT) is a close second, with a 20.2% weightage. XLK has an expense ratio of 0.13% compared to the category average of 0.51%. The fund has returned 26.2% year to date, and 38.2% in the past six months, as the underlying stocks fared well during the pandemic. It pays an annual dividend of $1.19, yielding 1.02% on the current price. Its dividend has increased at a CAGR of 7.9% in the past three years. XLK gained more than 85% since hitting its 52-week low of $68.10 in March. The ETF hit its 52-week high at $127.72 in September. How does XLK stack up for our POWR Ratings? A for Trade Grade B for Buy & Hold Grade B for Industry Rank B for Overall POWR Rating XLK is ranked #48 out of 94 ETFs in the Technology Equities ETFs group. SPDR S&P Homebuilders 500 ETF (XHB) XHB is another major ETF that primarily invests in home building and construction companies. It invests in both large and small-cap companies, thereby striking a balance between risk and return. XHB’s main holdings include Whirlpool Corp (WHR), Pultegroup Inc. (PHM), and Carrier Global Corp (CARR). It currently has an AUM of $950.78 million. XHB’s expense ratio of 0.35% is significantly lower than its category average of 0.55%. The ETF has returned 83.8% in the past six months and 20.4% year to date. It is also a reliable dividend ETF, with a consistent quarterly payout history for 7 years. XHB pays an annual dividend of $0.41, yielding 0.73% on its prevailing price. Its dividend has increased at a CAGR of 21.2% over the past three years. XHB gained more than 105% to hit its 52-week high of $56.19 in October since hitting its 52-week low of $23.95 in March, showing a strong recovery. XHB is rated as a “Strong Buy” ETF in our POWR Ratings system, with an “A” in Trade Grade, Buy & Hold Grade, Peer Grade, and Industry Rank. It is ranked #5 out of 42 ETFs in the Consumer-Focused ETFs group. Health Care Select Sector SPDR Fund (XLV) XLV invests in large-cap companies operating in the healthcare and pharmaceutical sector listed in the S&P 500 index. With an AUM of $23.75 billion, XLV’s biggest holdings include Johnson & Johnson (JNJ), United Health Group Corp (UNH), and Merck & Co., Inc. (MRK). XLV has an expense ratio of 0.13% compared to a category average of 0.46%. It gained 14.9% in the past six months, and 3% year-to-date. It pays an annual dividend of $2.56, which yields 2.4% on the current price. XLV’s dividend grew at a CAGR of 11.7% over the last three years. XLV has gained more than 45% since hitting its 52-week low of $73.54 in March. The ETF hit its 52-week high of $109.74 in September. It’s no surprise that XLV is rated “Strong Buy” in our POWR Ratings system, with an “A” for Trade Grade, Buy & Hold Grade, and Industry Rank. It is also ranked #1 out of 38 ETFs in the Health & Biotech ETFs sector. Renaissance IPO ETF (IPO) IPO focuses on newly listed companies, adding them to its portfolio within the first 90 days. IPO maintains its position in these companies for two years. More than 25% of its portfolio is currently invested in Zoom Video Communications Inc. (ZM), Uber Technologies Inc. (UBER) and CrowdStrike Holdings Inc. (CRWD). With an AUM of $229.49 million, this passively managed ETF closely tracks the Renaissance IPO Index. IPO’s expense ratio of 0.6% compares to the category average of 0.39%. However, it is worth paying the higher premium due to the ETF’s impressive performance so far this year. IPO gained 106.3% over the past six months and 71.6% year-to-date. It currently pays an annual dividend of $0.39, which yields 0.24%. The ETF increased its dividend payout by 236.8% in the last quarter of 2019, and again by 3.1% in the first quarter of 2020. Its dividend grew at a CAGR of 20% over the past three years. IPO gained more than 165% to hit its 52-week high of $54.44 in October since hitting its 52-week low of $20.37 in March. IPO’s strong fundamentals are reflected in its POWR Ratings. It is rated “Strong Buy” with a grade of “A” in Trade Grade and Buy & Hold Grade, and a “B” in Peer Grade and Industry Rank. Out of 4 ETFs in the IPO ETFs group, it is ranked #3. Want More Great Investing Ideas? 7 Best ETFs for the NEXT Bull Market What is the Cure for Stock Market Volatility? Chart of the Day- See Christian Tharp’s Stocks Ready to Breakout XLK shares fell $0.12 (-0.10%) in after-hours trading Wednesday. Year-to-date, XLK has gained 29.77%, versus a 7.39% rise in the benchmark S&P 500 index during the same period."}]}