{"article": [{"url": "https://stocknews.com/news/dell-glob-ttgt-3-strong-buy-tech-stocks-bucking-the-markets-bearish-trend/", "published": 1601294900.0, "headline": "3 Strong Buy Tech Stocks Bucking the Market's Bearish Trend", "body": "The last decade has been a boon for the tech industry. The growing adoption of software and cloud services created a new digital world. And the COVID-19 pandemic just accelerated the move to digitization. To stay relevant in this digital age and facilitate the pandemic-driven “new normal,” companies are in the process of revamping their processes, operations, and relationships with customers. International Data Corporation (IDC) forecasts global spending on digital transformation to increase at a CAGR of 17.1% to $2.3 trillion between 2019 and 2023. Hence, companies catering to digital transformation are a long-term bet. The pandemic has brought some tech companies in the limelight. Many tech companies, even the FAANGM (Facebook (FB), Amazon (AMZN), Apple (AAPL), Netflix (NFLX), Google (GOOGL), and Microsoft (MSFT)) stocks, rallied to unprecedented levels as investors considered them to be the strongest with technology becoming a necessity. However, investors cashed out some money in September over concerns around the second fiscal stimulus package. 7 \"SAFE HAVEN\" Dividend Stocks for Turbulent TimesStocks at the peak of the pandemic wave dipped the most; FAANGM stocks fell 10%-16% from their all-time highs on September 2nd. While Nasdaq is still struggling to come out of this bearish trend, some lesser traded stocks have returned to their rally. Dell Technologies Inc (DELL), Globant S.A. Common Shares (GLOB), and TechTarget, Inc. (TTGT) bucked the bearish trend and returned to their positive momentum on September 8th. It was their lower trading volumes that mitigated the impact of the tech sell-off on these stocks. They fell 6%-12% between September 1 and 8, and then returned to grow around 2%-10%. Perhaps, their less media hype paid off in this way. Dell Technologies Inc (DELL) DELL, as we know, is all about hardware. Most of the digital work happens on its PCs and servers. That is what makes the tech giant the third-largest PC vendor and second-largest server vendor in the world. But you will be surprised to know that it derives most of its value from information security and virtualization businesses, which it acquired with the $67-billion EMC merger. Its software arm VMware’s (VMW) market valuation of $59.5 billion is higher than DELL’s valuation of $49.07 billion. DELL’s stock has been falling since May 2019 on the back of weakness in server demand, which was pulling down its revenue. The stock fell 53% between May 2019 and March 2020. After that, it doubled as the company announced its intention to spin-off VMware and generate significant value for shareholders. Dell is not a heavily traded stock. Its trading volumes almost halved to 1.2 million in September as most investors have bought the stock for VMware spin-off. Hence, it was not much affected by the market’s bearishness. The stock fell 6% over the first six trading sessions and then surged 2% so far this month. DELL stock could surge through next year until the spin-off is over. Hence, it is rated a “Strong Buy” in our POWR Ratings system. It has a grade of “A” for Trade Grade, Peer Grade, and Buy & Hold Grade. The stock is also ranked #1 in the 29-stock Technology – Hardware industry. Globant S.A. Common Shares (GLOB) GLOB is not a well-known name as it works behind the scenes to power the digital products that you use every day. Founded in 2003, Argentina-based GLOB became the first Latin American company to trade on NYSE in 2014. Its journey from a $10 IPO to $174 share price shows its high growth trend. GLOB is a technology outsourcing company that offers digital and cognitive transformation services. It helps large and small companies through their digital journey to: Stay relevant by staying updated on industry developments and take preemptive measures Discover consumer behaviors and technologies, and Build the digital platform of software products, mobile apps, and sensors. GLOB has more than doubled its customer base from 373 in 2018 to 822 in 2019, bagging some big pocket clients like Disney (DIS), GOOGL, Electronic Arts (EA), and Southwest Airlines (LUV). However, GLOB earns 32% of its revenue from its top five customers. Such a concentrated client base means its revenue could fall significantly if it loses even one of these customers. It is working on this problem with its ambitious “50-Squared” objective to acquire 50 separate clients, each of which generates $50 million in annual revenue. In the short-term, GLOB’s concentrated customer base worked well during the pandemic. Its second-quarter revenue rose 16% year-over-year to nearly $183 million, driven by a 16% surge in revenue from the top 10 customers. The company’s revenue would continue to increase as more companies prioritize digital transformation. The street expects its revenue to rise by 19% this year and 24.5% next year. GLOB’s 99% outstanding shares are held by 382 institutional investors. It’s lower trading volume of 155,600 shows that institutional investors did not act on the market’s bearishness. Hence, the stock rose 5% this month after falling 12% in the first six trading sessions. This momentum was probably led by retail investors. Such a high revenue growth rate has been driving GLOB stock to new highs, rising 88% last year and 64% so far this year. It is rated a “Buy” in our POWR Ratings system. It also has an “A” for Trade Grade and Peer Grade, and a “B” for Buy & Hold Grade. In the 34-stock Internet – Services industry, it is ranked #1. TechTarget, Inc. (TTGT) TTGT is bucking the digital marketing trend. It provides the right content to over 20.5 million registered members (IT professionals). It uses the information of its members to provide target accounts and prospects to around 1,400 leading and high-growth tech companies. The company earns revenue from long-term subscriptions with IT vendors. Its client base includes many big names like Nokia (NOK), Dell, and Oracle (ORCL). However, the pandemic slowed TTGT’s growth as several tech companies reduced their investments in branding and opted for shorter-term subscriptions. Moreover, many new clients have delayed signing annual contracts because of the uncertainty the pandemic has created. Tech companies are seeking flexibility to adjust to the challenges that the pandemic brings to the business environment. Hence, TTGT’s second-quarter revenue surged just 1% year-over-year to $34.8 million. As the economy recovers, TTGT’s growth should return. The company has suspended its full-year 2020 guidance, but analysts expect its revenue to surge 2.5% this year and 9.9% next year. TTGT’s 88.9% outstanding shares are held by 233 institutional investors. When these investors sell the stock, it sees a major dip. But it has a trading volume of 210,500, which shows that it was mostly retail investors who drove the stock momentum. The stock rose 10% this month after falling 8% in the first six trading sessions. TTGT is rated a “Strong Buy” in the POWR Ratings. It holds straight “A”s in Trade Grade, Peer Grade, and Buy & Hold Grade. It is also the #3 ranked stock on the Internet – Services industry. Want More Great Investing Ideas? 7 “Safe-Haven” Dividend Stocks for Turbulent Times When Does the Next Bull Run Start? Chart of the Day- See the Stocks Ready to Breakout DELL shares were trading at $67.45 per share on Monday afternoon, up $1.73 (+2.63%). Year-to-date, DELL has gained 31.25%, versus a 5.29% rise in the benchmark S&P 500 index during the same period."}]}