{"article": [{"url": "https://stocknews.com/news/twtr-spot-twlo-pins-grub-5-top-tech-stocks-you-should-be-buying-in-october/", "published": 1602158900.0, "headline": "5 \"Top\" Tech Stocks You Should Be Buying in October", "body": "Since the onset of the deadly virus this year, there has been one sector that has performed extremely well, Technology. This is evident from the Technology Select Sector SPDR ETF’s (XLK) 67.3% return since its March low, compared with the S&P 500’s 52.8% gain. With the uncertainty surrounding the upcoming presidential election, fiscal stimulus talks, and continued increase in coronavirus cases, the market is expected to remain quite volatile this month. Moreover, on October 6th, the House Antitrust Subcommittee issued a report, mentioning the wrongdoing and anticompetitive behavior of Facebook (FB) Alphabet (GOOGL), Amazon.com (AMZN), and Apple (AAPL) in detail. The report is demanding action to change antitrust laws. However, the report failed to lower investor enthusiasm for tech companies. Keeping that in mind, investment in strong technology companies such as Twitter, Inc. (TWTR), Spotify Technology S.A. Ordinary (SPOT), Twilio Inc. (TWLO), Pinterest, Inc. (PINS) and GrubHub Inc. (GRUB) could add a boost to your portfolio amid the pandemic. 9 \"BUY THE DIP\" Growth Stocks For 2020Twitter, Inc. (TWTR) In recent years, if news triggered billions dollar moves in the stock market, it likely came from the little blue bird. I am talking about TWTR, which operates as a platform for public self-expression and real time conversation in the United States and internationally. It has become even easier to follow a particular stock on Twitter. Although a free platform for the users, its major sources of revenues are advertising and data licensing. For the fiscal quarter that ended June 30, 2020, the Average Monetizable Daily Active Usage (mDAU) for TWTR grew 34% year-over-year to $186 million. The company’s EPS is expected to increase 184% next year. Also, the market expects TWTR’s revenue to increase 2.4% next quarter and 23.7% in the next year. The stock has gained 107.2% since hitting its low of $20 in mid-March. TWTR is exploring options on how to make the platform better and how misinformation labels can be more direct and obvious. TWTR should exhibit strength as it nears its next earnings release for the quarter that ended on September 30, 2020. How does TWTR stack up for the POWR Ratings? A for Trade Grade A for Buy & Hold Grade A for Peer Grade B for Industry Rank A for Overall POWR Rating The stock is also ranked #3 out of 57 stocks in the Internet industry. Spotify Technology S.A. Ordinary Shares (SPOT) Founded in 2006, SPOT provides audio streaming services in the United States, the United Kingdom, Luxembourg, and internationally. Although offering free services too, its services are monetized through both premium subscriptions and advertising segments. For the quarter that ended June 30, 2020, SPOT’s total revenue grew 13% year-over-year, while its premium revenue grew 17% year-over-year. Unlike its competitors, it only monetizes profits from its audio streaming services. At the end of the second quarter, SPOT boasted a monthly active user base of 299 million, which grew 29% year-over-year. It has the highest subscribers in Europe at 39%, followed by North America at 29%. The stock gained 111.3% since hitting its 52-week low in mid-March. The market expects SPOT’s revenue to increase 20% in the current quarter and 22.4% next year. The company’s EPS is expected to grow 62% next year and at a rate of 167.7% over the next five years. SPOT will post its third quarter 2020 financial results on October 29th. The company has been focusing on exclusive podcasts, which have been quite successful, leaning on influencers like the Obamas and Joe Rogan. SPOT’s POWR Ratings reflect this promising outlook. It has an overall rating of “Buy” with an “A” for Peer Grade and a “B” for Trade Grade. Among the 11 stocks in the Entertainment-Radio industry, it’s ranked #1. Twilio Inc. (TWLO) TWLO provides a cloud communications platform that enables developers to build, scale, and operate communications within software applications through the cloud as a pay-as-you-go service in the United States and internationally. It has democratized communications channels like voice, text, chat, video, and email by virtualizing the world’s communications infrastructure through APIs. It has grown 253.8% since hitting its 52-week low in mid-March and its shares are expected to continue to skyrocket. Not only has its total revenue grown 46% year-over-year, it also had more than 200,000 active customer accounts as of June 30, 2020. TWLO is scheduled to release its third quarter 2020 results on October 26th. TWLO has an impressive earnings surprise history with the company surpassing EPS estimates in each of the trailing four quarters — by a whopping 200% in the last quarter. The market expects the company’s revenue to increase 41.2% this year and 27.2% next year. TWLO’s EPS is expected to grow 140% next year and at a rate of 20.5% over the next five years. It’s no surprise that TWLO is rated a “Strong Buy” in our POWR Ratings system. It also has an “A” for Trade Grade, Buy & Hold Grade, and Peer Grade, and a “B” for Industry Rank. In the 11-stock Software-SAAS industry, it is ranked #1. Pinterest, Inc. (PINS) With a pinboard-style photo-sharing website operation, PINS is a visual discovery engine for finding ideas like recipes, home and style inspiration, and more. Found in 2008, it went public in April 2019. Before PINS came into being, CEO Ben Silbermann had ventured into transforming every cell phone into a clothing retail outlet with an app called Tote, which was launched by 2010. However, the technology of that time limited its growth and eventually, PINS came into existence and quite successfully so. For the quarter that ended June 30, 2020, PINS reported Global Monthly Active Users of 416 million, which grew 39% year-over-year. The company’s revenue grew 4% year-over-year to $272 million. The stock has gained 297% since hitting its 52-week low of $10.10 in mid-March. PINS’ EPS is expected to increase 100% in the current quarter, 633.3% next year, and at a rate of 139% over the next five years. The market expects PIN’s revenue to increase 34.6% in the current quarter, 26.9% in the current financial year, and 34.5% next year. In fact, PINS’ earnings surprise history looks impressive with the company missing the consensus estimate in just one of the trailing four quarters. PINS’s strong fundamentals are reflected in its POWR Ratings. It has a “Strong Buy” rating with an “A” in Trade Grade, Peer Grade, Buy & Hold Grade, and “B” in Industry Rank. GrubHub Inc. (GRUB) Operating as an online and mobile food-ordering company, which connects diners with local takeout restaurants, GRUB was already well positioned to gain from the pandemic, which has restricted people from moving out of their homes. The stock gained 147.3% since hitting its 52-week low in mid-March. For the second quarter that ended June 30, 2020, the company reported revenues of $459 million, up 41% year-over-year. Its gross food sales grew 59% year-over-year to $2.3 billion. In fact, Lyft, Inc. (LYFT) has partnered with GRUB to offer Lyft Pink members complimentary membership to Grubhub+. The market expects GRUB’s revenue to increase 36.8% in the current quarter and 28.9% in the current financial year. The company’s EPS is expected to increase 168.6% next year and at a rate of 33.7% over the next five years. On September 4th, Just Eat Takeaway.com received all regulatory approvals required in respect to its proposed acquisition of GRUB for $7.3 billion. It’s no surprise that GRUB is rated a “Buy” in our POWR Ratings system. It also has an “A” for Trade Grade, Peer Grade, and a “B” for Buy & Hold Grade and Industry Rank. In the 57-stock Internet industry, it is ranked #16. Want More Great Investing Ideas? 7 Best ETFs for the NEXT Bull Market What is the Cure for Stock Market Volatility? Chart of the Day- See Christian Tharp’s Stocks Ready to Breakout TWTR shares were trading at $46.14 per share on Thursday afternoon, up $0.27 (+0.59%). Year-to-date, TWTR has gained 43.96%, versus a 8.26% rise in the benchmark S&P 500 index during the same period."}]}