{"article": [{"url": "https://stocknews.com/news/dell-cdns-snps-umc-tsm-3-computer-hardware-stocks-capitalizing-on-the-pandemic/", "published": 1597406900.0, "headline": "3 Computer Hardware Stocks Capitalizing on the Pandemic", "body": "Though the pandemic had virtually brought the United States to a standstill as business operations were temporarily halted by the lockdown measures earlier this year, the services industry managed to keep functioning. With close to 80% of the US workforce employed by this sector, it adopted the policy to have the majority of employees work remotely by setting up a virtual office space. This led to an increase in demand for hardware products. The increased in-house recreational needs with people unable to do outdoor recreational activities, and remote education needs with schools being closed, also added to the demand for computer and related hardware products. In this context, earlier this year, Microsoft Corporation’s (MSFT) Chief Product officer said, “Customers are using Windows PCs to stay productive, connect and learn in this time. In fact, over 4 trillion minutes are being spent on Windows 10 a month, a 75% increase year on year.” He also mentioned that more than 1 billion devices are currently run on Windows 10. 7 \"SAFE HAVEN\" Dividend Stocks for Turbulent TimesMoreover, the IT industry is actively designing hardware products to suit the upcoming 5G technology. Companies such as Dell Technologies, Inc. (DELL), Synopsys, Inc. (SNPS) and Cadence Design Systems, Inc. (CDNS­) have huge growth potential, given highly anticipated technological advancements coupled with a rising demand for computers among the masses. With the 5G race becoming more intense with each passing day and the “work from home” culture expected to continue for some time in the absence of any approved vaccine so far, these companies are expected to gain tremendously through the remainder of 2020. Dell Technologies, Inc. (DELL) As one of the most popular names in the IT industry, DELL has a global presence for designing, developing, and manufacturing both hardware and software components of computers and laptops. With work from home being the “new normal,” the demand for DELL’s products has significantly increased over the past few months. DELL announced first quarter fiscal 2021 (ending May) deferred revenue of $27.6 billion, which increased 14% year-over-year. DELL currently holds 81% of VMware, which is valued at more than the parent company itself. DELL has recently announced that it is planning a spin-off of the VMware stake, which could increase the valuation of DELL by billions. This deal is expected to mutually benefit both companies, with DELL achieving investment grade credit. Scheduled for September 2021, this deal is timed to limit the federal income taxation applicable, allowing DELL to retain its earnings. DELL’s shares have gained over 7% in value in the first week of July, as investors were optimistic about this spin-off. The stock gained more than 140% from the 52-week low of $25.51 it hit in March. DELL’s strong recovery could be part of a growth momentum and sound business plan that could continue through the remainder of 2020. CEO Michael Dell said, “We are focused on winning in the consolidating markets where we operate and innovating across the Dell portfolio to create integrated solutions that turn data into insights and action.” The consensus EPS estimate for the second quarter ending July 2020 of $1.38 indicates a year-over-year decline. However, DELL has surpassed EPS estimates in three out of the last four quarters, which is impressive. How does DELL stack up for the POWR Ratings? A for Trade Grade A for Buy & Hold Grade B for Peer Grade A for Industry Rank A for Overall POWR Rating DELL is also ranked #3 out of 28 stocks in the Technology – Hardware industry. Cadence Design Systems, Inc. (CDNS­) CDNS provides hardware and software services as well as integrated circuit (IC) design blocks worldwide. It provides functional verification services for emulating and prototyping hardware through three platforms – JasperGold, Xcelium and Palladium. CDNS’ other services include digital integrated circuit designs and signoff, custom IC design and verification, system interconnect and analysis and intellectual property. CDNS has huge growth potential, as the demand for hardware upgrades of existing technology is increasing. As 5G is the most anticipated technology development this year, the demand for CDNS’ hardware services can skyrocket in the upcoming months. As a part of the expansion plan, CDNS has collaborated with several companies operating in the same industry to create a brand value of its services in the market, as well as establish itself as a key player. CDNS’ Cadence millimeter wave (mmWave) got certified for United Microelectronics Corporation’s (UMC) 28HPC+ process technology on July 23rd. This will allow CDNS to gain access to integrated RF design flow which accelerates time to market. It also collaborated with Taiwan Semiconductor Manufacturing Company (TSM) and Microsoft Corporation to reduce semiconductor design signoff schedules on the cloud. CDNS achieved digital and analog EDA flow certification for TMSC N6 and N5 process technologies earlier this year, accelerating next generation mobile application development. On August 12th, CDNS rolled out machine learning optimized Xcelium logic simulation with 5 times faster verification closure on randomized regressions. CDNS’ net revenues grew 10% year-over-year to $638 million in the second quarter ended June 2020. Its income from operations of $151 million improved 13.6% from its year-ago value, while net income grew 22.4% to $131 million. Net cash flow from operations increased 40.2% year-over-year to $345 million during this time period. CDNS’ business outlook for the third quarter states an expected revenue in the range of $630 to $650 million. The consensus EPS estimate for the third quarter ended September 2020 indicates an 11.1% growth year-over-year. Moreover, CDNS managed to beat the street EPS estimates in each of the trailing four quarters, which is impressive. CDNS gained more than 115% to hit its 52-week high of $112.32 in August since hitting its 52-week low in March. It’s no surprise that CDNS is rated a Strong Buy in our POWR Ratings system. It has a grade of A in Trade Grade, Buy & Hold Grade, Peer Grade, and Industry Rank. In the 28-stock Technology – Hardware Industry, CDNS is ranked #4. Synopsys, Inc. (SNPS) SNPS offers electronic design automation software-oriented products and intellectual property services. It offers the Fusion design platform and Verification Continuum platform for digital design implementation and virtual prototyping, simulation and emulation, field- programming gate array (FPGA) based prototyping, and debugging services. SNPS is a prime contractor for Automatic Implementation of Secure Silicon (AISS) program developed by the Defense Advanced research Projects agency. On July 14th, SNPS launched JEDEC DDR5 compliant verification IP for double data rate 5 (DDR5) DRAM/DRIM. This technology provides higher performance for lower power on enterprise applications, cloud-based services, hyperscale data centers and high-performance workstations/ servers. As the demand for powerful chip processors and software upgrades are rising to facilitate the “work from home” culture, SNPS’ partnerships have led to profitable results for the second quarter of 2020. SNPS’ non-GAAP revenue grew 5.7% year-over-year in the quarter to $188.30 million. The consensus EPS estimate of $1.34 for the third quarter ending July 2020 indicates a 13.5% growth year-over-year. SNPS also has an impressive earnings surprise history, as it beat the street EPS estimates in each of the trailing four quarters. SNPS gained more than 95% in just 4 months to hit its 52-week high of $204.90 in July since hitting its 52-week low of $104.90 in March. SNPS is rated a Strong Buy in our POWR Ratings system, with a grade of A in Trade Grade, Buy & Hold Grade, Peer Grade, and Industry Rank. It is also ranked #5 out of 25 stocks in the Technology-Hardware industry. Want More Great Investing Ideas? 3 Possible Directions for the Stock Market from Here How to Trade THIS Stock Bubble? 9 “BUY THE DIP” Growth Stocks for 2020 DELL shares were unchanged in after-hours trading Friday. Year-to-date, DELL has gained 16.58%, versus a 5.73% rise in the benchmark S&P 500 index during the same period."}]}