{"article": [{"url": "https://stocknews.com/news/cmg-sbux-dnkn-mcd-is-chipotle-a-buy-under-1300/", "published": 1600862900.0, "headline": "Is Chipotle a Buy under $1,300?", "body": "Chipotle Mexican Grill, Inc. (CMG) is a fast-food restaurant chain specializing in Mexican cuisine operating across North America and Europe. It’s been one of the best-performing restaurant stocks of the past decade. The stock has fared well relative to its peers since the coronavirus hit the US given its extensive drive-thru facility and home delivery system. The stock soared to hit an all-time high of $1,384.46 on September 2nd but lost more than 10% since then to close yesterday’s trading session at $1,234.58. Given the underlying strength in its business and continued expansion of its products, the recent price decline offers a buying opportunity. The stock has gained 47.5% year-to-date. The company’s strong financials combined with several other factors have helped it earn a “Buy” rating in our proprietary ratings system. 7 \"SAFE HAVEN\" Dividend Stocks for Turbulent TimesHere’s how our proprietary POWR Ratings system evaluates CMG: Industry Rank: A The Restaurant industry is ranked #21 out of 123 industries in the StockNews.com universe. This industry was one of the hardest-hit segments by the pandemic, as dining out became unpopular due to fear of catching the virus. However, the industry has quickly adapted to the new normal by expanding home delivery, takeaway, and drive-thru facilities. Fast food restaurants have gained more traction during this time, as they had well-established home delivery and drive-thru systems in place before the onset of the healthcare crisis. Trade Grade: B CMG is currently trading above its 50-day and 200-day moving averages of $1216.71 and $955.20 respectively, indicating a golden-cross bullishness. It has gained 15.4% in the past three months, which reflects a short-term uptrend. CMG’s digital sales grew 216.3% in the second quarter ended June 2020, accounting for 60.7% of net sales for the quarter. The company opened 37 new restaurants during this time. Despite the pandemic-induced slowdown in business operations, it delivered a net income of $8.18 million in the quarter. On August 4th, CMG launched a clothing line called Chipotle Goods that features apparel and accessories made of organic cotton that’s dyed using upcycled avocado pits from the chain’s restaurants. Buy & Hold Grade: B In terms of proximity to the 52-week high, which is a key factor that our Buy & Hold Grade takes into account, CMG is well-positioned. It is currently trading 12.1% below its 52-week high. CMG has gained 292.8% in the past three years, which can be attributed to its solid revenue and earnings growth. Revenue increased at a CAGR of 9.3% over the past three years, while diluted EPS rose at a CAGR of 24.7% over the same period. Net income grew at a CAGR of 23.2% over the past three years. CMG’s membership program that offers multiple discounts from time to time ensures a steady customer base. This, combined with sound financial management, has allowed the company to thrive in the past couple of years. Peer Grade: B CMG is currently ranked #4 out of 49 stocks in the Restaurants industry. Other popular stocks in this industry include McDonald’s Corporation (MCD), Dunkin’ Brands Group, Inc. (DNKN), and Starbucks Corporation (SBUX). MCD and DNKN gained 11.6% and 3.3% year-over-year, respectively, while SBUX lost 3% over this period. This compares to CMG’s 47.5% gain over the same period. Overall POWR Rating: B (Buy) CMG has a “Buy” rating due to its short-and-long-term bullishness, impressive past performance, solid price momentum, and underlying industry strength, as determined by the four components of its overall POWR Rating. Bottom Line CMG is well-positioned to soar further in the upcoming months due to favorable analyst sentiment, continued business growth, and solid revenue outlook. CMG has an average broker rating of 1.59, reflecting favorable analyst sentiment. Out of 35 Wall Street analysts that rated the stock, 14 rated it “Strong Buy.” CMG has an impressive earnings surprise history, as it beat the street EPS estimates in each of the trailing four quarters. Consensus revenue estimate of $1.58 billion for the third quarter ending September 2020 indicates a 12.7% increase year-over-year. Want More Great Investing Ideas? 7 Best ETFs for the NEXT Bull Market Is the Stock Market Correction Over? Chart of the Day- See the Stocks Ready to Breakout CMG shares were unchanged in after-hours trading Wednesday. Year-to-date, CMG has gained 49.13%, versus a 1.68% rise in the benchmark S&P 500 index during the same period."}]}