{"article": [{"url": "https://stocknews.com/news/gsx-nkla-ino-famous-short-sellers-are-betting-against-these-3-stocks/", "published": 1600344500.0, "headline": "Famous Short Sellers are Betting Against These 3 Stocks", "body": "The market has been continuing its volatility and downtrend trend that started this month. The S&P 500 is down 1.5% so far for the day. Investors are facing uncertainty due to a murky economic outlook and the upcoming presidential election. The markets are still down after the Fed’s latest decision to keep interest rates near zero until inflation increases. Apparently, investors are unhappy that the Fed isn’t doing anything else. In this backdrop, a few stocks have recently seen large short positions taken. Investors’ bearish sentiments are often seen through their short-selling activity as they bet against stocks based on either negative news or if they believe the stock has become overvalued. The bullish crowd argue that the motivation of activist short-sellers is to manipulate the market and profit from a manufactured decline in the stock prices. Short-sellers argue that they help the market by unmasking frauds. GSX Techedu Inc. (GSX), Nikola Corp. (NKLA), and Inovio Pharmaceuticals, Inc. (INO) are three stocks that were recently shorted by famous short sellers. 9 \"BUY THE DIP\" Growth Stocks For 2020GSX Techedu Inc. (GSX) GSX is a technology-driven education company that provides online K-12 after-school tutoring services in the People’s Republic of China. The company has confirmed that it is being investigated by the U.S. Securities and Exchange Commission (SEC) after investors accused the firm of inflating its sales. GSX reported revenue of $1.65 billion for the second quarter, growing 367% compared to the year-ago quarter. Enrollment in its K-12 online course increased more than 300% year-over-year. Famed short-seller Andrew Left of Citron Research believes that the company’s suspicious enrollment numbers stood out in the highly competitive online education industry, and hence, he is shorting the stock. Left accused, “If the audits are done properly it will go to zero and delist.” In May, short-seller Carson Block and his firm Muddy Waters Research claimed that at least 70% of the company’s users are fake and concluded that it is a near-total fraud. The Trump administration also announced earlier that it is looking to ban Chinese companies with shares traded on US stock exchanges unless they comply with American accounting requirements. The stock has gained as high as 500% this year. However, the stock has tanked 20.6% since hitting an all-time high on August 6th this year. GSX has a short float of 19%, indicating that the stock has been highly shorted. The stock closed yesterday’s trading session at $104.17, gaining more than 376% year-to-date. According to the POWR Ratings, GSX has an overall “C” rating. It also has a grade of “C” for Trade Grade and Buy & Hold Grade, and a “D” for Industry Rank. Nikola Corp. (NKLA) NKLA operates as an integrated zero-emissions transportation systems provider. It designs and manufactures battery-electric and hydrogen-electric vehicles, drivetrains, energy storage systems, and hydrogen fueling station infrastructure. Investors have accused NKLA of being “an intricate fraud built on lies” based on false statements by Nikola Founder, Trevor Milton. Short-selling research firm Hindenburg has recently accused NKLA of fraud after it published a report criticizing the electric truck maker. The report claims that NKLA has repeatedly hyped its battery and fuel cell technology beyond its true capabilities and overstated its progress toward the development of its electric truck, including faking video of its prototype driving on road. NKLA’s product development is on track to meet the established timeline for the start of production of the Nikola Tre in the fourth quarter of 2021. Moreover, it has recently formed a strategic partnership with General Motors (GM) for the supply of batteries and fuel cells. GM has taken an 11% stake in the company. It will also provide engineering and validation services to NKLA, in addition to manufacturing capacity. However, NKLA has admitted to faking video of its electric hydrogen truck driving prototype in a weak response to the allegations. But it also claimed that the video was now irrelevant as the allegations related to events before 2017, and that much progress has been made since then because of the working prototype of their truck. NKLA has gained as high as 672% this year. However, the stock has lost more than 54% after hitting an all-time high in June. It closed yesterday’s trading at $33.28 after plunging 34.6% in the last six trading days. The stock has a short float of 8.24%. As per our POWR Ratings, NKLA has an overall rating of “Sell.” It also holds a grade of “D” in Peer Grade and an “F” for Trade Grade and Buy & Hold Grade. It is currently ranked #21 out of 29 stocks in the Auto & Vehicle Manufacturers Industry. Inovio Pharmaceuticals, Inc. (INO) INO is a biotechnology company that focuses on the discovery, development, and commercialization of DNA medicines to treat people from diseases associated with human papillomavirus (HPV), and infectious diseases. INO is progressing to produce its COVID-19 vaccine, INO-4800, and is waiting for approval from the FDA to begin later-stage human trials later this month. The short selling firm, Muddy Waters, led by investor Carson Block, is short on the stock. He claims that the stock has been boosted this year by high hopes for its COVID-19 vaccine candidate. He further mentioned that the recent court decision over a supply agreement made it clear that INO lacks manufacturing capacity to get remotely near the purported goal of 1 million doses in 2020 and 100 million in 2021. The company partnered with the International Vaccine Institute and Seoul National University Hospital in June to run Phase 1 and 2 clinical trials of its vaccine in South Korea. Furthermore, it backed a $71 million contract from the U.S. Department of Defense to scale up its manufacturing capacity. However, some industry observers were skeptical about INO’s interim results for the early-stage study of INO-4800 announced on June 30. The biotech company did not provide all of the details about immune responses in participants that industry observers were hoping to hear. Moreover, the actual funding from the federal government’s Operation Warp Speed has not been materialized yet. Citron Research, another short seller, had compared Inovio to scandal-ridden Theranos earlier this year and called it “one of the longest running and most blatant stock promotion schemes ever witnessed.” The stock has tanked more than 41% since hitting its all-time high on June 29th this year. INO has a short float of 31.56%, indicating that the stock has been highly shorted. The stock has regained momentum this week as the company is releasing insights to its Phase 1 trials in the next few weeks. It closed yesterday’s trading session at $18.52, gaining more than 461% year-to-date. According to the POWR Ratings, INO has an overall rating of “D.” It also has a grade of “C” for Peer Grade and Industry Rank, and an “F” for Trade Grade and Buy & Hold Grade. It’s ranked #140 out of 373 Biotech stocks. Want More Great Investing Ideas? 7 Best ETFs for the NEXT Bull Market Stock Market Outlook: Before & After the Election Chart of the Day- See the Stocks Ready to Breakout GSX shares were trading at $103.27 per share on Thursday afternoon, down $0.90 (-0.86%). Year-to-date, GSX has gained 372.42%, versus a 4.71% rise in the benchmark S&P 500 index during the same period."}]}