{"article": [{"url": "https://stocknews.com/news/chk-end-of-an-era-chesapeake-goes-belly-up/", "published": 1594123700.0, "headline": "End of an Era: Chesapeake Goes Belly Up", "body": "A period of industry consolidation Others are falling by the wayside- Cash is king in the oil patch as the business evolves The price of nearby crude oil futures rose to a high of $65.65 in early January. By April 20, it fell below zero for the first time in history. Natural gas futures have not traded above $3 per MMBtu on the nearby futures contract on NYMEX since January 2019. Even during periods of strength in the crude oil and natural gas markets, and while the stock market was making consistent record highs, shares of energy-related companies have lagged both the commodity and the equity markets. The phenomenon began long before the coronavirus caused the demand side of the fundamental equation for energy to evaporate in February and March 2020. It was only a matter of time before a parade of energy bankruptcies began in the United States. Low-interest rates caused many producing companies to take on significant levels of debt. The declines in oil and gas prices made servicing those loans impossible. Chesapeake Energy Corporation (CHK) traded at a split-adjusted $14,800 per share in 2008. Last week, the company sought Chapter 11 protection with the shares below the $12 level. CHK will not be the last energy company in the oil and gas arena to fade into obscurity. 9 \"BUY THE DIP\" Growth Stocks For 2020Chapter 11 ends an era On Saturday, June 27, Chesapeake Energy filed for bankruptcy. The company that had a market cap of $37 billion in 2008 was worth around $115 million on Friday, June 26. The late Aubrey McClendon, a legend in the oil and gas business, bought up leases and rights around the US as the fracking industry boomed. The debt accumulated by Chesapeake became a wall too high to climb. While the Trump administration considered a bailout of fossil fuel companies, opposition from environmental groups has made it impossible. The company cited low energy prices and the global pandemic, but the writing was on the wall. Chesapeake was already on the verge of bankruptcy before coronavirus struck. A period of industry consolidation The bankruptcy will likely cause problems in the pipeline business, as Chesapeake requested that the court move to cancel $311 million in contracts. Chesapeake became the largest US oil and gas producer to seek Chapter 11 protection in five years. CHK plans to operate six to eight drilling rigs for the next two years, about half of the fourteen active rigs they operated in the first quarter. The company that was a shale pioneer plans to walk away from contractual obligations with Energy Transfer, Boardwalk Pipelines, and a Crestwood Equity Partners and Consolidated Edison gas joint venture. The court battle over the contracts could cause financial ruin for some pipeline business. John Thieroff, an analyst at Moody’s Investor Service, said he expects other companies to fade into obscurity. He said, “There will no doubt be others to file for bankruptcy in the near term as the sector looks to get out from under the copious amount of debt it took on during the boom.” Others are falling by the wayside- Cash is king in the oil patch as the business evolves Chesapeake is the first significant shoe to drop in the oil patch, and there will be more. As I wrote last week, only the most influential oil companies will survive in the current environment for two reasons. First, energy production is a matter of national security in the US. While environmentalists look to rid the world of fossil fuels, it will take years to switch to alternative energy sources. The US government is not likely to hand control of the global energy markets back to OPEC, the Middle East, and other world producers. Second, in the long run, the strongest US companies like Chevron (CVX) and Exxon Mobile (XOM) are waiting to pick up production and logistical assets at bargain-basement prices. Even though the two leading oil companies have debt issues, the US government will not surrender its position in the energy markets by allowing them to go under. The November election in the US will determine the future of US energy policy. With the potential for bankruptcies mounting, expect the Trump administration to prevent the carnage in oil and gas from getting out of hand. We could see the leading companies that survive begin to thrive. Low asset prices and a recovery in oil and gas prices could make for a significant rebound during the second half of 2020. The virus remains the most significant challenge as it will determine if the demand side of the fundamental equation can make a comeback, which would provide some support for the shares of the leading oil companies as the sector consolidates. Want More Great Investing Ideas? 9 “BUY THE DIP” Growth Stocks for 2020 Is the Bull S#*t Rally FINALLY Over? 7 “Safe-Haven” Dividend Stocks for Turbulent Times Top 3 Investing Strategies for 2020 CHK shares were unchanged in premarket trading Tuesday. Year-to-date, CHK has declined -92.82%, versus a -0.48% rise in the benchmark S&P 500 index during the same period."}]}