{"article": [{"url": "https://stocknews.com/news/bynd-cag-beyond-meat-vs-conagra-brands-which-stock-is-a-better/", "published": 1602245300.0, "headline": "Beyond Meat vs. Conagra Brands: Which Stock is a Better Buy?", "body": "Beyond Meat, Inc. (BYND) and Conagra Brands, Inc. (CAG) are two food stocks, although they are very different. CAG is an old and storied brand with a stable business that pays above-average dividends, while BYND is a relatively new company. BYND’s stock has seen big gains, but there’s doubt about its ability to continue growing to justify its valuation. Both companies witnessed robust growth in demand for their products over the past few months. However, in terms of year-to-date price performance, BYND is the clear winner with 155.8% gains versus CAG’s 8.8%. Also, BYND’s six-month gains of 178.4% are significantly higher than CAG’s 19%. But which stock is the better buy now? Let’s find out. 7 Best ETFs for the NEXT Bull MarketBusiness Structure and Latest Movements BYND develops and distributes vegan substitutes for meat across the world. Its plant-based products are designed to replicate the three most consumed meat dishes – beef, pork, and poultry. The company recently launched breakfast sausages to its product pipeline. BYND announced the expansion of its Walmart distribution by adding its products to 2,400 more Walmart locations around the country, thereby tripling its sales. On September 8th, BYND partnered with Jiaxing Economic & Technological Development Zone to set up a production and distribution unit in China. It also launched an e-commerce site with 2-day shipping and doorstep delivery to boost accessibility across the country. CAG, on the other hand, manufactures both consumer foods and commercially packaged foods including meat, plant-based ingredients, and customized items. It recently started developing and distributing meat substitutes. Recent Financial Results BYND’s net revenues increased 69% year-over-year to $113.30 million in the second quarter ended June 2020. Its retail channel net revenue rose by 192% from the same period last year to $90.04 million. Gross profit increased by 48.5% to $33.70 million during this period. CAG also reported a profitable fiscal first quarter ended June 2020 with a 12.1% year-over-year increase in net sales to $2.70 billion. This growth can be attributed to the 15% year-over-year rise in organic net sales. EPS increased 86.1% from the year-ago value to $0.67. In terms of revenue growth, BYND is in an advantageous position here. Expected Financial Performance The market expects BYND’s revenues to grow 42.9% in the third quarter ended September 2020. Its EPS is expected to rise significantly in the current year compared to the negative year-ago value, and 376.9% next year. The market expects CAG’s revenues to increase by 5.7% in the fiscal second quarter ended in September 2020. Its EPS is expected to grow 10.1% in the current year, and 3.2% next year. Hence also, BYND has an edge over CAG. Profitability CAG’s trailing 12-month revenue is 28.29 times what BYND generates. CAG’s ROA of 5.6% compares favorably with BYND’s 0.5%. However, BYND is more profitable with a gross margin of 34.3% compared to CAG’s 24.7%. Valuation In terms of forwarding P/E, BYND is currently trading at 1925.52x, 122% more expensive than CAG’s 15.65x. BYND is also more expensive than CAG in terms of forward PEG (74.52x versus 3.61x) and price to sales (29.73x versus 1.60x). Though BYND is more expensive compared to CAG, it is worth paying this premium, as BYND’s earnings growth potential is significantly higher. POWR Ratings Both BYND and CAG are rated “Strong Buy” under our proprietary POWR Ratings system. Here’s how the four components of overall POWR Rating are graded for both BYND and CAGR. BYND has an “A” for Trade Grade, Buy & Hold Grade and Peer Grade, and “B” for Industry Rank. In the 27-stock Agriculture industry, BYND is currently ranked #2. CAG holds an “A” for Trade Grade, Buy & Hold Grade and Peer Grade, and “B” for Industry Rank. It is currently ranked #3 out of 58 stocks in the Food Makers industry. The Winner Both the stocks have delivered noteworthy performance during the pandemic owing to the underlying strength of their business models. Even though CAG is older and more established than BYND, BYND’s growth potential based on earnings and revenue outlook is much higher compared to CAG. So, BYND is a better buy now. Want More Great Investing Ideas? 7 Best ETFs for the NEXT Bull Market What is the Cure for Stock Market Volatility? Chart of the Day- See Christian Tharp’s Stocks Ready to Breakout BYND shares fell $0.38 (-0.19%) in after-hours trading Friday. Year-to-date, BYND has gained 157.86%, versus a 9.31% rise in the benchmark S&P 500 index during the same period."}]}