{"article": [{"url": "https://stocknews.com/news/shop-zm-se-twlo-4-stocks-with-insane-growth/", "published": 1599566900.0, "headline": "4 Stocks with INSANE Growth", "body": "In a low growth world with abundant liquidity, it’s not surprising that growth opportunities are priced at a premium. This was the case from 2009 to 2020 before the coronavirus, but it’s even more true in this era. Now, there’s less growth and more liquidity. As a result, high-growth stocks are outperforming even more. Not to mention that many of these companies have benefitted from the changes in the economy. Two of the fastest-growing sectors are e-commerce and cloud computing. The global e-commerce market alone is expected to witness a CAGR of 14.7% between 2020 to 2027. Similarly, the cloud computing market may witness a CAGR of 17.5% between 2020 to 2025. 7 Best ETFs for the NEXT Bull MarketStocks like Shopify, Inc (SHOP), Zoom Video Communications, Inc. (ZM), Sea Limited (SE), Twilio, Inc. (TWLO) are the fastest-growing stocks in the market and may have more upside. Shopify, Inc. (SHOP) SHOP is a platform that allows retailers and merchants to set up their stores. This platform can be used through brick-and-mortar stores, online, mobile, pop-up shops, and more. This year has been outstanding for the e-commerce platform due to the greater adoption of online shopping among consumers and temporary shutdowns of physical stores. SHOP’s stock price has climbed 155% so far this year, and it also became Canada’s most valuable company. In the second quarter of the year, the number of new sellers of the platform grew 71% while the gross merchandise volume improved 119% year-over-year. The company is currently taking steps in the fulfillment market and is expanding its distribution network in the US to store and ship products. SHOP’s revenue is estimated to grow by 64% in the current year and by 31.5% next year. The EPS of the company is expected to grow 108.3% per annum over the next five years. How does SHOP stack up for the POWR Ratings? A for Trade Grade A for Peer Grade B for Overall POWR Rating The stock is also ranked #1 out of 34 stocks on the Internet – Services industry. Zoom Video Communications, Inc. (ZM) ZM is a cloud services company that enables video communication for users worldwide. The company’s platform allows video meetings, voice, chat, and content sharing. Several users can tune in to a single video meeting from disparate locations and diverse locations. Zoom is one of the best performing companies so far in 2020 due to the increase in remote working and remote learning caused by the spread of the coronavirus. The stock has delivered year-to-date price returns of 460%. In the second quarter of 2020, the company added around 105,000 new users to its platform and new consumer subscriptions consisted of 81% of the company’s revenue growth. The company has recently announced that its platform will soon be integrated with Facebook Portal, Amazon Echo Show, and Google Nest Hub Max. ZM’s revenue is expected to grow by 286.1% this year and by 25.4% next year. The company’s EPS is also estimated to rise by 625.7% this year and 38.5% per annum over the next five years. ZM’s strong fundamentals are reflected in its POWR Ratings, it has a Buy rating with an A in Trade Grade and Peer Grade. Within the Technology – Services industry, it’s ranked #1 out of 52 stocks. Sea Limited (SE) SE is e-commerce, digital entertainment, and digital financial services company. The company operates the Garena gaming platform along with other eSports operations. This is another company that has benefitted from the pandemic due to an increased demand for online gaming and e-commerce. The stock has delivered year-to-date price returns of 266.8% In the second quarter, the company’s total adjusted revenue grew by 93.4% year-over-year. SE’s self-developed game called Free Fire managed to achieve a record of 100 million daily active users and it was the highest-grossing mobile game in Latin America and Southeast Asia. The company’s Sea Money, which is a local payment system, is geared to gain from the large untapped potential in the sector in South-East Asia. On the back of its e-commerce, digital entertainment, and fintech offerings, SE’s revenue is estimated to rise by 80.8% this year and by 38.5% next year. The company’s EPS is expected to grow by 49.8% next year. It’s no surprise that SE is rated a Buy in our POWR Ratings system, with a grade of A in Trade Grade and Industry Rank. In the 57-stock Internet industry, it is ranked #57. Twilio, Inc. (TWLO) TWLO is a cloud communications platform that allows users to collaborate through their pay-as-you-go service which is available internationally. Its offerings include Super Network, Programmable Communications Cloud, and Business Model for Investors. The company’s stock has delivered a stellar performance this year and it has made price gains of 152%. TWLO also delivered impressive second-quarter results. Its revenue increased by 46% year-over-year. The company has been selected as the communications provider for contact tracing initiatives in more than 28 cities, states, and universities as a part of the effort to fight the coronavirus. TWLO’s revenue is expected to grow by 40.8% this year and by 25.2% next year. The company’s EPS is also estimated to grow by 130% next year and 20.5% per annum over the next five years. TWLO’s strong fundamentals are reflected in its POWR Ratings, it has a Buy rating with an A in Trade Grade. Within the Software – SAAS industry, it’s ranked #1 out of 10 stocks. Want More Great Investing Ideas? 7 Best ETFs for the NEXT Bull Market Will Stocks Fall into Historical September Slump? 9 “BUY THE DIP” Growth Stocks for 2020 SHOP shares were trading at $937.31 per share on Tuesday afternoon, down $35.71 (-3.67%). Year-to-date, SHOP has gained 135.75%, versus a 5.48% rise in the benchmark S&P 500 index during the same period."}]}