{"article": [{"url": "https://stocknews.com/news/cgc-canopy-growth-expands-its-retail-network/", "published": 1599048500.0, "headline": "Canopy Growth Expands its Retail Network", "body": "One of the major challenges that large-cap Canadian cannabis companies have faced since legalization has been hitting revenue targets. Many companies have been struggling due to government regulation, especially in Ontario. Despite Ontario’s efforts to ease regulations and expedite store openings, unfortunately it’s not happening fast enough for companies to generate significant revenue. Companies have now turned to other provinces with a more supportive view on cannabis. Canopy Growth (CGC) recently announced that they plan to open 10 retail stores across Alberta under the Tokyo Smoke and Tweed names. This is a continuation of their current expansion across the country, and their first expansion into Alberta. Alberta remains one of the most supportive provinces for cannabis in Canada. There are currently over 400 stores in Alberta with a population just over 4 million people. Grant Caton, the General Manager for Canada at Canopy Growth, states, “With 10 new stores set to open and additional locations in the pipeline, we are thrilled to announce this milestone and excited to bring the Tokyo Smoke and Tweed guest experiences to Alberta for the first time. We’ve seen the value brick-and-mortar retail brings to our consumers – welcoming new guests to learn about cannabis and building relationships in new communities – and we’re excited to share our knowledge and industry leadership across the region.” 7 Best ETFs for the NEXT Bull MarketCGC’s expansion into Alberta will bring the total number of Tokyo Smoke and Tweed retail cannabis stores in Western Canada to 29. This new expansion will also increase CGC’s retail presence across Canada to 50, with more stores planned for the rest of 2020. Having a solid and diversified distribution network is essential for cannabis companies to generate revenues. The fact that CGC is adding 10 new stores is significant news as this marks a substantial increase in the number of stores they will have running. Investors should keep an eye out for further developments surrounding the Ontario cannabis market, as Ontario is the most populous province in Canada. I view this news as a great start for CGC to grow revenues, but remain cautious until the company operates over 100 stores across Canada. Want More Great Investing Ideas? 7 Best ETFs for the NEXT Bull Market Beware Stocks in September? 9 “BUY THE DIP” Growth Stocks for 2020 CGC shares were trading at $16.35 per share on Wednesday morning, down $0.06 (-0.37%). Year-to-date, CGC has declined -22.48%, versus a 11.28% rise in the benchmark S&P 500 index during the same period."}]}