{"article": [{"url": "https://stocknews.com/news/epr-ain-six-mcs-sq-ddog-net-four-stocks-to-sell-now/", "published": 1596197300.0, "headline": "Four Stocks to SELL Now", "body": "The stock market continues to undulate as the latest earnings reports are revealed. The arrival of a second economic stimulus check can temporarily buoy the market. Yet, some stocks are not worth your hard-earned money, no matter what type of fiscal stimulus the federal government implements. Our exclusive POWR Ratings system reviews stocks daily to identify those worthy of an upgrade or downgrade. The following stocks were recently downgraded: EPR Properties (EPR), Albany International (AIN), Six Flags Entertainment Corporation (SIX), and Marcus Corporation (MCS). EPR Properties (EPR) 9 \"BUY THE DIP\" Growth Stocks For 2020Now that video content is streamed directly into consumers’ homes, and the masses are reluctant to visit social spaces such as movie theaters, the likes of EPR are bound to suffer. EPR is in the business of buying and developing movie theaters, entertainment centers, and other properties meant for recreational purposes. This real estate trust certainly had a chance to succeed when the economy was firing on all cylinders, yet times have changed. It might take a year or more for the general public to trust social spaces such as movie theaters fully. This means the likes of EPR have the potential to go bankrupt. The POWR Ratings show EPR has F grades in its Trade and Buy & Hold POWR components along with D grades in its Peer and Industry Rank POWR Components. EPR’s price returns are quite ugly: a -55% price return across the past six months and a -56% price return across the previous year. The stock is down 55% year to date. Albany International (AIN) Paper, paperboard, and similar materials certainly serve a purpose in the modern-day industry, yet there are better areas to invest your money than the textile industry. Only so many customized paper machine fabrics and process belts are required by businesses that manufacture paper and paperboard. AIN makes these items. The POWR Ratings reveal AIN has F grades in each POWR Component except Peer Grade. The stock is ranked fourth out of five publicly traded companies in the Industrial – Textiles industry. Check out AIN’s price returns, and you will find a sea of red. AIN has a six-month price return of -27% and a one-year price return of -40%. Though AIN has a reasonable forward P/E ratio of 17.49, this is not a boom or bust growth stock akin to the Squares (SQ), DataDogs (DDOG), and Cloudflare’s (NET) of the world. Do your homework, and you will find a better place to invest your money than AIN. Six Flags Entertainment Corporation (SIX) Much has been made of the reopening of Disney theme parks. People are donning face coverings and attempting to social distance while enjoying Disney’s attractions. The media has glossed over the fact that Six Flags’ parks are also open for business. Check out Six Flags’ website, and you will find a disclaimer prominently positioned at the top stating park entrants run the risk of contracting COVID-19. All in all, SIX attendance is down 96% since the start of the coronavirus outbreak. Though SIX might not go bankrupt, there is a chance some of its operations in the United States, Mexico, France, Netherlands or Belgium will close within the next year or two due to dwindling attendance. SIX has F grades in both the Trade Grade and Buy & Hold Grade POWR components and D grades in Peer Grade and Industry Rank. Furthermore, SIX has slid down to a ranking of 11 out of 14 stocks in the Entertainment – Sport & Theme Parks category. SIX’s price returns are an overload of red with a -53% return over the past five years and a -65% return over the past three years. Marcus Corporation (MCS) Movie theaters, hotels, and resorts. These are some of the worst possible investments amidst the coronavirus pandemic. MCS operates businesses in each of these segments. MCS is ranked dead last out of 14 stocks in the Travel – Hotels/Resorts industry. MCS has F POWR Ratings across the board except for Industry Rank and Peer Grades, which have grades of D. In terms of price returns, MCS is down 50% price over the past six months and down 44% over the past three years. If MCS survives, it might take years for the stock to return to its pre-COVID trading price of $33. Want More Great Investing Ideas? 9 “BUY THE DIP” Growth Stocks for 2020 How HIGH Can This Tech Bubble Fly? 7 “Safe-Haven” Dividend Stocks for Turbulent Times EPR shares were trading at $30.22 per share on Friday morning, down $0.06 (-0.20%). Year-to-date, EPR has declined -55.45%, versus a 2.14% rise in the benchmark S&P 500 index during the same period."}]}