{"article": [{"url": "https://stocknews.com/news/cmg-dpz-wing-3-restaurant-stocks-that-should-survive-the-coronavirus-pandemic/", "published": 1593605300.0, "headline": "3 Restaurant Stocks That Should Survive the Coronavirus Pandemic", "body": "Restaurants have been one of the most adversely affected industries since the deadly outbreak of coronavirus. Businesses have taken a nosedive since the pandemic started, with people avoiding to eat at restaurants. Over 8 million restaurant employees have lost their jobs in the United States alone. The long lock down period dealt a massive blow to restaurants, as operators had to keep dine-in services closed. Although the hopes of restaurant operators have dimmed, there seems to be a light at the end of the tunnel. A few restaurants have adapted to the “new normal” by focusing on takeout and delivery options. The National Restaurant Association asked for a $240 billion recovery fund from the Treasury Department. If granted, this would allow restaurant owners to survive the pandemic and eventually recover their businesses. 9 \"BUY THE DIP\" Growth Stocks For 2020Even if there is a second wave of the virus, these three stocks could keep moving higher with a robust infrastructural setup of delivery and takeout services. Chipotle Mexican Grill (CMG): CMG recently added Grubhub as a new delivery partner. The company also works with DoorDash and UberEats. This should strengthen its business and attract more customers. CMG’s drive-through system “Chipotlanes” has been implemented in new locations to encourage takeout orders and abide by social distancing practices. Currently, the rewards program on the Chipotle app has over 11.5 million members. This is a testament to CMG’s ability to adapt. CMG has an overall Grade of A in the StockNews.com POWR Ratings., This indicates a Strong Buy. The POWR Ratings are focused on four components. One of these components is Peer Grade, which compares a security’s performance versus other stocks in its industry. CMG has a Peer Grade of A . Domino’s Pizza Inc. (DPZ): This pizza delivery company has introduced a car-side delivery service where the order is delivered directly to the customer in their car. DPZ also initiated a new contact less carryout option for online orders. This is designed for the safety of customers. When more and more people are abstaining from dining in restaurants, the company’s tech-driven takeout and delivery services could be a game-changer for the business. DPZ has a Strong Buy rating in our POWR Ratings. The stock ranks #2 out of 48 stocks in the Restaurant industry. The stock could have an upside of 7% based on the average analyst price target of $396. Wingstop Inc. (WING): Approximately 80% of WING’s sales were from delivery and takeout orders before Covid-19 hit the United States. That enabled WING to adapt smoothly into the social distancing situation we currently find ourselves in. The company was able to do this with the infrastructure already in place to handle delivery and takeout of their vast selection of chicken wings. WING just opened its first ghost kitchen in Dallas and aims to digitize 100% of its orders. A ghost kitchen is a professional food preparation and cooking facility set up to prepare delivery-only meals. WING has a Strong Buy rating in our POWR Ratings. It also has a Trade Grade of A. This represents the short-term bullish or bearishness of a stock. The stock is ranked #3 out of 48 stocks in the restaurant industry. Want More Great Investing Ideas? 9 “BUY THE DIP” Growth Stocks for 2020 Is the Bull S#*t Rally FINALLY Over? 7 “Safe-Haven” Dividend Stocks for Turbulent Times Top 3 Investing Strategies for 2020 CMG shares were trading at $1,068.36 per share on Wednesday afternoon, up $16.00 (+1.52%). Year-to-date, CMG has gained 27.62%, versus a -2.53% rise in the benchmark S&P 500 index during the same period."}]}