{"article": [{"url": "https://stocknews.com/news/gwph-can-gw-pharmaceuticals-continue-higher/", "published": 1594901300.0, "headline": "Can GW Pharmaceuticals Continue Higher?", "body": "Yesterday, GW Pharmaceuticals (GWPH) fell 3% after Stifel analyst Paul Matteis downgraded the company due to disappointing physician feedback regarding “off-label” use of the drug Epidiolex. Matteis cut his rating to hold after maintaining a buy rating for at least two years. He also cut his target price to $140 from $150. Matteis noted that the downgrade wasn’t a call on GW’s second-quarter results expected in early August. He stated that he believes the company will beat expectations as the impact of COVID-19 doesn’t seem as bad as projected. Matteis said, “Instead, what’s led to a change in our view is conservative physician expectations for Epidiolex use in ‘off-label’ refractory epilepsy, whereas we believe substantial uptake here is: 1) key to the bull case; and 2) necessary to meet or beat 2021-2025 consensus sales projections.” 7 Best ETFs for the NEXT Bull MarketGWPH is up over 40% for the past three months, while the Spinnaker Cannabis ETF (THCX) has climbed 22.5%. The stock has been outperforming the cannabis sector, but the question remains whether that will continue. Here are a few reasons why I believe that’s possible. First, I expect Epidiolex sales revenue to remain strong in North America and Europe. This should enable the company to fuel future growth initiatives and research moving forward. Profitability in the cannabis sector has been the biggest concern for investors over the past two years. As GWPH gets closer to profitability, it should provide support for the stock. GWPH should also benefit from new revenue streams as Epidiolex will be prescribed for the treatment of TSC in the 2nd half of the year. GWPH also recently announced that it is researching the use of Nabiximols in treating a range of spasticity conditions. Nabiximols, brand name Sativex, is a specific cannabis extract approved in 2010 as a botanical drug in the United Kingdom. Nabiximol is a combination of THC and CBD. It is sold as a mouth spray intended to alleviate neuropathic pain, spasticity, overactive bladder, and other symptoms related to multiple sclerosis. Phase 3 trials for the drug should start in the second half of 2020. Despite Paul Matteis’s downgrade, many analysts remain bullish on the stock. On June 30th Evercore ISI analyst Joshua Schimmer raised his rating to Outperform on GWPH and established a new price target of $275 based on the potential of Nabiximols. Want More Great Investing Ideas? 9 “BUY THE DIP” Growth Stocks for 2020 Newly REVISED 2020 Stock Market Outlook 7 “Safe-Haven” Dividend Stocks for Turbulent Times GWPH shares were trading at $135.95 per share on Thursday afternoon, up $0.40 (+0.30%). Year-to-date, GWPH has gained 30.02%, versus a 0.53% rise in the benchmark S&P 500 index during the same period."}]}