{"article": [{"url": "https://stocknews.com/news/jnj-mrk-nvo-3-pharmaceutical-stocks-to-buy-now-before-a-covid-19-vaccine/", "published": 1600776500.0, "headline": "3 Pharmaceutical Stocks to Buy Now, Before a COVID-19 Vaccine is Created", "body": "As the death toll in the United States hit the 200,000 mark with no early signs of relief, the nation, along with the rest of the world, is eagerly waiting for a vaccine or a treatment for the deadly coronavirus. Investors on the other hand are stacking up on the healthcare sector, which is quite evident from the premium valuation of the stocks that are working on either developing a vaccine or a medicine. According to a CNBC article, the United States has already invested billions in potential coronavirus vaccines, with the aim to provide at least 300 million doses of a vaccine by January 2021. According to experts, the global market for a coronavirus vaccine could be as much as $20 billion in 2021. As the front runners in the vaccine space are expected to capture the majority of this huge market if they succeed, the stocks of these companies are getting significant investor attention. The SPDR S&P Pharmaceuticals ETF (XPH) gained more than 35% from its March low. This forward-looking valuation could be based on the optimism of surrounding the availability of a vaccine next year and the vaccine maker’s significant revenue growth from it. With hefty valuations of pharmaceutical stocks at this point of time, investors should be careful and must consider the company’s product portfolio diversification before making an investment. 7 Best ETFs for the NEXT Bull MarketJohnson & Johnson (JNJ), Merck & Co, Inc. (MRK) and Novo Nordisk A/S (NVO) are frontrunners in discovering a vaccine and also have a strong product pipeline. Johnson and Johnson (JNJ) JNJ has been working toward the development of a possible vaccine candidate for which it has collaborated with various healthcare organizations, government organizations and regulators. On March 30th 2020 the company announced the identification of its lead COVID-19 vaccine candidate with two backups. JNJ has commenced Phase 1/2a first-in-human clinical trials of its Janssen COVID-19 vaccine candidate in the United States and Belgium. Once the vaccine is ready and it is declared effective, safe and authorized for distribution by the regulators, the company aims to provide global access to their Janssen COVID-19 vaccine candidate on a not-for-profit basis for emergency pandemic use. The company is also conducting clinical trials to develop therapies for COVID-19. The company reported a year-over-year decline in sales of 10.8% to $18.3 billion primarily due to the negative impact of the pandemic. While adjusted EPS of $1.67 declined 35.3% year-over-year, it surpassed the street estimate by 12.1%. While JNJ’s revenue and EPS estimate of $20.07 billion and $1.96 indicate a year-over-year decline of 3.2% and 7.5%, respectively. The company’s EPS is expected to grow 14.9% next year and at a rate of 5.1% per annum over the next five years. The stock has gained 21% since hitting its 52-week low in March. How does JNJ stack up for the POWR Ratings? A for Trade Grade A for Industry Rank A for Peer Grade A for Buy and Hold Grade. A for Overall POWR Ratings You can’t ask for better. The stock is also ranked #1 out of 232 stocks in the Medical-Pharmaceuticals industry. Merck & Co.Inc (MRK) MRK is one of the largest Pharmaceutical companies in terms of market capitalization. The drug maker specializes in providing medicines for cancer patients across the globe. The company is following a unique strategy in providing a solution for the COVID-19 vaccine. In June 2020, MRK acquired Austria-based vaccine-focused company Themis Bioscience, which is currently engaged in developing a vaccine for COVID-19. Themis Bioscience’s measles vector-based SARS-CoV-2 vaccine candidate is currently in pre-clinical development. The company is also collaborating with research nonprofit IAVI on a second vaccine that uses the same technology as its Ebola vaccine. MRK aims to start human trials for its first candidate this quarter and second candidate later this year. MRK’s second-quarter sales declined 8% year-over-year to $10.9 billion, reflecting the negative impact of covid-19. Excluding the impact from foreign exchange, sales declined 5%. Keytruda sales grew 29% to $3.4 billion. Excluding the impact of foreign exchange, sales grew 31%. The company reported EPS of $1.37, beating the consensus estimate by 31.7% and increasing 6% year-over-year. While MRK’s revenue and EPS estimates for the ongoing quarter of $12.16 billion and $1.43 indicate a decline of 1.9% and 5.3%, respectively, the company’s EPS is expected to grow 10.8% next year and at a rate of 6.3% per annum over the next five years. The stock has gained 16.5% since hitting its 52-week low in March. MRK’s strong fundamentals are reflected in its POWR Ratings, it has a “Buy” rating with an “A” in Trade Grade, Peer Grade and Industry Rank. Within the Medical-Pharmaceuticals industry, it’s ranked #2 out of 232 stocks. Novo Nordisk A/S ( NVO) This Danish drug maker NVO is researching the effectiveness of a new class of weight loss and diabetes control medicines to fight COVID-19. According to a Bloomberg article, “Initial analysis of electronic medical records shows that GLP-1 drugs, which help patients keep blood sugar levels in check, could be a “very meaningful therapy” in helping people with diabetes battle Covid-19, Novo Chief Scientific Officer Mads Krogsgaard Thomsen said in an interview.” NVO’s Ozempic for diabetes and Saxenda for obesity are GLP-1 drugs. The potential benefit of these drugs for Covid-19 could drive the company’s sales in the upcoming quarters. NVO’s second-quarter 2020 EPS came in at $0.67, missing the street estimate by 5.6%. However, in the first six months of 2020, the company’s operating profit increased by 9% year-over-year in Danish kroner and 8% at constant exchange rates (CER). NVO’s revenue and EPS estimates for the quarter ended September 2020 is of $5.03 billion and $0.72, respectively, indicating an increase of 10.8% and 12.5% on a year-over-year basis. The company’s EPS is expected to grow 10.1% next year and at a rate of 9.6% per annum over the next five years. The stock has gained more than 40% since hitting its 52-week low in March. NVO’s strong fundamentals are reflected in its POWR Ratings, it has a “Strong Buy” rating with an “A” in Trade Grade, Buy and Hold Grade, Peer Grade and Industry Rank. Within the Medical-Pharmaceuticals industry, it’s ranked #5 out of 232 stocks. Want More Great Investing Ideas? 7 Best ETFs for the NEXT Bull Market Stock Market Outlook: Before & After the Election Chart of the Day- See the Stocks Ready to Breakout JNJ shares were trading at $144.21 per share on Tuesday afternoon, down $0.89 (-0.61%). Year-to-date, JNJ has gained 0.85%, versus a 3.68% rise in the benchmark S&P 500 index during the same period."}]}