{"article": [{"url": "https://stocknews.com/news/dell-aph-arw-acia-4-strong-buy-tech-stocks-to-buy-now-for-2021/", "published": 1600690100.0, "headline": "4 \"Strong Buy\" Tech Stocks to Buy Now for 2021", "body": "The year 2020 was supposed to be the year of the 5G revolution, but the COVID-19 pandemic delayed the transition. This has created a perfect opportunity for investors to consider buying electronics and communication stocks that would benefit from the 5G, data center, internet of things (IoT), and electric vehicle trend. Both small and large technology companies have already been benefiting from the accelerated pace of digital transformation the pandemic triggered. The changing business models and launch of new products to help industries and individuals avoid the virus should also keep technology companies thriving next year. In addition to benefiting from the technology revolution, Dell Technologies Inc (DELL), Amphenol Corporation (APH), Arrow Electronics, Inc. (ARW), and Acacia Communications, Inc. (ACIA) are poised to benefit from other profit generating initiatives. 7 Best ETFs for the NEXT Bull MarketDell Technologies Inc (DELL) DELL is a consumer and enterprise brand known for its PCs and servers. Fighting its way through industry consolidation, changing technology trends, and competition from giants like HP (HPQ) and IBM (IBM), DELL has become a leader in the server market and ranks third in the PC market behind HPQ and Lenovo. Like many of its peers, DELL is undergoing restructuring, but cost-cutting is not the goal. The company is planning to spin-off its software arm VMware (VMW), which came under its umbrella with the $67 billion EMC merger in 2016. This spin-off would generate significant value for shareholders. DELL would use the proceeds from the spin-off to pay off a portion of its massive $43 billion debt and improve its credit rating. VMware’s market valuation of $59.3 billion is higher than DELL’s $49.1 billion, which means investors value the software business more. DELL stock has surged 27% year-to-date, outperforming stocks of HPQ and IBM, which fell 7.8% and 6.8%, respectively. DELL stock surged primarily on the news of the VMWare spin-off, which would likely happen next year. DELL is rated a “Strong Buy” in our POWR Ratings system, reflecting its prospects and recent market performance. It has grades of “A” for Trade Grade, Peer Grade, and Buy & Hold Grade. The stock is also ranked #1 in the 28-stock Technology – Hardware industry. Amphenol Corporation (APH) While DELL surged on the back of its spin-off plan, the electric vehicle (EV) wave helped APH surge. APH provides connectors and sensors for cars, from which it earns 19% of its revenue. It also serves the broadband communication, commercial aerospace, industrial, information technology and data communication, military, mobile device, and mobile network markets. But it is the EV trend that has made APH a highly-watched stock. APH stock has completely recovered from its March sell-off and is set to make new highs as the EV market surges. S&P Global Market Intelligence (MI) expects worldwide EV sales to surge threefold to 6.2 million by 2024. This growth will be driven by policy support, stricter carbon emission rules, and the declining price of electricity storage units or batteries. However, the pandemic has slowed this growth, as the ailing economy has reduced EV sales in China and the United States. However, EV sales are rising in Europe as countries like France and Germany tighten CO2 emission rules and increase policy support. MI forecasts European passenger EV sales to rise 45% year-over-year to just over 500,000 units in 2020, offsetting declines in China and the United States. However, global EV demand is expected to pick up in 2022. Pure-play EV company Tesla (TSLA) has been riding the EV wave. The stock surged a whopping 428% YTD. As a result, many investors looking to benefit from the EV growth wave are investing in component suppliers. APH should benefit from this wave as more connector and sensor content is used per EV. The stock has surged 60% from its March low and is set to make new highs next year as EV sales recover. The street estimate for APH’s revenue for the next year indicates a year-over-year increase of 8.9% APH is rated a “Strong Buy” in our POWR Ratings system, with a grade of “A” in Trade Grade, Peer Grade, and Buy & Hold Grade, and a “B” in Industry Rank. It is also the #1 ranked stock in the 37-stock Technology – Electronics industry. Arrow Electronics, Inc. (ARW) ARW saw a significant recovery from its March sell-off. The company provides electronic components, such as semiconductors, switches, connectors, and capacitors; as well as enterprise computing solutions such as data-center, cloud, security, analytics, training, and engineering support. It provides its products and services to original equipment manufacturers (OEMs), value-added resellers, service providers, and contract manufacturers. The pandemic impacted demand for enterprise and consumer hardware and the lockdown disrupted manufacturing. However, the move to remote working and digitization drove demand for cloud services. ARW’s broad exposure to different elements of the electronics supply chain is helping it mitigate the impact of the pandemic. ARW’s second-quarter revenue fell 8% year-over-year to $6.6 billion as a decline in PC, server, mobile, and networking components were partially offset by growth in software, cloud, and security solutions. Norwegian telecom provider Telenor (OTCMKTS:TELNY) will use ARW’s services for a multi-cloud brokerage platform. Microsoft (MSFT) will use ARW’s IoT and engineering services for its startups’ community. The market expects ARW’s revenue to increase 5.3% next year. ARW stock is expected to keep surging next year as the economy reopens and demand for hardware recovers. ARW is rated a “Strong Buy” in our POWR Rating system. It has grades of “A” for Trade Grade, Peer Grade, and Buy & Hold Grade, and a “B” for Industry Rank. In the 37-stock Technology – Electronics industry, it is ranked #2. Acacia Communications, Inc. (ACIA) Another stock that caught investors’ attention is ACIA, a provider of high-speed coherent optical interconnect products. These coherent products are used in long-haul, metro, and inter-data center markets. The stock came into the limelight when the networking giant Cisco (CSCO) agreed to acquire ACIA for $2.6 billion, or $70 a share, in June 2019. Hence, when the stock dipped 9% in the March sell-off, it quickly recovered to $67 in April. CSCO is buying ACIA to boost its optical networking portfolio in the era of multi-cloud, which needs higher bandwidth. CSCO will integrate ACIA’s coherent optics technology with its intent-based networking products to help customers increase capacity on their existing fiber infrastructure, while reducing cost. The CSCO-ACIA acquisition is still pending regulatory approvals as the pandemic has slowed the process. ACIA should be on investors’ radar until the merger is completed. The market expects ACIA’s revenue to grow 17.9% this year and 14.6% next year. It’s no surprise that ACIA is rated a “Strong Buy” in our POWR Rating system. It also has a grade of “A” for Trade Grade, Peer Grade, and Buy & Hold Grade. In the 53-stock Technology – Communication/Networking industry, it is ranked #1. Want More Great Investing Ideas? 7 Best ETFs for the NEXT Bull Market Stock Market Outlook: Before & After the Election Chart of the Day- See the Stocks Ready to Breakout DELL shares were trading at $64.31 per share on Monday morning, down $2.06 (-3.10%). Year-to-date, DELL has gained 25.14%, versus a 1.09% rise in the benchmark S&P 500 index during the same period."}]}