{"article": [{"url": "https://stocknews.com/news/wpm-fsm-paas-sil-three-silver-miners-to-buy-on-dips/", "published": 1599739700.0, "headline": "Three Silver Miners To Buy On Dips", "body": "It’s been a tough stretch since August for the Silver Miners Index (SIL) as many of the constituents have fallen more than 20% from their highs. This was a shock to many investors chasing these stocks into earnings, as the higher silver price helped many companies report their best quarter in years. The issue was that many miners were already up 200% in 2 months into earnings, and they had no hope of reacting positively to earnings reports, with this being the most crowded trade heading into August. Fortunately, while some of the index’s laggards have seen some damage to their charts from the recent correction, the leading names in the group continue to hold up relatively well. 9 \"BUY THE DIP\" Growth Stocks For 2020For investors looking to outperform the Silver Miners Index and the metal, it’s the leaders that should be parked in one’s portfolio. In this article, we’ll examine three names with industry-leading growth that have seen accumulation in the past couple of months. (Source: Pan American Silver Company Presentation) While the three silver names presented in this article don’t have a ton in common with different production profiles and differing business models, they share one key trait that is one of the best predictors of strong share-price returns in the future: exponential earnings growth. The three names that share this characteristic are Pan American Silver (PAAS), Wheaton Precious Metals (WPM), and Fortuna Silver Mines (FSM), with the median annual EPS growth rate for the three in FY2021 being 143%. Let’s take a closer look at the three miners below: Beginning with Wheaton Precious metals, the company has one of the strongest earnings trends in the sector and is one of the largest royalty & streaming companies worldwide. The company generates its profits by financing mines ahead of time and then taking a portion of that mine’s production indefinitely. This not only provides a relatively quick payback on investment, but it also offers massive leverage both to the metals price and further discoveries at the mine that push the mine’s life past its initial expectations. The company’s key investments in massive mines like Penasquito, Antamina, and Salobo has provided an enormous boost to earnings, with WPM on track to see an earnings breakout year in FY2020. Earnings breakouts are extremely bullish developments, and they occur when a company sees annual EPS hit a new all-time high after several years of consolidation. (Source: YCharts.com, Author’s Chart) As the FY2020 estimates show, Wheaton Precious Metals is on track to put up 89% growth in annual EPS this year ($1.06 vs. $0.56), with yearly EPS expected to hit a new high. This surge in annual EPS is being driven by margin expansion due to higher metals prices and steady production growth, with many mines ramping up to benefit from the silver price’s strength. If we look ahead to FY2021, this growth is expected to continue, with estimates currently sitting at $1.38, translating to 30% growth year-over-year. The top-performing stocks consistently grow annual EPS by 20% or more each year, and WPM is now one of the top-100 growth stocks on the US Market based on margin expansion and earnings growth. Given that WPM is now in this group, I would expect institutions to support the stock and add to their positions on weakness. Therefore, while pullbacks are possible as silver works off its recent overbought condition, I would expect any sharp dips to provide buying opportunities. The second name in the list is Pan American Silver, one of the largest primary silver producers worldwide. Like WPM, PAAS has an exceptional earnings trend and is also expected to see an earnings breakout this year. This is despite the fact that Pan American had to contend with reduced operations in Q2 due to COVID-19, which makes this earnings breakout even more impressive. As we can see below, FY2020 annual EPS estimates are currently sitting at $0.78, which would mark a new 8-year high in annual EPS for the stock, and 59% growth year-over-year. However, earnings growth is expected to accelerate materially into FY2021 with the shutdowns no longer a headwind, with annual EPS estimates currently sitting at $1.90. Assuming PAAS manages to meet these estimates, this would translate to 143% growth year-over-year after lapping a year of strong double-digit growth. These are incredible growth metrics, and they also earn PAAS a seat among the Top-100 growth stocks in the US Market. (Source: YCharts.com, Author’s Chart) While some investors that like to use trailing P/E ratios might think that Pan American is expensive as it’s trading at 70x its FY2019 earnings of $0.49, it’s important to point out that this metric is obsolete for companies growing earnings at a compound annual growth rate of over 40%. While it’s true that PAAS might look expensive at above 70x FY2019 earnings, it’s much less expensive when you consider it’s set to earn $2.44 in FY2022. In fact, the stock is trading at 14.3x FY2022 earnings while paying a dividend yield. There are few if any companies available in the market currently with a compound annual EPS growth rate above 40% that are trading at 14.3x FY2022 earnings and less than 20x next year’s earnings, so while PAAS has had a strong run, there is still value here. However, to bake in a margin of safety, I plan to add exposure only on dips to the $32.90 level or lower. (Source: TC2000.com) The last name on the list is a more obscure name that’s more of a turnaround play, but the stock has one of the best technical pictures in the sector. Fortuna Silver Mines is a name that I’ve avoided for years due to delays at its Lindero Project in Argentina, a mine that’s expected to produce over 100,000 ounces of gold per year at industry-leading costs below $700/oz. As the chart above shows, investors are quite excited about adding a gold component to the Fortuna Silver story as the stock had put in a bullish outside year and is set to make a new all-time high following a 10-year base. This is an incredibly bullish development, and it’s because Lindero is finally ready to pour gold after two years of delays and cost over-runs. While turnaround plays can be riskier, I believe the underperformance has left the stock undervalued, given that many have written off the stock out of disgust for its poor performance. (Source: YCharts.com, Author’s Chart) If we look at the earnings trend, we’re also set to see an earnings breakout here as well, though the breakout is expected to come in FY2021. Based on current estimates, FSM will grow annual EPS by 660% next year ($0.76 vs. $0.10), which will break earnings out of the current downtrend it’s in currently. It’s important to note that the decline in earnings the past few years is due to lower silver prices, higher capital expenditures related to construction, and sub-par operational performance. However, the story going forward is an industry-leading gold project that should massively increase metal production and higher silver prices, which will more than offset the only satisfactory operating performance at the company’s two silver mines. If FSM can meet current estimates, the stock is dirt cheap at $6.95 per share, given that it’s trading at less than 10x next year’s earnings with a triple-digit growth rate. While there’s no guarantee that silver correction is over, I believe these three names should outperform both the metal and the Silver Miners Index given their exceptional fundamentals. Therefore, for investors looking for exposure to the sector, I see these three names as the best way to play the industry. I am currently long two names on the list from lower levels, and I may look to add a position in WPM if we see a deeper correction over the coming weeks. Disclosure: I am long PAAS, FSM Disclaimer: Taylor Dart is not a Registered Investment Advisor or Financial Planner. This writing is for informational purposes only. It does not constitute an offer to sell, a solicitation to buy, or a recommendation regarding any securities transaction. The information contained in this writing should not be construed as financial or investment advice on any subject matter. Taylor Dart expressly disclaims all liability in respect to actions taken based on any or all of the information on this writing. Want More Great Investing Ideas? 7 Best ETFs for the NEXT Bull Market Will Stocks Fall into Historical September Slump? 9 “BUY THE DIP” Growth Stocks for 2020"}]}