{"article": [{"url": "https://stocknews.com/news/plug-tsla-wkhs-kndi-electric-vehicles-get-a-jolt-from-bidens-energy-plan/", "published": 1596715700.0, "headline": "Electric Vehicles Get a JOLT From Biden's Energy Plan", "body": "Electric vehicle stocks have been one of the strongest industries in the market in 2020. Now, they’re setting up for another breakout. Two catalysts are driving the sector’s outperformance. Electric car sales are growing globally at a 40% year-over-year pace, while overall car sales are growing 3% annually. By 2030, the IEA estimates that electric cars will account for 20% of all cars sold. Joe Biden and Senate Democrats are currently favored to win in November. He’s proposed an aggressive energy plan which offers enhanced tax credits for electric cars, the addition of 500,000 public charging stations, and incentives for owners of older cars to replace them with newer, more efficient vehicles. Some of the biggest winners of 2020 hail from this sector due to these factors. Overall, the KraneShares Electric Vehicle and Mobility ETF (KARS) is up 21% year-to-date, while the S&P 500 is up a mere 2% over the same timeframe. 7 \"SAFE HAVEN\" Dividend Stocks for Turbulent TimesOver the next decade, electric vehicles’ growth will only accelerate as battery technology leads to longer ranges, more charging stations become available, consumer preference for green products continues to grow, higher scale pushes down costs, and public and private pressure to cut carbon emissions continues increasing. All of these catalysts are combining to revolutionize the future of transportation. Investors have a chance to get in on the early innings of this trend. Plug Power (PLUG), Tesla (TSLA), Workhorse Group (WKHS), and Kandi Technologies (KNDI) are four stocks that will benefit as electric vehicles displace gas-powered cars. Plug Power (PLUG) PLUG is up 176% YTD. On a longer-term chart, the stock looks to be close to breaking out following a strong earnings report which has lifted shares 16% higher. PLUG makes hydrogen-powered forklifts. The company has benefitted from companies’ desire to go green and reduce emissions. Under a Biden administration, companies that buy PLUG’s products will receive a tax credit which could further accelerate growth. Compared to traditional forklifts, PLUG’s have shorter charging times, take up less space due to fuel cells being smaller and lighter than batteries or engines, and have longer life cycles. Due to these factors, PLUG’s total revenue has grown by 200% over the last four years. There’s still more room to grow as PLUG has less than 1% of the global $30 billion forklift market. Currently, the company is projecting 40% annual revenue growth through 2024. It expects to become profitable by 2023, as increased scale leads to lower costs. There’s more upside for PLUG beyond the forklift market, as its fuel cell technology could be licensed to other companies for use in passenger vehicles, commercial transportation, and delivery vehicles. Tesla (TSLA) Electric vehicle sales are expected to grow 36% in 2020 despite a 20% drop in total auto sales due to the coronavirus. Currently, TSLA is the market leader in electric vehicle sales. In the US, it accounted for 60% of sales, globally it has a 16% market share. There’s room for further gains, as the company is building new factories in Europe and Asia. Its struggles over the past couple of years have been in meeting the demand for its products. Its stellar gains have been due to its success in increasing its production, while not sacrificing quality. The company also has a variety of products for different market segments that are remarkably cost-competitive with existing cars. It also has further growth areas, as it’s working on producing electric trucks. On top of these factors, Tesla has a first-mover advantage when it comes to battery technology and autonomous driving. The company’s strong stock market performance makes sense when you consider that it’s the market leader in a market that is expected to grow by 15x over the next decade. TSLA is rated a Buy in the POWR Ratings. It has a “B” for Trade Grade and Industry Rank. Among Auto & Vehicle Manufacturers, it’s ranked #7 out of 27. Workhorse Group (WKHS) WKHS’ stock is consolidating its gains following its nearly 600% from the beginning of June. The company is closer to an early-stage startup, as it has a lot of promise but little in terms of revenue. WKHS is attempting to develop a combination of an autonomous, electric-powered delivery van with a drone attached to handle packages and bring them to doors. If successful, this product has the potential to be a gamechanger for companies like FedEx (FDX) and UPS (UPS). It’s already struck a deal with Ryder (R) to test prototypes. WKHS is attempting to solve the “last mile” problem which is the bane of existence for companies like Amazon (AMZN) and Walmart (WMT). It’s estimated that delivering every package costs $1 when accounting for the driver’s wages and vehicle and fuel costs. Given the projected growth of e-commerce, WKHS has a massive opportunity, if it can figure out the technology. Kandi Technologies (KNDI) KNDI’s stock is up 120% year-to-date. It’s a Chinese EV maker and parts supplier. It is best known for being a pioneer in battery-swapping. One issue with electric cars is the time it takes to charge batteries. KNDI has set up stations, where owners can simply swap their depleted battery for a fully-charged one which saves time and can effectively extend the range of any car. It can also swap the batteries in less time than it takes a typical car to fill up with gas. The Chinese government is standardizing batteries in electric vehicles to lower the cost of electric cars since batteries would be rented rather than owned. The goal is to make the process uniform across all makes and models. The Chinese government’s resolve to lower emission and reduce pollution levels is a huge tailwind for KNDI. The government offers generous subsidies and an expedited registration process which can take months for gas-powered cars. It’s already become the world’s largest market with sales of 2 million vehicles expected in 2020. However, due to this growth and subsidies, it’s also become intensely competitive with over 500 manufacturers registering to make EVs. For suppliers like KNDI, this is a good situation, as it will result in increased demand for its parts and battery-swapping stations. Want More Great Investing Ideas? 9 “BUY THE DIP” Growth Stocks for 2020 How to Trade THIS Stock Bubble? 7 “Safe-Haven” Dividend Stocks for Turbulent Times PLUG shares fell $0.03 (-0.28%) in after-hours trading Thursday. Year-to-date, PLUG has gained 239.56%, versus a 4.94% rise in the benchmark S&P 500 index during the same period."}]}