{"article": [{"url": "https://stocknews.com/news/alle-chart-of-the-day-allegion-alle/", "published": 1597234100.0, "headline": "Chart of the Day: Allegion (ALLE)", "body": "A descending triangle has formed in the chart of Allegion (ALLE) and a trade is likely setting up soon. Allegion (ALLE) is a global security products company with a portfolio of leading brands, including Schlage, Von Duprin, and LCN. The company will benefit from strength in the electronic products business and a large customer base. ALLE’s cost-cutting measures, dividend payments, and share repurchases are beneficial to shareholders. Take a look at the 1-year chart ALLE below with added notations: 9 \"BUY THE DIP\" Growth Stocks For 2020 Chart of ALLE provided by TradingView Over the two months, ALLE has hit the $95 support (green) on two separate occasions, while also starting a trend line of resistance (red). Together, these two lines have formed a descending triangle on ALLE. Eventually, the stock will have to break either the trendline resistance or the $95 support. A trader could buy ALLE on a break above the trendline with expectation of a breakout, or short the stock if it were to fall below the $95 support with the expectation of a breakdown. Want to Discover More Great Trades? I have explored virtually every flavor of technical analysis and chart pattern known to mankind. The sad fact is that the vast majority of them don’t work at all. That is why I recently put together this presentation to help investors focus on the only 5 chart patterns that matter…the ones that lead to the most timely and profitable stock trades. Click below to learn these patterns and how to quickly find the 5 to 7 best trades today. 5 WINNING Stock Chart Patterns Have a good trading day! Good luck! Christian Tharp, CMT @cmtstockcoach ALLE shares were trading at $104.33 per share on Wednesday morning, up $0.17 (+0.16%). Year-to-date, ALLE has declined -15.72%, versus a 5.86% rise in the benchmark S&P 500 index during the same period."}]}