{"article": [{"url": "https://stocknews.com/news/spy-inx-dia-iwm-qqq-is-this-really-a-bull-market/", "published": 1593864500.0, "headline": "Is This “REALLY” a Bull Market?", "body": "(This is an updated version of one of the most widely read market commentaries from Steve Reitmeister. Here is a link to the original version from 5/29/20.) Day by day it is getting harder to call this a bear market rally. Not only is the size of the rally impressive, but also the length of time since bottom was found in late March has to be acknowledged. Even recently stocks tried to break below 3,000 twice only to find ample support climbing higher once again. This is causing even the most stubborn bears, like yours truly, to contemplate the possibility that they are wrong. And perhaps should consider joining the rally. 7 \"SAFE HAVEN\" Dividend Stocks for Turbulent TimesSo let me take it from the top to quickly explain why I have been in the bear camp all this time. This will be followed by a thorough contemplation of the other possibilities of what is going on. Then we will end with my recommended investing game plan for how to go forward at this time. Why So Bearish Steve? The central thesis of all this is that we are in the midst of the worst economic event since the Great Depression. Yes, even worse than the Financial Crisis and Great Recession of 2008/2009 as economic readings are much lower. And job loss much greater. And the pain of that job loss and lower income has barely begun. So it’s hard to contemplate stock prices this high, this soon when the economy and corporate earnings will be so low, for so long. Then add on top that there is no historical V pattern for a bear market. Typically bottom is a long period of retesting bottom or even finding lower bottoms over a 6-18 month period before the next healthy bull market emerges. And yet with all that sound logic in place, and the vast majority of experts still bearish, here we are with stock prices 43% above the late March lows and only 8% below the all time highs. At first it was easy to say bear market rally. But the longer it stays in place, and the higher it goes, that argument is starting to lose steam. So that gets us back around to the possibility that I could be wrong. That this is not a bear market rally. Instead it could be the next bull market that should compel me to a much more aggressively long portfolio. As stated in the introduction, I will try and review this possibility with as little ego involved as possible. That is because I want the next step for my readers to be as profitable as possible. And if that means admitting failure and shedding the bear suit…then that that is what I will do. So with that disclaimer fully in place I can say without reservation that the economy will continue to be horrible for the rest of the year. And likely that pain extends into 2021 and possibility beyond depending on how long the Coronavirus continues to be a daily threat. Meaning the odds of me being wrong on the economic outlook is incredibly low. Like truly single digits % possibility that I misunderstood those signals. Unfortunately it is also true that the stock market can disconnect from the harsh economic realities and continue higher. That happens all the time when you appreciate how the pendulum swings from fear to greed. And at each extreme the market disconnects from the fundamentals. In fact, this same idea is at the root of all equity bubbles. And as we saw with the tech bubble of the late 1990’s and the real estate bubble leading up to the financial crisis in 2008…bubbles can last for a surprisingly long time. Back to the main point. I want to review the main possibilities of what happens from here and how that would change my investing strategy from where we stand today. Most Likely Scenario = Bear Market Rally Remember that I have an economics background while most money managers and computer/quant traders do not. And so my reading of the economic chain of events is better than most. Sorry if that sounds like a brag. Not meant to be. Just a statement of my strengths…which actually right now is my weakness. And the reason it’s a weakness is that I look at the business cycle (boom and bust) as the True North of investing which makes current price action a distant second consideration. NORMALLY that serves me well. But in this case it clearly led me to miss out on some nice upside. Even if that upward move proves to be misguided or temporary in the end. So for me, there is no change to the bleak economic outlook that will not blow away any time soon. And that is true EVEN if everyone on the planet got a vaccine in July. That’s because it is no longer just about the virus. It has already pushed over into being an economic crisis that has a trajectory all its own. And again, for me that path is down for quite some time. (job loss > lower spending > lower corporate profits > more cost cutting like more job loss and the vicious cycle continues lower). All of this SHOULD become evident to others in time and stock prices head lower. More a matter of “when”, than “if”. However, this return to sanity…where the trend of the economy, corporate profits and stock prices are connected, should come to life at some stage. If that happens soon, then you already know my prescribed strategy for this outcome…which is the hedged portfolio strategy that is already in place for the Reitmeister Total Return newsletter. (More on that at the end of the article). But yes, this is all tenuous because if the stocks breakout above the current range, like above 3,2000, then I will be compelled to join the rally. The strategy for that is best described after all 3 scenarios are laid out. 2nd Most Likely Scenario = Long Term Trading Range as Bridge to Future Bull I contemplated this scenario in my 5/15 article on StockNews.com: Is This a Bull or Bear Market? The nutshell of this argument is that bulls and bears may wrestle this out for a long time and we play in a pretty wide trading range. We all know the bearish argument. But the key to this range is what the bulls are thinking. Let me share that with you now: “Whereas bulls will say they are not blind to the current problems. Instead they are just looking out to a longer term horizon where the economy gets back on track. Add in unprecedented Fed and Government stimulus and they see it propping up share values.” Read that last paragraph again because there is a lot of meat to this concept. Because indeed that may be the main theme behind the recent rally and why it disconnected from obvious economic realities. And these investors may not care how long they have to wait for a true economic rebound because with rates this low, then investments in stocks may still be better than cash or bonds which pay virtually nothing. I believe there is a limit to the upside in this range. Maybe just the recent topping around 3,200. And then we trade up and down for a long time in the range until it is crystal clear how we emerge. Meaning if economy getting back on track, then keep heading higher. But if it is true that the economy does not spring back to life as expected, probably because of severe job loss and lower spending, then stocks will probably head much lower. The way you play this range depends on what you think happens AFTER it is over. For me that continues to be scenario #1 and return of the bear market. Which is why I am hanging out in the range with a hedged portfolio. You would think that would mean breaking even. But not if constructed correctly. And not if you understand that this recent range has not really been truly bullish or Risk On. Meaning that the only stocks really going up are the FAANG and those that most benefited recently from the coronavirus societal trends (like Zoom). So below the surface, you see Risk Off activity that is allowing my hedge to float higher as the over market goes sideways. Again, more on that at the end of today’s article. 3rd Most Likely Scenario = This Bubble Grows Larger, Then POP! Here we have a continuation of the theme that the market remains disconnected from the dismal economic realities. And given that so many people are still bearish, then you could explode above 3,200 with all the FOMO players getting on board. With bubbles you never know how high…or high long they will go. But typically it is an extreme level beyond what you could imagine. For now let’s say 3,500…heck it could be 4,000. That would be near a crazy high PE of over 30 given the newly lowered earnings estimates. The strategy for currently bearish folks like me would be to hold your nose and ratchet up to 100% long in the most Risk On names to mop up the most upside gains (airlines, oil, restaurants, hotels, banks etc). But here is the real key… SLEEP WITH ONE EYE OPEN waiting for the bubble to burst. Meaning you hold your nose joining the rally that you never really believed had any merit to begin with. This will keep you sober enough to be one of the first investors out the door when the bubble bursts and prepared for the sizable downside that ensues. Whereas most others will be asleep at the wheel drunken with “irrational exuberance” leading to heavy losses. Trading Strategy Now we wait for the cards to be dealt out. Right now I am focused on scenario #1 where I expect this rally and trading range not to hold with a return of the bear market. That is exactly the environment my hedged portfolio strategy is built to thrive in. In total there are 4 uniquely situated stocks + 3 inverse ETFs + 2 gold positions. Yet even with the recent trading range environment this portfolio is producing the right results as it has not really been a true Risk On environment. So since June 16th, when the S&P has basically been break even, the Reitmeister Total Return hedged portfolio has risen +3.5%. So imagine just how well it would do when the bear returns and stocks retest the previous lows. I know its crazy out there. And I am trying my best to help investors make sense and profit from the situation. The best way for me to do that is give you 30 days access to the Reitmeister Total Return. This is my newsletter service where I share frequent commentaries on the market outlook, trading strategy, and yes, a portfolio of hand selected stocks and ETFs to produce profits whether we have a bull…a bear…or anywhere in between. And right now I continue to strongly believe bear makes a lot more sense than bull. Yet prepared to shift strategies if we start slipping into bubble territory. Just click the link below to see 4 stocks, 3 inverse ETFs and 2 gold positions in the portfolio now that should rise as the market sinks back into bear territory. And then receive all the future commentary and trades as we find bottom on this move as the next and “lasting” bull market emerges. About Reitmeister Total Return newsletter & 30 Day Trial Wishing you a world of investment success! Steve Reitmeister …but everyone calls me Reity (pronounced “Righty”) CEO, Stock News Network and Editor, Reitmeister Total Return SPY shares closed at $312.23 on Friday, up $1.71 (+0.55%). Year-to-date, SPY has declined -1.99%, versus a % rise in the benchmark S&P 500 index during the same period."}]}