{"article": [{"url": "https://stocknews.com/news/tsm-intc-dxy-the-u-s-dollar-halted-the-tech-rally/", "published": 1596024500.0, "headline": "The U.S. Dollar Halted the Tech Rally", "body": "Recently, technology stock shares went down in value. The stocks didn’t drop that much, but they had done so well for so long, even despite the pandemic, that it was a bit of a shock to Wall Street. In particular, a few major tech stocks got hit the hardest. I’m speaking of the Big Five: Apple, Amazon, Google, Microsoft, and Facebook. Not only are these stocks very large, but they’ve done very well. As a result, the Big Five have had a massive impact on the stock market in general, and the tech market in particular. In fact, thanks to the tech falloff, the Nasdaq Composite had its first back-to-back losses in 48 trading days. That’s a remarkable run. 7 \"SAFE HAVEN\" Dividend Stocks for Turbulent Times So, what caused the tech stocks to fall? There are many reasons for the move, but I want to highlight one of the major reasons… the U.S. dollar. That’s right, we can blame the greenback. At Barron’s, Ben Levisohn makes this point well. The truth is that the dollar hasn’t been doing that well compared to other currencies. On top of that, it looks like the Federal Reserve is going to keep interest rates on the floor for some time. That means that less capital will be flowing to dollar-dominated assets, which has a major impact on how people invest. Dollar Index (DXY) First, let me say I don’t believe anything is wrong with the dollar. The recent change is due to the natural flow of the market. Few investors even think of the dollar until it becomes an issue, but investors need to understand how the dynamic works. Just recently, the Dollar Index (DXY) fell to 94.36—its lowest level in two years. Why? Well, part of the reason is that the euro finally rallied , thanks to the big stimulus planned by the European Union. The EU is famously fractious, so it was impressive to see the member nations come together and agree on a program. Of course, a weak dollar isn’t all bad, especially for U.S. consumers. Sure, a lower greenback makes it more expensive to buy foreign-made stuff, but it’s good news for stuff made here. Domestic manufactures love a weak dollar. Investors need to understand that a lower dollar does a few important things. For example, it raises inflation expectations. This is important to consumer spending patterns. A lower dollar tends to boost cyclical stocks and it makes foreign goods more expensive. Oftentimes the dollar can make a move that has little to do with the Federal Reserve and prospects for interest rates. Bear in mind that these are all generalities. The market sometimes has a mind of its own. As Sir Isaac Newton said: “I can calculate the movement of stars, but not the madness of men”—that’s certainly true, and it’s a golden rule on Wall Street. Speaking of gold: along with the weaker dollar, we’ve seen the price for gold rally to an all-time high. Earlier this week, the precious metal finally took out its high from nine years ago. In Barron’s, Levisohn writes: “A weaker dollar is something that President Donald Trump had wanted Fed Chair Jerome Powell to deliver, but the coronavirus did so instead. Just don’t expect Powell to say too much.” I think that assessment is correct. A weak dollar has the potential to lead investors into a major rotation. Emerging markets, for example, have badly lagged the U.S. market. The weak dollar could also boost European stocks. Taiwan Semiconductor (TSM) & Intel (INTC) To counter the effects of the weak dollar, investors should consider shares of companies based outside the U.S. In particular, you can consider foreign tech companies. One of our favorites in this regard has been on fire of late. Shares of Taiwan Semiconductor (TSM) jumped more than 22% over two days thanks to the news that Intel (INTC) faces production delays. Shares of Taiwan Semiconductor are now up more than 85% since we first added them to our Growth Stock Advisor portfolio. The company is the world’s largest chip foundry. Related: Trade of the Week: INTC This has been a very good time for Taiwan Semiconductor. Earlier this month, the company beat Wall Street’s earnings estimates and guided high, earning 78 cents per share on sales of $10.38 billion. That’s up from 41 cent per share on sales of $7.75 billion one year ago. Check out this recent chart: I’m expecting more good news from the company. For the current quarter, Taiwan Semiconductor expects revenue to range between $11.2 billion and $11.5 billion. This is a big increase over last year’s Q3 sales of $9.4 billion. Lora Ho Taiwan Semiconductor’s CFO, said: “We expect our business to be supported by strong demand for our industry-leading 5 nanometer and 7 nanometer technologies, driven by 5G smartphones, HPC and [Internet of Things] applications.” If you’re looking to diversify your portfolio with a tech stock based outside the U.S., Taiwan Semiconductor is an excellent choice. Want more great investing ideas? Download free the “10-Step Options Trading Checklist” you need before making a trade. The Virtual Trading Pit Is Open: Trade Set-ups, Training, New Trading Ideas How to Try Out Options Without Risking a Penny TSM shares fell $0.03 (-0.04%) in after-hours trading Wednesday. Year-to-date, TSM has gained 44.20%, versus a 2.05% rise in the benchmark S&P 500 index during the same period."}]}