{"article": [{"url": "https://stocknews.com/news/pld-dlr-are-dre-4-strong-buy-reits-with-more-than-2-dividend-yield/", "published": 1598962100.0, "headline": "4 \"Strong Buy\" REITs With More Than 2% Dividend Yield", "body": "The United States experienced the longest ever (128 months) bull market until the coronavirus-induced crash in March 2020. GDP contracted 32.9% in the April-June quarter, indicating the onset of a recession. With the health care crisis affecting the usual way businesses operate, the unemployment rate stood at 10.2% at the end of July 2020, according to the U.S. Bureau of labor Statistics. However, the stock market has continued to outperform the economy since the beginning of the pandemic, raising questions about the sustainability of this rally. Along with the concerns over the market’s ability to keep moving higher when there is not significant improvement on the economic front yet, a low interest rate environment makes it reasonable to bet on stocks that pay high dividends. And REITs (real estate investment trusts) are ideal for dividend income, as these companies are required by law to distribute 90% of their taxable earnings to common stockholders as dividends. Prologis, Inc. (PLD), Digital Realty Trust, Inc. (DLR), Duke Realty Corporation (DRE), and Alexandria Real Estate Equities (ARE) are some of the best performing REITs that have an impressive dividend payout history, and currently offer more than 2% yield. 7 \"SAFE HAVEN\" Dividend Stocks for Turbulent TimesPrologis, Inc. (PLD) PLD is involved in the logistics real estate business, and primarily operates in markets which have high barriers and high growth potential. It operates through two main segments, Real Estate Operations and Strategic Capital. PLD leases logistics facilities for businesses operating in two main categories – business to business and retail/ online fulfillment. It has a considerable stake in properties and development projects in 19 countries. With e-commerce businesses experiencing tailwinds amid the pandemic, PLD reported record promotional income in the second quarter that ended in June 2020. Total revenues increased 60.2% year-over-year to $1.26 billion. Core FFO attributable to shareholders increased 68.5% from the year-ago value to $853 million, while AFFO attributable to shareholders increased 38.5% from the same period last year to $822 million. Adjusted EBITDA rose 34.9% to $1.11 billion. Apart from impressive FFO, PLD is known as a consistent dividend paying stock for the last 7 years. It currently pays an annual dividend of $2.32, which yields 2.28% based on the current price. PLD has continually increased its dividend payouts every year since 2013. Despite the pandemic putting a damper on the business operations in early March, PLD increased its dividend 9.2% quarter-over-quarter to $0.58, and has managed to sustain it ever since. With the gradual revival of consumer demand and budding e-commerce industry, the demand for logistics REITs are expected to rise in the near future. The consensus revenue estimate of $952.26 million for the third quarter ending September 2020 indicates a 33.2% improvement year-over-year. Though the consensus FFO estimate for the ongoing quarter indicates a slight decline, PLD beat the street FFO estimates in each of the trailing four quarters. PLD hit its 52-week low of $59.82 in March, but has gained more than 75% since then. The stock hit its 52-week high of $106.73 in July. How does PLD stack up for the POWR Ratings? A for trade Grade A for Buy & Hold Grade B for Industry Rank A for Overall POWR Rating. You can’t ask for better. It is also ranked #1 out of 21 stocks in the REITs- Industrial industry. Digital Realty Trust, Inc. (DLR) DLR is a data center REIT providing data center, colocation and interconnection, and cloud technology solutions to customers in the American sub-continent, EMEA, and Asia Pacific regions. It operates across multiple sectors such as technology, manufacturing and energy and healthcare, finance. The technology industry witnessed a robust increase in demand, as technology is essential for working and learning from home. As such, data center REITs have gained significance during this healthcare crisis. DLR reported impressive earnings in the second quarter that ended in June 2020, consistent with the industry performance. Total operating revenues increased 20.5% year-over-year to $992 million. Operating income rose 52.7% from the year-ago value to $152.81 million. FFO increased 24.2% from the same period last year to $414.53 million. AFFO rose 27.5% year-over-year to $419.02 million. DLR free cash flow balance has grown at a CAGR of 470.4% over the last 5.75 years, which is higher than 98.2% of the current dividend paying stocks in the StockNews.com universe. Such a strong liquidity position allows DLR to sustain its dividend payouts for an extended period. DLR pays an annual dividend of $4.48, yielding 2.88% on its prevailing market price. It has consistently increased its dividend payouts every year since 2013. With multiple technological advancements, and the highly anticipated arrival of the 5G network, DLR’s growth momentum is expected to drive its revenues in the upcoming quarters. The consensus revenue estimate of $977.30 million for the third quarter ending September 2020 indicates a 21.2% rise year-over-year. DLR’s FFO is expected to grow 16.6% per annum over the next five years. DLR has gained more than 55% since hitting its 52-week low of $105 in March. The stock hit its 52-week high of $165.49 in July. DLR’s is rated a Strong Buy in our POWR Ratings system, consistent with its sound business model and huge potential for growth in the upcoming months. It also has a grade of A for Trade Grade, Buy & Hold Grade, and Industry Rank. In the 6-stock REITs- Data Centers industry, DLR is ranked #2. Alexandria Real Estate Equities (ARE) ARE leases office space to companies operating in the life sciences and technology industry. It also engages in the development of urban cluster campuses and ecosystems across North America. ARE leases under-construction and pre-constructions lands for development, as well as renovates operating properties. As the onset of the coronavirus pandemic has brought the pharmaceutical and life sciences industry under the limelight with respect to development of a vaccine, the demand for private spaces for accurate testing and clinical trials have increased. Over 80% of ARE’s existing life science tenants are engaged in the covid-19 vaccine development. ARE’s revenues increased 16.9% year-over-year to $437 million in the second quarter that ended in June 2020. Net income grew 196.9% from the year-ago value to $226.60 million, while FFO attributable to common stockholders grew 16.7% to $225 million. ARE’s strong liquidity position worth $4.2 billion (as of June 30th, 2020) ensures sustained dividend payouts every quarter. It has zero debt maturing until 2023, ensuring higher cash availability to meet its dividend requirements. ARE pays a $4.24 dividend annually to its shareholders, which yields 2.52% on its current price. ARE has a consistent dividend payout history since 2013. As most life sciences companies are actively partaking in the race to develop a COVID vaccine or a treatment, with substantial help from the federal and state governments, the demand for life sciences REITs are expected to rise in the near future. As such, sell-side analysts expect ARE’s revenues to increase 17.2% year-over-year to $343.58 million for the third quarter ending September 2020. The consensus FFO estimate of $0.622 indicates a significant rise from the same period last year. ARE has gained more than 60% since hitting its 52-week low of $109.22 in March. The stock hit its 52-week high of $177.70 in August. ARE’s strong fundamentals and potential growth prospects are reflected in its POWR Ratings. It has a Strong Buy rating with a grade of A in Trade Grade, Buy & Hold Grade, and Peer Grade. It is also ranked #1 out of 15 stocks in the REITs – Office industry. Duke Realty Corporation (DRE) DRE is a self-managed REIT specializing in bulk industrial distribution centers and medical office real estates. It operates in three segments — ownership, lease and rent, and estate management services. It has a Baa1 rating from Moody’s Investor Service, and BBB+ rating from S&P Financial services LLC. With COVID-19 creating a healthcare crisis in the United States and worldwide, bulk distribution of emergency medicine has risen rapidly over the past couple of months. As a result, DRE’s rental and related revenues increased 6.2% year-over-year to $2.26 million in the second quarter that ended in June 2020. DRE pays an annual dividend of $0.94 per share, yielding 2.44% based on the current price. It is one of the most stable stocks in terms of price in the StockNews.com universe, as its shares are less volatile than 94.12% of the dividend paying stocks. DRE’s free cash flow balance has a CAGR of 40.91%, which is higher than 87.82% of the other dividend stocks. Such a strong liquidity position has allowed it to sustain its dividend payouts consistently for the last 7 years. DRE’s FFO is expected to grow 65% per annum over the next five years. DRE has gained more than 60% since hitting its 52-week low of 425.19 in March. The stock hit its 52-week high of $40.84 in July. It’s no surprise that DRE is rated a Strong Buy in our POWR Ratings system, with a grade of A in Trade Grade and Buy & Hold Grade, and a B in Industry Rank. In the 21-stock REITs – Industrial industry, DRE is ranked #2. Want More Great Investing Ideas? 7 Best ETFs for the NEXT Bull Market Beware Stocks in September? 9 “BUY THE DIP” Growth Stocks for 2020 PLD shares were trading at $101.50 per share on Tuesday afternoon, down $0.36 (-0.35%). Year-to-date, PLD has gained 15.52%, versus a 10.68% rise in the benchmark S&P 500 index during the same period."}]}