{"article": [{"url": "https://stocknews.com/news/amzn-aapl-nflx-fb-googl-which-faang-stock-is-up-the-most-in-2020/", "published": 1596542900.0, "headline": "Which FAANG Stock is UP THE MOST in 2020?", "body": "The acronym ‘FAANG’ stands for Facebook (FB), Amazon (AMZN), Apple (AAPL), Netflix (NFLX), and Google (GOOGL). Over the last decade, the FAANG stocks have accounted for a large portion of the market’s gains and the economy’s growth. During the market crash in March, there were concerns that these stocks’ bullish trends would reverse due to a drop in consumer spending and marketing budgets. 9 \"BUY THE DIP\" Growth Stocks For 2020However, for most stocks in this group, the “stay-at-home” economy led to an acceleration in their trajectories. Due to the coronavirus, more aspects of people’s lives are shifting online, and the FAANG companies are the biggest beneficiaries. FAANG stocks have consistently met investors’ lofty expectations by delivering above-average sales and profit growth while maintaining juicy margins. Most of the FAANG stocks reported strong second-quarter results, which propelled them to further gains. Google was the only exception, as its stock posted a slight decline in revenue. The FAANG stocks have been the stock market’s superstars on a short and long-term basis. Read below to find out who has seen the most gains year-to-date. Amazon.com, Inc. (AMZN) Among FAANG stocks, AMZN is the biggest winner with a 70% gain in 2020. It has gained significance due to the pandemic and resultant lockdowns, as demand for e-commerce and cloud computing increased substantially. Even though AMZN spent over $4 billion in expenses related to coronavirus, the company managed to deliver a profit of $5.2 billion for the second quarter which is approximately double the year-ago number. In addition to e-commerce, AMZN is also a global leader in the cloud-computing space due to its Amazon Web Services platform which witnessed a growth of 29% year-over-year. For the quarter ended June 2020, AMZN witnessed net sales growth of 40%. Moreover, the company surpassed the street EPS estimate by 605.5% for the quarter. It’s no surprise that AMZN is rated “Strong Buy” in our POWR Ratings system. It also has an “A” for Trade Grade, Buy & Hold Grade, and Industry Rank. In the 54-stocks Internet industry, it is ranked #1. Netflix, Inc. (NFLX) As more people are spending more time at home and staring at screens, NFLX added 10.1 million new subscribers to its platform in the second quarter. So far this year, NFLX has added more than $100 million worth of series and movies in the pre-production and development stages. The original content offered by the platform remains a large draw for subscribers. NFLX has delivered year-to-date price returns of around 57% and was one of the first stocks to make new highs following the market crash. For the quarter ended June 2020, NFLX reported revenues of $61 million, up 24.5% from the same period last year. It is estimated that the company will witness a year-over-year revenue increase of 21.3% next quarter. It’s no surprise that NFLX is rated “Buy” in our POWR Ratings system. It also has an “A” for Industry Rank. In the 54-stock Internet industry, it is ranked #19. Apple, Inc. (AAPL) AAPL is expected to launch the iPhone 12 sometime this October. No significant delay in the new iPhone’s launch despite the supply-chain constraints placed by the coronavirus is a good indicator of AAPL’s business and chops in navigating a difficult environment. Moreover, according to a Forbes report, AAPL may also launch the cheapest Macbook to date. This could bring an entire new segment of customers into the Apple ecosystem like its success with the iPhone SE. AAPL is up 49% year to date, and more than 100% since the market crash. It has also recently announced the results for its quarter ended June 2020. Revenue for the quarter rose 11% and EPS increased 18% year over year. AAPL’s earnings surprise history is impressive as well with the stock beating consensus EPS estimates in each of the trailing four quarters. How does AAPL stack up for the POWR Ratings? A for Trade Grade A for Buy & Hold Grade A for Peer Grade A for Industry Rank A for Overall POWR Rating You can’t ask for better. The stock is also ranked #1 out of 28 stocks in the Technology – Hardware industry. Facebook, Inc. (FB) FB witnessed a 12% year-over-year rise in Daily Active Users, which signals continuing dominance of the social media market. The company is also getting ready to launch a competitor — called Instagram Reels — to massively popular Chinese video app TikTok. This move could further entrench Facebook and thwart another upstart, competitor. FB’s stock has delivered year-to-date price returns of 22%. For the quarter ended June 2020, FB reported a growth in total revenue of 11% year over year. The net income of the company also grew by 98%. The earnings surprise history for FB looks pretty good, as the company beat the street EPS estimates in three of the trailing four quarters. FB’s strong fundamentals are reflected in its POWR Ratings, it has a “Strong Buy” rating with an “A” in Trade Grade and Buy & Hold Grade and Industry Rank. Within the Internet group, it’s ranked #3 out of 54 stocks. Alphabet, Inc. (GOOGL) GOOGL has recently announced the Pixel 5 and the Pixel 4A smartphones. The added 5G capabilities of the Pixel 5 and Pixel 4A could be a game-changer and an important upgrade cycle for the company. The company has also borrowed $10 billion from the corporate debt market at its lowest-ever cost. GOOGL has a year-to-date price return of approximately 10%, making it the laggard of the group. Two important sources of revenue for Google are small businesses and the travel industry, both of which have had to cut ad spend over the past, few months due to the coronavirus. For the quarter ended in June 2020, the company witnessed a year-over-year drop in revenue for the first time. However, the company still managed to deliver a positive earnings surprise of 21.5%. GOOGL’s strong fundamentals are reflected in its POWR Ratings, it has a “Strong Buy” rating with an “A” in Trade Grade and Buy & Hold Grade and Industry Rank. Within the Internet group, it’s ranked #2 out of 54 stocks. Want More Great Investing Ideas? 9 “BUY THE DIP” Growth Stocks for 2020 How HIGH Can This Tech Bubble Fly? 7 “Safe-Haven” Dividend Stocks for Turbulent Times AMZN shares fell $5.83 (-0.19%) in after-hours trading Tuesday. Year-to-date, AMZN has gained 69.86%, versus a 3.60% rise in the benchmark S&P 500 index during the same period."}]}