{"article": [{"url": "https://stocknews.com/news/zg-docu-z-buy-the-dip-on-these-2-tech-stocks/", "published": 1599566900.0, "headline": "BUY the DIP on These 2 Tech Stocks", "body": "It’s been a volatile week for investors in the tech space as the Nasdaq-100 Index (QQQ) fell more than 10% from its highs in just two days, with the correction taking a bite out of several market leaders. Fortunately, for investors that were taking profits into the rally and harvesting cash, this massive correction could end up being an excellent buying opportunity once the dust does settle. However, the key is navigating through the rubble to find the best names that still have a long-term runway for growth. Two names stand out as leaders in their respective industries, with both names growing market share and producing exponential sales growth. Therefore, investors should keep them at the top of their shopping lists going forward. 7 Best ETFs for the NEXT Bull Market (Source: TC2000.com) While DocuSign (DOCU) and Zillow Group (ZG) have little in common from a product & service, they do share one common character trait of the best-performing stocks in the market: double-digit sales growth. Both companies are currently ranked in the Top-100 stocks on the US Market for both sales growth and future earnings growth, and both companies have a dominant product in a growing industry. For DocuSign, the company’s revolutionary Esignature has transformed the way agreements are signed worldwide and has seen increased traction with the move towards social distancing due to COVID-19. For Zillow Group, it is the company’s recent foray into the Homes category. The company’s vision is that its new ‘Offers’ will speed up the lengthy home buying and selling process and make it much more convenient. Let’s take a closer look at both companies below: Beginning with Zillow, the company has recently taken a bold approach, attempting to disrupt one of the world’s largest industries: real estate. The company’s new Zillow Offers is the “HOV Lane” to buying and selling homes for consumers, with a cash offer for your home in as little as 24 hours. This not only saves time and money related to staging and fixing up a house and getting it ready to list, but it also makes moving more flexible, as you’re able to choose your closing date. While some might think that Zillow’s fees it charges (6% on average) are high, they are much less significant when one factor in real estate fees, staging fees, and the cost to pay final mortgage payments before moving out. Thus far, the service is gaining traction, with a gross profit of $23 million or $16,000~ per home. While this doesn’t seem like much, it’s exceptional for a company that just entered a new market, and gross profit should increase over time as the company benefits from economies of scale and learnings in the sector. (Source: Company Presentation) If we look at the company’s earnings trend below, it’s much less attractive than the typical growth stock, but there’s a reason for this. Zillow was previously focused on becoming the #1 brand in the real estate advertising market, connecting potential buyers with agents, lenders, and landlords. The company has amassed over 200 million monthly unique users on its platform and has decided to use its profits in this business to move into a much larger opportunity: home transactions. This segment has an exponentially larger TAM than its previous TAM, and Zillow has sacrificed profits to make this leap. Therefore, while we see net losses per share in FY-2019, FY-2020, and FY-2021 based on estimates, it’s crucial to put in context why this is occurring. The good news is that FY2022 estimates are projecting an annual EPS of $0.40, suggesting that the company is well on its path to moving back to positive annual earnings per share. If we couple this move towards positive earnings with the company’s trailing-twelve-month average sales growth of 112%, Zillow is on its way to becoming a powerhouse if this bet pays off. (Source: YCharts.com, Author’s Chart) Thus far, the market seems to like the shift, as Zillow soared to new all-time highs following the Q2 results on well above-average volume. This is a very bullish development as stocks coming out of their primary IPO bases often see a new uptrend that lasts at least 9 months and up to 24 months in most cases. Given that we’re in the second month of this breakout and the new highs were coupled with massive volume, I would expect this breakout to hold. Therefore, for investors looking for an investment in a market leader looking to steal market share from an antiquated industry with minimal disruption to date, I believe any pullbacks towards the $70.00 level on Zillow would provide a low-risk entry point. (Source: TC2000.com) Moving over to DocuSign, the company needs no introduction, as the enterprise software company is a top-performing stock since the March lows with a 200% return year-to-date. DocuSign saw a massive acceleration in sales growth in the most recent quarter with 45% sales growth, up 600 basis points sequentially from fiscal Q1 2021. This strong sales growth, coupled with industry-leading annual EPS growth, is a recipe for massive winners, with the best-performing stocks over the past half-century having 25% sales growth and 50% annual EPS growth. Based on FY2021 estimates, DocuSign is set to grow annual EPS by 90% ($0.59 vs. $0.31), and this is lapping a year of 240% growth last year. These are incredible growth metrics and suggest that this is likely still early innings for this software leader. (Source: YCharts.com, Author’s Chart) If we take a look at FY2022 estimates, they are projecting that DocuSign will maintain its 50% plus annual EPS growth rate, meaning that the deceleration is not material in the slightest. Therefore, while some value investors might be scratching their heads at the current trailing P/E ratio above 400 for DocuSign, the stock looks much less expensive when we factor in that it’s expected to earn close to $1.00 next year. (Source: TC2000.com) As the chart below shows, DocuSign saw significant distribution last week and sold off sharply on its Q2 2021 earnings report. However, this is not surprising, given that DocuSign had a run-up in a near parabolic fashion into the report. Fortunately, while this pullback has been violent, it’s done no real technical damage, and a further pullback to the stock’s weekly moving average (white line) would provide a low-risk buying opportunity. As we can see above, this white line has been strong support since this rally began in Q3 of last year, and buyers stepped in here immediately during the March bear market. Therefore, I would expect buyers to show up again near the $164.00 level where this moving average resides. While I sold out my full position in DOCU last week above $275.00 as the stock was getting too frothy into earnings, I would be more than willing to repurchase it on any dip below $164.00. While several names saw considerable technical damage last week, DOCU and ZG continue to remain in healthy uptrends, and last week’s correction was merely much-needed profit-taking for these two stocks. Given that DOCU and ZG both have industry-leading sales growth and dominant positions in their industries, I believe we are still in the early to mid-innings of their growth cycles. Therefore, if this market weakness continues, we should see buy-the-dip opportunities in both names going forward. For now, I’m in no rush to buy back these two names after exiting them last week, but I would get quite interested at below $70.00 on ZG and below $164.00 on DOCU. Disclaimer: Taylor Dart is not a Registered Investment Advisor or Financial Planner. This writing is for informational purposes only. It does not constitute an offer to sell, a solicitation to buy, or a recommendation regarding any securities transaction. The information contained in this writing should not be construed as financial or investment advice on any subject matter. Taylor Dart expressly disclaims all liability in respect to actions taken based on any or all of the information on this writing. Want More Great Investing Ideas? 7 Best ETFs for the NEXT Bull Market Beware Stocks in September? 9 “BUY THE DIP” Growth Stocks for 2020 ZG shares were trading at $83.72 per share on Tuesday morning, up $0.28 (+0.34%). Year-to-date, ZG has gained 83.03%, versus a 5.68% rise in the benchmark S&P 500 index during the same period."}]}