{"article": [{"url": "https://stocknews.com/news/wsm-tsco-cdns-brk-a-3-buffet-inspired-stocks-that-will-continue-to-rally/", "published": 1597925300.0, "headline": "3 Buffet \"Inspired\" Stocks That Will Continue to Rally", "body": "Warren Buffet is not only one of the most well-known investors; he is also widely considered the most successful investor of all-time. As of this month, his estimated net worth is $78.9 billion. That’s larger than the market cap of 400 companies in the S&P 500. Over the past forty years, his company Berkshire Hathaway (BRK.A) has outperformed the S&P 500, 81,327% to 2,657%. Many investors like to follow his lead and invest in companies he purchases. Another strategy that has also proven to yield positive results is investing in stocks using his strategies. According to Validea, a strategy that follows Buffett’s ideals has returned 269% since 2003. It outperformed the market by 51.0%. Validea uses an investment strategy outlined in the book Buffettology, written by Buffett’s ex-daughter-in-law, Mary Buffet. It’s a book I own myself and have read many times. Unfortunately, Mr. Buffet has yet to write about his investing strategy, so this is the closest we can get to peek inside the mind of one of the greatest investors of all time. I set up a stock screen based on the criteria laid out in the book. The screener looks for stocks that have a 10-year track record of generally increasing EPS, long-term debt not more than five times annual earnings, average ROE over the past ten years of at least 15%, average ROIC over the last ten years of at least 12%, and finally, an earnings yield higher than the long term Treasury yield. I then filtered the results by stocks that are rated a Strong Buy in our POWER Ratings system to find stocks trending upwards: Williams-Sonoma (WSM), Tractor Supply Co (TSCO), and Cadence Design Systems (CDNS). 7 \"SAFE HAVEN\" Dividend Stocks for Turbulent TimesWilliams-Sonoma (WSM) WSM, which has a wide retail and direct-to-consumer presence, is a leader in the $117 billion home furnishings industry. The company operates stores under different brand names. The namesake Williams-Sonoma has 219 stores that offer high-end cooking essentials, and Pottery Barn, with 205 stores, provides casual home accessories. Other brands include Pottery Barn Kids and PBteen. West Elm is an emerging concept store for young professionals, and Rejuvenation offers lighting and house parts. WSM is one of the largest e-commerce retailers in the U.S. The company has a history of gaining market share through its robust e-commerce websites, direct mail catalogs, and retail stores. The company also generates revenue through shipping fees received for the delivery of consumer merchandise. The firm has a strong earnings surprise history, surpassing consensus estimates in all the trailing ten quarters. WSM is focused on enhancing customer experience through technology innovation and operational improvement. The company has driven brand awareness by shifting its advertising towards social media and cross-branding initiatives. WSM had $861 million in cash at the end of April, which provides the company liquidity to navigate the current COVID environment. The stock is a Buffet inspired selection as it has generally improved EPS and revenues over the last ten years and has a return on equity of 27.8%. WSM also has an earnings yield of 4.5%. The earnings yield is a company’s twelve-month EPS divided by its current market price. WSM is rated a Strong Buy in our POWER Ratings system. It holds grades of A in every component that make up the POWER Ratings. The company, which is the #8 ranked stock in the Home Improvement & Goods industry, is currently up over 29% year to date. Keep an eye out on August 26th after the market closes for WSM’s latest financial results. Tractor Supply Co (TSCO) TSCO is the largest operator of retail farm and ranch stores in the United States. It targets recreational farmers and ranchers and has almost no exposure to commercial and industrial farm operations. The company currently operates 1,881 stores in 49 states. TSCO also operates Petsense stores that carry pet food and supplies. Most stores are located outside urban areas and in rural communities. In the second quarter of 2020, the company posted strong earnings and revenue. Both figures surpassed consensus estimates. Revenue growth was driven by a comparable store sales increase of 30.5%. The growth was backed by strength in demand for spring and summer seasonal products and growth in everyday merchandise. Net income benefited from operating margin growth and lower SG&A expenses. TSCO has kept its stores and e-commerce business open for consumers to buy their everyday essentials throughout the pandemic. Due to changing consumer trends, the company has been focused on integrating its physical and digital operations to offer consumers seamless shopping experience. TSCO is focusing on growth initiatives such as expanding store base and incorporating technological advancements to drive traffic and revenue. TSCO sports an earnings yield of 3.8%, a very high return on equity of 40.6% and a return on invested capital of 15.3%. The company has been steadily increasing its EPS, revenue, and free cash flow over the past ten years. TSCO is rated a Strong Buy by our POWR Ratings. It has a grade of A for Trade Grade and Buy & Hold Grade, and a B for Peer Grade and Industry Rank. It is ranked #3 in the Specialty Retailers industry. The stock is currently up 63% year to date. Cadence Design Systems (CDNS) CDNS was founded in 1988 after the merger between ECAD and SDA Systems. The company is an electronic design automation firm specializing in developing software, hardware, and intellectual property that automates the design and verification of integrated circuits or larger chip systems. The company’s tools have been relied on by semiconductor companies, but changing consumer preferences have led to a shift towards emerging technology such as the Internet of Things (IoT), artificial intelligence, autonomous vehicles, and cloud computing. The company’s growth is dependent on its expanding product portfolio and frequent product launches. CDNS sees strong demand for its software, in particular, its verification and digital design products. The demand is coming from customers that provide datacenter servers, networking products, and smartphones. The firm continues to invest in these products to address the growing needs of semiconductor companies. Increased spending on emerging technology should drive significant growth over the long term. CDNS is also focused on developing a presence in the aerospace and defense market. It has established partnerships with Northrop Grumman (NOC) and GE Aviation to expand its systems business. Aside from 2012, CDNS has grown its EPS over the past ten years and has an earnings yield of 3.3%. The company has a return on equity of 45% and an ROIC of 44.5%. Long term debt is only $346 million. CDNS is rated a Strong Buy our POWR Ratings system. It holds straight As in every POWR component and is the #5 rated stock in the Technology-Hardware industry. Want More Great Investing Ideas? The Best of StockNews 2 Step Process to Sell @ Market Top in September 9 “BUY THE DIP” Growth Stocks for 2020 WSM shares were unchanged in after-hours trading Thursday. Year-to-date, WSM has gained 32.48%, versus a 6.18% rise in the benchmark S&P 500 index during the same period."}]}