{"article": [{"url": "https://stocknews.com/news/iipr-innovative-industrial-properties-raises-more-cash/", "published": 1593605300.0, "headline": "Innovative Industrial Properties Raises More Cash", "body": "After briefly surpassing $100 per share, Innovative Industrial Properties (IIPR) has been steadily declining over the last few trading sessions. While the stock has pulled back to $88 per share, the company announced that it would be raising another $225 million. This is not the first time the company has needed to raise capital to fund its operations. Investors should be used to it by now. I view capital raises as part of IIPR’s long term business plan to keep up the momentum behind their acquisitions. IIPR deploys capital differently from a pure-play cannabis firm and allows investors to see a clear path to profitability, which is crucial, especially now. On Tuesday, June 30th IIPR announced the upsizing and pricing of an underwritten public offering of 2,683,363 shares of its common stock at $83.85 per share. This provides gross proceeds of approximately $225.0 million. The offering is expected to close on July 2nd, 2020, subject to customary closing conditions. The company has also granted the underwriters a 30-day option to purchase up to an additional 402,504 shares of its common stock. The company is selling all of these shares. 7 Best ETFs for the NEXT Bull MarketThe company intends to use the net proceeds from this offering to invest in specialized industrial real estate assets that support the regulated cannabis cultivation and processing industry consistent with its investment strategy and general corporate purposes. BTIG LLC is acting as sole book-running manager for the offering; Roth Capital Partners, Compass Point Research & Trading, LLC and Ladenburg Thalmann & Co. Inc. (OTC:LTSA) are acting as co-lead managers for the offering. IIPR has quickly boosted its common stock, offering 2.68M shares from 1.8M shares announced just this Monday. Earlier in the month, IIPR agreed to fund an additional $30 million to Green Leaf Medical’s cannabis cultivation and processing facilities in Pennsylvania. The company has been on an acquisition spree since the start of 2019, growing from just a handful of properties to building a billion-dollar portfolio of 56 properties across 15 states. As of June, the company has reported that 99.2% of the facilities are leased with an average length of 15.9 years. The company reported $84.5 million in Q1 revenues and currently pays a 4.8% dividend yield. Looking back to the first time IIPR announced that they needed to raise cash, many investors were concerned about dilution, and the stock took a big hit. Now that the company has been able to prove themselves and show investors that their business model works, I see much less of an adverse reaction to news like this. Overall, I remain long term bullish on IIPR as they continue to dominate the cannabis real estate market. Their focus on medical cannabis producers for their more stable businesses adds to my bullish case for IIPR. Want More Great Investing Ideas? 9 “BUY THE DIP” Growth Stocks for 2020 Is the Bull S#*t Rally FINALLY Over? 7 “Safe-Haven” Dividend Stocks for Turbulent Times Top 3 Investing Strategies for 2020 IIPR shares were trading at $90.36 per share on Wednesday morning, up $2.34 (+2.66%). Year-to-date, IIPR has gained 22.04%, versus a -2.53% rise in the benchmark S&P 500 index during the same period."}]}