{"article": [{"url": "https://stocknews.com/news/shak-plya-apts-3-downgraded-stocks-to-avoid/", "published": 1594296500.0, "headline": "3 Downgraded Stocks to Avoid", "body": "The market hasn’t been able to pick a direction lately as investors wonder whether the U.S. government can get a handle on its rapidly growing cases of Covid-19. As for the economy, recent unemployment figures were not as bad as anticipated, but the virus could hang over our heads until 2022. The reduction in economic activity combined with a lack of a comprehensive plan to mitigate the virus’s spread, has hurt several stock sectors, including restaurants and hospitality. Our exclusive POWR Ratings system recently downgraded Shake Shack (SHAK), Playa Hotels & Resorts N.V. (PLYA), and Preferred Apartment Communities (APTS) to Strong Sell ratings. Shake Shack (SHAK) 7 Best ETFs for the NEXT Bull MarketAlmost everyone who eats at SHAK agrees that the food tastes great. However, most SHAK restaurants have either temporarily closed or suffered a significant slowdown in business due to the coronavirus’s spread. The massive decline in foot traffic has resulted in SHAK getting downgraded to a Strong Sell “F” rating. SHAK’s stock performance is not pretty. The stock is down 18% over the past month and is down 18% year-to-date price. Out of 14 Wall Street analysts, 12 recommend holding SHAK. Beware of investing in this stock unless the economy reopens, and the virus dissipates within the next month or two. Playa Hotels & Resorts N.V. (PLYA) This is a terrible time to have money tied up in the resort/hospitality industry. The majority of stocks in this hard-hit space will likely be downgraded to a Sell or Strong Sell rating, which is the case for PLYA. The company develops, owns, and operates resorts in the Caribbean and in Mexico which is a problem since very few people are traveling because of the virus. PLYA has an F Trade Grade and an F Buy & Hold Grade. The stock is down 55% over the past year and is currently down 58% year-to-date. Though PLYA has slightly recovered from its April low, be cautious as we are still in uncharted waters. Preferred Apartment Communities (APTS) In normal circumstances, real estate investment trusts (REITs) are safe investments. However, we are living in anything but normal times. APTS’s business model is dependent on renters and homeowners paying their rent and mortgages, but a third of all Americans could not make last month’s payments. This is due to high unemployment and a lack of savings. APTS is rated a Strong Sell in our POWR Ratings system. In addition, the stock is ranked 18th of 20 stocks in the REITs – Residential industry. Although APTS had performed well between ’15 and ’17, the stock has been in the red over the past three years. APTS has a three-year return of -43%. While the company has a low forward P/E ratio of 6.87, now may not be the best time to invest. Want More Great Investing Ideas? 9 “BUY THE DIP” Growth Stocks for 2020 Is the Bull S#*t Rally FINALLY Over? 7 “Safe-Haven” Dividend Stocks for Turbulent Times Top 3 Investing Strategies for 2020 SHAK shares were trading at $48.20 per share on Thursday afternoon, down $0.85 (-1.73%). Year-to-date, SHAK has declined -19.09%, versus a -1.40% rise in the benchmark S&P 500 index during the same period."}]}