{"article": [{"url": "https://stocknews.com/news/qqqx-amzn-aapl-qqq-msft-googl-revealed-the-1-recession-resistant-tech-play-big-dividends-ahead/", "published": 1598616500.0, "headline": "Revealed: The 1 “Recession-Resistant” Tech Play (Big Dividends Ahead)", "body": "Few people realize it, but there’s a way to get big dividends (I’m talking 6%+ payouts) from popular tech stocks—Facebook, Amazon.com (AMZN), Apple (AAPL), Microsoft (MSFT) among them. I know that when most people hear about tech these days, they immediately think the sector is overvalued. It’s easy to see why: tech is the sole driver of the S&P 500’s gain this year. In fact, when you hear people say the stock market is up in 2020, you might want to correct them and say that, in fact, it’s tech, and not the market as a whole, that’s up. But tech’s gains are justified by the enormous opportunities these companies have in front of them. I’ll show you why—and name a 6%-yielding fund that’s poised to benefit—in a second. 7 \"SAFE HAVEN\" Dividend Stocks for Turbulent TimesFirst, to see just how much the market has split in favor of tech, take a look at this chart: The S&P 500: Powered By Tech As you can see, the tech-benchmark Invesco QQQ Trust (QQQ), which tracks the NASDAQ 100, is up 38.1% year to date. That, of course, is because tech is a winner in the current pandemic, and it will continue to be once the disease is beaten, as the lockdowns have boosted mobile device use; made people more comfortable with e-commerce; and made it easier to work remotely. These routines will stick with us—and accelerate—for decades to come. And consider this: of the 10 biggest stocks in both the S&P 500 and NASDAQ, half are the same companies: Apple (AAPL), Microsoft (MSFT), Amazon.com (AMZN), Facebook (FB) and Alphabet (GOOGL). And these five companies, deriving a tremendous amount of income from e-commerce and the use of technology to maintain social distancing, are soaring higher than the NASDAQ, on average. Tech Leaders Soar These companies’ big wins aren’t just because of trends in America—a heavier reliance on their products around the world, whether it’s in cloud computing, search, social media or mobile devices, means they can effectively extract a tax on global economic activity at a higher rate than ever before. That extracted value is naturally being reflected in rising stock prices, which is why these companies alone are up 54.7%, on average, in 2020. And that’s where our “split” stock market comes in. Because if you exclude the stocks I just mentioned, the S&P 500 is actually down 4%. Remove other big tech players NVIDIA (NVDA), Advanced Micro Devices (AMD), PayPal Holdings (PYPL), eBay (EBAY), Netflix (NFLX), T-Mobile US (TMUS), Adobe (ADBE), Autodesk (ADSK), Salesforce (CRM), Qualcomm (QCOM), Citrix (CTXS), Akamai (AKAM), Twitter (TWTR) and big video-game companies Take-Two Interactive (TTWO) and Activision (ATVI) and the index is down 5.5%. Source: CEF Insider The clearest takeaway, then, is that the stock market isn’t really soaring—tech stocks are soaring, and they’re doing so for a legitimate reason: their increased value reflects the growth their businesses have seen, and will continue to see. But an equally important takeaway is that the stock market isn’t in an irrational bubble. A 5.5% market decline in an economy that economists expect to shrink by 5.6% in 2020 is exactly what you would expect, but the rationality of the stock market is being hidden by the rise in tech. A 6% Dividend Perfect for This Rational Market So, what’s our best move here? My focus, through my CEF Insider service, is on high-yield closed-end funds (CEFs), which pay much higher dividends than your typical S&P 500 stock: as I write this, the average CEF yields 7%. The typical S&P 500 name? Just 1.7%. CEFs come from all across the economy, including tech, where the Nuveen Nasdaq 100 Dynamic Overwrite Fund (QQQX) yields 6% today, 10 times more than QQQ’s 0.6% payout. That big, stable income stream adds a measure of safety: you can use it to pay your bills, invest elsewhere or buy back into QQQX if we see a dip in the future. That’s not the only pullback protection this fund gives you—it also sells call options on its portfolio. This helps support QQQX’s income stream and acts as a kind of insurance policy that protects the fund from falling too much in a downturn. QQQX is just one way to play the increasingly tech-dominated world we’re living in. And it isn’t even the best way. Some tech-focused CEFs yield 9%+ and trade at significant discounts to the value of the stocks in their portfolios. That lets you invest in the leading companies in the new world we’re headed toward—and bag extra upside and higher dividends, too. Want More Great Investing Ideas? Free Report: 5 Bargain Funds with Safe 11% Dividends A “1-Click” Way to Grab Safe 8% Dividends The $43,000 “dividend secret” Wall Street hides from you QQQX shares were unchanged in after-hours trading Friday. Year-to-date, QQQX has declined N/A%, versus a 10.05% rise in the benchmark S&P 500 index during the same period."}]}