{"article": [{"url": "https://stocknews.com/news/amd-intc-goog-dell-nvda-orcl-amd-stock-price-surges-as-it-dethrones-intel-and-expands/", "published": 1597061300.0, "headline": "AMD Stock Price Surges as it Dethrones Intel and Expands Sales", "body": "Advanced Micro Devices (AMD) & Intel (INTC) Since the late 90s there has been one constant in the semiconductor world. I knew that anytime I looked at a chart of Intel (INTC), I could also pull up a chart of Advanced Micro Devices (AMD)…and it would be priced below Intel. As the rental car ad says, I don’t know if they were trying harder, but AMD was definitely number two. If Intel was up, AMD would be up less; if Intel was down, AMD would be down more. 7 Best ETFs for the NEXT Bull MarketNot anymore. In what seemed to investors like the blink of an eye, the two companies successfully pulled off a move Hayley Mills (from The Parent Trap) would have been proud of. In its earnings report released the last week of July, Intel reported not only a disastrous quarter, but looked to be in complete disarray as a company. All this while AMD, as summed up by CEO and president, Dr. Lisa Su when that company released its earnings the same week, is “raising our full-year revenue outlook as we enter our next phase of growth driven by the acceleration of our business in multiple markets.” This very important inflection point between the two companies was clearly recognized in the market. Intel stock dropped as much as 22% in the days after the earnings. And AMD, which had been trading around $60 just before earnings, has risen by around 42% as I write this. The 3-month chart below perhaps explains it even more succinctly: Intel kicked off its earnings debacle with what seemed to be an acceptable top-line number. Earnings came in at $19.73 billion, or an adjusted $1.23 per share. But after that news, which beat analyst estimates, the forward-looking guidance was nothing but negative. The company reinstated a full-year earnings forecast, which it had suspended last quarter due to the coronavirus pandemic, and it was lower than numbers the company projected in January. Intel now is projecting $4.85 in adjusted revenue this year as opposed to the $5 it projected in at the beginning of the year. But that wasn’t the only unfortunate news. Intel also announced there would be a further delay in introducing a new seven-nanometer transistor chip, which AMD is already selling. The company said the new chip “is now trending approximately 12 months behind the company’s internal target.” This followed news a month ago that Jim Keller, Intel’s SVP of Silicone Engineering, and a well-respected chip designer, was leaving the company after only six months in the top job. The official announcement said Keller was leaving for personal reasons, but the optics, along with the inability of the company to get the seven-nanometer chip out the door, are not favorable developments. On the other hand, AMD appears to be firing on all cylinders as the company’s chips are now recognized by many users to be best in class. AMD reported revenue of $1.93 billion for the quarter, up 26% year-over-year. The company said the primary driver of growth was in its Computing and Graphics segment. AMD appears to be taking full advantage of the opportunity offered by the accelerated growth in digitization forced by the pandemic. Google (GOOG), Oracle (ORCL) & Dell (DELL) AMD announced both new and expanded sales with Google (GOOG), Oracle (ORCL), and Dell Technologies (DELL), among others. Clearly these companies are building out products and infrastructure around the AMD chips that often sit at the heart of their products. Unlike Intel, AMD raised estimates and is projecting next quarter revenue to come in at $2.55 billion, or a 42% year-over-year increase. Gross margin is expected to be 44% in the upcoming quarter. Nvidia (NVDA) Finally, since we’re talking best in class, I’d like to mention another company that is doing well putting together the guts of all the computers being sold, Nvidia (NVDA). Nvidia is scheduled to report earnings for its most recent quarter on August 13th. While AMD is the leader in chipsets, Nvidia is the recognized leader in the graphics card space. Nvidia fits squarely within the group of companies I’ve written about before, which are benefitting from the acceleration in the digital economy. And, as fewer companies dominate the digital space, I think you want to be in best-of-class companies like Nvidia. Nvidia has moved from the $350 range, where it was when the company last reported earnings in May, to the $450 range today. Keep an eye on its data center revenue this quarter, which was up 80% year-over-year last quarter. Want more great investing ideas? Download free the “10-Step Options Trading Checklist” you need before making a trade. The Virtual Trading Pit Is Open: Trade Set-ups, Training, New Trading Ideas How to Try Out Options Without Risking a Penny AMD shares fell $0.09 (-0.11%) in after-hours trading Monday. Year-to-date, AMD has gained 79.33%, versus a 5.30% rise in the benchmark S&P 500 index during the same period."}]}