{"article": [{"url": "https://stocknews.com/news/nflx-dis-netflix-vs-disney-which-is-better-70470922/", "published": 1597320500.0, "headline": "Netflix vs Disney: Which is Better?", "body": "Two of the largest streaming companies are Netflix (NFLX) and Walt Disney (DIS). Netflix was the first company to understand the massive potential of streaming media. It’s taken advantage of this head start by becoming the largest streaming company with 193 million subscribers all over the world. In contrast, Disney is an entertainment conglomerate with theme parks, movie studios, cable channels, a network TV channel, ESPN, and a growing streaming division. In between all its streaming services, Disney has 100 million subscribers. Currently, Netflix’s market cap is $211 billion, while Disney has a $240 billion valuation. The chart below shows that, over the past decade, Netflix has significantly outperformed Disney. 7 Best ETFs for the NEXT Bull Market Going forward, it’s likely that Disney is going to start outperforming Netflix, for the following reasons: There is more competition in the streaming space. The cost of content is increasing. Growth in Disney’s streaming service Disney has valuable assets and a wide moat Netflix is in a vulnerable, financial position Increasing Competition One of the factors in Netflix’s growth was that it was able to acquire content from movie and TV studios for a pittance. The studios didn’t anticipate a future in which revenue sources like TV rights, movie tickets, and DVD sales would be diminished in favor of streaming. Studios looked at the revenue they were paid by NFLX like a bonus with little understanding that it was going to displace their other revenue sources in the long-run. But now, major content producers are launching up their streaming services. They believe this will become their primary revenue source. DIS is ahead of the curve and bought Hulu and launched Disney+. Each already has 30 million and 54 million subscribers, respectively. Other streaming services include Amazon’s (AMZN) Prime Video, AT&T’s (T) HBO Max, Comcast’s (CMCSA) Peacock, CBS’ All Access, and Apple’s (AAPL) Apple TV+. On top of this, there are a variety of streaming services targeted towards niche demographics and interests. Cost of Content Increasing competition means that there will be more options for customers to choose from. There will be more pressure on NFLX to keep creating new and interesting content to grow and retain subscribers especially as studios stop licensing content to NFLX and instead use it to grow their services. For example, a program like the “Office” or Disney movies will be exclusively housed on their streaming platforms, once their contracts with Netflix expire. More competition also means more demand, thus the cost of talent and content will increase. So, Netflix could see revenues decline as its customers check out competing offers, while costs will rise as it fights to keep churning out TV shows, movies, and documentaries to keep them on the platform. Furthermore, Netflix will be competing with companies like AMZN or AAPL who have deep pockets and can top any bid. And, it will be competing with companies like DIS, NBC/Universal, CBS, or HBO who have decades of producing high-quality content. Netflix’s stock has always been overvalued relative to its profits and sales. However, the implicit bet was that the company would achieve market dominance and then raise prices. It’s certainly achieved market dominance, but due to increasing competition, it’s not going to be able to raise prices anytime soon. Disney’s Streaming Service Booming 95% of Netflix’s content is licensed from other companies. And the cost for that content is rising. In contrast, Disney has a long track record of successfully generating original content. Disney owns some of the world’s most valuable content that has emotionally resonated with audiences across generations. For example in 2019, it accounted for 33% of the global box office. Given the rising cost and competition for content, NFLX is going to have to compete with Disney in an area, where Disney has the advantage. It’s much easier for Disney to replicate Netflix’s strength in technology than it is for Netflix to replicate Disney’s advantage in content creation. Not to mention, that it will be extremely challenging to recreate the emotional connection that Disney has with its audience. Of course, on top of Disney+, there is also Hulu and ESPN+. ESPN+ will attract cord-cutters who are sports fans, while Hulu is geared towards cord-cutters who still want to watch local network TV programs. Disney’s Assets Given current growth rates, it’s likely that Disney’s streaming division will catch up with Netflix. However, Disney has several other valuable assets including its theme parks division. Due to the coronavirus, this has been a drag on the company, but in 2019, it generated $26.7 billion in revenue. In contrast, Netflix generated under $20 billion in revenue in 2019. While the parks division faces significant short-term headwinds, demand will return once the health situation improves. Due to strong demand, it has pricing power. In the last 15 years, ticket prices for their theme parks have gone up by 80%, and it doesn’t include all the additional sources of revenue they’ve tapped like fast-passes which lets people skip rides and other premium experiences. Netflix’s Weak Financials Netflix trades like a SAAS stock with a 10x forward price to sales ratio. Unlike a SAAS stock, there’s no guarantee of growth, customer retention, or high margins. Netflix is projected to spend close to $17 billion on content this year. This is going to increase in the coming years as NFLX will have to produce more original content, and the cost of its content will increase. Of course, this means there’s a razor-thin margin given its revenue of $22 billion. As a result, its free cash flow has been negative in the last couple of years, and the company has taken on $12 billion in debt to make up the difference. (source: Macrotrends) Some investors breathed a sigh of relief, following the last quarter, when there was positive cash flow. However, this most likely isn’t sustainable. The pandemic led to a surge in subscribers but delayed production on new projects. The revenue increase was “pulling forward” demand from future quarters, while it pushed out costs into future quarters. Expect the market to react negatively when this becomes clear. Conclusion The other problematic factor for NFLX is that its valuation can only be justified if it keeps adding subscribers. This is going to be harder with all the new offerings available. Given diminished licensing opportunities, it’s going to have to invest in more original content which is expensive and risky. In contrast, Disney’s content library, iconic franchises, and parks give it an actual moat. Netflix’s stock is valued like it has a moat, but it’s clear that the moat is quite shallow. For a time being, its competitive advantage was its content library and superior, streaming technology. Like any technology, this has become commoditized. The studios are pulling their content from Netflix as they are now themselves in the streaming business, so its content library is being eroded. Disney’s streaming business is booming. It owns its content and has a long history of creating original content that audiences love and are excited to share with their children. On top of this, it has a variety of other businesses that are temporarily depressed but remain attractive on a long-term basis. Want More Great Investing Ideas? 9 “BUY THE DIP” Growth Stocks for 2020 How to Trade THIS Stock Bubble? 7 “Safe-Haven” Dividend Stocks for Turbulent Times NFLX shares were trading at $481.02 per share on Thursday afternoon, up $5.55 (+1.17%). Year-to-date, NFLX has gained 48.66%, versus a 5.94% rise in the benchmark S&P 500 index during the same period."}]}