{"article": [{"url": "https://stocknews.com/news/avgo-ibm-hpq-3-large-cap-tech-stocks-with-more-than-3-dividend-yield", "published": 1597752500.0, "headline": "3 Large-Cap Tech Stocks with More Than 3% Dividend Yield", "body": "When investors think of tech stocks, they usually buy them for growth rather than dividends. However, there are certain tech stocks that not only provide the potential for growth, but also pay high dividends. The technology industry has been able to capitalize on the pandemic better than any other. As a result, many technology players have significantly outperformed the market. This is evident from the tech-heavy Nasdaq Composite’s more than 60% gain since its March lows, versus the S&P 500’s close to 47% return over the same period. So, amid these uncertain times, high-yield stocks in the technology sector could be the best bet. Here are four such stocks that are paying outstanding dividends to their investors: Broadcom (AVGO), International Business Machines (IBM), and HP, Inc. (HPQ). 7 \"SAFE HAVEN\" Dividend Stocks for Turbulent TimesBroadcom (AVGO) AVGO designs and develops both digital and analog semiconductor connectivity solutions. This includes wired infrastructure, enterprise storage, and wireless connectivity. AVGO’s solutions are used in smartphones, alternate energy systems, broadband connections, and more. The stock has significant upside potential thanks to the upcoming 5G network since the demand for semiconductors developed by AVGO may improve due to their application in building 5G infrastructure. The stock also pays an annual dividend of $13 per share, which translates to a yield of 3.94%. AVGO has increased their dividend payout for 22 quarters in a row. AVGO has also been performing pretty well in the “new normal,” and it has added close to 65% to its stock price since this year’s low of $155.6 hit in March due to the virus-led market crash. How does AVGO stack up for the POWR Ratings? A for Trade Grade A for Buy & Hold Grade A for Peer Grade A for Industry Rank A for Overall POWR Rating You can’t ask for better. The stock is also ranked #4 out of 86 stocks in the Semiconductor & Wireless Chip industry. International Business Machines (IBM) IBM provides IT-related services worldwide. Their services include outsourcing, integrated technology, cloud computing, technology support, and more. The company has recently unveiled its 7nm Power10 server processor meant for hybrid cloud computing. This new processor provides almost three times more energy efficiency, along with greater workload capacity and container density, as compared to the Power9. This upgrade could position IBM as a leader in the hybrid cloud technology space. Along with the potential upside in IBM’s stock price, the company pays an annual dividend of $6.52 per share, which yields 5.24%. Over the past six years, IBM has issued more dividends than 97.3% of other dividend-issuing US stocks in the StockNews.com universe. IBM’s recent price performance reflects its ability to capitalize on the recent trend to go digital. The stock has gained more than 34.5% since hitting year-to-date low in mid-March. IBM’s earnings surprise history is impressive as well with the stock beating consensus EPS estimates in each of the trailing four quarters. It’s no surprise that IBM is rated a Buy in our POWR Ratings system. It also has a grade of A for Trade Grade and Industry Rank. Within the 28-stock Technology – Hardware industry, it is ranked #8. HP Inc. (HPQ) HPQ develops and manufactures consumer personal computers, tablets, point-of-sale systems, and other IT-related goods. The company recently made an important announcement relating to new cloud-based offerings. It introduced a new Managed Print Cloud Service that allows for cloud-based printing activity. This service supports both trusted and zero-trust cloud environments. With business operations shifting to the cloud, this new announcement could lead to further upside for the stock. Additionally, HPQ announced that its printing services would support Universal Print, which would increase the security aspect of their services. HPQ pays an annual dividend of $0.7 per share, which translates to a yield of 3.9%. The company provides shareholders with a dividend yield greater than 85.3% technology stocks in the StockNews.com universe. HPQ’s stock price has risen by 24.6% from its mid-March lows. HPQ has an impressive earnings surprise history with the company surpassing consensus EPS estimates in each of the trailing four quarters. The stock is also ranked #12 out of 28 stocks in the Technology – Hardware industry. Want More Great Investing Ideas? The Best of StockNews 3 Possible Directions for the Stock Market from Here 9 “BUY THE DIP” Growth Stocks for 2020 AVGO shares were trading at $329.73 per share on Tuesday morning, down $0.59 (-0.18%). Year-to-date, AVGO has gained 7.21%, versus a 6.02% rise in the benchmark S&P 500 index during the same period."}]}