{"article": [{"url": "https://stocknews.com/news/hznp-exel-frpt-halo-4-growth-stocks-set-to-soar-in-2021/", "published": 1601554100.0, "headline": "4 Growth Stocks set to SOAR in 2021", "body": "Growth stocks have outperformed in 2020, and this momentum may keep going in 2021. The SPDR Portfolio S&P 500 Growth ETF (SPYG) has gained 18.7% so far this year. In comparison, the S&P 500 has gained 4% during the same period. Companies with the highest growth potential are working on emerging technologies or capitalizing on new trends. These companies are expected to reap the fruits of their research and development, and proactive business modification efforts in the coming years. Horizon Therapeutics PLC (HZNP), Exelixis, Inc. (EXEL), Freshpet, Inc. (FRPT), and Halozyme Therapeutics, Inc. (HALO) are in high-growth industries with solid earnings and revenue growth potential based on their continued expansion efforts. 7 Best ETFs for the NEXT Bull MarketHorizon Therapeutics PLC (HZNP) HZNP is a pharmaceutical company that focuses on the research, development, acquisition, and marketing of medicinal products relating to arthritis, inflammatory, pain, and orphan diseases. HZNP primarily has operations in the United States. The stock has gained 114.6% year-to-date. The company is in the process of developing HZN-825, which could work as a treatment for sclerosis. Additionally, the company is developing treatments for uncontrolled gouts. The company’s pipeline of in-development medications could help charge the growth of the company in 2021 and beyond. In the second quarter of 2020, HZNP witnessed record net sales which increased 44% year-over-year. This growth has been driven by the strong demand for TEPEZZA, and the company has increased the annual net sales estimate for TEPEZZA to greater than $3 billion from the initial estimate of greater than $1 billion. The company’s revenue is expected to grow 47.9% this year and 38.1% in 2021. HZNP’s EPS is estimated to rise 52.8% next year and at a rate of 28.8% per annum over the next five years. How does HZNP stack up for the POWR Ratings? A for Trade Grade A for Buy & Hold Grade A for Peer Grade B for Industry Grade A for Overall POWR Rating The stock is also ranked #5 out of 239 stocks in the Medical – Pharmaceuticals industry. Exelixis, Inc. (EXEL) EXEL is a biopharmaceutical company that is engaged in the development of small molecule therapies for the treatment of cancer. The company currently has four commercially available products. EXEL’s stock has gained 38.7% so far this year. EXEL has recently entered into a partnership with NBE-Therapeutics for the development of multiple antibody drug conjugates (ADC) for various oncology applications. The company, along with Iconic Therapeutics, has also announced new clinical data that supports the development of ICON-2 which would help with the treatment of solid tumors. EXEL has signed four biologics-related agreements since 2018, which could bear fruit for the company in 2021. The company’s revenue is expected to grow by 25.3% in 2021. EXEL’s EPS is estimated to rise 82.2% next year and at a rate of 46% per annum over the next five years. It’s no surprise that EXEL is rated a “Buy” in our POWR Ratings system, with a grade of “A” in Trade Grade and Peer Grade. In the 376-stock Biotech industry, it is ranked #23. Freshpet, Inc. (FRPT) FRPT manufactures and markets fresh foods, refrigerated meals, and treats for pet dogs and cats. The company’s stock has soared 88.9% so far this year. The company is focused on innovating in the fresh foods for pets segment, which could differentiate it from competitors. During the second quarter of the year, FRPT reported a year-over-year increase in net sales of 33.2%. For the full year ended December 2020, the company expects to witness a growth in sales of 30% compared to 2019. FRPT is focused on growth and plans to invest around $575 million on new manufacturing facilities between 2021 and 2025. The company has recently started work on a new plant in Ennis, Texas which is estimated to take the company’s capacity to $1.3 billion. FRPT’s revenue is expected to grow by 30.9% in 2020 and 26.5% in 2021. FRPT’s EPS is estimated to rise 205.3% next year and at a rate of 85.2% per annum over the next five years. FRPT’s strong fundamentals are reflected in its POWR Ratings, it has a “Strong Buy” rating with an “A” in Trade Grade, Buy & Hold Grade, and Peer Grade. In the 58-stock Food Makers industry, it is ranked #6. Halozyme Therapeutics, Inc. (HALO) HALO is a biotechnology company that engages in the development and marketing of oncology-related therapies that target the microenvironment of tumors. The company also licenses innovative drug delivery technology. HALO’s stock has delivered returns of 48.2% so far this year. The company had a positive second quarter and reported a rise in revenue to $55.2 million as compared to $39.1 million in the same period in 2019. The company’s partners have received two FDA approvals and one EMA approval for products that utilize the company’s ENHANZE drug delivery technology. This takes the total number of FDA-approved products that utilize the company’s proprietary technology to five. This could provide significant gains for the company in the future due to collaboration payments for the use of this drug-delivery technology. The company’s revenue is expected to grow by 20.7% in 2020 and 55.9% in 2021. HALO’s EPS is estimated to rise 127.5% next year and at a rate of 58% per annum over the next five years. HALO has a grade of “B” in Buy & Hold and Peer Grade in our POWR Ratings system. In the 376-stock Biotech industry, it is ranked #70. Want More Great Investing Ideas? Do NOT Buy Stocks Before the Election! 7 “Safe-Haven” Dividend Stocks for Turbulent Times Chart of the Day- See Christian Tharp’s Stocks Ready to Breakout HZNP shares were trading at $80.42 per share on Thursday afternoon, up $2.74 (+3.53%). Year-to-date, HZNP has gained 122.15%, versus a 6.22% rise in the benchmark S&P 500 index during the same period."}]}