{"article": [{"url": "https://stocknews.com/news/ung-d-brk-a-the-long-term-natural-gas-chart-looks-bullish-dont-get/", "published": 1600776500.0, "headline": "The Long -Term Natural Gas Chart Looks Bullish- Don’t Get Too Excited", "body": "The quarterly chart points to a significant bottom in natural gas Warren Buffett’s acquisition is a vote of confidence for the business Inventories remain a problem, but production declines and politics could cause volatility In late June, the price of nearby natural gas futures fell to the lowest price of this century, and since 1995 when it reached a low of $1.432 per MMBtu. The continuous futures contract turned higher, and by late August, the price had recovered by 91.5% to a high of $2.743. The price corrected to a low of $2.246 on September 11, before another storm heading for the Louisiana coast pushed it back over the $2.30 level at the start of last week. By the end of the week, it was probing below the $2 level. The delivery point for NYMEX natural gas futures is at the Henry Hub in Erath, Louisiana. The move to the recent high came as hurricane Laura was bearing down on the states along the Gulf of Mexico. Last week, hurricane Sally had a similar impact as it barreled towards the Louisiana coast. The natural gas market now faces the height of the 2020 hurricane season as stockpiles are at an elevated level. The November 3 election, which will determine the direction of US energy policy over the coming years, is another factor for the market. Meanwhile, the long-term technical position of the natural gas market favors the upside. We are coming into a time of the year when volatility tends to rise in the natural gas arena. The United States Natural Gas Fund (UNG) moves higher and lower with the price of the energy commodity. 7 Best ETFs for the NEXT Bull MarketThe quarterly chart points to a significant bottom in natural gas Since 1990, when natural gas began trading on the NYMEX futures exchange, the price traded in a range of $1.02 to a high of $15.65 per MMBtu. At $1.432 in late June 2020, the price fell within 41.2 cents of the record bottom. 2020 has been a rough year for energy markets. While natural gas hit a quarter-of-a-century low, WTI crude oil futures did even worse as it fell below zero in April. However, the long-term natural gas chart looks like the market is ripe for a recovery from a technical perspective. Source: CQG As the quarterly chart highlights, natural gas has been making lower highs and lower lows since 2005. In 2005 and 2008, Hurricanes Katrina and Rita hit the Louisiana coast. The delivery point for NYMEX futures is at the Henry Hub in Erath, Louisiana, not far from the Gulf of Mexico. The hurricane damage lifted prices above the $10 per MMBtu level in 2005 and 2008. Since 2009, the price of the energy commodity has not traded above $6.50 per MMBtu. Meanwhile, the total number of open long and short positions in the natural gas futures arena rose steadily from 1990 through 2018. However, the metric fell from over 1.6 million to below 1.3 million contracts, where it has flatlined over the past two years. The slow stochastic, a price momentum indicator, declined to an oversold condition but is threatening to cross higher after the recent price recovery from a twenty-five-year low. Relative strength has already turned higher and was moving toward a neutral reading in mid-September. After hitting a low of just over 12% in 2019, quarterly historical volatility moved to the 23.82% level, indicating the wider quarterly trading range in the energy commodity. The quarterly chart is building cause for a price recovery. Warren Buffett’s acquisition is a vote of confidence for the business Just after natural gas hit its most recent bottom in late June, Warren Buffett announced that Berkshire Hathaway acquired Dominion Energy’s (D) transmission and pipeline assets for $4 billion in cash and $6 billion in assumed debt. The announcement came on July 5, one week after natural gas hit the low for 2020 and this century. Warren Buffett is a value investor. He increased Berkshire Hathaway’s (BRK.A) control of natural gas transmission from 8% to 18%. Despite concerns that US energy policy could experience a significant shift following the November 3 election, Mr. Buffett made a significant long-term bet on the energy commodity. While the price was overdue for a recovery, Buffett’s investment likely contributed to the over 90% price recovery by late August. Simultaneously, hurricanes in the Gulf of Mexico added some bullish fuel to the fire. However, the price has yet to make it over the $2.75 per MMBtu level. Inventories remain a problem, but production declines and politics could cause volatility Last week, the Energy Information Administration reported the most significant injection into storage in the US since mid-June. Stocks rose by 89 bcf, putting them 17.4% above last year’s level and 13.2% above the five-year average for this time of the year. There will be plenty of natural gas to satisfy the winter demand regardless of how cold it gets in the US. Stockpiles are on an express train to the four trillion cubic feet level for only the third time since the EIA began reporting the inventory data. At the start of the peak demand season in 2019/2020, there was 3.732 tcf in storage. In 2018/2019, it peaked at 3.234 tcf. Inventories are at a level that could cap any rallies over the coming months. On the other hand, only 73 natural gas rigs were operating as of September 18, 2020, compared to 148 in mid-September 2019. Inventories may be rising, but production is declining in a sign of weak demand during the global pandemic. The November 3 US election will determine the path of energy policy, which could significantly impact fracking for gas and oil. We could see increased price volatility over the coming weeks as the market focuses on the potential for a substantial shift from the status quo over the coming years. The long-term picture for natural gas supports a higher price for the energy commodity. However, the stockpile levels going into the peak season of demand starting in November tell us not to expect too much on the upside. Natural gas for delivery in January 2021 was trading at the $3.285 per MMBtu level on September 18, which could be too high considering the peak last winter was at $2.905, and stocks were at a lower level. The price of nearby October futures closed last week at the $2.048 level, a substantial discount to the peak season price. Want More Great Investing Ideas? 7 Best ETFs for the NEXT Bull Market Stock Market Outlook: Before & After the Election Chart of the Day- See the Stocks Ready to Breakout UNG shares fell $0.38 (-3.12%) in premarket trading Tuesday. Year-to-date, UNG has declined -29.66%, versus a 2.97% rise in the benchmark S&P 500 index during the same period."}]}