{"article": [{"url": "https://stocknews.com/news/ryaay-znh-cea-algt-jets-bet-on-a-breakout-in-airline-stocks/", "published": 1599826100.0, "headline": "BET on a BREAKOUT in Airline Stocks", "body": "The coronavirus has crushed the airline industry. So far, the recovery has been pretty tepid especially compared to other industries. Airlines are dealing with two challenges: the plunge in revenues due to travel declining and their cash burn rates. 9 \"BUY THE DIP\" Growth Stocks For 2020During the coronavirus crash, the US Global Jets ETF (JETS) dropped 65% from its pre-coronavirus peak to its low in March. Since then, the ETF has risen 58% but remains 45% off its previous highs. In contrast, the S&P 500 is 1% above its pre-coronavirus levels. In recent months, the sector has traded in a sideways range between $16 and $22. During this consolidation, the fundamentals for airline stocks have significantly improved. Therefore, it increases the odds that airline stocks are going to break higher out of their recent trading range. From a technical level, there’s evidence of accumulation as airline stocks have traded with low volatility despite a steady stream of negative news. Some of the major ones were a drop in bookings due to a spike in case counts and warnings from management that more furloughs may be necessary. This type of price action during periods of negative news is an indication that investors already had low expectations for the stock and that it may be primed to make a move higher with a positive catalyst. Improving Fundamentals There are some potent catalysts, especially as fundamentals are improving. The biggest one is the drop in coronavirus case counts. As the chart below shows, the seven-day average for new cases is moving lower at a sharp rate since peaking in late-July at just under 75,000 new cases per day. (source: Worldometers.info) This is already translating into an increase in the number of passengers. There’s been a significant improvement in terms of the number of travelers on a week-to-week and month-to-month basis. Morgan Stanley turned bullish on the sector and said in a note that “We see air travel demand returning to pre-COVID levels on a run-rate basis by late 2021/early 2022.” Such an improvement in air travel would result in most airliners returning to profitability sooner than expected especially given the cuts in capacity and increased cost discipline. On Monday and last Friday, we had the highest number of flyers since mid-March. On a year-over-year level, we are about 40% off last year’s figure. Most airlines will remain in the red, until we can get back to 70% of last year’s number of travelers. (source: TSA) Another positive development has been no major outbreaks linked to air travel despite the steady increase in people traveling. There’s been limits and warnings about activities linked to outbreaks like large gatherings, indoor dining, bars, and nightclubs. Health authorities would have warned about and restricted air travel if they were found to be responsible for major outbreaks. We’ve also seen positive momentum when it comes to vaccine developments, treatments, and testing. There’s increasing confidence that a vaccine will become available by year-end or early next year. Dr. Anthony Fauci, the White House adviser on the coronavirus and the head of the National Institute of Allergy and Infectious Diseases, said this weekend regarding the vaccine timeline that “The more likely scenario is that we will know by the end of this calendar year and hopefully we’ll be able to start vaccinations in earnest as we begin early 2021.” Another positive sign is that death counts didn’t significantly increase when new case counts were elevated during the summer months. In part, it’s due to doctors learning more about the disease and the most effective ways to treat it. Testing is also becoming more available and accessible. Abbott Laboratories’ (ABT) testing machine which can give results in 5-15 minutes is a potential gamechanger and can allow many types of activities to resume even if a virus isn’t successfully created. For example, people and staff could be tested before they get on a plane to ensure that there’s no risk of spread. Buy-Rated Airline Stocks Given the improving fundamentals and accumulation of airline stocks, investors should consider taking a position in these stocks. While most stocks in the market are trading at above-average valuations, airlines are trading at a discount relative to future earnings projections. Our POWR Ratings is one tool to help you pick out the stocks with the best technicals and fundamentals. Four airline stocks that are rated a Buy are RyanAir Holdings (RYAAY), China Southern Airlines (ZNH), China Eastern Airlines (CEA), and Allegiant Travel (ALGT). RyanAir Holdings (RYAAY) RYAAY has been an outperformer among airline stocks. It’s only 15% off its pre-coronavirus levels. One reason for its strong performance is that it operates in markets that are recovering faster from the coronavirus. These economies are ahead of the US in terms of travel metrics returning to “normal” levels. Further, many discount airlines are not going to survive these rough conditions. RYAAY will survive due to its size, balance sheet, and routes. This means that on the other side of the crisis, it will be able to win more market share and have greater pricing power. The POWR Ratings have sniffed out RYAAY’s strength as it is one of the few airline stocks rated a Buy. It also has an “A” for Trade Grade and Peer Grade and is ranked #1 among 22 airline stocks. China Southern Airlines (ZNH) Like RYAAY, ZNH benefits from operating in a region that has largely controlled the coronavirus. In China, air travel has rebounded to 35 to 40% from 2019 levels. They seem to be about 2 to 3 months ahead of the US recovery. ZNH also benefits from the secular growth in domestic air travel in China. Thus, the coronavirus is offering an attractive entry point for investors who want to ride this trend. The POWR Ratings reveal that ZNH has a Buy Rating. B Peer Grade and a #3 ranking of 22 airline stocks. However, ZNH has not returned to its pre-COVID trading price of $30 to $35. ZNH has spiked four times across the past five months, enduring a sell-off each time it reaches $26. Look for ZNH to break through this ceiling as China’s economy regains momentum in the months ahead. It should not be long until ZNH moves back toward its pre-COVID trading level. China Eastern Airlines (CEA) Like ZNH, CEA is also an intriguing stock to play the increase in domestic air travel in China for passengers and cargo. While this crisis is challenging in the short-term, it’s likely going to lead to more market share in the long-term. CEA has one initiative in which it’s offering business-class customers an unlimited flight package for weekdays and another package for vacationers for unlimited flights on weekends. These indicate the company sees this period as an opportunity to win more customers and strengthen its brand with a long-term perspective. CEA is rated a Buy with a “B” for Trade Grade and an “A” for Peer Grade. It’s ranked #2 out of 22 airline stocks. Allegiant Travel (ALGT) ALGT’s strength is puzzling given that it’s primarily focused on leisure destinations. The company is a low-cost operator that focuses on less-competitive routes, where its main competition is regional airlines who are the worst equipped to survive the crisis. Additionally, many are betting that vacation travel will pick up faster than business travel. Based on current estimates for travel to return to 2019 levels by 2022, ALGT has a 2022 estimated price-to-earnings ratio of 7.66 which is very attractive. This is not including the company’s likely gains in market share and increased prices due to less flight capacity. Additionally, it means there’s room for error if the recovery isn’t as strong as anticipated. The POWR Ratings rate ALGT as a Buy. It has an “A” for Peer Grade and a “B” for Trade Grade. Among 22 airline stocks, it’s ranked #4. Want More Great Investing Ideas? 7 Best ETFs for the NEXT Bull Market Will Stocks Fall into Historical September Slump? 9 “BUY THE DIP” Growth Stocks for 2020 RYAAY shares fell $1.66 (-1.95%) in premarket trading Friday. Year-to-date, RYAAY has declined -2.64%, versus a 4.81% rise in the benchmark S&P 500 index during the same period."}]}