{"article": [{"url": "https://stocknews.com/news/intc-viot-mvis-3-recently-downgraded-high-flying-tech-stocks/", "published": 1595938100.0, "headline": "3 Recently DOWNGRADED Tech Stocks to Avoid", "body": "Technology is attractive to investors, because there is potential for fast growth and big margins. And as a sector, technology it’s one of the strongest areas of the market, as the Nasdaq is 6% above its pre-coronavirus highs and 57% above its March lows. Yet, even though the bull market in technology is creating a positive tailwind for the sector, some tech companies are struggling in the current economic environment. Our POWR Ratings can help you identify which tech companies are starting to stumble. Intel (INTC), Viomi Technology (VIOT), and MicroVision (MVIS) are three stocks recently downgraded by the POWR Ratings service. 9 \"BUY THE DIP\" Growth Stocks For 2020Intel Corporation (INTC) Even though INTC announced a positive second-quarter earnings report in many ways, the company seems to be heading for trouble. The primary concern is the six-month delay in the production of the much-awaited 7-nm chip. It was expected to be released around the end of 2021 but the release has now been shifted to 2022. Furthermore, Apple (AAPL) has also announced its intention to switch its Mac to proprietary processing chips rather than using INTC-made chips. This could lead to a significant drop in business for INTC. INTC ’s stock price has declined more than 18% since the announcement of the second-quarter results and is currently trading at $49.57. Before the decline, INTC had been consistently trading around the $60 mark after recovering from the mid-March low of $43.6, caused by the overall stock market crash. The average EPS estimate for the quarter ended September 2020 stands at $1.10, which indicates a year-over-year decline of 22.5%. INTC’s overall rating has recently been downgraded from a “Buy” to “Neutral” in our POWR Ratings system. It also has a “C” in Trade Grade and Buy & Hold Grade and “D” in Peer Grade. The stock is also ranked #54 out of 86 stocks in the Semiconductor & Wireless Chip industry. Viomi Technology Co., Ltd (VIOT) VIOT is a Chinese technology company that develops and sells IoT-enabled smart home products such as refrigerators, water purifiers, washing machines, and water heaters. VIOT’s net income in the first quarter of 2020 fell to RMB 17.8 million from RMB 41.3 million a year ago. The cost of revenues for the company increased by 27.7% from the same period last year. The number of offline stores that the company operates also fell to 1500 from 1700 at the end of 2019. The stock steadily declined over the last week. VIOT’s stock has lost approximately 11% in value since July 21st and is currently trading at $6.22. After the stock market crash in mid-March, the stock witnessed a rallying period and touched a high point of $7.28 before starting to decline. VIOT is expected to deliver an EPS of $0.10 for the quarter ended June 2020 which indicates a 47.4% decline year over year. VIOT’s overall rating has been downgraded from “Neutral” to a “Sell” in our POWR Ratings system. VIOT has also been accorded a “D” in Trade Grade and Buy & Hold Grade along with a “C” in Peer Grade. In the 115-stock China industry, it is ranked #56. MicroVision, Inc. (MVIS) MVIS is a technology company that focuses on building laser scanning technology, 3D sensing, augmented reality, and image capture. However, the company has failed to deliver a profit in any of the last twenty-five years. The company’s stock, which was riding high in the hopes of a big buyout, has started to decline as Microsoft Corporation (MSFT) recently denied rumors about its plans to acquire MVIS. MVIS reported negative EPS in each of the trailing four quarters. The consensus sales estimate for the quarter ended September indicates a year-over-year decline of 54.6%. The stock traded at this year’s high of $3.45 on July 17th after recovering from the stock market crash which took place in Mid-March. However, MVIS’s stock price has fallen by more than 40% since then and currently stands at $2.06. In line with recent developments, MVIS has been downgraded to a “Neutral” from a “Buy” in our POWR Ratings system. MVIS also has a “D” in Buy & Hold Grade and “C” for Peer Grade. Within the Technology – Electronics group, it’s ranked #19 out of 36 stocks. Want More Great Investing Ideas? 9 “BUY THE DIP” Growth Stocks for 2020 Newly REVISED 2020 Stock Market Outlook 7 “Safe-Haven” Dividend Stocks for Turbulent Times INTC shares fell $0.20 (-0.41%) in after-hours trading Tuesday. Year-to-date, INTC has declined -16.86%, versus a 0.81% rise in the benchmark S&P 500 index during the same period."}]}