{"article": [{"url": "https://stocknews.com/news/docu-fsly-zs-shop-the-4-best-performing-large-cap-tech-stocks-year-to-date/", "published": 1596542900.0, "headline": "The 4 BEST Performing Large-Cap Tech Stocks Year-to-Date", "body": "The technology sector has manifested itself by being the fastest one to adapt to the “new normal.” The sector is not only increasing global dependence on edge computing, but also catering to the tech infrastructure needs of all other industries. So, it’s not surprising that some of the biggest stock market winners in 2020 are from this sector. The market’s recovery from the March lows has largely been driven by technology stocks. The tech-dominated Nasdaq Composite is already up by more than 60% from its March lows. Moreover, the Nasdaq-100 Technology Sector Index hit a low of 3905.49 on March 18th and the ascent of the index has been noticeable for the past couple of months. It is now up by more than 61% from its low. With the level of risk prevailing in the given situation, it is always better to target large-caps stocks that are performing well. DocuSign, Inc. (DOCU), Fastly, Inc. (FSLY), Zscaler, Inc. (ZS), and Shopify Inc. (SHOP) are the four best performing large-cap tech stocks so far this year. 7 Best ETFs for the NEXT Bull MarketDocuSign, Inc. (DOCU) DOCU specializes in developing and marketing e-signature technology and solutions that enable businesses to digitally prepare, execute, and act on agreements. It provides cloud-based transaction products and services in the United States and internationally. DOCU’s platform has 350+ pre-built integrations with popular business apps. It has more than 500,000 customers and hundreds of millions of active users in over 180 countries. Amid increasing demand for solutions that enable remote completion of agreements, DOCU recently acquired an Austin-based start-up, Liveoak Technologies. In May, it also completed the acquisition of Seal Software, one of the leading contract analytics and artificial intelligence (AI) technology providers. Both of these acquisitions marked a step toward bringing the benefits of AI to the digital transformation of the agreement process. The company grew its customer base in the first quarter. Total customers increased 30%, and enterprise & commercial customers increased 49% year over year. DOCU’s free cash flow also grew by about 11% in the same quarter. The street awaits DOCU’s results estimating the current quarter’s EPS growth to be 700%. DOCU’s earnings surprise history looks impressive as well, with the company beating street estimates in three of the trailing four quarters. DOCU gained more than 200% year to date, and the company is consistently hitting fresh highs every trading day. How does DOCU stack up for the POWR Ratings? A for Trade Grade A for Buy & Hold Grade A for Peer Grade A for Industry Rank A for Overall POWR Rating You can’t ask for better. The stock is also ranked #5 out of 82 stocks in the Software – Application Industry. Fastly, Inc. (FSLY) FSLY is a real-time content delivery network (CDN) company. The company provides services in delivery, security, streaming media, e-commerce, and private CDN. With FSLY, the user can manage traffic spikes and mitigate security threats. It operates an edge cloud platform for its primary business services. The company recently announced that its network had reached 100 terabits per second (TBPS) of connected edge capacity, representing an important milestone as demand for modern digital experiences rises. Further, the Dollar-based Net Expansion for the first quarter increased 133% year over year. The market is, hence, expecting the company to post strong numbers this week for the second quarter. The EPS estimate of the quarter of negative $0.01 indicates an improvement of 93.8% from the year-ago number. The revenue estimate of $71.4 million indicates a year-over-year increase of 58.2%. FSLY’s reported EPS beat the street estimates in three of the trailing four quarters, which is impressive. FSLY is currently trading at $96.49 and has gained more than 455% year to date. FSLY’s POWR Ratings reflect this promising outlook. It has an overall rating of “Strong Buy” with an “A” for Trade Grade, Buy & Hold Grade, and Peer Grade. Zscaler, Inc. (ZS) ZS operates as a cloud security company worldwide. It develops and offers solutions that connect users to externally managed applications, including software-as-a-service platform and Internet destinations. ZS provides security services to more than 400 of the Forbes Global 2000 companies and has its footprint registered in more than 185 countries. ZS recently acquired Edgewise Networks, a pioneer in securing application-to-application communications for public clouds and data centers. It aims to offer the simplicity, enhanced security, and improved user experience that traditional appliances were unable to match. Further, in order to strengthen its liquidity, the company issued $1 billion worth Convertible Senior Notes in June. The last financials reported by ZS was for the third quarter of fiscal 2020. Revenues grew 40% year over year to $110.5 million. Calculated billings grew 55% year over year to $131.3 million. Cash provided by operations was $20.8 million, or 19% of revenue. Free cash flow stood at $9.1 million, or 8% of revenue, compared with 6% of revenue in the year-ago quarter. The price to trailing twelve-month operating cash flow for ZS is currently 257.61, higher than 98.69% of US stocks with positive operating cash flow in the StockNews.com universe. The company consistently reported an earnings surprise in each of the trailing four quarters. After recovering more than 280.3% from its 52-week low of $35, ZS’s year-to-date gain is more than 180%. It’s no surprise that ZS is rated a “Strong Buy” in our POWR Ratings system. It also has an “A” for Trade Grade, Buy & Hold Grade, and Peer Grade, and a “B” for Industry Rank. In the 23-stock Software – Security industry, it is ranked #3. Shopify Inc. (SHOP) SHOP is a Canada-based commerce company providing a cloud-based multi-channel commerce platform for small and medium-sized businesses. It focuses on providing merchants with a single view of business and customers in various sales channels. It powers over one million businesses worldwide by serving clients in Canada, the United States, the United Kingdom, Australia, and internationally. US e-commerce sales are expected to surge about 18% this year because the pandemic followed a rapid shift to online commerce. This proved its relevance as new shops created on SHOP’s platform grew 71% in the second quarter compared to the first quarter of 2020. Total revenue for the quarter came in at $714.3 million, a 97% increase from the comparable quarter last year. Subscription Solutions revenue was $196.4 million, up 28% year over year, primarily due to more merchants joining the platform. Merchant Solutions’ revenue growth accelerated for the third consecutive quarter, up 148% to $517.9 million, driven primarily by the growth of Gross Merchandise Volume (GMV). A colossal earnings surprise of 10400% was witnessed in the June quarter end as the EPS came in at $1.05 versus the consensus estimate of $0.01. SHOP is reaching new highs every day with the year-to-date surge of 172.4%. SHOP is rated a “Strong Buy” in our POWR Ratings system. It also has an “A” for Trade Grade, Peer Grade, and Buy & Hold Grade. It has a “B” in Industry Rank. It is also ranked #1 out of 34 stocks in the Internet – Services industry. Want More Great Investing Ideas? 9 “BUY THE DIP” Growth Stocks for 2020 How HIGH Can This Tech Bubble Fly? 7 “Safe-Haven” Dividend Stocks for Turbulent Times DOCU shares fell $0.68 (-0.30%) in after-hours trading Tuesday. Year-to-date, DOCU has gained 207.22%, versus a 3.60% rise in the benchmark S&P 500 index during the same period."}]}