{"article": [{"url": "https://stocknews.com/news/enfr-mlpa-amj-3-energy-stocks-poised-to-double/", "published": 1597406900.0, "headline": "3 Energy Stocks Poised to Double", "body": "2020 has been a wild ride for investors in energy infrastructure stocks. A range of factors, including energy demand destruction due to COVID-19, a meltdown of the high-yield investment sectors, and a perception that new, renewable energy technologies, will quickly replace oil and gas usage. Energy infrastructure, sometimes called energy midstream, are the services that gather, process, transport, and store energy commodities. The companies in the sector own and operate pipelines, storage terminals, and processing facilities. Half a decade ago, most midstream companies were organized as master limited partnerships (MLPs). In the current age, there are as many or more companies organized as corporations instead of as MLPs. From my observation, the stock market does not put extra value on one business structure—corporation or MLP—over the other. Midstream services generate steady fee-based revenues. However, the investing world does not give credit for the stable business results, and share prices can be very volatile. 9 \"BUY THE DIP\" Growth Stocks For 2020To illustrate the 2020 stock market cycles for energy infrastructure, let’s look at the Alerian MLP Infrastructure Index (AMZI). The AMZI constituents include the largest MLPs; all focused on providing energy midstream services. Here is the year-to-date chart from the Alerian website. Here is a quick recap of the swings down and up: From January 16 to the bottom on March 18, the AMZI lost 69% of its value. The February-March crash was part of a larger liquidity event that encompassed all of the high-yield investment sectors. From the March low, the index gained 130% by June 8. Because of the massive earlier decline, the significant gain off the bottom only recovered 60% of the first-quarter losses. For unknown reasons (at least no reasons that weren’t apparent earlier), from June 8 until July 14, the index again dropped, this time by 28%. Ouch! Over the last month, since mid-July, the AMZI has trended steadily higher, gaining 12%. Now, after the large value swings outlined above, the AMZI on a price basis is down 40% year to date. Calculating total return, including distributions, the are down 35% for the year. For value-focused investors, at this point, energy midstream looks very attractive. For the most part, companies in the sector have sustained distribution/dividend payments. Cash flow coverage of the distributions remains stable, and for many companies, the coverage is well above historical averages. Investors can count on continued dividend payments. Despite the dividend stability, the AMZI yields 12%—which is impressive! As we go through the next few quarters, investors may start to realize they can get double-digit yields from stocks with well-covered dividends and growth potential. I expect a 100% total return out of the energy midstream sector over the next year. Here are three midstream ETFs to consider: Alerian Energy Infrastructure ETF (ENFR) The Alerian Energy Infrastructure ETF (ENFR) tracks the Alerian Midstream Energy Select Index. The top three holdings are Enbridge, Inc. (ENB), Enterprise Product Partners LP (EPD), and TC Energy Corp. (TRP). The fund shares currently yield 7.1%. Global X MLP ETF (MLPA) The Global X MLP ETF (MLPA) invests in some of the largest, most liquid midstream MLPs. The top holdings are Enterprise Product Partners LP (EPD), Energy Transfer Partners LP (ET), and Magellan Midstream Partners LP (MMP). MLPA has $700 million in assets and currently yields 14%. JPMorgan Alerian MLP Index ETN (AMJ) The JPMorgan Alerian MLP Index ETN (AMJ) tracks the Alerian MLP Index (AMZ), which covers a broader group of publicly traded partnerships than the AMZI does. As an ETN, AMJ does not own midstream stocks. The shares are priced to track the index and are unsecured obligations of JP Morgan Chase. The current yield is 12.3%. Want More Great Investing Ideas? Top Dividend Stock to Own! Download Free Report Today Buy These 3 High-Yield Dividend Stocks All Under $15 Buy and Hold These 3 Dividend Stocks Forever ENFR shares were unchanged in after-hours trading Friday. Year-to-date, ENFR has declined -26.54%, versus a 5.73% rise in the benchmark S&P 500 index during the same period."}]}