{"article": [{"url": "https://stocknews.com/news/xom-inx-ixic-xle-vde-exxon-mobile-a-buy-sell-or-hold/", "published": 1598270900.0, "headline": "Exxon-Mobile- A Buy, Sell, Or Hold?", "body": "Energy stocks offer value in a bullish stock market XOM- A top holding in the XLE and VDE An over 8% dividend makes Exxon a long-term hold Bargains on the horizon- But politics weigh on the shares Crude oil recovered, and the trend remains bullish- Increased earnings in the coming quarters Exxon Mobile Corporation (XOM) could be the closest thing to a state-owned oil company in the United States. Almost all companies in the energy patch lagged the overall stock market over the past few years. XOM shares have been no exception. At just over $41 per share at the end of last week, XOM’s market cap was just below the $174 billion level. At the same time, Apple (AAPL) reached the $2.127 trillion mark. The technology company has more cash than the total market capitalization of XOM. Exxon Mobile explores for and produces crude oil and natural gas in the United States, Canada, and worldwide. The company operates through three segments, Upstream, Downstream, and Chemicals. As of the end of 2019, XOM had over 23,800 wells with proven reserves of 22.4 billion barrels of crude oil. XOM also produces raw materials such as polypropylene and isopropyl alcohol for medical masks, gowns, and hand sanitizer. The company’s headquarters are in Irving, Texas, and has been around since 1870. 7 Best ETFs for the NEXT Bull MarketThe current state of the global economic landscape could make XOM shares a bargain at the $41 level. However, the potential for political change in the United States could be weighing on the price of the stock. Energy Stocks Offer Value in a Bullish Stock Market The stock market made a V-shaped recovery since the March lows when share prices plunged on the back of the global pandemic. Source: Barchart The chart of the S&P 500 index shows that it fell from a record high of 3,393.52 on February 19 to a low of 2,191.86 on March 23, a drop of 35.4% in a little over one month. Last week, the index traded to a high of 3,399.96, a new record high. The index closed last week at just below the high. The tech-heavy NASDAQ has done even better than the S&P 500 since late March. Source: Barchart After reaching a record peak at 9,838.37 on February 19, the NASDAQ index fell by 32.6% to 6,631.42 on March 23. On June 5, the NASDAQ surpassed the mid-February high, and it kept on going. The most recent high at 11,326.21 last week was 70.8% above the late March low. The NASDAQ was trading at over 11,310 at the end of last week. Meanwhile, energy-related stocks have lagged the overall stock market. XOM- A Top Holding in the XLE and VDE The S&P 500 Energy Sector SPDR (XLE) traded to a high of $55.40 on February 20. The ETF was nowhere near its record high, which was at $101.52 in 2014. Over the past few years, the XLE has made lower highs and lower lows. Source: Barchart In March 2020, when the stock market plunged, the XLE reached a low of $22.88, less than one-quarter the value in 2014, and under half the level in late February. Energy stocks have been the redheaded stepchildren of the stock market. At $36.03 at the end of last week, the XLE recovered by 57.5%, but it remains at almost one-third the level of the record peak. The XLE and the Vanguard Energy Index Fund ETF Shares (VDE) have net assets of $10.4 billion and $3.47 billion, respectively. Each of the leading energy-related ETFs holds a significant percentage of their assets in XOM shares. Source: Yahoo Finance The XLE has 22.62% of its assets invested in XOM shares. Source: Yahoo Finance XOM is VDE’s top holding with a 22.59% allocation. Source: Barchart As the chart shows, XOM reached an all-time high of $104.76 per share in June 2014. In early January 2020, the shares peaked at $71.37 and fell to a low of $30.11 on March 23. At the end of last week, the shares were just above the $41 per share level. XOM is one of the leading integrated oil companies in the United States, and its shares are downright cheap compared to the rest of the stock market. XLE and VDE hold almost one-quarter of their assets in XOM shares because they are a leader in the industry. An Over 8% Dividend Makes Exxon a Long-Term Hold As of August 21, XOM had a market cap of $173.4 billion. The stock trades an average of over 22 million shares each day. XOM pays its shareholders a $3.48 dividend, which equates to 8.5% at $41.01 per share. The dividend alone is a reason to consider holding XOM for the long-term at its current share price. The average dividend yield of the S&P 500 is around half the level offered by XOM shares. XOM has reported profits in three of the past four quarters. Source: Yahoo Finance As the chart illustrates, XOM posted a loss of 70 cents per share in Q2 2020, one of the most challenging quarters for all businesses in our lifetime. Meanwhile, the price of crude oil fell to negative territory during Q2. The decline in business activity and the price of oil combined to cause the loss. The consensus projection for Q3 2020 is for a smaller three cents per share loss. A survey of twenty analysts on Yahoo Finance has an average target of $47.95 per share for XOM. The range is from $39 to $77 per share. Bargains on the Horizon- But Politics Weigh on the Shares XOM is a leading US oil company that competes with producers around the world. In an environment where weaker producers and energy-related businesses are facing bankruptcy, XOM is in a perfect position to pick up assets for pennies on the dollar over the coming months and years. Over the past weeks, Warren Buffett gave the energy sector a shot in the arm when he purchased the transmission and pipeline assets of Dominion Energy (D) for $10 billion. There are likely to be other energy bargains on the table that would improve XOM’s position and earnings in the coming years. The November 2020 election in the US will stand as a referendum on the future of energy policy among a host of other political issues. President Trump has been a supporter of energy independence for the US. Former Vice President Joe Biden and the Democrats favor the “Green New Deal.” A change in administrations would have consequences for the energy business in the US, its future as the world’s leading producer of crude oil and natural gas, and for Exxon Mobile. The company’s website goes into great detail about its commitment to “fueling the world safely and responsibly.” With Democrats leading in the polls, shares of energy-producing companies continue to experience selling pressure. Crude Oil Recovered, and the Trend Remains Bullish- Increased Earnings in the Coming Quarters The stock market recovered, but XOM shares have lagged the equity arena for years. Meanwhile, crude oil and natural gas prices have also recovered, which should contribute to XOM’s earnings. Source: CQG The chart of the active month October NYMEX crude oil futures contract highlights that the price of the energy commodity rose from a low of $23.26 on April 22 to the most recent high of $43.68 on August 5. At just above the $42 per barrel level at the end of last week, crude oil was not far below the recent peak. Crude oil has made higher lows and higher highs since late April, and the bullish trend in the energy commodity remained intact as of August 21. Source: CQG The weekly chart of NYMEX natural gas futures shows that the price rose from a twenty-five-year low of $1.432 per MMBtu in late June to the $2.441 level on August 21. Crude oil moved almost 85% higher since April, and natural gas recovered by over 70% since June. The higher energy prices translate into profits for XOM and the other leading oil and gas producing companies. I rate XOM a buy at $41.01 per share on August 21. Rising oil and gas prices and a record high in the stock market are supportive of the stock. Moreover, a falling US dollar, record low interest rates, and unprecedented levels of government and central bank stimulus are a potent bullish cocktail for commodity prices. Energy is no exception. I believe we will look back at XOM shares at the $41 level as a bargain-basement price in the coming years. The over 8% dividend is a bonus that pays investors while waiting for capital appreciation. There are not many bargains in the stock market these days, but XOM stands out as a company that provides substantial value. Want More Great Investing Ideas? The Best of StockNews 2 Step Process to Sell @ Market Top in September 9 “BUY THE DIP” Growth Stocks for 2020 XOM shares rose $0.30 (+0.73%) in premarket trading Monday. Year-to-date, XOM has declined -37.59%, versus a 7.42% rise in the benchmark S&P 500 index during the same period."}]}