{"article": [{"url": "https://stocknews.com/news/veev-baba-adbe-amzn-xlk-4-tech-stocks-to-buy-and-hold-for-decades/", "published": 1599048500.0, "headline": "4 Tech Stocks to Buy and Hold for Decades", "body": "We know technology stocks have primarily driven the recent five-month rally as the SPDR Technology Select ETF (XLK) is up 38.6% year to date, compared with the S&P 500’s gain of 10.9%. But which stocks are going to perform well over the next few decades? If I’m thinking long-term, I want a stock with a wide economic moat. An economic moat is when a company has a sustainable competitive advantage that makes it difficult for its rivals to gain market share. There are a lot of tech stocks trading with very high valuations. Some deserve those valuations, and some do not. Assuming the market is in a bubble right now, you don’t want to be holding onto a stock that won’t withstand a sharp market decline. Even with a long-term horizon, the volatility of many tech stocks can cause heartburn for any investor. A wide-moat stock can typically withstand market downturns and unfavorable economic environments and protect its long-term profits from new competitors. To find tech stocks for the long-term, I came up with a list of all the technology companies that I knew of which had competitive advantages. I then filtered out stocks that didn’t have a robust 3-year revenue growth history (over 20%) and a high return on equity (over 20%). This gave me a list of the following tech stocks that should maintain dominance over the next few decades: Veeva Systems (VEEV), Alibaba Group Holding (BABA), Adobe (ADBE), and Amazon.com (AMZN). 9 \"BUY THE DIP\" Growth Stocks For 2020Veeva Systems (VEEV) VEEV is a leading supplier of vertical software solutions for the life sciences industry. The company’s best-of-breed offering addresses operating and regulatory requirements for customers ranging from small, emerging biotechnology companies to global pharmaceutical manufacturers. The firm leverages its domain expertise and a cloud-based platform to improve efficiency and compliance for the underserved life sciences industry. The company’s dominant position in the customer relationship management (CRM) space for life sciences is strong and growing. The coronavirus pandemic could drive greater demand for its cloud offerings and create additional opportunities for the company. The life sciences industry has been slow in embracing cloud-based software, but that should change as the industry gradually realizes the benefits of cloud-based applications due to the rising regulations and budgetary constraints. VEEV is in the driver’s seat to benefit from an industry-wide adoption of cloud-based software. As VEEV is a first mover with software geared towards the life sciences industry, it has wide-moat status. It would be difficult for new entrants to encroach on VEEV’s position. VEEV is rated a “Strong Buy” in our POWR Ratings system. The company holds grades of “A” in three out of the four components that make up the POWR Ratings, including Trade Grade, Buy & Hold Grade, and Peer Grade. It is also the #1 ranked stock in the Medical-Services industry. Alibaba Group Holding (BABA) BABA is the world’s largest online and mobile commerce company. It operates China’s most-visited online marketplaces, including Taobao, a consumer-to-consumer marketplace, and Tmall, a business-to-consumer marketplace. The company’s China marketplaces accounted for 68% of revenue in fiscal 2019. Taobao generates revenue through advertising and other merchant data services, and Tmall generates revenue through commission fees. BABA has been benefiting from both a shift to e-commerce and the migration of software to cloud computing. The company has wide-moat status due to being a first-mover in China and its formidable competitive advantages in its brand and its ability to scale. It has a strong network effect as its value increases as more sellers get onto the platform, and more consumers make purchases. Growth should continue as China and Southeast Asia are still a relatively untapped region for digital commerce. Both areas should see an increase in consumer income and spending over time. Also, more people in those regions are gaining access to the internet, which will only increase BABA’s revenue. BABA is rated a Strong Buy in our POWR Ratings. It holds a grade of A in three out of the four components, including Trade Grade, Buy & Hold Grade, and Peer Grade. It is also the #1 ranked stock in the China industry category. (BABA is one of the stocks currently in the Steve Reitmeister’s Total Return portfolio. Learn more here.) Adobe (ADBE) ADBE provides content creation, document management, and digital marketing and advertising software and services to creative professionals and marketers. The company operates with three segments: digital media content creation, digital experience for marketing solutions, and publishing for legacy products. It is one of the largest software companies in the world. The bulk of its revenue is generated through licensing fees from customers. The company should see long-term growth due to both secular and corporate growth catalysts. The global growth of creative professionals, the transition to the cloud, and its non-paying customers’ higher monetization will drive growth for ADBE. The company has wide-moat status due to its highly sustainable competitive advantages in the digital media space. ABDE provides the best solutions for creative professionals in digital media design and publishing. It should continue to dominate the creative segment for the foreseeable future. ADBE is rated a Strong Buy in the POWR Ratings. It holds straight As in every POWR component. It is also the #2 ranked stock in the Software Application industry. Keep an eye out on September 15 when ADBE announces its latest earnings results. Amazon.com (AMZN) When you think of a tech company with a strong competitive advantage, I’m sure AMZN is the first one that comes to mind. AMZN is one of the world’s highest-grossing online retailers. The company’s online retail business is centered around its Prime subscription product and its huge distribution network. The company has a footprint in the physical grocery business through its acquisition of Whole Foods Market. AMZN is also the dominant player in the cloud-computing market due to Amazon Web Services (AWS). Also, the broad adoption of its Alexa powered Echo devices helps the company sell products and services. AMZN should continue to benefit from a rising e-commerce market and its rapidly growing AWS business. The shifts in consumer behavior driven by the pandemic will only strengthen its hold on e-commerce and cloud computing. As the company invests more into its one-day delivery initiative, its Prime membership base should continue to grow. AMZN has its wide-moat status due to its position as the most disruptive force in retail. The company recently announced the Amazon Halo, a healthcare monitoring subscription device. This device will compete with the Apple (AAPL) watch and the Fitbit (FIT). The product joins AMZN’s other healthcare initiatives, including Haven Healthcare and PillPack. The Halo, which will cost $99 upfront and $4 a month after six months, will only add more revenue to AMZN’s prime subscriptions. The company is rated a Strong Buy and has straight As in every POWR component. It is also the #1 ranked stock in the Internet industry. Want More Great Investing Ideas? 7 Best ETFs for the NEXT Bull Market Beware Stocks in September? 9 “BUY THE DIP” Growth Stocks for 2020 VEEV shares . Year-to-date, VEEV has gained 111.20%, versus a 12.28% rise in the benchmark S&P 500 index during the same period."}]}