{"article": [{"url": "https://stocknews.com/news/syy-alxn-tdg-nwl-4-sp-500-stocks-with-heavy-insider-buying/", "published": 1596542900.0, "headline": "4 S&P 500 Stocks with HEAVY Insider Buying", "body": "Insider buying occurs when someone in a company, who is considered to be an insider, buys the stock of their own company. The insider is typically an executive or a manager who owns more than 10% of its stock. These insiders generally have the most up to date information on a company and its outlook. This can include a company’s financial situation, order flow, or other key drivers of success. Insider buying can be a reliable indicator of whether the stock may go up. Insiders are good at buying stocks since they usually know more than fund managers and analysts. When an insider buys shares in their own company, it shows that the insider has faith in the future of their company. Many academic papers show that insider buying is a good indicator of positive price performance. In his paper, “Investment Intelligence from Insider Trading”, University of Michigan finance professor Nejat Seyhun showed that stocks with heavy insider buying outperformed the market by 4.5%. For this article’s purposes, I focused on stocks in the S&P 500 since they are stable and on the larger size. The stocks with the highest insider buying were: Sysco Corporation (SYY), Alexion Pharmaceuticals (ALXN), TransDigm Group (TDG), and Newell Brands (NWL). 9 \"BUY THE DIP\" Growth Stocks For 2020Sysco Corporation (SYY) SYY is the largest U.S. food service distributor, with a 16% market share in the food service distribution industry. The company distributes over 400,000 food and non-food products to restaurants, healthcare facilities, retail, education and government buildings, and other locations where individuals eat meals away from home. The company was hit hard after posting poor third-quarter results on May 5. As people stayed at home due to the coronavirus, sales of eating away from home were lowered. Nevertheless, the company focused on other opportunities, like providing catering to grocery stores and retailers. The company also made investments in the digital space and cut costs to keep its balance sheet stable during the pandemic. The company saw a 273.42% change in insider transactions. Keep an eye out on August 11 before the market opens, as SYY is releasing its latest earnings report. Alexion Pharmaceuticals (ALXN) ALXN specializes in developing and marketing drugs for rare, life-threatening medical conditions. Its top drug, Soliris, is approved for paroxysmal nocturnal hemoglobinuria (PNH), atypical hemolytic uremic syndrome, generalized myasthenia gravis, and neuromyelitis optica spectrum disorder. The company’s next-generation drug Ultomiris is approved for PNH and aHUS. The company should benefit from recent label expansions of Soliris. ALXN is looking to expand the label even more, which should boost sales. Potential label expansions of Ultomiris should contribute to growth as well. ALXN is also assessing Ultomiris for possible treatment for COVID-19 infection. ALXN acquired Achillion Pharmaceuticals to increase its PNH line. Achillion focuses on developing oral small molecule Factor D inhibitors to treat people with complement alternative pathway-mediated rare diseases, including PNH. ALXN, which saw an increase of 267.52% in positive insider transactions, beat analyst estimates for the third quarter with earnings per share of $3.11 and revenue of $1.44 billion. TransDigm Group (TDG) TDG manufactures products for electronic, power, fluid, and mechanical motion control onboard commercial and military aircraft and helicopters. The company also supplies products used for cabin structures, lighting, laminates, pallets, and other applications. TDG expects the demand for commercial products to be reduced in the second half of 2020 due to the pandemic. However, the company has seen strong growth in the defense space. This is due to the expanded budget adopted by the administration. The company’s defense business saw 11% year over year revenue growth in the fiscal first quarter. The company reported third-quarter earnings this morning with an EPS of $1.54, which soundly beat analyst expectations of $0.84. The company has seen a 259.17% increase in positive insider transactions, which is a promising sign. Newell Brands (NWL) NWL is an American global consumer goods company. The business is structured through four segments, including Appliances and Cookware, Food and Commercial, Home and Outdoor Living, and Learning and Development. The Appliances and Cookware unit generates most of the revenue for the company. Products are sold at department stores, drug and grocery stores, specialty retailers, and distributors. NWL’s stock is up over 34% over the past three months. It reported earnings last week of $0.30, which beat the consensus estimate of $0.18. This is the four straight quarters of earnings beating estimates. The company has recently raised its operating margin through increased productivity and cost savings. NWL has performed well even during the pandemic. Due to shifting consumer preferences, the company’s Food, Commercial, Appliances & Cookware, and Outdoor & Recreation segments have benefited. The company saw a 186.45% increase in positive insider transactions. The company is rated a Buy in our exclusive momentum-based POWR Ratings. It is the #24 ranked company in the Home Improvement & Goods industry. Want More Great Investing Ideas? 9 “BUY THE DIP” Growth Stocks for 2020 How HIGH Can This Tech Bubble Fly? 7 “Safe-Haven” Dividend Stocks for Turbulent Times SYY shares rose $0.08 (+0.15%) in after-hours trading Tuesday. Year-to-date, SYY has declined -35.18%, versus a 3.60% rise in the benchmark S&P 500 index during the same period."}]}