{"article": [{"url": "https://stocknews.com/news/kkr-kss-bak-tv-lfc-top-5-large-cap-dividend-stocks-for-july-8-2020/", "published": 1594210100.0, "headline": "Top 5 Large Cap Dividend Stocks for July 8, 2020", "body": "The top winners in the large cap US dividend space for Wednesday, July 8, 2020 are KKR, KSS, BAK, TV, and LFC. Below is a recap of how they fared. KKR & Co Inc (KKR) Daily Price Recap The back and forth price flow continues for KKR & Co Inc, which started today off at 33.88 US dollars, up 10% ($3.08) from the day prior. The price move occurred on volume that was up 159.07% from the day prior, but down 75.63% from the same day the week before. The daily price chart of KKR & Co Inc below illustrates. As for KKR’s annual compound dividend growth rate, it is currently higher than that of approximately 4.05% US dividend payers. 9 \"BUY THE DIP\" Growth Stocks For 2020What is the outlook for KKR? Use POWR Ratings for clearer insight into price direction. KOHLS Corp (KSS) Daily Price Recap KOHLS Corp entered today at $22.25, up 9.61% ($1.95) from the day prior. The price move occurred on stronger volume; specifically, yesterday’s volume was up 124.43% from the day prior, and up 33.85% from the same day the week before. Below is a daily price chart of KOHLS Corp. Dividend investors may wish to pay attention to the dividend discount model value score of dividend stocks, and for KSS, its higher than that of 82.86% of US dividend-issuing stocks. Is KSS a Buy, Hold or Sell? See the POWR Ratings now! Braskem Sa (BAK) Daily Price Recap The choppiness in the recent daily price action of Braskem Sa continues; to start today, it came in at a price of 9.52 US dollars, up 7.57% ($0.67) since the previous day. As for how volume fared, yesterday’s volume was up 77.93% from the previous day (Monday), and up 77.49% from Tuesday of the week before. The daily price chart of Braskem Sa below illustrates. Its equity discount rate is lower than 1.86% of US dividend stocks. Make investment decisions regarding BAK using the data that counts. Learn more about POWR Ratings. Grupo Televisa Sab (TV) Daily Price Recap Grupo Televisa Sab entered today at $5.57, up 7.53% ($0.39) from yesterday. As for how volume fared, yesterday’s volume was up 64.29% from the previous day (Monday), and up 122.29% from Tuesday of the week before. Here is a daily price chart of Grupo Televisa Sab. As for TV’s dividend yield, it is currently higher than that of approximately 22.38% US dividend payers. Is TV a Buy, Hold or Sell? See the POWR Ratings now! China Life Insurance Co Ltd (LFC) Daily Price Recap 13.43 was the closing price of the day for China Life Insurance Co Ltd, resulting in today being one in which price moved up 6.76% ($0.85) from the previous day. The change in price came along side change in volume that was down 7.16% from previous day, but up 259.76% from the Tuesday of last week. Let’s take a look at the daily price chart of China Life Insurance Co Ltd. Its beta is lower than 81.51% of US dividend stocks. Make investment decisions regarding LFC using the data that counts. Learn more about POWR Ratings. To further your research on dividend stocks, check out our list of dividend stocks sorted by yield. Want More Great Investing Ideas? 9 “BUY THE DIP” Growth Stocks for 2020 Is the Bull S#*t Rally FINALLY Over? 7 “Safe-Haven” Dividend Stocks for Turbulent Times Top 3 Investing Strategies for 2020 KKR shares rose $0.12 (+0.35%) in after-hours trading Wednesday. Year-to-date, KKR has gained 17.22%, versus a -0.75% rise in the benchmark S&P 500 index during the same period."}]}