{"article": [{"url": "https://stocknews.com/news/iipr-med-dl-3-dividend-stocks-with-explosive-growth/", "published": 1601035700.0, "headline": "3 Dividend Stocks with EXPLOSIVE Growth", "body": "Growth stocks are all the rage these days and for good reason. The iShares Core S&P 500 U.S. Growth ETF (IUSG), which can be seen as a benchmark for growth-oriented stocks, has delivered a year-to-date return of 13.6%. In comparison, the S&P 500 is up just 0.5% over this period. A good way to find growth stocks that have a high potential for upside is to look at lesser known stocks that are on the verge of breaking out in the coming years. In addition to growth, investors should also consider a company’s dividend income prospects given the expectations of the continuation of economic uncertainties and market volatility for the foreseeable future. Stocks providing high dividend yields and possessing solid growth features are a winning pair. Innovative Industrial Properties, Inc. (IIPR), Medifast, Inc. (MED), and China Distance Holdings Limited (DL) are three such stocks to consider. 9 \"BUY THE DIP\" Growth Stocks For 2020Innovative Industrial Properties, Inc. (IIPR) IIPR owns and leases out dedicated industrial-use real estate properties. IIPR focuses on the development and construction of specialized facilities for use in the regulated cannabis-growing industry in the United States. IIPR’s stock has gained 57.3% year-to-date. IIPR is looking to expand quickly by acquiring and developing new properties, such as the north Detroit property which it has recently bought. The company also acquired a Florida property and expanded its partnership with Parallel, a US-based cannabis company. The company has declared a third quarter dividend of $1.17 per common share, which is an increase of 10% from their second quarter dividend. The company has been delivering an annual dividend of $4.2 which translates into a yield of 3.6%. The company’s revenue is expected to grow 146% this year and 76.3% next year. The company’s EPS is estimated to rise 60.1% this year and 63.7% next year. How does IIPR stack up for the POWR Ratings? A for Trade Grade B for Buy & Hold Grade A for Peer Grade B for Industry Grade A for Overall POWR Rating The stock is also ranked #7 out of 21 stocks in the REITs – Industrial industry. Medifast, Inc. (MED) MED develops and markets weight-loss and weight-management products and programs. The company’s OPTAVIA is one of the fastest growing health and wellness communities in the United States. MED’s stock has delivered returns of 50% so far this year. The company has been focusing on driving growth through OPTAVIA coaching programs. MED recently hosted the successful OPTAVIA Together Live broadcast event, which replaced its traditional in-person conventions. In the second quarter, revenue for the company increased 17.6% compared to the same period last year. The EPS of the quarter increased 6.2%. The company has declared a quarterly dividend of $1.13 per share. MED’s annual dividend of $4.52 translates into a yield of 2.75%. MED’s revenue is expected to grow 22.3% this year and 17.6% next year. The company’s EPS is estimated to rise 36.5% this year and at a rate of 20% per annum over the next five years. It’s no surprise that MED is rated a “Buy” in our POWR Ratings system, with a grade of “A” in Trade Grade and Peer Grade. In the 14-stock Medical – Consumer Goods industry, it is ranked #2. China Distance Holdings Limited (DL) DL provides distance learning solutions in China. The company operates in both offline and online segments along with offering related products. DL’s stock has returned 14.8% so far this year. For the nine months that ended on June 30th, the company reported an increase in net revenue of 0.6%, while revenue from online education services increased 11.9%. In June, DL received a buyout proposal from the company’s executives. Under the proposal, the buyers plan on funding the purchase with a combination of debt and equity capital. The company is currently reviewing the proposal. The company delivers an annual dividend of $0.56, which translates into a yield of 6.03%. The company’s dividend yield ranks #2 out 120 of its peers in the China industry in the Stocknews.com universe. MED’s revenue is expected to grow 15.4% next year. The company’s EPS is estimated to rise 120% next quarter and 12.2% next year. MED’s strong fundamentals are reflected in its POWR Ratings. It has a “Buy” rating with a grade of “A” in Trade Grade and Peer Grade. In the 115-stock China industry, it is ranked #21. Want More Great Investing Ideas? 7 “Safe-Haven” Dividend Stocks for Turbulent Times When Does the Next Bull Run Start? Chart of the Day- See the Stocks Ready to Breakout IIPR shares were trading at $122.02 per share on Friday afternoon, up $2.71 (+2.27%). Year-to-date, IIPR has gained 64.80%, versus a 2.75% rise in the benchmark S&P 500 index during the same period."}]}