{"article": [{"url": "https://stocknews.com/news/tsla-nio-plug-3-electric-vehicle-stocks-to-supercharge-your-portfolio/", "published": 1594210100.0, "headline": "3 Electric Vehicle Stocks to Supercharge Your Portfolio", "body": "Stocks in the electric vehicle sectors are experiencing huge gains. Investors are betting on a future in which electric vehicles become the predominant form of transportation. These stocks have been strong despite the overall auto market suffering deep losses. Automakers are getting hit on both sides. The economic uncertainty is negatively affecting auto sales. Additionally, they have an intricate supply chain with a just-in-time inventory system. Due to the shutdowns, production has been hampered across the supply chain which is disrupting their ability to build and ship vehicles. 9 \"BUY THE DIP\" Growth Stocks For 2020Sales of manufacturers such as Toyota (TM), General Motors (GM), and Fiat Chrysler (FCAU) saw a decline in sales of 33% or more in the second quarter of this year. The KraneShares Electric Vehicles and Future Mobility Index ETF (KARS), which is composed solely of electric vehicle stocks, has witnessed a price gain of 14.7% this year versus the S&P 500’s (SPY) loss of 2.7%. Here are three electric vehicle stocks that are expected to continue to outperform the market. Tesla (TSLA) TSLA is currently the largest player in the American electric vehicles market. The company has reported that it built 82,272 vehicles in the last quarter which outpaced analysts’ prediction of production of fewer than 70,000 vehicles. TSLA is expected to deliver an annual total of 500,000 vehicles by the end of the year. By conventional metrics, Tesla’s valuation is head-scratching. For example, it is worth 20% more than Toyota. Yet, it’s going to produce and sell 100,000 cars this year, while Toyota will sell more than 10 million. It makes more sense when you consider that Tesla has a leading position in electric vehicles, self-driving technology, and batteries. All of these are trillion-dollar opportunities, and Tesla has a leading position. Like many tech sectors, it could become a winner-take-all due to network effects. With this logic, Tesla’s valuation makes much more sense. Momentum is on Tesla’s side, as the stock is up 232.2% year to date. Before the coronavirus, it was a hot, momentum stock chased over the $1,000 level by retail traders. The market crash resulted in a 60% decline. However, Tesla now has more than tripled from these lows. TSLA is ranked #1 out of 27 other stocks in the auto manufacturing industry. It has an overall rating of Strong Buy in the POWR Ratings, along with an “A” for Trade Grade, Buy & Hold Grade, and Peer Grade. Nio Inc. (NIO) NIO is a Chinese electric vehicle manufacturer that operates under the EP9, EVE, and ES8 brands. It delivered a total of 10,331 vehicles in the last quarter. In June, the company produced 3,740 vehicles which are an increase of 179% year over year. Apart from growth in production, NIO achieved record sales for two consecutive months — May and June. This led to its strongest quarterly performance so far. Despite NIO’s success in creating something that consumers want, it was facing a short-term funding hurdle which was leading to some rumors of bankruptcy. Due to this, NIO didn’t participate in the EV stock rally for much of March and April. However, the Chinese government stepped up with $1 billion in funding which alleviated these short-term concerns, and the stock rocketed higher. Over the last two months, NIO has gained 225 which is in-line with its YTD return. NIO has an overall rating of Strong Buy in the POWR Ratings system, along with an “A” for Trade Grade, Buy and Hold Grade, Industry Rank, and Peer Grade. NIO is ranked #8 out of 115 Chinese stocks. Plug Power (PLUG) PLUG is an alternative energy technology company. It focuses on the development and manufacture of hydrogen fuel cell systems. Its fuel cell systems are used in a variety of electric mobility systems. Companies such as Amazon (AMZN) and Walmart (WMT) already use PLUG’s fuel cells to power their forklifts. The fuel cells developed by PLUG can provide greater power for less cost than electric batteries. Hydrogen fuel cells are an exciting area due to their low emissions and capacity to generate huge amounts of energy. Nikola Motor (NKLA) is another company that’s attempting to develop hydrogen fuel cells to power their trucks. PLUG’s stock has doubled over the last 5 weeks. There have been huge inflows into the EV space which started with the larger companies and is now leaking into smaller ones. Being bullish on PLUG is essentially betting on its technology. A larger company could buy it due to its progress in developing fuel cells and further commercialize it. PLUG is growing sales at 89% on a year over an impressive year basis, but it only has 12% gross margins. PLUG has an overall rating of Buy under the POWR Ratings. It also has an “A” for Trade Grade and Peer Grade. For Industry Rank and Buy & Hold Grade, it has a “B”. Want More Great Investing Ideas? 9 “BUY THE DIP” Growth Stocks for 2020 Is the Bull S#*t Rally FINALLY Over? 7 “Safe-Haven” Dividend Stocks for Turbulent Times Top 3 Investing Strategies for 2020 TSLA shares . Year-to-date, TSLA has gained 228.93%, versus a -0.75% rise in the benchmark S&P 500 index during the same period."}]}