{"article": [{"url": "https://stocknews.com/news/tho-cwh-golf-3-great-outdoors-stocks-to-buy-during-the-pandemic/", "published": 1595246900.0, "headline": "3 \"GREAT OUTDOORS\" Stocks to Buy During the Pandemic", "body": "States are once again re-closing businesses and other operations now that the coronavirus is back in full force. Though most Americans can’t catch a movie at a local theater, attend a professional sports event, or visit an amusement park, it is possible to have some fun in the sun. There is plenty to do between camping, golfing, fishing, and other outdoor activities, even though most businesses are closed. Thor Industries (THO), Camping World (CWH), and Acushnet Holdings (GOLF) are three stocks poised to benefit from the masses spending their time camping, golfing, and enjoying nature’s beauty. Thor Industries (THO) 7 \"SAFE HAVEN\" Dividend Stocks for Turbulent TimesThanks to the coronavirus, recreation vehicles (RVs) have never been more popular. People are scooping up RVs left and right, spending their vacations driving across America while taking in the heartland’s beauty. THO sells RVs in North America as well as Europe. THO also sells accessories and parts used in RVs. All in all, THO and its subsidiaries constitute the largest RV-maker on the continent based on revenue and unit sales. Take a walk around your block, and you are nearly guaranteed to see at least one THO product. The company’s subsidiaries include Jayco, Keystone, Airstream, KZ, and Thor Motor Coach. The POWR Ratings reveal THO is ranked 8th out of 27 stocks in the Auto & Vehicle Manufacturers category with an A Trade Grade and B grades in the other POWR Components. Analysts have a $115.80 price target. The bottom line is that there is not much else to do outside except take a road trip with an RV, camp, fish, and sit around a bonfire. Unless there is a surprise vaccine over the next couple of months, THO can move higher, possibly reaching its 52-week high of $118 before summer’s end. Camping World (CWH) Take a look at CWH’s RV inventory, and you are sure to find one that suits your needs. Aside from an assortment of RVs with varying sizes and styles, CWH also operates the Good Sam RV owner membership club that provides protection plans and auxiliary services. CWH’s POWR Ratings show the company is ranked in the top three of more than 30 stocks in the Athletics & Recreation category. CWH has A grades in all POWR Components except for its Industry Rank, which is B. CWH has been on a roll as people are hesitant to hop on an airplane and breathe in the air circulating in what is essentially a shared metal tube. Instead, Americans are taking the DIY (do it yourself) route by buying or renting an RV and venturing cross-state or cross-country for a rewarding vacation. This explains why CWH is merely a couple of dollars away from its 52-week high of $36.55. If you think the pandemic will linger into the fall, winter, spring, and possibly beyond, CWH belongs in your portfolio. The only thing that can stop CWH is the rapid development of a highly-effective coronavirus vaccine over the next 100 days. If no such vaccine is available by the time winter rolls around, there is likely to be a nasty second wave that prompts even more Americans to buy RVs for 2021 spring road trips. Acushnet Holdings (GOLF) It is no secret golf declined in popularity after Tiger Woods’ career tailed off. However, thanks to COVID-19, golf is once again en vogue. People have plenty of time to burn, few options, and desperately want to get out of the house. Golf is the perfect way to spend three or four hours outside on a sunny summer day, breathing in the fresh air, getting exercise, and having a blast with friends or family. GOLF makes and distributes a wide variety of golf products. Examples of include Titleist golf clubs/gear and FootJoy golf apparel. The rising popularity of golf amidst the pandemic has catapulted GOLF to within a dollar of its 52-week high of $37.12. The GOLF POWR Ratings are quite impressive: a top 5 ranking of more than 30 publicly traded companies in the Athletics & Recreation category, an A Trade Grade, an A Buy & Hold Grade, and Bs in the other POWR Components. Want More Great Investing Ideas? 9 “BUY THE DIP” Growth Stocks for 2020 Newly REVISED 2020 Stock Market Outlook 7 “Safe-Haven” Dividend Stocks for Turbulent Times THO shares were trading at $111.67 per share on Monday afternoon, up $1.63 (+1.48%). Year-to-date, THO has gained 52.33%, versus a 1.80% rise in the benchmark S&P 500 index during the same period."}]}