{"article": [{"url": "https://stocknews.com/news/swbi-rgr-2-gun-stocks-for-the-second-half-of-2020/", "published": 1594123700.0, "headline": "2 Gun Stocks for the Second Half of 2020", "body": "In just the month of June 2020, 2.3 million guns were sold. This is an increase of 145% from June 2019, and it’s the second-highest ever other than March of this year when 2.5 million were sold. April and May were also strong with 1.7 million and 1.8 million sold, respectively. March’s sales were due to the coronavirus and the shutdowns. Gun sales remained strong as they tend to be during periods of economic stress. However as political tensions increased, they saw another surge. Gun stocks tend to outperform during this climate whether it’s for hunting or self-defense. For portfolios, they are also a source of diversification given that they tend to trade independently from the broader market. 7 \"SAFE HAVEN\" Dividend Stocks for Turbulent TimesWe have identified two gun stocks with attractive fundamentals. Each of these stocks is highly rated by POWR Ratings. Smith & Wesson (SWBI) SWBI, with a market cap of $1.3 billion, focuses on the production of firearms such as guns, ammunition, handcuffs, and suppressors. The company is benefiting from the increase in gun sales and recently increased its earnings forecast for the next quarter. Another catalyst is the November elections which brings the possibility of increased gun regulation which could impact some of the company’s products. As of April 30, 2020, there has been a 6.3% year-over-year increase in total revenue and a 3.7% increase in gross profit for SWBI. The company has returned 157.3% over the past year, 205% over the past three months, and 149.8% year to date. The stock is just off its 52-week high of $24.71. Our POWR Ratings system rates SWBI a Strong Buy. It has an “A” for Trade Grade, Buy & Hold Grade, Peer Grade, and a B for Industry Rank. It ranks #5 out of 32 stocks in the Athletics & Recreation group. Sturm, Ruger & Company, Inc. (RGR) RGR, based in Southport, Connecticut, is one of the leading firearms manufacturers in America. It’s also benefiting from the same trends as SWBI. RGR makes smaller guns that are popular for first-time buyers and women. The company’s EPS has increased by 17.6% year over year in the first quarter. Over the past 12 months, RGR earned $1.94 in earnings per share, and it expects to earn $3.04 over the next 12 months. RGR has a current ratio of 4.23 which means its balance sheet is solid. RGR has returned 47.1% over the past year, 54.6% over the past three months, and 68% year to date. RGR has a dividend yield of 1.79% and a payout ratio of 49.6%. The average analyst price target for RGR is $80. RGR’s stock was range-bound between $40 and $80. Over the last couple of months, it’s rallied from the bottom-end of this range to challenge its 2014 all-time high. Some pullback or consolidation is likely in the short-term. Long-term, the stock is positioned for a powerful breakout. Our POWR Ratings system rates RGR as a Strong Buy. It has an “A” for Trade Grade, Buy & Hold Grade, and Peer Grade. Among Air/Defence Services, it’s ranked #4 out of 65. Want More Great Investing Ideas? 9 “BUY THE DIP” Growth Stocks for 2020 Is the Bull S#*t Rally FINALLY Over? 7 “Safe-Haven” Dividend Stocks for Turbulent Times Top 3 Investing Strategies for 2020 SWBI shares rose $0.10 (+0.46%) in after-hours trading Tuesday. Year-to-date, SWBI has gained 135.99%, versus a -1.57% rise in the benchmark S&P 500 index during the same period."}]}