{"article": [{"url": "https://stocknews.com/news/spy-qqq-is-the-market-correction-over-no/", "published": 1600258100.0, "headline": "Is the Market Correction Over? No!", "body": "After suffering the swiftest 10% correction on record last week, the major indices are on pace to record their fourth consecutive day higher. If the “S&P 500 SPDR (SPY)” and “Nasdaq 100 (QQQ)” can close near midday levels they will have recovered half of last week’s losses. Does this mean the correction is over? Certainly, some options and sentiment gauges, such as the put/call ratio and the VIX, indicate that last week’s spanking sobered up what was becoming an overly euphoric market. But, it seems too pat to say the three-day 10% pullback was sufficient to indicate that the SPY and QQQ should just march back to new highs. The fact that today’s IPO of “Snowflake (SNOW)” is set to double and the proliferation of SPACs are an indication that bulls die hard. 7 \"SAFE HAVEN\" Dividend Stocks for Turbulent Times[Labor Day Sale Extended] Claim your SPECIAL One-Month $19 Trial Offer to the Options360 Service My take is that the correction was needed and a short-term bounce is warranted, especially as people have been conditioned to buy the dip. And newer traders have been led to believe stocks only go up. During August when the market accelerated higher, it was becoming clear that prices were getting ahead of themselves. But where they might stop nobody knows. What has been shown again and again is that when an overshoot occurs a sharp reversal follows and acts as the ‘correction’ to bring them more in line. There were several factors contributing to the run-up including positive news for a potential vaccine, strong consumer demand, an accommodative Federal Reserve, and lastly, a new cohort of speculative traders. In September, all of this has unspooled roughly in proportion to how strong parts of the market were on the way up. During the correction, the four biggest QQQ drags were, “Apple (AAPL),” “Microsoft (MSFT),” “Amazon (AMZN),” and “Tesla (TSLA),” which account for over half that index’s nearly 9% September drop. The same four are still responsible for most of the Nasdaq 100′s gaudy 27% year-to-date gain. A picture of the market pullback in recent weeks could sit beside the dictionary’s definition of a correction. (Never mind its mock-precise definition as a 10% decline; that’s strictly an oversimplified rule of thumb). Not only has the cut back to its months-long uptrend after getting stretched against it in August, but the most over-extended parts of the market – the QQQ dominated tech giants – have corrected the most. And, it’s all happened without clear indications of rising economic stress — a hint that the setback is mostly a positioning and sentiment adjustment, disgorging some quick-and-easy summertime gains. CLICK HERE for a one-month trial with these trades and more to the Options360 Service for just $19! The fact that even an 11% drop in the Nasdaq 100 has taken it back a mere 22 trading sessions in time is remarkable, perhaps arguing against the idea that a full flush and reversion to the mean has yet taken place. In fact, once a market has overshot in one direction, it can sometimes, though hardly always, lead to reversion beyond the mean. Friday, the Nasdaq 100 closed under its 50-day moving average for the first time in 105 days. According to Bespoke Investment Group, this was only the tenth time since 1985 that the index stayed above its 50-day average for at least 100 days. The returns thereafter were weak on average over the next month or so. The correction, thus far, has somewhat moderated investor sentiment. Yet, the massive stampede in small call-option orders by retail speculators has slowed only a bit, going from extreme speculative bullishness to a neutral mix. Do professional investors who’ve been complaining for months about the market’s narrowness, and the need for a pullback, seem a bit too satisfied and comfortable with the way this market break has played out? Do folks need to be more scared before a reliable low takes hold? Erratic action in the market’s biggest, most widely owned stocks, after having grown to unwieldy proportions, isn’t exactly a positive. But, relative strength in the equal-weighted S&P 500, transportation shares, industrials, housing-related names, consumer cyclicals, and basic materials stocks argue against index weakness being taken as an economic warning. The current backdrop remains an odd combination of early-cycle recovery dynamics (earnings set to rise from depressed levels, snapback in manufacturing activity), super-easy monetary conditions, and late-cycle risk appetites and valuations. Nothing has changed about the reliable accommodation of the Fed, bond yields below the inflation rate, the scarcity value of long-term corporate cash flow growth, and the relative caution of Wall Street strategists are all supportive. But, support doesn’t equal an upside catalyst. The major indices and numerous individual names have moved to rare air. There is plenty of room and reasons for them to fall further. CLICK HERE for a one-month trial with these trades and more to the Options360 Service for just $19! Want More Great Investing Ideas? 7 Best ETFs for the NEXT Bull Market Stock Market Outlook: Before & After the Election Chart of the Day- See the Stocks Ready to Breakout SPY shares were trading at $342.06 per share on Wednesday afternoon, up $1.89 (+0.56%). Year-to-date, SPY has gained 7.37%, versus a % rise in the benchmark S&P 500 index during the same period."}]}