{"article": [{"url": "https://stocknews.com/news/spy-find-winning-stocks-by-using-earnings-estimate-revisions-screening-strategies/", "published": 1598443700.0, "headline": "Find Winning Stocks by Using These Valuable Screening Strategies", "body": "Today I cover AAII’s strategy that focuses on firms that have had revisions to their consensus earnings estimate. Since both positive and negative earnings surprises have lingering long-term effects, tracking these revisions is a rewarding investment strategy. Earnings Estimate Revisions Expectations play a key role in determining if a stock’s price “gains” or “loses” when actual earnings are reported. Investors quickly learn that the market is forward-looking. Security prices are established through expectations, and prices change as these expectations change or are proven incorrect.With numerous industries in the U.S. forced to reduce capacity or close altogether due to social distancing policies implemented to help reduce the spread of the coronavirus, analysts have made substantial changes to earnings estimates for companies for 2020 and beyond. Significant cuts have been made to estimates for companies in struggling industries like commercial real estate and specialty pharmaceuticals. Other industries that have seen substantial declines in consensus earnings estimates are food processing, hospitality (hotels, restaurants & leisure) and clinical-stage biotech. However, some companies in sectors such as technology and recreational products have enjoyed upward revisions to earnings estimates from analysts and may be worth examining in these uncertain times.AAII has created four screens that look for earnings revisions: one that looks for upward revisions in annual earnings estimates; one that screens for companies with downward revisions; one that screens for companies that have had at least a 5% increase in annual earnings estimates over the last month; and, finally, one that screens for companies that have had at least a 5% decrease in annual earnings estimates over the last month. AAII’s Stock Investor Pro contains consensus earnings estimates from I/B/E/S and is used to perform our screens.There are two interesting observations from the earnings estimates revisions screens. The Estimate Revisions Down 5% screen normally averages around 69 holdings that pass the monthly screen—in April, during the early days of the pandemic, it reached 628 passing the screen—four months later, there are 45 companies passing the screen. Hit hard at the start of the coronavirus pandemic, analyst estimates for several recreational products companies that currently pass the Estimate Revisions Top 30 Up screen are expected to improve driven by a resurgence in outdoor recreation activities. Earnings Surprise There are several services that track and analyze expected earnings per share (EPS) estimates. Services such as Refinitiv I/B/E/S and Zacks Investment Research provide consensus earnings estimates by tracking the estimates of thousands of investment analysts. Tracking these expectations and their changes is an important and rewarding strategy for stock investors.In using earnings estimates, the first rule to keep in mind is that the current price usually reflects the consensus earnings estimate. It is common to see price declines for stocks that report earnings increases from the previous reporting period because in many cases, while the actual earnings represent an increase, the increase is not as great as the market had expected. Earnings surprises occur when a company reports actual earnings that differ from consensus earnings estimates.Most companies announce earnings approximately one month after the end of the quarter. During the earnings reporting season, business news channels and financial websites provide daily reports on earnings announcements. Firms with significant earnings surprises are often highlighted.Positive earnings surprises occur when actual reported earnings are significantly above the forecasted earnings per share. Negative earnings surprises occur when reported earnings per share are significantly below the earnings expectations. The stock prices of firms with significant positive earnings surprises show above-average performance, while those with negative surprises have below-average performance.Changes in stock price resulting from an earnings surprise can be felt immediately, and the surprise has a long-term effect. Studies indicate that the effect can persist for as long as a year after the announcement. This means that it does not make sense to buy a stock after the initial price decline of a negative earnings surprise. There is a good chance that the stock will continue to underperform the market for some time. It also indicates that it may not be too late to buy into an attractive company after a better-than-expected earnings report is released.Not surprisingly, large firms tend to adjust to surprises more quickly than small firms do. Larger firms are tracked by more analysts and portfolio managers, who tend to act quickly. Firms with a significant quarterly earnings surprise also often have earnings surprises in subsequent quarters. When a firm has a surprise, it often is a sign that other similar surprises will follow.Since both positive and negative earnings surprises have lingering long-term effects, a rewarding investment strategy is one that avoids stocks you believe will have negative earnings surprises or that have had negative earnings surprises. Selecting positive earnings surprise stocks before and even after the earnings come in may be similarly profitable. Even a strategy of simply selling after negative earnings surprises and buying after positive earnings surprises probably has some merit. Stocks With Upward Revisions May Outperform 7 \"SAFE HAVEN\" Dividend Stocks for Turbulent TimesRevisions made by analysts to earnings estimates lead to price adjustments similar to earnings surprises. When earnings estimates are revised significantly upward—5% or more—stocks tend to show above-average performance. Stock prices of firms with downward revisions show below-average performance after the adjustment.Changes in estimates reflect changes in expectations of future performance. Perhaps the economic outlook is better than previously expected, or maybe a new product is selling better than anticipated.Revisions are often precursors to earnings surprises. As the reporting period approaches, estimates normally converge toward the consensus. A flurry of revisions near the reporting period can indicate that analysts missed the mark and are scrambling to improve their estimates.Companies like to report positive earnings surprises, so it is not surprising that many companies try to “manage” the estimates slightly downward to create a positive surprise. Studies show that, on average, there are more positive quarterly surprises than there are negative surprises. Interestingly, estimates for the fiscal year do not tend to show the same positive surprise bias. Screening for Earnings Estimate Revisions AAII’s first filter for all four screens eliminates those firms with less than five estimates for the current fiscal year. This filter helps to ensure that revisions actually reflect a change in general consensus, not just a change by one or two analysts. However, requiring a stock to have at least five analysts reporting earnings estimates will knock out most of the very small-capitalization stocks.The next filter requires that the firm have an upward change over the course of the last month in its consensus estimates for the current (Y0) and next (Y1) fiscal year. We are also screening to make sure analysts have not lowered estimates for the current or next fiscal year during the past month. As an alternate upward revisions screen, we look for those companies that have had at least a 5% increase in the current and next fiscal-year earnings estimates over the last month.For the screen that looks for any upward revisions in consensus estimates for the current and next fiscal years, the firms with the greatest percentage increases in estimates for the current fiscal year are listed in the passing companies table. Whenever your filter involves the percentage change of a variable, there is a risk that firms with very small base numbers will dominate. A change from one cent to nine cents is a 900% change. Therefore, when working with percentage changes, it is helpful to use an additional screen to confirm the significance of the change.The number of estimates for each firm is provided to help gauge the interest in the firm and the meaningfulness of the overall estimates. The larger the firm, the greater the number of analysts that will track it. The number of upward revisions indicates how many analysts have revised their estimates upward in the last month. When compared to the number of analysts making estimates, this is a confirmation of the significance of the percentage change in estimates. You can put more faith in a revision if a large percentage of the analysts tracking a firm have revised their estimates. Stocks With Downward Revisions Typically Underperform Stocks with upward revisions usually have a period of market outperformance. Conversely, stocks with downward surprises typically underperform the market and should be avoided. We have reversed the screen for positive earnings revisions and present the list of the stocks with the largest percentage declines during the last month in consensus earnings estimates for the coming fiscal year. We also reversed the 5% increase screen to isolate companies that have had at least a 5% decline in the current and next fiscal-year earnings estimates over the last month. Changing Expectations Drive Stock Prices Earnings estimates are important. They are a numerical view of expectations, and changing expectations drive stock prices. If you are investing in individual stocks, a few points on earnings estimates are worth keeping in mind: Know the consensus earnings forecast of a stock you own or are interested in. Realize that the stock price already reflects the general consensus about future earnings. Be aware that if a stock is highly touted, the basis for the recommendation should be an earnings forecast by analysts significantly above the prevailing opinion. Ask for and carefully evaluate the foundation of an earnings forecast that deviates substantially from the consensus before investing. Significant earnings surprises, positive or negative, probably have a fairly long-term effect on a stock’s price as analysts revise long-term earnings forecasts accordingly. Today’s Estimate Revisions Stock Ideas 25 Stocks Passing the Estimate Revisions Up Screen (Ranked by Current-Year Revisions Made Last Month) 25 Stocks Passing the Lowest Estimate Revisions Down Screen (Ranked by Current-Year Revisions Made Last Month) The stocks meeting the criteria of the approach do not represent a “recommended” or “buy” list. It is important to perform due diligence. If you want an edge throughout this market volatility, become an AAII member. SPY shares rose $0.39 (+0.11%) in after-hours trading Wednesday. Year-to-date, SPY has gained 9.10%, versus a % rise in the benchmark S&P 500 index during the same period."}]}