{"article": [{"url": "https://stocknews.com/news/ever-vrs-agfs-awre-4-stocks-downgraded-to-sell/", "published": 1597406900.0, "headline": "4 Stocks DOWNGRADED to SELL", "body": "The exclusive POWR Ratings are updated at the end of each trading session to reflect the true value of each publicly traded stock, evaluate its prospects across a variety of criteria, and rate it accordingly. These ratings are based on a series of qualitative analyses conducted every 24 hours to provide an accurate picture of each stock’s prospects. The latest POWR Ratings updates have identified several stocks that have entered “Sell” or “Strong Sell” territory. Investors should have a more cautious approach with these stocks and investigate them more closely before buying. Traders should manage their risk more aggressively with these stocks as there’s increased downside risk. This is not to say these stocks are guaranteed to trend downward in the days and weeks to come. However, a downgrade in the POWR Ratings is a sign the stock should be closely analyzed, for either a short/put or removal from investors’ portfolios. 7 Best ETFs for the NEXT Bull MarketToday’s POWR Ratings reveal the following four stocks have been downgraded to a rating of D, meaning Sell: Everquote (EVER), Verso Paper (VRS), AgroFresh (AGFS) and Aware (AWRE). Everquote (EVER) It is now possible to review insurance quotes in online marketplaces, and EVER is one of the leading, online portals to pick the right plan. EVER’s portfolio is comprised of casualty and property insurance carriers. Coverage is provided through both insurance agencies, regional carriers, and tech-enabled startup enterprises. The POWR Ratings reveal EVER has an Industry Rank grade of A yet below-average grades in the remaining three POWR Components. The stock is ranked well outside of the top half of the 54 Internet stocks. EVER had stellar returns in ’19, coming in at +721%. However, EVER’s six-month price return has lagged the broader markets at -8%. The stock’s three-month price return is -24%. At the moment, EVER is trading at about half its 52-week high of $63.44. Though EVER reached new highs following the coronavirus sell-off, the stock has tumbled since, getting cut in half in less than a month. Savvy investors will avoid EVER until the analysts can get a better sense of a fair valuation. Verso Paper (VRS) Think back to the last time you opened up a magazine and spent more than a couple minutes reading it. If you are like most people, you struggle to remember when such an event occurred. Outside of medical office waiting rooms, tangible magazines and catalogs are rarely read. The digital transition has rendered magazine and catalog supplies companies such as VRS nearly useless. Though VRS also provides products for retail inserts, annual reports, and brochures, the bottom line is it is operating in an antiquated field that will eventually be phased out altogether. The POWR Ratings show VRS has an F Trade Grade and D grades in Industry Rank and Peer POWR Components. VRS is ranked 7th out of 8 stocks in the Industrial – Paper sector. Furthermore, VRS has pitiful price returns, generating a -27% year-to-date price return along with a -19.51% price return in 2019. VRSO has a six-month price return of -31%. VRS’s rapid early June spike to $17 and subsequent freefall should scare investors away from this stock for good. A VRS put might be the most prudent play. AgroFresh (AGFS) The aesthetics, texture, and freshness of produce play a large part in its marketability to shoppers. AGFS provides a SmartFresh Quality System that enhances these qualities, helping grocers and others maximize product sales. The POWR Ratings show AGFS has below-average grades in each POWR Component but for its Industry Rank of C. AGFS is ranked 18th of 27 stocks in the Agriculture space. AGFS price returns are barely in the green across the past couple months yet its year-to-date price return is -10%, its ’19 price return was -31% and its ’18 price return was -48%. AGFS recently missed its revenue estimates, giving investors all the more reason to sell. Aware (AWRE) AWRE develops and sells the intellectual property for broadband communications to semiconductor companies. In turn, semiconductor businesses generate integrated circuits with AWRE’s technology. Though AWRE has a POWR Rating Industry Rank grade of A, it has an F Trade Grade and a D Peer Grade. All in all, AWRE is ranked in the bottom half of the stocks traded in the Software – Application category. Take a look at AWRE’s price returns and you will find an abundance of red. AWRE has a six-month price return of -15%, a ’19 price return of -7%, and a three-year price return of -38%. It appears as though AWRE’s rise from $2.50 to $3.60 in June was somewhat of a dead cat bounce. As expected, the stock has sold off since this unexpected spike. Want More Great Investing Ideas? 9 “BUY THE DIP” Growth Stocks for 2020 How to Trade THIS Stock Bubble? 7 “Safe-Haven” Dividend Stocks for Turbulent Times EVER shares were trading at $37.52 per share on Friday afternoon, up $0.83 (+2.26%). Year-to-date, EVER has gained 9.23%, versus a 5.84% rise in the benchmark S&P 500 index during the same period."}]}