{"article": [{"url": "https://stocknews.com/news/amat-regn-lrcx-3-top-stocks-to-buy-if-the-market-plunges/", "published": 1599826100.0, "headline": "3 TOP Stocks to Buy If the Market Plunges", "body": "As we end the week, the markets are mixed. The S&P 500 closed slightly positive, while the Nasdaq Composite finished down 60 basis points. This was the largest weekly loss for the Nasdaq since March. After a week of volatility, investors may be wondering where we go next. Due to uncertainty in the markets, in the economy, and the upcoming election, it’s understandable to be nervous. We don’t know if this is temporary or a longer-lasting correction. Consider that the recent 10% drop in the Nasdaq only made a dent into its five-month performance. We need to brace for more volatility in the months to come. That means focusing on stocks that will withstand a market crash. But how do we do that? Well, there are a few attributes of companies I like to consider to help predict how a company will perform in a downturn. First is its valuation. I want a stock that has a margin of safety to its fair value price. Fair value is a broad measure of what a company is worth and is based on future cash flows. In other words, I want a stock that is currently undervalued. In addition to fair value, another type of valuation tool I like to use is the free cash flow yield. Next, I want a company that has a return on invested capital (ROIC) over 20. I believe ROIC is one of the best ways to measure a company’s performance. It helps determine how efficient a company is in allocating its capital. 7 Best ETFs for the NEXT Bull MarketFinally, I want a company that has a healthy balance sheet, meaning it can pay off its debts if needed. I found three stocks that meet all my requirements: Applied Materials (AMAT), Regeneron Pharmaceuticals (REGN), and Lam Research (LRCX). Applied Materials (AMAT) AMAT is one of the world’s largest suppliers of semiconductor manufacturing equipment. It provides materials engineering solutions to help make nearly every chip in the world. It also offers deployment and support services related to the equipment supplied. The firm’s systems are used in almost every major process step, except lithography. The company had a strong fiscal third quarter, which was driven by strength in semiconductor equipment demand. Earnings per share came in at $1.06, outperforming analyst estimates. This was a 43.2% increase year over year. Revenue increased to $4.40 billion from $3.56 billion last year. AMAT had strong revenue in Europe, Korea, Taiwan, and China. The company also won critical new applications in advanced patterning, strengthening its position in the foundry market. The company believes demand for foundry logic should remain strong in the near term, due to a rising need for specialty nodes in automotive, IoT, the 5G rollout, and image sensor markets. AMAT should benefit from growth in China as the country builds its local manufacturing industry. The company should also complete its acquisition of Kokusai Electric from KKR (KKR) by the end of the year. The company closed today at $55. According to Finbox.io, the stock has a fair price of $68.26. This would mean a margin of safety of 24.1% for the company. AMAT also has a free cash flow yield of 5.8%. These figures would lead me to believe that the stock is currently undervalued. The stock has an ROIC of 22.9%, meaning it’s quite profitable. Its current ratio is 2.9, meaning it has significantly more current assets than current liabilities, a good indicator of a healthy company. Regeneron Pharmaceuticals (REGN) REGN discovers, develops, and commercializes products that fight eye disease, cardiovascular disease, cancer, and inflammation. It has several marketed products, including Eylea, approved for wet age-related macular degeneration and other eye diseases. Other notable drugs include Praluent for lowering LDL cholesterol, Dupixent for atopic dermatitis, asthma, and nasal polyposis, Libtayo for cutaneous squamous cell carcinoma, and Kevzara for rheumatoid arthritis. REGN stock has had a strong year, with the stock up 45% year to date. The company reported strong earnings and revenue last month, driven by Eylea label expansion and strong sales in Dupixent and Libtayo. Eylea growth in the U.S. is being driven by an aging population and an increasing prevalence of diabetes. The firm has received a boost from Dupixent, as it has the injection has been approved for the treatment of adults with moderate-to-severe atopic dermatitis. Previously, the company was reliant on Eylea for revenue, but it has successfully diversified its revenue streams. REGN has also been involved in developing coronavirus treatments. The company is in the middle of a phase III study for REGN-COV2, an antibody cocktail treatment designed to prevent and treat the virus. It’s immuno-oncology drug, Libtayo, also shows promise. The drug was approved in late 2018 for skin cancer. The company is expected to file Libtayo for FDA approval in both non-small cell lung cancer and advanced basal cell carcinoma. If we look at the numbers, REGN looks undervalued to me. It closed the day at $544.75, and Finbox has set a fair value of $586.53 on the stock. This is a 7.7% margin of safety. The company also has a free cash flow yield of 3.9% REGN has an ROIC of 25.4% and a current ratio of 2.1, meaning it has a strong balance sheet and is highly profitable. Lam Research (LRCX) LRCX manufactures equipment used to fabricate semiconductors. The company is focused on the etch, deposition, and clean markets, which are critical steps in the semiconductor manufacturing process. This is especially true for 3D NAND flash storage, advanced DRAM, and leading-edge logic/foundry chipmakers. The company’s flagship products are Kiyo, Vector, and Sabre, which are sold to customers such as Samsung Electronics and Taiwan Semiconductor Manufacturing (TSM). There has been a massive demand for memory chips lately. Products such as cloud computing, big data, the Internet of Things (IoT), and mobile devices are growing and need memory due to the volume of data on information networks. This is LRCX’s strong suit. The increasing NAND requirement in 5G migration, video, and game consoles is driving revenue for the company. LRCX also sees stable Foundry growth. LRCX had a strong quarter, outperforming estimates in both earnings and revenue. Earnings grew 32% year over year, and revenue grew 18.2%. The company should see future revenue growth due to accelerated demand for remote equipment support and the transition to a new data-enabled economy. In addition, etch, and deposition technologies should expand the company’s market. The stock closed the week at $239.99, which is 9.3% below its fair value of $321.27, according to Finbox. LRCX also has a free cash flow yield of 4.4%, making it an attractively priced stock. The company has a return on equity of 43.4% and an ROIC of 24.5%, both strong numbers. In terms of financial health, the company sports a healthy current ratio of 3.4. Want More Great Investing Ideas? 7 Best ETFs for the NEXT Bull Market Will Stocks Fall into Historical September Slump? 9 “BUY THE DIP” Growth Stocks for 2020"}]}