{"article": [{"url": "https://stocknews.com/news/hd-shw-tol-len-4-housing-stocks-ready-to-surge-in-2021/", "published": 1602072500.0, "headline": "4 Housing Stocks Ready to Surge in 2021", "body": "Housing has been one of the best performing sectors amid the pandemic thanks to a surge in home buying and home improvement projects. With so many outlets for spending not available, people have more time and money to spend on upgrading their homes. Additionally, there’s been an increase in demand for homes, while supply remains low. Another factor is low mortgage rates. According to Bankrate’s weekly survey of large lenders, the 30-year fixed mortgage rate fell to a new record low of 3.05% last week. This is no doubt encouraging for home buyers. Increasing home prices also leads to increased economic confidence and greater spending on home improvement projects. The SPDR S&P Homebuilders ETF (XHB), which represents the homebuilding segment of the S&P Total Market Index, has gained 114% since hitting its 52-week low in March versus the S&P 500’s 48% return. 9 \"BUY THE DIP\" Growth Stocks For 2020With no end in sight to this pandemic and no chances of the mortgage rates increasing in the foreseeable future, the housing industry should keep thriving. Hence, the earlier you enter some high-potential housing stocks, the better. The Home Depot, Inc. (HD), Toll Brothers, Inc. (TOL), Lennar Corporation (LEN), and Sherwin-Williams Company (SHW) are well-positioned to continue making new highs in 2021. Home Depot, Inc. (HD) HD is the world’s largest home improvement retailer, offering a wide assortment of building materials, home improvement products, lawn and garden products, décor products. It provides a number of services, including home improvement installation services, and tool and equipment rental. As of July 2020, HD operated a total of 2,293 retail stores throughout the US, Canada, and Mexico. The company plans to open three new distribution centers in Georgia over the next 18 months, mainly to support the growing demand for flexible delivery and pick-up options for Pro and Do It Yourself (DIY) customers. HD’s EPS for the fiscal second-quarter ending July 2020 increased 26.8% year-over-year to $4.02 and surpassed the consensus estimate by 8.4%. Revenues increased by 23.4% year-over-year to $38.1 billion. The company pays an annual dividend of $6, which yields 2.13%. This improvement was mainly due to the increase in demand from DIY customers, as they spent more time on “maintaining and enhancing their homes” being stuck at home. The market expects the company’s revenue to grow 14.4% in the current quarter and 13.3% in the current year. EPS is expected to grow 16.6% in the current quarter and 10.7% in the current year. Also, the market expected the EPS to grow at a rate of 6% over the next five years. The stock gained more than 70% since hitting its 52-week low in mid-March. How does HD stack up for the POWR Ratings? A for Trade Grade A for Buy & Hold Grade B for Peer Grade A for Industry Rank A for Overall POWR Rating. It is also ranked #1 out of 68 stocks in the Home Improvement & Goods industry. Toll Brothers, Inc. (TOL) TOL is the nation’s leading builder of luxury homes. Present in 24 states, the company along with its subsidiaries design, build, market, sell, and arrange to finance an array of luxury houses in the United States. Additionally, the company develops, owns, and operates golf courses and country clubs. In 2020, Toll Brothers was named World’s Most Admired Home Building Company in Fortune magazine’s survey of the World’s Most Admired Companies, for the sixth year in a row. On September 17th, the company announced its acquisition of Keller Homes, one of the top private homebuilding companies in Colorado Springs which would mark the entry of the company into the Colorado Spring market. TOL’s EPS for the fiscal third quarter ended July 2020 was $0.9, which surpassed the consensus estimate by 26.8%. The company’s revenue stood at $1.63 billion, registering a growth of 6% over its previous quarter. By the end of its third-quarter the company delivered 2,022 units of homes, growing at 1.4% year-over-year. For the quarter, the net signed contract homes were 2,833, up 26%. The company pays an annual dividend of $0.44, at a 0.90% dividend yield. After hitting its low in mid-march, the stocks bounced back and have gained almost 200% so far this year. Toll’s strong fundamentals are reflected in its POWR Ratings, it has a “Strong Buy” rating with a grade of “A” in Trade Grade, Buy & Hold Grade, and Peer Grade, and a “B” in Industry Rank. Within the Homebuilders industry, it’s ranked #4 out of 21 stocks. Lennar Corporation (LEN) LEN is one of the nation’s leading home builders. The company provides services like construction and sale of homes, as well as the purchase, development, and sale of residential land. The company also provides mortgage financing, title insurance, and closing services for home buyers and others. Additionally, the company constructs and manages various multifamily rental properties. In September 2020, the company announced the opening of Canopy Grove, a vibrant new community in Escondido, California. The company also announced the debut of Vibe, a contemporary, urban-inspired townhome community located in Chula Vistas. LEN’s EPS for the fiscal third quarter ended August 2020 increased 33% year-over-year to $2.12 and surpassed the consensus estimate by 36.8%. For the same period, the company reported revenue of $5.9 billion, exceeding its projections by 6.1%. The company’s new orders for homes increased by 16% and deliveries grew 2% year-over-year. The company’s EPS is expected to grow 8.9% in the current quarter, 28.6% in the current fiscal year, and at a rate of 11.4% in the next five years. The stock has gained almost 135% since hitting its low in mid-March. The company pays an annual dividend of $0.50 per share, yielding 0.60%. Len’s strong performance is reflected in its POWR Ratings, it has a “Strong Buy” rating with an “A” in Trade Grade, Buy & Hold Grade, and Peer Grade, and “B” in Industry Rank. Within the Homebuilders industry, it’s ranked #2 out of 21 stocks. Sherwin-Williams Company (SHW) SHW is a global leader in the manufacture, development, distribution, and sale of paint, coatings, and related products to professional, industrial, commercial, and retail customers primarily in North and South America with additional operations in the Caribbean region, Europe, Asia, and Australia. The company supplies a broad range of highly-engineered solutions for the construction, industrial, packaging, and transportation markets in more than 120 countries around the world. The rise in the architectural paint market in North America has benefitted SHW, and in the second quarter, it witnessed considerable demand for its architectural DIY paints in North America. Moreover, SHW remains committed to expanding its operations and plans to open around 50 new stores in 2020. SHW’s EPS for the second quarter ended June 2020 increased 8% year-over-year to $7.1 and surpassed the consensus estimate by 21.4%. The company reported revenue of $4.6 billion, up 12% year-over-year. SHW expects its demand to improve sequentially in the third quarter and has raised net income per share guidance for the current year to $19.21-$20.71 from its prior view of $16.46-$18.46. The market expects SHW’s revenue to increase by 3.9% in the current quarter and 4.7% in the next quarter. The company’s EPS is expected to grow at 15.5% in the current quarter, 10.7% in the current fiscal year, and at a rate of 9.51% in the next five years. After hitting its low in mid-March, the stock recovered and hit its 52-week high of $725 in mid-September. The stock has gained around 66% since its March low. The company pays an annual dividend of $5.36 per share, which yields 0.78%. SHW’s positive prospect is reflected in its POWR Ratings, it has a “Strong Buy” rating with an “A” in Trade Grade, Buy & Hold Grade, Peer Grade, and Industry Rank. Within the Home Improvement & Goods industry, it’s ranked #3 out of 68 stocks. Want More Great Investing Ideas? 7 Best ETFs for the NEXT Bull Market What is the Cure for Stock Market Volatility? Chart of the Day- See Christian Tharp’s Stocks Ready to Breakout HD shares rose $0.46 (+0.16%) in after-hours trading Wednesday. Year-to-date, HD has gained 31.83%, versus a 7.39% rise in the benchmark S&P 500 index during the same period."}]}