{"article": [{"url": "https://stocknews.com/news/m-lb-jcp-asna-4-sell-rated-retail-stocks-to-dump-now/", "published": 1594382900.0, "headline": "4 \"Sell-Rated\" Retail Stocks to Dump Now", "body": "Certain retailers are facing a crisis due to the coronavirus. The common link between them is that their businesses are dependent on in-store spending, and they don’t have a meaningful online presence. Another factor is that they appeal to the middle class which has been shrinking over the last couple of decades, while retailers focused on the upper and lower-end have done better. They were already having a hard time as traffic to retail stores was decreasing, and online spending was exploding. Further, younger people are much more likely to browse online rather than wander around a mall. 7 \"SAFE HAVEN\" Dividend Stocks for Turbulent TimesThe coronavirus is a negative shock to these businesses that were already in a secular decline. Foot traffic to stores will be depressed over the coming months. They are ramping up their online operations to make up for the shortfall but that is a challenging, expensive endeavor with no guarantee of success. Given these issues, investors should avoid these four retail stocks: L Brands, Inc. (LB) LB is a specialty retailer that focuses on women’s care and beauty products. LB reported an operating loss of $318 million in the first fiscal quarter of the year. It’s facing challenges relating to the poor performance of its Victoria’s Secret brand. To cut costs, LB is curtailing expenditure and closing stores. L Brands, like many other retail operations, has been hit hard by the pandemic. Until the situation reverses, LB should be avoided. LB has lost 13.3% year to date which follows a 25.2% decline in 2019. How does LB stack up for the POWR Ratings? D for Trade Grade D for Buy & Hold Grade B for Industry Rank C for Peer Grade D for overall POWR Rating Macy’s, Inc. (M) Macy’s is facing an uncertain future as the company is closing stores in areas with increased case counts. M is also looking into various measures to reduce expenditure such as laying off around 4,000 employees. It’s facing a steep challenge of getting customers into stores during this period, and it’s likely to underperform until things get back to normal. M has lost 59.4% year to date. It has performed well with a price return of -66.2% over the last year. M has been accorded an overall POWR Rating of F which indicates a Strong Sell. It has received F for Trade Grade and Buy & Hold Grade as well. J.C. Penney Company, Inc. (JCP) JCP is in the midst of bankruptcy proceedings. The company has submitted its new business plan to lenders who need to approve it before July 14. Otherwise, it will be forced to liquidate. JCP has been severely hit by the coronavirus. It should be avoided. JCP has lost 83.9% year to date and is down 82.2% in the stock price over the last year. JCP has an overall POWR Rating of F which indicates a Strong Sell. It has received F for Trade Grade and Buy & Hold Grade as well. Ascena Retail Group, Inc. (ASNA) ASNA is a specialty retailer of apparel for women, along with tween boys and girls. It is the parent company of Ann Taylor and Lane Bryant. The company has a high degree of bankruptcy risk and may be forced to close around 1200 stores to reduce its debt. It may also sell brands such as Justice and Catherine to stave off this outcome. ASNA has lost 87.7% year to date. The stock has also delivered a negative price return of 84.7% in 2019. ASNA has received an overall POWR Rating of F along with an F for Trade Grade and Buy & Hold Grade. It has a D for Peer Grade and a C for Industry Rank. Want More Great Investing Ideas? 9 “BUY THE DIP” Growth Stocks for 2020 Is the Bull S#*t Rally FINALLY Over? 7 “Safe-Haven” Dividend Stocks for Turbulent Times Top 3 Investing Strategies for 2020 M shares . Year-to-date, M has declined -58.53%, versus a -0.31% rise in the benchmark S&P 500 index during the same period."}]}