{"article": [{"url": "https://stocknews.com/news/wkhs-nvax-2-nasdaq-stocks-up-more-than-100-in-the-past/", "published": 1594728500.0, "headline": "2 Nasdaq Stocks Up More Than 100% in the Past 4 Weeks", "body": "When looking for short term stock opportunities, investors should consider recent returns as one way to ride the momentum. Looking at 1-month turns is a perfect example. The S&P 500, represented by the SPDR 500 ETF (SPY) is up 3.5% over the last month as of today’s close. That’s not a bad return, but many stocks have generated massive gains over the same time period. For this article’s purposes, I decided to look for a minimum of 100% return over the last four weeks. I then narrowed the list for stocks with either a Strong Buy or a Buy in our POWR Ratings system. Here are two stocks that have returned over 100% the past four weeks. Workhorse Group (WKHS) 7 \"SAFE HAVEN\" Dividend Stocks for Turbulent TimesWKHS designs, develop, manufactures, and sells high-performance, medium-duty trucks. The company’s products include trucks comprising a powertrain and chassis. WKHS has established a business relationship with United Parcel Service (UPS) and the U.S. Postal Service. The stock is up a whopping 308.47% over the past month. The company recently reported certification for its electric delivery trucks. That news sent WKHS up almost 2% for the day. The approval came from the California Air Resources Board (CARB), which means CARB recognizes its electric delivery trucks as zero-emissions vehicles in California. WKHS is now closer to joining the California Hybrid and Zero-Emission Truck and Bus Voucher Incentive Project (HVIP). When it does, it will be eligible for monetary vouchers. This will reduce the total cost of a vehicle for a customer. WKHS expects 557% sales growth next year. The stock is also a Buy in our POWR Ratings. It is ranked #8 out of 27 Auto & Vehicle Manufacturers. Novavax (NVAX) NVAX, a late-stage biotechnology company, focuses on discovering, developing, and commercializing vaccines to prevent serious infectious diseases. The company has been in the news due to a promising vaccine for COVID-19 called NVX-CoV2372. If approved, NVAX is talking about manufacturing a billion doses. The stock is up 128.92% year to date. The company has received financial support from several sources. In May, the Coalition for Epidemic Preparedness Innovations invested $388 million in NVAX’s possible vaccine. The U.S. government also agreed to pay the company $1.6 billion through Operation Warp Speed to help with development. So far, NVAX’s vaccine produces more antibodies than any other rivals’ possible vaccines, and the vaccine platform has proven superior. Their flu vaccine, NanoFlu, was proven superior to the market leader, Sanofi’s (SNY) Fluzone Quadrivalent, in numerous clinical trials. NVAX, which has a Buy rating in our POWR Rating service, is ranked #33 out of 338 stocks in the Biotech industry. Want More Great Investing Ideas? 9 “BUY THE DIP” Growth Stocks for 2020 Top 5 WINNING Stock Chart Patterns 7 “Safe-Haven” Dividend Stocks for Turbulent Times WKHS shares rose $0.88 (+5.70%) in premarket trading Tuesday. Year-to-date, WKHS has gained 434.54%, versus a -1.40% rise in the benchmark S&P 500 index during the same period. "}]}