{"article": [{"url": "https://stocknews.com/news/spy-qqq-ndaq-the-nasdaq-gets-a-new-volatility-index-what-you-need/", "published": 1598443700.0, "headline": "The Nasdaq Gets a New Volatility Index: What You Need to Know", "body": "Most people are aware of the CBOE S&P 500 Volatility Index, or VIX which is often referred to as the ‘fear gauge’ because it typically goes up, sometimes dramatically, as the market goes down. The “Chicago Board Of Options Exchange (CBOE)” has been able to leverage the brand of this index, which can’t be traded directly through licensing of various products such as futures contracts and host of ETFs like the “iPath S&P 500 Volatility (VXX)”. Less well known or reported upon is the VXN, which the volatility index based on the “Nasdaq 100 (QQQ)”. One of the reasons is simply the VIX was the original and has been around for over 30 years, whereas VNX is barely 8 years, allowing it to become the default measure of market volatility. 7 \"SAFE HAVEN\" Dividend Stocks for Turbulent TimesAlso, aside from futures contracts, there are few ways for individuals to trade the VNX. But with the big-cap tech which comprises the Nasdaq and is dominating market movement, there is a growing interest in being able to use the VXN to both hedge and speculate. Well, it looks like some new products should launch very soon. Last week the “Nasdaq Exchange (NDAQ)” teamed up with the “Chicago Mercantile (CME)” to create the Nasdaq-100 Volatility Index (VOLQ). The VOLQ distinguishes itself from the VXN (and VIX for that matter) by using a different methodology for its calculation. Whereas the VXN and VIX is a formula that encompasses all strike prices that have more than a $0.01 bid and just two expiration periods the VOLQ uses the first and second in-the-money and first and second out-of-the-money call and put options for the four-weekly expirations. In this way, it focuses on at-the-money strikes which the creators say is what most traders focus on when trying to gauge current volatility levels. Professionals and hedge funds that employ complicated strategies do look at a skew, that is the different volatility levels for further out-of-the-money options, to gauge tail risk or spot anomalies. But for the average trader, at-the-money is where it’s at. In this way, the VOLQ should give a truer snapshot of the real 30-day volatility, especially during periods of heightened volatility when the implied volatility for far OTM puts can surge as people buy disaster protection. Right now the only way to trade the VLOQ is through futures contracts which is probably why the CME and NDAQ’s announcement didn’t garner much press. But what will bring the VOLQ to people’s attention is the fact Exchange Traded Funds or ETFs based on it are set to roll out within the next two weeks. I use the VXX sparingly as a short-term hedging tool, as I did last week when 7 out my 8 positions were all bullish and I wanted some downside protection. But, as tech stocks become the bigger part of my and most other traders’ portfolios it will be nice to have an easily traded product tied to QQQs. A VLOQ ETF will be a welcome addition to any trader’s arsenal. Learn more about claiming your one-month trial offer to the Options360 Service by clicking here. Want More Great Investing Ideas? The Best of StockNews 2 Step Process to Sell @ Market Top in September 9 “BUY THE DIP” Growth Stocks for 2020 SPY shares were trading at $347.32 per share on Wednesday afternoon, up $3.20 (+0.93%). Year-to-date, SPY has gained 9.02%, versus a % rise in the benchmark S&P 500 index during the same period."}]}