{"article": [{"url": "https://stocknews.com/news/amzn-googl-fb-buy-the-dips-in-these-3-internet-stocks/", "published": 1599566900.0, "headline": "Buy the Dips in These 3 Internet Stocks", "body": "The Nasdaq Composite Index dipped 10% in the last three trading sessions after surging to its all-time high of 12,074. The FAANG stocks dipped by an average of 4% on Tuesday, September 8th. A 4% dip may not look big, but these stocks together lost hundreds of billions in market capitalization. Don’t worry. These stocks are expected to be back to their 52-week highs and might even make new highs, as the growth in demand for their products and services are not expected to slow anytime soon. Over the last decade, the internet boom, increasing penetration of smartphones, and rising disposable income pushed some internet stocks to trillion-dollar valuations. And the COVID-19 pandemic has triggered the internet adoption even among the untapped population. Among the tech juggernauts, the pandemic has treated three internet giants —Amazon (AMZN), Alphabet (GOOGL), and Facebook (FB) — pretty well. These three companies are market leaders in their own space and cater to a large portion of the world population. They are now broadening their horizon to monetize on future demand. 7 \"SAFE HAVEN\" Dividend Stocks for Turbulent TimesAmazon (AMZN) AMZN needs no introduction. It is the e-commerce leader and the No. 1 cloud hosting provider in the world. It makes most of its money from its e-commerce platform. Amazon Prime Video, Alexa personal assistant and ecosystem, and Amazon Web Services are the other money streams for the company. The pandemic has created an e-commerce wave, tapping the segments of the population that were reluctant to adopt digitization. Amazon and Shopify (SHOP) witnessed traffic on the levels of the holiday season… in April. This was reflected in their earnings. AMZN’s second-quarter revenue surged 40% year-over-year to $88.9 billion, and EPS surged 97% to $10.3. Such high growth drove AMZN stock up 78% year-to-date to it’s all-time-high of $3,552.25. The pandemic gave AMZN its next trillion-dollar opportunity as its market cap jumped from $1 trillion at the start for the year to as high as $1.77 trillion. People have realized the advantages of e-commerce while locked in their homes, making this trend sticky. A study by Grand View Research expects the global e-commerce market to increase at a CAGR of 14.7% between 2020 and 2027. At its three-year high forward price-to-earnings multiple of 95x, AMZN stock might look expensive. Some analysts believe that AMZN has become too big to grow. But it is exploring new areas such as self-driving cars and robotics. It is also expanding in the grocery business and increasing its fulfillment capacity. How does AMZN stack up for the POWR Ratings? A for Trade Grade B for Buy & Hold Grade A for Industry Rank A for Peer Grade B for overall POWR Rating You can’t ask for better. The stock is also ranked #2 stock in the Internet industry. Alphabet (GOOGL) While the pandemic unleashed the trillion-dollar opportunity for AMZN, it came as a nightmare for the search engine giant Google. Alphabet earns more than 80% of its revenue from advertising. But it saw a modest decline in ad revenue as many companies cut their ad budget amid the lockdown. However, an uptick in Google Cloud and other non-advertising revenues, such as YouTube, partially offset the weakness in ad revenue. In the second quarter, GOOGL’s revenue fell 1.7% year-over-year to $38.3 billion, while its net income fell 30% to $7.0 billion. The sharp drop in net income was because of a 15% decline in cost-per-click and higher loss from its Other Bets. As the economy reopened, advertising picked up. GOOGL’s stock fell 21% in March but later surged over 60%, resulting in a year-to-date gain of 13.75%. This rally has put it back over the $1 trillion market cap. GOOGL dominates the search engine space, and its position is attracting antitrust probes. According to The New York Times, the U.S. Department of Justice is planning to launch an antitrust case against GOOGL before the end of September. The search engine and internet services got GOOGL to its first trillion-dollar. GOOGL stock is trading at a forward price-to-earnings ratio of 30.6x, its highest valuation in over five years. It is using its massive $120 billion cash pile to explore future technologies that can bring in its next trillion dollars. Some of its ventures include DeepMind, which is working on artificial intelligence (AI), and Waymo, which is developing autonomous vehicle technology. GOOGL is rated a Buy in the POWR Ratings. It holds straight A in Trade Grade, Peer Grade, and Industry Rank and a B in Buy & Hold Grade. It is also the #4 ranked stock in the Internet industry. Facebook (FB) FB is younger than AMZN and GOOGL, but it has achieved a remarkable feat in a small time. It has 2.45 billion active users, making it the world’s largest social media platform. FB has reached a market capitalization of $772 million in eight years. The company makes its money from advertising on its social media platforms — Facebook, Instagram, Messenger, and WhatsApp. The pandemic-driven lockdown made many people active on social media. Like GOOGL, even FB saw a decline in targeted ad spend by advertisers, but that did not impact its revenue significantly. In the second quarter, FB’s revenue surged 11% year-over-year to $18.69 billion, while EPS rose 98% to $1.80. However, the company’s ad revenue faces risks from some privacy regulations and new privacy protection measures by Apple (AAPL) that will protect specific customers’ data from advertisers. FB is now expanding into the e-commerce segment. It is integrating Shopify to allow merchants to post and sell their offerings on Facebook or Instagram. This initiative will help it earn from ads as well as transactions, and might even unlock a trillion-dollar opportunity. FB stock is trading at 32 times its forward price-to-earnings multiple. It’s no surprise that it is rated a Buy in our POWR Rating system. It also has an A for Trade Grade, Peer Grade, and Industry Rank, and a B for Buy & Hold Grade. In the 57-stock Internet industry, it is ranked #5. Investor takeaway Many critics say that the pandemic has created a dot.com-like tech bubble that can burst anytime. But AMZN, GOOGL, and FB will not be severely impacted as their stock prices are backed by fundamentals and new growth opportunities. There is no perfect price to buy these tech stocks as they keep breaking their records. But the recent correction offers a good time to pick up shares of some of the world’s best companies at cheaper prices. Want More Great Investing Ideas? 7 Best ETFs for the NEXT Bull Market Will Stocks Fall into Historical September Slump? 9 “BUY THE DIP” Growth Stocks for 2020 AMZN shares fell $25.32 (-0.80%) in after-hours trading Tuesday. Year-to-date, AMZN has gained 70.46%, versus a 4.59% rise in the benchmark S&P 500 index during the same period."}]}