{"article": [{"url": "https://stocknews.com/news/irbt-isrg-calx-ibkr-the-best-4-earnings-surprises-from-yesterday/", "published": 1595419700.0, "headline": "The BEST 4 Earnings Surprises from Yesterday", "body": "Earnings season is in full swing, with 76 earnings reports on Monday and 108 earnings reports on Tuesday. This is an opportune time to learn more about how a company performed over the previous quarter. The number of positive earnings surprises outnumbered the number of negative earnings surprises on both Monday and Tuesday. That is a positive sign in light of the coronavirus pandemic and challenging economic environment. There were quite a few earnings, in particular, yesterday that just blew away earnings estimates, percentage-wise. Some of these stocks are rated at least a Buy in our POWR Ratings system. Four in particular caught my eye. All four of these stocks posted an earnings surprise of 80% or more. Here are the four best earnings surprises from yesterday. 7 \"SAFE HAVEN\" Dividend Stocks for Turbulent TimesiRobot (IRBT) IRBT is a US-based consumer robot company. It designs and builds robots that assist consumers with activities that can be carried out both inside and outside the home. This can include cleaning, mapping and navigation, and human-robot interaction solutions. IRBT’s most well-known products are the Roomba and Braava house-cleaning devices. The company derives its revenue primarily from its product sales. The company posted earnings of $1.06, which was a 268% surprise over the average estimate of $0.29. IRBT also saw revenue increase 8% year over year to $279.9 million for the quarter. The company’s robots, including Roomba i7 Series and s9 Series and Braava Jet M Series, saw 43% sales growth. The company has been able to boost demand and sales through television ad campaigns. Despite this impressive earnings beat, the stock is trading down today on news that its Roomba autonomous vacuums could be hit with trade tariffs in the second half of 2020. IRBT is rated a Buy by our momentum-based POWR Ratings system. It holds grades of A in Trade Grade and Industry Rank and B for Buy & Hold Grade and Peer Grade. The company is the #23 ranked company in the Home Improvement & Goods industry. Intuitive Surgical (ISRG) ISRG develops, produces, and markets a robotic system, called the da Vinci surgical system to assist minimally invasive surgery. The system reduces the trauma associated with open surgery. The company has sold more than 5,500 da Vinci systems to hospitals worldwide. ISRG also manufactures EndoWrist instruments, including forceps, scissors, scalpels, and other surgical tools for numerous surgical procedures. The company posted earnings of $1.11 per share, which was a surprise of 97.86% over the average analyst estimate of $0.56. Earnings were driven by better than expected procedure volume and system placements. ISRG saw revenue for the quarter of $852 million. While these figures beat analysts’ expectations, they were well below their figures last year as sales fell 22% year over year due to the pandemic affecting elective procedures. The stock is trading up almost 4% today on the news of this strong quarter. ISRG has a strong report card of four As and 1 B. By that, I mean that four scores of our POWR Ratings system are an A for the stock, and one is a B. The company is also the #1 ranked stock in the Medical – Devices & Equipment industry. Calix (CALX) CALX provides broadband communications access systems and software. Its products allow communication service providers to deliver services to residential and business customers. The company’s solutions are used by more than 1,200 customers in the U.S. and internationally. Revenue is generated through access and premises systems, software platform licenses, and cloud-based software subscriptions. The company reported earnings of $0.14 per share, which was a surprise of 133.33% over the average analyst estimate of $0.06. CALX posted revenues of $119.02 million for the quarter, compared with $100.30 million for the quarter one year ago. The stock recently hits its 52 week high of $19.49 and is currently up over 12% today. How does CALX stack up for the POWR Ratings? A for Trade Grade A for Buy & Hold Grade B for Industry Rank A for Peer Grade A for overall POWR Rating The stock is also the #8 ranked stock in the Technology – Communication/Networking industry. Interactive Brokers Group (IBKR) IBKR is a broker-dealer broker that provides direct access trade execution and clearing services to institutional and professional traders. Traders can buy and sell stocks, options, futures, foreign exchange, bonds, and more on 120 electronic exchanges worldwide. As of April, the company winded down its Market Marketing unit to focus on its Electronic Brokerage business. IBKR reported earnings of $0.57 a share compared with estimates of $0.32 a share. This was an 80.95% surprise. The company’s total net revenues were $539 million, up 30.5% year over year. This was driven by an increase in daily average revenue trades (DARTS). Total DARTs increased to 1.75 million. Customer accounts also grew 36% from a year ago. IBKR is rated a Buy by our momentum-based POWR Ratings system. It holds a grade of A in Trade Grade, and grades of B in Buy & Hold Grade, Peer Grade and Industry Rank. The company is the #7 ranked company in the Investment Brokerage industry. Want More Great Investing Ideas? 9 “BUY THE DIP” Growth Stocks for 2020 Newly REVISED 2020 Stock Market Outlook 7 “Safe-Haven” Dividend Stocks for Turbulent Times IRBT shares were trading at $80.43 per share on Wednesday afternoon, down $5.34 (-6.23%). Year-to-date, IRBT has gained 58.86%, versus a 2.27% rise in the benchmark S&P 500 index during the same period."}]}