{"article": [{"url": "https://stocknews.com/news/gush-uco-spy-qqq-sphd-5-popular-etfs-in-the-robinhood-100/", "published": 1594210100.0, "headline": "5 Popular ETFs in the Robinhood 100", "body": "Robinhood has soared in popularity due to its ease of use and no commission trading. As of May 2020, there are more than 13 million users on the investing app. Therefore, it comes as no surprise that investors are interested in which stocks Robinhood users are trading and investing in. The “Robinhood 100” is a list of the 100 most popular stocks and ETFs that Robinhood users are holding. This list gives an interesting perspective and insight into sentiment and positioning. The Robinhood 100 tends to be populated with fast-moving, well-known companies, and ETFs. 9 \"BUY THE DIP\" Growth Stocks For 2020Here are 5 popular ETFs on the Robinhood 100: Direxion Daily S&P Oil & Gas Exp. & Prod. Bull 2X Shares (GUSH) GUSH is a leveraged ETF track a basket of oil producers and explorers like Cabot Oil & Gas (COG), EQT (EQT), and Southwestern Energy (SWN) with leverage. GUSH delivers outstanding returns during uptrends for energy. For example, it gained 445% between March 30 to June 5 as oil prices rebounded from $20 to $39. But as oil fell from $50 to under $10 from February to April, GUSH dropped by 98%, so the leverage is a double-edged sword. Like any leveraged instrument, there’s more risk during downturns and underperformance during trending markets. From June 5 till now, oil has been range-bound between $35 and $40, but GUSH is down 50%. ProShares Ultra Bloomberg Crude Oil (UCO) One common theme amongst many Robinhood 100 positions is depressed stocks or ETFs that stand to benefit from the economy returning to normal conditions. If this does happen, UCO will be a great trade for its holders as oil demand will increase. UCO tracks the price of crude oil with twice the leverage. It holds contracts on multiple timeframes and rolls them over. This incurs costs that also eat away at returns. So far, Robinhood traders have been correct in that the economy continues to improve from the worst levels of March and April. And this has translated into impressive gains for UCO from its April lows. SPDR S&P 500 ETF (SPY) SPY’s inclusion on the list shows that many Robinhood users are there for long-term investments. SPY is a low-cost way to get exposure to the 500 largest companies on the market and gives someone diversified exposure to the US economy. It’s a great vehicle for someone looking to build wealth and start saving for retirement. Every year, a few companies are added and dropped from the S&P 500 to reflect changes in the economy. So, it’s encouraging that many Robinhood users are adding it to their portfolio. It also dispels the common myth that all Robinhood users are chasing the latest hot stock. Our POWR Ratings show that SPY is rated a Strong Buy. It has an “A” for Trade Grade, Buy & Hold Grade, Industry Rank, and a “B” for Peer Grade. Among Blended Large Cap ETFs, it’s ranked #1 out of 133. Invesco S&P 500 High Dividend Low Volatility ETF (SPHD) SPHD is another more conservative ETF that tracks 50 low-volatility stocks from the 75 highest-yielding companies in the S&P 500. Consistent with this theme, the ETF pays out a 5.61% dividend. In contrast, the dividend yield for the S&P 500 is 1.8%. The ETF has a large weighting of financials, consumer staples, and utilities. So, it’s underperformed the broader market since the March lows. But investors in SPHD are more focused on generating an above-average income rather than beating the market. It’s another selection that’s appropriate for someone looking to build wealth over the long-term. Given that interest rates are expected to stay low for an extended period, diversified, ETFs with above-average yields remain in demand. Invesco QQQ Trust (QQQ) The QQQ is composed of the 100 largest companies on the Nasdaq. This means that it has exposure to some of the fastest-growing areas of the economy including software, semiconductors, and e-commerce. Over the last 5 years, the QQQ is up 150%. In contrast, SPY is up 70%, and the Russell 2000 (IWM) is up 27%. These differences reveal a lot about what parts of the economy are growing and which have been stagnant. There’s some overlap between SPY and QQQ as companies like Amazon (AMZN), Apple (AAPL), and Microsoft (MSFT) are represented in both. However, they have a greater weighting in QQQ and zero weight in IWM. The POWR Ratings are also bullish on QQQ as it has a Strong Buy Rating. It has an “A” in all categories including Trade Grade, Peer Grade, Buy & Hold Grade, and Industry Rank. Among Large Cap Growth ETFs, it’s ranked #1 out of 39. Want More Great Investing Ideas? 9 “BUY THE DIP” Growth Stocks for 2020 Is the Bull S#*t Rally FINALLY Over? 7 “Safe-Haven” Dividend Stocks for Turbulent Times Top 3 Investing Strategies for 2020 GUSH shares were trading at $31.41 per share on Wednesday afternoon, down $0.14 (-0.44%). Year-to-date, GUSH has declined -97.85%, versus a -1.36% rise in the benchmark S&P 500 index during the same period."}]}