{"article": [{"url": "https://stocknews.com/news/bkep-mbt-mndo-srlp-4-buy-rated-dividend-stocks-with-yields-over-10/", "published": 1595938100.0, "headline": "4 \"Buy Rated\" Dividend Stocks with Yields Over 10%", "body": "Over the long term, dividend stocks have outperformed non-dividend companies. In a study performed by RBC Global Asset Management, researchers found that dividend growers posted an average annual return of 11.7%, and dividend-paying stocks returned an average return of 9.9% between 1986 and 2016. For reference, the S&P 500 returned 7.9% over the same period. We’re in a low-interest rate environment where investors can’t rely on bonds for income. So high dividend-yielding stocks provide the perfect substitute. Due to the pandemic, many companies have slashed their dividends, so it’s important to invest in good companies still paying high dividends, such as Blueknight Energy Partners (BKEP), Mobile TeleSystems (MBT), MIND CTI (MNDO), and Sprague Resources (SRLP). 7 Best ETFs for the NEXT Bull MarketBlueknight Energy Partners, L.P. (BKEP) BKEP provides integrated terminalling, gathering, and transportation services for companies engaged in the production, distribution, and marketing of liquid asphalt and crude oil products in the United States. It owns and operates a mid-continent pipeline system of approximately 611 miles for transporting large amounts of crude oil to refiners or terminalling facilities, along with 63 trucks. BKEP pays an annual dividend of $0.16 per share, which yields 11.39% based on its current price. The company has been paying dividends periodically since 2012, making it a reliable stock for income investors. Also, BKEP recently announced a quarterly cash distribution of Partnership’s preferred units of $0.1785. BKEP did not lower its dividend payout in 2020, despite reporting break-even profits. Though crude oil demands fell significantly in the first quarter of 2020 due to the lockdown and oil price wars, BKEP generated an operating income of $2.8 million through its storage business. Asphalt terminalling segment volume increased 17% year over year during the quarter. Moreover, BKEP’s consensus EPS estimates indicate a 4% annual growth for the next five years. BKEP gained more than 160% since hitting its 52-week low of $0.53 on March 18th due to the pandemic-driven market crash. How does BKEP stack up for POWR Ratings? A for Trade Grade B for Buy & Hold Grade A for Peer grade B for Overall POWR Rating You can’t ask for better. It is also ranked #4 out of 18 stocks in MLPs – Other industry. Mobile TeleSystems Public Joint Stock Company (MBT) MBT provides telecommunication services — mainly voice and data transmission, internet access, pay TV, cloud computing services, data analysis tools, and other value-added services — primarily in Russia. It additionally supports various app platforms for its B2B clients. MBT is one of the most valuable stocks trading under $10, as its dividend of $0.95 per share currently yields 10.66%. It has been paying dividends on a half-yearly basis to its shareholders since 2014. MBT’s average cash flow in the last 5 years is higher than 98.29% of the dividend-paying U.S. stocks in the StockNews.com universe. This should allow MBT to sustain its dividend payouts. MBT’s total capital returned to shareholders through dividends over the last 6 years is higher than 98.6% of other U.S. income stocks. While revenues in the first quarter rose 8.3% year over year, MBT’s CEO and president expects a 3% year-over-year revenue growth for the second quarter despite the pandemic and its impact on the economy. MBT hit its 52-week low of $6.20 on March 18th due to the virus-led dip in the market, but recovered more than 40% since then. MBT is rated “Buy” in our POWR Ratings system, with an “A” in Trade Grade and “B” in Buy & Hold Grade and Peer Grade. Out of 35 stocks in Telecom – Foreign sector, MBT is ranked #5. MIND C.T.I Ltd. (MNDO) MNDO provides customer care software solutions and offline convergent billing in the United States, United Kingdom, Europe, and Israel. The company also facilitates the implementation of business workflow processes, order management, sales processes, etc directly and through network equipment vendors. MNDO pays an annual dividend of $0.24 per share, which yields 11.72% based on its current price. It has more cash than debt, implying its strong financial position in sustaining its dividend payouts. MNDO is a reliable income stock with a 17-year payout history. Though quarterly revenues increased 33% year over year for the first quarter, COVID-19 has delayed ongoing project implementation rollouts and caused a temporary halt on new business opportunities for MNDO. MNDO recovered more than 20% since hitting its year-to-date low in mid-March amid the ongoing healthcare crisis. MNDO is rated a “Buy” stock in our POWR Ratings system, due to its impressive performance during the pandemic. It has an “A” in Industry Rank, and “B” in Trade Grade and Buy & Hold Grade. MNDO is ranked #31 out of 82 stocks in the Software – Application industry. Sprague Resources LP (SRLP) SRLP stores and distributes petroleum and natural gas-related products across the United States and Canada. It also purchases and sells various refined products to commercial, wholesale, and retail customers. SRLP has a 14.3-million-barrel storage capacity and 2 million square feet of material handling capacity. SRLP pays an annual dividend of $2.67 per share, yielding 14.7% on its prevailing price. The company’s free cash flow has a CAGR of 189%, which should sustain its dividend payouts. SRLP increased its quarterly dividend by 2.45% to 0.67 in the third quarter of 2018 and maintained it since then. Despite the economic slump in the petroleum industry, SLRP has managed to retain its position as one of the best income stocks. SRLP signed a $1.8 billion secured, amended and restated credit facility to sustain its business operations. Combined with the gradual revival of demand for petroleum, this credit facility can help the company resume and expand its business operations in the second half of 2020. Consensus EPS estimates indicate a 96.40% growth annually over the next five years. Furthermore, SRLP has surpassed consensus EPS estimates in three of the trailing four quarters, which is impressive. SRLP hit its 52-week low of $9.83 on March 18th due to an overall dip in the market, but gained more than 74% since then. SRLP is a “Strong Buy” in our POWR Ratings system, with an “A” in Trade Grade, Buy & Hold Grade and Peer Grade. It is also ranked #1 out of 56 stocks in the MLPs- Oil & Gas industry. Want More Great Investing Ideas? 9 “BUY THE DIP” Growth Stocks for 2020 Newly REVISED 2020 Stock Market Outlook 7 “Safe-Haven” Dividend Stocks for Turbulent Times BKEP shares were unchanged in after-hours trading Tuesday. Year-to-date, BKEP has gained 31.91%, versus a 0.81% rise in the benchmark S&P 500 index during the same period."}]}