{"article": [{"url": "https://stocknews.com/news/baba-amzn-googl-3-stocks-in-the-robinhood-100-loved-by-analysts/", "published": 1594123700.0, "headline": "3 Stocks in the Robinhood 100 Loved by Analysts", "body": "Investing platform Robinhood has become a “go to” app for more than 13 million investors. It is especially popular among first time users due its easy-to-use interface and free stock trades. The company publishes a list of its most widely held positions called the Robinhood 100. The list includes some great stocks to own and some highly speculative stocks day traders are often buying and selling. Speaking of great stocks to own, here are three companies on that list that analysts love. Alibaba Group Holding (BABA) 9 \"BUY THE DIP\" Growth Stocks For 2020One of the investing success stories of this year has to be e-commerce. Since March, most people around the world have been stuck at home as global leaders try to navigate a path forward in this new “corona world”. One company that continues to do well is BABA. The company recently finished its fiscal year 2020 with $72 billion in revenue. That is a 480% increase over the last five years. BABA’s platform is the dominant ecommerce leader in China. It currently serves 960 million global consumers. Wholesalers can purchase items at bulk on BABA’s main website and consumers can shop on their AliExpress website. AliExpress has also been benefiting from the dropship model, where businesses set up a website to sell products they don’t own in inventory. When a consumer makes a purchase, the business buys that product on AliExpress and has it sent to the consumer. Many Shopify (SHOP) customers use this model. The company has also moved into the cloud computing segment which grew 58% from a year ago as of the quarter ending March 31, 2020. This segment makes up over 10% of total revenue. BABA also has a digital media segment and an investment division. Eighteen out of nineteen analysts have the stock rated a Buy. It should be a shock to no one that BABA is one of the top rated stocks in our momentum based POWR Ratings system . Overall, it is the #1 ranked stock in the China industry. Amazon (AMZN) This online behemoth continues to be the dominant force in e-commerce in the U.S. and in many parts of the world. In these troubling times, consumers are increasingly shopping at sites that can offer the best value. AMZN offers free one-day shipping for millions of items and competitive prices for its Prime members. E-commerce itself still has plenty of room for growth as it only represents 12% of total retail sales in the U.S. AMZN should reap the bulk of those profits in the years ahead. AMZN is also the dominant player in the cloud business. The company holds a 33% share in the $100 billion cloud business, which is more than its three closest competitors, Alphabet (GOOGL), Alibaba (BABA), and Microsoft (MSFT). Revenue at AMZN should continue to rise the remainder of this year due to strong growth in their Web Services unit (AWS) and continued growth in online shopping in North America and Internationally due to the pandemic. Thirty-nine out of forty-two analysts have rated the stock a Buy. AMZN is holding 5 Aces. All 5 scores of our exclusive POWR Ratings system is an A for the stock. It is also the #1 ranked stock in the top industry, Internet stocks. You will be hard pressed to find a stock doing better than AMZN given its full slate of A ratings. Alphabet (GOOGL) GOOGL is the dominant player on the internet. It is best known for its search capabilities and YouTube. The company, which features the most popular search engine, holds a 93% market share in mobile search. The company is also a strong player in cloud computing. It is one of GOOGL’s fastest-growing businesses. The cloud hosting unit provides an AI platform that allows customers to develop AI applications. Another AI unit at GOOGL is DeepMind which was purchased in 2014. The unit developed AI that is helping scientists better understand proteins, which may lead to treatments for genetic diseases. Another business at GOOGL to keep an eye in is Waymo, which is currently valued at $30 billion. Waymo is a self-driving technology business that should see continued growth as self-driving becomes mainstream. Twenty-nine out of thirty-one analysts have the stock rated a Buy. How does GOOGL stack up for the POWR Ratings? A for Trade Grade A for Buy & Hold Grade A for Industry Rank B for Peer Grade A for overall POWR Rating It is the #2 rated stock in the number one ranked industry, Internet stocks. Want More Great Investing Ideas? 9 “BUY THE DIP” Growth Stocks for 2020 Is the Bull S#*t Rally FINALLY Over? 7 “Safe-Haven” Dividend Stocks for Turbulent Times Top 3 Investing Strategies for 2020 BABA shares were unchanged in after-hours trading Monday. Year-to-date, BABA has gained 13.15%, versus a -0.48% rise in the benchmark S&P 500 index during the same period."}]}