{"article": [{"url": "https://stocknews.com/news/shop-amzn-glob-sfix-tgt-will-shares-of-shopify-follow-in-amazons-footsteps/", "published": 1601294900.0, "headline": "Will Shares of Shopify Follow in Amazon's Footsteps?", "body": "As Canada’s most valuable company, Shopify Inc. (SHOP) provides an intuitive e-commerce platform, facilitating merchants of varying types and sizes to offer their products and services. The company powers over one million businesses in more than 175 countries. Like Amazon.com (AMZN), SHOP helps merchants set up digital stores and then provides services to help those businesses grow. Thanks to the pandemic, this year has been outstanding for the e-commerce platform due to the accelerated pace of adoption of online shopping by consumers. SHOP is one of the best-performing stocks in 2020, with record revenue and income growth. Total revenue in the second quarter was $714.3 million, a 97% increase from the comparable quarter in 2019. Monthly recurring revenue stood $57 million, growing 21% compared to the year-ago quarter. Moreover, Gross Merchandise Volume (GMV) for the quarter increased 119% year-over-year. EPS for the quarter came in at $0.29, significantly improving from the year-ago loss of $0.26 per share. With the robust growth in the e-commerce platform amid the pandemic, the stock gained 141.7% year-to-date compared to the AMZN’s 67.5% return in the same period. Given SHOP’s huge success in the e-commerce space, this is perhaps the right time for the company to venture into the other areas that Amazon is currently dominating. 7 Best ETFs for the NEXT Bull MarketHowever, based on several factors, SHOP has a “Neutral” rating in our proprietary rating system. Here is how our proprietary POWR Ratings system evaluates SHOP: Trade Grade: C SHOP is currently trading below its 50-day moving average of $992.93 but higher than its 200-day moving average of $688.90, indicating that the stock is neither in an uptrend nor in a downtrend. However, the stock’s 149.8% return over the past six months reflects a solid short-term bullishness. New stores created on the Shopify platform grew 71% in the second quarter compared to the preceding quarter. This was primarily driven by the rapid shift to e-commerce as well as by the extension of the free trial period offered by SHOP on standard plans from 14 days to 90 days. However, GMV through the point-of-sale (POS) channel declined by 29% quarter-over-quarter, as many retail merchants suspended their in-store operations during the first half of the quarter. Buy & Hold Grade: C In terms of proximity to its 52-week high, which is a key factor that our Buy & Hold Grade takes into account, SHOP is fairly positioned. The stock is currently trading 16% below its 52-week high of $1146.91. Looking at the past three years, the stock gained more than 725% due to the steady growth in user base consisting of small businesses and rapid supply-chain expansion. The company’s revenue grew at a CAGR of 60% during the same period. In the second-quarter earnings report, SHOP mentioned, “We are committed to transferring the benefits of scale to our merchants, helping them sell more and sell more efficiently, which is especially critical in this rapidly changing environment.” While SHOP may have been able to sustain the pandemic-driven accelerated business growth, the majority of its customers, the small businesses, will not be able to survive if there is a steep fall in demand. Peer Grade: B SHOP is currently rated #11 out of 34 stocks on the Internet – Services industry. Other popular stocks in the group are Globant S.A. (GLOB), Stitch Fix, Inc. (SFIX), and TechTarget, Inc. (TTGT). SHOP comfortably beat the year-to-date gains of the three industry participants. GLOB, SFIX, and TTGT returned 64.4%, 2.3%, and 62%, respectively, over this period. Industry Rank: C The Internet – Services industry is currently ranked #88 out of the 123 industries. The companies in this industry concentrate on numerous e-business services. Under the new stay-at-home normal, online platforms have been witnessing an accelerated demand. As a result, the stocks of companies that facilitate e-commerce have soared way too high. This surge can witness a massive fall, as profit booking may start anytime soon. Overall POWR Rating: C (Neutral) Overall, SHOP is rated a “Neutral” due to its impressive past performance, solid price momentum, and exponential growth in profits. But the company is facing deteriorating fundamentals amid the increasing competition, as determined by the four components of our overall POWR Rating. Bottom Line Despite soaring so far this year, the rising unemployment and declining consumer spending are impacting new shop creation on SHOP’s platform. SHOP is facing immense competition from traditional players, and hence, the company has not increased the price of its monthly subscriptions on any of its three existing plans since 2017. However, the migration to Shopify Plus of larger sellers continued in the second quarter. A large number of merchant upgrades outpaced the number of downgrades, which peaked in April before returning to pre-COVID levels by the quarter-end, indicating its ability to retain paid merchants. Analyst sentiment, which gives a good sense of a stock’s future price movement, is notable for SHOP. The average broker rating of 1.67 indicates a favorable analyst sentiment. Analysts expect revenues for the third quarter ending September 2020 to grow 67% year-over-year. The consensus EPS estimate for the ongoing quarter indicates a 269% rise from the year-ago value. This outlook should keep SHOP’s price momentum alive in the near term if it can retain its financial performance and start venturing new verticals like AMZN. Want More Great Investing Ideas? 7 “Safe-Haven” Dividend Stocks for Turbulent Times When Does the Next Bull Run Start? Chart of the Day- See the Stocks Ready to Breakout SHOP shares rose $0.87 (+0.09%) in after-hours trading Monday. Year-to-date, SHOP has gained 143.10%, versus a 5.32% rise in the benchmark S&P 500 index during the same period."}]}