{"article": [{"url": "https://stocknews.com/news/spy-inx-dia-iwm-qqq-is-stock-market-volatility-the-new-normal/", "published": 1602072500.0, "headline": "Is Stock Market Volatility the “New Normal”?", "body": "(Please enjoy this updated version of my weekly commentary from the Reitmeister Total Return newsletter). The stock market lately reminds me of how we locals talk about the Chicago weather…”wait 5 minutes and it will change”. So just as the S&P was ready to lock in a 2nd straight close above the 50 day moving average at 3,365 the President shockingly announced that they will stop negotiating the stimulus deal til after the election. With that stocks tumbled -2.1% in the final hour of trading. 7 \"SAFE HAVEN\" Dividend Stocks for Turbulent TimesWe will break down that action, and a whole lot more, in this week’s commentary. Market Commentary Hey…did you watch the October 5th Reitmeister Total Return Members only webinar? If not, then you missed a lot of good stuff including: * Reminder of Pre-Election Stock Pattern which is decidedly negative * Problems with a delayed election * BIGGER problems with a likely contested election * Don’t get bullish to after the election is FINALIZED (and what does finalized mean?) * Portfolio position review * Why gold and silver has lost some of its shimmer * How low interest rates has help prop up stock prices * And many other key investing topics Click Here to Watch Now I cannot top the clarity and depth of the market outlook shared in the above webinar. So truly you are cheating yourself if you do not make time to watch it this week. So instead of regurgitating everything from the webinar I will just assume that you have seen it and then pick up the story from there. And that story took a crazy turn with just over an hour to go in the trading day when President Trump stated that White House will stop negotiating on the stimulus package til after the election. The 2.1% drop from peak to valley pushed stocks back under the 50 day moving average at 3365. One has to wonder if this is just a negotiating ploy straight out of “The Art of the Deal” to get the upper hand in stimulus talks. If not, then it is indeed another uncertainty weighing on the market into the election. And why I continue to be defensive in my trading strategy at this time. (Then ready to flip the script to bullish once election is finalized. Again this topic is the very heart of this week’s webinar…maybe you should watch it now). Now let’s flip the page and dive into the deep pool of economic reports shared over the past week. Much to talk about on this front…and mostly positive. Employment is an interesting place to start as we got 3 different reports this week to shed light on this important economic indicator. The good news is that there are significant job gains and the unemployment rate continues to drop. Oddly the ADP Employment report on showed 100K more jobs added than expected. Whereas the Government Situation report on Friday came in at 190K jobs light of expectations. But the drop in the unemployment rate from 8.4% to 7.9% was better than expected. Even better than that was the continuing claims report on Thursday which showed a drop of 1 million less people getting unemployment payments. That is the biggest one week improvement since early July. Next up in importance was the ISM Manufacturing report from last Thursday. That came in around expectations at 55.4. Even better was New Orders at 60.2. Employment is still the laggard at 49.6, but that is the best reading for this measure since the recession started. ISM Services flexed even more muscle than manufacturing at 57.8. That was also above expectations as were the readings for New Orders (61.5) and Employment (51.8). The PMI version of this report showed similar positive trends. Here is the oddest part of the recent economic data. Consumer Confidence SOARED from 86.3 all the way up to 101.8. That did seem too good to be true at the time which was it was important to see what the competing Consumer Sentiment report had to show. There will see a very sobering and still very low 80.4. However, the view of future expectations continues to climb as more people are seeing the light at the end of the tunnel. So on the one hand you have a negative pattern for stocks into the election juxtaposed with an improving economic picture. This is why we see so much volatility. And so much time going above and below the 50 day moving average (currently at 3,365). This see-sawing action is pretty typical behavior in the pre-election pattern. The key thing to note is that each bounce does not extend to new highs and they are typically followed by the next tumble to lower lows. I expect the same thing to happen here, especially because of what I see happening on the election front with increasing odds of a delayed, or yet worse, contested election. Note that the Presidential debate on last Tuesday was an interesting event to watch alongside the stock market futures. At their peak the market was up +0.7% but in the waning minutes it fell apart and tumbled to -0.4%. The reason for the about face was the section of the debate on whether the candidates would accept the election results. That’s because two things became clear to all. First, that the election will not be over on the Wednesday following the election because the deluge of write in ballots will lead to a delay in the final count. Second, and more importantly, President Trump has stated quite clearly that he believes fraud will be rampant and seems very geared up for a contested election. Again, I say unreservedly that getting long the stock market before the election is FINALIZED with a clear and undisputed victor in the White House, is a mistake. Just picture the headlines of a contested election. And picture, not just protests with millions marching around the country, but rioting and potentially violent clashes between the opposing sides. The risk of this is far too high. And yes, if it does happen then the great uncertainty caused is easily understood as a negative to the market. I am not alone in seeing this high risk. In a recent survey of top Asian money managers here was their breakdown of their expected election outcome: 40% Biden Wins 23% Trump Wins 37% Contested Election…yes, almost as high as Biden wins The rest of their game plan noted in this CNBC article does mirror a lot of what we are set to do in the Reitmeister Total Return like getting more defensive with more cash (or in our case, inverse ETFs too). Also they believe when it’s time to buy stocks, investors should rotate out of the currently fashionable and overpriced tech stocks into value sectors like travel and leisure. As you know, I have pointed out the same, but have broadened out that value group to banks, industrials, and potentially select energy stocks. Plus if you are going to venture into tech, then it does appear that Asian tech stocks are the better value. And yes, I intend to make my way back into Alibaba as one of the best risk/reward positions for the long haul. Back to the main point…history says the market chops around in September, then the bottom drops out in mid to late October coming down the home stretch into the election. Add to this pattern the increased concerns of a delayed or contested election then you understand why I am not taking the bait on any of these rallies. Instead I expect more downside towards the 200 day moving average at 3,100 into the election. And then we will start looking for our buying opportunities. What To Do Next? Right now my Reitmeister Total Return portfolio has already taken steps to protect against the correction that likely will extend into (and beyond) the November election. This has led to a strong outperformance over the S&P. All in all we have 8 positions that are just right for the times: 3 stocks that are uniquely built to excel during the Coronavirus recession. 2 precious metals ETFs because when the US government and Fed throw money out of a helicopter it devalues the dollar and makes precious metals all the more valuable. 3 inverse ETFs that rise as the market falls. This has been our saving grace in September as the market tumbled from recent highs. And likely will continue to rise in value as this correction has not yet run its course. But let’s be honest with ourselves. Its crazy out there! That’s why I am trying my best to help investors make sense of it all and profit from whatever scenario comes our way. The best way for me to do that is give you 30 days access to the Reitmeister Total Return. This is my newsletter service where I share more frequent commentaries on the market outlook, trading strategy, and yes, a portfolio of hand selected stocks and ETFs to produce profits whether we have a bull…a bear…or anywhere in between. As shared above, we properly called an end to the stock bubble in September and already aligned our portfolio to protect against the downside. That explains how we continue to handily top the market at this time while others are seeing serious losses. Just click the link below to see all 8 stocks and ETFs in this uniquely successful portfolio. Plus get ongoing commentary and trades to adjust your strategy as 2020 continues to be the wildest market in history. Gladly it can be tamed. About Reitmeister Total Return newsletter & 30 Day Trial Wishing you a world of investment success! Steve Reitmeister …but everyone calls me Reity (pronounced “Righty”) CEO, Stock News Network and Editor, Reitmeister Total Return SPY shares were trading at $341.34 per share on Wednesday afternoon, up $6.41 (+1.91%). Year-to-date, SPY has gained 7.57%, versus a % rise in the benchmark S&P 500 index during the same period."}]}