{"article": [{"url": "https://stocknews.com/news/slb-hal-oih-bkr-cvx-oil-services-stocks-remain-weak-but-offer-intriguing-upside/", "published": 1601986100.0, "headline": "Oil Services Stocks Remain Weak but Offer Intriguing Upside", "body": "Schlumberger- Price weakness since early June but topping earnings expectations Haliburton- Lower since mid-August but remains profitable Baker Hughes pays a healthy dividend 7 Best ETFs for the NEXT Bull MarketOil services companies provide the infrastructure and technology for the businesses that extract oil and gas from the earth’s crust. Over the past years, the energy business that supplies the fossil fuels that power the planet has had a rough time. While the stock market moved to record highs, shares of energy-related companies have lagged the rest of the market. They have not only underperformed other stocks; many remain near multiyear lows. In bear markets, bullish news has a marginal impact on an asset’s price, but bearish events cause the prices to plunge. Since 2018, energy stocks have been in a brutal bearish trend. As the world looks towards alternative energy sources, the price action in the oil and gas sector reflects the move towards more environmentally friendly choices. In August, The DJIA dropped Exxon-Mobile (XOM) as a member of the closely watched index. Only Chevron (CVX) remains a component of the industrial index. The US election could also be weighing on energy stocks. The potential for a substantial shift in energy policy in the world’s leading oil and gas producing nation could have far-reaching consequences for energy prices and the companies that produce the commodities. The potential for more regulations and a reduction in fracking is one of the many issues voters face when they go to the polls on November 3 to elect the President and legislative representatives for the coming years. Schlumberger (SLB), Halliburton (HAL), and Baker Hughes (BKR) are three leadings in the oil services sector. The VanEck Vectors Oil Services ETF (OIH) has an over 37% exposure to the three companies. Schlumberger- Price weakness since early June SLB has long been the premier oil services company worldwide. The company provides technology for reservoir characterization, drilling, production, and processing to the oil and gas industry worldwide. The company has been around since 1926, with its headquarters in Houston, Texas. SLB had a market cap of $21.613 billion at a share price of $15.57 on October 2. The company trades an average of almost 12 million shares each day. SLB pays shareholders a $0.50 dividend, equating to 3.21%. When it comes to the share price, SLB is trading at a level that is a fraction of the high from mid-2014. Source: Barchart As the chart highlights, SLB shares hit a high of $118.76 in July 2014. Since then, the stock fell off the side of a bearish cliff. In March 2020, at the height of the risk-off period that took nearby NYMEX oil futures below zero for the first time, the stock fell to $11.87. At $15.57 on October 2, SLB remains not far above its low and at a fraction of the level six years ago. In June, the stock rebounded to $23.74, where it ran out of steam on the upside. SLB earnings continue to beat projections While SLB shares have suffered, the company reported a profit over the past four consecutive quarters and beat analyst estimates each time. Source: Yahoo Finance The chart shows that even during the challenging second quarter, when the oil price fell below zero in the US, SLB managed to report a five cents per share profit compared to expectations for a loss of a penny per share. The current consensus estimate for Q3 is for EPS of 12 cents. A survey of twenty-seven analysts on Yahoo Finance has an average target of $23.56 for SLB shares with a range of $12 to $30. The metrics point to a bargain-basement price for the shares of the premier oil services company at below $16 on October 2. Haliburton- Lower since mid-August HAL provides services to oil and gas companies worldwide. The company has been in business since 1919 and also has its headquarters in Houston, Texas. At $11.31 per share on October 2, HAL had a market cap of just below $9.94 billion. Over an average of 14.7 million shares change hands each day. The company pays its shareholders an 18 cents per share dividend, or 1.59% at its latest share price. Like SLB, HAL shares hit its high in July 2014. Source: CQG As the chart shows, HAL shares traded to a high of $74.33 in July 2014. In March 2020, the shares fell to a low of $4.25. Even though HAL recovered to $11.31 at the end of last week, the shares are at a very low level compared to the past years and remain in a bearish trend. HAL continues to profit HAL has reported profits over the past four consecutive quarters. Source: Yahoo Finance The chart shows HAL’s consistent earnings record where it met or beat consensus estimates over the past four quarters. In Q2, HAL earned five cents per share compared to expectations for an eleven cents loss. An average of twenty-six analysts on Yahoo Finance has an average target of $15.68 per share for HAL, ranging from $10 to $22.50. At below $11.50, the shares are at the lower end of the band. Baker Hughes pays a healthy dividend BKR is another oil services company with headquarters in the heart of the US corporate oil patch in Houston, Texas. At $12.65 per share on October 2, BKR’s market cap was at just over $13 billion. Over an average of 6.3 million shares traded each day. BKR is currently paying shareholders a $0.72 dividend, or 5.69%. Source: CQG The chart illustrates that BKR traded to a high of $69.77 in 2007 and has made lower highs and lower lows over the past thirteen years. In March 2020, the shares traded to a low of $9.12. At $12.65 at the end of last week, the shares declined from the most recent high of $19.30 in June and were closer to the March low than the June high. Source: Yahoo Finance HAL reported earnings in three of the past four quarters but lost five cents per share in Q2 2020. The company’s EPS came in below consensus estimates in three of the past four quarters and met the projection in Q1 2020. A survey of twenty-six analysts on Yahoo Finance has a target of $20.40 per share for BKR, with a range of $16 to $26. BKR was substantially below the low end of the band at the end of last week. OIH is the oil services ETF product with an over 37% exposure in the three leading companies OIH holds long positions in SLB, HAL, BKR, and other companies in the sector. The most recent top holdings include: Source: Yahoo Finance The ETF has a 37.03% exposure to the three top companies. OIH has net assets of $475.06 million, trades an average of over 520,000 shares each day, and charges a 0.35% expense ratio. The ETF pays a blended dividend of around 4.77%. One month of dividends more than covers the cost of the expense ratio for OIH. Source: Barchart The chart shows that OIH traded to a reverse split-adjusted high of $1525 in 2008 and hit a low of $66 in March. At $96.75 per share on October 2, OIH is at a price that is attractive for those who believe oil services will eventually make a comeback. The energy companies have suffered over the past years. Oil services companies have done even worse than the overall sector. However, companies like SLB, HAL, and BKR continue to report EPS, pay dividends, and are all trading below analyst’s target levels. While the trend in these stocks remains bearish, the fundamentals of the companies suggest the potential for rebounds. OIH is a product that diversifies risk in the sector, with around one-third exposure to the three top companies. Want More Great Investing Ideas? Do NOT Buy Stocks Before the Election! 7 “Safe-Haven” Dividend Stocks for Turbulent Times Chart of the Day- See Christian Tharp’s Stocks Ready to Breakout SLB shares. Year-to-date, SLB has declined -59.91%, versus a 5.55% rise in the benchmark S&P 500 index during the same period."}]}