{"article": [{"url": "https://stocknews.com/news/zm-ddog-teva-3-stocks-with-p-e-ratios-over-1500/", "published": 1599134900.0, "headline": "3 Stocks With P/E Ratios over 1,500!", "body": "Even though the stock market is down today, it’s still trading at sky-high valuation levels – we have the second-highest reading in history, trailing only the dotcom bubble. 9 \"BUY THE DIP\" Growth Stocks For 2020(source: Multpl.com) Investors should take note because buying stocks when valuations are high is correlated with poor, long-term returns. Valuations have been trending higher for the past decade as the economy has recovered from the depths of the Great Recession. Typically, valuations get cheaper during bear markets and recessions. For example during the bear market from 2000 to 2003, the Shiller P/E ratio dropped from 45 to 23. During the Great Recession, it dropped from 27 to 15. This happens as investors grow more pessimistic about the future. There’s increased demand for cash and bonds, while risky assets like stocks are less desirable. Unusual Times However, this hasn’t happened during the coronavirus recession. Stock prices are higher now than before the crisis, while earnings have dropped by 19% in 2020. Some possible explanations for this unusual behavior: The market is anticipating that earnings are going to return to pre-coronavirus levels and interest rates are at much lower than before the coronavirus. Further, the Federal Reserve has said that interest rates will remain at zero at least for the next 15 months. In his Jackson Hole monetary policy address, Chair Powell discussed revising its inflation policy so it would tolerate higher levels of inflation. Basically, the Fed is signaling that it will let the economy “run hot”. Another thing that’s different about this recession is the size and speed of the government’s response to the crisis. Both the Fed and the federal government acted aggressively within weeks, while in past recessions, it’s taken months or years for interest rates to bottom or deficit-spending used to support aggregate demand. A Bubble? One potential explanation that is consistent with these developments is that the market is in a bubble. We have some of the ingredients in place. Interest rates are at zero, and the Fed has instituted a variety of measures to inject liquidity into financial markets. The odds of a market bubble are higher when money is cheap. There’s also been an increase in public interest in the markets. More retail participation in the market enhances the odds of a bubble forming as they are more susceptible to herd-like behavior. Over the last decade, stocks have done very well, so there’s more confidence that they will continue outperforming. There’s also the perception that the Fed and federal government are prepared to act aggressively if the recovery starts lagging. This thinking is supportive of the “buy the dip” attitude. A bubble happens when prices get disconnected from reality. A feedback loop develops between rising prices and investors’ emotions and beliefs. That’s why looking at financial metrics like the price-to-earnings (P/E) ratio is useful to get an objective perspective. High P/E Ratios From a general market perspective, lofty P/E ratios tell us that investors are becoming more optimistic about the future since they’re willing to pay a higher price relative to their earnings. From an individual stock level, a high P/E ratio tells us that investors are pricing in future earnings growth. On its own, a high P/E ratio doesn’t indicate anything about a stock other than a bigger tradeoff between risk and reward. When the dotcom bubble burst, high-multiple stocks saw the biggest losses. However, it’s also true that some of the biggest winning stocks of the past few decades have been companies like Amazon (AMZN), Facebook (FB), or Google (GOOG) – stocks that started with a massive price to earnings ratios and grew into this valuation. For example, FB had a P/E ratio of 1,280 in March 2013. Today, its P/E is 36. Looking at companies with four-digit P/E multiples from the past reveals a list of big winners and stocks that flamed out. I thought it would be interesting to look at Teva Pharmaceuticals (TEVA), Zoom Video Communications (ZM), and Datadog (DDOG). All three stocks have a price to earnings ratio above 1,500. Teva Pharmaceutical (TEVA) TEVA is the world’s largest manufacturer of generic drugs. It also has its own drug development operations. For most of its history, Teva Pharmaceuticals’ P/E ratio was between 10 and 35. Currently, it’s at 3,133. From 2016 to 2018, TEVA’s earnings-per-share (EPS) went from $3.50 per share to -$18 per share. Its stock fell more than 80% over this period. The company’s fortunes experienced such a sharp decline because its revenues declined as it lost the exclusive license for ts multiple sclerosis drug, Copaxone. It also faced legal action due to the opioid crisis. The company had also taken on too much debt to make its ill-fated acquisition of Actavis. These negatives were the catalyst for Teva’s earnings dropping. Now, the company is executing a turnaround plan and its earnings are set to go from $0.01 per share to over $3 per share next year. Thus, its P/E ratio should also return to its previous range. Zoom Video Communications (ZM) ZM has been one of the leading stocks of this bull market and one of the big winners of the post-coronavirus economy. Its stock gained 40% following its third-quarter earnings report. The company reported that revenues quadrupled and earnings came in at $181 million which was twice analyst’s expectations and a significant improvement from last year’s Q2 net income of $5 million. It also increased its gross margin to 72% from 69%. Since the March low, ZM is higher by 320%. Over this time period, its P/E has increased from 750 to 2,353. This is indicating that investors keep upgrading their expectations for ZM. ZM can grow into this valuation if it can maintain its position as the premier, video conferencing platform. The POWR Ratings are high on ZM as it’s rated a Buy. It has an “A” for Trade Grade and Peer Grade with a “B” for Buy & Hold Grade. It’s ranked #6 out of 51 Applications – Services stocks. Datadog (DDOG) DDOG has nearly tripled since the March low. It has benefitted from the coronavirus economy due to the acceleration in cloud spending and migration. DDOG creates software tools to monitor cloud analytics. It helps companies optimize their cloud infrastructure and operations. DDOG’s P/E ratio is about 8,500. Despite being worth $25 billion, the company made $3.5 million last year. Investors are focused on DDOG’s future profits. The company has 70% revenue growth and 78% gross margins. This means if growth continues, then the profits will come. Based on projected earnings growth, DDOG’s P/E will decline from 8,500 to 565. The company has a high bar due to its inflated multiple, however if it can top these lofty expectations, then the stock can still be an outperformer. DDOG is rated a Buy by the POWR Ratings. It has a “B” for Trade Grade, Buy & Hold Grade, and Industry Rank. Among Software – Business stocks, it’s ranked #21 out of 42. ZM shares were trading at $377.50 per share on Thursday afternoon, down $46.06 (-10.87%). Year-to-date, ZM has gained 454.82%, versus a 8.60% rise in the benchmark S&P 500 index during the same period."}]}