{"article": [{"url": "https://stocknews.com/news/rdy-infy-wit-wns-azre-top-5-indian-stocks-to-invest-in/", "published": 1595851700.0, "headline": "Top 5 Indian Stocks to Invest In", "body": "India is one of the world’s fastest-growing economies. In 2017, it surpassed China’s growth rate and is set to be a $5 trillion economy by 2024. Over the last decade, the Bombay Sensex, India’s flagship index is up 143%. For Indian companies, there is a significant, domestic opportunity given its massive and still growing population of 1.2 billion people. Millions of Indians every year are moving into the middle class and buying their family’s first car, refrigerator, air conditioning, and other amenities. This consumption boom happened in the US in the ’50s and China in the ‘90s. For both, it marked excellent periods to make long-term investments in high-quality companies. 7 Best ETFs for the NEXT Bull MarketMany Indian companies are also competing globally in sectors like alternative energy, information technology, and pharmaceuticals. Dr. Reddy’s Laboratories (RDY), Infosys Limited (INFY), Wipro Limited (WIT), WNS Holdings (WNS), and Azure Power Global (AZRE) are five of the best Indian stocks on US markets. Dr. Reddy’s Laboratories (RDY) RDY is up 60% since the March low in the stock market. Over the past three months, it’s traded in a tight range between $50 and $55, consolidating beneath its 52-week high. India is a leader in generic pharmaceuticals, accounting for nearly 50% of worldwide production. A third of generics sold in the US are made in India. This figure is likely to grow as companies shift manufacturing away from China. RDY is one of the leaders in generic manufacturing and currently is producing 112 drugs. In terms of fundamentals, RDY is growing 10% with 54% gross margins. Despite above-average growth and high margins, its forward price to earnings is cheaper than the S&P 500 at 27. How does RDY stack up on POWR Ratings? A for Trade Grade A for Buy & Hold Grade A for Peer Rank A for Industry Rank A for overall POWR Rating You can’t ask for better. It is ranked #9 out of 213 stocks in the Medical – Pharmaceuticals Industry. Infosys Limited ADR (INFY) INFY is benefitting from a variety of catalysts. The work-from-home movement means that workers from all over the world can compete for positions that benefit outsourcing companies. Additionally, the Indian Rupee is historically cheap against the US dollar which makes their offerings even more competitive. INFY is making new, all-time highs in recent weeks due to these factors. It’s growing sales at 8% and has 18% profit margins. On top of that, its price to earnings is 20 which makes it cheaper than the average stock in the S&P 500. INFY’s POWR Ratings are attractive as well. It has a Strong Buy rating with an “A” for Trade Grade, Buy & Hold Grade, and Industry Rank with a “B” for Peer Grade. Among Outsourcing – Tech Services stocks, it’s ranked #2 out of 14. Wipro Limited (WIT) WIT is in the same sector as INFY, so it’s benefitting from the same trends – a cheap rupee and increased demand for its services. Additionally, as remote work increasingly becomes common, it will increase the demand for IT services which will be a positive tailwind for the sector. (source:finviz.com) However, one difference between WIT and INFY is that WIT remains off its all-time highs by 25%. Nevertheless, there are some things to like with the stock as it successfully retested its lows from earlier in the decade. Additionally, it’s valuation is attractive with a price to earnings ratio of 17. According to POWR Ratings, WIT is a Strong Buy with an “A” for Trade Grade and Buy & Hold Grade. It has a “B” for Industry Rank and Peer Grade. Among Outsourcing – Tech Services, it’s ranked #3 out of 14. WNS Holdings Limited (WNS) WNS has gained 500% over the last decade. Despite these big gains, it retains a reasonable valuation with a forward price to earnings of 20. It is a business process management company that offers services to a variety of industries including insurance, manufacturing, retail, and telecom. WNS basically allows companies to outsource certain processes such as handling insurance claims or repairing products. Over the past couple of years, WNS has been moving up the value chain as it seeks to handle higher-margin segments. Currently, most of the company’s revenue comes from outside India, but it’s growing double-digits domestically and over the coming years expect this to become its biggest market. According to POWR Ratings, WNS is rated a Buy. It has an “A” for Trade Grade and a “B” for Peer Grade and Industry Rank. Among Financial Services (Enterprise), it’s ranked #26 out of 137. Azure Power Global (AZRE) AZRE has been one of the hottest stocks in the market. Since the March-low in the stock market, it’s gained nearly 175%. The entire alternative energy sector has been strong. One factor is Vice-President Joe Biden’s proposed energy plan which calls for increased tax credits and a $1 trillion investment into “green energy infrastructure” over the next 4 years. AZRE engages in the manufacture, development, and maintenance of solar power plants in India. Currently, the company is in growth mode and focused on increasing market share. It’s growing sales by 29% and has 91% gross margins. The price of solar cells has dropped 90% over the last decade. Many are expecting battery prices to drop as efficiency improves in the same manner over the next decade. This would result in AZRE’s projects becoming even more profitable. AZRE is rated a Strong Buy by the POWR Ratings. It has an “A” for Trade Grade and Buy & Hold Grade with a “B” for Peer Grade and Industry Rank. Among Solar stocks, it’s ranked #4 out of 14. Want More Great Investing Ideas? 9 “BUY THE DIP” Growth Stocks for 2020 Newly REVISED 2020 Stock Market Outlook 7 “Safe-Haven” Dividend Stocks for Turbulent Times RDY shares were trading at $54.01 per share on Monday afternoon, down $0.50 (-0.92%). Year-to-date, RDY has gained 33.80%, versus a 1.11% rise in the benchmark S&P 500 index during the same period."}]}