{"article": [{"url": "https://stocknews.com/news/tlry-cgc-why-did-shares-of-tilray-fall-after-earnings/", "published": 1597234100.0, "headline": "Why Did Shares of Tilray Fall After Earnings?", "body": "Tilray (TLRY) reported disappointing earnings on Monday. Revenue fell 3.2% from the previous quarter to $50.4 million. While many cannabis companies saw revenue increases in Q1 due to a spike in demand from consumers stockpiling, that demand has now returned to pre-Q1 levels. TLRY’s stock was down 13% yesterday due to the news. The quarterly revenue drop is attributed to a 15.8% decrease in Adult Use sales, a 5.3% decrease in Canada Medical sales, and a 5.1% decrease in Hemp sales. Revenue did increase 10% year over year, driven by a 16.2% increase in cannabis sales. This was primarily a result of ongoing improvement in the International Medical segment. Despite the difficult quarter, Brendan Kennedy, TLRY’s Chief Executive Officer remained positive stating, “Since the beginning of 2020 we have taken bold and significant actions to position Tilray for future growth and success. We have focused on reducing costs, driving international revenue growth, mitigating COVID-19 related challenges, and improving our net loss and reported Adjusted EBITDA. Today’s results demonstrate significant progress in all these areas. Despite a challenging business environment, we generated healthy year-over-year revenue growth, we significantly reduced our cost structure and cash burn, and we improved our Adjusted EBITDA and net loss compared to both the prior quarter of 2019 and the first quarter of 2020.” 9 \"BUY THE DIP\" Growth Stocks For 2020As a result of these less than stellar earnings, Cantor Fitzgerald analyst Pablo Zuanic reduced his price target for Tilray from $8.00 to $7.90, though he maintained a Neutral rating. He said his price target reduction was due to the total sales in the second quarter being adversely impacted by recreational sales, which fell by 16% sequentially, after growing for five consecutive quarters. Tilray’s recreational sales amounted to just C$24.2 million compared to rival Canopy Growth’s (CGC) which reported C$34.9 million. Margins decreased this quarter along with a substantial decrease in average per gram selling price. With an average production cost per gram of over $2, TLRY needs to get costs down to around $1. Until TLRY can prove that the company is on track to profitability with strong revenue, investors might want to watch from the sidelines. Want More Great Investing Ideas? 3 Possible Directions for the Stock Market from Here How to Trade THIS Stock Bubble? 9 “BUY THE DIP” Growth Stocks for 2020 TLRY shares were trading at $6.91 per share on Wednesday morning, down $0.02 (-0.29%). Year-to-date, TLRY has declined -59.66%, versus a 5.79% rise in the benchmark S&P 500 index during the same period."}]}