{"article": [{"url": "https://stocknews.com/news/fb-snap-facebook-vs-snap-which-stock-is-a-better-buy/", "published": 1601986100.0, "headline": "Facebook vs. Snap: Which Stock is a Better Buy?", "body": "Facebook, Inc. (FB), and Snap, Inc. (SNAP) are two of the leading social media platforms in the world with millions of users across the world. However, FB’s popularity is higher with 1.79 billion daily active users, compared to SNAP’s 238 million as of the second quarter of 2020. Both stocks have generated significant returns over the past three years. While FB gained 54.6% over this period, SNAP gained 90.2%. In terms of year-to-date performance, SNAP is the clear winner with 68.7% returns versus FB’s 28.9%. But which stock is the better buy now? Let’s find out. 9 \"BUY THE DIP\" Growth Stocks For 2020Latest Movements FB is one of the best-performing stocks during the pandemic due to the increasing popularity of social media. It owns WhatsApp and Instagram, making it the biggest social media company in the world. FB invested $5.70 billion in India’s Reliance Jio in April, which allowed the company to increase its market reach in the second largest internet user market. FB recently rolled out its business suite, allowing companies to advertise seamlessly on its platform. It is also planning on rolling ads limit on individual pages to reduce the cost of advertising while improving its performance, through integrated machine learning and personalization options. SNAP developed new camera and augmented reality experiences for developers, creators, and snapchat users in June. It also partnered with Headspace to develop a new series of features to promote the mental and emotional wellbeing of its users. SNAP also developed a new product called “happening Now” to deliver the latest news to its users. Furthermore, Disney, ESPN, ViacomCBS, MTV, NBA, NBC, and NFL expanded their commitments to deliver more content to Snapchat Discover. SNAP also developed several products across its Snap Kit, Snap Games, and Bitmoji systems to engage its user base. Recent Financial Results FB reported an 11% year-over-year increase in its revenues to $18.69 billion in the second quarter ended June 2020. Both net income and EPS improved 98% from the same period last year to $5.18 billion and $1.80, respectively. Its daily active users increased by 12% year-over-year to 2.70 billion. SNAP’s revenue and daily active users both increased 17% year-over-year to $454 million and 238 million, respectively, in the second quarter ended June 2020. Thus, FB has an edge over SNAP here. Past and Expected Financial Performance FB’s revenue increased at a CAGR of 20.1% over the past three years. The market expects the company’s revenue to increase by 11.7% in the third quarter, 13.5% in the current year, and 24.1% next year. Its EPS is expected to rise at a rate of 20.3% per annum over the next five years. SNAP’s revenue grew at a CAGR of 45.5% over the past three years. The market expects SNAP’s revenue to rise by 23.1% in the third quarter, 27.7% in the current year, and 38% next year. Its EPS is expected to rise by 67.4% per year over the next five years. SNAP is an advantageous position here. However, given FB’s market valuation and user base, its relatively lower revenue growth could result in higher earnings compared to SNAP. Profitability FB’s trailing twelve-month revenue is 39.2 times of what SNAP generates. Also, FB is more profitable with a gross margin of 81.5% versus SNAP’s 49%. Valuation In terms of trailing 12-month P/S, FB is currently trading at 10.04x, 50.5% less expensive than SNAP, which is currently trading at 20.30x. FB’s trailing 12-month Price to Book of 6.83x also compares with SNAP’s 18.37x. While FB is more reasonably priced, SNAP’s premium valuation looks justified given its higher revenue and earnings growth potential. POWR Ratings While SNAP is rated “Strong Buy” in our proprietary POWR Ratings system, FB is rated “Buy”. Here’s how the four components of overall POWR Rating are graded for both FB and SNAP: FB holds a “B” for Trade Grade, Buy & Hold Grade, Peer Grade, and Industry Rank. It is currently ranked #10 out of 57 stocks in the Internet industry. SNAP has an “A” for Trade grade, Buy & Hold Grade and Peer Grade, and “B” for Industry Rank. In the 57-stock Internet industry, it is currently ranked #2. The Winner While FB’s popularity is significantly higher and business is way too bigger, SNAP’s higher growth and price momentum compared to FB makes it a better bet right now. Want More Great Investing Ideas? Do NOT Buy Stocks Before the Election! 7 “Safe-Haven” Dividend Stocks for Turbulent Times Chart of the Day- See Christian Tharp’s Stocks Ready to Breakout FB shares fell $2.56 (-0.99%) in after-hours trading Tuesday. Year-to-date, FB has gained 26.02%, versus a 5.55% rise in the benchmark S&P 500 index during the same period."}]}