{"article": [{"url": "https://stocknews.com/news/crm-wday-now-splk-4-saas-stocks-soaring-after-earnings/", "published": 1598875700.0, "headline": "4 SaaS Stocks Soaring After Earnings", "body": "Software-as-a-service (SaaS) companies are mainly focused on helping businesses build a cloud ecosystem. This is integral for a remote work environment. With the onset of the coronavirus pandemic, these stocks have been the biggest outperformers.due to a huge surge in demand and an increase in recurring revenue. The global SaaS industry has emerged as one of the winners of the pandemic and is expected to be valued at $158.20 billion by the end of 2020. According to Valuates Reports, the global SAAS industry is expected to witness a CAGR of 11.7% from 2020 through 2026, with projected market size of $307.30 billion by 2026. The world was trending to more people working and learning from home as the Internet flattened the world, however the coronavirus has accelerated this shift. 7 \"SAFE HAVEN\" Dividend Stocks for Turbulent TimesSaaS stocks such as salesforce.com, Inc. (CRM), ServiceNow, Inc. (NOW), Workday, Inc. (WDAY), and Splunk, Inc. (SPLK) have gained significantly since the market crash in March and are trending even higher since their last earnings report. salesforce.com, Inc. (CRM) CRM provides enterprise cloud computing services for customer relationship management across the world. Its cloud services include Sales Cloud, Services cloud. Marketing Cloud and Commerce Cloud. It also provides the Customer 360 platform, MuleSoft Anypoint platform, Quip collaboration platform, and Tableau and Einstein analytics. CRM’s performance throughout the first half of 2020 is praiseworthy, despite the challenges imposed by the pandemic. On August 3rd, CRM was positioned as a leader by Gartner, Inc. (IT) in its 2020 magic Quadrants. As a result, S&P Dow Jones has announced that it would include CRM in the Dow Jones Industrial Average Index effective August 31st, 2020. CRM’s impressive fiscal second quarter (ended July 2020) results helped the stocks gain more than 24% since the report date. CRM’s net revenue increased 29% year-over-year to $5.15 billion in the quarter. The remaining performance obligation of $30.60 billion increased by 21% from the year-ago value. Income from operations increased by 206.8% from the same period last year to $178 million. Gross profit rose 26.7% year-over-year to $3.84 billion, while net income improved 278.4% from the year-ago value to $2.62 billion. The consensus revenue estimate of $5.23 billion for the fiscal third-quarter ending October 2020 indicates a 16% improvement year-over-year. Though the consensus EPS estimate indicates no change from the year-ago value, CRM beat the street estimates in each of the trailing four quarters, which is impressive. CRM hit its 52-week low of $115.28 in March due to the pandemic driven market crash. The stock gained more than 140% since then, hitting its 52-week high of $278.28 in August. How does CRM stack up for the POWR Ratings? A for Trade Grade A for Buy & Hold Grade A for Peer Grade B for Industry Rank A for Overall POWR Rating. You can’t ask for better. It is also ranked #1 out of 47 in the Software – Business industry. ServiceNow, Inc. (NOW) NOW provides enterprise cloud computing services which defines, structures, manages, consolidates, and automates services for various companies across the world. Its IT service management applications automates workflow within departments through NOW platform, IT service management product suite, IT operations management product, IT infrastructure, IT asset, and business management products. NOW has been named a leader in IT risk management and Vendor risk management in the 2020 Gartner magic quadrant. NOW gained more than 10% since the announcement of its quarterly results on July 30th, and hit its 52-week high of $494.00 in August. The stock gained more than 105% since hitting its year-to-date low of $238.93 in March. NOW’s revenues grew 28% year-over-year to $1.07 billion in the second quarter ended June 2020. Total customers having an annual contract value (ACV) of $1 million or more increased 26% from the year-ago value to 964. Gross profit increased 31.8% from the same period last year to $838 million. Net cash provided by operating activities increased by 51% year-over-year to $368 million. On July 30th, NOW announced its plans to build an exceptional partner ecosystem by evolving its go-to-market functions for deeper customer success and engagement. This is expected to bolster NOW’s revenue growth to more than $10 billion in the long term. NOW expects subscription revenues to be in the range of $1.05-$1.06 billion for the third quarter ending September 2020, indicating a 26-27% growth year-over-year. The consensus earnings estimate of $1.03 for the ongoing quarter indicates a slight improvement from the year-ago value. Also, NOW has an impressive earnings surprise history, as it beat the street EPS estimates in each of the trailing four quarters. NOW’s strong fundamentals and high growth momentum is reflected in its POWR Ratings. It has a “Strong Buy” rating with an “A” in Trade Grade, Buy & Hold Grade and Peer Grade, and “B” in Industry Rank. In the 47-stock Software – Business industry, NOW is ranked #2. Workday, Inc. (WDAY) WDAY provides strategic enterprise cloud applications for managing business functions and optimizing financial and human capital resources internationally. Its Workday Financial Management Application helps companies develop ledger, accounts payable and receivable, cash, asset, revenue, and grants management. WDAY’s human capital management (HCM) manages workforce lifecycle and employee benefits administration. Its cloud application includes Skills Cloud, Business Planning Cloud, and Workday Prism Analytics. It has been named a Leader in Gartner Magic Quadrant for cloud core financial management for four years in a row, based on its completeness of vision and ability to execute. WDAY introduced Workday People Experience to its HCM cloud application for a comprehensive HR service delivery application. It recently integrated with the North American Health Operating System ‘League’ to increase the efficiency and accuracy of its employee benefits enrollment program. WDAY expanded its operations in Mexico, which had a growing community of 3200 customers on June 16th. It recently partnered with Salesforce.com and International Business Machines Corporation (IBM) to ensure the safe reopening of offices around the country. This partnership aims to curb the spread of coronavirus among employees through a safe and workplace environment. WDAY also partnered with Microsoft Corporation (MSFT) to develop efficient enterprise planning in the cloud and provide business solutions to customers. Owing to such expansionary policies, WDAY’s revenues increased 19.6% year-over-year to $1.06 billion in the second fiscal quarter ended July 2020. Subscription revenue rose 23.1% from the same period last year to $931.70 million. Cash and cash equivalents balance increased 100% from the year-ago value to $1.24 billion. WDAY’s shares soared more than 10% since reporting such impressive earnings on August 27th. WDAY estimates its subscription revenues to be in the range of $948-$950 million for the third fiscal quarter ending October 2020. The consensus EPS estimate of $0.66 for the ongoing quarter indicates a 24.5% increase year-over-year. Also, WDAY surpassed the street EPS estimates in three out of trailing four quarters, which bodes well for the stock. WDAY gained more than 130% since hitting its 52-week low of $107.75 in March. The stock hit its 52-week high of $248.75 in August. WDAY is rated a “Strong Buy” under our POWR Ratings system consistent with the strength of the SAAS industry. It has an “A” in Trade Grade, Buy & Hold Grade, Peer Grade, and Industry Rank. Out of 92 stocks in the Software – Application industry, it is ranked #5. Splunk, Inc. (SPLK) SPLK is a developer and marketer of software solutions for real-time operational intelligence to enterprises across the world. Its key products include Splunk Enterprise, Splunk Cloud, Splunk Enterprise Security, SignalFx, Splunk IT Service Intelligence, and Splunk Phantom. SPLK was ranked #1 for market share and market revenue in IDC’s Worldwide IT Operations Management Software market Shares. With the rising demand for cloud services due to structural changes brought by COVID-19, SPLK reported one of its most profitable quarters. Cloud annual recurring revenue (ARR) rose 89% year-over-year to $568 million in the fiscal second quarter ended July 2020. Cloud revenue rose 79% from the same period last year to $126 million. Total ARR increased 50% from the year-ago value to $1.93 billion. The stock gained more than 7% since reporting its fiscal second-quarter results on August 26th. SPLK expects to generate revenues in the range of $600 and $630 million in the third fiscal quarter ending October 2020. Its EPS is expected to grow at 9.7% per annum in the next five years. SPLK gained more than 135% since hitting its 52-week low of $93.92 in March. The stock hit its 52-week high of $223.33 in August. It’s no surprise the SPLK is rated a “Strong Buy” in our POWR Ratings system. It has an “A” for Trade Grade, Buy & Hold Grade and Industry Rank, and “B” for Peer Grade. It is also ranked #7 out of 92 in the Software – Application industry. Want More Great Investing Ideas? 7 Best ETFs for the NEXT Bull Market Why Stocks Could Drop 20% in September? 9 “BUY THE DIP” Growth Stocks for 2020 CRM shares fell $0.67 (-0.25%) in after-hours trading Monday. Year-to-date, CRM has gained 67.64%, versus a 9.65% rise in the benchmark S&P 500 index during the same period."}]}