{"article": [{"url": "https://stocknews.com/news/msft-ctrx-txn-3-strong-buy-tech-stocks-to-watch-into-earnings/", "published": 1595333300.0, "headline": "3 STRONG BUY Tech Stocks to Watch Into Earnings", "body": "Entering earnings season, the S&P 500 was trading in a sideways range between 3,000 and 3,200. Over the past couple of days, the index has broken out of the top-end of the range. Many skeptics believe the breakout is a trap that will lead to a brutal reversal. Others see it as the beginning of a trending move that will challenge the previous, all-time highs set in February before the coronavirus crisis. This earnings season will be a major factor in deciding the fate of this breakout. It’s either going to validate the market’s optimism or show that fundamentals are inconsistent with the bullish price action. 9 \"BUY THE DIP\" Growth Stocks For 2020The most anticipated earnings will be for tech stocks as this sector is responsible for much of the market’s recent gains. While the S&P 500 is 4% below its all-time high, the Nasdaq is 10% above its previous high. Given the uncertainty around earnings, multiples have significantly expanded, so expectations will be higher. If earnings and guidance disappoint, it would likely lead to investors taking profits in these stocks which would lead to a correction for the broader market. On the other hand, if earnings are strong, it could add fuel to the breakout. Our POWR Ratings system is designed to help you find the strongest stocks in the market. Here are three, technology stocks which are rated a “Strong Buy” that are worth watching this earnings season: Microsoft (MSFT) MSFT is the second-largest company in the US with a $1.6 trillion market cap. It accounts for 9.7% of the Nasdaq Composite and nearly 6% of the S&P 500. The company will release its next earnings report tomorrow, July 22nd after the market close. Its last earnings report in April was better than expected as the company had a 15% increase in sales and minimal impact from the coronavirus. Due to the increase in remote work, there was an increase in demand for its cloud services and enterprise products. However, investors will be closely watching this quarter to see if economic weakness leads to decreased corporate spending. Bulls would argue that cloud spending is in a secular growth cycle, so it’s immune to economic fluctuations. The POWR Ratings for MSFT are also constructive as it has a Strong Buy rating. It has an “A” for Trade Grade, Buy & Hold Grade, Peer Grade, and Industry Rank. Among Software – Application stocks, it’s ranked #1 out of 82. Citrix Systems (CTXS) CTXS is a big winner from the increased shift to remote work as it provides server, application, and desktop virtualization software. In recent days, it’s stock has broken out of a three-month consolidation to new all-time highs. The company will release its next earnings report Thursday, July 23rd after the market close. (source:finviz.com) The company is reasonably priced with a price to earnings ratio of 27, sales growth of 19%, and 85% gross margins. It also expects to grow earnings by 10% next year. It fits all the criteria of a growth stock but also is only slightly more valued than the average stock in the S&P 500 albeit with significantly higher margins. In its last report, CTXS beat estimates and raised guidance due to increased demand for its virtualization and network access software that enables remote work while maintaining security. Revenues were 20% higher, and earnings were 65% higher on a year over year basis. CTXS’s POWR Ratings are also strong with a Strong Buy rating. It has an “A” for Trade Grade, Buy & Hold Grade, and Peer Grade with a “B” in Industry Rank. Among the Software – Business sector, it’s ranked #3 out of 47. Texas Instruments (TXN) The same trends driving increased spending for cloud computing is also leading to increased demand for semiconductors. Therefore, TXN is also breaking out to all-time highs ahead of its earnings report that is scheduled for today, July 21st, after the close. On a six-month, daily chart, TXN is breaking out to new highs following a one-month consolidation between $120 and $135. (Source: finviz.com) And on the three-year, weekly chart, TXN is breaking out from a range between $90 and $130. (Source: finviz.com) TXN’s earnings report will play a large part in determining whether this breakout will hold or if the stock will fall back into its range. The POWR Ratings are consistent with the stock’s strong fundamentals and price action as it has a Strong Buy rating. It has an “A” in all of its POWR components and is ranked #5 out of 86 in the Semiconductor – Wireless Chips group. Want More Great Investing Ideas? 9 “BUY THE DIP” Growth Stocks for 2020 Newly REVISED 2020 Stock Market Outlook 7 “Safe-Haven” Dividend Stocks for Turbulent Times MSFT shares were trading at $209.05 per share on Tuesday afternoon, down $2.55 (-1.21%). Year-to-date, MSFT has gained 33.29%, versus a 2.22% rise in the benchmark S&P 500 index during the same period."}]}