{"article": [{"url": "https://stocknews.com/news/aaxn-spwh-vsto-3-under-the-radar-gun-stocks/", "published": 1595506100.0, "headline": "3 \"Under the Radar\" Gun Stocks", "body": "The recent economic stress and political tensions have been good for gun sales. According to the FBI, gun background checks hit a record high in June. If Democrats win back the Presidential office and/or take control of the Senate, it could also lead to another surge in gun purchases as well. Additionally, sports like hunting are seeing an increase in popularity, as it’s one of the few activities that can continue like before in the social distancing era. Due to these factors, gun stocks should continue seeing gains for the rest of the year. Here are three under the radar gun stocks you should consider: 9 \"BUY THE DIP\" Growth Stocks For 2020Sportsman’s Warehouse Holdings, Inc. (SPWH) One driver of SWPH’s recent gains is that many retailers like Walmart (WMT) and Dick’s (DKS) have stopped selling guns. This is proving to be an opportunity for SPWH. SPWH is a Utah-based outdoor specialty sports goods retailer that provides a wide range of outdoor products for first-timers as well as seasoned experts. SPWH in collaboration with Weatherby and MeatEater launched the new limited edition, premium quality Vanguard MeatEater Edition hunting rifles from Weatherby which possesses great affordability and accuracy. SPWH’s stock has gained more than 280% since the March lows that were triggered by the virus-led market crash. SPWH’s earnings surprise history looks impressive, with the company surpassing consensus EPS estimates in three of the trailing four quarters. The market expects the company to report EPS of $0.27 for the quarter ended July, indicating more than 100% improvement over the year-ago number. In the first quarter ended May 2nd, 2020, net sales increased 41.8% and same-store sales increased 28.6% year over year. This was largely due to higher demand for ammunition and firearms as well as its growing e-commerce business. How does SPWH stack up for the POWR Ratings? A for Trade Grade A for Buy & Hold Grade A for Peer Grade B for Industry Rank A for Overall POWR Rating You can’t ask for better. The stock is also ranked #9 out of 32 stocks in the Athletics & Recreation industry. Axon Enterprise, Inc. (AAXN) AAXN, which was formerly known as Taser International, develops, manufactures, and sells conducted energy weapons (CEWs) worldwide. The company operates through two segments — TASER and Software and Sensors. Anti-lockdown protests as well as protests against police brutality and racism in the US will lead to more law enforcement agencies using Axon’s products like body cameras, sensors, and docking systems. A long-term catalyst for the stock will be police departments upgrading their IT systems. This is a massive opportunity as many departments use antiquated systems. As Axon’s platform becomes more popular, it will incentivize other departments to switch. AAXN recently announced that the Baltimore police department has been using Axon Records Management Solution since the start of the second quarter this year. This platform will help lead to increased efficiencies and improve operations. The company’s diverse product pipeline and the absence of long-term debts make AAXN stock an attractive investment option. Additionally, it’s a high-margin business with recurring revenue which the market is rewarding with hgih multiples. In the first quarter this year, AAXN recorded a 27% year-over-year increase in revenue. Also, the company ended the quarter with cash and cash equivalents and investments of $395 million and no debt. Since its March lows, the stock has risen close to 56%. The earnings surprise history for AAXN looks pretty good, as the company beat the consensus EPS estimates in three of the trailing four quarters. The market also expects the company to report EPS of $0.16 for the quarter ended June, which indicates a 14.3% increase over the year-ago number. Moreover, AAXN’s consensus revenue estimate of $133.36 million indicates a year-over-year increase of 18.7%. Our POWR Ratings system rates AAXN as a Buy. It has an A for Peer Grade and B for Trade Grade. In the Air/Defense Services industry, it’s ranked #6 out of 65 stocks. Vista Outdoor Inc. (VSTO) VSTO is a global manufacturer and marketer of consumer products such as ammunition, hydration systems, cycling accessories, outdoor products, and action sports helmets. VSTO mainly operates in two segments – Shooting sports and Outdoor products. VSTO’s Speer Ammunition brand was recently awarded a record $112 million contract with the Department of Homeland Security, U.S Customs and Border Protection for their 9mm Service Ammunition. Furthermore, another brand of VSTO, RCB announced that it had commenced the shipping of five new product kits with reduced costs that would simplify the requirements of novice and professional reloaders. The stock has been rising since hitting its 52-week low of $4.29 on March 12th and is currently trading at a 270% higher price. VSTO’s earnings surprise history is impressive with the company beating consensus EPS estimates in three of the trailing four quarters. VSTO’s EPS is expected to grow 25% per annum in the next five years. Shareholder yield, a measure of how much is returned to shareholders via dividends and share repurchases, for VSTO comes in at 21.37%, higher than that of 89.5% of stocks in the stockNews.com universe. It’s no surprise that VSTO is rated “Strong Buy” in our POWR Ratings system. It also has an “A” for Trade Grade, Buy & Hold Grade, and a “B” for Industry Rank. In the 32-stock Athletics & Recreation industry, it is ranked #8. Want More Great Investing Ideas? 9 “BUY THE DIP” Growth Stocks for 2020 Newly REVISED 2020 Stock Market Outlook 7 “Safe-Haven” Dividend Stocks for Turbulent Times AAXN shares were unchanged in after-hours trading Thursday. Year-to-date, AAXN has gained 19.45%, versus a 1.38% rise in the benchmark S&P 500 index during the same period."}]}