{"article": [{"url": "https://stocknews.com/news/brk-a-is-berkshire-hathaway-a-buy-sell-or-hold", "published": 1598011700.0, "headline": "Is Berkshire Hathaway a Buy, Sell or Hold?", "body": "Berkshire Hathaway (BRK.A) is a holding company that owns subsidiaries across various sectors that include property & casualty insurance and reinsurance, energy and utilities, manufacturing, finance, and many others. This Warren Buffett owned company has been able to create massive wealth for investors over the last five and a half decades. According to the company’s 2019 annual report, Berkshire Hathaway stock has generated cumulative returns of a staggering 2,744,062% between 1965 and 2019, indicating a compounded annual growth rate of 20.3%. Comparatively, the S&P 500 is up 19,784% or 10% annually in this period. This means a $1,000 investment in Berkshire Hathaway stock back in 1965 would have been worth $27.4 million at the end of 2019, while the same investment in S&P 500 would have ballooned to less than $200,000. 9 \"BUY THE DIP\" Growth Stocks For 2020However, the current year has not been as kind to Berkshire Hathaway stock. The S&P 500 Index has gained momentum after bottoming out in March 2020 and has reclaimed its record highs. The index is up 5.1% year-to-date compared to Berkshire’s returns of a negative 8.9%. But the most important question right now for investors is to identify if Berkshire Hathaway is a good stock to buy right now? Berkshire’s business model has been successful Over the years Berkshire Hathaway has acquired dozens of companies. While there have been a few misses, the successful companies have helped Berkshire offset losses in poor and stagnant businesses. For example, Berkshire’s successful investments were firms that grew revenue and profit margins at a steady rate, finding opportunities to reinvest additional capital into growth and expansion. These assets gradually became an expanding portion of Berkshire’s total capital. In the last decade, Berkshire’s depreciation charges were $65 billion while its internal investments in property, plant, and equipment totaled $121 billion. Warren Buffett maintains that reinvestment in productive operational assets remains the company’s top priority. While evaluating an investment, Berkshire has three criteria. The target firm should earn good returns on net tangible capital required in its operation. It must be run by a stellar leadership team and the companies must be available at a reasonable valuation. Berkshire believes the fickle nature of the stock market provides opportunities to buy large, non-controlling positions in publicly-traded companies. Property/Casualty insurance is Berkshire’s cash cow Berkshire’s property/casualty (P/C) insurance business has been the primary driver of Berkshire’s growth in the last five decades. It acquired National Indemnity as well as its sister company, National Fire & Marine, in 1967 for $8.6 million. Today, National Indemnity is the largest P/C company in the world when comparing net worth. Berkshire continues to benefit from this industry’s collect-now, pay-later business model which means P/C companies hold large sums of money called floats. Insurers can invest this money and generate additional capital to pay off any claims. The amount of float for Berkshire’s P/C business has increased from $39 million in 1970 to $65.8 billion in 2010 and $129.4 billion in 2019. While the company might experience a decline in float it will be very gradual and no more than 3% in any year, according to estimates. The nature of insurance contracts is such that Berkshire will not be subject to any near-term demands for sums that have the potential to derail its cash resources. In case premiums exceed the total of expenses and losses, Berkshire’s insurance operation registers an underwriting profit that adds to its investment income. Berkshire has been able to operate at an underwriting profit for 16 of the last 17 years. In the last 17 years, its pre-tax gain in this business stood at $27.5 billion with $400 million recognized in 2019. Berkshire Hathaway Energy Berkshire entered the utility business in 2000 after acquiring 76% of BHE and this figure has now increased to 91%. While BHE is a utility company, it has never paid Berkshire Hathaway a dividend and instead retained $28 billion of earnings. This is an anomaly when it comes to utility companies where firms pay attractive dividends with payout ratios north of 80%, which means BHE continues to reinvest in growth and expansion. In July 2020, Berkshire Hathaway Energy disclosed it will acquire Dominion Energy’s natural gas transmission and storage business. These assets include 7,700 miles of natural gas transmission lines with 20.8 billion cubic feet per day of transportation capacity and “900 billion cubic feet of operated natural gas storage with 364 billion cubic feet of company-owned working storage capacity, and partial ownership of a liquefied natural gas export, import and storage facility.” The acquisition is valued at an enterprise value of $9.7 billion. This transaction will mean Berkshire Hathaway Energy is now one of the country’s largest natural gas transporters and will carry about 18% of transmission volumes in the U.S. Berkshire Hathaway Energy has over $100 billion in assets that will generate robust cash flows in the upcoming decade. Investments As seen earlier Berkshire also owns a minority stake in several publicly listed companies. The company owns $240 billion in North American equities. Berkshire’s top three holdings include a $118 billion stake in Apple, followed by $25 billion in Bank of America and $18 billion in Coca-Cola. Warren Buffett emphasized that its investment portfolio is not a collection of stock market wagers that are impacted by analyst downgrades, earnings miss, economic forecasts, and other uncertainties. In fact, the Oracle of Omaha sees his portfolio as an assembly of companies that earn more than 20% on the net tangible equity capital required to run their businesses. These companies earn profits without employing excessive debt and have strong fundamentals. The verdict Berkshire Hathaway has deployed capital in a wide variety of wholly or partly owned businesses that have managed to earn attractive returns by effective use of capital. The company’s positioning of its controlled businesses within a single entity ensures a high degree of economic advantage. Berkshire Hathaway ended Q2 with $146 billion in cash, up from just $128 billion at the end of 2019. This means it was a net seller of equities at a time when markets fell over 36% in a single month. Warren Buffett exited the aviation sector and dumped stocks of major U.S. airlines this April. However, Berkshire bought back $5.1 billion of its own stock in Q2. This means according to Buffett; Berkshire shares are undervalued which led to the company’s biggest ever share-purchase. Berkshire Hathaway stock has a market cap of $493 billion which means its forward price to sales multiple is 2.7x. The stock is trading at a forward price to earnings multiple of 22.4 which is very reasonable. Despite a 6% estimated drop in earnings in 2020, analysts expect earnings to grow at an annual rate of 23.3% in the next five years. The StockNews.com POWR Ratings system has BRK.A rated as a “Buy.” It receives “A” in Trade Grade, Peer Grade, and Industry Rank. And out of the 59 companies in the Insurance – Property & Casualty category, it’s ranked #4. Berkshire Hathaway stock remains a top bet especially considering its recent decline. Further, when you buy the company’s stock, you basically bet on Warren Buffett, who is arguably the most successful investor in modern history. Want More Great Investing Ideas? The Best of StockNews 2 Step Process to Sell @ Market Top in September 9 “BUY THE DIP” Growth Stocks for 2020 BRK.A shares were trading at $311,135.00 per share on Friday afternoon, up $1.00 (+0.59%). Year-to-date, BRK.A has declined -8.38%, versus a 6.52% rise in the benchmark S&P 500 index during the same period."}]}