{"article": [{"url": "https://stocknews.com/news/adp-expect-a-breakdown-in-automatic-data-processing-adp-if-this/", "published": 1599826100.0, "headline": "Expect a BREAKDOWN in Automatic Data Processing (ADP) if This Happens", "body": "In looking at the chart, I believe Automatic Data Processing (ADP) is headed for a strong move lower, if it breaks this level. ADP is one of the top providers of cloud-based human resources administration. The company’s solutions include payroll, talent management, and benefits administration. ADP has a strong business model with high recurring revenues, robust client retention, and low capital expenditures. Take a look at the 1-year chart of ADP below with my added notations: 7 \"SAFE HAVEN\" Dividend Stocks for Turbulent Times Chart of ADP provided by TradingView Over the past several months, a support level has formed in ADP at $130 (green). That line is also the “neckline” for the stock’s head and shoulders reversal pattern. Above the neckline you can see the head and shoulder pattern itself (red) has almost been completed. Confirmation of the pattern would occur if ADP were to break the support, and lower prices would be expected from there. A head and shoulders pattern is a bearish setup. Therefore, a short trade could be entered on a break below the $130 level. Want to Discover More Great Trades? I have explored virtually every flavor of technical analysis and chart pattern known to mankind. The sad fact is that the vast majority of them don’t work at all. That is why I recently put together this special report to help investors focus on the only 5 chart patterns that matter…the ones that lead to the most timely and profitable stock trades. Click below to get your copy now! 5 WINNING Stock Chart Patterns Have a good trading day! Good luck! Christian Tharp, CMT Follow me on Twitter: @cmtstockcoach ADP shares were trading at $132.69 per share on Friday morning, up $0.79 (+0.60%). Year-to-date, ADP has declined -20.71%, versus a 5.44% rise in the benchmark S&P 500 index during the same period."}]}