{"article": [{"url": "https://stocknews.com/news/ino-pfe-cprx-the-3-most-popular-pharmaceutical-stocks-on-the-robinhood-100/", "published": 1594901300.0, "headline": "The 3 Most Popular Pharmaceutical Stocks on the Robinhood 100", "body": "In recent months, there’s been tremendous interest and excitement around pharmaceutical stocks due to the potential for a COVID-19 vaccine. However, the longer-term fundamentals of the sector are positive as well given the aging population in the developing world. Due to this, spending on drugs and treatments is increasing every year which creates a huge, potential market for pharmaceutical companies. The companies in the sector are also benefiting from breakthroughs that have significantly lowered the cost of developing new drugs and increased their chances of success. 9 \"BUY THE DIP\" Growth Stocks For 2020Here are the three most popular pharmaceutical stocks on the Robinhood 100: Inovio Pharmaceuticals (INO) INO has been one of the frontrunners in the race to find a Covid-19 vaccine. INO is planning to go ahead with phase 2/3 for its COVID-19 DNA vaccine candidate INO-4800 after reporting positive early trial results in which 94% of participants generated an immune response in six weeks after receiving two doses. INO also reported positive results when they tested the vaccine in animals. However, INO did not mention the number of participants that generated neutralizing antibodies which concerned a few investors. The company still plans to carry on with the next phase in the summer. INO is a part of Operation Warp Speed and signed a $71 million contract with the US Department of Defense to increase its manufacturing capabilities. Its encouraging early trial results and $71 million deal in June caused the stock to soar and hit a 52-week high of $33.79 in late-June. INO also has other candidates in its pipeline such as VGX-3100 for precancerous cervical dysplasia and INO-5401 for glioblastoma multiforme. The stock has a grade of “A” in Industry Rank and a grade of “B” in Peer Grade according to the POWR Ratings. Pfizer, Inc. (PFE) PFE is working in collaboration with BioNTech (BNTX) to develop a vaccine for the coronavirus. They both recently announced that two out of the four vaccine candidates under the BNT162 Mrna-based vaccine program were granted Fast Track designation from the FDA based on preliminary data on the current phase 1/2 and animal immunogenicity studies. Two of the vaccine candidates are currently undergoing phase 1/2 clinical studies in Germany and the United States. The companies plan to start phase 2b/3 later this month contingent on regulatory approval. If the trials are successful, they will be able to manufacture up to 100 million doses by the end of 2020 and more than 1.2 billion doses by the end of next year. Since hitting its 52-week low of $27.88 in March, PFE has gained more than 27%. PFE has an impressive earnings surprise history with the company beating consensus EPS estimate in three out of the trailing four quarters. PFE has a “B” grade in Industry Rank and Peer Grade according to the POWR Ratings. Catalyst Pharmaceuticals Inc. (CPRX) CPRX focuses on the development of drugs for neurological and neuromuscular diseases. The company had filed a new drug application for Firdapse, which will be used for the treatment of Lambert-Eaton myasthenic syndrome (LEMS). This was approved by the FDA in November 2018. In the first quarter this year, 46 new LEMS patients were prescribed Firdapse. CPRX expects top-line results from the phase 3 trial for MuSK-MG and SMA Type 3 proof of concept trial to be reported by the end of the year. Moreover, it expects approval of New Drug Submission (NDS) for Firdapse in the second half of 2020. CPRX has gained close to 100% since hitting its 52-week low of $2.55 in March. CPRX has an impressive earnings surprise history with the company beating consensus EPS estimates in three of the trailing four quarters. The revenue estimate of $29.48 million for the current quarter indicates an increase of 59.4% over the year-ago quarter. In the first quarter, net product revenue increased 134% year over year and net income was $10.4 million as compared to net loss of $645,000 a year ago. CPRX ended the first quarter with $101.8 million in cash and no funded debt which shows its financial flexibility. According to the POWR Ratings, the CPRX has a grade of “B” in Industry Rank and Peer Grade. Want More Great Investing Ideas? 9 “BUY THE DIP” Growth Stocks for 2020 Newly REVISED 2020 Stock Market Outlook 7 “Safe-Haven” Dividend Stocks for Turbulent Times INO shares . Year-to-date, INO has gained 644.55%, versus a 0.69% rise in the benchmark S&P 500 index during the same period."}]}