{"article": [{"url": "https://stocknews.com/news/acb-why-did-aurora-cannabis-fall-another-5-yesterday/", "published": 1601381300.0, "headline": "Why Did Aurora Cannabis Fall Another 5% Yesterday?", "body": "Aurora Cannabis (ACB) announced on Monday that billionaire hedge fund manager Nelson Peltz would be resigning as their strategic advisor. This ends an 18-month collaboration between Peltz and the company. Shares of ACB fell 5.3% for the day. In March 2019, ACB granted Nelson Peltz options to purchase 19,961,754 common shares of the stock at a price of $10.34 per share. If Peltz exercised the options, then he would have become the second-largest shareholder in the company after fund giant The Vanguard Group. Peltz is the CEO and founding partner of New York-based Trian Fund Management LP. He has strong ties to PepsiCo (PEP) and Mondelez International (MDLZ), and was expected to bring ACB a deal similar to the one between Canopy Growth Corporation and Constellation Brands (STZ). Now that Peltz is no longer a strategic advisor ACB, the company will have to solely rely on their new CEO to make a deal of similar magnitude. 7 \"SAFE HAVEN\" Dividend Stocks for Turbulent TimesThis news comes just a week after ACB sank to a 52-week lows after posting a $1.8 billion dollar loss (its largest loss in its history) and forecasting a drop in revenues for next quarter. Over the past few months ACB has been making a number of changes throughout the company including management changes, selling facilities and reducing expenses, writing down goodwill, and even altering their product strategy. Their new CEO, Miguel Martin, has many years of experience in the consumer-packaged goods industry. He recently announced a new strategy that would put an emphasis on premium cannabis products that carry higher margins to grow revenues in the coming quarters. ACB is at a crucial point in their business and their future is uncertain. I continue to suggest cannabis investors proceed with caution when it comes to investing in this company. (Disclosure: The author is Long ACB) Want More Great Investing Ideas? 7 “Safe-Haven” Dividend Stocks for Turbulent Times When Does the Next Bull Run Start? Chart of the Day- See the Stocks Ready to Breakout ACB shares were trading at $4.93 per share on Tuesday morning, up $0.15 (+3.14%). Year-to-date, ACB has declined -80.98%, versus a 4.64% rise in the benchmark S&P 500 index during the same period."}]}