{"article": [{"url": "https://stocknews.com/news/aapl-amzn-fb-goog-ixic-a-breakup-in-the-tech-sector-could-lead-to-even/", "published": 1597147700.0, "headline": "A Breakup in the Tech Sector Could Lead to Even Higher Valuations", "body": "Testimony before Congress exposes the US government’s concerns The administration agrees that big tech is too big and powerful Apple, Alphabet, Facebook, and Google shareholders could experience a windfall if the parts are worth more than the whole A trillion dollars is not what it used to be! The tech sector of the stock market has been a bullish beast over the past few months. After falling to a low of 6,631.42 on March 23 as the global pandemic caused risk-off price action in markets across all asset classes, the tech-heavy NASDAQ came storming back. The previous all-time high in the benchmark for technology stocks came in mid-February at 9,838.37. It took a little over two months for the NASDAQ to make back all of its losses, as it rose to a new record level on June 5. Tech stocks did not stop there as they kept on moving higher, surpassing the 10,000 level on June 9, and reaching the latest high of over 11,000 last week. The pandemic that caused social distancing and forced many people to work at home has been a game-changer for many businesses. Technology is the big winner as it allows for communications, provides entertainment, and has a myriad of applications for individuals. The leading technology companies have seen their fortunes, market caps, and profits rise. Apple’s (AAPL) market cap was moving towards the $2 trillion level at the end of last week. Many politicians are now worried that technology companies have become too big and too powerful. The number of antitrust suits could rise dramatically in the coming months and years, leading to a breakup of some of the top companies. I believe that any breakup of companies like Apple, Amazon (AMZN), Facebook (FB), and Alphabet (GOOG), along with some of the other industry leaders, could create even more value for shareholders and make the founders and CEOs an even bigger windfall over the coming months and years. The companies’ parts could be worth more than the whole in the current market conditions where the central banks are flooding the financial system with unprecedented levels of liquidity. 7 Best ETFs for the NEXT Bull MarketTestimony Before Congress Exposes the US Government’s Concerns In late July, a group of tech billionaires that run the leading tech companies appeared before the US Congress to answer wide-ranging questions about their businesses and their influence because of the size of their balance sheets. In the aftermath of the inquiry, second quarter earnings were a testament to their power. The second-quarter of 2020 was a period where many publicly traded companies in the U.S. got a pass because of the impact of the global pandemic on their earnings. However, the tech sector continued to thrive. The grilling in Congress included questions on privacy, working with China, and antitrust issues when it comes to competition. In what is almost unheard of these days, criticisms came from both sides of the political aisle. In 2008, the mantra became “too big to fail” for financial institutions. In 2020, many legislators believe that the tech leaders are too big to compete fairly. As of the end of last week, AAPL’s market cap was at $1.90 trillion. Apple’s CEO, Tim Cook, was the star performer before Congress, but he did not avoid questions about unfair competition. AMZN’s Jeff Bezos appeared before Congress for the first time. AMZN’s market cap stood at $1.587 trillion on August 7. Bezos was a particular target because he is the world’s richest person and owns The Washington Post, an influential newspaper. GOOG’s CEO Sundar Pichai fielded questions on his company’s activities in China and its resistance to cooperation with the US military. GOOG’s market cap stood at just over the $1 trillion level on August 7. Finally, the most contentious CEO, FB’s Mark Zuckerberg, received a Congressional peppering on privacy and antitrust issues. FB’s market cap stood at around $765 billion at the end of last week. FB has been in the legislator’s crosshairs for quite some time. The takeaway from the hearing was that there is a bipartisan agreement that the four company’s worth almost $5.5 trillion have too much power. They have too much information and far too much control because of their size and resources. The Administration Agrees That Big Tech is Too Big and Powerful President Trump and his administration seem to agree with the other branch of the US government. The President threatened to use an executive order if Congress does not “bring fairness” to the tech industry. The President tweeted: “In Washington, it has been ALL TALK and NO ACTION for years, and the people of our Country are sick and tired of it!” Source: Twitter The President seems to have a cordial relationship with Apple’s Tim Cook and Facebook’s Mark Zuckerberg. However, Jeff Bezos is another story as the Washington Post has been highly critical of the Trump Administration. Meanwhile, the atmosphere of bipartisan support about the size of the technology leaders and the progressive wing of Democrat’s vilification of billionaires is a sign that changes are on the horizon for the four top companies. Apple, Alphabet, Facebook, and Google Shareholders Could Experience a Windfall if the Parts are Worth More Than the Whole When it comes to antitrust issues, the courts are the ultimate arbiters of allegations and charges. The Congressional hearing and comments by the President are a sign that the political will in the US believes that the leading technology companies have become too big to foster fair competition. A CEO’s job is to maximize shareholder value. The leaders of AAPL, AMZN, GOOG, and FB have to walk a fine line between enhancing earnings while remaining on the right side of the law on antitrust issues. Meanwhile, a breakup of the leading companies could be a mixed blessing for the CEOs and shareholders. It is possible that separating business segments into independent companies could only increase the valuation of the businesses. In the current environment, where capital continues to flow into technology, we could see the parts worth even more than the whole for the four companies. The CEOs who hold significant ownership in their respective companies could become even wealthier if the US government’s judicial, legislative, and executive branches decide that they are too big. The bottom line is that one of the most significant events of the global pandemic has been the rise of technology. Social distancing, working at home, and the decline of retail businesses have created an almost perfect bullish storm for technology companies. Source: Barchart The long-term chart of the tech-heavy NASDAQ index highlights the strength of technology businesses. The debate over the leaders of the industry will continue and could intensify over the coming months. However, no matter what happens from a regulatory perspective, the shareholders and CEO’s of these companies are likely to see their wealth increase. The government also needs to walk a fine line as any actions could serve only to increase the wealth and power. Higher levels of taxation in coordination with regulation are tools the US may use to control the high-flying sector and its leadership. Want More Great Investing Ideas? 3 Possible Directions for the Stock Market from Here How to Trade THIS Stock Bubble? 9 “BUY THE DIP” Growth Stocks for 2020 AAPL shares fell $3.05 (-0.68%) in premarket trading Tuesday. Year-to-date, AAPL has gained 53.26%, versus a 5.73% rise in the benchmark S&P 500 index during the same period."}]}