{"article": [{"url": "https://stocknews.com/news/xly-iyg-vbr-3-etfs-to-buy-as-market-rotation-out-of-tech/", "published": 1600344500.0, "headline": "3 ETFs to Buy as \"Market Rotation\" Out of Tech Stocks Begins", "body": "The United States plunged into recession in late February, as the country went into a virtual standstill following the onset of the coronavirus pandemic. Though the tech industry has thrived since then, other sectors were severely affected. However, as the economy is demonstrating signs of recovery in the second half of 2020, the tech industry experienced a massive sell-off, sparking fears of a market correction. With the recovering economy increasing employment and disposable income, several stocks are gaining traction. As a result, most economists and analysts are expecting a sector rotation, wherein consumer discretionary and financial services could primarily take the lead. A recovering economy is likely to see a surge in borrowing levels, given the Fed’s recent decision to keep interest rates low for years. An increase in sales of consumer discretionary products and higher financial transactions are expected. Also, most of the mega-cap stocks have become relatively expensive now, so focus could shift toward small-cap stocks that still have room for growth. ETFs such as the SPDR Select Sector Consumer Discretionary ETF (XLY), the iShares U.S. Financial Services ETF (IYG), and the Vanguard Small-Cap Value ETF (VBR) are likely to gain substantially in the upcoming months given their exposure to industries and stocks that are expected to thrive going forward. 9 \"BUY THE DIP\" Growth Stocks For 2020Consumer Discretionary Select SPDR ETF (XLY) XLY primarily invests in large cap consumer discretionary stocks. As the economy recovers from the pandemic-induced recession, consumer discretionary stocks stand to see revenue and earnings growth, with people spending more on goods they want. XLY’s top holdings include Amazon.com, Inc. (AMZN), Home Depot, Inc. (HD), and McDonald’s Corp (MCD), which make up 42.2% of the ETF’s assets. With $15.7 billion in assets, XLY closely tracks the Consumer Discretionary Select Sector Index. Its expense ratio of 0.13% is significantly lower than the category average of 0.46%. XLY has gained 18% year-to-date and 14.6% over the past three months. It currently pays an annual dividend of $1.53, which yields 1.03% based on its current price. XLY has gained more than 85% since hitting its 52-week low of $81.74 in March. The ETF hit its 52-week high of $154.14 in September. How does XLY stack up for the POWR Ratings? A for Trade Grade A for Buy & Hold Grade A for Industry Rank A for Overall POWR Rating. You can’t ask for better. It is also ranked #1 out of 42 ETFs in the Consumer-Focused ETFs group. iShares U.S. Financial Services ETF (IYG) IYG invests in major financial services companies across the United States. With historically low Fed interest rates, the recovering economy is expected to see a surge in loans and other borrowing activities primarily from small and medium sized businesses, leading to a rise in quarterly revenues for the financial services companies. IYG primarily focuses on the biggest players in this sector. Visa, Inc. (V), J.P. Morgan & Chase, Co. (JPM), and Mastercard, Inc. (MA) make up 34.6% of this ETF’s portfolio. With $1.8 billion AUM, this passively managed fund tracks the Dow Jones U.S. Financial Services Index. IYG’s expense ratio of 0.42% is significantly lower than the category average of 0.82%. The ETF has gained 28.8% over the past six months. IYG pays a dividend of $2.39 annually, which yields 1.91% based on its prevailing price. IYG has gained more than 45% since hitting its 52-week low of $86.42 in March. Under our POWR Ratings, IYG has been accorded a grade of “B” in Peer Grade. It is currently ranked #15 out of 38 ETFs in the Financial Equities ETFs. Vanguard Small-Cap Value ETF (VBR) As the name suggests, VBR invests in small cap firms with robust growth potential. Small cap companies have higher growth and expansion prospects than well-established firms who already enjoy a significant market share, albeit at higher risks. VBR’s portfolio diversity aims to diffuse that risk, as the ETF does not invest more than 1% of its total assets on one security. Its top holdings include Peloton Interactive, Inc. (PTON), IDEX Corp (IEX), and Perkin Elmer, Inc. (PKI). With $28.5 billion in assets under management, VBR closely follows the CRSP U.S. Small Cap Value Index. VBR has an expense ratio of 0.07% compared to its category average of 0.66%. The ETF has returned 36.6% to its investors over the past six months, with a 4.1% gain over the past three months. VBR currently pays an annual dividend of $2.39, which yields 2.09%, based on the prevailing price. Its dividend has grown at a CAGR of 9.7% over the past three years. VBR has gained more than 55% since hitting its 52-week low of $73.32 in March. VBR is rated a “Buy” in our POWR Ratings system, with a grade of “B” in Trade Grade and Peer grade. In the 19-ETF Small Cap Value ETFs group, VBR is ranked #1. Want More Great Investing Ideas? 7 Best ETFs for the NEXT Bull Market Stock Market Outlook: Before & After the Election Chart of the Day- See the Stocks Ready to Breakout XLY shares were trading at $145.55 per share on Thursday afternoon, down $2.45 (-1.66%). Year-to-date, XLY has gained 16.89%, versus a 4.98% rise in the benchmark S&P 500 index during the same period."}]}