{"article": [{"url": "https://stocknews.com/news/kgc-btg-svm-3-high-profit-mining-stocks-under-10/", "published": 1600862900.0, "headline": "3 High Profit Mining Stocks Under $10", "body": "The increasingly uncertain U.S. and global economic outlook with the emergence of the Covid-19 pandemic led to an increase in demand for gold and silver earlier this year. So far this year, the price of gold climbed from $1,520/oz to an all-time high of US$2,070 and the yellow metal is currently trading at around $1,870, with a year-to-date gain of 25%. Silver has performed even better and gained about 40% year-to-date. Though the tech-driven market rally has slightly shifted investors’ focus from these safe-haven assets, causing their prices to fall recently, there are a number of other factors that should help these precious metals soar in the upcoming months. While the volatile market is a short-term factor that could drive demand for gold and silver, there are several long-term drivers as well. The low interest rate environment around the world is one of the key factors that will keep driving investors’ demand for these non-yielding assets. Also, a weaker dollar, rising geopolitical tensions and a weak economy should keep the prices for these precious metals rising for the foreseeable future. 7 \"SAFE HAVEN\" Dividend Stocks for Turbulent TimesQuite naturally, stocks of companies that are involved in mining these precious metals should continue to climb. While most of the precious metal miners are already trading at high prices, there are still some affordable stocks worth betting on to benefit from this trend. Kinross Gold Corporation (KGC), B2Gold Corp (BTG) and Silvercorp Metals Inc. (SVM) are currently trading below $10 and could gain significantly from the soaring precious metal prices. Kinross Gold Corporation (KGC) Founded in 1972, KGC is a Canadian senior gold mining company with mines and projects in the United States, Brazil, Chile, Ghana, Mauritania, and Russia. Apart from the acquisition, exploration, and development of gold properties, the company is also involved in the extraction and processing of gold-containing ores; reclamation of gold mining properties; and production and sale of silver. The stock has gained about 94% so far this year to close yesterday’s trading session at $9.21. KGC recently announced a robust three-year production guidance, wherein the company expects its production to increase by 20% to 2.9 million gold equivalent ounces in 2023. While the company projects a steady increase in production, it expects an overall downward trend in the production cost of sales and capex, which is likely to boost its free cash flow. KGC also resumed its dividend payments after a pause for seven years. The company last paid dividends in March 2013. It recently declared a quarterly dividend of $0.03 per share, which translates into a yield of 1.3%. The reinstatement of its dividends indicates strength in its underlying business and ability to generate strong cash flows. KGC reported a strong second quarter with adjusted net earnings of $194.0 million, or $0.15 per share, which is more than double year-over-year. Operating cash flow of $432.8 million increased 30% year-over-year. The company entered into an agreement with the government of Mauritania in which the company gained a 30-year license for gold mining in the TasiastSud. This could be a solid growth driver. In July, the company released the pre-feasible results on Lobo-Marte project in Chile which showed that it has the capacity to support long-term production and increase the reserve life index by 25% compared to last year. KGC’s revenue and EPS estimate for the current quarter of $1.17 billion and $0.19 indicate a year-over-year increase of 35.5% and 137.5 %, respectively. The company’s EPS is expected to grow 23.9% next year and at a rate of 17.9% per annum over the next five years. The stock has gained more than 230% since hitting its low in March. How does KGC stack up for the POWR Ratings? A for Trade Grade B for Buy and Hold Grade. A for Peer Grade B for Industry Rank A for Overall POWR Ratings The stock is also ranked #2 out of 30 stocks in the Miners-Gold industry. B2Gold Corp (BTG) Founded in 2007, BTG is a low-cost international senior gold producer with three operating mines in Mali, the Philippines, and Namibia. It operates the Fekola Mine in Mali, the Masbate Mine in the Philippines, and the Otjikoto Mine in Namibia. B2Gold’s Fekola mine is the second-biggest gold producer in Mali behind Barrick Gold’s (GOLD) Loulo-Gounkoto mine. The company also has an 81% interest in the Kiaka Project in Burkina. On September 17th, BTG announced impressive exploration drilling results from the Cardinal and FMZ zones near Fekola, and the Mamba zone in the Anaconda area, which should bode well for the stock. In the second quarter, B2Gold saw a 65.4% year-over-year rise in total revenue to $442 million, topping its own projections by $24 million. This performance was driven by higher metal prices and a 3% and a dip in AISCs. The company has recently declared a cash dividend of $0.04 per share for the third quarter of 2020. The stock closed yesterday’s trading session at $6.62, gaining more than 200% since hitting a 52-week low in March. BTG’s POWR Ratings reflect this promising outlook. It has an overall rating of “Buy” with an “A” in Trade Grade and a “B” for Buy and Hold Grade, Peer Grade and Industry Rank. Among 30 stocks in the Miners-Gold industry, it is ranked #10. Silvercorp Metals Inc. (SVM) SVM is a Canadian mining company producing silver, lead and zinc metals from mines in China. The Company engages in the acquisition, exploration, development, and mining of mineral properties. It holds interest in Ying silver-lead- zinc project located in the Ying Mining District in Henan Province, China; and GC silver-lead-zinc mine in Guangdong Province, China. On August 31st, SVM reported an 18% increase in measured and indicated silver resources and 4% increase in proven and probable silver reserves. The company reported earnings of $0.09 per share for the fiscal first quarter ended June 2020. The company sold approximately 1.9 million ounces of silver, 1,100 ounces of gold and 20.9 million pounds of lead, representing an increase of 1%, 10%, and 17% year-to-date, respectively, during the quarter. The company’s revenue came in at $46.7 million, increasing 2% year-over-year. The stock closed yesterday’s trading session at $7.85, gaining more than 250% since hitting a 52-week low in March. It’s no surprise that SVM is rated a “Strong Buy” in our POWR Ratings system. It also has an overall rating of “Strong Buy” with a grade of “A” for Trade Grade and Peer Grade and a “B” in Buy and Hold Grade and Industry Rank. Among the 11 stocks in the Miners – Silver industry, its ranked #2. Want More Great Investing Ideas? 7 “Safe-Haven” Dividend Stocks for Turbulent Times When Does the Next Bull Run Start? Chart of the Day- See the Stocks Ready to Breakout KGC shares rose $0.07 (+0.85%) in after-hours trading Wednesday. Year-to-date, KGC has gained 73.42%, versus a 1.68% rise in the benchmark S&P 500 index during the same period."}]}