{"article": [{"url": "https://stocknews.com/news/spy-cboe-avoid-these-6-options-trading-mistakes/", "published": 1595419700.0, "headline": "Avoid These 6 Options Trading Mistakes", "body": "As investors await earnings from the likes of “Microsoft (MSFT)” and Twitter (TWTR),” new traders are chomping on the Robinhood platform to get a piece of the action. I’m going to be playing TWTR using an options strategy called a double diagonal in my Options360 Service but this may be too complicated for newcomers going it alone. My advice is to get some options trading education, which is widely available all over the world wide web. 9 \"BUY THE DIP\" Growth Stocks For 2020As shoppers have become increasingly savvy in finding online bargains and discounts, we see similar behavior spilling into other aspects of their lives. This includes investment advice and stocks they seek. But, sometimes it’s better to pay up to get a little better quality. This is particularly true with options. Which brings us to the first of our rookie mistakes. Buying “Lottery” Tickets Too often, new traders opt for buying way out-of-the-money options as they are attracted by their low notional dollar amount. They perceive them as a “bargain” and a good way to gain the leverage of options. But, the low cost doesn’t mean they are “cheap.” In fact, out-of-the-money options usually have higher implied volatility than those closer to the money (near the underlying stock price) and are, therefore “expensive’ in relative terms. Out of the money options also come with a much lower delta — meaning it will take a much larger price move in the underlying shares to cause an increase in the value of the option. The probability that they will deliver a profit diminishes the further out-of-the-money you go. Remember, something like 80% of all options expire worthless. Once in a while, it’s OK to make a calculated risky bet, as there might be a takeover or news event that will catapult a stock higher. But, for your bread and butter trading, it’s best to stick to strikes that are near-the-money. Swinging for the Fences Ahead of Earnings Season When people talk about trading options, the conversation usually turns to ultra-risky strategies. By far, the most common of these is buying calls or put options ahead of an earnings season number in the hopes of hitting a home run. The upside in being right about such an unpredictable event is a big, fat profit.The downside when you’re wrong? That’d be 100%. As in, the underlying stock gaps against you, the options are left worthless. There is nothing wrong with making the occasional speculative bet if you understand the risk involved. But, I’d suggest you use spreads to minimize the impact of the post-earnings premium crush (PEPC) that occurs following the event. Which brings us to #3. Failing to Understand Implied Volatility Being wrong on a stock’s direction is clearly an easy way to lose money. But, there’s a second, and perhaps even more frustrating way to lose money with options: failing to understand the intricacies of option pricing. One of the biggest mistakes new options traders make is not taking into account implied volatility, which measures expectation or probability of a given size move within a given time frame. Simply put, implied volatility provides a gauge as to whether an option is relatively cheap or expensive based on past price action in the underlying stock, and it is among the most important components in option pricing. Therefore, in order to consistently make money trading options, one must attain a basic understanding of implied volatility. Failing to Understand Time Decay Traders also commonly fail to realize that options are a wasting asset. One very important component in the price of an option is the time until expiration. So as time goes on, the value of that time decays, with a negative impact on the overall value of the option itself. If you buy calls or puts outright, and the underlying stock moves in your direction at a slow pace, the option may not gain in value. However, a basic understanding of option pricing and a grasp of a variety of trading strategies will allow you to offset the impact of time decay — or even turn it to your advantage. Ignoring the Power of Compounding Small Gains Above, we referenced the risk in swinging for the fences with options. The less-sexy – but far more lucrative — the reality is that the best options traders grind out steady profits using a wide variety of strategies, looking to consistently earn 2% to 4% a month, with an occasional kicker from speculative bets. Two percent per month doesn’t sound like a lot but compounded over a year, it adds up to 27%. That’s more than three times the average historical return for the S&P 500 (SPY). Stretch that monthly gain from 2% to 4%, and the annualized profit is on the order of 60%. The important takeaway here is not the idea of making 60% in a year, but rather the power of consistently hitting high-probability singles rather than swinging for low-probability home runs every time we step up to the plate. Extreme risk-taking could mean that you’re up 100% one month — and down 50% the next. You do that and you’re right back where you started, but with an ulcer and heart medication. There is plenty of room for speculation with options, but to stay ahead of the game, you have to pick your spots wisely. Failing to Diversify Your Portfolio Ideally, no single position should represent more than 5% of a portfolio. My personal options account typically carries six to 10 positions at a time. These can run from complex, multi-strike hedged positions that have four to six months until expiration, to speculative plays based on unusual activity or an upcoming event that will be held for just a few days. Why? Because again, I never want to get knocked out of the game on one trade or allow a position to get so large that it could threaten gains elsewhere in the portfolio if things go south. When people go broke trading options, it’s usually because they not only swung for the fences but put far too much money into that single trade. To learn more about Steve Smith’s unique trading approach, and access to his highly-acclaimed Options360 course, click here. SPY shares were trading at $325.54 per share on Wednesday afternoon, up $0.53 (+0.16%). Year-to-date, SPY has gained 2.19%, versus a % rise in the benchmark S&P 500 index during the same period."}]}