{"article": [{"url": "https://stocknews.com/news/wmt-cost-lulu-3-stocks-experiencing-significant-e-commerce-growth/", "published": 1595419700.0, "headline": "3 Stocks Experiencing Significant E-Commerce Growth", "body": "As the pandemic grips the world, one area of business that has seen explosive growth is e-commerce. E-commerce stocks were seeing gains before the pandemic started, but the closure of brick and mortar stores only accelerated this trend. It has fundamentally changed the shopping habits of consumers worldwide. Changes in shopping behavior are most likely permanent and will benefit e-commerce stocks for the foreseeable future. More companies will be focusing on online channels, in-store fulfillment, and curbside pickup. Here are three stocks that are experiencing significant e-commerce growth: 7 \"SAFE HAVEN\" Dividend Stocks for Turbulent TimesWalmart Inc. (WMT) In the first quarter of fiscal 2021 ending April 30th, WMT’s total revenue increased 8.6% year-over-year, and US e-commerce sales grew 74%, which is a testament to the company’s improved mobile capabilities and the success of its low-price model. Moreover, to serve its huge consumer base in India, WMT recently invested $1.2 billion in Flipkart, an Indian e-commerce giant, to help it compete and expand its e-commerce marketplace in India. WMY bought a 77% stake in Flipkart two years ago. WMT’s “endless aisle” services that allow customers to check on item stock and its curbside delivery, express delivery, same day delivery and pick up services have made its e-commerce platform much more convenient for customers. There are also recent media reports that WMT is going to launch a subscription-based service, “Walmart+.” Furthermore, WMT’s partnership with Shopify could strengthen its e-commerce business. WMT hit its 52-week high of $134.13 on July 15th and has recovered more than 30% since hitting its 52-week low in mid-March. WMT’s consensus revenue estimate of $134.34 billion for the current quarter indicates a year-over-year increase of 3%. Also, WMT beat its consensus EPS estimates in three of the trailing four quarters. How does WMT stack up for the POWR Ratings? A for Trade Grade A for Buy & Hold Grade A for Peer Grade A for Industry Rank A for Overall POWR Rating You can’t ask for better. The stock is also ranked #1 out of 18 stocks in the Grocery/Big Box Retailers industry. Costco Wholesale Corporation (COST) During this period of economic uncertainty, Costco memberships could gain popularity as it offers low prices to members for its products. COST secured a subscription renewal rate of above 90% for the past few quarters, which is a positive sign for the long term. For five weeks ended July 5th this year, net sales increased by 11.1% year over year, driven by a surge in e-commerce growth of 85.8%. Last month, COST’s comparable sales soared, recording an 11% increase in the United States, 8.4% increase in Canada, and 18% increase internationally. COST recovered quickly from its dip over the past year and is approaching its 52-week high of $331.49. COST’s earnings surprise history looks impressive, with the company surpassing consensus EPS estimates in three of the trailing four quarters. The market also expects the company to report EPS of $2.71 for the current quarter, representing a slight improvement over the year-ago number. Moreover, COST’s consensus revenue estimate of $50.59 billion for the current quarter indicates a year-over-year increase of 6.5%. It’s no surprise that COST is rated a “Strong Buy” in our POWR Ratings system. It also has an “A” for Trade Grade, Buy & Hold Grade, Peer Grade, and Industry Rank. In the 18-stock Grocery/Big Box Retailers industry, it is ranked #2. Lululemon Athletica inc. (LULU) LULU is an athletic apparel company that operates in two segments — direct to consumer and corporate-owned stores — and creates products for yoga, training, running, and other fitness endeavors. In the first quarter ending May 3rd 2020, direct to consumer net revenue, which involves sales through the website and mobile app increased 68% year-over-year and comprised 54% of total net revenue, compared with 26.8% for the first quarter of fiscal 2019. In the most recent quarter, online sales in Europe and Australia grew more than 100%. The rapid growth of LULU’s e-commerce segment will open up avenues for long-term growth, as stated by Calvin McDonald, CEO of LULU. LULU recently acquired MIRROR home interactive fitness startup for $500 million which could add new revenue streams, increase apparel purchases, and build relationships with its members. LULU also predicts that it could quadruple its 2018 business in international markets by 2023. The stock has been rising since hitting its 52-week low of $128.85 on March 18th and has gained almost 152% so far. The earnings surprise history for LULU looks pretty good, as the company beat the consensus EPS estimates in three of the trailing four quarters. LULU’s POWR Ratings reflect this promising outlook. It has an overall rating of “Strong Buy” with an “A” for Trade Grade, Peer Grade, and Buy & Hold Grade. Among the 65 stocks in the Fashion & Luxury industry, it’s ranked #1. Want More Great Investing Ideas? 9 “BUY THE DIP” Growth Stocks for 2020 Newly REVISED 2020 Stock Market Outlook 7 “Safe-Haven” Dividend Stocks for Turbulent Times WMT shares fell $0.35 (-0.26%) in after-hours trading Wednesday. Year-to-date, WMT has gained 12.62%, versus a 2.60% rise in the benchmark S&P 500 index during the same period."}]}