{"article": [{"url": "https://stocknews.com/news/snow-msft-amzn-goog-ayx-1-winner-and-3-losers-from-the-snowflake-ipo/", "published": 1600171700.0, "headline": "1 Winner and 3 Losers From the Snowflake IPO", "body": "This week’s Snowflake (SNOW) IPO is generating tremendous amounts of enthusiasm among investors. It already has several high-profile backers. Warren Buffett has invested nearly $500 million, while Salesforce.com (CRM) is buying another $250 million. The expected price range for Snowflake has increased to $100 to $110 from $70 to $80 due to higher than expected demand. It’s planning to offer 23 million shares and hopes to raise over $3 billion. Snowflake is only five years old but already is projected to have $800 million in revenue over the next 12 months. It provides a turnkey, cloud-based database solution for companies. It’s serving an important need by helping companies pull insights and build applications out of the massive amounts of data generated by their various business units. 9 \"BUY THE DIP\" Growth Stocks For 2020Snowflake’s Story We live in an era, where the quantity of data is exploding. With the proliferation of internet-connected devices, enterprise software, and cloud computing, it’s estimated that more data has been produced in the last two years than all of human history. Snowflake helps companies organize their data by creating “data warehouses.” Essentially, it takes massive pools of data from various departments of the company and then reorganizes it across different categories to make it searchable and useful in a practical sense. Companies can then use these warehouses to optimize operations, learn more about their customers, and earn more money. Snowflake has its own cloud which is built on top of other major cloud operators including Google (GOOG) Cloud, Microsoft’s (MSFT) Azure, and Amazon’s (AMZN) AWS. (source: Snowflake S-1) The company is expected to IPO at a valuation of around $30 billion. It has further room to grow given that its total addressable market is expected to be over $130 billion given the $80 billion spent on cloud data platforms and nearly $60 billion spent on analytics. Further, the company will benefit from a number of trends including more data moving to the cloud, and the increasing proliferation of data which is only useful if it can be organized and understood. The company’s revenue increased by 121% on a year over year basis to $133 million in the last quarter. In fact, Snowflake is the fastest-growing software company with over $100 million in revenue. It already has 20% of the Fortune 500 as customers. Investors are particularly excited by its ability to increase its customer base, boost revenue per customer, and maintain gross margins above 50%. One Winner Alteryx (AYX) AYX is a “winner” from the SNOW IPO. It has partnered with Snowflake to deliver a data and analytics solution that is flexible and scalable. Alteryx creates a dashboard for their customers to view cloud analytics, while Snowflake provides and organizes the data. AYX CEO Dean Stoecker recently said in a conference call, “We love what they’re doing. We think that they’ll have a fabulous IPO. We think it creates another tailwind for us. What — as a persistence layer, what they want is compute loads. We make it easy for people to get computer load efficiency in Snowflake.” AYX is 40% off its recent high as the company issued guidance below expectations. Nevertheless, AYX has considerable long-term potential given that cloud spending is expected to grow at a 22.3% CAGR over the next five years. AYX’s platform helps companies optimize their cloud software to work better. Three Losers What’s interesting is that Snowflake’s major competitors are the cloud platforms it’s built on – Amazon (AMZN), Google (GOOG), and Microsoft (MSFT). Each of these companies also provides its own data warehouse services. Given these companies’ resources and built-in advantages, it is surprising that an upstart is taking market share from them. However, Snowflake’s offerings have proven superior in terms of efficiency and ease-of-use. Further, Snowflake is more flexible since it’s not necessarily tied to any cloud provider giving companies more freedom and control over their data. Snowflake was designed from scratch with the sole purpose of filling this need which has made its software more agile and cheaper. Like many other network-based software businesses, Snowflake’s product will grow more powerful with more users joining which will allow it to attract even more users and offer more products. As an example, companies are able to select which data they want to share publicly or with their partners. As more companies opt-in, it will allow Snowflake to create data markets and act as a “data broker” which will be another profit and growth driver down the line. The data warehouse business is also a higher-margin business than cloud computing. In a sense, it’s like Google and Facebook building more profitable businesses on top of the Internet which was only made possible by the efforts of the ISPs. Amazon AMZN’s data warehouse product is Amazon Redshift. Redshift has 13,060 customers and is growing 5% YoY. In contrast, Snowflake has 3,117 customers and is growing 101%. The majority of Snowflake’s customers use AWS as their cloud provider, so this is a rare instance in which AMZN has been beaten by an upstart. Customers who have switched from Snowflake prefer it due to its flexibility, speed, and convenience. Snowflake’s software can simply do more operations with fewer resources than Amazon. Google Google’s data warehouse service is called Big Query. It has 8,272 customers and grew 35% on a YoY basis. Like RedShift, it’s only available for Google Cloud and limits the ability to move data off its Cloud. Some of the major differences are that Big Query charges per query, while Snowflake charges per time. According to third-party benchmarks, Snowflake delivers better results in less time and uses fewer resources. Microsoft Microsoft Azure’s Synapse is the third largest with 6,032 customers and is growing by 25%. Snowflake should overtake it in terms of customer count, sometime next year. Comparisons between Synapse and Snowflake reveal similar outcomes. Snowflake is faster and uses fewer resources. Additionally, the drawback with Synapse is that you are basically locking yourself into using Azure as your cloud provider and keeping your data on their cloud. Conclusion Of course, it’s unlikely that MSFT, GOOG, and AMZN are going to cede this lucrative segment to SNOW without putting up a fight. There are numerous instances of bigger, tech companies using their deep pockets to win back market share. The most famous example is MSFT winning the browser war against Netscape by improving its product and pre-installing Internet Explorer into every Windows OS. There are also famous instances in which the dominant tech company was defeated by a nimbler upstart with a superior product. GOOG beat MSFT, when it came to search, and FB beat GOOG in social media. Both companies threw huge sums of money and invested considerable resources but proved unsuccessful. The legacy cloud companies will work on improving their product and offer incentives to their cloud customers to use their data warehouse products in an effort to keep existing customers and win new ones. However, it seems that Snowflake has a better product and customers are not keen on keeping all their data on one platform. Fortunately for MSFT, GOOG, and AMZN, these companies are so big that losing out on this one market is not going to meaningfully affect their financials. However, it may be an indication that they are not best-positioned to innovate the higher-value businesses that will be built on top of their cloud systems. Want More Great Investing Ideas? 7 Best ETFs for the NEXT Bull Market Is the Stock Market Correction Over? Chart of the Day- See the Stocks Ready to Breakout SNOW shares were trading at $23.75 per share on Tuesday afternoon, up $0.04 (+0.17%). Year-to-date, SNOW has gained 33.05%, versus a 7.20% rise in the benchmark S&P 500 index during the same period."}]}