{"article": [{"url": "https://stocknews.com/news/spy-amd-a-losing-trade-that-shows-the-importance-of-risk-management/", "published": 1595938100.0, "headline": "A Losing Trade That Shows the Importance of Risk Management", "body": "Recently, I’ve been writing a lot about earnings and presenting various options strategies that I use in the Earnings360 service to harness both price movement and changes in implied volatility. But most importantly, how to mitigate risk. I specifically focused on Pre-Earnings or PEPE trades to avoid the earnings event. Last week, I drilled into a profitable trade in “Texas Instruments (TXN)” which delivered the expected 25% return tight on cue. This week, I want to analyze a simpler PEPE trade-in “Advanced Micro Devices (AMD)” which turned into a total debacle. But, they say you learn more from your losers than winners — so here we go. In this case, the main lesson will be that setting up the option strategy with a defined risk allowed me to sustain a worst-case scenario and once again emphasizes the importance of having a hedged position. A quick reminder, the PEPE trade is a strategy in which we sell weekly options and buy the same strike of the following week. I call it a double strangle, as a means of collecting short-term premium. It works best when the underlying share price remains within the strike prices. By using a stock that won’t report earnings until the following week, it puts the odds in our favor so there won’t be an outsized move prior to the earnings event. 7 Best ETFs for the NEXT Bull MarketBut, sometimes broad market moves take the stock along and push the price through the strike and out of the profit zone. But, I got caught in the reaction to “Intel (INTC)” which reported earnings on Thursday, July 16. Usually, companies will trade in sympathy with a similar name, up or down to a lesser degree. But, I’ve never seen such a diametrically opposite move. Here’s how it played out. This initial trade was: Advanced Micro Devices (AMD) is a chip maker whose products go into a wide variety of products from gaming to phones. The stock has been fairly range-bound the past few weeks and I don’t foresee it breaking out prior to the July 28th report. The skew, or differential between implied vol. of the 7/24 expiry we are selling, and the 7/31 expiry we are buying, is fairly flat. This means we should be able to achieve our target of a 20%+ return. ACTION:-Sell to open 3 contracts July (7/24) 54 Puts-Sell to open 3 contracts July (7/24) 59 Calls-Buy to open 3 contracts July (7/31) 54 Puts-Buy to open 3 contracts July (7/31) 59 CallsFor a Net Debit of $2.50 (do not go above $2.60) Things were looking good and by Thursday, I issued an order to take profits as the weekly calls we sold were decaying, meaning we were picking up risk-free premium. The AMD shares are moving lower, putting this PEPE trade back in the profit zone. Let’s go ahead and enter a limit order to close as GTC so it will be in place for Wednesday’s opening.We can update tomorrow if needed. Or debate it on tomorrow’s call. This is an order to close an existing position!ACTION:-Buy to close 3 contracts AMD July (7/24) 54 Puts-Buy to close 3 contracts AMD July (7/24) 59 Calls-Sell to close 3 contracts AMD July (7/31) 54 Puts-Sell to close 3 contracts AMD July (7/31) 59 CallsFor a Net Credit of $3.30 (GTC) But then things went kaboom! On Thursday, INTC earnings were a disaster as the company revealed it would be forced to delay a product development for the next two to three years due to faults in its factory foundries. Two or three years is an eternity in the chip space and INTC basically ceded a generation of product sales to AMD. INTC plummeted by 15% and AMD ripped higher by over 13%. The move in AMD, which was twice the large of what was even expected for the earnings report. And pushed shares to nearly $70, well past the 59 call strike. It was time to close the position down. Thankfully, due to the hedged structure of the options strategy, we were still able to recoup 50% of our initial cost or a $1.30 credit. Not a great outcome, but given the circumstances, it was sustainable and allowed us to continue trading in a controlled and risked managed manner. Click here to learn more about author Steve Smith’s unique and profitable approach to trading. Want More Great Investing Ideas? 9 “BUY THE DIP” Growth Stocks for 2020 Newly REVISED 2020 Stock Market Outlook 7 “Safe-Haven” Dividend Stocks for Turbulent Times SPY shares were trading at $323.15 per share on Tuesday afternoon, down $0.07 (-0.02%). Year-to-date, SPY has gained 1.44%, versus a % rise in the benchmark S&P 500 index during the same period."}]}