{"article": [{"url": "https://stocknews.com/news/sq-shop-pypl-have-e-commerce-stocks-risen-too-far-too-fast/", "published": 1596629300.0, "headline": "Have E-Commerce Stocks Risen Too Far, Too Fast?", "body": "E-commerce is booming in the coronavirus era while many parts of the economy are stagnating or shrinking, like the travel industry, restaurants, and physical retail. Decreased spending and economic activity in these categories are being diverted into the remaining outlets, like e-commerce. This is reflected in the stock prices of the leading, Internet companies, and their earnings reports. Three of the most important bellwether stocks for this sector are Shopify (SHOP), Square (SQ), and Paypal (PYPL). The services the companies provide enable individuals and businesses to sell products and services online. Thus, investors should monitor these stocks closely to gauge the health of the Internet economy. 7 Best ETFs for the NEXT Bull MarketExpanding Multiples The stock prices of these three companies have outpaced improvements in their earnings and revenue. Meaning, their multiples have expanded and their future expectations are now higher. They will have to maintain these growth levels to justify their expanded multiples. For example, Shopify’s price-to-sales ratio has risen from 53 to 61 despite the company delivering a 97% increase in revenue and a massive earnings beat. Over the last quarter, SQ grew revenues by 64% on a year over year basis, however, its share price has tripled. PYPL’s revenues were 22% higher, while its share price was up 50% in the last quarter. Temporary or Permanent For investors, the most pertinent question is whether this boom is a temporary development or whether this acceleration will be sustained. Stock market bears believe these stocks will fail to meet investors’ lofty expectations and experience severe declines. However, stock market bulls believe the current momentum will sustain and, these stocks are likely to continue trending higher. We can examine recent earnings reports from these companies to gain additional insight. Square (SQ) Yesterday, SQ opened 13% higher following its results with the major highlight being a 64% increase in revenue. A big portion of growth came from Bitcoin revenue. In the past quarter, its strength was on the consumer side with its Cash app which had an increase of 4 million users. The product is how many young people manage their finances and has become one of the leading digital payment platforms. SQ continues to build on top of this by offering more services like Square Card. Balances on the app also grew due to the government stimulus checks, unemployment insurance, and tax refunds. However, the company’s other segment, payment processing for small businesses, saw weakness with many brick-and-mortar establishments forced to shut down. Transaction volume declined 15%, however, these figures improved as more economies opened. Some of this weakness was offset by increased online payment volume which grew 50%. How does SQ stack up for the POWR Ratings? A for Trade Grade A for Buy & Hold Grade A for Peer Grade B for Industry Rank A for Overall POWR Rating You can’t ask for better. The stock is also ranked #3 out of 141 stocks in the Financial Services category. Paypal (PYPL) Last week, PYPL’s management struck an optimistic tone on their conference call. CEO Dan Schulman said the changes resulting from the pandemic, “will have a lasting and profoundly positive impact on our business.” The company said that volumes in the last quarter were only previously seen during holidays like Black Friday or Cyber Monday. Additionally, its projections for e-commerce as a percentage of retail sales has been pulled forward by three to five years. Overall, PYPL generated $222 billion in payment volume which was a 22% increase on a year over year basis and above analysts’ expectations of $210 billion. It also added 21.3 million individual accounts and 1.7 million merchant accounts which is three times normal growth. PYPL’s POWR Ratings are also impressive as it has a “Strong Buy” rating. The stock has an “A” in all categories including Trade Grade, Buy & hold Grade, Peer Grade, and Industry Rank. Among Consumer Financial Services stocks, it’s ranked #1 out of 45. Shopify (SHOP) SHOP also delivered impressive earnings last week and cited an acceleration of its growth timeline. SHOP’s COO said, “we’ve seen the COVID-19 pandemic fundamentally shift the way businesses and consumers interact. It has catalyzed e-commerce, introducing major changes in buyer behavior, and pulling forward what retail would look like in 2030 into 2020.” Gross merchandise volume on the platform accelerated to the highest level since its IPO, as stores sold 150% more than they did in Q4 of 2019 which was its previous, busiest quarter. For SHOP, the number of stores is increasing as well as the number of items they are selling which will create more monetization opportunities for the company. The company sees these opportunities in fulfillment, marketing, financing, wholesaling, and back-end services. Ultimately, SHOP’s business is to help the merchants on its platform grow, which will make its platform more valuable. SHOP’s POWR Ratings is consistent with this strength as it is rated a Strong Buy.It has an A” for Trade Grade and Buy & Hold Grade with a “B” for Peer Grade and Industry Rank. Among the Internet – Services group, it’s ranked #1 out of 34. Conclusion Business’ priorities and people’s behavior have changed due to the coronavirus pandemic. The longer this “new normal” continues, the more likely it is that these behaviors become routine. However, for investors, it’s important to note that the extraordinary gains in these stocks are due to investors pricing in higher levels of growth. Therefore, these stocks need to keep delivering double-digit growth to validate these higher multiples. If they fail to do so, then it’s likely that these stocks will tumble and return to their previous levels. Want More Great Investing Ideas? 9 “BUY THE DIP” Growth Stocks for 2020 How to Trade THIS Stock Bubble? 7 “Safe-Haven” Dividend Stocks for Turbulent Times SQ shares were trading at $148.10 per share on Wednesday afternoon, up $11.27 (+8.24%). Year-to-date, SQ has gained 136.73%, versus a 4.17% rise in the benchmark S&P 500 index during the same period."}]}