{"article": [{"url": "https://stocknews.com/news/pld-etn-twtr-epam-4-upgraded-stocks-to-buy-for-the-rest-of-2020/", "published": 1601035700.0, "headline": "4 “Upgraded” Stocks to Buy for the Rest of 2020", "body": "The latest POWR Ratings show a wide array of stocks that have been upgraded to “Buy” and “Strong Buy” ratings. Plenty of these upgrades are outside of the red-hot tech space, making them all the more intriguing as money moves away from tech into value stocks. The exclusive POWR Ratings take all sorts of information into account when upgrading and downgrading stocks. Follow these upgrades and downgrades closely, and you won’t have to invest your limited time crunching the numbers on your own. Below, we provide a look at four recent upgrades: Prologis (PLD), Eaton (ETN), Twitter (TWTR), and Epam Systems (EPAM). 7 Best ETFs for the NEXT Bull MarketPrologis (PLD) Now that the economy and stock market have become quite unpredictable, it makes sense to invest in REITs. PLD is a self-managed and self-administered REIT with a worldwide network of real estate properties. The majority of PLD’s properties are of the industrial distribution variety. PLD’s segments are property operations, CDFS business, and fund management. Check out PLD’s POWR components, and you will find good news: “A” grades in the Trade Grade and Buy & Hold grade components, a “B” for Industry Rank, and a top-ranking out of more than 20 REITs – Industrial stocks. PLD has a year-to-date price return of over 12%. The stock’s 2019 return was nearly 56%. More recently, PLD has a six-month price return of 25%. Analysts have set a price target of $110.22, which is almost 13% higher than its current price. Eaton (ETN) The engineering, servicing, and marketing of fluid power systems used in mobile, aircraft, electrical systems, and industrial equipment is now big business. This is ETN’s specialty. ETN has “A” grades in each POWR component. The stock is ranked in the top 10 of 60 Industrial – Machinery stocks. It has a year-to-date return, just under 10%. In 2019, ETN had a return of more than 42%. Furthermore, ETN has a six-month price return of nearly 40%. Analysts have set an average price target just above $103. ETN provides a dividend of 3%. The company is striving toward earnings growth with the sale of its hydraulics business and lighting business. ETN also has an EV venture that should hit its stride at some point in the next year. The aim is for ETN’s eMobility parts to be used in electric cars and trucks within the next couple of years. Twitter (TWTR) Turn on the radio or TV, and you are bound to hear mention of TWTR. This social media stock hovered around $30 for months and quickly shot up above $40 after rumors swirled it would attempt to acquire TikTok. Though TWTR failed to land TikTok, the mere fact that it made an attempt shows its leadership, highlighted by Jack Dorsey, intends to make power moves. TWTR executives have stated they will roll out a new subscription service at some point. The TWTR POWR Ratings are fantastic: “A” grades in three out of the four components. TWTR is ranked in the top 10 of nearly 60 stocks in the Internet industry. TWTR has a year-to-date return of 41%, a 2019 price return of 11%, and a three-month price return of 44%. TWTR’s daily active users are up 34% on a quarterly basis. Add in the fact that TWTR has improved its ad server to present more ads to users, and there is all the more reason to believe in this company. Epam Systems (EPAM) If you are looking for a place to park your money as the market undulates and the recession plays out, consider this IT consulting and software engineering firm. EPAM provides software product development, application maintenance, application testing, custom application development, and more. The POWR Ratings show EPAM has “A” grades in each POWR component, but its Industry Rank of “B”. EPAM is ranked in the top three of nearly 100 Software – Application stocks. EPAM has a year-to-date return of 50%. The stock had a 2019 return of 82%. EPAM’s most recent quarterly sales were up 15%. The company’s guidance for the next quarter indicates more than 8% revenue growth on a year-over-year basis. TipRanks reports the average analyst price target for EPAM is $336.38, which is 5% higher than its current price. Want More Great Investing Ideas? 7 “Safe-Haven” Dividend Stocks for Turbulent Times When Does the Next Bull Run Start? Chart of the Day- See the Stocks Ready to Breakout PLD shares were trading at $95.56 per share on Friday morning, up $0.20 (+0.21%). Year-to-date, PLD has gained 9.38%, versus a 1.59% rise in the benchmark S&P 500 index during the same period."}]}