{"article": [{"url": "https://stocknews.com/news/apha-acb-cgc-mj-cannabis-stock-weekly-recap/", "published": 1596197300.0, "headline": "Cannabis Stock Weekly Recap", "body": "Though the ETFMG Alternative Harvest ETF (MJ) ended up flat on the week, the cannabis stocks saw tremendous volatility. The week started off on a high note as investors geared up for the start of Q2 earnings. Cannabis stocks gained heavily on Monday and Tuesday as speculation surrounding Aphria (APHA) earnings would yield another blowout quarter. Unfortunately, APHA reported a large loss due to impairment charges and weaker than expected earnings. Aurora Cannabis Traded Close to Single Digits 9 \"BUY THE DIP\" Growth Stocks For 2020At the beginning of the week Aurora Cannabis (ACB) surged with the rest of the cannabis stocks in anticipation of positive earnings results from APHA. However, after APHA disappointed, ACB plunged and closed the week at $10.20. In the past 2.5 months, ACB has been in a steady downtrend as hype and speculation has fizzled since their last earnings report. If ACB cannot deliver in the second quarter, then investors should brace for impact as the stock could fall below $10 again. Management needs to announce a new full-time CEO to bring confidence back to shareholders and the company needs to ensure it achieves positive EBITDA the following quarter. Aphria Records $99 Million Dollar Loss APHA recorded a $99 million dollar loss in its most recent earnings report. The company also reported a net loss of 29 cents per share, a huge miss compared to analyst expectations of CA$-0.03 per share. Revenue came in at $113.85 million, up 18% from a year ago. Analysts were expecting revenues of $102.31 million. Net cannabis sales came in at 39.79 million USD, down from 41.66 million USD in the previous quarter. APHA’s Kilograms sold also fell as sales slowed after the initial buying surge triggered by the pandemic. If APHA had a tough quarter in Q2 then investors should brace for impact when companies like Aurora Cannabis (ACB) or Canopy Growth (CGC) report earnings, as they have substantially lagged APHA’s in profits. This marks the ongoing struggles the cannabis sector continues to face as the global economy attempts to get back on its feet after the COVID-19 outbreak. On Thursday, the United States recorded a historic 33% plunge in GDP as Q2 looks like it will be the most challenging quarter of the year. Want More Great Investing Ideas? 9 “BUY THE DIP” Growth Stocks for 2020 How HIGH Can This Tech Bubble Fly? 7 “Safe-Haven” Dividend Stocks for Turbulent Times APHA shares rose $0.02 (+0.42%) in after-hours trading Friday. Year-to-date, APHA has declined -8.43%, versus a 2.49% rise in the benchmark S&P 500 index during the same period."}]}