{"article": [{"url": "https://stocknews.com/news/nvax-ino-mrna-vxrt-vbiv-five-coronavirus-stocks-you-need-to-know/", "published": 1594210100.0, "headline": "5 Coronavirus Stocks You Need to Know", "body": "Currently, vaccine candidates for the coronavirus are in various stages of development. Across the world, there are 135 vaccines in preclinical trials and 20 that are being tested on humans. It’s going to be a major win for the company that can discover a vaccine that works. Not only will it have a significant impact on global health but also generate billions of dollars in profits. Not to mention, it will generate trillions of dollars of value for the economy as people around the world are once again able to go to their offices, restaurants, sporting events, movies, etc. Talk about a win-win. 7 \"SAFE HAVEN\" Dividend Stocks for Turbulent TimesTherefore, all investors should keep an eye on the latest developments in the race to find a vaccine. Here is the latest on five stocks that are leading this race: Novavax, Inc. (NVAX) NVAX was in the news this week as it received $1.6 billion from Operation Warp Speed to complete late-stage clinical development, establish large-scale manufacturing, and deliver 100 million doses of NVX‑CoV2373, Novavax’ COVID-19 vaccine candidate, as early as late 2020. It’s the largest contribution from Operation Warp Speed thus far, and many consider NVAX to be one of the leaders. The company’s vaccine aims to increase the body’s production of antibodies to block the protein that the coronavirus uses to invade cells. NVAX is expected to report results of its phase 2 trial later this month and begin a final-stage study with 30,000 participants this fall. How does NVAX stack up for the POWR Ratings? A for Trade Grade A for Buy & Hold Grade A for Industry Rank A for Peer Grade A for overall POWR Rating You can not ask for better. It’s also the 15th ranked stock in the Biotech sector. it is the #1 rated stock in the Biotech sector. Inovio Pharmaceuticals Inc. (INO) INO reported positive phase 1 data for its coronavirus vaccine candidate in that it successfully increased the antibody count in participants. After six weeks, 94% of participants had an increased antibody count following two doses. INO’s vaccine is based on its DNA medicine research, injecting DNA plasmids into the body to create an immune response. Its stock started rallying starting in February as soon as the coronavirus crisis began. In sum, it’s gained 700%. INO’s POWR Ratings are also strong with a Buy rating. The stock has an “A” for Trade Grade, By & Hold Grade, and Peer Grade. Among biotech stocks, it’s ranked #44 out of 337. Moderna, Inc. (MRNA) MRNA is in the midst of its phase 1 trial and their interim data was positive. The company reported that binding and neutralizing antibody counts of participants were at the same level or higher than in patients who had recovered from the coronavirus. Although, it was a small sample size with only 8 participants. MRNA plans to begin phase 2 trials later this month with 30,000 participants. People are hopeful specifically about the increase in neutralizing antibodies which gives the body stronger defense than just binding antibodies. All of Moderna’s products are predicated on its use of messenger RNA to deliver instructions to cells. Since all of the company’s other products are in a preclinical phase but also depend on the use of messenger RNA, this is a major opportunity for MRNA to prove that its technology is viable and can deliver effective outcomes. Vaxart (VXRT) Unlike the other companies, VXRT is focused on developing an oral vaccine that can be taken with a pill. The pill is designed to develop a mucus response in patients which would create a line of defense that is more on the front-line. Many believe it would enhance the effects of any antibody-based vaccine. The stock has gained nearly 2,000% as optimism grows around its product. The company is expected to join the Russell 3000 index and was recently included into Operation Warp Speed which resulted in the stock gaining 5x in a week on huge volume. So far, VXRT is more of a long-shot as its drug is in the preclinical stage. However, a pill-based vaccine that enhances the mucus layer would be cheaper and easier to distribute than current vaccines. It could also be used against any type of viral disease giving VXRT major upside potential. Until now, its biggest hurdle was getting enough cash to fund its initial development. Its inclusion in Operation Warp Speed has solved this problem. VBI Vaccines (VBIV) VBIV is another stock that has seen huge inflows over the past couple of months due to optimism that the company’s vaccine candidate could help protect against the coronavirus. VBIV has funding from the National Research Council of Canada to develop a vaccine that would protect against all types of coronavirus including SARS and MERS. This prospect is exciting investors, because it would be better suited to protect against mutations of the virus which could potentially hamper the effectiveness of other vaccine candidates. VBIV already has a successful vaccine against hepatitis B which is expected to get FDA approval later this year. It also is conducting a phase 2 trial for glioblastoma multiforme, a type of brain cancer. VBIV is rated as a Strong Buy by POWR Ratings. It has an “A” across all categories including Trade Grade, Buy & Hold Grade, Peer Grade, and Industry Rank. Among biotech stocks, it’s ranked 34th out of 337 stocks. Want More Great Investing Ideas? 9 “BUY THE DIP” Growth Stocks for 2020 Is the Bull S#*t Rally FINALLY Over? 7 “Safe-Haven” Dividend Stocks for Turbulent Times Top 3 Investing Strategies for 2020 NVAX shares were trading at $99.10 per share on Wednesday afternoon, down $5.46 (-5.22%). Year-to-date, NVAX has gained 2,389.95%, versus a -1.18% rise in the benchmark S&P 500 index during the same period."}]}