{"article": [{"url": "https://stocknews.com/news/iipr-crbp-grwg-3-strong-buy-cannabis-stocks-to-own-for-the-remainder/", "published": 1599048500.0, "headline": "3 \"Strong Buy\" Cannabis Stocks to Own for the Remainder of 2020", "body": "The cannabis industry has been on a gradual decline since last year. However, the industry has been showing some signs of recovery lately. The ETFMG Alternative Harvest ETF (MJ) has a year-to-date loss of 25.3%, but it has gained 40.6% since its March lows. It does look like the industry could pull through these difficult circumstances as more states are considering the legalization of cannabis, and the demand for the product is increasing for both medicinal and recreational use. Moreover, even though the industry has not reached its potential yet, there are definitely some cannabis stocks that have been providing solid returns, and contributing to the industry recovery. Wall Street analysts closely follow the winning stocks in each industry and recommend them based on fundamentals, recent developments, and price momentum. Innovative Industrial Properties, Inc. (IIPR), Corbus Pharmaceuticals Holdings, Inc. (CRBP) and GrowGeneration Corp. (GRWG) are three such stocks from the cannabis industry that have a consensus analyst rating of Strong Buy. 7 Best ETFs for the NEXT Bull MarketInnovative Industrial Properties, Inc. (IIPR) IIPR focuses on the development, acquisition, and disposition of industrial facilities leased to tenants that produce cannabis for medical use. IIPR’s consensus rating is a Strong Buy with three out of four Wall Street analysts being in agreement.As of August 5, 2020, IIPR has committed to invest approximately $1.1 billion through tenant improvement allowances and construction funding commitments. IIPR recently closed the acquisition of a Michigan property and expanded its real estate partnership with Holistic Industries. The company entered into a lease amendment with a subsidiary of Ascend Wellness Holdings, LLC at a property located in Illinois, making an additional $18 million available in funding for expansion of AWH’s regulated cannabis cultivation and processing facilities at the property. In IIPR’s second quarter, total revenues increased 183% and net income available to common stockholders increased 322% year-over-year. IIPR has gained about 210% since hitting its 52-week low of $40.21 in mid-March.The market expects the company to report EPS of $0.78 for the quarter ending September 2020, which represents a 41.8% increase over the year-ago number. IIPR paid a quarterly dividend of $1.06 per share in July, representing a 77% increase over the year-ago quarter’s dividend. How does IIPR stack up for the POWR Ratings? A for Trade Grade A for Buy & Hold Grade A for Peer Grade B for Industry Rank A for Overall POWR Rating You can’t ask for better. The stock is also ranked #5 out of 21 stocks in the REITs-Industrial industry. Corbus Pharmaceuticals Holdings, Inc. (CRBP) CRBP is a clinical-stage drug development company that pioneers transformative medicines that target the endocannabinoid system. CRBP’s consensus rating is a Strong Buy with seven out of seven Wall Street being in agreement. CRBP’s average analyst price target is $26.5, which is 197.4% higher than its current price. Even though the company reported a year-over-year revenue decrease, and a net loss in the second quarter, there have been some encouraging developments with approaching data readouts and preparation of business after potential FDA approvals. The stock has gained more than 115% since its March lows. CRBP strengthened its balance sheet with up to $121 million in new capital and also recently completed the enrollment in DETERMINE Phase 3 Study of Lenabasum, an cannabinoid receptor type 2 oral small molecule, for treatment of Dermatomyositis. CEO Yuval Cohen, Ph.D., said, “We had a busy second quarter as we prepare for a potentially transformative second half of the year with two expected data readouts, including topline data in our Phase 3 study for systemic sclerosis this summer, followed by our Phase 2b study in cystic fibrosis. We recently announced that we completed sales of $71 million through our ATM program and entered a debt financing agreement for up to $50 million with the first $20 million already received, strengthening our balance sheet and putting us in a solid financial position before topline data.” It’s no surprise that CRBP is rated a Buy in our POWR Ratings system. It also has a grade of A for Trade Grade and Peer Grade, and a B for Buy & Hold Grade. In the 373-stock Biotech industry, it is ranked #40. GrowGeneration Corp. (GRWG) GRWG owns and operates specialty retail hydroponic and organic gardening stores. GRWG’s consensus rating is a Strong Buy with six out of six Wall Street analysts being in agreement. Analysts are quite optimistic about the prospects of GRWG, as indicated by the expected revenue growth of 113.9% for the quarter ending September 2020. The market estimates GRWG to have an EPS of $0.06, increasing 100% from its year-ago number. Moreover, GRWG’s EPS is expected to grow 20% per annum over the next five years. GRWG has gained more than 450% since its March lows and its second-quarter earnings report has been a key driver. GRWG reported a 123% increase in revenues, 166% increase in adjusted EBITDA and 136.4% increase in GAAP net income year-over-year in the second quarter. The company recently purchased the assets of Emerald City Garden and entered into a partnership with Whole Cities Foundation to donate free product for the development of urban farms across the United States. GRWG has a grade of A in Industry Rank according to our POWR Ratings system. Want More Great Investing Ideas? 7 Best ETFs for the NEXT Bull Market Beware Stocks in September? 9 “BUY THE DIP” Growth Stocks for 2020 IIPR shares were trading at $125.20 per share on Wednesday morning, up $0.13 (+0.10%). Year-to-date, IIPR has gained 69.10%, versus a 11.36% rise in the benchmark S&P 500 index during the same period."}]}