{"article": [{"url": "https://stocknews.com/news/gdx-kl-au-agi-3-gold-miners-to-buy-in-july/", "published": 1593778100.0, "headline": "3 Gold Miners To Buy in July", "body": "It’s been a strong start to the year for the Gold Miners Index (GDX), and while the majority of market participants continue to flock to the tech sector, the GDX continues to outperform year-to-date. However, it’s actually the GDX that has the more attractive long-term chart, suggesting that this is the better area currently to put long-term money to work. As we can see in the charts below, the Nasdaq-100 Index (QQQ) has not paused in several years on its yearly chart after its breakout in 2014, while the Gold Miners Index is breaking out of a multi-year base. This means that the GDX likely has a much larger runway ahead of it, and it might be wise to start sticking a few miners in one’s portfolio. Unfortunately, the sector is littered with laggards, and focusing on high margins and robust earnings growth is the key to long-term success. Below, we’ll take a look at three names that fit this bill, and one that is my top-pick in the sector. 9 \"BUY THE DIP\" Growth Stocks For 2020(Source: TC2000.com) As noted above, there are roughly 70 producers in the gold sector operating worldwide, and most of them are un-investable given that they tend to overpay for acquisitions late in the cycle, and then must take write-downs later on, leaving them with ghastly earnings trends. However, for those willing to sift through the group, there are about ten names with consistent long-term annual earnings per share [EPS] growth that pay dividends and tend to do their acquisitions early in the cycle which gives them massive leverage at higher gold prices. Three names that stand-out with these characteristics are Kirkland Lake Gold (KL), Anglogold Ashanti (AU), and Alamos Gold (AGI), and all three of these miners are currently seeing positive earnings revisions over the past few weeks. Meanwhile, all of them are expected to grow earnings by more than 45% between FY-2019 and FY-2022, and these earnings estimated are based on $1,650/oz gold prices, lower than the spot prices currently. Let’s take a look at their earnings trends below: (Source: YCharts.com, Author’s Chart) Beginning with Kirkland Lake Gold, the company has seen exponential growth since it began trading on the US Market, as annual EPS grew from $0.08 in FY-2015 to $2.70 last year. This represents over 2000% earnings growth in a less than five-year period, with annual EPS growth of just over 100% last year. Currently, we are in the midst of a lower year of growth, with annual EPS estimates currently sitting at $3.04 for FY-2020. However, the company has been actively buying back stock with a massive buyback program in place, giving them the ability to buy back up to 10% of stock. This should be a massive tailwind for earnings growth, as the lower growth we’ve seen was due to a higher share count following an acquisition, but the company has now bought most of the stock used in the acquisition which has removed the short-term higher share count headwind. Therefore, while some investors might be looking at FY-2020 annual EPS growth of barely 12% and yawning, it’s important to put in perspective that the company increased production by 70% with their acquisition, and will still see earnings growth after lapping a year of triple-digit growth. In short, the acquisition was brilliant. If we look ahead to FY-2021 annual EPS estimates, we are expected to see a return to the previous levels of robust growth, with annual EPS expected to grow by 25% in FY-2021. This figure is above the sector average’s earnings growth rate, and the company has a 1.3% dividend yield which is also industry-leading. Meanwhile, the company’s margins compare very well to the sector, with gross margins of over 50% based on all-in sustaining costs below $800/oz. Currently, the sector average all-in sustaining costs are $980/oz, meaning that Kirkland Lake Gold is earning an extra $180 per ounce produced while paying a dividend that ranks in the top 15% of the sector. However, despite this impressive investment thesis, the stock is barely 11x FY-2021 EPS at a share price of $41.00. If we subtract out the company’s $2.00 in cash, Kirkland Lake Gold is still trading at 10x FY-2021 EPS. It’s for this reason that the company is my favorite idea in the sector currently, and my most overweight position. While it might take the market a couple of months to realize this disconnect, I believe there’s easily 30% upside here for patient investors. Moving onto the next name on the list, Alamos Gold, we have one of the best growth stories in the sector, with nearly triple-digit annual EPS expected next year. Similar to Kirkland Lake Gold, Alamos has benefited significantly from an acquisition, which was the company’s decision to scoop up Richmont Mines a couple of years ago. Richmont’s Island Gold Mine is one of the highest-grade gold mines in Canada and Alamos is now working on an expansion here to increase production to above 1,200 tonnes per day, which should drive at least 20% production growth at this mine. In addition, it should increase the already high margins at Island Gold, with the mine currently producing gold below $775/oz. It’s this expansion at Island Gold as well as the lower-mine expansion at Young-Davidson that are driving the significant growth in annual EPS, which we’ll take a closer look at below: (Source: YCharts.com, Author’s Chart) As we can see in the chart above of Alamos Gold’s earnings trend, annual EPS came in at $0.21 in FY-2019, up over 300% year-over-year. However, despite lapping a year of incredible growth, the company is forecasted to grow earnings by over 70% this growth, for a 2-year stacked earnings growth rate of near 400%. Meanwhile, FY-2021 annual EPS estimates are sitting at $0.58 currently, suggesting this growth isn’t expected to slow any time soon. Based on the current share price of $9.20, the mid-cap miner is trading at a very reasonable valuation of 15.8x FY-2021 EPS, despite having one of the top 100 earnings growth rates in the US Market currently. Based on this, I see significant further upside here, and the bonus is that investors are getting a 0.9% annual dividend yield to complement this earnings growth. Therefore, I would view any dips below $9.00 on Alamos Gold as buying opportunities. (Source: Anglogold Ashanti) Last but not least, we have Anglogold Ashanti, a multi million-ounce producer with diversified gold production from the Americas, Africa, and Australia. While the stock has been less popular at higher gold prices due to its costs that are only in line with the industry average, the company’s new mine should help to increase margins, and the higher gold price is allowing for significant margin expansion. As we can see in the chart below, margins are expected to improve by nearly 1500 basis points from FY-2018 to closer to 40% based on the higher gold price. Meanwhile, Obuasi’s low costs should drag down company-wide costs with the mine expected to produce up to 400,000 ounces a year at roughly $800/oz. This is roughly $200/oz lower than the company’s current cost profile. Let’s see how this is affecting the company’s earnings trend: (Source: YCharts.com, Author’s Chart) As we can see from the chart above, Anglogold grew annual EPS by over 140% in FY-2019 to $1.80, and we’re expecting to see another year of double-digit growth in FY-2020. However, the real growth is expected to show up in FY-2021 when the company’s Obuasi Mine has fully ramped up. Based on estimates, Anglogold should see annual EPS of $3.01 in FY-2021, representing nearly 70% growth from FY-2019 levels. This places the company well above the sector average growth rate and ahead of many of the highest growth names in the market in all industries. Based on the company’s current share price of $29.00, the company is trading at less than 10x FY-2021 EPS estimates while paying a 0.4% dividend yield. Therefore, the company is dirt cheap here as long as it can execute on its plans. While many investors are rushing into tech stocks at multi-year highs at triple-digit P/E ratios, I believe there’s an opportunity in miners with similar growth rates at bargain earnings multiples on a relative basis. However, the key is owning the best, as the worst miners in the sector will find a way to cripple a portfolio regardless of what the gold price does. Based on continued earnings revisions, industry-leading margins and proven management teams, I believe KL, AGI and AU have a place in any diversified portfolio. While tech stocks can certainly continue higher, I believe miners have more upside, and especially a name like KL that has been beaten up and left for dead despite industry-leading margins. I currently own all 3 stocks, and may look to add to my positions on dips. Disclaimer: Taylor Dart is not a Registered Investment Advisor or Financial Planner. This writing is for informational purposes only. It does not constitute an offer to sell, a solicitation to buy, or a recommendation regarding any securities transaction. The information contained in this writing should not be construed as financial or investment advice on any subject matter. Taylor Dart expressly disclaims all liability in respect to actions taken based on any or all of the information on this writing. Want More Great Investing Ideas? 9 “BUY THE DIP” Growth Stocks for 2020 Is the Bull S#*t Rally FINALLY Over? 7 “Safe-Haven” Dividend Stocks for Turbulent Times Top 3 Investing Strategies for 2020 GDX shares were trading at $36.17 per share on Friday afternoon, down $0.39 (-1.07%). Year-to-date, GDX has gained 23.53%, versus a -1.99% rise in the benchmark S&P 500 index during the same period."}]}