{"article": [{"url": "https://stocknews.com/news/veev-okta-zen-3-cloud-computing-stocks-floating-to-new-highs/", "published": 1595333300.0, "headline": "3 Cloud Computing Stocks FLOATING to New Highs", "body": "Cloud computing has never been more important. Businesses across the world are turning to cloud providers to safely and quickly store, protect, and transfer information. The cloud has the potential to replace the majority of on-site servers and other computing equipment in the years ahead. The bottom line is that in-house data storage is a relic of the past after this transition to the cloud. Cloud service providers such as Veeva Systems (VEEV), Okta (OKTA) and Zendesk (ZEN) are likely to continue climbing even higher given the explosion in spending on the cloud and how important and integrated they have become to companies’ operations. Veeva Systems (VEEV) 7 Best ETFs for the NEXT Bull MarketLife science businesses are turning to cloud-based software providers and this has accelerated during the COVID-19 pandemic. VEEV provides software solutions on the cloud for these companies. Between Veeva’s customer relationship management software, content information management products, and data management tools, the company has plenty of valuable cloud-based solutions for pharmaceutical companies. VEEV is currently sitting on $1.5 billion in cash and has no debt. The company’s cash flow is more than $420 million. The POWR Ratings reveal VEEV is ranked above the other 67 stocks in the Medical – Services category. VEEV aces every single POWR Component. The top analysts have set a price target of $226.94 for the stock, which is below its current trading price. However, 12 of the 17 analysts who reviewed VEEV have a buy rating on the stock. Okta (OKTA) Every business is looking for a software tool that helps manage digital access rights. OKTA provides such solutions by way of the cloud. In short, this cloud-based software makes it easier for employers to determine the identities of those on the network. Check out OKTA’s POWR Ratings and you will find the stock has an A Peer Grade and an A Trade Grade. OKTA does not have less than a B grade in any POWR Component. The stock is ranked in the top 15 of 47 publicly traded companies in the Software – Business category. Out of the 16 analysts who have studied OKTA, 10 rates it as a Buy, six advise holding and none advise selling. Though this high-growth cloud software stock is trading slightly below its 52-week high of $224.90, it is worth your attention simply because it continues to win even more market share in the access management space. Employees will require access to a litany of cloud applications as more employers shift to the cloud. Unique credentials are necessary for each cloud application. In other words, OKTA’s services will prove quite valuable as businesses continue to segue to the cloud. Zendesk (ZEN) Wouldn’t it be nice if your business could easily manage support requests transmitted by end customers through any computer connected to the internet? ZEN provides such software-as-a-service (SaaS) solutions on the cloud. All in all, ZEN provides customer service through its groundbreaking platform in more than 40 languages, serving clients across the globe. Companies in spaces ranging from telecommunications to education, media, and business technology rely on ZEN for cloud-based support. The ZEN POWR Ratings show As in each POWR Component. ZEN is ranked in the top 10 of more than 80 stocks in the Software – Application space. ZEN’s price returns are all green but for 2016. The stock has a three-year price return of 223.05% and a five-year price return of nearly 340%. Out of the 13 analysts who have performed an in-depth review of ZEN, seven recommend buying the stock, and six recommend holding. ZEN has $819 million in cash yet nearly $500 million in debt. The company has $40 million in free cash flow. If ZEN’s sales estimates prove accurate, the stock will enjoy a 23% year-over-year growth rate, generating an adjusted operating income of around $10 million per quarter. ZEN bounced back quite nicely since the market-wide March freefall, recently surpassing its pre-COVID trading high of $90 and change. ZEN stands a good chance of returning to its 52-week high of $96.80 by year’s end. Want More Great Investing Ideas? 9 “BUY THE DIP” Growth Stocks for 2020 Newly REVISED 2020 Stock Market Outlook 7 “Safe-Haven” Dividend Stocks for Turbulent Times VEEV shares were unchanged in after-hours trading Tuesday. Year-to-date, VEEV has gained 82.71%, versus a 2.07% rise in the benchmark S&P 500 index during the same period."}]}