{"article": [{"url": "https://stocknews.com/news/azn-ko-gm-nio-azn-rcl-5-robinhood-100-stocks-to-avoid-as-investors-take-profits/", "published": 1600862900.0, "headline": "5 'Robinhood 100' Stocks to Avoid as Investors Take Profits", "body": "Looking at the Robinhood 100 is always an interesting and useful exercise. It gives an insight into retail trader sentiment. &nbsp They tend to chase stocks with high returns, tend to be interested in stocks that are in the news, and are betting on the economy quickly returning to normal. Wall Street veterans view Robinhood traders as fresh meat for good reason. Robinhood investors are notorious for their poorly-researched, and emotionally-charged trading styles. &nbsp If you are looking for stocks to short or stocks that are overvalued, it is in your interest to check out the top Robinhood holdings. Below, we shed light on five Robinhood stocks that investors should avoid. These Robinhood favorites are overvalued, possibly to the point that they should be shorted: Coca-Cola (KO), General Motors (GM), Nio (NIO), AstraZeneca (AZN), and Royal Caribbean (RCL). 7 Best ETFs for the NEXT Bull MarketCoca-Cola (KO) It is hard to believe KO is successful to the point that it has over a 40% market share of the beverage industry outside of alcoholic drinks. Though KO continues to expand its offerings with acquisitions and new creations, Robinhood traders and others have pumped up this stock to an unsustainable level. Barring a major acquisition or entry into new markets, there is no reason for a beverage company to have increased from $38 to $50 in less than six months. The POWR Ratings reveal KO has an A Trade grade, a B Peer grade, and respectable grades in the remaining POWR Components. KO is ranked third of nearly 30 stocks in the Beverages category. However, this coast does not look completely clear for KO. KO’s forward P/E ratio is slightly under 30. This is significant as the company does not operate in the tech space. A forward P/E ratio over 15-20 for a non-tech stock indicates it is likely overvalued. Though KO has hard seltzer in its pipeline, the new drink won’t be available until next year. Furthermore, there are plenty of other hard seltzer options on the market. In other words, KO has done little to justify its rapid ascent. Steer clear of this stock until profits are taken off the table. General Motors Company (GM) As one of the top automakers on the planet, GM receives plenty of investor interest. All in all, GM has slightly more than 15% of global auto sales. GM has more than doubled since the spring for little reason. GM has a C Buy & Hold grade in the POWR Ratings along with a B Peer grade. There is certainly considerable demand for used vehicles yet there is a considerable decline in demand for new vehicles. Drive by your local GM auto dealership’s lot, take stock of the inventory and you will find an abundance of offerings. This is a bad time to be a car-maker simply because consumers are struggling to pay their bills. GM recently announced it will make the trucks, batteries, and fuel cells for EV automaker Nikola. However, Nikola is now being exposed as a borderline fraud of a company. The bad news will undoubtedly spill over to GM in the days, weeks, and months ahead. Avoid this stock or short it. Nio (NIO) China’s EV market is worth watching closely considering its massive population. NIO is a leader in this industry, often dubbed as China’s Tesla. Through NIO EVs are affordable, the company does not make its automobiles. Rather, NIO contracts the work out to JAC Motors in the eastern part of the country. NIO doesn’t even have a single dealership. Rather, the company sells EVs through apps. Check out the analysts’ take on NIO at TipRanks and you will find they are bearish on this stock, setting a price target of $16.51, meaning NIO has around 15% downside from here. Furthermore, out of the eight analysts who have studied NIO, four insist it is a buy, three recommend holding, and one recommends selling. The bottom line is NIO has ascended too fast without justification. Look for this stock to pull back as investors take their profits off the table. AstraZeneca (AZN) It was only a couple weeks ago when it appeared as though AZN had made considerable progress in the race to develop a coronavirus vaccine. However, AZN had to halt vaccine trials after a participant fell ill. AZN simply cannot be trusted. Though the company has plenty of other products aside from its vaccine candidate, investors outside of the Robinhood group have primarily avoided AZN for a litany of reasons. AZN was trading around $45 to $50 before the pandemic, dipped own to $38, and is once again trading around $55 even though its vaccine appeared to be quite promising merely one month ago. The setback in AZN’s vaccine candidate should give investors serious cause for concern. There is no reason to buy this stock until the company shows its vaccine has merit. Royal Caribbean (RCL) Robinhood traders have buoyed RCL in recent weeks and months, helping it bounce back from its coronavirus trading low of $22. This is quite an interesting bull run because the virus spreads with comparable ease on cruise ships. It is clear Robinhood investors believe RCL will return to normal operations sooner rather than later. However, the medical community indicates a coronavirus vaccine is more than a year away. The RCL POWR Ratings are flat-out bad: a D overall rating, an F Industry Rank, and Buy & Hold grade along with a D trade grade. Take a look at TipRanks’ average analyst price target for RCL and you will find quite the gloomy picture: $56.69, indicating the stock will decline by nearly 8%. The bottom line is Robinhood investors’ support of RCL is unjustified. Short this stock until progress is made on the vaccine front. Want More Great Investing Ideas? 7 Best ETFs for the NEXT Bull Market Is the Stock Market Correction Over? Chart of the Day- See the Stocks Ready to Breakout AZN shares were trading at $55.98 per share on Wednesday afternoon, up $0.54 (+0.97%). Year-to-date, AZN has gained 15.41%, versus a 2.25% rise in the benchmark S&P 500 index during the same period."}]}