{"article": [{"url": "https://stocknews.com/news/pep-ko-mmm-gpc-4-dividend-aristocrat-stocks-to-buy-right-now/", "published": 1600085300.0, "headline": "4 Dividend Aristocrat Stocks to Buy RIGHT NOW!", "body": "As many companies have been cutting their dividend payments due to the pandemic, what better place to find dividend stocks than the S&P 500 Dividend Aristocrats Index? This index is comprised of companies in the S&P 500 that have a track record of increasing dividends for at least 25 consecutive years. Most of the companies on the list are well-known, large-cap blue-chips companies. Blue-chip refers to a well-established company that is a leader in its industry. You can track the index through the ProShares S&P 500 Aristocrats ETF (NOBL). This ETF is currently rated a “Strong Buy” in our POWR Ratings system. Stocks in the index typically have stable earnings, a healthy balance sheet, and a long history of profitability and growth. With recent volatility in the markets, investing in established companies that grow their dividends may provide a less risky avenue for your portfolio in the months ahead. When I look for stocks in the index that offer the best chance of growth and income, I focus on defensive stocks with healthy balance sheets: PepsiCo (PEP), Coca-Cola (KO), 3M Company (MMM), and Genuine Parts Company (GPC). 7 Best ETFs for the NEXT Bull MarketPepsiCo (PEP) PEP is one of the largest food and beverage companies, globally. The company makes, markets, and sells various brands across the beverage and snack categories, including Pepsi, Mountain Dew, Gatorade, Doritos, Lays, and Ruffles. In addition to company-owned trademarks, PEP manufactures and distributes other brands through partnerships and joint ventures with companies such as Starbucks (SBUX). The company’s snacks and foods business has proved resilient for the company during the pandemic. As more people stayed at home, consumer eating habits changed, which benefited its Frito-Lay and Quaker brands. In its most recent quarter, the company saw double-digit revenue growth for Pepsi Zero Sugar and Bubly. PEP is also seeing growth in its energy drinks category with its Rockstar energy drink. PEP has a current dividend yield of 3.0%, with a payout ratio of 79%. Its five-year average of dividend increases is 7.8%. While its cash position dropped to $9.1 billion in the second-quarter, PEP still has plenty of cash to cover its short-term debt of $6.6 billion. The stock is rated a “Strong Buy” by our POWR Ratings system. It holds grades of “A” for three out of the four components that make up the POWR Ratings. It is also the #1 ranked stock in the Beverages industry. Pepsi is a blue-chip defensive company with a strong balance sheet and stable earnings. The company should benefit long-term due to faster international growth and growth in the Frito-Lay business. Also, revenue will be aided by healthier snacks and beverages. I expect further dividend increases and share buybacks. Coca-Cola (KO) PEP’s primary competitor, KO, is the largest nonalcoholic beverage entity globally. It owns and markets some of the leading carbonated beverage brands, such as Coke, Fanta, and Sprite, and non-sparkling brands, such as Minute Maid, Georgia Coffee, and Glaceau. The company has a market share above 40% in the nonalcoholic beverage industry. KO has expanded its product lineup to include healthier alternatives such as coffee, sparkling water, and sports drinks. The company has been focused on weeding out unproductive “Zombie” brands and focusing on its successful brands. KO has 400 master brands in its product portfolio, with 50% only contributing to 2% of revenue, so cutting these products should boost revenue growth. The company’s gross margin declined by 3%, but aggressive cost-cutting helped provide a cushion to its operating margin. Due to a shift in consumer behavior towards e-commerce, KO has expanded investment into this sales channel. KO currently has a dividend yield of 3.2%, with a payout ratio of 75.4%. Its five-year dividend growth average is 4.4%. The company is highly profitable, with a profit margin of 26.8% and a return on equity of 52.6%. Also, its cash and short-term investments at the end of the second-quarter increased by 12.2%, which provides the company with plenty of liquidity to pay short-term debt. The stock is rated a “Buy” in our POWR Ratings system. It has a grade of “A” for Trade Grade, and a “B” for the remaining POWR components. The stock is also ranked #7 in the Beverages industry. Similar to PEP, KO is a defensive stock with stable earnings and a strong balance sheet. The company is poised to continue its dividend increases due to its large international presence, especially in emerging markets, which is growing faster than the rest of the world. 3M Company (MMM) MMM is a multinational conglomerate that has been in operation since 1902. The company is well-known for its research and development laboratory. It leverages its science and technology across multiple product categories. The company is organized into four business segments: safety and industrial, transportation and electronics, healthcare, and consumer. The company benefits from being a market leader in household products such as Nexcare, Post-it, Scotch, Scotch-Brite, and Scotchgard are. MMM is seeing high demand for products relating to personal safety, general cleaning, home improvement, and biopharma filtration due to the pandemic. Management has focused on restructuring and cost-cutting, which resulted in a savings of $400 million in the second quarter. The company anticipates an increase in sales of 3% to 3.5% due to the demand for respirators. MMM has a dividend yield of 3.5%, with a payout ratio of 65.3%. The company has stable earnings and revenue growth, with a profit margin of 16.4%. As of the end of June, MMM has $4.5 billion in cash, which is more than enough to cover its short-term debt of $1.5 billion. The company is rated a “Strong Buy” in our POWR Ratings system. It has “A” grades across the board of every POWR Component. It is also the #2 ranked stock in the Industrial-Machinery industry. The company has recently raised its earnings estimates for the third quarter, 2020, and 2021. Its diverse product portfolio allows it to withstand any market downturn. This is especially true in this recession as its health care segment represents 25% of revenue. Genuine Parts Company (GPC) GPC sells automotive parts and industrial components. It sells vehicle parts to commercial and retail customers through 9,800 stores worldwide. Its industrial segment, which primarily operates under the Motion Industries brand in the U.S., supplies bearings, power transmission, industrial automation, hydraulic, and pneumatic components to maintenance, repair, and OEM clients. The company has been able to expand its product offerings and geographic footprint through acquisitions. The acquisition of PartsPoint and Alliance Automotive Group has aided growth. The buyouts of Axis New England and Axis New York have bolstered its industrial segment. Its investment in Sparesbox should boost digital sales in Australasia. GPC has a dividend yield of 3.1%, with a payout ratio of 7,762.5%. The company’s average five-year dividend growth rate is 5.1%. It has a current ratio of 1.2, meaning the company can cover short-term liabilities in the event of a further downturn in the economy. The stock is rated a “Strong Buy” in our POWR Ratings system. It has a grade of “A” in three out of the four POWR components. GPC is also the #5 ranked stock in the Auto Parts industry. I like GPC’s prospects in the long-term as it is a defensive stock with a recession-resistant business in NAPA Auto Parts. Want More Great Investing Ideas? 7 Best ETFs for the NEXT Bull Market Is the Stock Market Correction Over? Chart of the Day- See the Stocks Ready to Breakout PEP shares rose $0.03 (+0.02%) in after-hours trading Monday. Year-to-date, PEP has gained 2.19%, versus a 6.24% rise in the benchmark S&P 500 index during the same period."}]}