{"article": [{"url": "https://stocknews.com/news/shll-tortoise-acquisition-soars-as-it-targets-hyliion-a-hybrid-truck/", "published": 1599134900.0, "headline": "Tortoise Acquisition Soars as it Targets Hyliion, a Hybrid Truck Powertrain Company", "body": "Shares of Tortoise Acquisition Corp. (SHLL) have been rising again, closing Wednesday’s session at $55.85. Tortoise Acquisition Corp. is moving toward entering the electric vehicle sector via purchasing Hyllion. The hybrid-truck powertrain firm’s products and rapid deployment of the cash in the SPAC merger may trigger more gains. A tortoise is slow and heavy like a truck – but Tortoise Acquisition Corp. (SHLL) shares are racing forward like a sports car. Management of the Leawood, Kansas-based firm, have wasted no time and are now moving forward to deploy the cash and merge with Hyllion – a startup that has developed a hybrid-truck powertrain. Electric vehicle makers – from Tesla (TSLA) to Workhorse (WKHS) (five reasons to rise) – have seen their shares propel higher in recent months. Shares of SHLL have hit a new record high of $58.66 on Wednesday before profit-taking came into play. 9 \"BUY THE DIP\" Growth Stocks For 2020 Tortoise Acquisition News According to a filing with the Securities and Exchanges Commission (SEC), the deal could be concluded in September. As the ticker, SHLL, hints, Tortoise is a shell company that is already public and its merger with Hyllion allows a “back-door listing.” Special Purpose Acquisition Companies (SPAC) – like Tortoise – are becoming a more common feature in the financial landscape. SHLL already advanced after stating it was looking for a play in the energy sector and has been extending its gains once entering the closely-watched and growing industry. Hyllion is set to bring its heavy truck powertrain to market after having run some two million miles of testing. The funds from the SPAC move would allow the merged firm to move forward with the hybrid Hypertruck ERX system, also pushing it onto American roads. Overall, Tortoise Acquisition Corp. is proving to be a “hare” when it comes to deploying its cash. The next move for the stock will depend on the approval of the merger. SHLL shares were trading at $49.39 per share on Thursday afternoon, down $6.46 (-11.57%). Year-to-date, SHLL has gained 396.38%, versus a 8.37% rise in the benchmark S&P 500 index during the same period."}]}