{"article": [{"url": "https://stocknews.com/news/tsla-aapl-msft-amzn-googl-how-will-tesla-perform-after-its-stock-split/", "published": 1598875700.0, "headline": "How Will Tesla Perform after Its Stock Split?", "body": "After the market closed on Friday, Tesla’s (TSLA) split its shares 5 for 1. The stock opened at $444.61 this morning and is currently up over 12% for the day. This was the first stock split for the company. TSLA has been on fire this year and is now up 495% year to date. Its price had gone all the way up to $2,213.40 as of Friday’s close. The split occurred on the same day Apple (AAPL) had its own 4-to-1 stock split. AAPL is currently up over 5% for the day. A stock split occurs when a company’s board of directors votes to increase the number of outstanding shares for a company by issuing more shares to current shareholders. For instance, if a company had 1 million shares outstanding before the split, it will have 5 million shares outstanding after a 5-for-1 split. The stock’s price is also affected. The same multiple will reduce its price that its shares increase. If a stock is $100 per share before a split, it will be reduced to $20 a share after a 5-for-1 split. 9 \"BUY THE DIP\" Growth Stocks For 2020Companies typically split their shares to increase liquidity and make their shares more affordable to all investors. Back in May, TSLA CEO, Elon Musk tweeted that TSLA’s stock price was too high. Now the question is, where will TSLA go from here? We already know it’s up 12% today, but what about the next few months? While we can’t see into the future, we can look at the past performance of other large companies that split its stock. Here are the post-split performance histories for Apple (AAPL), Microsoft (MSFT), Amazon (AMZN), and Alphabet (GOOGL). Apple (AAPL) AAPL has had five splits in its history, including today’s stock split. The first split took place on June 16, 1987. This was a 2-for-1 split. Over the next three months, the stock was up 24.9%. That’s quite the bounce, so let’s take a look at the rest of its splits. The company’s second split was a 2-for-1 split on June 21, 2000. The stock was up 1.9% over the next three months. The next split was on February 28, 2005, and this was another 2-for-1 split. After this split, the stock was down 11.4% over the next three months. The final split before today was on June 9, 2014. This was a 7-for-1 split. The stock was up 5.1% over the next three months. Out of four previous stock splits, AAPL stock was up three times with an average three-month gain of 5.1% post stock split. Microsoft (MSFT) MSFT has had nine stock splits over its history. Its first stock split was on September 21, 1987, a 2-for-1 split. The stock lost 3.7% over the next three months. Its next stock split took place on April 16, 1990; this resulted in 30.5% over the next three months. The company’s third split, a 3-for-2 split, was on June 27, 1991. The stock returned 29.8% over the next three months. Its fourth stock split, another 3-for-2 on June 15, 1992, resulted in 7.3% over the next three months. Its fifth stock split was on May 23, 1994. It returned 9.8% in the following three months. The next four stock splits occurred on December 9, 1996, February 23, 1998, March 29, 1999, and February 18, 2003. Its returns over the next three months were, 22.3%, 2.5%, -4.7%, and -0.1%. Out of nine stock splits, MSFT returned a three-month positive return six times. The average three-month gain was 10.4. Amazon (AMZN) AMZN has only had three stock splits in its history. The first one, a 2-for-1 split, was on June 2, 1998. This was followed by a whopping three-month return of 101.1%. The second split was on January 5, 1999, a 3-for-1 split. The stock returned another huge three-month return of 49.8%. AMZN’s last stock split took place on September 2, 1999. This resulted in a three-month return of 62.9%. After every single stock split, AMZN returns a positive three-month return, with an average gain of 71.3%. Alphabet (GOOGL) GOOGL has an interesting stock split history. Before April 2, 2014, there was only one class of Google shares (GOOG). On April 2, 2014, the stock split created two classes of shares. The company distributed one share of nonvoting stock for every share of voting stock that shareholders owned. This was considered controversial at the time because it created a new share class with reduced voting privileges instead of issuing new stock. That was to ensure that the company’s founders, Larry Page and Sergey Brin, retained the company’s voting control. Since April 2, 1994, class A shares (GOOGL) are voting shares, while class C shares (GOOG) are non voting shares. The stock was up 2.7% after the split. Conclusion Out of seventeen stock splits between the four companies, there were positive three-month returns thirteen times, with an average return of 19.5%. It would appear that in this educational, yet limited research, stock splits have had a positive impact on large companies’ performance. This doesn’t tell us that TSLA will return 19.5% over the next three months, but the probability of the stock posting a positive three-month performance is fairly high. Another factor is at play here as well. There is a strong probability of TSLA joining the S&P 500, as it recently cleared a hurdle to join the index by reporting its fourth straight quarterly GAAP profit. Once the stock is in the index, it will end up in all the index mutual funds and ETFs that track the S&P 500 and any actively managed mutual funds that strive to keep up with the S&P 500. This only furthers the chance of a strong three-month return for the stock. Want More Great Investing Ideas? 7 Best ETFs for the NEXT Bull Market Beware Stocks in September? 9 “BUY THE DIP” Growth Stocks for 2020 TSLA shares were trading at $502.75 per share on Monday afternoon, up $60.07 (+13.57%). Year-to-date, TSLA has gained 20.18%, versus a 9.65% rise in the benchmark S&P 500 index during the same period."}]}