{"article": [{"url": "https://stocknews.com/news/acb-iipr-gwph-marijuana-stocks-weekly-recap/", "published": 1593778100.0, "headline": "Marijuana Stocks Weekly Recap", "body": "This week was another disappointing week for cannabis stocks as their momentum continued to fade, despite the optimism in the broader stock market. The ETFMG Alternative Harvest ETF (MJ) traded down about 2% this week and the Horizons Marijuana Life Sciences Index ETF (HMMJ) was down about 6%. Aurora Cannabis (ACB) continues to slide as Terry Booth leaves the board 9 \"BUY THE DIP\" Growth Stocks For 2020ACB could not hold on to support at $13 as the stock continued to lose momentum. The company announced that co-founder and former CEO Terry Booth gave up his seat on the board of directors this past Friday. Although Terry Booth was one of the founding fathers of ACB, many retail investors had blamed him for his carelessness when it came to acquisitions and share dilution. I view Terry Booth’s departures as a step in the right direction but there is still lots of work ahead for ACB. Investors are still patiently waiting on the announcement of a new CEO and if the company can not provide the market with some substantial news then the stock could continue to fall. Innovative Industrial Properties (IIPR) raises additional capital to fund its expansion As IIPR continues to build its extensive portfolio of real estate assets all across the United States, the company needed to raise additional capital yet again. On Tuesday, June 30th, IIPR announced the upsizing and pricing of an underwritten public offering of 2,683,363 shares of its common stock at $83.85 per share. This provides gross proceeds of approximately $225.0 million. The offering is expected to close on July 2nd, 2020, subject to customary closing conditions. The company has also granted the underwriters a 30-day option to purchase up to an additional 402,504 shares of its common stock. The company is selling all of these shares. The company intends to use the net proceeds from this offering to invest in specialized industrial real estate assets that support the regulated cannabis cultivation and processing industry consistent with its investment strategy and general corporate purposes. BTIG LLC is acting as sole book-running manager for the offering; Roth Capital Partners, Compass Point Research & Trading, LLC and Ladenburg Thalmann & Co. Inc. (OTC:LTSA) are acting as co-lead managers for the offering. GW Pharmaceuticals (GWPH) presents Nabiximols U.S. development and commercial strategy GWPH announced this week that the Company would unveil its strategy for bringing its pipeline product nabiximols to the U.S. market. This strategy includes multiple opportunities for the submission of an Initial New Drug Application (NDA) to the U.S. Food and Drug Administration (FDA), starting as early as 2021. GW will host a webcast to provide insight into the U.S. Phase 3 clinical program and commercial opportunity for nabiximols. Justin Gover, GWPH’s Chief Executive Officer said, “We are excited to present the details of our clinical program and regulatory strategy for nabiximols, which we believe support the potential for a substantial near-term commercial opportunity in the U.S. Following constructive meetings with the FDA, we are now commencing a Phase 3 clinical program that provides multiple opportunities for an NDA submission, including as early as 2021. Beyond the initial target indication of MS spasticity, our Phase 3 clinical program is designed to achieve a broad spasticity label over time. This development strategy, together with the long-term exclusivity potential of nabiximols, provides GW with confidence that this product should represent a significant value driver for GW.” Want More Great Investing Ideas? 9 “BUY THE DIP” Growth Stocks for 2020 Is the Bull S#*t Rally FINALLY Over? 7 “Safe-Haven” Dividend Stocks for Turbulent Times Top 3 Investing Strategies for 2020 ACB shares were trading at $12.27 per share on Friday afternoon, down $0.00 (0.00%). Year-to-date, ACB has declined -52.66%, versus a -1.99% rise in the benchmark S&P 500 index during the same period."}]}