{"article": [{"url": "https://stocknews.com/news/v-pypl-bac-gs-4-financial-stocks-to-bank-on/", "published": 1598357300.0, "headline": "4 Financial Stocks to BANK On", "body": "Aside from energy, no other sector has performed so poorly. The Financial Select Sector ETF (XLF) is down almost 19% year to day, while the SPDR 500 (SPY) is up over 6%. As many people lost jobs and small companies struggled, the risk profile of bank stocks went up considerably. Banks are now exposed to credit losses and solvency issues. That’s not to mention the pressure on interest margins from the Federal Reserve cutting interest rates so low. These factors have led to investor concern for the profitability potential for financial stocks. Despite the overall sector being bearish, the pandemic turned out to be less of a headwind than expected for some financial stocks. A few companies within the consumer financial services and the investment banking services industries have significantly recovered from their March lows primarily due to their strong earnings momentum. Visa Inc. (V), PayPal Holdings, Inc. (PYPL), Bank of America Corporation (BAC) and Goldman Sachs Group, Inc. (GS) have been able to perform better than their peers. 7 Best ETFs for the NEXT Bull MarketVisa Inc. (V) V is a global payments technology company enabling people to use digital currency. The company facilitates commerce through the transfer of value and information. It operates VisaNet, a processing network that enables settlement of payment transactions. In addition, the company offers card products, as well as value-added services. With the recent consumer shift to digital commerce and social distancing, V recently concluded that 67% of small businesses and 78% of overall consumers worldwide have adopted new behaviors like contactless and/or online payments for groceries, pick-ups and shopping to adjust to the pandemic. This change in consumer behavior has benefited the company. V reported net revenue of $4.8 billion for its fiscal third quarter ending in June. Gross margins came in 80.5% as the total volume of payments and cash transactions for the US Visa Debit program grew 6.8% year-over-year to $667 billion. Free cash flow for the firm grew 127% to $2.8 billion, while the cash flow from operations grew 105% quarter-over-quarter, to $3 billion. EPS for the quarter came in $1.07, beating the consensus estimate by 3.9%. The company also declared a dividend of $0.30 for the quarter, implying a 20% increase year-over-year. Moreover, V’s annual dividend aggregates to a yield of 0.61%. The street expects EPS to grow 16.2% next year. V closed yesterday’s trading session at $206.41, with a year-to-date gain of 9.9%. The stock is presently trading at 3.6% discount from its 52-week high of $214.17. How does V stack up for POWR Ratings? A for Trade Grade A for Buy & Hold Grade A for Peer Grade A for Industry Rank A for Overall POWR Rating. You can’t ask for better. It is ranked #1 in the 45-stock Consumer Financial Services industry. PayPal Holdings, Inc. (PYPL) PYPL is a digital payment operating technology platform. It has over 346 million active users globally and is available in more than 200 markets around the world, enabling consumers and merchants to receive money in more than 100 currencies, withdraw funds in 56 currencies, and hold balances in their PayPal accounts in 25 currencies. Rising to “new normal,” PYPL rolled out a QR code payment system into its point-of-sale systems. This new feature enabled touch-free, one-time scan, quick and safe transactions. Additionally, the company waived off its standard seller transaction fees in efforts to assist customers amid the pandemic. PYPL added more than 21.3 million new accounts in the second quarter of 2020, up 137% year-over-year. The company also witnessed a total payment volume (TPV) of $222 billion, the highest TPV generated in any quarter in the company’s history. Free cash flow came in at $2.19 billion, or 42% of the revenue, which is a 112% increase from the comparable quarter last year. In order to strengthen its liquidity, the company issued $4 billion worth of senior notes in the preceding quarter. PYPL is expecting to grow its revenue by 22.7% in the current quarter and is expecting to add close to 70 million active users by the end of this financial year. PYPL’s EPS is expected to grow 21.7% next year. PYPL closed yesterday’s trading session at $198.88. Year-to-date, the stock has gained more than 83.9%, and could witness further upside. It is currently trading at a 2.6% discount from it’s all-time high of $204.23. PYPL’s strong momentum is reflected in its POWR Ratings, it has a Strong Buy rating with a grade of A in Trade Grade, Buy & Hold Grade, Peer Grade, and Industry Rank. Within the Consumer Financial Services industry, it’s ranked #3 out of 45 stocks. Bank of America Corporation (BAC) BAC operates in five segments: Consumer & Business Banking, Consumer Real Estate Services, Global Wealth & Investment Management, Global Banking, and Global Markets. BAC has managed to control its non-interest expenses in the preceding two quarters by focusing on mobile banking solutions and closing some of its physical branches. Moreover, the Oracle of Omaha, Warren Buffett has recently purchased more than 85 million shares of BAC, adding to his already sizable stake in the company. The company reported impressive second-quarter results, delivering $22.3 billion in revenues. Investment banking fees surged 65% year-over-year as equity and debt underwriting fees jumped 140% and 55%, respectively. Sales and trading revenues (excluding DVA) grew 35% compared to the year-ago quarter. EPS for the quarter came in at $0.37, beating the consensus estimate by 37%. The company also declared a dividend of $0.18, which translates into a dividend yield of 2.8%. Furthermore, the street expects the company’s EPS to grow 35% next year. BAC closed yesterday’s trading session at $25.69 by recovering more than 43% from its March lows. The stock is trading at 28% discount from its 52-week high. According to the POWR Ratings, BAC has a grade of A for Peer Grade. It is ranked #3 out of 10 Money Center Banks stocks. Goldman Sachs Group, Inc. (GS) GS operates through four segments: Investment Banking, Institutional Client Services, Investing & Lending, and Investment Management. The company has recently launched its Marcus savings and lending platform with the Apple Card. Furthermore, in efforts to strengthen its consumer banking business, GS has placed a bid to invest in General Motors Company’s (GM) credit card unit. GS had an excellent second quarter as the company reported its second-highest quarterly revenue ever. Revenue for the quarter came in $13.3 billion, growing 41% year-over-year. The investment banking segment generated an all-time high $2.66 billion in revenue due to strong equity and debt underwriting. Fixed Income, Currency and Commodities (FICC) generated revenues of $4.24 billion, its highest quarterly performance in nine years, reflecting continued strong client activity in intermediation and financing. EPS for the quarter came in at $6.26, beating the consensus estimate by 65.6%. The company also declared a dividend of $1.25 for the quarter. The current dividend translates into a yield of 2.41%. Moreover, GS has put aside $650 million as provisions to make good for credit losses, if any. The street estimates EPS to grow 26.6% next year.GS ended yesterday’s trading session at $207.34, 17% discount from its 52-week high of $250.46. The stock is rated a Buy in our POWR Ratings system, with a grade of B in Trade Grade and Industry Rank. Out of 27 stocks in the Investment Brokerage industry, GS is rated #7. Want More Great Investing Ideas? The Best of StockNews 2 Step Process to Sell @ Market Top in September 9 “BUY THE DIP” Growth Stocks for 2020 V shares were trading at $207.79 per share on Tuesday afternoon, up $1.38 (+0.67%). Year-to-date, V has gained 11.10%, versus a 8.01% rise in the benchmark S&P 500 index during the same period."}]}