{"article": [{"url": "https://stocknews.com/news/vlo-valero-offers-enticing-long-term-opportunity/", "published": 1595246900.0, "headline": "Valero Offers ENTICING Long-Term Opportunity", "body": "Crack spreads remain weak- A sign of fragile demand for oil products The processing spreads are a real-time indicator for refinery earnings VLO shares are inexpensive- An attractive dividend and an excellent earnings record Energy shares have been the red-headed stepchildren of the stock market over the past years. Shares of oil-producing and oil services companies have not offered investors a significant upside. Many of the smaller companies in this sector took on mountains of debt and face prices that make servicing the loans impossible. The number of bankruptcies is likely to continue to rise over the coming months. Oil refineries do not have direct exposure to the price of the crude oil that is the main ingredient in the processing of the energy commodity into gasoline and distillate products. They purchase the oil at market prices. Simultaneously, they are not exposed to the products’ prices, as they sell them at the market price. Instead, it is the differential between crude oil and products, or crack spreads, that determine the oil refining companies’ earnings. Refineries crack crude oil into products through a capital-intensive process that heats and processes the oil into gasoline and distillates. Valero Energy Corporation (VLO) is a leading refiner of crude oil. VLO shares remain at a bargain-basement price at the end of last week. Crack spreads remain weak- A sign of fragile demand for oil products 7 Best ETFs for the NEXT Bull MarketThe price action in crude oil crack spreads continues to point to weak demand compared to recent years. As the number of coronavirus cases increases in the US, uncertainty is causing caution when it comes to the demand for oil products. Source: CQG The weekly chart of the gasoline crack spread shows that at below $11 per barrel, the processing spread is significantly lower than where it was trading in mid-July 2018 and 2019. Two years ago, the range in the spread was from $15.96 50 $17.70 per barrel. Last year, it traded between $20.95 and $22.95. Source: CQG The distillate refining spread chart shows that at $10.53 per barrel at the end of last week, the crack spread was substantially below the levels in 2018 and 2019. In mid-July 2018, it traded in a range from $17.51 to $19.48, and last year the band was from $22.09 to $23.95 per barrel. The bottom line is that weakness in the crack spreads is a sign of weak demand for oil products, and the primary input, which is crude oil. The processing spreads are a real-time indicator for refinery earnings The level of crack spreads means that refiners are suffering from lower margins for processing crude oil into gasoline and distillate products like heating oil, diesel, and jet fuels. While gasoline is a seasonal oil product that tends to experience price appreciation during the late spring and summer months, distillates are year-round fuels. Heating oil is a proxy for the other distillate because of the similar chemical composition. Since independent refineries take the risk of the margin between crude oil and oil products, the crack spreads serve as a real-time indicator of their profitability. In 2020, the level of the processing spreads results in lower earnings than over the past two years. VLO shares are inexpensive – An attractive dividend and an excellent earnings record Valero Energy Corporation (VLO) is the world’s largest independent oil refining company. VLO has fifteen refineries in the US, Canada, and the UK with a combined capacity of approximately 2.9 million barrels per day. Valero has a market cap of over $22.6 billion. VLO trades an average of 4.78 million shares each day. At $55.47 per share, the company pays shareholders a 7.07% dividend. Source: Barchart In mid-July 2018, VLO was trading at a low of $108.15 per share. At the same time in 2019, the shares were at a low of $81.98. At the $55.47 per share level at the end of last week, VLO shares are inexpensive. Source: Yahoo Finance The company has an excellent earnings record as it exceeded consensus analyst estimates over the past four consecutive quarters. In Q1 2020, VLO reported an EPS of 34 cents compared to estimates of a 15 cents loss. In the challenging second quarter of this year, the consensus projections are for VLO to lose $1.30 per share. The company will report its earnings on July 30. I am a buyer of VLO on a scale-down basis, but I will leave room to add to the long position on further weakness. During the height of the risk-off period in March, the stock reached its lowest level since 2012 when it traded at $31 per share. VLO is an inexpensive stock at the $55.47 level. I believe the stock will be trading at a far higher level next year at this time. Want More Great Investing Ideas? 9 “BUY THE DIP” Growth Stocks for 2020 Newly REVISED 2020 Stock Market Outlook 7 “Safe-Haven” Dividend Stocks for Turbulent Times VLO shares were trading at $55.94 per share on Monday morning, up $0.47 (+0.85%). Year-to-date, VLO has declined -38.62%, versus a 0.87% rise in the benchmark S&P 500 index during the same period."}]}