{"article": [{"url": "https://stocknews.com/news/apd-alb-smg-ff-4-chemical-stocks-outpacing-the-industry/", "published": 1596197300.0, "headline": "4 Chemical Stocks OUTPACING the Industry", "body": "Chemical companies convert raw materials such as oil, natural gas, air, and minerals into more than 70,000 different products. As of 2018, the chemical industry constituted almost 15% of the US manufacturing sector. Chemical companies play an essential part in our everyday life. They are essential in the preservation and flavoring of food, they’re used to make plastic, fertilizers and pesticides, and found in soaps and deodorants. However, the industry has not been performing well this year due to a downward trend in demand in the wake of the coronavirus outbreak and a short supply of raw materials. The Dow Jones Chemicals Titans 30 Index is down 4% for the year. 9 \"BUY THE DIP\" Growth Stocks For 2020But four chemical stocks have bucked this trend. Air Products and Chemicals (APD), Albemarle Corporation (ALB), The Scotts Miracle-Gro Company (SMG), and FutureFuel (FF) have all outpaced their industry peers. Air Products and Chemicals, Inc. (APD) APD focuses on manufacturing and marketing industrial gases. Apart from industrial gases, the company provides related equipment. APD has recently entered into a deal with ACWA Power worth $5 billion to manufacture green ammonia. This move will likely solidify APD’s position as a leader in the industrial gas space. The company also recently acquired five plants for producing hydrogen. This expansion is expected to drive further growth for the company through the remainder of 2020 and beyond. The stock has returned more than 20% year to date, compared to the benchmark Dow Jones U.S. Chemicals Index’s loss of 4.27% for the same period. For the quarter ending June 30th, APD delivered a positive earnings surprise of 1%. Revenue for the quarter declined 10% year over year, primarily because of the pandemic. How does APD stack up for the POWR Ratings? A for Trade Grade A for Buy & Hold Grade A for Peer Grade B for Industry Rank A for overall POWR Rating You can’t ask for better. The stock is also ranked #1 out of 68 stocks in the Chemicals industry. Albemarle Corporation (ALB) ALB manufactures, develops, and sells high-value chemical products such as lithium and lithium compounds, bromine, catalysts, and so on. Future prospects of the company look good as the demand for battery-grade lithium is expected to rise due to their application in electric cars. So far this year, the stock gained more than 10%, outperforming the benchmark Dow Jones U.S. Chemical Index. For the quarter ending March 31st, ALB saw an increase in cash from operations of $100.1 million, taking the total to $155.1 million. This could grant the company financial flexibility to meet the challenges caused by the COVID-19 pandemic. For the same quarter, ALB delivered a positive earnings surprise of 20.5%. Also, ALB’s EPS is expected to grow 15% annually over the next five years. It’s no surprise that ALB is rated “Buy” in our POWR Ratings system. It also has an “A” for Trade Grade. In the 68-stock Chemicals industry, it is ranked #12. The Scotts Miracle-Gro Company (SMG) SMG develops, manufactures, and sells consumer-grade lawn products and garden care products. Increased gardening activity, particularly indoor gardening, with people staying at home due to the pandemic, has improved the demand for the company’s products. For the quarter ending June 30th, the company reported a 28% year-over-year increase in overall sales while the sales of its subsidiary Hawthorne grew by a massive 72%. The board of directors also approved a $5 per share special dividend for investors. SMG’s earnings surprise history is impressive as well, with the stock beating consensus EPS estimates in three of the trailing four quarters. SMG returned more than 45% year to date. SMG’s strong fundamentals are reflected in its POWR Ratings. It has a “Strong Buy” rating with an “A” in Trade Grade, Buy & Hold Grade, and Industry Rank. Within the Home Improvement & Goods industry, it’s ranked #7 out of 66 stocks. FutureFuel Corp. (FF) FF develops and sells a diverse range of chemical, biochemical, and specialty chemical products in the United States and internationally. The company also produces and markets bio-diesel. FF declared a special dividend of $3 per share in April due to its better-than-expected performance in the first quarter. For the quarter ending March 31st, FF saw a year-over-year rise in revenue of 9.4%. Adjusted EBITDA also increased to $10.2 million from $5.4 million a year ago. A solid earnings report and rising demand for its products helped FF gain more than 40% year to date, outperforming the benchmark Dow Jones US Chemical Index. It’s no surprise that FF is rated “Buy” in our POWR Ratings system. It also has an “A” for Trade Grade and a “B” for Buy & Hold Grade, Peer Grade, and Industry Rank. In the 68-stock Chemicals industry, it is ranked #23. Want More Great Investing Ideas? 9 “BUY THE DIP” Growth Stocks for 2020 How HIGH Can This Tech Bubble Fly? 7 “Safe-Haven” Dividend Stocks for Turbulent Times APD shares were unchanged in after-hours trading Friday. Year-to-date, APD has gained 23.47%, versus a 2.49% rise in the benchmark S&P 500 index during the same period."}]}