{"article": [{"url": "https://stocknews.com/news/spy-inx-dia-qqq-tsla-welcome-to-the-tech-bubble-2-0/", "published": 1595419700.0, "headline": "Welcome to the Tech Bubble 2.0", "body": "(Please enjoy this updated version of this week’s commentary from the Reitmeister Total Return newsletter). Yes, we have long suspected this market was acting like a bubble. Especially for tech stocks that have benefited from the onset of the Coronavirus. The action this past month more than confirms that is the case as stocks separate even further from economic reality. And this past Monday’s surge higher for the group is just icing on the cake. 9 \"BUY THE DIP\" Growth Stocks For 2020The main problem with a bubble is that it is disconnected from reality. So most of the commentary today will sound quite off as I point out all the continuing problems in the economy that SHOULD lead to lower stock prices. I am guessing you have noticed how often I say “SHOULD” in my commentary. And yes it is on purpose so I can emphasize how investors normally react to a recession (and potentially depression) with lower stock prices. And yet here we are just a stone’s throw away from the all-time highs at 3,393. So I want to remind people of what is normal…and thus what SHOULD happen. But since it is not happening we need to discuss why…and adjust our game plan as we did today. MOST IMPORTANTLY…we will never lose sight of what reality is. So what is reality Reity? That we are in the midst of a horrifying economic event that WILL continue a lot longer and IS creating lower corporate earnings (Q2 early results = -44% year over year decline )and SHOULD correspond with a bear market and lower stock prices. And thus for that not to happen means we are dealing with some kind of mania. aka Stock Bubble. And more specifically this time around Tech Bubble 2.0 (plus Tesla and Beyond Meat and a few other beloved growth cronies that are BEYOND their reasonable valuations). Just like the tech bubble of the late 1990’s investors tell themselves that the rise in price is warranted because of the growth. And indeed many of the tech stocks in play have seen increased growth as we are all forced to do more work from home…and more leisure from home. So the problem is not the direction of these unique stocks given the growth. It is how far disconnected from their actual growth they have become. Let’s take Tesla. Yes, it is the best car company in the world. And yes, they are growing even in the face of the coronavirus. But right now they are expected to earn only $5 per share. That means TSLA is sporting a PE of 320. But Reity, they are supposed to earn $12 next year. Oh, yes, that is much better. The forward looking PE is a very tame 133 (he says sarcastically). And let’s not forget that Tesla has announced big earnings misses 50% of the time the last few years. So the expected EPS of $12 is far from certain. Now let’s compare that valuation to the forward looking 6.5 PE for General Motors. And yes, I understand that General Motors is a dinosaur. But the spread between the two should not be so easily overlooked because car companies have always had lower valuations given their cyclical nature. At best Tesla should have a PE of 50…and even that seems a bit insane. This same type of thing is happening with many other “in favor” stocks. And that is sign of a bubble. And so this morning we made moves today to better align with the bubble. The key is that we never lose sight that it is a bubble which will help us get out near the top before it blows up in our faces as it will for the VAST majority of investors. So back to the reality of the current economic situation… Industrial Production +5.4% is the headline read from last Wednesday. But that is the month over month numbers. The year over year view is still -11.2%. Again, that is still VERY recessionary and folks are still not reading the economic data correction. Friday’s Consumer Sentiment is one of the most interesting reports recently. The Current Conditions reading is still low at 84.2 (below 100 is typically bad for the economy and thus 84 is BEYOND bad). But the future expectations component collapsed to 66.2 given the recent spiking of the virus. Consumer Sentiment tells you the mood of the consumer and likely future spending habits. This is a very grim outlook indeed. The above correlates with the continued weakness found in the Redbook Weekly Retail sales report from this morning. If this was really a V shaped recovery then the #s would keep getting better and better. Yet this weeks -7.5% year over year showing is the worst showing in 5 weeks. (Note the best showing was still an anemic -5.5%). So the optimistic view that the economy will keep improving as the economy reopens may not be holding true (says the guy who told you it wouldn’t be so rosy). Pulling back to the big picture of GDP we are getting to the end of the line on the data points that would go into Q2 estimate models. There we see that the most famous such model, GDPNow from the Atlanta Fed, is still at a very sad -34.7%. Even worse than that is news that corporate tax receipts to the government are down 92%. Combine that shocking drop with the increase in stimulus = debt beyond belief = another one of the reasons that gold is on the rise. And yes, does create a potential debt crisis for the US, and many other nations, down the road. Heck, that might not be in our lifetime if we are lucky. But luck begins to run out when you NEVER pay down the debt. So just keep this idea tucked away in the back of your mind so you can react quickly when the time comes. The above information about 92% drop in corporate tax receipts was just one noteworthy excerpt of many from this weeks newsletter from John Mauldin. Another great read as he goes in depth on the misery felt by small business owners plus how the widely used employment data does not show the full picture of the still worsening job outlook. Give this a thorough read when you have the time: Small Business Blues. CNBC today had a good piece that connects well with the above pointing out that in several states the employment #s continue to get worse after a brief improvement. And yes it has a lot to do with spikes in coronavirus cases leading to further economic malaise. Get the full scoop here. Hey, remember last summer when the first whiff of China trade concerns led to a 10% market correction? Well, we may all be too focused on the Coronavirus to notice that a new round of the trade war may already be underway. And if it does escalate, then yet another concern for the market to digest. Here is the editorial piece that spells it out. That is enough for today. To sum it up it the economy continues to be in the midst of a category 5 storm while investors are acting like its all rainbows and lollipops. We know what SHOULD happen. But signs of a stock market bubble, especially for tech stocks, may last for a while longer. That is why we added 2 technology ETFs to the portfolio this week (tickers reserved for Reitmeister Total Return members.) Portfolio Update As stated over and over again, much of this rally is an illusion in a small group of in favor stocks. Under the surface it has been risk off in many ways which is why our conservatively built hedge has done surprisingly well. In fact, we have gained +5.2% the last four weeks topping the S&P at +4.2%. What to Do Next? I know its crazy out there. And I am trying my best to help investors make sense and profit from the situation. The best way for me to do that is give you 30 days access to the Reitmeister Total Return. This is my newsletter service where I share more frequent commentaries on the market outlook, trading strategy, and yes, a portfolio of hand selected stocks and ETFs to produce profits whether we have a bull…a bear…or anywhere in between. And right now I continue to strongly believe bear makes a lot more sense than bull as the year progresses. Yet at the same time one has to give a nod to the bubble that is occurring for a select group of stocks. The solution is a unique portfolio I have constructed that provides protection against the bear when it reawakens from hibernation. While at the same time leans into some of the stocks that are benefiting the most from the current bubble. That explains how we continue to top the market at this time. Just click the link below to see all 11 stocks and ETFs in this uniquely successful portfolio. Plus get ongoing commentary and trades to adjust your strategy as 2020 continues to the wildest market in history. Gladly it can be tamed. About Reitmeister Total Return newsletter & 30 Day Trial Wishing you a world of investment success! Steve Reitmeister …but everyone calls me Reity (pronounced “Righty”) CEO, Stock News Network and Editor, Reitmeister Total Return SPY shares were trading at $326.86 per share on Wednesday afternoon, up $1.85 (+0.57%). Year-to-date, SPY has gained 2.60%, versus a % rise in the benchmark S&P 500 index during the same period."}]}