{"article": [{"url": "https://stocknews.com/news/gold-kl-kgc-gdx-gld-three-gold-miners-to-buy-on-weakness/", "published": 1600862900.0, "headline": "3 Gold Miners To Buy On Any WEAKNESS", "body": "It’s been a rough few weeks for gold investors (GLD) as the metal has slid more than 10% from its August all-time highs, dragging the Gold Miners Index (GDX) down with it. However, while this much-needed reset in the precious metals space is beginning to wash out bullish sentiment, we’ve seen minimal technical damage to gold or the miners. More than 90% of miners are still sitting atop their 200-day moving averages, and the metal is also pulling back above its key moving average. Generally, the best time to go shopping is when many are throwing in the towel, and it looks like we’re finally nearing this juncture for the GDX. For patient investors that have been waiting to buy, there are three miners whose dividend yields and valuations continue to get more attractive. 7 \"SAFE HAVEN\" Dividend Stocks for Turbulent TimesBelow, we’ll discuss which three these are, and why they should be at the top of one’s shopping list. (Source: TC2000.com) While most high-growth stocks with 30% plus earnings growth trade at massive premiums and above 30 times earnings, the more gold sector often trades at a significant discount due to its cyclical nature. However, if we are in the early innings of a new bull market in gold, there is no reason for stocks to trade at significant cyclical discounts. The outperformance of Gold vs. the S&P-500 (SPY) would suggest that miners should be in higher demand, but this isn’t the case at all. As shown below, Barrick Gold (GOLD), Kinross Gold (KGC), and Kirkland Lake Gold (KL) are trading at an average forward P/E ratio of 18.45, with an average dividend yield of above 0.90%. This is even though these three companies have average annual EPS growth rates for FY2020 of 68% based on current estimates. Let’s take a closer look at the three companies below: (Source: YCharts.com) Beginning with Barrick Gold, the company recently received its stamp of approval from the Oracle of Omaha, with Warren Buffett announcing a stake in the miner in Q3. The stock has had one of the least impressive earnings trends over the past decade, but a CEO shake-up with Mark Bristow (ex Randgold CEO) taking over and focusing on higher productivity assets has led to an earnings breakout in FY2020. As the chart below shows, annual EPS estimates are projecting 104% growth this year, and a new multi-year high. This is a very bullish development, as earnings breakouts suggest a change in the business for the better, with annual EPS consolidating for years and finally resuming higher. (Source: YCharts.com, Author’s Chart) Given the power of this breakout with triple-digit earnings growth, it is likely that the stock will be a top-pick among growth funds. This is because Barrick is enjoying 50% plus margins, market-leading earnings growth, and a bonus of steady dividend increases as the company’s debt levels improve. In the most recent quarterly report, the company increased its dividend to $0.08 per share quarterly, translating to a forward dividend yield of 1.14%. Given that the company should be debt-free by this time next year, I would expect either share buy-backs or increased dividends, which should reward shareholders even further. With Barrick sitting 12% from its highs and giving back most of its gains since the Buffett bounce, this is an attractive entry for investors near $28.00. The second name on the list is Kinross Gold, a multi million-ounce gold producer with operations across nearly all continents. While the company has previously been shunned due to not paying a dividend and having higher costs, the team has begun to turn things around since 2018 and announced their first dividend in nearly a decade last week. The dividend of $0.03 per share quarterly translates to a forward dividend yield of over 1.3% at the current share price, but the real story for Kinross is the growth. (Source: YCharts.com, Author’s Chart) As we can see from the company’s earnings trend above, we saw an earnings breakout last year with 240% annual EPS growth ($0.34 vs. $0.10), and annual EPS is expected to grow at 76% this year. This is exceptional given that the company is lapping a year of massive growth, and we should see continued growth into FY2021, with current estimates sitting at $0.68. While Kinross doesn’t benefit from the Tier-1 jurisdictions that KL and GOLD do, the company is trading at a very reasonable 13x FY2021 earnings ($9.00 / $0.68), and I believe the estimates are on the conservative side. Rarely are investors able to buy a robust double-digit growth company for below 20x earnings, and I think Kinross should see a re-rating as it increases its dividend to $0.15 per share over the next year. Therefore, at $9.00 per share, I see this as an attractive entry point for a starter position in the stock. The last name on the list is Kirkland Lake Gold, one of the lowest-cost producers in the sector with margins of over $1,000/oz at current gold prices. The company has been aggressively buying back its stock this year, with over 10 million shares purchased year-to-date, and I would expect this to be a significant tailwind to annual EPS growth going forward. Currently, the company still has room for another 10 million shares to be repurchased based on its current share repurchase plan, and the company has been a buyer below $52.00 per share in its most recent purchases. (Source: YCharts.com, Author’s Chart) Although the company is posting steady earnings growth of 24% per year based on FY2020 estimates, and after lapping triple-digit growth last year, the company is trading at an ultra-low valuation of just 12.1x FY2021 annual EPS estimates ($48.00 / $4.18). Given that the company is one of the only multi million-ounce gold producers operating out of safe jurisdictions (Canada, Australia) and it has the highest margins in the sector, I see the current sell-off as creating an exceptional buying opportunity in the stock. Therefore, while I stopped adding to my position stock above $52.00 US, I will be buying more below $48.00, to move my average cost up closer to $42.00 on the stock. While there are several miners on sale with the GDX down 20% from its highs, I believe KL, GOLD, and KGC to be three of the top five miners in the sector, given their solid track records, continued dividend increases, and focus on only Tier-1 high-margin assets. There’s no guarantee that the correction has entirely run its course, and it certainly could get worse, but I see the current sell-off as providing an opportunity to start small positions in all three stocks. If this sell-off continues into next week, I may look to increase my positions further. For now, I see no reason to lose faith in the gold bull market, as long as gold remains above $1,765/oz. Disclosure: I am long GLD, GOLD, KL, KGC Disclaimer: Taylor Dart is not a Registered Investment Advisor or Financial Planner. This writing is for informational purposes only. It does not constitute an offer to sell, a solicitation to buy, or a recommendation regarding any securities transaction. The information contained in this writing should not be construed as financial or investment advice on any subject matter. Taylor Dart expressly disclaims all liability in respect to actions taken based on any or all of the information on this writing. Want More Great Investing Ideas? 7 Best ETFs for the NEXT Bull Market Is the Stock Market Correction Over? Chart of the Day- See the Stocks Ready to Breakout GOLD shares were trading at $27.20 per share on Wednesday afternoon, down $1.22 (-4.29%). Year-to-date, GOLD has gained 47.65%, versus a 2.44% rise in the benchmark S&P 500 index during the same period."}]}