{"article": [{"url": "https://stocknews.com/news/bac-kr-brk-b-spy-2-stocks-warren-buffett-continues-to-believe-in/", "published": 1597666100.0, "headline": "2 Stocks Warren Buffett Continues to Believe In", "body": "On August 14th, Berkshire Hathaway (BRK.B) filed its Form 13F which gives a quarterly update of the company’s portfolio. Warren Buffett currently has 44 stocks in his portfolio with a total value of $202.41 billion. In the second quarter, net earnings attributable to Berkshire shareholders increased 86.8% year-over-year. Warren Buffett is regarded as one of the greatest investors and keeping a watch on his portfolio holdings could be worthwhile as it gives an insight into his thinking. BRK.B, which is rated a Buy in our POWR Ratings system, is up 442.81% over the past 20 years, which is considerably higher than the SPDR 500 ETF’s (SPY) gain of 121.75%. Bank of America Corporation (BAC) and Kroger Company (KR) are two stocks that he believes in as he has either maintained or increased his stakes in them compared to the previous quarter. 7 \"SAFE HAVEN\" Dividend Stocks for Turbulent TimesBank of America Corporation (BAC) Buffett maintained his stake in BAC from the first quarter. With a weighting of 10.85%, BAC is the second largest holding in his portfolio. In an interview with CNBC earlier this year, Warren Buffett said, “Bank of America’s buying in a lot of stock every year. So, our ownership of the Bank of America this year probably will go up 7% to 8%” BAC has an impressive earnings surprise history with the company surpassing consensus EPS estimates in three of the trailing four quarters. The stock has grown more than 40% since its March lows. BAC is committed to returning capital to shareholders across economic cycles which makes it an attractive stock for income investors. BAC also became the first commercial bank issuer that offers Mobile Wallet Globally after the MEA and APAC Launch. The company recorded lower revenue and net income for the second quarter as compared to the year-ago quarter. BAC ended the second quarter with record deposits of $1.7 trillion, $242 billion in common equity, and $21 billion in cash reserves, which is a testament to its strong balance sheet. The company has a dividend yield of 2.72%. It’s no surprise that BAC is rated a Buy in our POWR Ratings system. It also has a grade of A for Peer Grade, and a grade of B for Trade Grade. In the 10-stock Money Center Banks industry, it is ranked #3. Kroger Company (KR) KR represents 0.37% of Warren’s total portfolio and has increased 24% year to date. Buffett bought 3,000,000 shares of this company in the second quarter. KR has gained more than 15% since its low in March due to the pandemic-led market crash. KR has been helped by the pandemic, which led to a surge in grocery-store sales as consumers stocked up on items and its online sales grew. Further, it has a strong brand identity and customer loyalty. Kroger Ship will provide extended ship-to-home assortment through a marketplace offering of third-party sellers powered by Mirakl, which will strengthen its digital services. KR also recently announced the launch of Contactless Payments Pilot across the QFC Division improving customer experience, especially during this period of increased social distancing practices. In KR’s first quarter ending May 23, 2020, operating profit grew 47.2% and EPS was up 60% year over year. The first quarter also recorded a 92% growth in KR’s digital sales. For the second quarter, the EPS estimate of $0.5 indicates an increase of 13.6% over the year-ago number and the revenue estimate of $29.56 billion represents a 4.9% increase. KR has an impressive earnings surprise history with the company surpassing consensus EPS estimates in three of the trailing four quarters. KR’s POWR Ratings reflect this promising outlook. It has an overall rating of Strong Buy with a grade of A for Trade Grade, Buy & Hold Grade, and Industry Rank. The stock is also ranked #5 out of 18 stocks in the Grocery/Big Box Retailers industry. Want More Great Investing Ideas? The Best of StockNews 3 Possible Directions for the Stock Market from Here 9 “BUY THE DIP” Growth Stocks for 2020 BAC shares were trading at $25.97 per share on Monday afternoon, down $0.50 (-1.89%). Year-to-date, BAC has declined -25.28%, versus a 6.04% rise in the benchmark S&P 500 index during the same period."}]}