{"article": [{"url": "https://stocknews.com/news/wmt-walmart-buy-sell-or-hold/", "published": 1598270900.0, "headline": "Walmart: Buy, Sell, Or Hold?", "body": "We’ve seen a strong recovery by the market since its mid-March lows, and while most retail names are stuck beneath their 52-week highs, Walmart (WMT) has been one of the few to charge to new all-time highs. The catalyst for this solid performance vs. its peer group was strong demand from E-commerce, as news that the company will be launching “Walmart+” in an aim to compete with Amazon (AMZN) Prime. While it’s early to tell if the company might be able to steal a little market share with its offering, analysts are upbeat on Walmart’s future, with the company’s earnings trend on track to record an earnings breakout year in FY2021. Let’s take a closer look below: 9 \"BUY THE DIP\" Growth Stocks For 2020 (Source: Forbes.com) Walmart released its fiscal Q2 2021 results last week and reported quarterly revenue of $137.7 million, up 5.6% year-over-year. The mid-single-digit growth was driven by 97% growth in E-commerce sales and much solid growth in the Grocery segment, with many consumers stockpiling to avoid multiple trips to the store. Meanwhile, despite Sam’s Club being a lagging segment and relatively small contributor company-wide for Walmart, membership rates soared with the highest quarterly increase in memberships in 5 years. This led to a 7.8% increase in membership income, with COVID-19 having a significant impact on membership trends. Based on the strength in nearly all segments, this was the 2nd best quarter for Walmart’s sales growth in the past two years, and the two-quarter average revenue growth rate jumped to 7.5%. While this growth rate is forecasted to drop to mid-single-digit revenue growth in Q3 and Q4 2021, it is a massive improvement from the FY2020 sales growth rate of just 1.5%. (Source: YCharts.com, Author’s Chart) Looking at Walmart’s earnings trend, this moderate acceleration in sales growth is having a positive impact on annual earnings per share [EPS]. As we can see above, annual EPS is forecasted to come in at $5.35 in FY2021, which would translate to more than 8% growth year-over-year. While this an impressive acceleration sequentially from the flat earnings growth in the year prior ($4.94 vs. $4.92), the real story is that we should see an earnings breakout year. Earnings breakouts occur when annual EPS trades in a range for several years and then makes a new multi-year high, and based on estimates of $5.35, we should see this occur in FY2021. Generally, earnings breakouts are bullish developments, as stocks tend to follow annual EPS long-term. (Source: YCharts.com, Author’s Chart) If we look at the FY2022 and FY2023 estimates, this is not just a temporary bump in annual EPS due to COVID-19, but instead what seems to be a new trend higher. While investors in Walmart have steady returns for years that have barely kept up with the major market averages, this new breakout could finally be the catalyst for Walmart to begin outperforming the S&P-500. The key to this, however, is that we can see revenue growth rates accelerate, and ideally, push closer to the 10% range. In my experience, the best earnings breakouts are those coupled with a material acceleration in revenue growth of at least 10%, and this won’t be an easy feat for Walmart. Therefore, we are going to need to see continued traction in Sam’s Club, and at least some contribution from “Walmart+” to make this happen. I do not think we’ll see the company steal much market share from Amazon despite the lower price point, but even picking up a small slice of market share would be a nice tailwind for annual revenues. (Source: YCharts.com, Author’s Chart) Given that we’ve got an earnings breakout on deck – is the stock a buy? While the breakout year for earnings in FY2021 is a bullish development, Walmart is not cheap here as it’s trading at nearly 0.7x sales. Typically, the best time to buy the stock has been at 0.50x sales or lower, and moving to underweight Walmart at 0.65x sales or higher has been the wise move. However, given the slight acceleration in revenue growth, we’re seeing, it’s possible that 0.60x sales could be the new buy zone for stock. Unfortunately, even if this is the case, we’re still trading more than 10% above this level, suggesting that new buys at current levels are risky. Having said that, this doesn’t mean the stock is a sell; it just means that I wouldn’t be rushing to buy it at above $131.00. Let’s see what the technical picture looks like: (Source: YCharts.com, Author’s Chart) (Source: TC2000.com) If we take a look at the technical picture above, it’s clear that there are some motivated sellers above $134.00 as we continue to see very weak monthly closes above this area. However, as long as Walmart remains above its key moving average (teal line) on a monthly closing basis, the best move has been to sit tight. Therefore, I see the best course of action here as holding and looking to add exposure on any dip near this moving average, which comes in near the $116.00 level currently. Ultimately, if we see a successful earnings breakout year here, there’s no reason the stock can’t trade up to the $150.00 level in the next 12 months. Walmart is a relatively boring stock that’s struggled to keep up with the major market averages. Still, for long-term investors, the stock continues to a decent staple to round out a portfolio with its 1.6% yield. The good news is that the earnings breakout we’re seeing here in FY2021 may make the stock more attractive to investors as we’ve seen no progress in annual EPS in nearly a decade now. The fact that this is finally changing might attract some new buyers to the Walmart story. Besides, the stock is more insulated than other retailers if we see a prolonged recession given its lower price-point. In summary, while I don’t see any reason to pay up above $131.00 for Walmart, I see the stock as a Hold at current levels for long-term investors. If we were to see a sharp correction in the market that sent Walmart sliding below $117.00 before year-end, this would present a low-risk opportunity to pick up some shares at a more attractive valuation. Disclosure: I am long AMZN and short SPY Disclaimer: Taylor Dart is not a Registered Investment Advisor or Financial Planner. This writing is for informational purposes only. It does not constitute an offer to sell, a solicitation to buy, or a recommendation regarding any securities transaction. The information contained in this writing should not be construed as financial or investment advice on any subject matter. Taylor Dart expressly disclaims all liability in respect to actions taken based on any or all of the information on this writing. Want More Great Investing Ideas? The Best of StockNews 2 Step Process to Sell @ Market Top in September 9 “BUY THE DIP” Growth Stocks for 2020 WMT shares were unchanged in after-hours trading Monday. Year-to-date, WMT has gained 11.95%, versus a 7.64% rise in the benchmark S&P 500 index during the same period."}]}