{"article": [{"url": "https://stocknews.com/news/cgc-canopy-surprises-with-better-than-expected-earnings/", "published": 1597147700.0, "headline": "Canopy Surprises with Better Than Expected Earnings", "body": "Canopy Growth (CGC) delivered better than expected earnings yesterday that sent its stock surging over 8%. The company reported a loss of 29 cents per share compared to analysts’ expectations of 35 cents. Net revenue increased 22% compared with revenue in the previous year. This was driven by higher medical sales in Canada and Germany and strong Storz & Bickel vaporizer sales. The company also saw total SG&A expenses decline by 25% compared with the previous year. This was driven by year-over-year reductions in Sales & Marketing expenses. This decline reflects lower compensation expenses resulting from corporate restructuring actions taken earlier in the year. CGC’s cash and short-term investments were $2 billion at the end of June, which was unchanged since the previous quarter. David Klein, Chief Executive Officer at CGC said, “We’re proud of our strong first-quarter performance, despite unprecedented volatility and uncertainty in the market and across the globe. We grew our revenue year-over-year and are seeing market share improvement, notably achieving number one market share in cannabis-infused beverages in the Canadian market.” 7 \"SAFE HAVEN\" Dividend Stocks for Turbulent TimesMike Lee, Chief Financial Officer at CGC, commented on the company’s financial state, “Following our previously announced restructuring actions, we have substantially reduced our expense and cash burn in this quarter in addition to reducing headcount by over 18% since the beginning of this calendar year. Our marketing and R&D investments are being re-allocated to programs with high-return potential in order to drive sales.” Vivien Azer, an analyst at Cowan, raised her price target on CGC. She stated that revenues from the 2.0 products have increased substantially. This quarter’s 2.0 product revenues accounted for 13% of first-quarter revenue, up from 2% last quarter when beverages were just beginning to roll out. Azer noted, “The offerings hold over a 75% share of the beverage segment (which [Canopy] estimates accounts for 3-4% of the total legal adult-use market, and would be ahead of the 1-2% share that we generally see for THC beverages in the U.S.” Azer boosted her price target on CGC to C$30.00 a share from C$27. I still remain neutral on CGC for the simple fact that they have not yet achieved profitability. Long story short, investors should not get too excited about one positive quarter until the company is able to consistently deliver results for multiple consecutive quarters. Want More Great Investing Ideas? 3 Possible Directions for the Stock Market from Here How to Trade THIS Stock Bubble? 9 “BUY THE DIP” Growth Stocks for 2020 CGC shares . Year-to-date, CGC has declined -19.63%, versus a 4.46% rise in the benchmark S&P 500 index during the same period."}]}