{"article": [{"url": "https://stocknews.com/news/cvx-xle-is-chevron-a-buy-sell-or-hold/", "published": 1598875700.0, "headline": "Is Chevron A Buy, Sell Or Hold?", "body": "A bearish trading pattern since 2014 An ugly bottom in March The top holding of the XLE and VDE 9 \"BUY THE DIP\" Growth Stocks For 2020&nbsp An attractive dividend- Earnings were humming along until Q2 Bargains in the oil patch, CVX is positioned to take advantage Chevron Corporation (CVX), together with Exxon Mobile (XOM) is as close to state oil companies as it gets in the United States. Through its subsidiaries, CVX engages in integrated energy, chemicals, and petroleum operations worldwide. The company operates in two segments; Upstream and Downstream. The upstream part of the business explores, develops, and produces crude oil and natural gas. It processes the energy commodities and stores and transports them. The Downstream segment refines crude oil into petroleum products and markets and transports them through pipelines, marine vessels, motor equipment, and rail cars. It also markets petrochemicals, fuel and lubricant additives, and plastics for industrial applications. Chevron also has a cash management and debt financing business, insurance operations, and real estate and technology operations. Chevron has been around since 1879, with its headquarters in San Ramon, California. While many oil and gas-related businesses face bankruptcy because of the mountains of debt and low prices, CVX is a leading company in the industry with significant growth potential. Chevron is a best-in-breed energy company in the US and worldwide. At its share price on August 28, any investor or trader considering dipping a toe into the energy patch on the long side should put CVX at the top of the list. A bearish trading pattern since 2014 Shares of Chevron Corporation (CVX) traded in a bullish pattern from the 1980s through 2014. Source: Barchart As the long-term chart highlights, CVX shares reached an all-time peak at $135.10 in July 2014. After falling to a low of $69.58 in August 2015 around the time when many commodities fell to multiyear lows in late 2015 and early 2016, the shares made a comeback. They rose to $133.88 in early 2018. Since then, CVX and most energy-related companies underperformed the stock market and the price action in the crude oil market. The bearish pattern in CVX shares since 2014 has been a function of the market’s rejection of energy investments. An ugly bottom in March The global pandemic caused risk-off conditions in markets across all asset classes from February through April. The price of nearby NYMEX crude oil futures fell into negative territory for the first time since trading began in the early 1980s. The price of energy shares, including CVX, hit their lows before crude oil spiked to a low of negative $40.32 per barrel on April 20, 2020. Source: Barchart After reaching a high for 2020 at $122.72 on January 3, CVX shares plunged to a low of $51.60 on March 19. The price was the lowest in fifteen years since 2005. After an ugly 58% decline, CVX shares rallied to a high of $103.59 on June 8. The price of nearby crude oil futures on NYMEX was approaching the $40 level in early June. Since then, crude oil continued to crawl higher, reaching its most recent peak last week at $43.78 on the active month October futures contract. At the same time, the stock market moved to new all-time highs on most of the leading indices. However, CVX shares continued to lag and were at just over $85.60 per share at the end of last week. A top holding of the XLE and VDE Two of the leading energy ETFs hold a significant percentage of its net assets in CVX shares in a sign that the company is one of the best-in-breed energy companies in the United States. Source: Yahoo Finance The Energy Select Sector SPDR (XLE) is a benchmark and leading ETF product that holds shares of energy-related companies. As the chart shows, the XLE held over 23% of its $10.4 billion in net assets in CVX shares. The Vanguard Energy Index Fund ETF (VDE) also holds a significant long position in CVX. Source: Yahoo Finance VDE holds over 21% of its $3.47 billion in net assets in CVX shares. Chevron is the second most significant holding in the ETF behind Exxon-Mobile (XOM). VDE’s exposure to CVX is less than 1.3% lower than its holdings of XOM. An attractive dividend- Earnings were humming along until Q2 At the $85.63 per share level on August 28, CVX pays its shareholders a $5.16 annual dividend or over 6%. The yield on the shares is far higher than the average dividend yield of stocks on the leading indices. When it comes to earnings, the market had been punishing CVX shares before the spread of the coronavirus and the decline in the price of crude oil, despite an excellent earnings history. Source: Yahoo Finance The chart shows that CVX beat analyst’s consensus earnings estimates from Q3 2019 through Q1 2020. In Q2, when the price of WTI crude oil fell below zero and Brent futures declined to $16 per barrel, the lowest price of this century, it was no surprise that CVX reported a loss of $1.59 per share. Analysts project a smaller loss of nine cents per share for Q3 2020. I expect CVX to resume its pattern of outperformance during the third quarter. A survey of twenty-three analysts on Yahoo Finance has an average price target of $99.87 per share for CVX, ranging from $70 to $127. Given the stock market’s performance, I expect the shares to rise to the top end of the range or higher over the coming months and years. Bargains in the oil patch, CVX is positioned to take advantage Many energy companies found themselves buried under a mountain of debt, which weighed on the sector. Record low-interest rates over the past years encouraged borrowing. As the price of crude oil fell, servicing the debt became impossible. As the number of bankruptcies rises, energy-related assets are on sale for pennies in the dollar. Warren Buffett, a value investor, recently picked up the transmission and pipeline assets of Dominion Energy for $10 billion in cash and debt assumption. Bargains will continue to present opportunities for companies like CVX and others with strong balance sheets. At the $85.63 per share level, CVX’s market cap is just under $160 billion. The level is low compared to companies in the technology sector where market caps are in the trillions these days. However, those looking for value should realize that Chevron offers lots of growth potential while the company pays a 6% dividend. In a market where bargains are few and far between, Chevron offers a unique value proposition at its current share price. Want More Great Investing Ideas? 7 Best ETFs for the NEXT Bull Market Why Stocks Could Drop 20% in September? 9 “BUY THE DIP” Growth Stocks for 2020 CVX shares were trading at $84.70 per share on Monday morning, down $0.93 (-1.09%). Year-to-date, CVX has declined -26.81%, versus a 10.03% rise in the benchmark S&P 500 index during the same period."}]}