{"article": [{"url": "https://stocknews.com/news/dkng-will-shares-of-draftkings-continue-to-soar/", "published": 1600690100.0, "headline": "Will Shares of DraftKings Continue to Soar?", "body": "DraftKings, Inc. (DKNG), which is an online fantasy-sports contest and sports wagering company, went public through a special-purpose acquisition company, or SPAC on April 24th, 2020. Though the stock made its debut at a time when all sports events were on hold, the stock soared on its first day. In fact, it has gained close to 200% since its debut. As the popularity of the online gaming industry is on the rise amid the coronavirus pandemic, DKNG’s unique business model allows gaming enthusiasts to virtually take part in organized sports. DKNG is also planning to appeal to the central and state governments to permit online sports betting in all states. DKNG signed a multiyear deal with EPSN to become an exclusive provider of daily fantasy sports and gambling link outs, allowing the stock to soar more than 15% following the announcement. As all major tournament sports are scheduled in the upcoming months, this deal is expected to increase DKNGs customer base and profits substantially in the near future, allowing the company to reach unparalleled heights. 7 Best ETFs for the NEXT Bull MarketDKNG’s favorable business outlook combined with several other factors has allowed it to earn a “Strong Buy” in our proprietary POWR Ratings system evaluates DKNG: Trade Grade: A DKNG is currently trading above its 50-day and 200-day moving averages of $37.23 and $24.41 respectively, indicating golden cross bullishness. It has gained 45.7% in the past month, which reflects a solid uptrend in the stock. DKNG’s multi-year agreement with ESPN to become a co-exclusive sportsbook link-out provider and exclusive daily fantasy sports provider earlier this year has helped it soar. It also entered into a strategic partnership for sports betting with New York Giants and Chicago clubs. DKNG’s revenues increased 23.6% in the second quarter ended June 2020. With major organized sports events cancelled, the online fantasy sports and betting gained significant traction in the first half of 2020. Buy & Hold Grade: A In terms of proximity to 52-week high, which is a key factor that our Buy & Hold Grade takes into account, DKNG is well-positioned. The stock hit its 52-week high on September 18th and trading marginally lower than that level. DKNG has seen a significant increase in engagement with free-to-play games about cultural events such as the last Democratic debate or entertainment trends like Netflix’s Tiger King. Peer Grade: A DKNG is ranked #1 out of 22 stocks in the Entertainment – Casinos/Gambling industry. Other popular companies in this industry include Scientific Games Corp (SGMS), Penn National Gaming, Inc. (PENN) and Churchill Downs, Incorporated (CHDN). SGMS, PENN and CHDN gained 23.1%, 176.2% and 15.4% year-to-date respectively, which is significantly lower than DKNG’s 417.7% rise over the same time period. Industry Rank: C The entertainment – Casinos/ Gambling industry is ranked #81 out of 123 industries in the StockNews.com universe. This industry has been significantly affected by the pandemic, as organized sports remained suspended for months and major casinos across the country were closed. However, the industry is recovering steadily, as most sports tournaments are rescheduled to take place in the upcoming months. Also, with people being accustomed to the social distancing and stay-at-home norms, the online sports betting industry has gained popularity in recent months. According to a report published by Deloitte, the global esports market is expected to generate an annual revenue of $1.50 billion in 2020. Overall POWR Rating: A (Strong Buy) Overall, DKNG is rated “Strong Buy” due to its impressive past performance, solid price momentum and recent developments, as determined by the four components of our overall POWR Rating. Bottom Line DKNG is well positioned to soar further based on its short-term bullishness, impressive earnings outlook and favorable analyst sentiment. Out of 13 Wall Street analysts that rated the stock, 9 rated it “Strong Buy”. The company’s EPS is expected to grow at 40% per annum over the next five years. Want More Great Investing Ideas? 7 Best ETFs for the NEXT Bull Market Stock Market Outlook: Before & After the Election Chart of the Day- See the Stocks Ready to Breakout DKNG shares were trading at $51.32 per share on Monday afternoon, down $4.07 (-7.35%). Year-to-date, DKNG has gained 379.63%, versus a 1.40% rise in the benchmark S&P 500 index during the same period."}]}