{"article": [{"url": "https://stocknews.com/news/amd-nvda-ebay-amzn-bidu-jd-msft-spy-3-stocks-that-will-continue-to-rally-through-2020/", "published": 1597406900.0, "headline": "3 Stocks That Will Continue to Rally Through 2020", "body": "On Thursday, the market did something it hadn’t done in nearly 90 years. The S&P 500 had the best 100 days of trading since 1933. The S&P 500 was up 51% from its bottom on March 23. The index is very close to closing above its all-time high of 3,386.15 on February 19. It briefly crossed that line on Wednesday and Thursday before pulling back both days. Here is a chart of the S&P 500 Rolling 100-Day %Change from the folks at Bespoke Investment Group. Courtesy of Bespoke Investment Group 9 \"BUY THE DIP\" Growth Stocks For 2020This almost seems like we’re in a situation where we were never in a bear market. It could have been a correction, and we’re still in a bull market. While the market did crash in late February through March 23, it’s been on a tear ever since. If we look at sector performance for the S&P 500 over the past three months, the top two sectors, Consumer Discretionary and Information Technology, are up 23.03% and 19.35%. Even the bottom two sectors, Energy and Healthcare, are positive over this period. Will this rally continue? I don’t know but I am confident that certain stocks will. To determine which ones, I looked at all S&P 500 constituents for two specific metrics. The first is profitability and efficiency via return on invested capital (ROIC), and the second is momentum. I also considered particular sectors in my evaluation. I believe technology will continue its run over the near and midterm, regardless of how the rest of the market performs. Here are three stocks I think will continue to rally: Advanced Micro Devices (AMD), NVIDIA Corp (NVDA), eBay (EBAY). Advanced Micro Devices (AMD) AMD designs and produces microprocessors for the computer and consumer electronics industries. The majority of the company’s sales are in the computer market via CPUs and GPUs. The company acquired graphics processor and chipset maker ATI in 2006 to improve its positioning in the PC food chain. The company has benefited from the steady adoption of Ryzen, Radeon, and the latest second-generation EPYC server processors. This is due to the increasing spread of artificial intelligence and machine learning, like cloud gaming and supercomputing. The work from home trend has also benefited the company as data centers are increasingly adopting AMD’s products. I expect the firm to benefit through partnerships with Amazon (AMZN), Baidu (BIDU), JD.com (JD), and Microsoft (MSFT). The stock is up 55% over the last three months and 77% year to date. Those performance figures are one reason AMD is rated a Strong Buy by our POWR Ratings system. Three of the four components that make up the POWR Ratings show grades of A for the stock, including Trade Grade, Buy & Hold Grade, and Industry Rank. AMD has a grade of B in the remaining component, Peer Grade. The firm is the #6 ranked stock in the Semiconductor & Wireless Chip industry. NVIDIA Corp (NVDA) NVDA is a leading designer of graphics processing units that enhance the experience of computing platforms. The company’s chips are used in a variety of end markets, including high-end PCs for automotive infotainment systems, data centers, and gaming. The company has recently expanded its focus from traditional PC graphics applications to more favorable opportunities such as artificial intelligence and autonomous driving. Similar to AMD, NCDA has greatly benefitted from the work from home and learn from home trends. Gaming, in particular, is one area that has seen steady growth due to increased demand in GeForce desktops and notebook GPUs. The firm’s data center business should see increased growth through a surge in Hyperscale demand. I believe the NVDA’s recent collaboration with Mercedes-Benz will strengthen its presence in the autonomous vehicles market. The stock is up 48% over the past three months, well outpacing the SPDR 500 ETF (SPY), which is up 19%. With that performance, it only fits for NVDA to be rated a Strong Buy in our POWR Ratings system. It holds grades of A in every single POWR Rating score. It is also the #2 ranked stock in the Semiconductor & Wireless Chip industry. Keep an eye out on Wednesday, August 19, as NVDA reports earnings after the market closes. eBay (EBAY) EBAY needs no introduction as its marketplace has facilitated more than 3% of the $3.5 trillion global online commerce market. Last year the company generated close to $86 billion in marketplace gross merchandise. After the company separated from PayPal in 2015, its key driver of business is its marketplace business. The company also generates revenue through its advertising business. The company is well poised to take advantage of changing consumer behavior. While many people think of Amazon AMZN as the main online shopping portal, EBAY provides many of the same items at better prices. The marketplace is no longer just an internet auction site. There are millions of items for sale in thousands of categories. On the other side of the transaction, merchants have many tools at their disposal to sell their products without worrying about AMZN’s ever-changing rules and private label products. EBAY has also made a move into mobile that should sustain growth well into the future. Commerce, on its mobile app, has been growing very quickly over the last few quarters. The stock is up 35% over the last three months and 51% over the past six months. For a company in the Internet industry, it has a reasonably low price to earnings ratio (P/E) of 20.6. The company has a very high current return on invested capital of 44.1%, so management has been allocating capital efficiently. The stock is rated a Buy in our POWR Ratings system. It holds grades of A for Trade Grade and Industry Rank, and a grade of B for Buy & Hold Grade and Peer Grade. EBAY is the #19 ranked stock in the Internet industry. Want More Great Investing Ideas? 3 Possible Directions for the Stock Market from Here How to Trade THIS Stock Bubble? 9 “BUY THE DIP” Growth Stocks for 2020 AMD shares . Year-to-date, AMD has gained 77.28%, versus a 5.73% rise in the benchmark S&P 500 index during the same period."}]}