{"article": [{"url": "https://stocknews.com/news/cvna-srpt-bgne-crsp-xlk-spy-xbi-4-stocks-with-impressive-revenue-growth/", "published": 1597234100.0, "headline": "4 Stocks with IMPRESSIVE Revenue Growth", "body": "While the economy has slowly opened back up, and the stock market has seen one of the largest rallies in over 20 years, there are still concerns of a lengthy recession and the pandemic’s long term on the economy. That’s why it is a good idea to invest in stocks with strong revenue growth. If sales are still coming in during this uncertain period, it means the company is currently doing well, and will likely continue to do well in the future. Two of the main segments of the market seeing revenue growth during the pandemic are technology stocks and stocks involved in treating COVID-19. The Technology Select SPDR ETF (XLK) is up 19% over the last three months, compared with a 13% gain for the SPDR 500 ETF (SPY). The SPDR S&P Biotech ETF (XBI) is up over 15% year to date, compared with a 4.84% gain for the SPY. Carvana Co. (CVNA), Sarepta Therapeutics, Inc. (SRPT), BeiGene, Ltd. (BGNE) and CRISPR Therapeutics AG (CRSP) have a reliable revenue growth history with strong fundamentals. 7 \"SAFE HAVEN\" Dividend Stocks for Turbulent TimesCarvana Co. (CVNA) CVNA is an e-commerce platform for buying and selling used cars in the United States. Its platform allows customers to research and identify a vehicle, inspect it using a 360-degree vehicle imaging technology; obtain financing and warranty coverage, purchase the vehicle, and schedule delivery or pick-up over the internet. It operates as a subsidiary of DriveTime Automotive Group, Inc. CVNA’s revenue for the year ending 2019 was $3.94 billion, which was an increase of 101% year over year. The company has consistently been increasing its quarterly revenue. CVNA managed to generate a revenue of $1.12 billion in its second quarter, a 13% increase year-over-year, despite the pandemic. This was primarily driven by a 25% increase in retail sales. Moreover, the first quarter witnessed a year-over-year increase of 45% in revenues to $1.1 billion. Revenue for the current year is anticipated to be $5.27 billion with a growth estimate of 33.7%. Revenue for the current and next quarter is estimated to be $1.48 billion and $1.58 billion, translating to a growth estimate of 35% and 43%, respectively. The consensus top-line estimate for the next year of $7.6 billion indicates a 44% increase year-over-year. CVNA presently trades at $187.65, a 16% discount from its 52-week high of $225.45. Year-to-date, the stock has gained more than 103%. How does CVNA stack up for POWR Ratings? A for Trade Grade B for Peer Grade A for Industry Rank B for Overall POWR Rating. You can’t ask for better. It is ranked #7 out of 54 stocks in the Internet industry. Sarepta Therapeutics, Inc. (SRPT) SRPT is a biopharmaceutical company focused on the discovery and development of unique RNA-targeted therapeutics, gene therapy, and other genetic therapeutic modalities approaches for the treatment of rare and infectious diseases. It offers injections and treatment through its unique gene therapy program. SRPT generated $381 million in revenue for the year ending 2019. This marked a growth of 26.5% from the year-ago revenue figure of $301 million. With revenue of $1.25 million in 2015, the company’s revenue has grown at an average rate of 318% over the last five years. The company recently announced its financial results for the second quarter. Revenue was up 45% year-over-year to $137 million. SRPT’s revenue also increased more than 20% compared to the preceding quarter. SRPT recently signed an agreement with Hansa Biopharma, a leader in immunomodulatory enzyme technology, for imlifidase, a medication used during kidney transplantation. Revenue estimates for the current and next year look promising. Current year revenue is anticipated to grow by 51.6% to $577.4 million, while revenue for the next year is estimated to grow by 52% to $878.8 million. Moreover, revenue for the current and the succeeding quarter is estimated to grow by 37% and 48% to $135.7 million and $148.7 million, respectively. SRPT is trading at $158.03 with a year-to-date gain of 22%. The stock hit its 52-week low of $72.05 on September 26th 2019, but is up more than 119% since. SRPT’s POWR Ratings reflect this promising outlook. It has an overall rating of Buy with a grade of A for Peer Grade and a grade of B for Trade Grade, Buy & Hold Grade, and Industry Rank. Among the 344 stocks in the Biotech industry, it is ranked #62. BeiGene, Ltd. (BGNE) BGNE is a clinical-stage biopharmaceutical company that discovers, develops, and commercializes molecularly targeted and immuno-oncology cancer drugs. The company has global reach in five continents with over 1100 clinical development teams. The company reported $428 million revenue last year, which was 116% more than its year-ago figure of $198 million. BGNE has had strong revenue growth over the last four years. The company had revenue of $1.07 million for the year end 2016 And it has grown at a CAGR of 636.8% since. BGNE has made tremendous progress over the last quarter. It reported a revenue of $65.6 million, a 26% increase quarter-over-quarter. It has also received approval for eight new drug applications in China, the European Union, Australia, and Israel. Analysts expect current year revenue to be $324.54 million and current quarter’s revenue to be $65.6 million. Analysts also expect revenue to grow by 121% next year to $718.4 million, and 30% next quarter to $85 million. The stock is presently trading at $209.45, which indicates a gain of 26% year-to-date. BGNE has hit its 52-week low of $114.41 in October last year and has recovered more than 83% since then. As per our POWR Ratings, BGNE is a “Buy.” It holds an “A” in Peer Grade, and a “B” in Trade Grade and Industry Rank. It is currently ranked #17 out of 215 stocks in the Medical – Pharmaceuticals Industry. CRISPR Therapeutics AG (CRSP) CRSP is a gene editing company that focuses on developing transformative gene-based medicines for serious human diseases. Further, it engages in developing regenerative medicine programs in diabetes. The company reported impressive results for last year. Annual revenue grew more than 9170% from $3.12 million to $290 million in 2019. Furthermore, CRSP’s revenue has grown at a CAGR of 484% over the last five years. Revenue for the second quarter stood at $0.04 million. CRSP’s revenue has grown 21,738.8% over the past 12 months; that beats the revenue growth of 99.95% of US companies in the StockNews.com universe. The consensus estimates for the current quarter and the succeeding quarter stands at $2.2 million and $2.85 million, respectively. The current year revenue is anticipated to be $4.88 million. Additionally, revenue for the next year is expected to grow 278% to $18.47 million. CRSP recently announced a follow-up public offering of its common shares worth $450 million, indicating a sense of public confidence. With a year-to-date gain of 47%, the stock currently trades at $89.45. The stock is already up more than 177% from its March low. As per our POWR Ratings, CRSP is rated a Buy. It has a grade of A in Trade Grade and Peer Grade, and B in Buy & Hold Grade and Industry Rank. It is currently ranked #6 out of 344 stocks in the Biotech industry. Want More Great Investing Ideas? 3 Possible Directions for the Stock Market from Here How to Trade THIS Stock Bubble? 9 “BUY THE DIP” Growth Stocks for 2020 CVNA shares . Year-to-date, CVNA has gained 109.91%, versus a 5.92% rise in the benchmark S&P 500 index during the same period."}]}