{"article": [{"url": "https://stocknews.com/news/gdx-gold-mining-stocks-are-outperforming-gold/", "published": 1596024500.0, "headline": "Gold Mining Stocks are OUTPERFORMING Gold", "body": "We’re in the heart of earnings season, with some of the biggest companies in the world reporting this week. Yet, almost all the focus in the investment world is on gold and silver. After a long hiatus, it seems precious metals are back in the limelight. In recent days, the U.S. dollar has really taken it on the chin. The dollar has lost considerable ground versus other major currencies such as the Euro and Yen. This is likely due to the long-term impact of COVID-19, which has hit the US harder than other developed nations. As a result of the dollar falling, money has been pouring into gold and silver. 9 \"BUY THE DIP\" Growth Stocks For 2020For the year, gold is up 28% and has hit a record of nearly $1,975 an ounce. Silver is up 37% so far this year, but is still just trading around $25 an ounce (well below all-time highs). Can precious metals keep going? As long as the dollar keeps heading south, it’s certainly possible. VanEck Vectors Gold Miners ETF (GDX) From an options perspective, there’s been a significant amount of activity in the VanEck Vectors Gold Miners ETF (GDX). GDX is up 49% this year so far, and at least one well-capitalized trader thinks the good times will continue through the summer. With GDX trading for $43 a share, this trader purchased September 48 calls for $1.48. The calls traded in a block of 5,400, which amounts to around $800,000 in premium costs. That is also the max loss on the trade if GDX is below $48 at September expiration. Because it’s just a straight call buy, the breakeven for the trade is at $49.48 at expiration. Max gain is unlimited. Since these calls are $5 out-of-the-money, and because the trade wasn’t executed as a call spread (lower cost but capped gains), it appears to be an extremely bullish position. Should gold continue moving higher, gold miners could still have significant upside potential. The last time gold prices were this high, GDX climbed over $60 per share. That could be what this call buyer is expecting over the next two months or so. In other words, gold miners may be a better value than gold itself, considering gold is at all-time highs and GDX isn’t close. GDX also gives you access to several miners, so you aren’t just relying on one company to gain exposure to gold. Want more great investing ideas? Download free the “10-Step Options Trading Checklist” you need before making a trade. The Virtual Trading Pit Is Open: Trade Set-ups, Training, New Trading Ideas How to Try Out Options Without Risking a Penny GDX shares rose $0.01 (+0.02%) in after-hours trading Wednesday. Year-to-date, GDX has gained 47.30%, versus a 2.05% rise in the benchmark S&P 500 index during the same period."}]}