{"article": [{"url": "https://stocknews.com/news/arkg-wcld-clix-the-3-best-performing-etfs-of-the-first-half-of/", "published": 1594987700.0, "headline": "The 3 BEST PERFORMING ETFs of the First Half of 2020", "body": "We already know that 2020 is going to be a year that’s talked about in history books. And, there are still five and a half months to go until it’s over. In terms of financial markets, there have been several events compressed into a short timeframe. Taking a step back and looking at the performance of various assets is one way to get a better understanding of what happened to learn lessons and position ourselves properly for the future. There are thousands of ETFs to give investors exposure to different themes, sectors, or groups. ETF performance over longer time frames can reveal which parts of the market and economy are thriving. 7 \"SAFE HAVEN\" Dividend Stocks for Turbulent TimesSo here is a list of the three best performing ETFs during the first half of this year: ARK Genomic Revolution ETF (ARKG) ARKG is an actively-managed fund consisting of companies that are working on ways to enhance the quality of human lives by technological innovations and developments in genomics. ARKG aims for long-term capital growth by investing in multiple sectors such as healthcare, information technology, manufacturing, energy, and transportation. The stocks in its holdings are involved in genetic diagnostics, gene-based medicines, genetic variation, and drug development. This fund has caught the eye of many investors as it is closely related to biotechnology and healthcare which are the most happening sectors during this worldwide health crisis. Two of ARKG’s main holdings are Invitae Corporation (NVTA) and CRISPR Therapeutics AG (CRSP). Since its 52-week low in March, ARKG has grown by more than 130%. The fund has returned 49.8% over the past three months and 67.2% year to date. Even though the average expenses ratio for ARKG of 0.53% is higher than its category average of 0.46%, the fund’s momentum is encouraging. How does ARKG stack up for the POWR Ratings? A for Trade Grade A for Buy & Hold Grade A for Industry Rank A for Overall POWR Rating You can’t ask for better. The fund is also ranked #10 out of 35 ETFs in the Health & Biotech ETFs category. WisdomTree Cloud Computing Fund (WCLD) WCLD tracks the price and yield performance of the BVP Nasdaq Emerging Cloud Index, which tracks the performance of emerging public companies involved in cloud computing software and services. WCLD not only selects fast-growing companies but also chooses companies that have shown sustainable growth over a period. During the current circumstances, cloud computing services have become an important part of our lives and this ETF has been capitalizing on this trend. Some of WCLD’s holdings are Fastly (FSLY), Zoom Video Communications (ZM), DocuSign (DOCU), and Zscaler (ZS). Since hitting its 52-week low of $18.99 in mid-March, WCLD has gained more than 100%. The fund has returned 42.3% over the past three months and 50.9% year to date. In terms of the expense ratio, the ETF averaged 0.53% which is slightly above the average of 0.5%. WCLD’s POWR Ratings reflect a promising outlook. It has an overall rating of “Buy” with an “A” for Trade Grade and Industry Rank and a “B” for Buy & Hold Grade. ProShares Long Online/Short Stores ETF (CLIX) CLIX aims to track the performance of ProShares Long Online/Short Stores Index. The Index is a combination of 100% long position of retailers that either sell online or through non-store channels and 50% short position in-store retailers. The surge in demand for e-commerce, online and internet-based services makes this fund a pragmatic choice in addition to the weakness of physical retail. Two of the main holdings of CLIX are Amazon.com (AMZN) and Alibaba Group Holding (BABA). Since its March lows, the CLIX has gained more than 60%. CLIX has returned 49% over the past six months and 61% year to date. The fund’s average expense ratio of 0.53% is much lower than its category average of 1.05%, making it a low-cost option to bet on the e-commerce space. It’s no surprise that CLIX is rated a Strong Buy in our POWR Ratings system. It also has an “A” for Trade Grade, Buy & Hold Grade, and Peer Grade. In the 24-fund Long-Short ETFs group, it is ranked #2. Want More Great Investing Ideas? 9 “BUY THE DIP” Growth Stocks for 2020 Newly REVISED 2020 Stock Market Outlook 7 “Safe-Haven” Dividend Stocks for Turbulent Times ARKG shares rose $0.17 (+0.30%) in after-hours trading Friday. Year-to-date, ARKG has gained 70.47%, versus a 0.99% rise in the benchmark S&P 500 index during the same period."}]}