{"article": [{"url": "https://stocknews.com/news/nrz-gmlp-paa-nrz-doubles-its-dividend-and-looks-to-increase-again/", "published": 1597752500.0, "headline": "NRZ Doubles Its Dividend and Looks to Increase Again", "body": "At the start of the pandemic-triggered economic crisis, a large portion of stocks in the high-yield sectors slashed or suspended dividend payments. For example, Hoya Capital Real Estate reports that 31 of 42 mortgage real estate investment trusts (REITs) cut or suspended dividends from March through June. Other sectors, such as equity REITs, business development companies (BDCs), and energy midstream companies, had large numbers of dividend cuts. Now, almost half a year after the pandemic kicked the stuffing out of income stocks, I am starting to look for those companies that will bring back higher dividend rates. There are two main reasons behind the dividend cuts we’ve seen in 2020. 7 Best ETFs for the NEXT Bull MarketOne reason is that the pandemic and related economic shutdown so disrupted a company’s business that the profits and cash flow to pay dividends stopped. An example of this effect is lodging REITs. These REITs own hotels managed by the hotel companies. Unlike most other REIT sectors, lodging REITs participate in the profits, and in the second quarter, empty hotels meant no profits or cash flow to pay dividends. With continued lack of business travel due to the pandemic, it is unclear when hotels will again be full enough to generate profits and dividends for REIT investors. The other reason is that the uncertainty brought about by the pandemic pushed companies to slash dividends to retain cash. These are companies that continued to generate revenue and cash flow but were not confident that would continue. With the 2020 second-quarter earnings results, there now is a better picture of the continuing cash flow that could be used to pay dividends. The financial results from these companies show they have the potential to either restore dividends to nearly pre-pandemic levels or to start on a path of steady dividend growth. Here are three stocks that could soon start to increase dividends. New Residential Investment (NRZ) In late March, finance REIT New Residential Investment (NRZ) cut its dividend by 90%, going from $0.50 per share down to $0.05. In June, with the next announcement, the dividend was doubled to 10 cents. Second-quarter core earnings came in at $0.34 per share, down from $0.48 reported for the first quarter. The New Residential business will benefit from the strong housing market. Profits should quickly recover to the 2019 levels of $0.60 per share each quarter. I expect the dividend increases to continue each quarter. Golar LNG Partners (GMLP) In April, Golar LNG Partners (GMLP) slashed its dividend by 95%, dropping the $0.4042 quarterly dividend rate down to $0.0202. On August 14, Golar released its second-quarter financial results; included in the report was the fact that distributable cash flow covered the two-cent dividend by 20 times. That means the company generated enough free cash flow to pay the old 40 cent dividend. I do not expect Golar to restore the old dividend, but I would not be surprised if they soon boost the rate ten-fold, to around $0.20 per share per quarter. Plains All American Pipelines LP (PAA) Also, in April, crude oil pipeline company Plains All American Pipelines LP (PAA) reduced distributions by 50%, down to $0.18 per share. For the 2020 second quarter, Plains reported distributable cash flow (DCF) of $0.41 per share, down from $0.73 for the 2019 second quarter. With earnings, the company provided full-year DCF guidance of $2.23 per share, down from $2.91 in 2019. However, the $0.72 annualized dividend is almost four-times covered, so I expect Plains to give a nice dividend increase soon, most likely in January 2021. Want More Great Investing Ideas? Top Dividend Stock to Own! Download Free Report Today Buy These 3 High-Yield Dividend Stocks All Under $15 Buy and Hold These 3 Dividend Stocks Forever NRZ shares rose $0.02 (+0.25%) in after-hours trading Tuesday. Year-to-date, NRZ has declined -49.82%, versus a 6.30% rise in the benchmark S&P 500 index during the same period."}]}