{"article": [{"url": "https://stocknews.com/news/adbe-ddog-crus-syna-llnw-5-tech-stocks-to-watch-in-the-second-half-of/", "published": 1593691700.0, "headline": "5 Tech Stocks to Watch in the Second Half of 2020", "body": "The bull market is showing no signs of slowing down. The disconnect between Wall Street and Main Street continues to grow more extreme. Bulls argue that the stock market is anticipating an improvement in economic conditions, while Main Street is myopically focused on the present. So far, the technology industry has proven to be the strongest in terms of performance. Further, earnings reports from companies like Micron (MU) show that demand for semiconductors remains strong. This can be interpreted as a temporary effect of more demand due to remote work or an affirmation of economic strength. 7 Best ETFs for the NEXT Bull MarketHere are five tech stocks worth watching as we enter the second half of the year. Adobe Systems Incorporated (ADBE) It was not long ago when ADBE was primarily selling software straight out of boxes. Times have changed. ADBE’s business is no longer limited to selling out-of-the-box software such as Photoshop. Today, ADBE does most of its business on the cloud by way of software-as-a-service (SaaS). ADBE revenue is up more than 20% on a year-over-year basis, hitting the $3 billion benchmark. ADBE executives wisely acquired Marketo and Magento to fortify the company’s digital marketing prowess. A poll of the top analysts shows ADBE anticipated revenue growth just under 18% for the remainder of 2020 including a 24% hike in profits. The POWR Ratings have rated ADBE a “Strong Buy” with an “A” for all categories including Trade Grade, Buy & Hold Grade, Industry Rank, and Peer Grade. Among the Software – Application group, it’s ranked #1 out of 82 stocks. Datadog, Inc. (DDOG) Cloud activity is on the rise as employees transition from working in traditional offices to houses, condos, and apartments. DDOG will benefit from the increasing reliance on the cloud. DDOG tracks cloud activity then sorts through it to glean valuable business insights. DDOG has enjoyed quite the meteoric rise since mid-March, jumping from $29 to its current price of $89. However, DDOG has a forward P/E ratio above 2,000 which means that investors are very optimistic about the stock. If the WFH movement proves permanent and businesses continue to rely on the cloud with increased frequency as time progresses, DDOG will continue to rake in the cash and be able to grow into this valuation. Cirrus Logic (CRUS) Every tech company would love to have Apple (AAPL) as its primary customer. This dream is a reality for CRUS. CRUS provides Apple with audio codecs. In fact, 75% of CRUS’s revenue stems from Apple. If you do not mind the lack of revenue diversification, CRUS should pique your interest. Even if Apple’s new iPhone is delayed a couple of months, CRUS will still profit from this coveted device. The transition to 5G will undoubtedly help both companies. CRUS has zero debt and more than $600 million in cash. Furthermore, CRUS recently reported a 16% yearly revenue growth. The company’s net income is up 65% on a year-over-year basis. The stock has a one-year price return of 35% along with a ’19 price return of 148%. Synaptics (SYNA) The arrival of the new iPhone bodes well for numerous tech companies including SYNA. SYNA is a chipmaker that supplies OLED touchscreen controllers. It appears as though SYNA chips will be used in the entry-level iPhone dubbed the “SE.” Nearly a dozen other smartphones will feature SYNA OLED solutions in 2020. The analysts have set a price target of $77.75 for SYNA, meaning there is more than a 30% upside. With a forward P/E ratio of a paltry 10.35, SYNA presents solid value as of July. Look for SYNA to catch fire later this year and possibly approach its 52-week high of $84.75 by summer’s end. Limelight Networks (LLNW) Businesses that provide the digital delivery of media have never been busier. Digital media will continue to escalate in popularity throughout the second half of 2020, especially if the quarantine continues. LLNW has more than 1,300 brands in the fold. These media providers rely on LLNW to facilitate content delivery with precision to create a flawless user experience. The average analyst price target for LLNW is just under $8, meaning there is at least a 5% upside. All in all, five analysts recommend buying the stock while none recommend holding or selling. LLNW should break through its 52-week high of $7.99 and possibly approach double digits by the end of the year. Want More Great Investing Ideas? 9 “BUY THE DIP” Growth Stocks for 2020 Is the Bull S#*t Rally FINALLY Over? 7 “Safe-Haven” Dividend Stocks for Turbulent Times Top 3 Investing Strategies for 2020 ADBE shares were unchanged in after-hours trading Thursday. Year-to-date, ADBE has gained 34.30%, versus a -1.99% rise in the benchmark S&P 500 index during the same period."}]}