{"article": [{"url": "https://stocknews.com/news/msft-amzn-baba-nvda-4-tech-stocks-that-crushed-earnings-estimates/", "published": 1598875700.0, "headline": "4 Tech Stocks That CRUSHED Earnings Estimates", "body": "The skyrocketing performance of the tech-heavy Nasdaq composite has proven that tech stocks have primarily driven the market’s momentum. The pandemic accelerated the pace of digital transformation, as individuals and businesses have been heavily relying on technology to remain functional. This has created an enormous opportunity for most tech companies. As a result, the market has rewarded the prominent tech players. This is evident from the Vanguard Information Technology Index ETF’s (VGT) 74.8% return since its March low, compared to the S&P 500’s 51% gain over the same period. The street had already anticipated tech giants to report strong earnings in their last reported results due to the rapid growth in demand for their products and services amid the pandemic, but some of the biggest players surprised investors with even better earnings. Analysts come up with earnings estimates after speaking with corporate management, evaluating product demand and evaluating past financials. The fact that tech companies blew these estimates out of the water is especially noteworthy. Microsoft Corporation (MSFT), Amazon.com, Inc. (AMZN), Alibaba Group Holding Limited (BABA), and NVIDIA Corporation (NVDA) comfortably beat the market’s expectations with record high earnings over the last quarter. These stocks have already gained momentum since their March lows and should continue to move higher. 9 \"BUY THE DIP\" Growth Stocks For 2020Microsoft Corporation (MSFT) MSFT develops, licenses, and supports software, services, devices, and solutions worldwide. It operates through three segments – Productivity and Business Processes, Intelligent Cloud and More Personal Computing. For the fiscal fourth quarter that ended in June 2020, MSFT reported EPS of $1.46, beating the street estimate by 9%. It also reported an earnings surprise of 11.1% in the preceding quarter. Moreover, the company has beaten EPS estimates in each of the trailing four quarters. The consensus EPS for the current quarter is anticipated to grow 11.6% year-over-year to $1.54. The top-line for the quarter grew 13% year-over-year to $38 billion. The Intelligent Cloud segment revenue witnessed a 17% increase year-over-year primarily driven by server products and cloud services amid the pandemic. The More Personal Computing segment and the Productivity and Business Processes also witnessed a year-over-year growth of 14% and 6%, respectively. Net profit for the quarter came in $11.2 billion, or 29.5% of revenues. MSFT is on a strategic expansion spree. It has recently announced a partnership with Universal Film Entertainment group to accelerate live-action and animated productions. It has also partnered with Standard Chartered Bank to become a cloud-first bank. Mastercard (MA) has collaborated with MSFT to accelerate innovation across digital commerce. MSFT closed Friday’s trading session at $228.91, gaining 45% year-to-date. The stock has gained more than 41% in the past six months. How does MSFT stack up for the POWR Ratings? A for Trade Grade A for Buy & Hold Grade A for Peer Grade A for Industry Rank A for Overall POWR Rating. You can’t ask for better. It is ranked #1 out of 92 stocks in the Software – Application industry. Amazon.com, Inc. (AMZN) AMZN engages in the retail sale of consumer products and subscriptions through its online store. The company operates through three segments – North America, International, and Amazon Web Services (AWS). The company reported an EPS of $10.3 for its recently reported results for the second-quarter that ended in June 2020. EPS almost doubled year-over-year by growing 97.3%. Furthermore, it beat the consensus estimate by 605.5%. The EPS is expected to grow 71.2% year-over-year in the current quarter to $7.24. Net sales for the quarter increased 40% year-over-year to $89 billion. AMZN increased grocery delivery capacity by over 160% and tripled grocery pickup locations to support customers during the pandemic. Online grocery sales tripled in the second quarter when compared with the same period last year. Net income increased to $5.2 billion in the quarter, implying a year-over-year growth of 100%. AMZN has recently introduced a new service under Amazon Halo and Amazon Halo Band that helps customers improve their health and wellness by combining a suite of AI-powered health features providing actionable insights into overall wellness. Moreover, the company has recently extended its Project Zero, an investment to ensure that customers always receive authentic goods, to new marketplaces. It has expanded to seven new countries, making it available in 17 countries worldwide. AMZN closed Friday’s trading session at $3401.8, gaining over 84% year-to-date. It has added close to 109.2% to its stock price since this year’s low of $1626.03 hit in March. AMZN’s POWR Ratings reflect a promising outlook. It has an overall rating of Strong Buy with a grade of A for Trade Grade, Peer Grade, Buy & Hold Grade, and Industry Rank. Among the 57 stocks in the Internet industry, it’s ranked #1. Alibaba Group Holding Limited (BABA) BABA operates as an online and mobile commerce company in China, providing internet infrastructure, e-commerce, online financial, and internet content services. It has operations in four primary segments – Core Commerce, Cloud Computing, Digital Media and Entertainment, Innovation Initiative, and others. BABA owns and manages both wholesale and retail marketplaces, and third party online and mobile commerce platforms. For the fiscal first quarter that ended in June 2020, BABA reported EPS of $2.15, implying an increase of 18% year-over-year and an earnings surprise of 7.5%. BABA had also beaten the street estimate by 50.6% in the previous quarter. Moreover, the company consistently delivered earnings surprises in the trailing four quarters. The street expects EPS to grow 14% year-over-year in the fiscal second quarter to $2.11. Revenues increased 34% year-over-year to $21.76 billion as annual active consumers on retail marketplaces reached 742 million, an increase of 16 million compared to the preceding quarter. The mobile monthly active users increased by 3.3% quarter-over-quarter to 874 million. Income from operations came in $4.91 billion, increasing 42% compared to the year-ago quarter. Net income rose 28% from the comparable quarter last year to $5.58 billion. BABA has recently entered into a strategic collaboration with Total (China) Investment by signing a memorandum of understanding (MoU). The agreement aims to drive the digital transformation of their operations in China and globally. The company is also in talks to hike its stake in a Chinese courier major, YTO Express. The stock closed Friday’s trade at $289, after hitting an all-time high of $292.48 during the week. It has gained more than 36% year-to-date. It’s no surprise that BABA is rated a Strong Buy in our POWR Ratings system It has a grade of A for Trade Grade, Buy & Hold Grade, and Peer Grade, and a B in Industry Rank. It is also ranked #1 out of 115 stocks in the China industry. NVIDIA Corporation (NVDA) NVDA operates as a visual computing company worldwide. It deals in graphics processing unit (GPU), PC gaming, tegra processor and artificial intelligence (AI). The company serves four markets — Gaming, Enterprise, High Performance Computing & Cloud, and Automotive. NVDA has recently reported the financial report for its fiscal second quarter that ended in July. EPS for the quarter came in at $2.18, beating the street estimate by 10.7%. This also implies a year-over-year growth of 76%. The company had also beaten the consensus estimate by 6.5% in the preceding quarter. Moreover, the company consistently delivered earnings surprises in the trailing four quarters. Consensus EPS estimate for the current quarter stands at $2.57, indicating a year-over-year increase of 44.4%. The company had an excellent second quarter as its top-line was up 50% year-over-year to $3.87 billion, and its Record Data Center business revenue of $1.75 billion was up 167% from the comparable quarter last year. With the cult of cloud computing in this “new normal,” the company’s high-performance computing & cloud segment is experiencing accelerated growth. Net income increased 79% year-over-year to $1.37 billion. NVDA announced a collaboration with Mercedes-Benz to develop a revolutionary in-vehicle computing system for autonomous cars. NVDA is also planning to collaborate with the University of Florida to build the world’s fastest AI supercomputer in academia. Moreover, Voyage’s third-generation robotaxi, the G3, used NVDA DRIVE AGX Pegasus for self-directed transportation. NVDA closed Friday’s trading session at $525.91 after hitting an all-time high of $525.92. The stock is up 123% year-to-date and has gained more than 94% in the past six months. NVDA is rated a Strong Buy in our POWR Ratings system, consistent with its strong fundamentals and impressive performance in the prior quarter. It also has a grade of A for Trade Grade, Buy & Hold Grade, Peer Grade, and Industry Rank. In the 86-stock Semiconductor & Wireless Chip industry, it is ranked #2. Want More Great Investing Ideas? 7 Best ETFs for the NEXT Bull Market Beware Stocks in September? 9 “BUY THE DIP” Growth Stocks for 2020 MSFT shares were trading at $226.59 per share on Monday afternoon, down $2.32 (-1.01%). Year-to-date, MSFT has gained 44.83%, versus a 10.22% rise in the benchmark S&P 500 index during the same period."}]}