{"article": [{"url": "https://stocknews.com/news/spy-bstz-bst-asg-hql-10-big-dividends-set-to-soar-before-2021/", "published": 1596802100.0, "headline": "10 Big Dividends Set to Soar Before 2021", "body": "After watching the S&P 500 crash, then levitate, over the past seven months, I’ve come to one conclusion: high-yield closed-end funds (CEFs) are disrespected now—and that makes them a great contrarian buy. Sure, some CEFs are cheap for a reason (I’m looking at you, energy funds). But there are plenty of undervalued winners, too. And plenty of CEFs have crushed the market this year, including 10 that have returned more than 8%. This top-10 list, which I’ll show you below, includes CEFs that have doubled, tripled—and even quadrupled the S&P 500’s (SPY) 4% return. What’s more, these funds all have one thing in common that sets them up for even bigger gains: strong management, proving once again that who manages your money is just as important as what you invest in—especially if you’re looking to boost your portfolio’s income stream with the 7% (or higher) dividends the typical CEF throws off. 9 \"BUY THE DIP\" Growth Stocks For 2020Contrarian Signal Flashes BUY Here’s the funny thing: of the nearly 500 CEFs tracked by my CEF Insider service, just over a quarter have made money in 2020, based on their market-price returns. Unfortunately that’s where most first-level investors stop. But we need to go further, because this headline figure is partly a trick of the CEF structure. You see, unlike with exchange-traded funds (ETFs), CEFs’ market prices trade independently of their net asset value (NAV, or the value of a CEF’s portfolio). So, by tracking CEFs’ NAV, we can see how the managers themselves are doing, not the market’s perception of how they’re doing. And the NAV-performance story is much different from what the market price tells us, with nearly half of all CEFs up on a NAV basis in 2020. What all of this tells us is that the CEF market is not overheated, and there are still plenty of bargain opportunities out there for savvy fund pickers. In bull-market years, like 2013 and 2017, CEF market prices tended to rise higher than NAV prices as investors got greedy. While we’ve seen a remarkable recovery since April, we haven’t seen an aggressive bidding of CEFs to cause them to be overpriced. This is crucial at a time when we’ve seen trades in Facebook (FB), Apple (AAPL), Amazon (AMZN), Netflix (NFLX) and Google (GOOG) get extremely crowded. That’s not to mention the parabolic price charts for Kodak (KODK), Tesla (TSLA) and Zoom (ZM). These overhyped assets may have gotten too expensive, but CEFs have not. The 10 Best CEFs of 2020 If CEFs are relatively undervalued, which ones are the best for boosting our portfolio value and paying us high, reliable dividends? There’s no one answer, as the best CEFs change regularly. But there are some CEFs that have done a great job of both preserving and growing investors’ capital in a challenging year. Here are 10, many of which will be familiar to members of my CEF Insider service, including our first two entries, which we rode to fast returns of 21% and 26%, respectively. Symbol Name Asset Class Market-Price Return BSTZ BlackRock Science & Technology Trust II US Stocks 16.9% BST BlackRock Science and Technology Trust Covered-Call Stocks 15.5% ASG Liberty All-Star Growth US Stocks 15.1% BHK BlackRock Core Bond Diversified Bonds 12.0% ETJ Eaton Vance Risk-Managed Diversified Equity Income Covered-Call Stocks 9.9% MQY BlackRock MuniYield Quality Municipal Bonds 9.7% TDF Templeton Dragon Fund Asian Stocks 9.5% THW Tekla World Healthcare Fund Healthcare 9.2% HQL Tekla Life Sciences Investors Healthcare 8.5% BBN BlackRock Taxable Municipal Bond Municipal Bonds 8.1% As you can see, this is a diverse list, including funds focusing on tech, healthcare, Asian markets and municipal bonds. This is unusual; in most years, the top performers tend to be from two sectors or asset classes, at most. Here we’ve got six. To be sure, the best performers in the chart above are either focused on growth stocks—such as the Liberty All-Star Growth Fund (ASG) and Eaton Vance Risk-Managed Diversified Equity Income Fund (ETJ)—or tech, such as the BlackRock Science & Technology Trust (BST) and BlackRock Science & Technology Trust II (BSTZ). That shouldn’t surprise anyone who’s been following the market. But it isn’t all about tech and growth: a diversified portfolio of the above CEFs would still deliver a market-price-based return well above 8%. Plus there’s the income. Check out these yields: Symbol Name Dividend Yield BSTZ BlackRock Science & Technology Trust II 5.1% BST BlackRock Science and Technology Trust 5.1% ASG Liberty All-Star Growth 7.4% BHK BlackRock Core Bond 5.1% ETJ Eaton Vance Risk-Managed Diversified Equity Income 9.4% MQY BlackRock MuniYield Quality 4.5% TDF Templeton Dragon Fund 0.9% THW Tekla World Healthcare Fund 9.7% HQL Tekla Life Sciences Investors 7.5% BBN BlackRock Taxable Municipal Bond 5.2% With the exception of the Templeton Dragon Fund (TDF), these funds all yield more than 4%, with payouts as high as 9.4% on the table. Since the yield on the average CEF is around 7%, these big dividends are no surprise—they’re just one of many reasons why CEFs are so compelling now. Want More Great Investing Ideas? Free Report: 5 Bargain Funds with Safe 11% Dividends A “1-Click” Way to Grab Safe 8% Dividends The $43,000 “dividend secret” Wall Street hides from you SPY shares were trading at $334.19 per share on Friday morning, down $0.14 (-0.04%). Year-to-date, SPY has gained 4.90%, versus a % rise in the benchmark S&P 500 index during the same period."}]}