{"article": [{"url": "https://stocknews.com/news/asx-nok-bb-3-5g-stocks-under-5/", "published": 1594987700.0, "headline": "3 5G Stocks Under $5", "body": "5G stands for 5th generation. It is becoming the new global standard wireless network. It is designed to connect everything from people to machines. It delivers higher data speeds, ultra-low latency, increased availability, and vast network capacity. Essentially, it will dramatically improve network connections. 5G is expected to impact every industry, not just smartphones. It will make transportation safer, increase remote healthcare abilities, and more. It will also support newer technologies such as the Internet of Things (IoT). The technology could also drive global growth as it is expected to support 22.3 million jobs in an array of industries. 5G stocks offer investors a way to tap into this monumental shift in communication technology. This technology is just starting to take off and is positioned to be the future of networking, so 5G stocks should see gains in both the near term and long term. 7 Best ETFs for the NEXT Bull MarketHere are three stocks under $5 that should benefit as the world switches to 5G. ASE Technology Holding Co., Ltd. (ASX) Headquartered in Taiwan, ASX provides a range of semiconductors packaging and testing, and electronic manufacturing services in the United States, Taiwan, Asia, Europe, and internationally. With political tensions in China, ASX has emerged as one of the top exporters of semiconductors and related equipment to the Western countries at a lower cost. ASX stands to gain significantly from the 5G boom, as the demand for semiconductors, an essential item in the network towers, are cautiously increasing. The company recently released its unaudited revenues for the second quarter and the last two months. Net revenues for the quarter increased 22.9% year over year to $3.6 billion, which is really impressive. Net revenues for June also increased by 21.8%. Also, the revenues for ATM assembly, testing and material business increased 21% for the quarter to $3.2 billion. The consensus EPS estimate of $0.04 for the second quarter indicates a year-over-year increase of 100%. ASX’s earnings surprise history looks impressive as well, with the company beating consensus EPS estimates in each of the last three quarters. ASX gained more than 45% since hitting its 52-week low of $3.17 in March due to the pandemic-led market crash. ASX’s POWR Ratings reflect a promising outlook. It has an overall rating of “Buy” with an “A” for Trade Grade and Industry Rank. Nokia Corporation (NOK) This global network and technology company needs no introduction; every household is familiar with Nokia for its wide range of cell phones. NOK is currently one of the major players in the 5G competition. With the ban of Huawei in the UK due to national security concerns, NOK and Ericsson have formed a duopoly in the telecom market there. NOK has recently announced a partnership with US-based network communications company Windstream Holdings. This partnership will substitute Windstream’s legacy core router platform with 7750 service routers. This will help US customers experience seamless connectivity. This joint venture could bring both NOK and Windstream Holdings closer to successfully providing 5G connectivity to citizens of both the UK and the US. Moreover, NOK’s 5G PBR technology in collaboration with ReefShark is expected to significantly drive down product costs, increasing its profitability. NOK recently announced a software-based upgrade that will enable its 4G/LTE radios to be migrated seamlessly to 5G/NR. This should also bode well for the stock. NOK beat consensus EPS estimates in two of the trailing four quarters. The stock gained more than 80% since its 52-week low of $2.34 in March due to the pandemic-driven market crash. NOK is graded “B” in Industry Rank as per our POWR ratings. In the Technology – Communication/Networking industry, it is ranked #14 out of 51 stocks. BlackBerry Limited (BB) Headquartered in Canada BB is another major stock trading under $5, which is a participant in the 5G race. Known for its software-oriented security services, Blackberry is a popular name in the tech industry. BB devices are gaining significance with increasing fears of espionage and data security threats faced by many countries, due to its sound cybersecurity management and embedded and encrypted software. BB has over 38,000 patents that stand to benefit from the 5G boom. These technology patents are useful for building smart homes and driverless cars. The demand for these patents is likely to pick up after 5G rolls out, generating substantial revenue for BB. Like NOK, BB was once known for its cell phone models. However, it could not keep up with its competitors and reduced its focus on this area over time. BB has been concentrating on becoming a major service-oriented company and gaining a major market share in the 5G space. BB’s year over year revenue declined by over 20% in the first quarter ending May. The company experienced a net loss of $636 million in the wake of the lockdown. The profit margin of BB also fell by over $34 million in this quarter. The consensus EPS estimate of $0.02 for the second quarter compared to breakeven earnings in the year-ago quarter. The consensus revenue estimate for the quarter is $237.95 million. BB has an impressive earnings surprise history and the company beating consensus ESP estimates in each of the trailing four quarters. BB recovered 63.73% after hitting a low of $2.84 in March due to a pandemic driven stock market crash. Want More Great Investing Ideas? 9 “BUY THE DIP” Growth Stocks for 2020 Newly REVISED 2020 Stock Market Outlook 7 “Safe-Haven” Dividend Stocks for Turbulent Times ASX shares were trading at $4.61 per share on Friday afternoon, down $0.07 (-1.50%). Year-to-date, ASX has declined -17.09%, versus a 0.84% rise in the benchmark S&P 500 index during the same period."}]}