{"article": [{"url": "https://stocknews.com/news/ccj-bkep-dnn-scoop-up-these-3-energy-companies-with-low-debt/", "published": 1596456500.0, "headline": "SCOOP UP These 3 Energy Companies with Low Debt", "body": "Low debt stocks have always been popular among risk averse investors due to the financial stability of the underlying companies. However, as the pandemic has affected business operations in almost all industries, it has become important to check a company’s ability to withstand a potential liquidity crisis before betting on its stock. So, as a result, stocks of companies with a reasonable debt profile are gaining popularity. The energy industry has witnessed a slowdown in the first half of 2020 due to a partial or complete halt of the manufacturing sector. in energy companies at these low prices could generate substantial gains in the future. However, high debt levels could be a concern for most of the energy players. Companies with a low debt to equity ratio usually survive any crisis better than those with high a debt-to-equity ratio. Energy companies are typically highly leveraged and have a higher default risk. However, given an inelastic demand for energy, they offer steady returns. So, energy stocks with low debt could be a good play. 9 \"BUY THE DIP\" Growth Stocks For 2020In addition to a potential move higher, the following low-leveraged energy stocks offer dividend income: Cameco (CCJ), Blueknight Energy Partners (BKEP), and Denison Mines (DNN). Cameco Corporation (CCJ) CCJ is involved in the mining, milling, purchase, and sale of uranium. The company has a mining property in Canada which sells uranium and fuel services to nuclear power plants across America, Europe and Asia. The covid-19 crisis led to a sharp decline in the demand for uranium, as industrial operations came to a standstill earlier this year. With a rise in maintenance costs, CCJ saw a decline in its net quarterly revenues for the second quarter. Nonetheless, the demand for its fuel services operations are spiking due to the need for emission-free electricity in the expanding healthcare sector and reopening manufacturing sector. CCJ has restarted operations in its Blind River refinery, and plans to reopen Cigar Lake mine by September. CCJ’s long term debt has been gradually declining since the third quarter of 2018 and currently stands at $0.72 billion. Its debt growth rate is higher than only 6.8% of the companies in the StockNews.com universe, with a year-over-year decrease of 40.1%. CCJ has a steady debt to equity ratio of 0.20. So, the stock is ideal for investors looking for a low debt company. CCJ pays an annual dividend of $0.06 per share, which yields 0.59% based on its current price. The company’s free cash flow is greater than 99.39% of the dividend paying stocks in the stocknews.com universe, ensuring sustainable dividend payouts in the future. CCJ’s EPS is expected to grow 9.8% annually over the next five years. The stock has gained more than 120% since hitting its 52-week low of $5.30 on March 18th. In fact, CCJ hit its 52-week high on June 27th. How does CCJ stack up for POWR Ratings? A for Trade Grade B for Buy & Hold Grade B for Industry Rank B for Overall POWR Rating It is also ranked #7 out of 33 stocks in the Industrial – Metals sector. Blueknight Energy Partners, L.P. (BKEP) BKEP provides integrated terminalling, gathering, and transportation services for companies engaged in the production, distribution, and marketing of liquid asphalt and crude oil products in the United States. It owns and operates a mid-continent pipeline system of approximately 611 miles for transporting large amounts of crude oil to refiners or terminalling facilities, along with 63 trucks. BKEP’s long term debt for the quarter ending March 31st was $0.28 billion, which remained almost stable over the last few quarters. BKEP pays an annual dividend of $0.16 per share, which yields 11.19% based on its current price. The company has been paying dividends periodically since 2012, making it a reliable stock for income investors. BKEP did not lower its dividend payout in 2020 despite reporting break-even profits. Though crude oil demands fell significantly in the first quarter of 2020, BKEP generated an operating income of $2.8 million through its storage business. Asphalt terminalling segment volume increased 17% year over year during the quarter. Moreover, BKEP’s consensus EPS estimates indicate a 4% annual growth for the next five years. BKEP gained more than 160% since hitting its 52-week low of $0.53 on March 18th. BKEP is rated a “Buy” stock in our POWR Ratings system, consistent with its sound business model and financial stability. It has an “A” in Trade Grade and Peer Grade, and a “B” in Buy & Hold Grade. It is ranked #4 out of 18 stocks in the MLPs – Other. Denison Mines Corp. (DNN) DNN is a uranium exploration and development company based in Canada, with a 90% ownership stake in Wheeler river uranium Project. DNN has completed the J-zone uranium deposit mining study using the In-situ recovery (ISR) method and is currently preparing for the Preliminary Economic Assessment (PEA). This is expected to play an important role in the field of uranium mining, giving DNN a significant advantage over its competitors. DNN has one of the lowest debt-to-operating expenses ratios, lower than 99.7% of the U.S. stocks in the StockNews.com universe. Its debt has declined 100% year over year. DNN gained more than 145% after hitting its 52-week low of $0.19 on March 16th due to the pandemic driven market crash. DNN is rated a “Buy” in our POWR Ratings system, with an “A” in Trade Grade, and a “B” in Buy and Hold Grade and Peer Grade. Out of 15 stocks in the Miners- Diversified industry, DNN is ranked #6. Want More Great Investing Ideas? 9 “BUY THE DIP” Growth Stocks for 2020 How HIGH Can This Tech Bubble Fly? 7 “Safe-Haven” Dividend Stocks for Turbulent Times CCJ shares were trading at $10.25 per share on Monday afternoon, up $0.09 (+0.89%). Year-to-date, CCJ has gained 15.17%, versus a 3.37% rise in the benchmark S&P 500 index during the same period."}]}