{"article": [{"url": "https://stocknews.com/news/grwg-why-is-growgeneration-skyrocketing-this-week/", "published": 1597752500.0, "headline": "Why is GrowGeneration Skyrocketing This Week?", "body": "GrowGeneration (GRWG) is the largest hydroponic equipment supplier in the United States, with 28 organic garden centers, across 10 states. The company sells thousands of products, from organic nutrients, soils, advanced lighting technology, to state-of-the-art hydroponic equipment used by commercial and home growers. The company also sells propagation supplies, pest controls, environmental controllers, and ventilation solutions. GRGW also offers greenhouse design solutions and harvesting solutions at any scale with a team of experts on call 24/7 to assist all growers. The company, which is located in Denver, started with Pueblo Organics and Hydroponics, which was the first location that GRGW acquired. This laid the foundation and allowed their team to develop the company into what it is today. 7 \"SAFE HAVEN\" Dividend Stocks for Turbulent TimesGRWG has been one of the hottest cannabis stocks lately, and despite hitting 52-week highs over the last few weeks, the stock has doubled over the last few trading sessions. This is due to its most recent quarterly report. The company’s revenues were up 123%, to $43.5 million for the second quarter. Same store sales were up 49% to $25.1 million. These results mark the company’s 10th consecutive quarter of record revenues. Management estimates that roughly 1,000 hydroponic stores are in operation in the U.S. By 2020, the market is estimated to reach over $23 billion with a compound annual growth rate of 32%. Capital seems to be flowing back into the cannabis sector, but only for American companies. This favorable environment will allow companies like GRWG to continue to reward shareholders as long as they continue to deliver results. Of the 6 analysts covering the stock, all 6 maintain a buy rating with an average price target of $12.33, which indicates that the stock could be overvalued. However, with the cannabis sector just starting to make an attempt at a recovery, GRWG could still have plenty of upside. Want More Great Investing Ideas? The Best of StockNews 3 Possible Directions for the Stock Market from Here 9 “BUY THE DIP” Growth Stocks for 2020 GRWG shares were trading at $18.20 per share on Tuesday morning, up $2.04 (+12.62%). Year-to-date, GRWG has gained 343.90%, versus a 6.00% rise in the benchmark S&P 500 index during the same period."}]}