{"article": [{"url": "https://stocknews.com/news/lulu-is-lululemon-a-buy-and-hold-for-the-next-decade/", "published": 1598962100.0, "headline": "Is lululemon a Buy and Hold for the Next Decade?", "body": "Right now, investing in retail stocks seems like a terrible option. The COVID-19 pandemic has decimated companies in the retail space due to countrywide lockdowns and business closures. Over 40 retail companies have filed for bankruptcy and this number may move higher by the end of 2020. However, retail companies such as lululemon (LULU) may buck the trend and come out stronger from the crisis. While the shift in consumer shopping trends will continue to impact apparel-focused businesses in the near-term, lululemon is well poised to deliver impressive gains to long-term investors. lululemon’s business overview 9 \"BUY THE DIP\" Growth Stocks For 2020lululemon athletica designs, distributes, and retails its portfolio of healthy lifestyle inspired athletic apparel and accessories. It also offers other fitness-related accessories and continues to benefit from the growing number of people that participate in yoga and related fitness programs. Though women make up the company’s primary and largest customer group, lululemon also design’s a comprehensive men’s line. The company generates the majority of sales from North America and continues to gain traction in Europe, China, and other Asian markets. lululemon has two primary business channels that include company-operated stores and direct to consumers. It also generates revenue from outlets, wholesale accounts, warehouse sales, license and supply agreements, and temporary locations. Its direct to consumer (DTC) segment includes revenue from e-commerce and mobile apps on in-store devices that allow demand to be fulfilled by the company’s distribution centers. It ended in fiscal 2019 with 491 stores in 17 countries. It opened 51 new stores in fiscal 2019 that include 32 stores outside North America. The company also closed four lululemon and two ivivva branded stores based on ongoing evaluations of its portfolio of company-owned stores. lululemon said, “Our real estate strategy over the next several years will not only consist of opening new company-operated stores, but also in overall square footage growth through store expansions and relocations.” Direct to consumer sales key amid pandemic Due to store closures, lululemon’s DTC sales will be a key driver of its topline. In fiscal 2019, DTC sales accounted for 28.6% of net revenue and was an effective channel to build brand awareness in new markets. Lululemon continues to integrate its digital and physical channels to increase customer engagement and provide a robust omnichannel experience. In the fiscal first quarter of 2020, the company’s sales fell 17% year-over-year to $652 million due to store closures. However, its e-commerce sales rose 68% to $352 million, up from $209.8 million in the prior-year period. DTC sales accounted for 54% of revenue, up from 26.8% in the prior-year period. lululemon closed four company-owned stores in the U.S. and two in Canada in the Q1. However, it also opened four stores in Asia, ending the quarter with 489 company-owned stores. Why is the retail giant a long-term winner? The retail industry has low entry barriers which mean there is a lot of competition for apparel companies. However, competition in the athletic apparel space is primarily based on brand image and recognition of product quality, style, innovation, distribution, and price. lululemon is confident about its ability to successfully compete on the basis of its premium brand image and product innovation. Its vertical retail distribution strategy and community-based marketing allow the company to control its brand image and connect with the consumer. The company has managed to successfully grow revenue and earnings over the last few years by expanding its product portfolio and releasing popular products to its loyal customer base. lululemon recently announced the acquisition of MIRROR, an in-home fitness company for $500 million. This acquisition is expected to bolster lululemon’s digital sweat-life offerings and will complement the company’s product portfolio. MIRROR offers weekly live sessions and thousands of on-demand workouts including one-on-one personal training. It has experienced rapid growth and strong engagement since it was launched in 2018, driven by rising demand for in-home fitness products. This acquisition will help lululemon to drive top-line growth at a rapid pace and offset a part of the decline experienced due to COVID-19. lululemon sales have increased from $2.06 billion in fiscal 2015 to $3.98 billion in fiscal 2019. Comparatively, its net income has risen from $266 million to $645 million in this period. While sales growth is expected to be flat in fiscal 2020, analysts expect it to expand by 26% to $5.02 billion in 2021. Comparatively, earnings are forecast to rise by 50.4% year-over-year in 2021, after shrinking 15% this year. Analysts expect earnings to rise at an annual rate of 16% in the next five years. A look at lululemon’s valuation lululemon stock went public back in July 2007 and has since returned a staggering 2,570%. This means a $1,000 investment in lululemon in July 2007 would have ballooned to $26,700 today. Shares recently touched a record high and have gained close to 200% since they bottomed out in March 2020. lululemon stock is valued at a market cap of $48.9 billion which means its trading at a forward price to sales multiple of 12.3x. It also has a high forward price to earnings multiple of 89.7x. The final takeaway The company is aggressively expanding in China and other emerging economies in South East Asia which will continue to drive top-line growth in the upcoming decade. The high valuation metrics for lululemon should not dissuade investors. Growth stocks command a premium valuation due to their expected revenue and earnings expansion. lululemon stock should be on the radar of long-term investors given its strong brand recognition, rising e-commerce sales, and expansion in international markets. Want More Great Investing Ideas? 7 Best ETFs for the NEXT Bull Market Beware Stocks in September? 9 “BUY THE DIP” Growth Stocks for 2020 LULU shares were trading at $386.28 per share on Tuesday afternoon, up $10.61 (+2.82%). Year-to-date, LULU has gained 66.74%, versus a 10.20% rise in the benchmark S&P 500 index during the same period."}]}