{"article": [{"url": "https://stocknews.com/news/pffa-an-etf-that-pays-10-with-41-future-upside/", "published": 1594728500.0, "headline": "An ETF That Pays 10% With 41% Future Upside", "body": "If you are an income-focused investor, you likely feel that your investments have been left behind. The financial news covers the hot stocks such as Amazon and Tesla, which seem to set new record highs every day. Outside of the handful of top tech stocks, most investments have not recovered from the February and March stock market crash. A market event occurred in March that devastated high-yield investment prices, and which I have not seen reported anywhere in the financial news media. I call it a “liquidity event” when the market in the various high-yield sectors was filled with sellers, not matched by investors willing to buy. 7 \"SAFE HAVEN\" Dividend Stocks for Turbulent TimesOver the last few years before the COVID-19 outbreak, a popular investment strategy was to leverage the yields in the different high-yield sectors. This strategy put investment dividend-paying sectors such as REITs, finance REITs, master limited partnerships (MLPs), infrastructure stocks, business development companies (BDCs), and preferred shares into leveraged portfolios to boost the income even higher. Before the crash, there were dozens of ETFs and exchange-traded notes (ETNs), hundreds of closed-end funds (CEFs), and I suspect many private equity funds using leveraged high yield as their investment strategy. When the stock market started to decline in reaction to the coronavirus effect on the economy, the liquidity event occurred. As share prices fell, all of these leveraged portfolios quickly became overleveraged. To protect the equity, the funds started to dump shares to pay down debt to reduce the leverage. Dumping the shares, caused share prices to fall, increasing leverage ratios, triggering more selling, resulting in further share price declines. When the smoke cleared, with a matter of days, stocks in the high-yield sector had fallen by 60% to 90%. UBS, the sponsor of 2X leveraged ETNs, closed 17 funds over a ten-day period. These funds were sector focused on the high-yield groups listed above. To give perspective, during the stock market crash, the major stock indexes declined by about 30%. The liquidity event for leveraged funds pushed the high yield sector down more than double the decline of the broader stock market. Since the bottom in late March, the stock indexes have recovered all of the losses from the February through March crash. The high-yield sectors have recovered by a similar percentage, but since the losses were so much greater, these groups remain down 30% to 40% from the pre-crash levels. As a result, there remains tremendous value in the high-yield sectors. Now is the time to be aggressive, buying high-yield, and not afraid of the current market volatility. Virtus InfraCap U.S. Preferred Stock ETF (PFFA) Let me finish with an example and an opportunity. The Virtus InfraCap U.S. Preferred Stock ETF (PFFA) owns and actively manages a portfolio of preferred stock shares. In normal times, preferred stocks are very stable, with steady share prices and guaranteed dividends. Before the crash, PFFA traded in a range of $26 to $27 and carried an 8% yield. During the liquidity event, PFFA crashed to a low of $7.50, off 71%. The share price has more than doubled off the low to a current $17.60. However, this fund share price will eventually recover into the mid $20s. Investors get paid a current 10% yield while they wait for the gains. Want More Great Investing Ideas? Top Dividend Stock to Own! Download Free Report Today Buy These 3 High-Yield Dividend Stocks All Under $15 Buy and Hold These 3 Dividend Stocks Forever PFFA shares . Year-to-date, PFFA has declined -30.85%, versus a 0.11% rise in the benchmark S&P 500 index during the same period."}]}