{"article": [{"url": "https://stocknews.com/news/dhi-mth-len-3-homebuilders-for-the-summer-housing-recovery/", "published": 1594901300.0, "headline": "3 Homebuilders for the Summer Housing Recovery", "body": "The housing market tends to be strongest during the summer, as people take advantage of the warm weather to see open houses. There were some concerns that the housing market this year would be impacted by a weak economy. Instead, housing demand has been unexpectedly strong as the coronavirus has led to a surge of urban-dwellers moving to the suburbs. According to a Pew Research poll, 22% of Americans moved or know someone who moved due to the pandemic. Given that the coronavirus’ spread is not contained, this number will likely increase. 9 \"BUY THE DIP\" Growth Stocks For 2020This catalyst emerged while the fundamentals of the housing market were strong due to low mortgage rates and low housing supply. The homebuilders are a clear winner of this dynamic, as new homes will have to be built to meet this demand. Already, it’s evident in many of their stock prices which are now above their pre-coronavirus levels. Here are three of the best home builders for the summer housing recovery: D.R Horton, Inc. (DHI) DHI is a national home building company that focuses on the construction and sale of single-family houses. DHI’s affordable entry-level homes are attractive options for first-time homebuyers. In the second quarter, first time home buyers constituted 53% of its closings. Currently, DHI has 329,300 lots in inventory. DHI has exhibited significant volatility since the beginning of 2020 as it went from a 52-week high in February to a 52-week low in March on concerns that the coronavirus would impact housing demand. However, since the March lows, DHI has climbed 130% higher to recover these losses In the fiscal second quarter ended March 31st, net income per share increased 40% and consolidated revenues increased 9% year over year. DHI has an impressive earnings surprise history with the company beating consensus EPS estimate in each of the trailing four quarters. Moreover, the revenue estimate of $5 billion for the current quarter indicates an increase of 1.90% over the year-ago quarter. How does DHI stack up in the POWR Ratings? A for Trade Grade A for Buy & Hold Grade A for Peer Grade B for Industry Rank A for Overall POWR Rating You can’t ask for better. The stock is also ranked #1 out of 21 stocks in the Homebuilders industry. Meritage Homes Corporation (MTH) MTH is a residential home building company that builds single-family detached homes for active adult buyers. MTH’s virtual capabilities and its 24/7 mortgage pre-approval tools online make the purchase process more convenient and safe for home buyers. Its development of speculative homes helped it grow profits faster than its competitors before the pandemic. MTH ended the first quarter with almost $800 million in cash, over a billion dollars of total liquidity and a low net debt-to-capital ratio. Moreover, the company’s earliest debt maturity is in 2022. In the first quarter, MTH’s EPS increased 182% year over year and total orders increased by 23%. Also, entry-level orders grew to 61% of total orders as compared to 45% in the previous year. MTH’s strategy to target entry-level buyers over the years has significantly helped its performance. MTH hit its 52-week low of $25.24 in March due to the coronavirus-led market crash but has grown more than 225% since then. The consensus EPS estimate for the current quarter is $1.41, which is a modest improvement over earnings of $1.31 per share reported a year ago. Furthermore, MTH has an impressive earnings surprise history with the company beating consensus EPS estimates in each of the trailing four quarters. MTH’s strong financial flexibility and price momentum are reflected in its POWR Ratings, it has a “Strong Buy” rating with an “A” in Trade Grade, Buy & Hold Grade, Peer Grade, and a “B” in Industry Rank. Within the Homebuilders group, it’s ranked #2 out of 21 stocks. Lennar Corporation (LEN) LEN operates in various segments such as home-building, multifamily, and financial services. In the second quarter ended May 30th, there was a 27% year-over-year increase in earnings per share. This was due to continued operating leverage as well as effective technological and cost control measures. LEN’s financial services business recorded all-time high quarterly earnings of $150.6 million as compared to $62.5 million in the previous year. LEN’s reduced land spend and profitability improved the company’s cash flow which was $1.4 billion at the end of the quarter. Since its 52-week low of $25.42 on March 18th, LEN has grown by more than 150%. LEN’s earnings surprise history looks pretty impressive as well with the company surpassing consensus EPS estimates in each of the trailing four quarters. LEN’s POWR Ratings reflect a promising outlook. It has an overall rating of “Buy” with an “A” for Trade Grade and Peer Grade and a “B” for Buy & Hold Grade and Industry Rank. Among the 21 stocks in the Homebuilders group, it’s ranked #4. Want More Great Investing Ideas? 9 “BUY THE DIP” Growth Stocks for 2020 Newly REVISED 2020 Stock Market Outlook 7 “Safe-Haven” Dividend Stocks for Turbulent Times DHI shares . Year-to-date, DHI has gained 19.35%, versus a 0.69% rise in the benchmark S&P 500 index during the same period."}]}