{"article": [{"url": "https://stocknews.com/news/orly-aap-ctb-3-top-auto-parts-stocks-to-buy-as-new-vehicle/", "published": 1597666100.0, "headline": "3 Top Auto Parts Stocks to Buy as New Vehicle Sales Decline", "body": "The coronavirus has revolutionized the way we travel, as social distancing has become the “new normal.” Health advisors have been repeatedly preaching the importance of maintaining distance and avoiding crowds during these times. This has led to people staying away from commuting through public transportation. More and more individuals are trying to save up to buy a used car to meet their transportation needs. Also, individuals who had initially planned to upgrade their vehicles this year are also making minor changes by replacing worn-out automotive parts to ensure their existing vehicles remain functional for a longer time period. Either way, the use of old cars is driving demand for auto parts. The expected decline in new-vehicle retail sales in July is an indication that using old vehicles is now a trend. The latest forecast by J.D. Power and LMC Automotive indicate a 4% decline in retail sales of new vehicles from the pre-coronavirus forecast and a 9.5% decrease compared with July 2019. As a result, the demand for auto parts should remain high. Popular auto parts companies such as O’Reilly Automotive, Inc. (ORLY), Advance Auto Parts, Inc. (AAP), and Cooper Tire & Rubber Company (CTB) have managed to retain their market share and even churn out profits during the second quarter, when most companies in the auto industry are still reeling from the effects of the pandemic. While the United States economy shrank 33% in the second quarter, the shares of these companies gained more than 90%. These stocks are expected to keep gaining through the remainder of this year. 9 \"BUY THE DIP\" Growth Stocks For 2020O’Reilly Automotive, Inc. (ORLY) ORLY is an automotive aftermarket retailer of new and remanufactured hard parts and maintenance items in the United States and Mexico. It also provides enhanced programs and services such as oil filter, battery recycling and diagnostic testing, check engine light code extraction, custom hydraulic hoses, and more. ORLY’s products are designed for professional service markets as well as do-it-yourself customers. ORLY witnessed a slowdown in its business operations in the first quarter of 2020, and during the early days of the second quarter, due to the pandemic. However, a strong improvement in its sales performance in the latter part helped ORLY deliver record sales volumes in the second quarter. ORLY’s total sales grew 19.4% year-over-year to $3.09 billion in the second quarter ending June 2020. Its second quarter comparable sales increased 16.2% from its year-ago value, and 7.5% in the first two quarters of 2020. ORLY recorded a gross profit of $1.64 billion, up 20% year-over-year. Its operating income increased 48% from its year-ago value to $736 million, while net income grew 50% year-over-year to $532 million. Net cash from operating activities of $1.55 billion increased 85% year-over-year. The consensus EPS estimate of $5.93 for the third quarter ending September 2020 indicates a 16.7% increase year-over-year. Moreover, ORLY beat the street EPS estimates in three of trailing four quarters, which is impressive. The consensus revenue estimate of $2.93 billion for the ongoing quarter indicates a 10.1% growth from its year-ago value. ORLY gained more than 90% to hit its 52-week high of $487.95 in July after hitting its 52-week low in March. How does ORLY stack up for the POWR Ratings? A for Trade Grade A for Buy & Hold Grade B for Peer Grade B for Industry Rank A for Overall POWR Rating. You can’t ask for better. It is also ranked #1 out of 50 stocks in the Auto Parts industry. Advance Auto Parts, Inc. (AAP) AAP is a leading provider of automotive aftermarket parts, accessories, batteries, and maintenance items, with operations under three major brand names — Advance Auto Parts, Autopart International, and Carquest and Worldpac. It also offers its products and services online. AAP serves both do-it-for-me (professional) and do-it-yourself (DIY) customers. AAP signed a multiyear official partnership with NASCAR in June 2020 to serve as the series entitlement sponsor. AAP has become the “Official Auto Parts Retailer of NASCAR” by virtue of this deal. On August 12th, AAP launched the next iteration of its MotoLogic Repair and Diagnostics Tool, which stores vehicle data for enhanced search functionality and repair animations, along with quick access to original equipment manufacturer (OEM) repair and diagnostic content. The consensus revenue estimate of $2.38 for the about-to-be-reported quarter ending June 2020 indicates a 1.8% improvement year-over-year. Its EPS is expected to grow at 7.5% per annum for the next five years. AAP gained more than 120% since hitting its 52-week low of $71.33 in March. AAP is rated a Strong Buy in our POWR Ratings system, consistent with its growth potential from its strategic partnerships. It also has a grade of A for Trade Grade and Buy & Hold Grade. In the 50-stock Auto Parts industry, AAP is ranked #10. Cooper Tire & Rubber Company (CTB) CTB specializes in replacement tires for cars, motorcycles, light and heavy weight trucks. across North and South America, Europe and Asia. It operates through wholesale and retail chains, as well as digital channels. CBT introduced three-peak mountain snowflake certified Roadmaster RM258 WD tires on July 1st, a smoother winter traction. CBT tires have been selected as original equipment in the next generation Mercedes-Benz GLS SUV. CBT is in the process of making a planned investment of $55 million in its Serbian manufacturing plant to increase its production capacity. This expansion project is expected to cater to the rising demand in major European markets. CTB felt the effects of the pandemic well into the second quarter of 2020. In this regard, President & Chief Executive Officer Brad Hughes said, “As anticipated, the global pandemic significantly impacted our results in the second quarter. However, our performance materially exceeded our expectations.” CTB’s unrestricted cash and cash equivalents balance rose 383% year-over-year to $543 million due a decrease in capital expenditure and discretionary spending. The company reported a $1 million operating profit for the second quarter ending June 2020, which is a significant improvement over the $1 million loss incurred a year ago. The consensus EPS estimate of $0.64 for the third quarter ending September 2020 indicates a 10% improvement year-over-year. Also, CBT has an impressive earnings surprise history, as it beat the street estimates in three of the trailing four quarters. CTB gained more than 165% since hitting its 52-week low of $13.82 in March. The stock hit its 52-week high at $37.21 on August 11th. It’s no surprise that CTB is rated a Strong Buy in our POWR Ratings system. It has a grade of A in Trade Grade and Peer Grade, and a grade of B in Buy & Hold Grade and Industry Rank. It is also ranked #4 out of 50 stocks in the Auto Parts industry. Want More Great Investing Ideas? The Best of StockNews 3 Possible Directions for the Stock Market from Here 9 “BUY THE DIP” Growth Stocks for 2020 ORLY shares were trading at $469.74 per share on Monday afternoon, up $6.19 (+1.34%). Year-to-date, ORLY has gained 7.18%, versus a 6.12% rise in the benchmark S&P 500 index during the same period."}]}