{"article": [{"url": "https://stocknews.com/news/ramp-be-prepared-for-a-down-move-in-liveramp-holdings-under/", "published": 1601381300.0, "headline": "Be Prepared for a Down Move in LiveRamp Holdings, Under This Level", "body": "Shares of LiveRamp Holdings (RAMP) have been bouncing off of a support level for the past couple of months. If it breaks this support level, a significant down move can be expected. RAMPis a marketing technology company that provides data foundation, digital transformation, consumer engagement, and online marketing and analysis services. The company has been benefiting from an increased customer base and is investing heavily to promote growth. Take a look at the 1-year chart of RAMP below with the added notations: 9 \"BUY THE DIP\" Growth Stocks For 2020 Chart of RAMP provided by TradingView RAMP has formed an important level at $50 (blue) over the past year. $50 was resistance level several times before the stock broke higher in August, and it has been a support level many times since. RAMP is currently hovering above $50 now, and a decline could bring another test of the support level. If this level is broken, a short trade could be made below the $50 mark, with the expectation of a breakdown. Want to See My Favorite Stock Trades Today? The process I use to select these “Chart of the Day” stocks is just the starting point for what I put in my private portfolio. There I take a deeper dive into the stock market outlook. And determine which sectors are likely to outperform. Then and only then to do I pull the trigger on the most timely trades. If you would like to be notified of my best trades, then just click on the link below to get started! See Christian Tharp’s Top Stock Picks Now Have a good trading day! Christian Tharp, CMT @cmtstockcoach RAMP shares were trading at $53.39 per share on Tuesday morning, up $0.42 (+0.79%). Year-to-date, RAMP has gained 11.07%, versus a 5.24% rise in the benchmark S&P 500 index during the same period."}]}