{"article": [{"url": "https://stocknews.com/news/tan-icln-itb-xhb-4-strong-etfs-outperforming-the-market/", "published": 1602245300.0, "headline": "4 Strong ETFs OUTPERFORMING the Market", "body": "As the stock market climbs higher, there’s obviously more risk. Some concerns are a possible second wave, failure to reach agreement on another stimulus package in a timely manner, and potential for a “contested” election. Given these risks, it’s understandable if investors are wary of initiating new positions in stocks. Single stocks have additional risk due to the potential for an earnings miss or some problem with operations that could lead to a significant decline in price. One potential solution is ETFs which give investors exposure to equities while spreading out the risk. ETFs have risen to be a popular investment instrument, as investors can hedge their portfolio for higher returns without undue risks. ETFs such as Invesco Solar ETF (TAN), iShares Global Clean Energy ETF (ICLN), SPDR S&P Homebuilders 500 ETF (XHB), and iShares U.S. Home Construction ETF (ITB) have demonstrated strong performance throughout the pandemic. As renewable energy and construction companies are witnessing rising demand during this time, these ETFs are expected to soar even higher in the upcoming months. 7 Best ETFs for the NEXT Bull MarketInvesco Solar ETF (TAN) TAN focuses on investing in stocks exclusively operating in the solar power industry. Apart from solar power companies, TAN also invests in American Depository Receipts (ADRs) and Global Depository Receipts (GDRs). It is a passively managed ETF with $1.80 billion AUM and tracks the MAC Global Solar Energy Index. Its major holdings are Solaredge Technologies, Inc. (SEDG), Sunrun, Inc. (RUN), and First Solar, Inc. (FSLR). TAN has an expense ratio of 0.71% compared to a category average of 0.63%. It has returned 172.8% in the last six months, and 143.5% year-to-date. TAN pays $0.09 annually as dividends to its investors, which yields 0.18%. Its average four-year dividend yield stands at 1.9%. TAN has gained more than 265% since hitting its 52-week low of $21.14 in March. The ETF hit its 52-week high of $77.50 in October. How does TAN stack up for the POWR Ratings? A for Trade Grade A for Buy & Hold Grade A for Peer Grade A for Overall POWR Rating. You can’t ask for better. It is also ranked #1 out of 36 ETFs in the Energy Equities ETFs group. iShares Global Clean Energy ETF (ICLN) As the name suggests, ICLN invests in companies involved in generating clean renewable sources of power, through wind energy, solar energy, hydroelectricity, and geothermal power. With $1.76 billion AUM, ICLN closely tracks the performance of the S&P Global Clean Energy Index and currently has stocks of 46 companies in its portfolio. Its major holdings include Sunrun, Inc. (RUN), Solaredge Technologies, Inc. (SEDG), and Plug Power, Inc. (PLUG). ICLN’s expense ratio is 0.46% compared to the category average of 0.63%. It has returned 104.6% over the past six months, and 79.3%, year-to-date. It pays an annual dividend of $0.14, which yields 0.64% on the prevailing price. ICLN’s four-year average dividend yield is 2.4%. ICLN gained more than 165% to hit its 52-week high of $21.74 in October since hitting its 52-week low of $8.08 in March. ICLN is rated “Strong Buy” in our POWR Ratings system, with an “A” for Trade Grade, Buy & Hold Grade, and Peer Grade. It is ranked #2 out of 36 ETFs in the Energy Equities ETFs group. iShares U.S. Home Construction ETF (ITB) ITB invests in construction and home building companies operating in the United States. It is a passively managed fund with an AUM of $1.63 billion and closely follows the Dow Jones U.S. Select Home Construction Index. ITB’s major holdings include D.R. Horton Inc (DHI), Lennar Group (LEN), and NVR Inc (NVR). ITB has an expense ratio of 0.42%, comparatively lower than the category average of 0.55%. ITB has returned 82.8% to its investors in the last six months, and 33.1% year-to-date. ITB pays an annual dividend of $0.24, which yields 0.41% based on its current price. The ETF has a consistent dividend payout history, with a four-year average yield of 0.5%. ITB has gained more than 160% since hitting its 52-week low of $22.39 in March. The ETF hit its 52-week high of $59.18 in October. It’s no surprise that ITB is rated “Strong Buy” in our POWR Ratings system. It has an “A” for Trade Grade, Buy & Hold Grade, and Peer Grade. It is also ranked #2 out of 33 ETFs in the Industrials Equities ETFs group. SPDR S&P Homebuilders 500 ETF (XHB) XHB is another major ETF that primarily invests in home building and construction companies. It invests in both large and small-cap companies, thereby striking a balance between risk and return. XHB’s main holdings include Whirlpool Corp (WHR), Pultegroup Inc. (PHM), and Carrier Global Corp (CARR). It currently has an AUM of $982.53 million. XHB’s expense ratio of 0.35% is significantly lower than its category average of 0.55%. The ETF has returned 73.9% in the past six months and 24.4% year-to-date. It is also a reliable dividend ETF, with a consistent quarterly payout history for 7 years. XHB pays an annual dividend of $0.40, yielding 0.71% on its prevailing price. Its four-year average yield stands at 0.9%. XHB gained more than 135% to hit its 52-week high of $56.65 in October since hitting its 52-week low of $23.95 in March. XHB is rated as a “Strong Buy” ETF in our POWR Ratings system, with a grade of “A” in Trade Grade, Buy & Hold Grade, Peer Grade, and Industry Rank. It is ranked #5 out of 42 ETFs in the Consumer-Focused ETFs group. Want More Great Investing Ideas? 7 Best ETFs for the NEXT Bull Market What is the Cure for Stock Market Volatility? Chart of the Day- See Christian Tharp’s Stocks Ready to Breakout TAN shares rose $0.09 (+0.12%) in after-hours trading Friday. Year-to-date, TAN has gained 145.65%, versus a 9.31% rise in the benchmark S&P 500 index during the same period."}]}