{"article": [{"url": "https://stocknews.com/news/amzn-is-amazon-still-a-buy-after-gaining-75-in-2020/", "published": 1597838900.0, "headline": "Is Amazon Still a Buy After Gaining 75% in 2020?", "body": "When it comes to creating massive investor wealth, few companies have been as successful as Amazon (AMZN). This technology giant has returned 2,450% in the last 10 years. It means a $10,000 dollar investment in AMZN stock back in August 2020 would have ballooned to $245,000 today. In the last 20 years, these returns stand at a staggering 8,400%. Even though broader equity markets were pummelled due to COVID-19 in the first quarter of 2020, Amazon’s stock has generated outsized returns year-to-date and is up 75% this year. But we know past returns are insignificant to current retail investors. Let’s take a look to see if the company remains a strong bet for 2020 and beyond. An e-commerce giant 9 \"BUY THE DIP\" Growth Stocks For 2020Amazon is valued at a market cap of $1.66 trillion. It is the world’s largest e-commerce platform and its total online transaction value in the U.S. rose by 25.3% year-over-year to $221.96 billion in 2019, up from $177.1 billion in 2018, according to a digital commerce report. This suggests that Amazon accounted for 37% of total U.S. e-commerce sales in 2019 and over 57% of the country’s total e-commerce growth. Amazon continues to benefit from the shift to online shopping especially in these uncertain times where social distancing and countrywide lockdowns are the norms rather than the exceptions. The COVID-19 pandemic has accelerated the trend towards online shopping and it gave a significant boost to company sales in the last two quarters. In the first six months of 2020, AMZN sales were up 33.5% at $164.36 billion. During its Q2 earnings call, the company increased its grocery delivery capacity by 160% and tripled online grocery sales amid the pandemic. The retail e-commerce global sales are expected to grow from $3.53 trillion in 2019 to $6.54 trillion in 2023. Amazon should grow at a faster pace compared to the overall market making it an enviable bet among growth stocks. AMZN is the largest public cloud player While e-commerce is Amazon’s largest business segment, it generates significant profits from AWS (Amazon Web Services). AWS derives revenue from global sales of compute, storage, database, and other service offerings for start-ups, enterprises, government agencies, and academic institutions. In the second quarter of 2020, AWS sales were up 29% year-over-year and accounted for 12.2% of total sales. However, this business segment’s operating income accounted for 57.5% of total operating income. Further, Amazon Web Services accounts for 33% of the global cloud infrastructure market according to research firm Synergy Research Group. Synergy estimates global cloud infrastructure sales at $30 billion while the total for the past 12-months stands at $111 billion. Similar to e-commerce, Amazon’s Cloud Services business has also been immune to the COVID-19 pandemic. Jon Dinsdale’s Synergy’s chief analyst states, “As far as cloud market numbers go, it’s almost as if there were no COVID-19 pandemic raging around the world. As enterprises struggle to adapt to new norms, the advantages of public cloud are amplified”. He added, “The percentage growth rate is coming down, as it must when a market reaches enormous scale, but the incremental growth in absolute dollar terms remains truly impressive. The market remains on track to grow by well over 30% in 2020.” Amazon continues to dominate the global cloud space though it competes with tech heavyweights Microsoft, Google, Alibaba, and IBM that account for 18%, 9%, 6%, and 5% of the total IaaS market respectively. Other high growth businesses Amazon has several other businesses that are part of high growth segments. It acquired Twitch back in 2014 for $1 billion to gain traction into the game streaming market and complement its video streaming business. Twitch is the largest game streaming platform in the world right now. Further, Amazon Prime Video also continued to benefit from the pandemic and business lockdowns. As most entertainment avenues were shut, the global populace turned to online content to keep themselves occupied. Amazon Prime Video and other streaming peers including Netflix, in fact, had to reduce streaming quality when lockdowns were announced in March and April to handle the traffic load. AMZN is now the third-largest digital advertising platform after Alphabet’s Google and Facebook. The company provides ad services to sellers and publishers through sponsored ads, display, and video advertising. According to this Ad News report, Amazon’s ad sales were up 41% at $4.2 billion in Q2 and is one of the company’s fastest-growing businesses. Amazon forecasts sales between $87 billion and $93 billion in Q3 In the September quarter, Amazon forecast sales between $87 billion and $93 billion which were higher than the company forecast of $86.3 billion. Amazon also beat Q2 consensus revenue estimates of $81.53 billion by a fair margin when it reported $88.9 billion in sales. However what surprised investors were the company’s adjusted earnings of $10.3 per share which were 600% higher than analyst estimates of $1.46 per share. Amazon is well poised to generate market-beating returns in the upcoming decade and has multiple growth drivers to drive its top-line higher. Analysts expect sales to grow by 31.2% in 2020 to $368 billion and by 17.9% in 2021 to $434 billion. AMZN stock is valued at a forward price to sales multiple of 4.5x. Its forward price to earnings multiple of 105x might raise many eyebrows but the company continues to reinvest its profits into growth and expansion. Amazon has historically focused on top-line growth and sacrificed profit margins in its pursuit of market share. This strategy has helped the company gain leadership positions in several businesses and improve shareholder value. Further, analysts expect the company to increase earnings at an annual rate of 36% in the next five years which is impressive. The StockNews.com POWR Ratings are top-notch for AMZN, as it has a “Strong Buy rating.” It also has an “A” for Trade Grade, Buy & Hold Grade, Industry Rank, and Peer Grade. Among Internet Stocks, it’s ranked #1 out of 54. Amazon is a top stock given its expanding addressable markets, huge economic moat, rising market share, and improving margins. While it remains a top long-term bet, you can look to buy the stock at every possible opportunity that includes significant stock corrections. Want More Great Investing Ideas? The Best of StockNews 3 Possible Directions for the Stock Market from Here 9 “BUY THE DIP” Growth Stocks for 2020 AMZN shares were trading at $3,303.99 per share on Wednesday afternoon, down $8.50 (-0.26%). Year-to-date, AMZN has gained 78.80%, versus a 6.52% rise in the benchmark S&P 500 index during the same period."}]}