{"article": [{"url": "https://stocknews.com/news/spy-inx-aapl-qqq-tsla-will-stocks-fall-into-historical-september-slump/", "published": 1599048500.0, "headline": "Will Stocks Fall into Historical September Slump?", "body": "(Please enjoy this updated version of my weekly commentary from the Reitmeister Total Return newsletter). Our game plan was clearly stated, repeated, regurgitated and reemphasized throughout the past month. That being where we are in the midst of a stock market bubble with signs that the market may be ready to correct in September. That may just be a 5-10% decline as investors digest recent gains. But if I am right that the election tightens and economic data starts to soften, then a break below 3,000 could reawaken bearish spirits that could get us down to a more logical resting place of 2,500 to 2,700. 7 Best ETFs for the NEXT Bull MarketThat is why we took some profits off the table Friday and added more inverse ETFs to gain from any market downside that unfurls. As stated in the trade alert this is step 1 of 2 to get more defensive. Meaning that no one rings a bell at the top. So the perfect timing of this move to get more defensive is a bit tricky. Instead we are going to spread our bets around. Half of our inverse ETFs were bought on Friday 8/28. And the rest will come after some evident sign that investors are FINALLY coming to their senses that making new highs in the face of this recession is neither prudent nor sane. How is that going so far? Pretty good. That is hard to see through the fog of FAANG gains the barely kept the S&P above 3,500 today. Instead the Risk Off nature of the Monday session is better seen through the hefty 1%+ losses of small caps and mid caps stocks. Gladly we bought the inverse ETFs of those indices that nicely padded our portfolio. Even more telling than that is the fairly large retreat of the groups most tied to the negative economic consequences of the coronavirus. I am referring to restaurants, airlines, hotels, banks and energy. Our inverse ETF (ticker reserved for RTR subscribers) has a large allocation of those shares explaining its outsized +1.64% gain today. And PEJ, which we sold on Friday, fell a nasty -1.76%. There is not much to talk about on the economic front as things were fairly quiet during this past week. However, that drum beat will grow louder as this week progresses. Here is the lineup: Tuesday: ISM Manufacturing, PMI Manufacturing, Redbook Weekly Retail Sales Wednesday: ADP Employment Thursday: Jobless Claims, ISM Services, PMI Services Friday: Government Employment Situation As you will remember, a big part of our “Sell in September” thesis was based upon the idea that economic data would start to sour again. That’s because the pent up demand during Q2 should flush through the economy creating an artificial spike. Once that was dissipated then we would likely see a weakening of these reports that SHOULD wake up the rest of the investment community to the true poor state of the economy and thus illogic of current price levels. Thus, we will watch these reports closely looking for any such signs. On the price action front I sensed that 3,500 should be a spot of greater psychological resistance to make investors stop in their tracks and contemplate if rising above makes sense at this time. On top of that I saw this article about bullish investor, Art Hogan, who sees key technical indicators saying the market is overbought and due for a 5-10% correction. Here is that article for more insights. Finally an interesting note on two high profile stocks that had splits today. Apple and Tesla. Anyone who knows anything about investing knows that a split is a non-event that alters NOTHING about a stocks attractiveness. The only people who like them are rookies who join during stock bubbles who think something special has happened…which is why Apple rose +3.39% and Tesla accelerated +12.57% today. So yes, we already knew we were in a bubble. But it’s time these that rookies need to get taught a valuable lesson on how investing really works and the nature of risk and reward. I very much look forward to these shares tumbling along with the overall market this September as things SHOULD come back down to size. And then I want these investors so burned by this AWAKENING that they go away forever. Hopefully returning to sports betting or video games as their main hobbies and leaving the stock market to those who appreciate it as a more serious pursuit. Putting it altogether, we had a clear plan in August coming into September. That worked great as our portfolio outpaced the rising market. And now we see if indeed September = the flipping of the script with stocks heading lower. We have already made a quartet of moves to align ourselves with that on Friday. And ready to do more if there are signs of momentum to the downside. Stay ready and alert for any such moves to follow. Portfolio Update August was another solid month of growth for our portfolio capped off by today’s impressive +0.56% result versus the nasty red arrows across the broader market. Rolling back to mid June we have enjoyed a steady streak of outperformance as we have padded our wallets by +14.2%. This result is even more impressive when you remember that we never actually believed in the virtue of the bubble. We saw it for what it was and aligned ourselves with the prevailing trends. And now we prepare for a likely September sell off where other euphoric investors are due for a wakeup call that we received a long, long time ago. What To Do Next? Right now my Reitmeister Total Return portfolio has already taken one step to prepare for a likely September sell off. The rest of the moves will come when other investors slide into the normal seasonal patterns. All in all the portfolio looks like this right now: 5 long stocks & ETFs that are doing well during the Coronavirus recession. 3 precious metals ETFs because when the US government and Fed throw money out of a helicopter it devalues the dollar and makes precious metals all the more valuable. 3 small inverse ETF holdings that will grow larger as this mini-stock bubble is burst and stock fall back to a more reasonable valuation level. But let’s be honest with ourselves. Its crazy out there! That’s why I am trying my best to help investors make sense of it all and profit from whatever scenario comes our way. The best way for me to do that is give you 30 days access to the Reitmeister Total Return. This is my newsletter service where I share more frequent commentaries on the market outlook, trading strategy, and yes, a portfolio of hand selected stocks and ETFs to produce profits whether we have a bull…a bear…or anywhere in between. As shared above, the unique portfolio I have constructed at this time leans into the stocks that are benefiting the most from the current bubble. That explains how we continue to top the market at this time. Yet we are FULLY prepared for when the rug gets pulled out and stock prices better reflect the still dire economic situation. Just click the link below to see all 11 stocks and ETFs in this uniquely successful portfolio. Plus get ongoing commentary and trades to adjust your strategy as 2020 continues to the wildest market in history. Gladly it can be tamed. About Reitmeister Total Return newsletter & 30 Day Trial Wishing you a world of investment success! Steve Reitmeister …but everyone calls me Reity (pronounced “Righty”) CEO, Stock News Network and Editor, Reitmeister Total Return SPY shares rose $2.35 (+0.67%) in premarket trading Wednesday. Year-to-date, SPY has gained 10.68%, versus a % rise in the benchmark S&P 500 index during the same period."}]}