{"article": [{"url": "https://stocknews.com/news/spy-how-to-beat-the-stock-market-with-this-momentum-investing/", "published": 1597234100.0, "headline": "How to Beat the Market With This Momentum Investing Strategy", "body": "AAII Stock Ideas: Driehaus Revised Screening Strategy Today, I cover the Driehaus stock-picking strategy and send you a list of stocks that currently pass AAII’s revised screen based on the approach. The Driehaus strategy involves identifying and buying stocks in a strong upward price move and staying with them as long as the upward price movement continues. 7 Best ETFs for the NEXT Bull MarketDriehaus: A Momentum Investing Pioneer Momentum investing has been described as a strategy to capitalize on the continuance of an existing market trend. It involves buying stocks showing upward-trending prices. A momentum investing strategy also maintains that trends can persist for some time and that it’s possible to profit by staying with a trend until its conclusion, no matter how long that may be.Richard Driehaus probably isn’t a household name with individual investors, but he is considered by many to be the father of momentum investing. Driehaus’ success as a momentum investor propelled him to Barron’s All-Century Team in 2000 alongside such well-known investors as Peter Lynch and John Templeton.AAII attempts to capture the spirit of Driehaus’ momentum investing strategy based on information gleaned from the book “Investment Gurus” by Peter J. Tanous (New York Institute of Finance, 1997) and the February 2000 Barron’s article “The Driehaus Rules.” A Disciplined Approach Driehaus’ brand of momentum investing involves identifying and buying stocks in a strong upward price move and staying with them as long as the upward price movement continues. Specifically, he emphasizes a disciplined approach that focuses on small- and mid-cap companies with strong, sustained and accelerating earnings growth that are also generating “significant” earnings surprises.Driehaus believes in the ability to retreat and sell—cutting losses short—in order to survive to fight another day. He doesn’t obsess over his win-loss ratio (the number of winning trades relative to the number of losing trades). His focus is on how much he makes on his winners and how quickly he gets out of his losers. He has no problem selling a “good-looking” stock if its price is falling. He also looks to diversify during bad times and concentrate his holdings during good times.In contrast to successful value investors such as Benjamin Graham who seek out a margin of safety by trying to buy stocks that are trading well below their real value, Driehaus once said he took exception to the idea of buying low and selling high. He isn’t interested in picking up cheap stocks and waiting for them to recover. Instead, he stated that “I believe far more money is made by buying high and selling at even higher prices.” Driehaus doesn’t believe in a “right” price-earnings (P/E) ratio since it can be high or low depending on where the company is in its earnings stream. In fact, Driehaus feels that the real risk of investing is being too conservative. Focus on Earnings Driehaus sees earnings as the “fountainhead” of future stock price movements, specifically earnings growth. However, he looks at a variety of measures to evaluate earnings growth, including: Positive earnings surprises Sharp upward revisions in consensus earnings estimates Accelerating earnings (and sales) Very strong, consistent and sustained earnings growth Driehaus looks for strong sequential earnings growth—both on a quarter-over-quarter basis (the same quarter in sequential fiscal years) and on a quarter-to-quarter basis (i.e., the first quarter to the second quarter of the same fiscal year).Specifically, though, Driehaus sees positive earnings surprises as a primary catalyst for price increases. An earnings surprise takes place when a company announces earnings that differ from what analysts were expecting for that period. A positive earnings surprise occurs when a company reports earnings that exceed the consensus estimate, while a negative earnings surprise is when reported earnings fall short of the consensus estimate from analysts.However, just because a company reports a strong positive earnings surprise doesn’t mean the stock market will react positively and push the stock price higher. This is because often when companies report their quarterly results, they also offer guidance for future quarters and years. It is not uncommon to see a company report a large positive earnings surprise, only to see its stock price suffer due to disappointing earnings guidance for future periods. For that reason, Driehaus also pays attention to management guidance. This is often reflected in changes in the consensus estimates for future periods as analysts digest the revised guidance from the company and update their earnings models. The question Driehaus seeks to answer is how earnings growth—and positive changes in earnings—will impact the company’s stock, especially relative to market expectations.Lastly, Driehaus does not consider a company’s earnings in isolation. He also considers how a company’s earnings growth relates to the stock as well as the company’s sector and industry. In fact, Driehaus would rather buy the stock of a company that has less-powerful numbers relative to another if it is in a better industry. Earnings Growth Screens The revised Driehaus strategy has earnings growth as its cornerstone with a focus on recent earnings growth. To find stocks exhibiting sustained or increasing earnings per share growth, AAII’s Driehaus screen first identifies those companies whose year-over-year annual earnings are increasing. The first filters use the growth rates in earnings from continuing operations from year three to year two, from year two to year one and from year one to the trailing 12 months (last four fiscal quarters) and require earnings to be accelerating over each of those periods (the growth rate increases from period to period). The growth in earnings over the trailing 12 months compares the cumulative earnings over the last four quarters (quarters one through four) to the cumulative earnings over the four quarters prior to that (quarters five through eight).There is a balancing act when comparing year-over-year earnings growth. You want to use enough periods to try to capture a trend but don’t want to use too many where the rest of the market has realized the trend and bid up the stock price.Another filter stipulates that, at a minimum, a company has experienced positive earnings over the trailing 12 months. Again, the AAII screen compares earnings for quarters one through four to earnings for quarters five through eight. Many of the companies that pass the earnings growth filters are not yet profitable—they have not necessarily reported positive GAAP earnings per share for the trailing 12 months or for the last fiscal year. So, the screen requires that analysts are expecting positive pro forma earnings for the current fiscal year. This helps avoid turnaround situations that can complicate the company evaluation process.The Driehaus screen looks at same-quarter earnings growth (as compared to sequential). Comparing data for the same quarter in different fiscal years removes any seasonality from the earnings. If you were looking at the sequential earnings (i.e., quarter two to quarter one), seasonal fluctuations could significantly inflate the sequential growth one period and then create a high comparable number that would lead to a large decline the following quarter.The Driehaus screen seeks out those firms whose same-quarter earnings growth is accelerating. This screen compares the growth in earnings from continuing operations from quarter six to quarter two to the growth in earnings from quarter five to quarter one. So, in effect, the screen is looking for accelerating sequential quarterly earnings growth in same-quarter earnings.When examining earnings growth rates, it is important to keep in mind the base earnings value used to calculate the growth rate. Let’s consider, for example, two companies with 100% earnings growth from year two to year one. From a pure percentage basis, both companies appear to be on equal footing. However, when we look at Company A, we see that earnings have increased from $0.01 per share to $0.02 per share over the last year, while Company B saw its earnings rise from $0.50 per share to $1.00 per share. Looking at the raw data tells a very different story. For this reason, whenever you see very high growth rates, you should take a look at the underlying numbers to gauge the significance of the changes. Earnings Surprises After identifying companies with accelerating annual and quarterly earnings growth, the next step in the AAII Driehaus Revised momentum strategy is to look for companies most likely to continue that trend in earnings growth. One event Driehaus suggests seeking is a “significant” positive earnings surprise, where the company’s actual reported earnings exceed the consensus estimate.Earnings estimates are based on expectations of the future performance of a company; surprises signal that the market may have underestimated the company’s future prospects in its forecast.Driehaus does not quantify what he considers to be a “significant” earnings surprise. However, studies show that analysts tend to be pessimistic when it comes to their quarterly earnings estimates. Therefore, it is more likely that a company will report a positive earnings surprise than fall short of consensus estimates.The AAII Driehaus Revised strategy requires that the latest reported earnings for a company must have exceeded the consensus estimate by at least 5%. Earnings Revisions Beyond looking for companies reporting strong positive earnings surprises, Driehaus also suggests looking for upward revisions in future-period consensus earnings. These upward revisions are a proxy for stronger-than-anticipated company results or upward earnings guidance from management.When examining earnings revisions, there are both quarterly and annual estimates to consider. AAII’s Driehaus screen looks at revisions in the current and next fiscal year’s consensus estimates. Specifically, the consensus estimates for both the current fiscal year and the next fiscal year must have increased over the last month. Full-year estimates are considered more meaningful, since they cover longer periods than just a single quarter.In addition, there cannot have been any downward revisions over the last month to the consensus estimates for the current fiscal year or next fiscal year. Price Momentum As a momentum investor, Driehaus remains invested in a stock until he sees a change in the underlying company, industry/sector or overall market. He is quick to point out, however, that he is not a market timer. Instead, he goes where the data tells him to go (or not go). He has no qualms with buying a stock that has already seen a significant and rapid rise in price if he believes that momentum will continue.The only price momentum filter in the revised Driehaus screen is the requirement that price must have risen over the last four weeks. Small- and Mid-Cap Universe Driehaus focuses most of his energies on small- and mid-cap stocks, as they provide the growth he is looking for. Historically, and over longer periods, small-cap stocks have done better than larger stocks, with the trade-off of having higher volatility. However, most volatility measures consider both upside and downside volatility, and Driehaus doesn’t fear upside volatility.There are differing definitions of market-capitalization categories, but for the purposes of the AAII Driehaus screen, small- and mid-cap stocks are defined as those ranging from $50 million to $3 billion in market capitalization. Summing It Up The momentum approach to stock selection developed by Richard Driehaus seeks out companies with accelerating earnings growth, rising earnings estimates and meaningful positive earnings surprises to hit the “home run” that will provide above-normal returns. When investing in such potentially volatile stocks, it is very important to have a system in place that gets you out of a trade with only a minimal loss, while allowing the winners to ride until their momentum burns out. Stocks Passing the Driehaus Revised Screen (Ranked by 4-Week Price Change) The stocks meeting the criteria of the approach do not represent a “recommended” or “buy” list. It is important to perform due diligence. If you want an edge throughout this market volatility, become an AAII member. SPY shares fell $0.02 (-0.01%) in after-hours trading Wednesday. Year-to-date, SPY has gained 5.78%, versus a % rise in the benchmark S&P 500 index during the same period."}]}