{"article": [{"url": "https://stocknews.com/news/sap-ctxs-manh-logm-4-skyrocketing-software-application-stocks/", "published": 1595592500.0, "headline": "4 SKYROCKETING Software Application Stocks", "body": "Application software companies create and license software for a variety of uses. They provide application programs for students and businesses such as word processors, spreadsheets, accounting software, and more. The programs assist users in performing a specific task, such as calculating formulas. The software can be essential to a business’s bottom line. It can increase or measure productivity and help workers perform functions properly. Technology, in general, has benefitted from the shift to online working as the demand for personal computing has skyrocketed. Software application programs have especially benefited, as each new company comes pre-installed with software programs. All types of software applications are expected to grow exponentially as companies enter the digital age. Here are four companies whose stocks are soaring from this demand. 7 \"SAFE HAVEN\" Dividend Stocks for Turbulent TimesSAP SE ADS (SAP) SAP focuses on enterprise software for commerce, finance, asset management, marketing, manufacturing, and other spaces. SAP has recently announced a partnership with Siemens to develop the first integrated product lifecycle management software along with service, asset, and supply chain management. Further, SAP has recently launched the SAP Fieldglass External Talent Marketplace. This platform allows businesses to look for and employ temporary workers to support business operations. Despite the fact that this service is free until the end of the year, this move could add to its profitability in the long run. Earlier this month, SAP pre-announced its results for the quarter ended June 30th. Cloud revenue increased 21% while total revenue grew 2% year over year for the quarter. The IFRS operating profit saw an impressive increase of 55%. SAP has been performing pretty well in the “new normal.” It has added more than 70% to its stock price since this year’s low of $90.9 on March 19th due to the virus-driven market crash. How does SAP stack up for the POWR Ratings? A for Trade Grade A for Buy & Hold Grade A for Industry Rank A for Peer Grade A for Overall POWR Rating You can’t ask for better. The stock is also ranked #2 out of 82 stocks in the Software – Application industry. Citrix Systems, Inc. (CTXS) CTXS focuses on enabling mobile working environments by making apps, data, desktops, and communications available through any network and cloud. The company has recently entered into a partnership with Microsoft (MSFT) to enable companies to transition to cloud and remote workspaces. This move could enable high profitability for the company in this “new-normal”. In its earnings report for the quarter ended June 30th, CTXS declared a rise in subscription ARR of 54% and an increase in SaaS ARR of 41% year over year. Total revenue increased 7% over the year-ago number. CTXS’s earnings surprise history is impressive as well, with the stock beating consensus EPS estimates in each of the trailing four quarters. CTXS’s recent price performance reflects its ability to capitalize on the recent trend to go digital. The stock has gained more than 40% since hitting a year-to-date low in February. It’s no surprise that CTXS is rated “Buy” in our POWR Ratings system. It also has an “A” for Trade Grade, and a “B” for Peer Grade and Industry Rank. In the 47-stock Software – Business industry, it is ranked #17. Manhattan Associates, Inc. (MANH) MANH develops and offers software solutions for enterprises to manage inventory, supply chains, and omni-channels. The company has recently partnered with Ivanti Wavelink to offer voice-enablement for users of their Warehouse Management System. While MANH’s overall revenue for the second quarter declined on a year-over-year basis, it beat market expectations. Further, revenue for its cloud services has risen to $18.5 million compared to $9 million for the same period last year. The earnings surprise history for MANH looks pretty good, as the company beat the consensus EPS estimates in each of the trailing four quarters. MANH’s stock has recovered more than 160% from the 52-week low it hit in mid-March due to the market crash. The company’s strong recovery could be part of a growth momentum that could last well for the rest of 2020. MANH’s strong fundamentals are reflected in its POWR Ratings. It has a “Strong Buy” rating with an “A” in Trade Grade, Buy & Hold Grade, Peer Grade, and Industry Rank. Within the Software – Application group, it’s ranked #12 out of 82 stocks. LogMeIn, Inc. (LOGM) LOGM is a cloud solutions provider that allows people and businesses to securely connect with their customers, colleagues, and workplaces. The company has recently announced seven new hardware offerings within its GoToRoom huddle. This new integrated video conferencing platform will work for both home offices and large corporate meetings. The company is about to announce the results for its second quarter. The consensus EPS estimate of $1.23 for the quarter indicates a year-over-year increase of 5.1%. LOGM has an impressive earnings surprise history with the company surpassing consensus EPS estimates in each of the trailing four quarters. Moreover, the stock has been rising since hitting its year-to-date low of $69.05 on March 17th. LOGM gained more than 24% during this period, and the momentum might continue given its ability to capitalize on the trend to go digital. It’s no surprise that LOGM is rated “Strong Buy” in our POWR Ratings system. It also has an “A” for Trade Grade, Buy & Hold Grade, Peer Grade, and Industry Rank. In the 82-stock Software – Application industry, it is ranked #13. Want More Great Investing Ideas? 9 “BUY THE DIP” Growth Stocks for 2020 Newly REVISED 2020 Stock Market Outlook 7 “Safe-Haven” Dividend Stocks for Turbulent Times SAP shares were unchanged in after-hours trading Friday. Year-to-date, SAP has gained 19.62%, versus a 0.61% rise in the benchmark S&P 500 index during the same period."}]}