{"article": [{"url": "https://stocknews.com/news/penn-pfe-aapl-tsla-4-stocks-setting-up-for-big-moves-in-october/", "published": 1601554100.0, "headline": "4 Stocks Setting Up for BIG MOVES in October", "body": "After months of stocks soaring on the back of tech companies benefiting from a new remote “normal,” the stock market experienced its first losing month, since March. September ended with the S&P 500 down 3.9%, the Dow Jones Industrial Average down 1.2%, and the Nasdaq Composite index down 5.2%. Most S&P 500 index sectors were down for the month, with energy and communications services leading the way. The SPDR Select Energy ETF (XLE) was down 14.6% for the month. The lone sector up for the month was Utilities, as the SPDR Select Utilities ETF (XLU) was up 1.1%. The question is, where do we go from here? Investors are most likely cautious due to several factors, such as failed stimulus talks, a highly contested election, and a possible second wave of the virus that could send the economy off the cliff. While I don’t have a crystal ball that predicts the market’s direction, I can tell you that I expect big moves from the following stocks next month: Penn National Gaming (PENN), Pfizer (PFE), Apple (AAPL), and Tesla (TSLA). 7 \"SAFE HAVEN\" Dividend Stocks for Turbulent TimesPenn National Gaming (PENN) PENN is up a whopping 186.9% so far this year compared to a 24.7% loss for the Dow Jones U.S. Gambling Index. So, what gives? Well, for starters, it’s one of the most popular stocks on the Robinhood Top 100 list. And second, the rise of online sports betting is driving the price up of gaming stocks such as PENN. While the company’s revenue fell 77% over the second quarter due to the pandemic, it cut operational costs to weather the storm. Since then, the uncertainty of sports being played has been quelled as all four major sports leagues are back in action. This opened up a huge revenue stream. Recently, the company announced a public offering of 14 million shares, which has the potential to raise $1 billion in capital. This should help them build out their partnership with Barstool Sports. PENN recently launched a Barstool-branded mobile betting app. This should see massive growth due to Barstool’s mega fan base. While there is some uncertainty as to whether the NFL can make it through a full season as the some Titans players recently testing positive, I believe the season will continue at least through October, with online gambling revenue piling up. The stock is rated a “Strong Buy” in our POWR Ratings system. It has a grade of “A” in Trade Grade, Buy & Hold Grade, and Peer Grade, three of the four components that make up the POWR Ratings. PENN is also the #2 ranked stock in the Entertainment – Casinos/Gambling industry. Keep an eye out for on October 29th as PENN is expected to announce its latest results. Pfizer (PFE) Out of all the pharmaceutical and biotech companies working on a COVID vaccine, PFE seems to have the best shot, at least according to Bill Gates. And you know what, I tend to agree with him. The company, which has been working on a vaccine with BioNTech (BNTX), believes it will know if its vaccine will be effective by the end of this month. If it is, it will send it to the FDA for review. PFE already signed up multiple buyers, including the U.S., Canada, Japan, and the U.K. While the COVID vaccine is the company’s most significant near-term growth catalyst, it isn’t the only one. The company’s biopharma segment recorded revenue of $9.8 billion last quarter. This was due to its anticoagulant drug Eliquis’s revenue jumping 17% year over year. Its cancer drug Ibrance grew 7% to $1.3 billion during the same quarter. PFE is also running 89 clinical trials, with 23 in phase 3. This pipeline of new drugs will add even more top-line growth over the coming years. PFE is also in the middle of spinning off its Upjohn unit, which focuses on manufacturing and distributing generic drugs. It is spinning off the unit to Mylan (MYL) and should be completed by the end of the year. This will make the company more efficient as its Upjohn segment is a drag on revenue. PFE is rated a “Buy” in our POWR Ratings system. It holds a grade of “A” in Peer Grade, and a “B” for Trade Grade, Buy & Bold Grade, and Industry Rank. Apple (AAPL) AAPL will be an interesting stock to watch this month, as rumors are getting louder that the company will launch an iPhone “mini.” The company is expected to release its next-generation iPhone lineup in the coming weeks, and the buzz is all around an iPhone “mini.” The rumor is gaining traction as the company has been successful in selling phones at lower prices. The company’s new pricing strategy has certainly worked out well. Last year, AAPL reduced the price of its iPhone 11, which resulted in the phone accounting for 37% of iPhone sales in the first quarter. Then the company launched the iPhone SE earlier in the year at a price of $399. This resulted in a 10% increase in iPhone shipments in the second quarter and boosted its market share to 47.1%. All of AAPL’s next-generation lineup is expected to run on 5G. If the smaller and less expensive iPhone “mini” also includes an OLED display, watch out, as profits should soar, and APPL could become the top 5G stock. We also can’t forget its wearables, home, and accessories segment, which has been growing extremely fast. This includes products such as AirPods, Apple TV, Apple Watch, and Beats. This segment is responsible for $22.7 billion through September, which is double the revenue three years ago. Tesla (TSLA) Everyone knows TSLA’s story. It dipped in March with the rest of the market, then hit hyperspace like the Millennium Falcon racing through the Kessel Run. The stock hit a speedbump in early September but has slowly been recovering since. While I still believe the stock is in overvalued territory, I can’t bet against another run-up this month. Every time it hits a pullback, it provides investors with a buying opportunity and then keeps climbing up. This should certainly be an exciting month for the stock. It is expected to provide guidance on its third-quarter deliveries sometime over the next couple of days and then report earnings on October 28th. If the news is good on either front, I expect the stock to soar. If not, things will definitely get more volatile. Some of the reasons that TSLA stumbled last month was a disappointing Battery Day and its non-inclusion in the S&P 500. I don’t see either as a significant issue for the company. I believe TSLA will be included in the S&P 500 at some point, and its Battery day did provide some positive news in its goal of making an electric vehicle for under $25,000. Affordability is the one issue I have with the company in terms of justifying its current worth. An electric car needs to be sold at a price that the masses can afford, and if TLSA gets to that point, then watch out. The company is rated a “Buy” in our POWR Ratings system with an “A” in Trade Grade, and a “B” for Buy & Hold Grade, Peer Grade, and Industry Rank. It is also the #2 ranked stock in the Auto & Vehicle Manufacturers industry. Want More Great Investing Ideas? Do NOT Buy Stocks Before the Election! 7 “Safe-Haven” Dividend Stocks for Turbulent Times Chart of the Day- See Christian Tharp’s Stocks Ready to Breakout PENN shares were trading at $73.92 per share on Thursday afternoon, up $1.22 (+1.68%). Year-to-date, PENN has gained 189.20%, versus a 5.97% rise in the benchmark S&P 500 index during the same period."}]}