{"article": [{"url": "https://stocknews.com/news/ngvc-go-sfm-3-top-grocery-stocks-that-will-continue-benefit-from-covid-19/", "published": 1597320500.0, "headline": "3 Top Grocery Stocks That Will Continue Benefit from Covid-19", "body": "With more than 5.1 million people affected by the coronavirus in the United States so far, the pandemic is not showing any signs of slowing down. As a result, more people are shopping at grocery stores and cooking at home. And this trend is predicted to continue even after there is a vaccine for Covid-19. Also, people have become more health-conscious during the the past 5 months. This has led to a shift toward organic food items and dietary supplements. For example, according to a Research and Markets report predicts that the global organic meat products market is expected to grow at a CAGR of 10.7% to $15.92 billion by the end of 2020. The market is expected to grow at a CAGR of 8.6% to reach $20.39 billion by 2023. So it’s not surprising that shares of Natural Grocers by Vitamin Cottage, Inc. (NGVC), Grocery Outlet Holding Corp. (GO), Sprouts Farmers market, Inc. (SFM) have been surging. These stocks have returned at least 60% since the onset of the pandemic, while the SPDR S&P Retail ETF (XRT) gained about 50% during this period. 7 \"SAFE HAVEN\" Dividend Stocks for Turbulent TimesNatural Grocers by Vitamin Cottage, Inc. (NGVC) NGVC is a retail seller of organic groceries and dietary supplements in the United States. Its products can be categorized under Body Care, Pet Care, Household and general merchandise and Books and Handouts. It is the largest family operated retail store of organic products with over 158 stores in the country, with a presence in over 20 states. NGVC reported impressive results for its third quarter ended June 2020, as net sales increased 18.1% year-over-year to $265.10 million. Its daily average comparable store sales improved 15.5% from its year-ago value. Operating income of $6.70 million and net income of $4.70 million indicate a 74.3% and 134.8% rise year-over-year, respectively. NGVC’s EBITDA of $14.60 million increased 32.2% year-over-year, while gross profit grew 23.9% to $72.40 million during this time period. NGVC opened 2 new stores in the second quarter, leading to a 4.6% new store growth year-over-year, and a $6 million increase in new store sales. NGVC gained more than 220% to hit its 52-week high at $17.41 in July since hitting its 52-week low of $5.41 in March. According to our POWR Ratings system, NGVC has an “A” in Industry Rank. In the 18-stock Grocery/ Big Box Retailers industry, NGVC is ranked #13. Grocery Outlet Holding Corp. (GO) GO owns and operates a chain of grocery stores in the United States. It also sells dairy and deli, fresh meat, seafood, beer and wine, general merchandise and beauty products. Wine Enthusiast magazine named GO under “50 Best Wine Retailers in America for 2020” in the “Best Value Driven Retailers” category. It opened 7 new stores across the country in the second quarter ended June 2020. GO’s net sales increased 24.5% year-over-year to $803.40 million in the second quarter. Comparable store sales increased 16.7%, significantly higher than the 5.8% increase a year ago. It reported a quarterly net income of $29.30 million compared to a net loss of $10.6 million during the same period last year. Adjusted EBITDA of $60.60 million increased 189.2% year-over-year. Cash and cash equivalents balance increased 326.7% from its year-ago value to $79.8 million. The consensus EPS estimate of $0.23 indicates a 4.5% increase year-over-year. Also, GO beat the street estimates in each of the trailing four quarters, which is impressive. The consensus revenue estimate of $756.92 million indicates a 16% improvement from its year-ago value. GO gained more than 60% since hitting its 52-week low in March. GO is rated “Buy” in our POWR Ratings system, with an “A” in Trade Grade and Industry Rank, and “B” in Buy & Hold Grade. It is ranked #8 out of 18 stocks in the Grocery/ Big Box Retailers industry. Sprouts Farmers market, Inc. (SFM) SFM operates healthy grocery stores specializing in fresh, organic and natural food items. It provides both wholesale and retail services selling groceries, fresh food, meat, deli, vitamins, supplements and other household products. As more and more people are shifting towards organic food to build immunity amid this health crisis, SFM witnessed a strong second quarter performance. Net sale increased 16% year-over-year to $1.6 billion, while comparable same store sales grew 9.1% during the same time period. Net income grew 91.4% from its year-ago value to $67 million. Gross profit margin increased 4.5% year-over-year to 37.3%. Gross profit of $613 million increased 32% year-over-year. The consensus EPS estimate of $0.37 for the third quarter indicates a 68.1% increase year-over-year. Moreover, SFM has an impressive earnings surprise history, as it beat the street EPS estimates in each of the trailing four quarters. The consensus revenue estimate of $1.62 billion for the quarter ended September 2020 indicates a 12.8% improvement from its year-ago value. GO gained more than 115% to hit its 52-week high in July since hitting its 52-week low of $13 in March. According to our POWR Ratings system, GO has an “A” in Industry Rank and “B” in Buy & Hold Grade. It is also ranked #10 out of 18 stocks in the Grocery/ Big Box Retailers industry. Want More Great Investing Ideas? 3 Possible Directions for the Stock Market from Here How to Trade THIS Stock Bubble? 9 “BUY THE DIP” Growth Stocks for 2020 NGVC shares . Year-to-date, NGVC has gained 38.88%, versus a 5.73% rise in the benchmark S&P 500 index during the same period."}]}