{"article": [{"url": "https://stocknews.com/news/bac-ko-ed-3-stocks-to-avoid-in-july/", "published": 1593605300.0, "headline": "3 Stocks to Avoid in July", "body": "Though we have seen a significant recovery in the stock market from the March 23rd lows, there are a number of stocks whose businesses have been affected by the weakened economy due the novel coronavirus. As a result, their stock prices are well off their 52-week highs and are showing no signs of returning to those levels in the near future. This week, three well-known stocks, Bank of America (BAC), Coca-Cola Company (KO), and Consolidated Edison, Inc. (ED) were downgraded by the POWR Ratings system to either “Sell” or “Strong Sell”. 9 \"BUY THE DIP\" Growth Stocks For 2020Let’s take a look at each of these three downgraded companies to understand why their businesses are suffering: Bank of America (BAC) After the coronavirus spread throughout the world at the end of February of this year, almost all stocks were negatively impacted. However, since March 23rd, many have seen a remarkable recovery. Some even eclipsing their 52-week highs. Yet there are some industries that are still suffering. The banking industry is one of them. With a weak economy, a high unemployment rate, and cases of the coronavirus rising, banks are getting stricter about who they are willing to lend money to. Fewer loans, means less for profits for banks. In addition, last week the Fed put restrictions on bank dividends after their test found some banks could be stressed in pandemic. As a result, it’s not surprising that the POWR Ratings system has an Overall Rating of “D” for BAC. Bank of America’s stock also has a Trade Grade of “F” and an Industry Rank of “D” in the POWR Ratings system. Coca-Cola Company (KO) KO has experienced a decline in demand for their products since the onset of the coronavirus. People aren’t going to the movies, to sporting events, or restaurants. All places that people usually enjoy Coca-Cola products. As a result, in the past 6 months shares of KO are down about 18%. Though the company has a solid balance sheet, with significant cash reserves, their path forward to any significant growth is unclear as Covid-19 continues to spread throughout the world. KO has an overall rating of “D” in the POWR Ratings system. And a Trade Grade of “F”. Consolidated Edison (ED) Consolidated Energy is a utility company that has been negatively affected in the past couple of quarters. That’s because overall electricity demand is down due to sheltering in place due to the coronavirus. People are venturing out much less than normal and avoiding their offices, gyms, restaurants, bars, stores, etc. Shares of the company are down about 19% year-to-date. Presently, 35 states in the US are seeing an increase in coronavirus cases, which means that this trend of lower energy consumption is likely to continue throughout 2020. ED’s POWR Rating is a “D,” which is Sell. And the Trade Grade component of POWR Ratings has the stock graded as a “F.” Want More Great Investing Ideas? 9 “BUY THE DIP” Growth Stocks for 2020 Is the Bull S#*t Rally FINALLY Over? 7 “Safe-Haven” Dividend Stocks for Turbulent Times Top 3 Investing Strategies for 2020 BAC shares rose $0.01 (+0.04%) in after-hours trading Wednesday. Year-to-date, BAC has declined -33.07%, versus a -2.53% rise in the benchmark S&P 500 index during the same period."}]}