{"article": [{"url": "https://stocknews.com/news/wmt-orcl-amzn-goog-msft-oracle-and-walmart-confront-obstacles-to-unite-with-tiktok/", "published": 1601122100.0, "headline": "Oracle and Walmart Confront Obstacles to Unite with TikTok", "body": "Oracle and Walmart confront obstacles to unite with TikTok to create a new company, TikTok Global, and put control in U.S. hands to satisfy Trump administration security concerns. However, legal and regulatory hurdles remain for the prospective strategic investors to clear before such a deal gains regulatory approval. China-based ByteDance, the owner of TikTok, applied for a technology export license in China this week to gain approval to finalize a pact with Oracle Corp. (ORCL) and Walmart Inc. (WMT), while TikTok gained a hearing on Sunday, Sept. 27, at 9:30 a.m. before Judge Carl J. Nichols, of the U.S. District Court for the District of Columbia. To protect the personal data of U.S. users, the Trump administration is requiring that TikTok stop operating in the United States as soon as Monday, Sept. 27, but the company sought to evade the block on its business by seeking relief in court. The United States responded on Friday, Sept. 25, by filing a sealed motion opposing TikTok’s initiative to set the stage for Judge Nichols to hold a video conference on Sept. 27 to address the ban. 7 \"SAFE HAVEN\" Dividend Stocks for Turbulent TimesOracle and Walmart Confront Obstacles to Align with TikTok Technology solutions provider Oracle, of Redwood Shores, California, added multinational retail giant Walmart, of Bentonville, Arkansas, to a proposed TikTok ownership partnership that is seeking Trump administration approval. Both Oracle and Walmart are dividend payers and leaders in their respective industries that could offer valuable help to TikTok’s business. Oracle, with a 1.64% dividend yield, valued at a consensus forward price-to-earnings (P/E) ratio of 14.29, and Walmart, offering a 1.58% dividend yield and trading at a consensus forward P/E of 27.17, plan to gain minority stakes in the China-owned app TikTok. The U.S. companies also announced they would obtain control of the new TikTok Global company, even though ByteDance claimed in Chinese media that it would hold majority ownership. (Chart courtesy of www.stockcharts.com) Oracle and Walmart Confront Obstacles to Create TikTok Global But such an alliance could require further concessions and negotiations for TikTok to combine with its new U.S. partners. TikTok, a unit of ByteDance Ltd., could benefit greatly from strategic partners to boost its growth internationally and its acceptance in the United States and other nations that are expressing serious concern about China’s government gathering intelligence about its own citizens and foreigners. The Chinese Communist Party (CCP) has shown the “means and motives” to use apps such as TikTok and WeChat to threaten the national security, foreign policy and the economy of the United States, said William Ross, the U.S. Secretary of Commerce. Under his stewardship, the Commerce Department announced prohibitions on Friday, Sept. 18, to protect users in the United States by eliminating access to both applications and significantly reducing their functionality. “President Trump will do everything in his power to guarantee our national security and protect Americans from the threats of the Chinese Communist Party,” Ross said. “At the President’s direction, we have taken significant action to combat China’s malicious collection of American citizens’ personal data, while promoting our national values, democratic rules-based norms and aggressive enforcement of U.S. laws and regulations.” Oracle and Walmart Confront Obstacles to Seed Cloud Computing Walmart became a new entrant in the proposed alliance after word emerged that Oracle only would gain a minority stake in TikTok and become its “technology partner,” falling short of the Trump administration’s threshold. Oracle’s involvement would be critical to TikTok continuing to operate in the United States, but it needs Trump administration support to ensure the technology company can safeguard the data of American users of the video sharing service. (Chart courtesy of www.stockcharts.com) ByteDance is planning a U.S. initial public offering of TikTok Global, a proposed new U.S. company that will operate the video app, if the proposed deal wins federal government approval. For a potential TikTok rescuer in the United States such as Oracle, any role in the growing social media application would be a significant extension of its existing business and create buzz for the Silicon Valley stalwart. It once may have seemed outlandish to imagine a company called ByteDance, owning another known as TikTok, and partnering with software behemoth Oracle, but it may happen if the companies can satisfy U.S. and Chinese regulators. The alliance would be designed to profit from cloud computing that provides on-demand data storage and other capabilities, without direct action from the user. Unclear is whether the partnership would end the security threat to the United States that the data TikTok collects from U.S. consumers could be given to the Chinese government. Key Republican Senators Warn about Oracle and Walmart Not Gaining Control in TikTok Deal Six Republican senators, Marco Rubio, Roger Wicker, Dan Sullivan, Thom Tillis, Rick Scott and John Cornyn, sent a letter to President Trump on Sept. 16 calling for him to oppose any partnership that will retain links to ByteDance or other Chinese-controlled entities due to national security concerns. “A partial sale, or trusted partnership deal, is insufficient in achieving the goals of protecting Americans and U.S. interests from the severe risks detailed in [an Aug. 14] Executive order,” the senators wrote. “Any deal between an American company and ByteDance must ensure that TikTok’s U.S. operations, data and algorithms are entirely outside the control of ByteDance or any Chinese-state directed actors, including any entity that can be compelled by Chinese law to turn over or access U.S. consumer data. As reported, the proposed partnership agreement between Oracle and TikTok leaves significant unresolved national security issues, and we expect the Administration to keep Congress fully informed as you evaluate this potential agreement.” Oracle and Walmart Confront Obstacles to Finalize Deal with TikTok in America, China and the Cloud “The deal is Oracle’s attempt to become a major player in providing cloud computing services,” said Bob Carlson, chairman of the Board of Trustees of Virginia’s Fairfax County Employees’ Retirement System with more than $4 billion in assets and head of the Retirement Watch investment newsletter. “Oracle missed the first phase of cloud computing growth. It preferred to continue its successful practice of selling database software to clients and having them buy the hardware to support it.” Oracle plans to use its cloud servers to host TikTok’s operations. If Oracle can offer the services for a high-volume client, it would show the company can provide cloud services rivaling Amazon.com (AMZN), Alphabet Inc-owned Google (GOOG) and Microsoft (MSFT), Carlson said. (Pension fund Chairman Bob Carlson answers questions from Paul Dykewicz in an interview before social distancing became the norm after the outbreak of COVID-19) Oracle is supposed to be given access to TikTok’s algorithms. Since key details of the proposal have not been publicly disclosed, it is uncertain what control of the data and algorithms Oracle may gain. Kramer Critiques Oracle and Walmart in Pursuing Partnership with TikTok “Big Tech’s size was a comfort in the early pandemic and now it’s dead weight,” said Hilary Kramer, host of a national radio program called “Millionaire Maker” and head of the GameChangers and Value Authority advisory services. “Microsoft, in particular, looks like it’s going to struggle to regain its recent peak, which is going to be a challenge for the entire sector when you’re dealing with a $1 trillion company. The TikTok deal would have given it the push it needed, but no deal means no push.” (Columnist and author Paul Dykewicz interviews money manager Hilary Kramer, whose premium advisory services include 2-Day Trader, Turbo Trader, High Octane Trader and Inner Circle) Jim Woods, editor of Successful Investing and Intelligence Report investment newsletters, as well as the Bullseye Stock Trader and Fast Money Alert advisory services, pointed out Oracle Chairman Larry Ellison is a respected executive and a supporter of President Trump. Ellison’s involvement may help to seal an agreement with the administration. “Aside from politics, the deal is likely to be a win-win for both Oracle and TikTok, as it gives the former a hot new app and it gives the latter the tech pedigree it needs to operate in the United States,” Woods said. (Paul Dykewicz interviews Jim Woods before the COVID-19 crisis) Oracle and Walmart Confront Obstacles to Align with TikTok, But Not Impossibilities “From a strategic standpoint, Oracle getting into the social media business makes sense in that their cloud division stands to gain from the deal as a minority partner,” said Bryan Perry, who leads the Cash Machine investment newsletter and the Premium Income, Quick Income Trader, Breakout Profits Alert and Hi-Tech Trader advisory services. “It stands to reason TikTok will provide a growth driver for Oracle at a time when the company needs to generate some new channels of growth. “Oracle is a low-profile enterprise computing business that gets little if any headlines that move its stock. TikTok is a high-profile business that will keep the key word algorithms busy paying lots of attention to all things TikTok, and hence some things Oracle.” The proposed partnership also is good publicity, even if TikTok is a “long way from monetizing” its business model through sponsored-advertising expenditures, Perry said. The announcement of a deal with a trendy social media video service should enhance Oracle’s reputation, he added. (Paul Dykewicz interviews Bryan Perry at a MoneyShow conference) President Trump Praises Oracle and Walmart President Trump issued an executive order on Aug. 14 indicating TikTok’s data collection lets the Chinese Communist Party access Americans’ personal and proprietary information — potentially tracking the locations of federal employees and contractors and allowing U.S. adversaries to build dossiers of personal information for blackmail and corporate espionage. The Department of Homeland Security, Transportation Security Administration and the U.S. Armed Forces have already banned the use of TikTok on federal government phones. “TikTok also reportedly censors content that the Chinese Communist Party deems politically sensitive… concerning protests in Hong Kong and China’s treatment of Uyghurs and other Muslim minorities,” according to President Trump’s executive order. “This mobile application also may be used for disinformation campaigns that benefit the Chinese Communist Party, such as when TikTok videos spread debunked conspiracy theories about the origins of the 2019 Novel Coronavirus.” Oracle and Walmart Confront Obstacles to Align with TikTok Amid Distrust in India India’s government banned the use of TikTok and other Chinese mobile applications throughout its country. India’s Ministry of Electronics and Information Technology explained that the Chinese were “stealing and surreptitiously transmitting users’ data in an unauthorized manner to servers which have locations outside India.” China’s lack of transparency in reporting about the onset of the COVID-19 crisis that originated there has hurt the country’s relationship with the Trump administration. The global COVID-19 pandemic’s huge human toll includes 32,601,345 cases and 989,921 deaths globally, along with 7,034,824 cases and 203,789 deaths in the United States, as of Sept. 26. America has amassed the most cases and deaths by far of any country. President Trump expressed openness to approving a deal with Oracle and Walmart gaining U.S. control of TikTok from its Chinese owner ByteDance. A willingness for all sides to negotiate may be the key to DanceByte addressing the concerns that currently are preventing the Trump administration from agreeing to the arrangement. ‘Want More Great Investing Ideas?’ Click the links below. Dr. Mark Skousen, world-renowned investment advisor and economist, just released his Top 3 Dividend Plays that are set to skyrocket. Click here now to find out what they are, and how you too can cash in from this profit bonanza. A devastating new law has paved the way for the IRS to confiscate up to 30% of your retirement funds. Bob Carlson, America’s foremost retirement expert, will show you how to protect your hard-earned nest egg, and keep these damning new rules at bay. Click here now to learn more. WMT shares closed at $137.27 on Friday, up $0.57 (+0.42%). Year-to-date, WMT has gained 17.01%, versus a 3.60% rise in the benchmark S&P 500 index during the same period."}]}