{"article": [{"url": "https://stocknews.com/news/veev-abc-fms-3-medical-stocks-to-heal-your-portfolio/", "published": 1594037300.0, "headline": "3 Medical Stocks to Heal Your Portfolio", "body": "Demand for medical services and drugs is constantly rising due to the government’s increasing role in healthcare and the aging population. For example in the US, healthcare spending has risen between 4 to 8% per year over the last decade, and it now accounts for 17% of the US economy. Given these strong fundamentals, they are well-positioned to outperform during periods of economic weakness. The coronavirus will likely lead to a boost to healthcare spending in the short-term and increase government support. Political trends are also supportive as the share of the population which supports universal healthcare is increasing which would lead to increased demand for products and services. Here are the three medical stocks that are good picks for the short and long-term: 9 \"BUY THE DIP\" Growth Stocks For 2020Veeva Systems Inc. (VEEV) VEEV is a cloud-based company that provides solutions in the realm of pharmaceuticals and life sciences. The company provides software tools that help in conducting clinical trials, administer customer relationships, and even organize research results. It’s a great stock market play as it combines the high revenue growth and rich margins of a cloud stock with the strong, long-term fundamentals of a healthcare stock. Healthcare IT is in the early stages, and Veeva is one of the best options to be exposed to this trend. Veeva CRM Engage Meeting, Veeva SiteVault, and Crossix Data Platform are programs that facilitate remote monitoring at research sites, remote visits by patients, and provide a greater understanding of evolving patient-physician engagement patterns. The company has witnessed a 36% year-over-year increase in subscription services revenue and a 23% increase in operating income in the first quarter of this year. VEEV is approaching its 52-week high of $245.22 and has gained 72% year to date. The stock has returned 42.3% over the past year and 56.9% over the past three months. How does VEEV stack up for the POWR Ratings? A for Trade Grade A for Buy & Hold Grade A for Industry Rank A for Peer Grade A for overall POWR Rating You cannot ask for a better rating than that, including the fact that it is the #1 rated stock in a top industry, Medical – Services. Fresenius Medical Care AG (FMS) FMS provides dialysis treatment services, especially for end-stage renal disease patients. Severe cases of Covid-19 can cause acute kidney failure which has increased the demand for acute dialysis. FMS introduced a new production line called “CiCa solutions” for the treatment of acute and chronic kidney diseases. This new production line can be life-sustaining for patients especially now when the virus is still spreading at an alarming rate in many parts of the world. FMS is planning to expand its transitional care unit network by adding hundreds of new units in North America. In the first quarter this year, the company’s revenue and operating income increased 9% and 3% year over year, respectively. This is higher than the average stock in the S&P 500, while its valuation is more attractive. In recent weeks, FMS broke out to 52-week highs and has been consolidating this advance. Given the strength in the broader market, it’s likely that it will resolve this range to the upside. FMS has a Strong Buy Rating in the POWR Ratings and an “A” in all components including Trade Grade, Buy & Hold Grade, Peer Grade, and Industry Rank. It’s ranked #2 out of 67 stocks in the Medical-Services space according to the POWR Industry rankings. AmerisourceBergen Corporation (ABC) ABC distributes drugs and pharmaceutical products. It was formed by the merger of Bergen Brunswig and Amerisource in 2001 and provides products for human and animal health. Gilead (GILD), which has been working with the US government to distribute its antiviral medication called Remdesivir for treatment of Covid-19, will partner with ABC as the sole distributor of the drug under the guidance of the federal government, state government and state public health departments. ABC’s diluted earnings per share increased to $4.64 in the second quarter of fiscal 2020 from $0.13 a year ago. It expects to grow sales and earnings next year by 9% and 8% respectively. Since 2016, the stock has been trading in a range between $80 and $100. Given these positive developments, a breakout to the upside is likely. ABC has an average analyst price target of $109.17, which represents an upside of at least 9%. ABC has a Strong Buy rating in the POWR Ratings with an “A” in Trade Grade, Buy & Hold Grade, Peer Grade, and Industry Rank. Within the Medical-Services sector, it is ranked #3 among 67 stocks. Want More Great Investing Ideas? 9 “BUY THE DIP” Growth Stocks for 2020 Is the Bull S#*t Rally FINALLY Over? 7 “Safe-Haven” Dividend Stocks for Turbulent Times Top 3 Investing Strategies for 2020 VEEV shares were trading at $244.19 per share on Monday afternoon, up $1.97 (+0.81%). Year-to-date, VEEV has gained 73.60%, versus a -0.89% rise in the benchmark S&P 500 index during the same period."}]}