{"article": [{"url": "https://stocknews.com/news/pfsi-xlf-gshd-plmr-coop-4-soaring-financial-stocks-to-buy-now/", "published": 1598443700.0, "headline": "4 SOARING Financial Stocks to Buy Now", "body": "The stock market is making new highs, but investors are still pessimistic about the financial sector which has been underperforming the broader market over the last couple of years. The sector’s weakness is evident from the Financial Select Sector SPDR Fund’s (XLF) year-to-date loss of 19% while the S&P 500 index has an 8% gain. Some reasons are the low-interest-rate environment and weakness in lending due to the slowdown for many industries and small businesses. There’s also concern that defaults on loans and mortgages are going to increase in the coming months. However, some financial stocks are defying this trend. PennyMac Financial Services, Inc. (PFSI), Goosehead Insurance, Inc. (GSHD), Palomar Holdings, Inc. (PLMR), and Mr. Cooper Group Inc. (COOP) are among the financial stocks that are less exposed to these negative factors and should continue moving higher. 7 \"SAFE HAVEN\" Dividend Stocks for Turbulent TimesPennyMac Financial Services, Inc. (PFSI) PFSI provides a comprehensive mortgage platform and integrated business focused on the production and servicing of U.S. mortgage loans and the management of investments related to the mortgage market. PFSI closed yesterday’s trading session at $50.23, gaining 47.6% year-to-date. The stock has gained more than 55% in the last three months to trade 141% above its 200-day moving average of $35.53. Moreover, PFSI is trading at a 7.8% discount to its all-time high of $55.99. The second-quarter results did not fail to impress the street. Total revenues grew 171% year-over-year to $821.6 million. The increase was primarily contributed by an increase in mortgage loan origination and refinancing activities on lower mortgage rates. Consequently, a substantial rise in net gains on loans held for sale at fair value along with higher loan origination fees was witnessed. PFSI generated $1.1 billion as cash flow from operations. The company also repurchased $237 million worth of its common stock during the quarter. EPS for the quarter came in at $4.39, growing more than 377% year-over-year. This accounted for a positive earnings surprise of 51.9%. Additionally, PFSI has beaten EPS estimates in each of the trailing four quarters. The company also raised its quarterly dividend by 25% to $0.15 per share, aggregating to a yield of 1.17%. Furthermore, EPS is expected to rise 212.5% in the current year. How does PFSI stack up for the POWR Ratings? A for Trade Grade B for Buy & Hold Grade B for Peer Grade B for Industry Rank B for Overall POWR Rating. It is ranked #32 in the 163-stock Financial Services (Enterprise) industry. Goosehead Insurance, Inc. (GSHD) GSHD is a personal lines insurance agency service provider. The company operates through two segments — Corporate Channel and Franchise Channel. It offers various insurance products, such as homeowners’ insurance, auto insurance; and life and business insurance. GSHD has gained more than 128% year-to-date, closing yesterday’s trading session at $96.87. The stock is up more than 61% in the last three months and is presently trading 48% above its 200-day moving average of $65.31. Moreover, GSHD is trading at a 12.6% discount to its all-time high of $110.88. The company delivered excellent second-quarter results. The top-line grew 54% year-over-year to $29.2 million. Total written premiums placed increased 41% from the prior-year period to $274 million. Policies in force grew 45% from the year-ago period to 0.59 million. The company has significantly managed to expand its operations and customer base. Corporate sales headcount of 317 was up 49% year-over-year while the total franchises increased 48% compared to the prior-year period. EPS for the quarter came in $0.25, growing more than 216% year-over-year and beating the consensus estimate by 150%. Additionally, the company declared a special dividend of $1.15 as it generated a free cash flow of $4.9 million. The street expects EPS to grow 177.3% in the current year. GSDH’s strong momentum is reflected in its POWR Ratings, it has a “Buy” rating with an “A” in Trade Grade and Industry Rank, and a “B” in Buy & Hold Grade and Peer Grade. Within the Insurance – Property & Casualty industry, it’s ranked #12 out of 59 stocks. Palomar Holdings, Inc. (PLMR) PLMR is a specialty property insurance provider. It offers personal and commercial specialty property insurance products, including residential and commercial earthquake, specialty homeowners, residential flood, inland marine, and real estate investor. With a year-to-date gain of 112.7%, PLMR closed yesterday’s trading session at $107.63. The stock has more than doubled since the market crash in March. It is presently trading 52.7% above its 200-day moving average. The stock has gained more than 97% in the last six months. PLMR has recently announced the formation of Palomar Excess and Surplus Insurance Company (PESIC), a newly established surplus lines insurance company subsidiary as part of its expansion strategy. Furthermore, the company has issued 1 million common stocks worth $82 million through a follow-on public offering. PLMR has recently reported a notable second-quarter earnings report. Revenue increased 66% year-over-year to $43.2 million. Gross written premiums increased by 44% to $83.8 million compared to $58.3 million in the year-ago quarter. Total underwriting revenue also increased by 68% year-over-year to 40.3 million. The company generated $2.7 million in cash flow from operations. EPS for the quarter came in at $0.52, beating the consensus estimate by 6.1%. The earnings witnessed a 60% growth compared to the year-ago quarter. Additionally, the Street expects EPS to grow 20.2% in the current year. It’s no surprise that PLMR is rated “Strong Buy” in our POWR Ratings system. It also has an “A” for Trade Grade, Buy & Hold Grade, Peer Grade, and Industry Rank. Mr. Cooper Group Inc. (COOP) COOP provides servicing, origination, and transaction-based services related principally to single-family residences in the United States. The company operates through Servicing, Originations, and Xome segments. COOP closed yesterday’s trading session at $18.53, with a year-to-date gain of 47.8%. Moreover, COOP is making fresh highs every trading day. COOP’s fiscal second-quarter top-line grew 58% year-over-year to $630 million. The servicing segment upgraded its customer base to 3.5 million while simultaneously strengthening asset performance for investors in the quarter. The company generated $1.36 billion as cash flow from operations compared to the $377 million cash used in operations in the year-ago period. To improve its liquidity, COOP has recently announced the issuance of $850 million worth senior notes. The company funded 41,223 loans in the second quarter, totaling approximately $10.7 billion Unpaid principal balance (UPB) which comprised $8.6 billion in Direct-to-Consumer, $1.9 billion in Correspondent, and $0.2 billion in Wholesale. EPS for the quarter came in at $2.84, beating the consensus estimate by 83.2%. Furthermore, COOP has an impressive earnings surprise history with the company beating the consensus EPS estimates in each of the trailing four quarters. The street expects EPS to grow 108% in the current year. COOP is rated “Strong Buy” in our POWR Ratings system, consistent with its strong momentum. It also has an “A” in Trade Grade and Buy & Hold Grade, and a “B” in Peer Grade and Industry Rank. It is ranked #15 out of 163 stocks in the Financial Services (Enterprise) industry. Want More Great Investing Ideas? The Best of StockNews 2 Step Process to Sell @ Market Top in September 9 “BUY THE DIP” Growth Stocks for 2020 PFSI shares were trading at $50.49 per share on Wednesday afternoon, up $0.26 (+0.52%). Year-to-date, PFSI has gained 49.89%, versus a 8.90% rise in the benchmark S&P 500 index during the same period."}]}