{"article": [{"url": "https://stocknews.com/news/tmus-qcom-amd-swks-4-5g-stocks-to-buy-for-q4-2020/", "published": 1601899700.0, "headline": "4 5G Stocks to Own for the Rest of 2020", "body": "We are currently in the fourth industrial revolution (4IR) with advancements in internet-of-things (IoT), artificial intelligence (AI), and robotics. A key part of this revolution will be driven by 5G, which will connect thousands of devices to high-speed internet, simultaneously. 5G will provide 10 times faster speed, connection density, and reduced latency than the current 4G LTE. Building such a dense network will require lots of mini 5G-base stations placed every few hundred feet. All this needs huge capital investments from communication service providers. And these investments will boost the demand for semiconductor chips and networking equipment used in 5G-base stations. Gartner expects the global 5G network infrastructure market to almost double in 2020. Once 5G speed becomes fully available, the adoption of AI and IoT devices will accelerate and create a whole new connected world. However, the COVID-19 pandemic has slowed the 5G rollout, which was set to begin this year. But this growth is expected to pick up next year. Investors have used this one-year gap as an opportunity to get exposure to 5G stocks. 7 Best ETFs for the NEXT Bull MarketHence, most 5G stocks have rallied significantly this year and are currently trading near their record highs. Even following these gains, four 5G stocks are worth buying for the fourth quarter as they will benefit from the release of Apple’s (AAPL) first 5G iPhone and the rollout of many other 5G devices and services. These four 5G stocks are T-Mobile US, Inc. (TMUS), QUALCOMM Incorporated (QCOM), Advanced Micro Devices Inc (AMD), and Skyworks Solutions, Inc. (SWKS). Not only in the fourth quarter, but their revenue and earnings are also expected to surge significantly next year, and the year after as 5G becomes more widespread. T-Mobile US, Inc. (TMUS) TMUS has become the ultimate 5G stock after its Sprint acquisition helped it become the largest 5G network operator and the second-largest wireless service provider in the United States. Its 5G network covers more than 250 million people across 1.3 million square miles. And it is adding more towers and spectrum (1,000 sites of 2.5 GHz 5G every month) in places that already have a 5G network. The denser the network, the faster and better the 5G service. And TMUS would provide these services at a discounted rate for three years. It could capture customers at all price points. Leveraging the 5G rollout, Apple is scheduled to launch its first 5G iPhone in the fourth quarter. It won’t be a surprise if Apple customers switch their telecom provider to TMUS to get the best 5G experience. The Wall Street analysts expect TMUS’s revenue to surge 62% year-over-year in the fourth quarter after adding revenue from the Sprint acquisition. After removing the impact of Sprint acquisition, they expect TMUS’s revenue and EPS to surge 14.3% and 5%, respectively, next year. The EPS growth will be driven by the $6 billion in cost synergies coming from the Sprint acquisition. TMUS is trading at 28.5 times its forward12-months EPS. But its 5G dominance and double-digit revenue run rate make it an attractive stock even at such a high valuation. Hence, TMUS is rated a “Strong Buy” in the POWR Ratings. It holds an “A” in Trade Grade, Peer Grade, Buy & Hold Grade, and Industry Rank. The stock is also ranked #2 in the 24-stock Telecom – Domestic industry. Verizon Communications (VZ) is still the No. 1 wireless service provider. But with the pace at which TMUS is growing, it will only be a matter of time that it becomes the leading telecom provider. QUALCOMM Incorporated (QCOM) While TMUS will provide the 5G network, QCOM will power the end devices with its 5G modems and AI-based processors. QCOM is already a leader in the 4G and LTE modem space, and now it is leading the 5G revolution. Its modems already power 90% of smartphones in the world. The last three years (2017-2019) have been tough for Qualcomm as a licensing dispute with its largest customer Apple wiped away $4 billion in annual revenue from the licensing business. But, last year, the two companies made a truce, and QCOM may power Apple’s 5G iPhones until the iPhone maker builds a 5G modem in-house. The fourth quarter is especially important for QCOM as the iPhone launch would double its quarterly licensing revenue. The Wall Street analysts expect QCOM’s fourth-quarter revenue to surge 40% year-over-year to $7.07 billion. This is just the beginning of QCOM’s 5G growth story. It is also growing beyond mobile to include 5G modems and processors for always-connected PC, automotive, and fixed wireless access. The analysts expect its next year’s revenue to surge 32% year-over-year, the level that was last seen in 2013 when the 4G technology was on the rise. QCOM is trading at 6.5 times its sales. 5G is a $12.5 trillion opportunity for QCOM, and growth has not yet started in the automotive and embedded markets. Its current valuation may look like a discounted price by the time 5G becomes mainstream. QCOM is rated a “Strong Buy” in our POWR Ratings system. It holds an “A” in Trade Grade, Peer Grade, Buy & Hold Grade, and Industry Rank. It is also the #3 ranked stock in the 86-stock Semiconductor & Wireless Chip industry. Advanced Micro Devices Inc (AMD) Both TMUS and QCOM would bring 5G connectivity to the home and edge devices. Then where does AMD come? AMD is a popular name among gamers as it powers the Microsoft (MSFT) Xbox and Sony (SNE) PlayStation. It is also making its way into cloud gaming by powering Google (GOOG) Stadia. A survey by Ribbon Communications found that gamers are waiting for the complete 5G rollout to enjoy the cloud gaming experience 5G speeds will bring. 95% of gamers are willing to pay more for a better gaming experience. And AMD and NVIDIA Corporation (NVDA) rule the gaming industry. The fourth quarter is especially important for AMD as Sony and Microsoft will launch their next-generation game consoles after seven years. The Wall Street analysts expect AMD’s fourth-quarter revenue to surge 23% year-over-year to $2.6 billion. Next year, the demand for gaming would be coupled with its lead in the high-performance AI-based processors for PCs and servers. The analysts expect AMD’s revenue to surge 23% year-over-year in 2021. With the AMD stock trading at 11.7 times its sales per share, you can argue that the stock is overvalued. But cloud gaming and AI are still at the nascent stage. When 5G becomes mainstream, the demand for cloud services and 5G and AI-powered edge devices would surge exponentially, and its current price would look attractive then. AMD stock is rated “Buy” in our POWR Rating system. It also has an “A” for Trade Grade and Industry Rank, and a “B” for Buy & Hold Grade and Peer Grade. It is also the #17 ranked stock in the Semiconductor & Wireless Chip industry. Skyworks Solutions, Inc. (SWKS) SWKS is a 5G stock you would want to own as it has a 50% exposure to Apple. SWKS provides radio frequency (RF) chips, and with the advancement in technology, the RF content per device increases. The fourth quarter is important for SWKS because of Apple’s iPhone launch. The Wall Street analysts expect SWKS’ fourth-quarter revenue to surge 6.1% year-over-year to $934.5 million. Skyworks is expanding its revenue stream beyond Apple. Its RF chips will see strong demand as 5G needs higher RF content per device. The analysts expect its revenue to surge 12.4% year-over-year in 2021. SWKS is rated a “Strong Buy” in the POWR Ratings. It holds “A”s in Trade Grade, Peer Grade, Buy & Hold Grade, and Industry Rank. It is the #7 ranked stock in the Semiconductor & Wireless Chip industry. Want More Great Investing Ideas? Do NOT Buy Stocks Before the Election! 7 “Safe-Haven” Dividend Stocks for Turbulent Times Chart of the Day- See Christian Tharp’s Stocks Ready to Breakout TMUS shares were unchanged in after-hours trading Monday. Year-to-date, TMUS has gained 46.39%, versus a 7.08% rise in the benchmark S&P 500 index during the same period."}]}