{"article": [{"url": "https://stocknews.com/news/tgt-time-to-fear-an-all-time-highs-as-the-sp-500/", "published": 1598443700.0, "headline": "Time to Fear All-Time Highs as the S&P 500 Breaks 3,450?", "body": "The stock market reached another new all-time high this week. For the first time ever, the S&P 500 traded above 3,450. Measured since the March low, this has truly been an impressive rally. The S&P 500 has vaulted over 50% in just five months. This one of the strongest bulls ever. Naturally, rallies like these make a lot of investors nervous. Afterall, how much higher can it go? Many investors are surprised to learn that history tells us that this is actually a good time to invest. Let me explain. 7 Best ETFs for the NEXT Bull MarketA few years ago, I crunched the numbers. I wanted to see how well the market does when it’s at an all-time high. I took all the days in which the stock market was at an all-time high. I then isolated the next day’s trading. From 1950 through the middle of 2015 (when I ran the test), there had been 1,026 trading days following a new high. That’s about 6.2% of the time of one new high every 16.1 days. (To be technical, we could say this goes back to 1929. Why? Because the market didn’t surpass its 1929 peak until 1954. Yikes!) Those 1,026 days is roughly the equivalent to four years of trading. I found that the combined return of those days was 95.6%. That works out to more than 18% per year. In other words, if you had only invested in days following all-time highs, you would have had a much better average return than the overall stock market. Of course, in practical terms, it’s pointless to dart in and out of the market so frequently, but our point is to study the market’s behavior. The market clearly likes an all-time high. But, to my mind, the truly amazing stat isn’t the market’s return. Instead, it’s the market’s volatility. When the stock market is at an all-time high, it’s a lot calmer than it is during other times. Check out this chart of the daily changes in the S&P 500 for the last several months. Before Covid, volatility was almost non-existent. But in the spring, daily volatility exploded. Why? Because the market was plunging. There were several days where the market moved by more than 5%. Since June, however, volatility has chilled out in a big way. Why? Because the market is moving higher. When the stock market is at an all-time high, the average daily volatility is 36% less than it is normally. In other words, rising markets are calm markets. Falling markets are frenetic ones. Interestingly, most market plunges haven’t occurred at the all-time high. Instead, the really big drops have come during already soggy markets. In the last 60 years, the S&P 500 has risen by more than 2% following a new high just three times. Having said that, let’s look at a classic retailer that impressed everyone last week. Target (TGT) Flattens the Street Target (TGT) recently reported blow-out earnings. It’s hard to think of a company that has done more dumb things to ruin itself. Still, the company always seems to manage itself out of one self-induced crisis after another. Did Target completely bungle going into Canada? Yep. Did Target suffer a massive data breach of customers’ info? Sure did. Through it all, Target is doing better than ever. Last quarter, Target’s comparable-store-sales, that’s key stat for any retailer, jumped more than 24%. Sales inside the stores were up by 11%. Total revenue increased 25% to $23 billion. Not only that, but Target was also able to grow its profit margins as well. To me, this is a sign that Target is keeping its business costs in check. For the quarter, Target’s adjusted earnings-per-share totaled $3.38. The consensus on Wall Street was for earnings of $1.62 per share. Target didn’t just beat expectations. They doubled them! The next day, shares of Target bolted higher by nearly 13%. Look at this chart of Target over the last five months. Earlier this year Target suspended its share buyback program. The company still has $4.5 billion left in its buyback authorization. Target also withdrew its fiscal guidance for 2020. CEO Brian Cornell said, “We remain steadfast in our focus on investing in a safe and convenient shopping experience for our guests, and their trust has resulted in market share gains of $5 billion in the first six months of the year. With our differentiated merchandising assortment, a comprehensive set of convenient fulfillment options, a strong balance sheet, and our deeply dedicated team, we are well-equipped to navigate the ongoing challenges of the pandemic and continue to grow profitably in the years ahead.” Given the company’s tremendous growth during the second quarter, I think it’s very possible that Target can earn $7.00 per share this fiscal year. Target has shown itself to be one of the few companies that’s able to grow and thrive during the age of the coronavirus. I expect to see more great results from Target in the months ahead. Target is a welcome addition to any growth-oriented portfolio. Want more great investing ideas? Download free the “10-Step Options Trading Checklist” you need before making a trade. The Virtual Trading Pit Is Open: Trade Set-ups, Training, New Trading Ideas How to Try Out Options Without Risking a Penny TGT shares were unchanged in after-hours trading Wednesday. Year-to-date, TGT has gained 21.02%, versus a 9.10% rise in the benchmark S&P 500 index during the same period."}]}