{"article": [{"url": "https://stocknews.com/news/abt-mdt-syk-bsx-ew-5-buy-rated-medical-device-stocks-to-buy-now/", "published": 1599134900.0, "headline": "5 \"Buy Rated\" Medical Device Stocks to Buy Now", "body": "Medical device stocks are often overlooked in favor of web and computing-related tech stocks. However, medical device stocks have significant potential although it takes longer for their products to gain traction. The best medical device companies have a diverse, array of high-margin products. Our POWR Ratings System can help you identify the best stocks out in the sector. Without further adieu, let’s take a look at five medical device stocks with Buy ratings: Abbott Laboratories (ABT), Medtronic (MDT), Stryker Corporation (SYK), Boston Scientific Corporation (BSX), and Edwards Lifesciences Corporation (EW). 7 Best ETFs for the NEXT Bull MarketAbbott Laboratories (ABT) Instead of investing in a company that specializes in one or two medical devices, it is better to hedge your bet with an investment in a business that develops, makes, and brings to market numerous healthcare products. ABT is one such company, creating and selling medical devices for diabetes treatment, vision care, and vascular health. The ABT POWR Ratings are as good as it gets: A grades in every single POWR Component along with a top-5 industry rank of 230+ Medical – Pharmaceutical stocks. The analysts are also bullish on ABT, setting an average price target of $116.90, indicating there is still around 10% upside to go. The icing on the cake is ABT’s progress in the battle against the coronavirus. ABT has half a dozen COVID-19 tests on the market. ABT has raised its dividend rate for a quarter-century straight without exception. The company’s diagnostic systems and MitraClip regurgitation devices are growing along with its pharmaceutical and nutritional sales. In short, ABT is firing on all cylinders. Medtronic (MDT) Pain alleviation, health restoration, and life extension will prove that much more important and profitable as the sizable baby boomer age cohort moves through its golden years. MDT specializes in each of these areas. MDT POWR Ratings are rock-solid: A grades in the Industry Rank and Trade Grade POWR Components along with B grades in the remaining Components. MDT is ranked 25th of 138 publicly traded companies in the uber-competitive Medical – Devices & Equipment category. The analysts have set an average price target of $115.33 for MDT, insisting the stock is likely to increase by more than 7% before it is fairly priced. MDT’s latest device for pediatric diabetes treatment recently received regulatory approval. However, MDT has not yet returned to its pre-COVID trading level of $110 to $120. Though MDT’s profitability decline has shrunk since prior quarters, there is still work to be done. Keep your eye on this medical device-maker and consider establishing a position if it pulls back in the weeks or months ahead. Stryker Corporation (SYK) SYK makes a litany of medical devices. This medical tech company specializes in orthopedics products treating surgical navigation tools, pain treatment equipment, implants, and more. Though SYK has not moved back to its pre-COVID price of $222, the stock is gradually moving upward after dipping below $130 this past spring. The POWR Ratings reveal SYK has an A grade in its Industry Rank along with B grades in the remaining POWR Component categories. SYK is ranked 26th out of nearly 140 Medical Device & Equipment stocks in its segment. SYK has grown its revenue for four straight decades. All in all, SYK revenue has moved beyond the $14 billion mark, representing a spike of nearly 10% compared to the year prior. Furthermore, SYK adjusted net earnings per share are up 13% to boot. It appears as though SYK is a bit underpriced at its current trading price. Scoop up SYK today, hold it until it moves back to its pre-COVID trading range of $220, and take some profits off the table at that point. Boston Scientific Corporation (BSX) If you are hesitant to invest in a medical device maker that specializes in a single device, opt for the likes of BSX that develop, make, and market numerous such devices. BSX devices are used in vascular surgery, urology, endoscopy, neurovascular intervention, neuromodulation, and more. The POWR Ratings show BSX has A grades in each of its POWR Components but for its Peer Grade and Buy & Hold Grade in which it has B grades. BSX is ranked 28th of 138 Medical – Devices & Equipment stocks. TipRanks reports the average analyst price target for BSX is a whopping $45.93, indicating the stock has at least 11% upside remaining. BSX sales declined amidst the pandemic yet this setback should be viewed as a buying opportunity. All in all, BSX won approval for nearly two dozen products this year alone. Once hospital and clinic activity returns to normal, BSX stock should trend upward. Edwards Lifesciences Corporation (EW) EW provides technologies and products that facilitate the treatment of cardiovascular disease. In particular, EW’s efforts help treat peripheral vascular disease and heart valve disease. The POWR Ratings show EW has A grades in each POWR Component. EW is ranked second of 138 stocks in its segment. Though EW’s scope is fairly limited, the company’s recent quarterly earnings should catch your attention. EW’s second-quarter revenue topped the $900 million mark, beating the Street’s estimate of just under $800 million. EW’s second-quarter adjusted earnings were 34 cents per share, a figure that is two times that of the analysts’ estimate. Look for EW’s solid earnings to help propel the stock even higher in the weeks to come. Want More Great Investing Ideas? 7 Best ETFs for the NEXT Bull Market Beware Stocks in September? 9 “BUY THE DIP” Growth Stocks for 2020 ABT shares were trading at $108.17 per share on Thursday morning, down $1.27 (-1.16%). Year-to-date, ABT has gained 26.08%, versus a 11.73% rise in the benchmark S&P 500 index during the same period."}]}