{"article": [{"url": "https://stocknews.com/news/xec-kelya-wve-chs-dtea-avoid-these-stocks-at-all-costs/", "published": 1594901300.0, "headline": "AVOID These Stocks at All Costs", "body": "Investors far and wide are discussing whether we might have reached the end of a surprising bull market. The market might have plateaued following a strong bounce in the aftermath of the COVID-19 sell-off. There is a good chance the market will continue moving sideways until a vaccine is produced. Diminished enthusiasm, combined with a close analysis of quantitative data, has led to numerous stock downgrades in our exclusive POWR Ratings system. Below, we provide an in-depth look at five recently downgraded stocks: Cimarex Energy (XEC), Kelly Services (KELYA), Wave Life Sciences (WVE) Chico’s FAS (CHS) and David’s Tea (DTEA). Cimarex Energy (XEC) 7 \"SAFE HAVEN\" Dividend Stocks for Turbulent TimesSociety has been pivoting towards clean energy. Green hydrogen and electricity are in, while oil and gas are being phased out. XEC’s oil and gas exploration served an important purpose in years past, but the stock is now losing investors as money moves into the Teslas (TSLA) of the world. The POWR Ratings reveal that XEC has an F Trade Grade along with an F Buy & Hold Grade. Delve into XEC’s price returns, and you will find out why. XEC has negative returns over the short and long term. The stock is almost down 50% over six months. Over three years, it is down -71.40%. XEC’s capital spending for this year has been significantly reduced. The stock is more likely to test its 52-week low of $12.15 than approach its 52-week high of $55.29. Kelly Services (KELYA) This is not a great time to be in the staffing services business. Unemployment is hovering around 10%. It might take upwards of a decade for the United States’ economy to return to its pre-COVID state. Though KELYA has offices outside of the United States, the entire global economy will likely be mired in a recession for at least another year. The POWR Ratings show KELYA has an F for Trade and Buy & Hold grades in the POWR Ratings components. The stock’s Peer Grade and Industry Rank are not much better, with D grades. KELYA is ranked 10th of 16 stocks in the Outsourcing – Staffing Services category, yet this is no reason to be bullish. The entire staffing industry may see a significant decline in business for the foreseeable future. The price returns show KELYA is an underperformer. KELYA’s year-to-date price return is -31.93%. The stock has a six-month price return of -30.11% and a three-year price return of -30.87%. Wave Life Sciences (WVE) Now that the economy is in the midst of a recession, it is time to reevaluate your portfolio. If you are invested in biopharmaceutical companies with a narrow focus, you should consider reducing your position or completely pivoting toward better opportunities. WVE’s primary focus is developing therapeutic candidates for inflammatory bowel disease, Duchenne muscular dystrophy, and Huntington’s disease. WVE has a grade of F for Buy & Hold and Trade grade, and is ranked #143 out of 213 stocks in the Medical – Pharmaceuticals industry. The stock was down -80.93% last year. The stock is down 40.18% over the past three years Chico’s FAS (CHS) Now that people are socially distancing and primarily remaining at home, apparel companies are struggling to sell their products. CHS’ women’s apparel and accessories might sell better once the economy fully reopens, but people are still more likely to spend on necessities than luxury items such as fashionable clothing. CHS performance is in the red going back to 2017. The stock is down 62.75% over the past six months. Over three years, CHS has dropped nearly 80%. The company plans to close hundreds of stores in the next couple of years. David’s Tea (DTEA) When times get tough, people turn to the hard stuff and the cheap stuff. DTEA sells neither. DTEA’s teas and tea-related accessories might sell well when the economy is booming, but that might not be the case for the foreseeable future. DTEA is down 47.95% year-to-date and down 86% over the past three years. Want More Great Investing Ideas? 9 “BUY THE DIP” Growth Stocks for 2020 Top 5 WINNING Stock Chart Patterns 7 “Safe-Haven” Dividend Stocks for Turbulent Times XEC shares were trading at $25.85 per share on Thursday morning, down $0.37 (-1.41%). Year-to-date, XEC has declined -50.04%, versus a 0.63% rise in the benchmark S&P 500 index during the same period."}]}