{"article": [{"url": "https://stocknews.com/news/acb-aurora-cannabis-is-now-a-buying-opportunity/", "published": 1597406900.0, "headline": "Aurora Cannabis: Is Now a Buying Opportunity?", "body": "Shares of Aurora Cannabis (ACB), similar to peers, have burnt significant investor wealth in the last 18 months. Aurora stock touched a record high back in October 2018 when Canada legalized marijuana for recreational use and investor sentiment was extremely bullish. Since then the cannabis sector has been plagued by a slew of structural issues. As marijuana is a highly regulated industry, Health Canada has not been too liberal in handing out retail store licenses. The slow rollout of retail stores in major provinces such as British Columbia and Ontario has significantly impacted demand. As marijuana companies invested heavily in capital expenditure to increase production capacity, lower than expected demand has driven inventory levels higher which in turn has led to million-dollar write-downs and negative profit margins. Demand has also been hurt due to a thriving black market, health concerns following the vaping scandal and the ongoing pandemic. 9 \"BUY THE DIP\" Growth Stocks For 2020This has meant Aurora stock is now trading at $10.65 per share which is 91% below its record high. Despite this astonishing decline, ACB stock has returned 246% in the last five years. This means Aurora stock returned a staggering 4,500% between August 2015 and October 2018. However, past returns matter little to current and future investors. Let’s see if the cannabis heavyweight can stage a comeback in the second half of 2020. Aurora’s recent quarterly results were better than expected Aurora Cannabis’ stock made a comeback after its fiscal third-quarter results. Its net revenue in Q3 rose 18% sequentially to CA$78.4 million, well above analyst estimates of CA$66.7 million. Aurora stock surged 200% in the following week to $17.40 per share before correcting to current levels. However, if you look closer there are several issues impacting the company. While ACB continues to be a leading producer of cannabis, it is hurt by tepid demand. For example, the company produced 36,207 kilograms in Q3, up from 30,691 kilograms in Q2. However, it sold just 12,729 kilograms in the fiscal third quarter. Due to oversupply, ACB inventory has increased from CA$113.6 million at the end of June 2019 to CA$251.18 million at the end of March 2020. You can expect this figure to move higher in the upcoming quarters. Despite the uptick in sequential sales, Aurora’s gross profit before fair value adjustments fell 12% to CA$31.88 million, while operating loss stood at a hefty $83.56 million. Focus on cost reduction ACB stated it aims to post an operating profit by the first quarter of fiscal 2021. The company closed five of its production facilities recently and also sold off its 1 million square feet Exeter greenhouse as well as stopped construction for two other projects. Aurora is now focused on optimizing its larger production facilities that will help it leverage economies of scale and lower production costs. The cash cost to produce one gram of dried cannabis sold fell by 3% in Q3 to $0.85 from $0.88 in Q2. In case the cannabis behemoth can lower costs going forward, it will boost gross margins significantly. In order to improve the bottom line, ACB expects to reduce operating costs to between CA$40 million and CA$45 million per quarter. In Q3 operating costs including share-based compensation stood at $110.9 million. Though operating costs fell 15% on a sequential basis, it will need to fall by a massive 60% over the next two quarters. Does this mean Aurora will lay-off a significant portion of its workforce? In June, the company announced an immediate reduction of its selling, general, and administrative workforce by 25% while 30% of production staff will be laid off in the next two quarters. Its interim CEO and Executive Chairman claimed, “This has not simply been a cost-cutting exercise. We have undertaken a strategic realignment of our operations to protect Aurora’s position as a leader in key global cannabinoid markets, most notably Canada.” Aurora’s goodwill impairment and cash burn a major concern Aurora Cannabis acquired multiple companies over the years. These acquisitions were carried out at outrageous valuations resulting in goodwill impairments. It ended Q3 with goodwill of a whopping CA$2.42 billion which accounted for 51% of total assets. In the second quarter, Aurora Cannabis wrote-down CA$762 million in goodwill impairment charges which were attributed to its overseas assets in Denmark and South America. There is a good chance that another billion-dollar write-down is on the cards considering its overvalued acquisitions including the CA$2 billion it spent to buy MedReleaf. Aurora Cannabis cash balance stands at CA$230 million. It however burnt close to CA$430 million in cash in the last two quarters. The company continues to raise capital via at-the-market equity offerings that dilute investor wealth. In the last six months, ACB has raised $470 million and it has authorized another offering to raise US$350 million which will result in further dilution. ACB in fact had to resort to a reverse stock split to keep trading on the NYSE after shares were trading below $1 in April 2020 as its stock price plummeted due to equity offerings. The verdict Aurora stock is expected to remain volatile in the upcoming months due to widespread uncertainties. We have seen the company have several issues that include mounting losses, high inventory levels, and the potential for significant write-downs. In case Aurora Cannabis is able to achieve profitability by the September quarter, it will be nothing short of a miracle. However, this will also mean the company has downsized operations which will then impact top-line growth. Its cash burn and a debt balance of CA$592 million will also make investors sweat. The upcoming results of Aurora Cannabis will be extremely critical where investors will be able to gauge if the company has been able to achieve its previously announced financial guidance. Aurora stock is valued at a market cap of CA$1.46 billion which means its forward price to earnings multiple stands at 5x. This might not seem too expensive given the robust long-term growth estimates for the global cannabis industry. Further, there is a chance that marijuana will be legalized in the U.S. at the federal level which will again drive stocks to record highs. Want More Great Investing Ideas? 3 Possible Directions for the Stock Market from Here How to Trade THIS Stock Bubble? 9 “BUY THE DIP” Growth Stocks for 2020 ACB shares were trading at $10.69 per share on Friday afternoon, up $0.51 (+5.01%). Year-to-date, ACB has declined -58.76%, versus a 5.74% rise in the benchmark S&P 500 index during the same period."}]}