{"article": [{"url": "https://stocknews.com/news/ostk-omi-kodk-tup-4-stocks-that-gained-more-than-100-in-july/", "published": 1596542900.0, "headline": "4 Stocks That Gained More Than 100% in July", "body": "Following the market crash in March, investors have discounted near-term weakness and are more focused on marginal improvements, government stimulus, and a longer-term outlook. That’s led to an impressive rally across the broader market. In the month of July, the Dow Jones Industrial Average gained 3.6%, the S&P 500 rallied 5%, and the Nasdaq jumped 5.8%. Yet there were a handful of stocks that vastly outperformed these indices. Overstock.com (OSTK), Owens & Minor (OMI), Tupperware (TUP), and Eastman Kodak (KODK) are four stocks that gained more than 100% last month. 7 \"SAFE HAVEN\" Dividend Stocks for Turbulent TimesOverstock.com, Inc. (OSTK) This online retail and technology company reported strong second-quarter results that doubled gross sales and tripled the number of new customers compared to the previous year. In the second quarter, total net revenue increased by 109% and net income attributable to stockholders increased by $61 million on a year over year basis. tZero group, a majority-owned subsidiary of OSTK, which focuses on the development of Fintech based on Blockchain technologies accounts for approximately 95% of security token trade volume and 80% of the total token dollar value. tZero recently signed an agreement with Aspen Digital to trade St. Regis Aspen token. Recent gains in crypto prices has been another catalyst for OSTK. The stock has grown by more than 3170% since its March lows and about 165% in July. OSTK’s consensus revenue estimate of $464.56 million for the quarter ended September 2020 indicates a year-over-year increase of 33.8%. Also, the market expects the company to report a loss per share of $0.31 for the quarter ended September 2020, which represents a significant improvement over the year-ago loss per share $0.87. How does OSTK stack up for the POWR Ratings? A for Trade Grade A for Buy & Hold Grade A for Peer Grade A for Industry Rank A for Overall POWR Rating You can’t ask for better. The stock is also ranked #15 out of 54 stocks in the Internet industry. Owens & Minor, Inc. (OMI) OMI is a leading healthcare solutions company which provides vital supply chain services to manufacturers of healthcare products and healthcare providers. The stock has exhibited tremendous price momentum by growing about 280% since its March lows and more than 110% in July. According to the preliminary second-quarter results, OMI’s income from continuing operations would be in the range of $0.18 to $0.20 per share which is much better than $0.04 per share reported in the first quarter. Furthermore, the company has revised its outlook for adjusted net income from the range of $0.50-$0.60 per share on a constant currency basis to $1.00-$1.20 per share, which is an encouraging sign for investors. Increases in elective procedures, favorable product mix, operating efficiencies, as well as increased manufacturing output to meet the surge in demand for personal protective equipment, are major factors in the stock’s rise in July. OMI has an impressive earnings surprise history with the company surpassing consensus EPS estimates in three of the trailing four quarters. The market expects the company to report an EPS of $0.2 for the quarter ended June 2020, which represents a 100% growth over the year-ago number. OMI’s ability to quickly leverage its strengths to serve its customers in the best possible way is reflected in its POWR Ratings, it has a “Strong Buy” rating with an “A” in Trade Grade, Buy & Hold Grade, Peer Grade, and Industry Rank. Within the Medical-Devices & Equipment group, it’s ranked #27 out of 132 stocks. Eastman Kodak Company (KODK) KODK has increased about 880% in July and the spike in its price mainly occurred at the end of the month. This rapid increase is due to President Trump’s confirmation last week of a $765 million development bank loan diverted towards KODK under the Defense Production Act to fortify the country’s capabilities in producing pharmaceutical ingredients and drugs rather than depending on other countries. This loan advancement has been prepared in a bid to generate ingredients for generic drugs for people who are vulnerable to Covid-19. In the first quarter, KODK’s revenues decreased by approximately $24 million year over year and the company ended the quarter with a cash balance of $209 million which is down from $233 million at the end of December 2019. Moreover, the stock has been quite volatile, and it is difficult to predict how the stock’s price will move shortly. Within the Technology-Hardware group, it is ranked #23 out of 28. Tupperware Brands Corporation (TUP) The consumer products company has gained about 855% since its March lows and about 225% in July. In the second quarter ended June 27th, 2020, net income increased 62% year over year and the company generated $71 million more in cash flow from operating activities as compared to the prior-year period. Sandra Harris, Chief Financial Officer said, “The improvements in profitability achieved in the second quarter demonstrates the ongoing commitment to improve operating margins and deliver $180 million in gross cost reductions in 2020. As we head into the second half of the year, we will continue to explore initiatives designed to improve our liquidity, proactively address near term debt obligations, and build a stronger balance sheet.” The market expects the company to report an EPS of $0.57 for the quarter ended September 2020, which represents a 32.6% growth over the year-ago number. TUP’s EPS is expected to grow 12% per annum in the next five years. TUP’s POWR Ratings reflect this promising outlook. It has an overall rating of “Buy” with an “A” for Trade Grade and Industry Rank. Among the 66 stocks in the Home Improvement & Goods group, it’s ranked #28. Want More Great Investing Ideas? 9 “BUY THE DIP” Growth Stocks for 2020 How HIGH Can This Tech Bubble Fly? 7 “Safe-Haven” Dividend Stocks for Turbulent Times OSTK shares fell $0.22 (-0.27%) in after-hours trading Tuesday. Year-to-date, OSTK has gained 1,068.79%, versus a 3.60% rise in the benchmark S&P 500 index during the same period."}]}