{"article": [{"url": "https://stocknews.com/news/sq-are-shares-of-square-headed-even-higher/", "published": 1596715700.0, "headline": "Are Shares of Square Headed Even HIGHER?", "body": "Shares of digital payments company Square (NYSE:SQ) have been on an absolute tear ever since it went public back in November 2015. SQ stock is trading at $146.55 which means it has returned a staggering 1,530% since its IPO. So, if you invested $1,000 in Square stock during its IPO, you would have returned $15,300 today. SQ stock’s impressive rally, however, has been volatile. It rose to $100 per share in September 2018 before falling to a multi-year low of $32.3 in March 2020, amid the coronavirus-led bear market. This indicates SQ stock is up 353% in less than five months. Let’s take a look at what has impacted Square stock in 2020 and if it remains a solid bet for 2020 and beyond. 7 \"SAFE HAVEN\" Dividend Stocks for Turbulent TimesA look at Square’s business model Square was founded in 2009 to enable small and medium businesses to accept card payments. This was an important capability that was previously inaccessible to several SMB’s. Square looks to combine software, hardware, and financial services to create products that enable the digital transformation of SMBs. Over the years, Square focused on expanding its product portfolio as it recognized sellers need a variety of payment solutions to sustain a thriving business. It now has over 30 products and services including the highly popular Cash App that has helped Square grow into a multi-billion-dollar company. Square has successfully managed to add new sellers and cross-sell products and services that drove revenue growth higher. Its seller-base is well diversified and includes businesses across retail, restaurants, and other services. These businesses are located in the United States, Canada, Japan, Australia, and the United Kingdom. In 2019, it processed $106.2 billion in gross payment volume (GPV) and 2.3 billion card payments from 407 million payment cards. Gross Payment Volume is the total amount spent on the Square platform by its SMB partner customers. Square’s Cash App provides an ecosystem of products to help individuals manage their money. The Cash App started off as a tool to facilitate digital payments and now provides a platform for users to store, send, receive, spend, and also invest their money. The Cash App ended 2019 with 24 million monthly active customers and has now grown to over 30 million. Record Q2 results drive SQ stock higher Now that we have seen the primary business segments of Square, let’s take a look at its recent second-quarter results announced on August 4, 2020. In Q2, Square reported sales of $1.92 billion and earnings per share of $0.18. This was significantly higher than Wall Street revenue estimates of $1.13 billion. Analysts in fact forecast Square to report a net loss of $0.05 per share. SQ stock gained over 7% on August 5 and touched an intra-day record high of $158.43 per share. Square sales in Q2 were up 64% year-over-year and gross profit rose 28% to $597 million. The company confirmed that its seller ecosystem generated gross profit of $316 million, down 9% year-over-year. However, this decline was offset by a stellar performance of the Cash App where gross profits rose 167% to $281 million. Square said, “Although Seller GPV (Gross Payment Volume) declined in the second quarter of 2020 on a year-over-year basis, GPV trends in our Seller business improved sequentially each month in the quarter, driven primarily by sellers resuming operations as COVID-19–related restrictions eased, consumers increasing spending, sellers adapting to contactless commerce, and new sellers joining Square.” Another major metric for Square is its GPV from online channels that rose by 50% and accounted for 25% of total GPV in Q2. This figure is expected to move higher in the upcoming months as the shift to online shopping and related transactions continue to accelerate. Cash App is key for Square’s long-term growth Square continues to rapidly scale its network of Cash App customers. In Q2, the number of products adopted by customers in their first month after activation includes the Cash Card, direct deposit, Boost, and bitcoin investing. Customers who use multiple products have higher lifetime value and generated significantly higher revenue compared to just peer-to-peer payment users, claimed Square. The Square Card is a business debit card that gives users real-time access to the money processed with Square. The Square Card can be used anywhere where Mastercard is accepted with zero monthly or annual charges. Square stated, “Customers increasingly used Cash App as a way to send and spend money: In June, Cash App had more than 30 million monthly transacting active customers, with more than 7 million spending on Cash Card.” In Q2, Cash App customers transacted over 15x per month on average, indicating an increase of 50% year-over-year. This increase was driven by higher user engagement as well as the deployment of government funds related to stimulus and unemployment benefits. Square experienced a positive relationship between Cash Card and direct deposit customers. In Q2 direct deposit actives were among the most engaged Cash Card customers and spent significantly higher than Cash Card actives. The company has integrated these two products where a new Cash Card customer will receive an account and routing number that can be used to receive deposits or pay bills. Square is well poised to disrupt the peer to peer financial products industry that may be in direct competition with retail banking solutions. There is a strong possibility that Cash App users will leverage its various features which might make the checking account redundant. A look at the valuation for SQ stock SQ stock is trading at a market cap of $64.4 billion. Considering its expected revenue of $5.88 billion in 2020, its forward price to sales multiple stands at 11x. Comparatively, its forward price to earnings multiple is close to 400, given the EPS forecast of $0.37 in 2020. These multiples are sky-high but we also know that growth stocks trade at a premium. While SQ stock might be volatile in the near-term, growth investors need to view every major correction as a buying opportunity and look to buy a stock that has the potential to create massive wealth in the upcoming decade. Want More Great Investing Ideas? 9 “BUY THE DIP” Growth Stocks for 2020 How to Trade THIS Stock Bubble? 7 “Safe-Haven” Dividend Stocks for Turbulent Times SQ shares were trading at $153.62 per share on Thursday afternoon, up $7.07 (+4.82%). Year-to-date, SQ has gained 145.56%, versus a 4.39% rise in the benchmark S&P 500 index during the same period."}]}