{"article": [{"url": "https://stocknews.com/news/el-lulu-tif-deck-4-en-vogue-fashion-stocks/", "published": 1596110900.0, "headline": "4 \"En Vogue\" Fashion Stocks", "body": "When much of the world went into lockdown in March, many retail companies shut down, and apparel stocks suffered. Fashion clothing took a back seat to essential everyday items. Nevertheless, some apparel companies took advantage of the growth of online shopping. Some even began selling masks to accommodate demand due to the coronavirus pandemic. As stores have re-opened customers couldn’t wait to engage in some “retail therapy.” Many fashion companies are seeing strong sales and strong stock performance. The Estee Lauder Companies (EL), Lululemon Athletica (LULU), Tiffany & Co (TIF), and Deckers Outdoor (DECK) are all seeing gains as shoppers want to look great during the warm weather. The Estee Lauder Companies, Inc. (EL) 9 \"BUY THE DIP\" Growth Stocks For 2020EL is a global manufacturer of premium skincare, hair care, makeup, and fragrance products. The company has been adversely affected by the pandemic, but it has pivoted to focusing on online sales to compensate for the drop in foot traffic in retail stores. EL’s acquisition of Have & Be Co. last year also contributed to its sales growth. In the quarter ending March 31st, the company witnessed a growth in net cash flows to $1.95 billion from $1.76 billion a year ago. EL’s earnings surprise history is impressive as well, with the stock beating consensus EPS estimates in each of the trailing four quarters. EL’s stock has recovered more than 35% from the 52-week low it hit in mid-March due to the overall crash in the market. The company’s strong recovery could be part of a growth momentum that could last for the rest of 2020. How does EL stack up for the POWR Ratings? A for Trade Grade B for Buy & Hold Grade A for Peer Grade B for Overall POWR Rating You can’t ask for better. The stock is also ranked #4 out of 65 stocks in the Fashion & Luxury industry. Lululemon Athletica, Inc. (LULU) LULU focuses on designing, manufacturing, and marketing athletic apparel and accessories for men, women, and female youth. It operates through corporate-owned stores as well as through direct-to-customer sales. The company recently announced its plan to acquire the at-home fitness company Mirror at a price of $500 million. This move could help the company break into a new and emerging market. LULU has also been adversely affected by the spread of the coronavirus and has had to close its retail counters across the world. However, according to the earnings report for the quarter ending May 3rd 2020, the company has cash and cash equivalents to the tune of $823 million. It feels confident that it has enough liquidity to drive recovery once the pandemic abates. Though LULU missed the consensus EPS estimate last quarter, it beat the estimates in the prior three quarters. Moreover, the stock has been rising since hitting its 52-week low of $128.85 on March 18th due to the coronavirus-led market crash. LULU gained more than 150% during this period, and the momentum might continue given the strength in its business model. It’s no surprise that LULU is rated a “Strong Buy” in our POWR Ratings system. It also has an “A” for Trade Grade, Buy and Hold Grade, and Peer Grade. In the 65-stock Fashion and Luxury industry, it is ranked #1. Tiffany & Co. (TIF) TIF is one of the world’s leading jewelry brands. The company is set to be acquired by LVMH Moët Hennessy as part of a $16.2 billion deal. This move could help shore up TIF’s finances and allow it to meet its future goals. According to TIF’s earnings report for the quarter ending April 30, 2020, the company has cash and cash equivalents worth $1.1 billion. This could provide the company with the financial flexibility it needs to weather these uncertain times. TIF has also been performing well in this “new normal.” t has added close to 20% to its stock price since this year’s low of $103.89 hit on March 18th due to the virus-driven market crash. TIF’s strong fundamentals are reflected in its POWR Ratings, it has a “Buy” rating with an “A” in Buy & Hold Grade and Peer Grade. Within the Fashion & Luxury group, it’s ranked #6 out of 65 stocks. Deckers Outdoor Corporation (DECK) DECK designs, markets, and sells apparel, footwear, and accessories for high-performance activities and for a casual lifestyle. The company operates three brands — Teva, Sanuk, and UGG. While the pandemic significantly affected DECK, the company has focused on its e-commerce portals such as UGG.com, Sanuk.com, and Teva.com. Even though their stores had faced temporary closures, they are now open and running. For the quarter ending March 31st, 2020, the company reported that it had cash and cash equivalents of $649.4 million compared to $589.7 million during the same period last year. This could provide the company with the financial security it needs to come out stronger once the situation stabilizes. The earnings surprise history for DECK looks pretty good, as the company beat the consensus EPS estimates in each of the trailing four quarters. It’s no surprise that DECK is rated a “Strong Buy” in our POWR Ratings system. It also has an “A” for Trade Grade, Buy and Hold Grade, and Peer Grade. In the 65-stock Fashion & Luxury industry, it is ranked #3. Want More Great Investing Ideas? 9 “BUY THE DIP” Growth Stocks for 2020 How HIGH Can This Tech Bubble Fly? 7 “Safe-Haven” Dividend Stocks for Turbulent Times EL shares . Year-to-date, EL has declined -6.30%, versus a 1.69% rise in the benchmark S&P 500 index during the same period."}]}