{"article": [{"url": "https://stocknews.com/news/rwt-nrz-rc-get-paid-10-1-to-ride-this-mreit-recovery-train/", "published": 1598530100.0, "headline": "Get Paid 10.1% to Ride This mREIT Recovery Train", "body": "America’s in a dividend desert, and that’s forcing income hunters to get creative. Are 10.1% paying mREITs the answer? The S&P 500 hasn’t yielded this poorly (1.7%) in roughly a decade. T-notes deliver a fractional yield. Worse, even areas of traditionally elevated yield are offering just so-so payouts right now. At less than 4% on average, high-yield stocks and real estate investment trusts (REITs) will put retirement investors well short of their income goals. The good news? A pair of market niches—business development companies (BDCs) and mortgage REITs—can put 3x that amount of money into our pockets. 7 \"SAFE HAVEN\" Dividend Stocks for Turbulent TimesI recently pointed readers to a “3-click” BDC portfolio yielding 10.9%, which is a little less than the BDC average of 12%. There’s only one area of the market that is capable of delivering more income: mREITs, a subset of the real estate sector that yields an incredible 12.3% Source: Contrarian Outlook But while it’s part of the sector, mREITs have far less to do with real estate than their traditional brethren. Mortgage REITs invest in paper, not land. As the name implies, they buy and/or originate mortgages and mortgage-backed securities, typically for residential or commercial properties. They make their money not from rents, but from interest payments. Therein lies the difficulty of investing in mREITs. You’re not really taking part in the long-term appreciation of properties that makes real estate so attractive in the first place. Instead, you’re effectively gambling on interest rates cooperating with the way these companies have positioned their mortgage portfolios. These big bets can go south in a hurry. Part of the reason mREITs yield so much is that they’ve been slower to recover from the bear market than equity real estate stocks. Far slower. mREITs: 3x More Yield Than REITs, But 3x More Losses Clearly, it’s a mistake to invest broadly in the space given that it’s littered with losers. But if we can find a diamond in the rough, we get to plant another diversified source of sky-high yield into our long-term holdings. Let’s look at three mREITs, yielding 5.0% to 10.1%, that have standout potential. Redwood Trust (RWT) Dividend yield: 7.0% We’ll begin with Redwood Trust (RWT), which also helps us illustrate the mortgage REIT industry’s woes. Redwood Trust is a primarily residential-focused mREIT that deals in single-family and multifamily mortgages. The business is spread across three units: residential lending, business purpose lending and third-party investments (effectively “other”). Redwood, like many other mREITs, was hammered hard by 2020’s lockdown economy. But these drops have less to do with the overall quality of their portfolios, and more to do with the sudden bout of volatility and a collapse in liquidity. John Worth, Nareit Executive Vice President for Research and Investor Outreach, explains: mREITs typically use repurchase (repo) agreements, a form of short-term finance, to fund their agency RMBS and CMBS holdings, which allows them to leverage their capital. In early March, repo lenders began refusing to accept agency CMBS (and some other securities) as collateral and requiring large haircuts on the collateral they already held. As these funding issues propagated through the system, margin requirements on outstanding repo agreements increased dramatically, resulting in margin calls on mREITs that were sometimes in excess of their available liquidity. Redwood Trust, to its credit, met all of its margin calls. But it saw its book value plummet from $15.98 per share at the end of 2019 to $6.32 per share at the end of 2020’s first quarter. Earnings went from 49 cents per share in Q1 2020 to an $8.28 loss. The gut-punch for income investors: RWT, which had announced a 6.7% increase to the payout earlier in the year, was forced to delay that payout for liquidity reasons, then cut its second-quarter dividend by 61% to 12.5 cents per share. Meanwhile, the stock remains off 56% year-to-date including dividends. Sadly, This Chart Isn’t the Exception to the Rule You’ll see similar stories peppered across the mREIT space. The good news for Redwood Trust is that it’s at least back on the upswing. Book value rebounded to $8.15 per share during the second quarter, and GAAP earnings returned to positive territory. You might even be tempted to play a rebound given RWT still yields 7% after a massive dividend haircut. But the mREIT’s second-quarter snap-back was slower than Wall Street expected, and this company still appears too vulnerable to gamble on amid a still-brittle economic recovery. New Residential Investment (NRZ) Dividend yield: 5.0% New Residential (NRZ) has suffered a similar fate to Redwood Trust. Shares are still worth only about half of what they were to start the year, and the dividend was slashed by 90% early on in the crisis. And yet, this interesting and differentiated REIT is giving off a few positive vibes of late. New Residential makes its money from a number of sources, including residential loans, loan origination and a little servicing. But the biggest chunk of its operations are dedicated to “MSRs & Servicer Advances.” MSRs are effectively “the right” to collect payments from a borrower – so rather than owning these loans, NRZ instead owns the rights to service these loans. These MSRs do wonders when mortgage refinancing slows down. Unfortunately, that hasn’t been the case at all, as 2020 has ushered in record-low mortgage rates that has millions of Americans scrambling for a new deal. This business racked up a $451 million net loss in Q1 that thinned in Q2, but still bled $283 million. But the company at least started to make amends to income investors. After dropping its payout from 50 cents per share to a nickel a quarter earlier, New Residential doubled the Q2 dividend to 10 cents per share. NRZ’s Dividend Starts the Long Trek Back Core second-quarter earnings came to 34 cents per share, exceeding analyst estimates and covering the cash distribution several times over. Origination profits were strong thanks to a 44% jump in higher-margin retail originations, which Piper Sandler’s Kevin Barker says “could be an important driver of earnings going forward.” It’s still early in the recovery, but NRZ’s progress, as well as a deep 25% discount to tangible book value, could be worth a flier. Longer-term investors should wait for more evidence of a “sticky” comeback. Ready Capital (RC) Dividend yield: 10.1% Ready Capital (RC) is an attention-grabber for a few reasons. For one, the 10.1% is much more in line with the kind of income we want to siphon out of the industry. But also, Ready does real estate and business lending. RC will lend up to $45 million on multifamily and commercial real estate. But it also originates small-balance commercial loans (SBCs), Small Business Administration (SBA) loans, and does residential mortgage lending via its GMFS subsidiary. That business blend gave Ready some extra firepower during the COVID crisis, in that it was able to play a part in the government’s Paycheck Protection Program (PPP). In fact, the company facilitated the origination of $2.7 billion in PPP loans to more than 40,000 small businesses. That resulted in $23 million in fees during Q2, and the company expects another $18 million in fees. Those fees obviously are a one-time bump, but it’s one of several ways in which Ready Capital’s diversified business lines can help RC roll with the punches. The mREIT also was able to leverage low interest rates into a record $1.2 billion in residential mortgage originations during the second quarter. And Ready has resumed its core commercial real estate lending after putting that entire operation on pause during Q2. Yes, Ready wasn’t exempt from the industry’s dividend scythe. But the cut wasn’t as deep—a 37.5% reduction to 25 cents per share. And that new payout is covered almost three times over by core profits. The result is a spry-looking mREIT that still yields a mouth-watering 10.1%, and whose assets you can buy for 70 cents on the dollar right now. Want More Great Investing Ideas? Your Early Retirement Portfolio: 7.7% Dividends—Every Month—Forever How to Retire on 10% Dividends Paid Monthly The Simple (and Safe) Way to Earn 15% Every Year from Stocks RWT shares were trading at $7.09 per share on Thursday afternoon, up $0.12 (+1.72%). Year-to-date, RWT has declined -55.25%, versus a 9.62% rise in the benchmark S&P 500 index during the same period."}]}