{"article": [{"url": "https://stocknews.com/news/pep-kdp-bf-b-3-top-beverage-stocks-that-pay-dividends/", "published": 1598011700.0, "headline": "3 Top Beverage Stocks That Pay Dividends", "body": "With the historically low Fed interest rates, dividend paying stocks are grabbing the attention of many investors. Instead of keeping money idle, investing in reputable dividend-paying stocks can reap attractive yields. However, while investing in dividend stocks, choosing the correct stocks is crucial. Companies with a consistent dividend payout history and and strong momentum over the past few quarters is a great way to get started. At the same time, it’s always better to select stocks from industries that are well positioned to benefit from current trends or seasonality as this could provide capital gains as well. Companies such as PepsiCo, Inc. (PEP), Keurig Dr Pepper, Inc. (KDP) and Brown Forman Corporation (BF.B) fulfill all requisite criteria. As some of the most popular companies in the beverage sector, these companies have returned more than 35% since their March lows, and all three pay dividends. With strong recent performance, these companies are expected to gain significantly with increasing demand for their products over the summer and into the fall. 7 \"SAFE HAVEN\" Dividend Stocks for Turbulent TimesPepsiCo, Inc. (PEP) With a market share of over $190 billion, PEP is one of the largest soft drink manufacturing companies in the world. It is also known for its snacks subsidiary Frito Lays, which is one of the most popular chips manufacturers across the globe. With the pandemic creating a volatile stock market, investing in companies such as PEP, which have a huge market valuation and goodwill in the industry, can help investors secure their finances from intraday fluctuations in the market. Also, PEP is one of the best dividend stocks, as its aggregate dividend issuance over the last 6 years surpasses 97.04% of other dividend-paying stocks in the StockNews.com universe. PEP pays an annual dividend of $4.09, which yields 2.9% based on its current price. PEP has consistently increased its dividend payments every year since 2000. The company’s stable cash flow, which is less volatile than 97.25% of dividend paying stocks in StocksNews.com universe, allows it to maintain its steady flow of dividends. PEP increased its quarterly dividend payout by 7% to $1.02 in June 2020. The consensus revenue estimate of $17.21 billion for the third quarter ending September 2020 indicates a slight improvement year-over-year. Though the consensus EPS estimate indicates a year-over-year decline, PEP has an impressive earnings surprise history, as it beat the street EPS estimates in each of the trailing four quarters. PEP gained more than 35% since hitting its 52-week low of $101.42 in March, thereby hitting its year-to-date high of $138.89 in August. How does PEP stack up for the POWR Ratings? A for Trade Grade A for Buy & Hold Grade B for Peer grade A for Overall POWR Rating. It is also ranked #1 out of 29 stocks in the Beverages industry. Keurig Dr Pepper, Inc. (KDP) KDP is one of the most popular beverage brands across the United States and internationally. Its strong market presence and brand loyalty has allowed for smooth operations despite the unsettling market conditions over the second quarter. KDP’s net sales of $2.86 billion for the second quarter ending June 2020 rose 1.8% year-over-year. Coffee sales improved 5.4% year-over-year to $1.04 billion, while packaged beverages sales increased 6.2% from the year-ago value to $1.38 billion. Adjusted operating income increased 10.4% from the year-ago value to $775 million, while adjusted operating margin increased 210 basis points to 27.1% during the same time. Adjusted net income of $469 million improved 10.9% year-over-year. KDP reported a strong cash flow balance of $524 million, allowing the company to reduce its debt by $274 million. Its trailing twelve-month cash flow is higher than 87.58% of dividend stocks in the Stocknews.com universe. KDP’s strong liquidity position has ensured stable and periodic dividend payouts as well. KDP pays $0.60 per share annually, which yields 2.06% on its prevailing price. Its average trailing twelve-month dividend has grown 9.03% annually over the past 5.75 years. The consensus EPS estimate of $0.37 for the third quarter ending September 2020 indicates a 15% rise year-over-year. The street revenue estimate of $2.97 billion indicates a 3.3% increase from the same period last year. KDP hit its year-to-date high of $31.47 in July, thereby gaining more than 65% since hitting its 52-week low of $18.98 in March. It’s no surprise that KDP is rated a Buy in our POWR Ratings system. It has a grade of A for Trade Grade and a B for Buy & Hold Grade. In the 29-stock Beverages industry, KDP is ranked #8. Brown Forman Corporation (BF.B) BF.B is an alcoholic beverage manufacturer and seller, exporting its products worldwide. It has over 40 spirit, wine and ready-to-drink cocktail brands. Ahead of its first quarter 2021 results, which will be announced on September 2nd, BF.B announced a quarterly cash dividend of $0.17. BF.B has paid dividends every quarter over the past 75 years, and has increased its dividend payouts for 36 consecutive years. BF.B is listed in the S & P 500 Dividend Aristocrats Index, which includes companies that have increased their dividends for 25 straight years. Over the past 6 years, BF.B has paid more dividends than 82.8% of other U.S. dividend paying stocks. BF.B currently pays an annual dividend of $0.70, which yields 0.97% on its current price. It has a relatively stable cash flow balance, allowing the company to sustain its dividends. BF.B’s cash flow variability is lower than 96.55% of dividend paying stocks in our set. Since hitting its 52-week low of $44.8 in March, BF.B gained more than 60% to hit its 52-week high of $73.50 in August. BF.B is rated a Strong Buy in our POWR Ratings system, with a grade of A in Trade Grade, Buy & Hold Grade, and Peer Grade. It is currently ranked #3 out of 29 stocks in the Beverages industry. Want More Great Investing Ideas? The Best of StockNews 2 Step Process to Sell @ Market Top in September 9 “BUY THE DIP” Growth Stocks for 2020 PEP shares were unchanged in after-hours trading Friday. Year-to-date, PEP has gained 1.30%, versus a 6.56% rise in the benchmark S&P 500 index during the same period."}]}