{"article": [{"url": "https://stocknews.com/news/eva-ocsl-hrzn-mndo-4-buy-rated-dividend-stocks-to-own-for-the-remainder-of/", "published": 1599134900.0, "headline": "4 \"Buy-Rated\" Dividend Stocks to OWN for the Remainder of 2020", "body": "Equity income investing has gained enormous traction amid the pandemic as the average investor is trying to secure a steady income with interest rates so low. The stock market is making new highs, yet investing has become riskier with the health of the economy in doubt. As long as the Fed keeps us in a low interest rate environment, now is a great time more than ever to consider dividend investing. Dividend payments fell by $42.5 billion in the second quarter, compared to the year-ago quarter, as many companies were forced to cut their payouts due to weak sales and cash-flows. This was the largest decline since the first quarter of 2009, when the economy witnessed the Great Recession. However, some companies were able to survive this unprecedented time due to their robust financial and business strength, and therefore did not slash their dividends. Based on an impressive dividend payout history, Enviva Partners (EVA), Oaktree Specialty Lending Corporation (OCSL), Horizon Technology Finance Corporation (HRZN) and MIND C.T.I. Limited (MNDO) could be good additions to your portfolio. 7 Best ETFs for the NEXT Bull MarketEnviva Partners (EVA) EVA focuses on production and distribution of utility-grade wood pellets to power generators. The company specializes in sustainable wood bio-energy. Its manufacturing facilities provide utility customers with reliable, renewable fuel to replace coal and complement wind and solar technologies. The stock has been uniformly paying quarterly dividends since 2015 and has been consistently increasing the payout amount each quarter. The most recent quarterly dividend declared by the company was $0.765 for the second quarter that ended in June 2020. This was an increase of 15.9% from the year-ago quarter. The annual dividend for the company cumulates to $3.06, translating into a yield of 7.45%. EVA generated a negative free cash flow of $7.4 million in its last reported quarter, improving significantly compared to the negative cash flow of $20.78 million in the year-ago quarter. Cash flow from operations increased 44.4% year-over-year to $25.75 million. Net income came in at $8.5 million as compared to net loss of $3.8 million in the year-ago quarter. EPS for the quarter came in $0.26 compared to the year-ago negative EPS of $0.2. Lumber and wood product stocks have had significant growth over the last couple of years due to rising demand and increasing application diversity. Hence, the street expects EVA’s EPS to grow 56.2% in the current year, to $1.64. EVA has recently completed the acquisition of Georgia Biomass, a leading global energy company specializing in sustainable wood bioenergy, and its Waycross Production Plant. The deal will help the company to work closely with local leaders, private forest landowners, and conservation organizations to continue to make a positive impact. Moreover, the company is planning a recapitalization and a new equity commitment to finance future growth. EVA has nearly doubled from its March low of $20.63. It is currently trading just 5.3% lower than its 52-week high of $43.42. It closed yesterday’s trading session at $41.12, gaining more than 10% year-to-date. How does EVA stack up for the POWR Ratings? A for Trade Grade A for Buy & Hold Grade A for Industry Rank A for Overall POWR Rating Oaktree Specialty Lending Corporation (OCSL) OCSL is a business development financial firm that lends to and invests in small and mid-sized companies in North America, primarily in connection with investments by private equity sponsors. The company seeks to invest in services like education, business, retail and consumer, healthcare, manufacturing, restaurants, construction, and media sectors. The stock had been consistently paying a fixed amount of $0.095 as quarterly dividends since 2018. But it has recently increased its dividend payout by 11%, declaring a dividend of $0.105 for fiscal third quarter ended June 2020. The dividend has grown 2.6% over the past year, cumulating to an annual dividend of $0.38, and a yield of 7.6%. Total investment income came in at $34.4 million for the last reported quarter, primarily driven by a larger average investment portfolio and higher yields on new originations. The number of new investment commitments in new portfolio companies increased from 3 to 10 year-over-year. The new funded investment activity increased to $198.5 million, compared to the year-ago commitment of $74.1 million. The company delivered a net income of $120 million, growing 500% year-over-year. EPS for the quarter came in at $0.12, beating the consensus estimate by 9.1%. The fair value of the investment portfolio increased to $1.6 billion at the end of June comprising investments in 119 companies. Hence, the street expects EPS to increase 30% year-over-year in the next quarter to $0.13. OCSL closed yesterday’s trading session at $4.99 and is up more than 114% from its March lows. It is presently trading 11.5% below its 52-week high. OCSL’s POWR Ratings reflect this promising outlook. It has an overall rating of Buy with a grade of A in Trade Grade and Peer Grade, and a B in Buy & Hold Grade. Among the 55 stocks in the Private Equity industry, it’s ranked #7. Horizon Technology Finance Corporation (HRZN) HRZN is a business development company specializing in lending and investing in development-stage investments. It focuses on making secured debt and venture lending investments to venture capital backed companies in the technology, life science, healthcare, and cleantech industries. The stock has been consistently making a monthly dividend payment of $0.1 since December 2016. HRZN has already scheduled a dividend payment of $0.1 each month till December 2020. The annual dividend of the company cumulates to $1.2. While the four-year average dividend yield for HRNZ is 12.24%, the current annual dividend translates to a 9.95% yield. HRZN’s investment income increased 29% year-over-year to $13.5 million in the last reported quarter. This growth was primarily attributed to the opportunistically originated loans to several quality life science companies. Consequently, the company funded six loans totaling $40.4 million during the quarter. HRZN also amended and extended a $100 million senior secured debt facility with a large US-based insurance company. EPS for the quarter came in $0.4, beating the consensus estimate by 37.9%. Moreover, HRZN beat EPS estimates in three of the trailing four quarters, which is impressive. In line with the strong financial flexibility, and the company’s portfolio’s stable credit profile, the street expects EPS to grow 5% per year for the next five years. HRZN closed yesterday’s trading session at $12.06, 12.5% below its 52-week high of $13.78. Additionally, the stock has gained more than 129% from its March lows. HRZN is rated a “Strong Buy” in our POWR Ratings system. It also has a grade of A for Trade Grade, Buy & Hold Grade, and Peer Grade. It is ranked #2 out of 55 stocks in the Private Equity industry. MIND C.T.I. Limited (MNDO) MNDO designs, develops, and operates real-time and offline convergent billing and customer care software solutions in the United States and internationally. The company offers solutions that support various services, such as voice, data, and content services, and pay-in-advance payment models in a single platform. MNDO declares a dividend during the first quarter of each year and has a reliable dividend history, paying dividends for 17 years now. The CAGR of the company’s dividend was 1.6% over the past five years. It declared a dividend of $0.24 earlier this year and has an annual dividend yield of 10.41%. The company reported impressive second quarter results with free cash flow for the firm growing 8% year-over-year to $1.23 million. The cash flow from operations also increased 11% compared to the year-ago quarter to $1.3 million. The top-line came in at $5.6 million, as customer care and billing software totaled to $3 million contributing 53% to the total revenues. Net profit improved 35% year-over-year to $1.41 million. EPS for the quarter came in at $0.07, growing 40% year-over-year. Moreover, this quarter’s follow-on orders include a major upgrade of the billing platform, indicating better margins for the succeeding quarters. The stock closed yesterday’s trading session at $2.34 and has recovered more than 40% since hitting a low of $1.64 in April this year. MNDO is rated a Strong Buy in our POWR Ratings system. It also has a grade of A for Trade Grade, Buy & Hold Grade, and Industry Rank, and a B for Peer Grade. It is ranked #31 out of 92 stocks in the Software – Application industry. Want More Great Investing Ideas? 7 Best ETFs for the NEXT Bull Market Beware Stocks in September? 9 “BUY THE DIP” Growth Stocks for 2020 EVA shares were trading at $40.15 per share on Thursday afternoon, down $0.97 (-2.36%). Year-to-date, EVA has gained 13.98%, versus a 8.81% rise in the benchmark S&P 500 index during the same period."}]}