{"article": [{"url": "https://stocknews.com/news/man-why-manpowergroup-is-setting-up-for-a-big-move-in/", "published": 1601899700.0, "headline": "Why ManpowerGroup is Setting Up for a Big Move in October", "body": "While analyzing charts over the weekend, I discovered a triangle pattern has emerged in the chart of ManpowerGroup (MAN). MAN is one of the largest firms in the global staffing industry currently serving 600,000 clients and placing millions of job candidates. The company’s revenues are growing through acquisitions, cost-cutting, and price discipline. Take a look at the 1-year chart of MAN below with my added notations: 7 Best ETFs for the NEXT Bull Market Chart of MAN provided by TradingView As you can see looking at the blue lines above, a triangle pattern has formed over the past several months. As the trendlines converge on each other, the pattern is created. Since there is no true way to know which way the stock will break, most traders will wait for the breakout or breakdown before entering a trade. A trader could enter a long position on a break above the descending trendline or if the stock was to break below the ascending trendline, a short trade could be entered. Keep a close on MAN over the next couple of weeks, as the stock reports its latest quarterly results on October 16th. Want to See My Favorite Stock Trades Today? The process I use to select these “Chart of the Day” stocks is just the starting point for what I put in my private portfolio. There I take a deeper dive into the stock market outlook. And determine which sectors are likely to outperform. Then and only then to do I pull the trigger on the most timely trades. If you would like to be notified of my best trades, then just click on the link below to get started! See Christian Tharp’s Top Stock Picks Now Have a good trading day! Christian Tharp, CMT @cmtstockcoach MAN shares were trading at $75.86 per share on Monday morning, up $0.77 (+1.03%). Year-to-date, MAN has declined -20.73%, versus a 6.27% rise in the benchmark S&P 500 index during the same period."}]}