{"article": [{"url": "https://stocknews.com/news/dg-bj-big-3-best-discount-store-stocks-to-buy-now/", "published": 1598443700.0, "headline": "3 BEST Discount Store Stocks to Buy Now", "body": "It was not long ago when the masses avoided discount stores. Discount store merchandise was once stereotyped as inferior in quality, likely to break soon after purchase, and unworthy of consumers’ hard-earned dollars. Furthermore, plenty of shoppers frowned at the idea of spending a little extra time waiting in line to check out their items at discount stores with comparably fewer cashiers. Times have now changed. The once-neglected discount stores are now the apple of investors’ eyes. Though discount store checkout lines are slower than those at regular stores, people have more time on their hands now than in years past due to widespread unemployment and underemployment. Most important is the fact that consumers are looking to reduce spending in every way possible. As long as the recession drags on, the following discount store stocks could continue to increase in value: Dollar General Corporation (DG), BJ’s Wholesale Club (BJ), and Big Lots (BIG). 7 \"SAFE HAVEN\" Dividend Stocks for Turbulent TimesDollar General Corporation (DG) Take a drive around your town, and you are likely to find at least one DG store. DG specializes in affordable merchandise, priced around $5 to $10 or less. DG’s low-cost offerings are perfect for cost-conscious consumers amidst the pandemic and recession. The POWR Ratings show DG has A grades in each of its POWR components, except Peer Grade, which has a grade of B. DG is ranked in the top five out of 18 Grocery/Big Box Retailers stocks. The average analyst price target for DG is $210.38, which is 6% higher than its current price. DG could continue to grow amidst the economic pullback, increasing its price and expanding its customer base. BJ’s Wholesale Club (BJ) Shoppers looking to buy food and other essentials in bulk often make their way to BJ stores. BJ requires membership for customers to take advantage of its low prices, yet the prospect of paying for a membership and renewing it hasn’t scared shoppers away. It is particularly interesting to note that BJ provides 25%+ savings on a wide array of manufacturer-based items compared to conventional supermarkets. If you are hesitant to hop on the BJ train, look no further than the stock’s POWR Ratings. BJ has grades of A across the board. The stock is ranked 7th of 18 stocks in the Grocery/Big Box Retailers industry. Analysts have set a price target for BJ, just under $49. BJ has a fairly reasonable forward P/E ratio of 18.10. BJ sales hiked more than 18% on a year-over-year basis, coming in just short of $4 billion. The company’s revenues are quickly approaching $4 billion. At the moment, BJ has more than six million members. This membership base represents an increase of 10% on a year-over-year basis. Furthermore, BJ debt obligations are decreasing with each passing year. All in all, BJ’s debt has been chopped in half since the company went public. The stock may break through its 52-week high of $47.23 in the months to come as more customers sign up for a BJ membership, shop in bulk, and load up for an uncertain future. Big Lots (BIG) When times get tough, consumers consolidate shopping to a few stores and trips as possible. The likes of BIG are benefitting from the recession. BIG sells everything from food to furniture, electronics, toys, seasonal items, and more. Consumers are more than happy to scoop up their sundries at BIG rather than venture out to one specialty store after another. BIG has perfect POWR Ratings with grades of A in each component that make up the POWR Ratings. BIG is ranked 8th of 18 stocks in the Grocery industry. BIG comparable sales are up 15% to 20% during the pandemic. BIG now offers online sales at BigLots.com, along with curbside pickup at all of its stores. In other words, this is not the BIG of old. BIG is willing to reinvent itself and pivot as necessary. Want More Great Investing Ideas? The Best of StockNews 2 Step Process to Sell @ Market Top in September 9 “BUY THE DIP” Growth Stocks for 2020 DG shares were trading at $198.88 per share on Wednesday morning, up $0.22 (+0.11%). Year-to-date, DG has gained 28.29%, versus a 8.13% rise in the benchmark S&P 500 index during the same period."}]}