{"article": [{"url": "https://stocknews.com/news/aptv-voxx-mga-3-auto-part-stocks-that-could-drive-your-portfolio-higher/", "published": 1595333300.0, "headline": "3 Auto Part Stocks That Could Drive Your Portfolio Higher", "body": "Entering 2020, many were expecting a rebound in auto part stocks. Auto part stocks do well during periods of higher demand for cars and trucks. And, there was optimism for an uptick in vehicle sales following three years of declining sales. First of all, the average age of the car on the road was hitting a record-high of 11.8 years which indicates pent-up demand for new cars to replace older vehicles. The labor market was in good shape, wages were trending higher, and low rates made cars quite affordable due to available and abundant auto financing terms. 7 Best ETFs for the NEXT Bull MarketAnother positive factor for the auto parts stocks was clarity on trade with the signing of the Phase 1 deal between the US and China. However, the coronavirus has wrecked this bullish thesis. Car sales have plunged. Supply lines have been disrupted due to the coronavirus which has led to shutdowns at many manufacturing facilities. For auto parts, this is complicated as it negatively affects them from a production and demand perspective. However, once this crisis passes, the same positive fundamentals will remain. Further, there is talk of a new “cash for clunkers” bill which could lead to a surge of car buying. Additionally, rates are even lower. Certain auto parts stocks will grow stronger during this crisis, while weaker ones will lose market share. Here are three auto part stocks worth considering: VOXX International Corporation (VOXX) VOXX is a global manufacturer and distributor of automotive and consumer technologies. Earlier this month, VOXX acquired Directed’s aftermarket remote start, security systems, and connected car solutions for $11 million. This will help promote innovation and widen VOXX’s distribution network. EyeLock, a majority-owned subsidiary of VOXX that provides iris-based identity authentication solutions, recently announced a partnership with Marubeni America Corporation and Marubeni Metals Corporation. This partnership will give EyeLock access to the Japanese market and also the opportunity to expand in Asia. With an increased demand for “self-owned vehicles” as people try to avoid public transport, the demand for auto parts will be on the rise. VOXX has been performing well during these turbulent times and has added approximately 268% to its stock price since this year’s low of $1.82 hit on March 20th due to the virus-led market crash. VOXX’s consensus revenue estimate of $107 million for the current quarter indicates a year-over-year increase of 18.6%. The stock has returned 35.3% over the past three months and 53.2% year to date. How does VOXX stack up for the POWR Ratings? A for Trade Grade A for Buy & Hold Grade A for Peer Grade B for Industry Rank A for Overall POWR Rating You can’t ask for better. The stock is also ranked #5 out of 50 stocks in the Auto Parts industry. Magna International, Inc. (MGA) MGA is a mobility technology company that specializes in vehicle engineering, contract manufacturing, electronics, and software capabilities. MGA has an impressive history of beating earnings as it’s topped consensus estimates in each of the trailing four quarters. MGA’s stock has gained about 109% from the 52-week low it hit in mid-March due to the overall dip in the market. In the first quarter this year, the company returned $313 million to shareholders through share repurchases and dividends. MGA’s shareholder yield, which is a measure of how much capital is returned to stockholders via dividends and buybacks is 20.2%, greater than the shareholder yield of 89% of stocks. The company pays an annual dividend of $1.60, which yields 3.36% based on the current price. MGA’s POWR Ratings reflect a promising outlook. It has an overall rating of “Buy” with an “A” for Trade Grade and Peer Grade and a “B” for Buy & Hold Grade and Industry Rank. Among the 50 stocks in the Auto Parts group, it’s ranked #9. Aptiv PLC (APTV) APTV is a global technology company headquartered in Dublin, Ireland. It operates in four segments — electronics and safety, thermal systems, electrical architecture and powertrain systems. In the first quarter, net income per share attributable to APTV increased to $6.14 from $0.92 a year ago due to the completion of APTV’s autonomous driving joint venture with Hyundai Motor Group. The stock has been rising since hitting its 52-week low of $29.22 on March 18th and is 180% higher since then. APTV’s earnings surprise history is impressive with the company beating consensus EPS estimates in each of the trailing four quarters. APTV’s EPS is expected to grow by 6.8% per annum in the next five years. Twelve out of fourteen Wall Street analysts recommend a ‘buy’ rating on the stock It’s no surprise that APTV is rated “Buy” in our POWR Ratings system. It also has a “B” for Trade Grade, Peer Grade, and Industry Rank. In the Auto Parts industry, it is ranked #8 out of 50 stocks. Want More Great Investing Ideas? 9 “BUY THE DIP” Growth Stocks for 2020 Newly REVISED 2020 Stock Market Outlook 7 “Safe-Haven” Dividend Stocks for Turbulent Times APTV shares . Year-to-date, APTV has declined -13.57%, versus a 2.02% rise in the benchmark S&P 500 index during the same period."}]}