{"article": [{"url": "https://stocknews.com/news/avgo-umc-nvec-3-strong-tech-stocks-with-dividends-yielding-more-than-3/", "published": 1595333300.0, "headline": "3 STRONG Tech Stocks With Dividends Yielding More Than 3%", "body": "Tech stocks continue to rally across the market as many businesses have shifted to remote work. Yesterday’s rally was partly driven by anticipated earnings reports from some of the major tech companies. The tech-heavy Nasdaq index reached its highest level ever at 10,839.93 yesterday morning. The work from home dynamic has only accelerated the move to a digital world, lifting many technology stocks. If you’re looking to narrow your focus, for stable and robust technology stocks, then look no further than tech stocks with robust dividend yields. You can take advantage of price appreciation as well as the income that the dividends provide. To some, tech stocks can seem risky, but by focusing on dividend producing stocks, you can lower your risk as dividend-paying stocks can be some of the safest stocks to own. Here are three tech stocks with dividends yielding more than 3%: 7 \"SAFE HAVEN\" Dividend Stocks for Turbulent TimesBroadcom Inc. (AVGO) AVGO is an analog and digital semiconductor manufacturer. It also has operations in the Infrastructure Software Intellectual Property licensing domain. Services provided by AVGO are extensively used in private broadband connections, data center networking, set-top boxes, smartphones and other telecommunication equipment, factory automation, alternative energy systems, and power systems. AVGO has huge growth potential due to its vested interest in the 5G space. As semiconductors are a vital component of the infrastructure for the upcoming 5G network, demand is also increasing to update the existing 4G setup. AVGO increased its dividends for 22 consecutive quarters, making the stock reliable for income investors. The current dividend yield stands at 4.10%. AVGO increased its quarterly dividend by 22.6% in December 2019 to $3.25 per share, and managed to retain this amount even during the economic slump caused by the pandemic. It has free cash flow of $9.96 million for its trailing twelve months, and its free cash flow has increased over the past few years, indicating its ability to sustain the dividend payment. The consensus EPS estimate for AVGO of $5.23 for the quarter ending July indicates a year-over-year increase of 14%. The consensus revenue estimate indicates an increase of 4.5% over the year-ago number. AVGO shares gained more than 100% after hitting its 52-week low of $155.67 on March 18th. Given a business model that is well-positioned to thrive in the “new normal,” this momentum should continue. How does AVGO stock up for the POWR Ratings? A for Trade Grade A for Buy & Hold grade B for Peer Grade A for Industry Rank A for overall POWR Rank AVO is also ranked #4 out of 86 stocks in the Semiconductor and Wireless Chip industry. United Microelectronics Corporation (UMC) Headquartered in Taiwan, UMC specializes in metal oxide semiconductors (CMOS), sophisticated system-on-chip (SOC) designs, high voltage integrated circuits, and more. The company operates as a semiconductor wafer foundry in Taiwan, Singapore, China, Hong Kong, Japan, the United States, Europe, and other countries. UMC has gained investors’ confidence through its relatively better performance during the pandemic. The company recently reported a 24.6% year-over-year increase in sales to $14 million for June 2020. Also, sales for the January to June period increased by 26.6%. This indicates that the pandemic has worked favorably for UMC. UMC pays an annual dividend of $0.10, which yields 3.60% based on the current price. The company increased its quarterly dividend by 50.8% in July 2020 and should sustain this level, given its solid cash flow position. UMC’s trailing twelve-month cash flow is more than 97.8% of US dividend stocks. The consensus EPS estimate of $0.05 for the second quarter indicates a year-over-year increase of 150%. The consensus revenue estimate also indicates a year-over-year improvement of 25.60%. So, things look pretty favorable for UMC. UMC has gained more than 25% since hitting this year’s low at the beginning of April. UMC’s POWR Ratings are consistent with its strong business foundation. It has an overall rating of “Strong Buy,” with an “A” in Trade Grade, Buy & Hold Grade, Peer Rank and Industry Rank. It is also ranked #17 out of 86 stocks in the Semiconductor and Wireless chip industry. NVE Corporation (NVEC) NVEC is a pioneer in manufacturing nanotech spintronics to obtain, transmit, and store digital data internationally. It also uses its licensed magnetoresistive random access memory technology (MRAM) for its industrial, medical, and scientific applications. With the increasing need for data transmission and storage across the globe to facilitate remote working, NVEC’s products had been in high demand for the quarter ending June 30th. The company reported a 10% year over year increase in total revenue for the fourth quarter ending March 31st. NVEC pays an annual dividend of $4 per share, which yields 6.48%. Among the other dividend-paying US stocks in our universe, NVEC’s dividend yield is in the top 16.1%. In terms of stability of dividend payments, NVEC has maintained the same dividend level since 2015. Moreover, NVEC reports less variability in its cash flow than 98.9% of other dividend stocks, so it should sustain its dividend payment in the future. NVEC’s earnings are expected to grow 25% annually in the next five years. NVEC recovered more than 40% since hitting its 52-week low of $42.85 in March due to the dip in the market. NVEC has an overall rating of “Buy” with an “A” for Industry Rank and “B” for Trade Grade. Among the 86 stocks in the Semiconductor & Wireless Chip industry, it’s ranked #47. Want More Great Investing Ideas? 9 “BUY THE DIP” Growth Stocks for 2020 Newly REVISED 2020 Stock Market Outlook 7 “Safe-Haven” Dividend Stocks for Turbulent Times AVGO shares were unchanged in after-hours trading Tuesday. Year-to-date, AVGO has gained 2.20%, versus a 2.07% rise in the benchmark S&P 500 index during the same period."}]}