{"article": [{"url": "https://stocknews.com/news/akba-ibb-mrsn-vxrt-tril-4-best-performing-small-cap-biotechnology-stocks/", "published": 1596110900.0, "headline": "4 Best-Performing Small-cap Biotechnology Stocks", "body": "Biotech stocks have been one of the strongest sectors since the coronavirus started impacting financial markets. The iShares Nasdaq Biotechnology ETF (IBB) was down only 16% during the coronavirus crash, in which the Nasdaq dropped 32%, and the S&P 500 was down 35%. It’s also led the recovery as IBB is 10% above its pre-coronavirus peak, while the Nasdaq is 6% above these levels, and the S&P 500 is 4% lower. The outperformance makes sense in terms of fundamentals. Given the world’s search for a vaccine, copious amounts of money has been invested in the sector from governments and the private sector. Beyond the coronavirus, demand for drugs and new treatments is one part of the economy that is most likely to remain constant given the aging population in developed countries. 9 \"BUY THE DIP\" Growth Stocks For 2020So, it’s not surprising that some of the biggest stock market winners of 2020 have come from this sector. Akebia Therapeutics (AKBA), Mersana Therapeutics (MRSN), Vaxart (VXRT), and Trillium Therapeutics (TRIL) are four of the best-performing small-cap stocks in the sector. Akebia Therapeutics, Inc. (AKBA) AKBA specializes in developing and marketing proprietary therapeutics meant for patients with kidney disease. The company recently announced the approval of their new proprietary treatment in Japan called Vadadustat which will help with the treatment of Anemia in patients with chronic kidney disease. This development could give AKBA an edge over its peers in the future. Investors’ optimism surrounding this development and the company’s fundamental strength has been helping the stock make rapid gains. It has been witnessing a steady rise in stock price this year with an 80% year to date gain. AKBA also gained more than 180% since hitting a 52-week low in mid-March due to the overall crash in the market. The company’s strong recovery could be part of a growth momentum that could last well for the rest of 2020. In the first quarter of 2020, AKBA’s total revenue grew 15.8% year over year to $88 million. The company delivered a positive earnings surprise of 24.2%. How does AKBA stack up for the POWR Ratings? B for Trade Grade A for Industry Rank B for Peer Grade B for Overall POWR Rating The stock is also ranked #40 out of 338 stocks in the Biotech industry. Mersana Therapeutics, Inc. (MRSN) MRSN focuses on developing and selling antibody-drug conjugates to treat various types of cancer. Recently, the company announced the results of its XMT-1536 Phase 1 study. The data from the study was positive and could lead to better treatment of patients with platinum-resistant ovarian cancer. The stock has skyrocketed this year. It has risen by close to 250% so far this year. The stock was not significantly affected by the overall stock market crash that took place in mid-March. MRSN’s earnings surprise history is impressive as well with the stock beating consensus EPS estimates in each of the trailing four quarters. It’s no surprise that MRSN is rated “Buy” in our POWR Ratings system. It also has an “A” for Trade Grade and Industry Rank. In the 338-stock Biotech industry, it is ranked #46. Vaxart Inc. (VXRT) VXRT is a clinical-stage biotechnology company that specializes in the development of oral recombinant vaccines. The company’s potential oral coronavirus vaccine was chosen as part of Operation Warpspeed in June. If the company gets success with the potential vaccine, it could lead to significant gains for the company. The company has also been working on developing other vaccines for health conditions such as the flu and the norovirus. VXRT’s stock has witnessed a stellar rise of more than 3000% year to date. This performance can largely be attributed to the company’s potential for developing a vaccine for COVID-19. The earnings surprise history for VXRT also looks pretty good, as the company beat or matched the consensus EPS estimates in three of the trailing four quarters. The sales growth of the company for the quarter ended in June 2020 is expected to be significantly higher compared to the same period last year. Trillium Therapeutics, Inc. (TRIL) TRIL focuses on therapies for the treatment of cancer. The company is in the process of developing a CD47 inhibitor through a monoclonal antibody drug for the treatment of blood cancer. If successful, this could lead to significant upside for the stock. The company’s other lead drug candidate is the TT1-622 which targets lymphoma and myeloma. TRIL’s stock has delivered a phenomenal performance and has risen by more than 600% in the year so far. The stock’s growth can largely be attributed to its drug pipeline and the recent acquisition of a similar company called ‘Forty-Seven’ by Gilead Sciences in a buyout worth $4.9 billion. For the quarter ended March 2020, the company had working capital of around $115 million, significantly higher than $9.8 a year ago. This upsurge in working capital could help the company achieve its drug development goals with less financial constraints. Want More Great Investing Ideas? 9 “BUY THE DIP” Growth Stocks for 2020 How HIGH Can This Tech Bubble Fly? 7 “Safe-Haven” Dividend Stocks for Turbulent Times AKBA shares were trading at $12.07 per share on Thursday afternoon, up $0.31 (+2.64%). Year-to-date, AKBA has gained 90.98%, versus a 1.52% rise in the benchmark S&P 500 index during the same period."}]}