{"article": [{"url": "https://stocknews.com/news/hznp-tsla-synh-spyg-spyv-3-growth-stocks-with-strong-technicals/", "published": 1596629300.0, "headline": "3 Growth Stocks with STRONG Technicals", "body": "As stocks rallied from their March lows, growth stocks led the way. The S&P 500 Growth ETF (SPYG) is up 43.4% since April, compared with the S&P 500 Value ETF’s (SPYV) gain of 23.7%. Technology and healthcare stocks have primarily driven growth. Technology companies have paved the way for society’s full embrace of the digital world, and healthcare companies have seen a demand for COVID-related therapies in addition to the long-term need for treatment and medicine to combat critical diseases. Growth stocks are companies that are expected to grow significantly above the average growth rate of the market. I like to look at both revenue and earnings growth to getter a better idea of a company’s prospects. I consider a growth stock to be one that has a growth stock rate above 25% for earnings and revenue over different time frame of one to five years. I also like to consider technical aspects of stocks to make sure they are in a bullish trend. One technical indicator I like to consider is On Balance Volume (OBV). OBV uses volume flow to predict changes in stock price. It was developed by Joseph Granville who believed volume was the main force behind markets, and OBV would predict market moves based on volume changes. 9 \"BUY THE DIP\" Growth Stocks For 2020Another technical indicator I like to use is MACD, which is the Moving Average Convergence/Divergence. This indicator is a trend-following indicator that shows the relationship between two moving averages of a stock’s price. It is calculated by subtracting the 26 Day Exponential Moving Average (EMA) from the 12 Day average. The signal line is a 9-day EMA of the differential line. A buy signal occurs when the MACD crosses above the signal line. Using my parameters, here are three growth stocks showing strong price action: Horizon Therapeutics (HZNP), Tesla (TSLA), and Syneos Health (SYNH). Horizon Therapeutics (HZNP) HZNP is a specialty and generic drug manufacturing company. The company is focused on researching, developing, and commercializing medicines that address critical needs for people with rare and rheumatic diseases. It markets drugs in the areas of inflammation, orphan diseases, and rheumatology. The company has a 24.2% five-year growth rate in revenues. It also has an EPS change of 502.1% over the last year. The company reported earnings this morning with record second-quarter results. It increased its full-year 2020 net sales and adjusted EBITDA based on the continued strength of its thyroid eye disease drug, TEPEZZA. HZNP had net sales of $462.8 million for the quarter, which was an increase of 44 Percent. The stock is up almost 20% today due to the news. The company has also recently received FDA approval for Procysbi, a delayed-release oral medicine for adults and children with nephropathic cystinosis. If you look at the chart below, you can see HZNP stock is showing bullish On Balance Volume, and its MACD is above the 9-day signal line. The company is also above its 10 Day, 21 Day, 50 Day and 200 Day moving averages. Courtesy of StockCharts.com HZNP is rated a Strong Buy in our POWR Ratings system. It holds grades of A for every possible POWR Rating Score. It is also the #8 ranked stock in the Medical-Pharmaceutical industry. Tesla (TSLA) TSLA needs no introduction. The company, which aims to covert the world to electric mobility, is a strong growth stock. TSLA has a five-year revenue growth rate of 47.3%, with a sales estimate of 37.9% for next year. Its earnings per share (EPS) is estimated to grow 79.2% over the next year and 416.1% over the next five years. On July 22, the company reported EPS of $2.18 compared with the consensus estimate of -$2.35. The company has a first-mover advantage in electric vehicles with long-range capacity and high-caliber technology and software. TSLS should benefit from booming demand for the Model 3, an increase in Model Y production, and considerable progress on its Shanghai Gigafactory. The company is investing heavily to boost production capacity, increase sales, and build Gigafactories. If you look at the chart below, you can see TSLA stock is showing bullish On Balance Volume. The stock is also above both its 50 Day and 200 Day Moving averages, a sign that the stock has a positive price trend. Courtesy of StockCharts.com Syneos Health (SYNH) SYNH is a global contract research and outsourced commercialization organization that provides services to pharmaceutical and biotechnology firms. The company’s clinical solutions unit offers early- to late-stage clinical trial support ranging from specialized staffing models to strategic partnerships that oversee almost all aspects of a drug program. SYNH’s commercialization solutions segment includes outsourced sales, consulting, public relations, and advertising services. The company has a five-year revenue growth average of 29.9% and an EPS 1-year growth rate of 1,056.3%. Its current year EPS estimate is 58.5%. Keep an eye out tomorrow morning as the stock reports earnings before the market opens. The company has been building its end-to-end market position by constantly expanding and innovating its Syneos One product. SYNH should benefit from a diversified portfolio of clinical and commercial initiatives and continued customer interest in its offerings inspire. If you look at the chart below, you can see SYNH stock is showing bullish On Balance Volume and bullish MACD. The MACD line is above the 9-day signal line. The stock is also above its 10 Day, 21 Day, 50 Day and 200 Day Moving average. Courtesy of StockCharts.com SYNH is rated a Buy in our exclusive POWR Ratings system. It holds a grade of A in the short-term Trade Grade, and a grade of B in Buy & Hold Grade. The stock is the #20 ranked stock in the Medical – Diagnostics/Research industry. Want More Great Investing Ideas? 9 “BUY THE DIP” Growth Stocks for 2020 How to Trade THIS Stock Bubble? 7 “Safe-Haven” Dividend Stocks for Turbulent Times HZNP shares were trading at $74.59 per share on Wednesday afternoon, up $12.80 (+20.72%). Year-to-date, HZNP has gained 106.05%, versus a 4.22% rise in the benchmark S&P 500 index during the same period."}]}