{"article": [{"url": "https://stocknews.com/news/gdrx-wmt-cvs-wba-should-investors-buy-the-goodrx-ipo/", "published": 1600862900.0, "headline": "Should Investors Buy the GoodRx IPO?", "body": "GoodRx (GDRX) was started to help lower prescription medicine costs for consumers. Since its inception in 2011, it’s achieved remarkable growth and has been a major disrupter in the prescription marketplace. GDRX is achieving its mission by creating a platform for prescription price comparison and negotiating with pharmacy benefits managers (PBM) to receive cost-savings for its users. The company claims that it’s successfully lowered the cost of generics by as much as 70% for many drugs, and many medications are cheaper through its platform than through insurance plans. 7 \"SAFE HAVEN\" Dividend Stocks for Turbulent TimesAccording to its S-1, GDRX helped its users save an aggregate of $5 billion in 2019 and $20 billion in total. It’s also the number 1 most downloaded medical app. Currently, it has 17 million unique monthly users and 4.5 million monthly, repeat users. Many of its users wouldn’t be able to afford medication if it wasn’t for GoodRx. (GoodRx S-1) More than 325,000 healthcare providers refer their patients to GoodRx. All major pharmacies accept GoodRx coupons including Walmart (WMT), CVS (CVS), and Walgreens Boots Alliance (WBA). GoodRx has significant upside given its success in creating a profitable product and increasing traction. However, it’s impossible to project its path or trajectory given the many, new products or services it will be able to create for its users. GoodRx’s Business Model GoodRx has a simple but brilliant business model. It makes money by helping people find the cheapest prescription medicine. It does this by aggregating pharmacy coupons based on a user’s location and helping patients compare prices at different pharmacies. Through this, it’s grown its user base to 4.4 million users. The rising costs and increasing complication of healthcare and prescription medicine is a major challenge for individuals and the country. One inefficiency is the lack of price transparency which makes it difficult for patients to shop around whether for procedures or prescriptions. GDRX’s business is attempting to solve one piece of this puzzle. When customers use GoodRx coupons, GDRX gets a cut of each transaction from pharmacy benefit managers. Healthcare professionals also recommend the service to their patients to help them find cheaper drugs. Doctors can improve patients’ health outcomes by making sure patients can access and adhere to their prescriptions. GoodRx also has a platform and is onboarding healthcare professionals. Providing coupons and information about drug pricing is its major source of revenue, however, GDRX is working on developing new revenue sources. One is advertising due to a large number of users using its app and the information they provide. GoodRx also sells a subscription-based discount card called GoodRx Gold for deeper discounts for patients with multiple prescriptions. It has also launched a telemedicine platform that could overtake its price tools as the company’s future growth engine. Through this, the company allows consumers to pay $20 for a same day telemedicine appointment. Given its large and growing user base, it will have a number of different ways to expand. In addition to this compelling business model, investors should consider buying GDRX’s stock due to its strong financial position, massive and expanding total addressable market, low-costs and high-margins, and network effects. GoodRx’s Financials GDRX is different from most IPOs since it’s profitable. It had $55 million in profit in the first half of 2020 which was a 75% increase from the same period in 2019. Revenue in the first half of $256.7 million was a 33% increase from 2019’s $173.2 million. It has also significantly grown from $99 million in 2016. It also has high operating margins at 36%. The company is expected to raise $570 million at a valuation of $10 billion. In its last fundraising round in 2018, GDRX was valued at $2.5 billion. GDRX’s IPO is going to give it more resources that will make its flywheel grow bigger and turn faster. It will be able to use its proceeds to grow its user base. A large user base means more revenue and more opportunities to develop new products and services. Expanding Opportunity In addition to GDRX’s strong financial position, the company is in a growing market, since healthcare spending and costs continue to rise at a pace 2-3x above GDP every year. While healthcare costs have spiraled higher, wages have stagnated which creates more demand for the cost-savings that GDRX delivers. Currently, GDRX estimates that its total addressable market is $800 billion. It breaks this down by $525 billion in Prescription Care, $30 billion in pharmaceutical manufacturing solutions, and $250 billion in telehealth. Low-Cost, High-Margin Business with Durable Advantages In addition to GDRX’s impressive growth rate, its core business has low costs and high margins. For example in 2019, the company’s cost of revenue was $27 million which compares favorably against $388 million in revenue. GDRX’s major expenses are building out its telehealth platform and growing its user base. Both are integral to the company’s future growth and will translate into future revenue. The business also has a strong moat, since any new company wouldn’t have any users or relationships with PBMs. Therefore, they wouldn’t be able to negotiate discounts. On its own, this is a profitable and growing business, but it’s also helping to build GoodRx’s next business – a platform for patients and health professionals which has the potential to be another eight-figure business given the valuations of other, telehealth platforms. Network Effects GDRX is another business that benefits due to network effects. As the platform gets more users who are looking for cost-savings, it will have more leverage in negotiation with PBMs and get better deals. The better deals, in turn, attract more users. These types of businesses have done really well in the stock market. For example, social media stocks have been among the leaders from the rally starting in March. They also become more valuable and useful as the network gets bigger. While social media companies are mainly consumer-facing apps that sell advertising, GDRX has the opportunity to sell much higher value-added products and services that are more lucrative. Conclusion With most growth stocks you get an exciting business that is years away from being profitable. You’re buying a story as much as a stock. With GDRX you get a profitable and fast-growing business, but there’s also the long-term upside of its platform growth. This makes the stocks uniquely attractive as a profitable, growth stock with the potential for long-term outperformance. For the company to achieve its potential, it must be successful to continue growing its user base and becoming more effective at monetization. This is likely to happen given the trend in other platform-based companies that have figured out how to monetize their users and a more lucrative market for GDRX since it’s healthcare-centric. Want More Great Investing Ideas? 7 Best ETFs for the NEXT Bull Market Is the Stock Market Correction Over? Chart of the Day- See the Stocks Ready to Breakout GDRX shares were trading at $328.95 per share on Wednesday morning, down $1.35 (-0.41%). Year-to-date, GDRX has gained 3.67%, versus a % rise in the benchmark S&P 500 index during the same period."}]}