{"article": [{"url": "https://stocknews.com/news/tsla-aapl-better-buy-tesla-vs-apple/", "published": 1599221300.0, "headline": "Better Buy: Tesla vs Apple", "body": "Two of the most popular stocks in the U.S. are Tesla (TSLA) and Apple (AAPL). Both have risen over 50% for the year, and both had stock splits last Friday. Both companies also have one more thing in common that separates them from others. They both have cult-like followings. Their customers are not just buyers of their products, they try to convert their friends by telling them how great and superior the products are. Take AAPL, for instance. Founder Steve Jobs was an almost messiah-like presence to the company’s followers. Each product announcement was like a ceremony. His staged presentations were legendary and made Apple fans go crazy in anticipation of the next iPhone release. People waited hours in line for the Apple store to open to get their hands on the latest iPhone. TSLA is similar. The company has a charismatic leader in Elon Musk, who has a 38.5 million following on Twitter (TWTR). Musk may even command more attention than Jobs. 7 Best ETFs for the NEXT Bull MarketBoth companies are selling more than products. AAPL is selling beautifully designed hardware that come with a sense of community for people that stay connected with AAPL devices. And TSLA is selling you comfort, safety, and a future with a cleaner environment. Both companies are loved by fans and investors, but which one is a better stock to Buy? To answer that, I’ll cover their business models and prospects and then run the numbers based on my favorite investing factors such as momentum, valuation, growth, profitability, and financial health. Tesla (TSLA) Let’s start with the positives. TSLA has acquired a substantial market share in the electric vehicle market. The company is seeing a rising number of Model 3 sales, which represents a sizable percentage of the company’s overall deliveries. This is helping to drive revenue. In 2019, TSLA delivered 367,500 vehicles, which was a 50% increase, year over year. For 2020, the company maintains a target of over 500,000 deliveries. As long as TSLA makes good on its promise to keep ramping up deliveries, this should bode well for the long-term. The company should also see a boost from the Model Y. In addition, production at the new Gigafactory in Shanghai should help boost future growth, as China has the biggest electric vehicle market. While these numbers are impressive, we must also consider some of the company’s negatives. TSLA has high research and development (R&D) and selling, general, and administrative (SG&A) costs. Both of these costs increased from 2015 to 2018. While the company currently has a positive gross margin, this trend needs to continue. High capital spending is also of concern as it is hurting the company’s cash flows. TSLA’s capital expenses in the second quarter increased both on a year over year basis from the previous quarter. This is expected to continue, which doesn’t bode well for future cash flows and profits. The company is also experiencing a decline in demand for its Model S and Model X. If we look at the TSLA’s metrics, the stock has had apparent strong momentum over both the short and long term. The company has had strong revenue growth, with a five-year growth average of 47.3%. The company’s revenue is expected to grow by 38.5% next year. TSLA is in decent financial health with a free cash flow to net income ratio of 217.2% and a current ratio of 1.3. Its profitability numbers are not great, with a return on equity of 3.7 and a return on invested capital (ROIC) of 4.3%. Valuation is where things look terrible. The stock has a current trailing P/E of 1,083.73 and a free cash flow yield of only 0.2%. TSLA is poised to be the dominant electric car company and leading autonomous vehicle manufacturer in the world. But this may take a decade to come to fruition. Musk wants his cars to be affordable for every person who wants one, but that is not possible now due to even the most affordable Tesla’s price. While TLSA is growing its production capacity, it will need to create many more assembly plants for its cars to be affordable. This type of expansion will cost billions in R&D and SG&A costs. So, investing in TSLA right now is not only risky due to its sky-high valuations, but it may take decades for its plans to come into fruition. Apple (AAPL) There are many reasons to consider buying AAPL. While the iPhone is the company’s flagship product, its Services and Wearables business drives revenue this year. The company already has more than 550 million paid subscribers across its Services business. The App Store attracts developers with popular apps from around the world. The company should reach 600 paid subscribers by the end of the year. Apple Music currently has more than 60 million paid subscribers. The service is now available on the Amazon (AMZN) Echo, which should help it compete with Spotify. The company has also moved into autonomous vehicles and augmented and virtual reality, which could be lucrative for AAPL. It also expects its fiscal fourth-quarter iPhone sales to benefit from strong demand for the iPhone SE. AAPL does have some risks that need to be considered. The company’s future is essentially tied to the iPhone. While it’s Wearable and Services segment is growing, its dependence on the iPhone is a risk to the firm’s future growth potential. AAPL has done well with competition from the Samsung Galaxy and the Google (GOOGL) Pixel, but it is now competing with Chinese OEMs priced much lower. There is also the problem that many of AAPL’s loyal fans are holding onto their phones longer due to the current recession and the perception that new phones are not worth the price of its new features. The company is also facing regulatory issues in Europe. The European Commission has opened two antitrust investigations into the App Store and its Apple Pay practices. There are concerns that the company’s business model hurts consumers by limiting choice and keeping prices high. AAPL’s numbers overall look better than TSLA. The stock has had strong momentum over the short and long term. The company has had stable earnings growth with a three-year growth average of 14.3%. The company’s earnings are expected to grow by 19.4% next year. TSLA is in good financial health with free cash flow to net income ratio of 122.7% and a current ratio of 1.5. AAPL sets itself apart from TLSA in its profitability metrics. It has a return on equity of 80.8% and an ROIC of 29.4%. I would consider the stock overvalued with a P/E of 36.7 and a free cash flow yield 3.3%, but nowhere near the level of TSLA. AAPL is rated a Buy by our POWR Ratings system. It has a grade of A in Trade Grade and Peer Grade, two of the components in the POWR Ratings system. Its is also the #4 ranked stock in the Technology – Hardware industry. The company remains in a strong position with the upcoming 5G iPhone and the increase in sales for its Mac and iPads due to the work-from-home and learn-from-home trends. The most important thing to consider when comparing AAPL to TSLA is that while the iPhone is expensive at approximately $1,000, it is still considerably more affordable than a Tesla vehicle. Although fewer people are upgrading their phones, and the company’s stock is above fair value, AAPL is still strong in generating sales on future phone releases, computers, and tablets. Plus, its Services segment is providing additional cash flow for the company. Overall, I see AAPL as a much better Buy than TSLA. Want More Great Investing Ideas? 7 Best ETFs for the NEXT Bull Market Beware Stocks in September? 9 “BUY THE DIP” Growth Stocks for 2020"}]}