{"article": [{"url": "https://stocknews.com/news/pg-kmb-cl-3-consumer-good-stock-expected-to-outperform/", "published": 1593605300.0, "headline": "3 Consumer Goods Stock Expected to Outperform", "body": "While the coronavirus has resulted in job losses and pay cuts for millions of Americans, consumer goods spending has remained resilient. The sector has also been a haven for investors, and this is reflected in their charts. The demand for food, household, and personal care products is income inelastic. This means that even though overall spending has declined, demand for consumer goods has remained stable. Contrast this with discretionary spending, which has taken a bigger hit. As a result, companies in the consumer goods sector are likely to weather this storm better than most stocks. Expect this to continue. 9 \"BUY THE DIP\" Growth Stocks For 2020Here are some of the best consumer goods stocks: Procter & Gamble Co. (PG) PG needs no introduction. It has a market cap of $302 billion with $70.5 billion in sales. Due to its strong balance sheet, above-average dividend, and well-known brands, its stock has thrived during this period of uncertainty. On top of these stellar returns, PG has been less volatile than 99.5% of stocks. PG is currently in the middle of rethinking its approach to the market to appeal to a younger generation. PG has been concerned about its ability to continue growing market share, especially with the growth in direct-to-consumer brands and generic categories. With this approach, the company is ensuring that it can defend its market share. The stock is currently trading at $119.57. The average price target for PG is $134.44, which indicates an upside of 12.4%. Its POWR Ratings are consistent with its strong brand and stock with a “Strong Buy” rating. It’s graded an “A” in Trade Grade, Buy & Hold Grade, and Industry Rank. It has a “B” in Peer Grade. Among the Consumer Goods sector, it’s ranked #1 out of 33 stocks. Colgate-Palmolive Co. (CL) Colgate-Palmolive has been a mainstay in the consumer goods sector for generations. This is another steady stock that is expected to offer decent returns shortly. It’s the ideal stock for a low-growth environment where interest rates are expected to stay low. This means the company’s revenues will continue to increase, but its dividend will remain attractive. Given its strong balance sheet, the company will be able to take advantage of lower rates as well through stock buybacks. Like PG, CL is a low-volatility stock with plenty of upsides. CL’s volatility is higher than just 0.41% of US stocks. This is a good indicator of the stock’s resilience during periods of market volatility. CL has returned 7.7% YTD which is impressive considering it’s outperforming the S&P 500 (SPY) with lower volatility. Looking ahead, the average analyst price target for CL is $74, with the most optimistic target being $88. Kimberly Clark Corp. (KMB) KMB makes several products that you might regularly use Cottonelle, Scott, Wypall, KimWipes, and Huggies diapers. Demand for these products is consistent regardless of economic conditions. This makes KMB is another strong stock that will likely be a good bet for the short and long-term. Historically, KMB is less volatile than 99.7% of US stocks due to its recession-proof model. KMB is a steady performer. It pays out a 3% dividend which is particularly attractive in today’s zero percent interest rate environment. The stock has an average analysts’ price target of $147.17, which indicates an upside of 4.12%. KMB holds an overall POWR Ratings of “Strong Buy” with an “A” for Trade Grade, Buy & Hold Grade, and Industry Rank. It has a “B” in Peer Grade, and it’s the #3 out of 33 stocks in the Consumer Goods sector. Want More Great Investing Ideas? 9 “BUY THE DIP” Growth Stocks for 2020 Is the Bull S#*t Rally FINALLY Over? 7 “Safe-Haven” Dividend Stocks for Turbulent Times Top 3 Investing Strategies for 2020 PG shares were unchanged in after-hours trading Wednesday. Year-to-date, PG has declined -2.72%, versus a -2.53% rise in the benchmark S&P 500 index during the same period."}]}