{"article": [{"url": "https://stocknews.com/news/cmg-dpz-wing-pzza-4-mouth-watering-restaurant-stocks-to-buy-now/", "published": 1594210100.0, "headline": "4 Mouth-Watering Restaurant Stocks to Buy Now", "body": "The Coronavirus pandemic has wreaked havoc on the restaurant industry. Lockdowns and social distancing practices have become the norm in most economies which wiped out dine-in sales. Despite this tough environment, many restaurants continue to grow. The weakness in the industry is apparent from the underperformance of the S&P 500 Food and Beverage Index. The index bounced higher from its March lows, however, since mid-April, it’s mostly trended sideways in a tight range. In contrast, most stocks are significantly higher from these levels. This is a reflection that this sector continues to face a tough environment due to its struggles to reopen and consumers cutting back on discretionary spending. So, it’s particularly impressive that some restaurant stocks continue to grow even during these brutal conditions. The following four stocks are thriving – Chipotle Mexican Grill; Domino’s Pizza; Wingstop; and Papa John’s. 7 \"SAFE HAVEN\" Dividend Stocks for Turbulent TimesIf the economy can begin to reopen, they should see a big rebound due to the return of in-person dining and social occasions. However, the unfortunate reality is that if the economy stays shut for longer, it’s going to cause many family restaurants and chain restaurants with weak balance sheets to permanently shut down which would lead to greater gains in market share over the long-term. Chipotle Mexican Grill (CMG) CMG recently added Grubhub as a new delivery partner. The company also works with DoorDash and UberEats. This should strengthen its business and attract more customers. CMG’s drive-through system “Chipotlanes” has been implemented in new locations to encourage takeout orders and abide by social distancing practices. Currently, the rewards program on the Chipotle app has over 11.5 million members. This is a testament to CMG’s ability to adapt. CMG’s strong position is apparent in that it is increasing its number of stores and its sales per location. It expects to grow its earnings by over 100% next year. It has very strong gross margins for a restaurant stock with 28%. Fifteen out of twenty-eight Wall Street Analysts have a “buy” rating on the stock. CMG has returned 48.8% over the past year, 43.9% over the past three months, and 32.5% year to date with an impressive return on equity of 23.90%. How does CMG stack up for the POWR Ratings? A for Trade Grade A for Buy & Hold Grade A for Peer Grade C for Industry Rank A for overall POWR Ratings It ranks #1 out of 48 in the Restaurant industry. Domino’s Pizza Inc. (DPZ) One mind-boggling market stat is that Domino’s Pizza and Google (GOOG) both IPO’d during the summer of 2004. Since then, DPZ has outperformed GOOG with a 5,250% gain against GOOG’s 3,000%. DPZ has kept innovating in all facets of operations and created a product that is popular all around the world. For this time, it has introduced a car-side delivery service where the order is delivered directly to the customer in their car. DPZ also initiated a new contact-less carryout option for online orders. The average analyst price for DPZ is $396.18 which is 4% above the current price. DPZ has returned 37.4% over the past year and 30.3% year to date. For the past two months, the stock has been consolidating at new, all-time highs between $360 and $390 and looks poised for an upside breakout. DPZ has a Strong Buy rating in our POWR Ratings. It has an “A” for Trade Grade, Buy & Hold Grade, and Peer Grade. The stock ranks #2 out of 48 stocks in the Restaurant industry. Wingstop Inc. (WING) Approximately 80% of WING’s sales were from delivery and takeout orders before Covid-19 hit the United States, so it was well-positioned to survive. WING has seamlessly been able to adapt to 100% takeout. It already had the infrastructure in place to handle delivery and takeout of their vast selection of chicken wings. WING just opened its first ghost kitchen in Dallas and aims to digitize 100% of its orders. A ghost kitchen is a professional food preparation and cooking facility set up to prepare delivery-only meals. Nine out of thirteen Wall Street analysts have a “buy” rating for the stock. WING has tripled since its March lows. Since its IPO in 2015, it’s been on a consistent trajectory of higher highs and higher lows. WING has a Strong Buy rating in POWR Ratings. It has an “A” in all POWR components except Industry Rank. The stock ranks #3 out of 48 stocks in the Restaurant industry. Papa John’s International, Inc. (PZZA) Between 2016 and 2018, PZZA’s stock was down as much as 40%. This followed nearly a decade of the stock being one of the best performers on Wall Street as it was adding locations all over the country. The company’s stock floundered as there was controversy around its CEO, and its sales growth was slowing. However, a combination of moves stopped the bleeding – an overhaul of management; Shaquille O’Neal came on as a board member, endorser, and invested in the company; and the company introduced new menu items. This led to a 50% rebound for the stock going into 2020. However, the company has been one of the major winners of the pandemic. Given that its entire business is carryout and delivery, it was unaffected by the shutdown. All of a sudden, it faced much less competition as many dining options were off the table. Over the past year, PZZA is 85.3% higher. Since the March low, it’s nearly tripled. In recent days, it’s breaking higher from a trading range. Given recent news of a spike in coronavirus cases and that dining in restaurants seems to spread the virus, PZZA’s outperformance is likely to continue. PZZA has a Strong Buy rating in our POWR Ratings. It has an “A” for Trade Grade, Buy & Hold Grade, and Peer Rank. Among restaurant stocks, it’s ranked #4 out of 48. Want More Great Investing Ideas? 9 “BUY THE DIP” Growth Stocks for 2020 Is the Bull S#*t Rally FINALLY Over? 7 “Safe-Haven” Dividend Stocks for Turbulent Times Top 3 Investing Strategies for 2020 CMG shares . Year-to-date, CMG has gained 33.13%, versus a -0.60% rise in the benchmark S&P 500 index during the same period."}]}