{"article": [{"url": "https://stocknews.com/news/f-gm-tsla-taking-a-look-under-the-hood-of-the-3-largest/", "published": 1594037300.0, "headline": "Taking a Look 'Under the Hood' of the 3 Largest US Automakers", "body": "Ford (F) Ford (F), one of the stocks in the S&P 500 Index, recently showcased the release of its new F150 pickup. Ford is touting new technology and features, such as automatic emergency braking on all models. The F150 is very important to the Ford brand, as it is not only the top-selling pickup in the U.S., but completely dominates the next two competitors. 7 Best ETFs for the NEXT Bull MarketIn Q1 2020, Ford sold over 186,000 F150s, versus Chevrolet pickups at close to 144,000 and Dodge Rams at almost 129,000. Chevrolet did gain ground in the first quarter. While Ford’s numbers were hit by the pandemic, with Q1 earnings coming in at $34 billion vs. $40.3 billion a year ago, the new F150 could add a boost to the company’s post-pandemic “reopening” numbers. U.S. News and World Report says the new Ford F150 “promises to be the most technically advanced and connected truck on the road.” The COVID-19 pandemic more than cut Ford’s stock in half, but it has since recovered to trade at $6. General Motors (GM) General Motors (GM), which reported earnings July 1, said its full-size pickup sales were resilient in Q2. Overall vehicle sales were severely impacted by the COVID-19 crisis, with sales off by 34%. But, with demand outstripping supply late in the quarter, “full-size pickup truck sales performed exceptionally well, and overall sales showed signs of recovery, especially deliveries to retail customers.” GM also noted in its earnings release that low-interest rates are driving sales as the economy reopens. The challenge the company is facing now is in getting automobiles to dealers quickly in order to restock diminishing inventory. Tesla (TSLA) And finally, I’d be remiss if I wrote about automakers and didn’t mention the recent rise in Tesla (TSLA). Tesla stock has simply been on fire since late in 2019. The stock came down with the market in March, but went straight back up from $350 to now trade at over $1,100. Tesla fits many growing trends right now: a move toward “green” investing, a hatred—for lack of a better word—of fossil fuels, and an increasingly affluent millennial base that prefers electric. Not to mention the mystique of the Tesla brand (and its affinity with SpaceX), which, like it or not, goes hand-in-hand with the bad boy reputation of Mr. Elon Musk. Unlike the other car companies, Tesla revenue actually rose year-over-year in Q1, despite the pandemic. Quarterly revenue was $5.9 billion versus $4.5 billion one year ago. While valuations may be stretched, that has not hindered current investors from betting the company grows into a higher valuation. Want more great investing ideas? Download free the “10-Step Options Trading Checklist” you need before making a trade. The Virtual Trading Pit Is Open: Trade Set-ups, Training, New Trading Ideas How to Try Out Options Without Risking a Penny F shares fell $0.02 (-0.32%) in after-hours trading Monday. Year-to-date, F has declined -32.31%, versus a -0.48% rise in the benchmark S&P 500 index during the same period."}]}