{"article": [{"url": "https://stocknews.com/news/coup-wst-ttd-3-small-cap-growth-stocks-to-invest-2500-into-right/", "published": 1594382900.0, "headline": "3 Small Cap Growth Stocks to Invest $2500 Into RIGHT NOW", "body": "Small-cap stocks are companies with market caps ranging between $300 million to $2 billion. As a whole, small-cap growth stocks, represented by the iShares Russell 2000 Growth ETF (IWO), have under performed the broader market, represented by the Vanguard Total Market ETF (VTI). That being said, if you pick the right small-cap stocks you can profit handsomely. The reason for that is because small cap stocks can earn money faster and grow faster than larger cap companies. This is great for your portfolio since there is more opportunity to make money in a shorter period of time. Plus, historically, small-cap stocks have higher long term average returns than large-cap stocks. They have also performed better than large-cap stocks during periods of economic recovery and strong market rallies. Here are three small-cap growth stocks growing fast. 7 \"SAFE HAVEN\" Dividend Stocks for Turbulent TimesWest Pharmaceutical Services (WST) WST is a major supplier of packaging components and distribution systems for injectable drugs and healthcare products. After dropping to a low of $129 at the end of March, the stock soared 78 percent as demand for drug delivery systems and injectable packaging grew following the Covid-19 pandemic. The company announced a strong first quarter with sales growth of 11 percent, while the company reaffirmed its guidance for 2020. The rally could extend further given the increase in demand for vaccines over the coming years, and the company is a dominant player in delivering vaccines. WST revenues have grown 29% percent from $1.4 billion in 2015 to $1.8 billion in 2019, while earnings have grown more rapidly from $1.33 to $3.27. The company also expects increased demand for its products, which should bode well for its stock. WST is one of the top-rated stocks in our momentum-based POWR Ratings system. Overall, it is the #5 ranked stock in the #9 ranked industry (Medical – Devices & Equipment) with a 54.65% return year to date Coupa Software (COUP) COUP provides a cloud-based business spend management platform. In tough times, companies are under pressure to curb their spending. That plays into the COUP’s strength. The company has a spending management platform that enables customers to track their spending more efficiently. It offers advanced analytics, AI-powered benchmarking of performance and AI-flagging of suspicious activity. Plus, it is cloud-based, which is currently the “big thing”. COUP has also been expanding its platform beyond cost tracking. For example, customers can now access Coupa Pay, a business-to-business payment solution. COUP can call some big-name companies as their customers, including Salesforce (CRM), Proctor & Gamble (PG), and Nvidia (NVDA). In March, COUP reported annual revenue of $389.7 million, which was up 50% year-over-year. Subscription revenue was up 48%. COUP is holding a poker hand with 5 Aces. By that, I mean that all 5 scores of our exclusive POWR Ratings system are an A for the stock. It is also the #6 ranked stock in the Software – Business industry. The Trade Desk (TTD) TTD operates a self-service cloud-based platform that allows buyers to create, manage, and optimize data-driven digital advertising campaigns. TTD is up 56% year-to-date, even amid the coronavirus, where consumers aren’t spending, and brands have decreased advertising. The company provides programmatic advertising solutions for advertisers. That means that it leverages data to allocate ad dollars across various digital advertising channels, which helps to optimize the effectiveness of the ads. Most advertising analysts believe that data-driven advertising is the future of ads. TTD blew away estimates in its latest earnings report. Analysts expected EPS of 0.09 a share, and TTD reported 0.5, which was a 455.56% surprise. The company also exceeded both profitability and revenue targets. TTD is widely considered a leader in data-driven advertising that still only represents a small fraction of the world’s $500 billion in ad spending. This should provide plenty of room for growth for the company. Want More Great Investing Ideas? 9 “BUY THE DIP” Growth Stocks for 2020 Is the Bull S#*t Rally FINALLY Over? 7 “Safe-Haven” Dividend Stocks for Turbulent Times Top 3 Investing Strategies for 2020 COUP shares were unchanged in after-hours trading Friday. Year-to-date, COUP has gained 110.79%, versus a -0.31% rise in the benchmark S&P 500 index during the same period."}]}