{"article": [{"url": "https://stocknews.com/news/spy-the-greatest-stock-market-rally-of-all-time-3-things/", "published": 1598443700.0, "headline": "The Greatest Stock Market Rally of All Time: 3 Things Investors Need to Know", "body": "Stocks continue their red hot ride higher, defying weak economic fundamentals fueled by a combination of TINA and FOMO sentiment. The S&P 500 is up 54% since the March 23rd lows, the Dow about the same, but the tech-heavy Nasdaq has truly been on fire, up a scorching 66%. Naturally, some investors are starting to get nervous and wonder how long the party can last when stocks are so red hot. 7 Best ETFs for the NEXT Bull MarketWell, there is good news on that front. UBS just put out a report explaining why it thinks stocks are likely to go up 3% in the next year, but could plausibly go up three times as much. In this two-part series, I’ll explain not only why UBS is historically likely to be proven correct, but the smartest ways for investors to profit from the single greatest bear market recovery rally in US history. Why UBS Thinks Stocks Could Go Up Another 9% From Here UBS is the world’s largest asset manager and so when one of its chief analysts puts out a note it’s well worth listening. Here is what Mark Haefele, the Chief Investment Officer at UBS recently told his clients in a note. When stocks rally as rapidly as they have through the second and third quarters, Treasury yields usually jump. Investors shift more cash into stocks and risk assets and pull capital from safe havens like government debt, in turn boosting yields. Yet Treasurys sit at historic lows while economic data improves and stocks touch new records. The shift arrived in June when Fed Chair Jerome Powell said at the month’s Federal Open Market Committee meeting that the central bank was “not even thinking about thinking about raising rates.” The statement is “perhaps the moment investor expectations really changed,” Haefele said in a letter. Yields disconnected from stocks and trended downward. Apart from a mild gain in August, they’ve steadily declined through the summer. The market phenomenon is here to stay for at least a few years. Fed officials said in a previous meeting they anticipate rates remaining near zero through 2022. Hawkish policies are “still a very long way off,” Haefele said. In turn, market participants should prepare for, and take advantage of, the new zeitgeist. “Investors now face a stark choice,” the investment chief said. They can either hold on to precedent and view the bond market’s pricing as a harbinger for a stock market correction, or believe markets are now “more heavily influenced by Fed policy” and pile in accordingly. “If you, like us, believe that the latter currently reflects reality better than the former, your focus needs to shift to what the Fed is saying, and the way you think about asset prices needs to shift with it,” Haefele said.” – Market Insider How high does Haefele think stocks could go? The firm holds a base case S&P 500 target of 3,500, implying a roughly 3% gain from Friday’s levels through June 2021. Such a jump would already place the benchmark index at record highs, but Haefele’s more bullish scenario sees the potential for additional gains should certain criteria be met. First, the index’s equity risk premium — how much more investors make in stocks over a risk-free investment — needs to shrink to the pre-pandemic five-year average of 3.8%, the chief investment officer said. Assuming the 10-year Treasury yield only gains to 0.85%, the S&P 500 can continue to trade at a forward price-earnings ratio of 22x. That premium would push the index to 3,700 by June, or about 9% higher, according to Haefele. So far, it seems as though UBS’s more optimistic forecast will come to fruition. Economic data released through the end of summer show consumer spending and sentiments slowing their pace of recovery amid a resurgence of virus cases. Congress has made little progress on a second stimulus bill, and numerous economists fear a lack of fresh aid will prolong the already steep recession.” – Market Insider. So basically UBS is arguing that the recent bad economic and stimulus gridlock news is good news because it means the Fed is likely to remain dovish for longer. Isn’t it a bit speculative to say stocks can keep rallying almost 10% more from here, on what is effectively bad economic news? That it is, but there are two bits of additional data that support UBS’s notion of a 3,700 S&P 500 by June 2021. 2 Things Are on the Side of the Bulls In order for UBS to be correct, don’t 10-year yields have to remain at historically low levels, specifically 3.85% or lower? Take a look at the Congressional Budget Office’s latest long-term economic forecast: The CBO estimates that the 10-year treasury yield will finish not just 2020 at 0.9% but remain at that level even at the end of 2021. Ok, but that’s just interest rates, and while the market rally has largely been driven by a sense of TINA, or “there is no alternative” to stocks (which is the heart of UBS’s thesis) is there some other potential catalyst that could actually drive a nearly 10% rally from these already loft valuations? Indeed there is a sense of FOMO or fear of missing out. Here is some interesting historical market data courtesy of Lipper Financial. In the 19 historical 100-day, post-correction rallies since 1950 just one have seen stocks fall in the following 12 months, back in 1987. 94% of the time stocks have gone up in the following 12 months, an average and median of 9.4%, pretty much exactly what UBS is expecting. In addition, the historical annual return since 1871 for the S&P is 9.2% CAGR, further giving some historical credence to UBS’s otherwise speculative call. (Source: imgflip) On Wall Street, there are no guarantees, only probabilities. While history and momentum are firmly on the side of the bulls, there are plenty of risk factors that could derail the greatest bear market recovery rally in US history. In part two of this article, I’ll explain the good news and bad news about the likely coming market rally. Most importantly, I’ll explain how you can both personally maximize your profits while minimizing the risk of catastrophic losses if UBS and all the other optimistic analysts in recent weeks turn out to be wrong. Want More Great Investing Ideas? The Best of StockNews 2 Step Process to Sell @ Market Top in September 9 “BUY THE DIP” Growth Stocks for 2020 SPY shares were trading at $345.40 per share on Wednesday morning, up $1.28 (+0.37%). Year-to-date, SPY has gained 8.42%, versus a % rise in the benchmark S&P 500 index during the same period."}]}