{"article": [{"url": "https://stocknews.com/news/slv-paas-wpm-svm-hl-4-silver-mining-stocks-that-pay-a-dividend/", "published": 1597147700.0, "headline": "4 Silver Mining Stocks That PAY a DIVIDEND", "body": "Silver has been one of the biggest winners, since the market bottomed in March. The major catalysts have been the Fed’s unprecedented interventions, fiscal stimulus, and the weak economy which means that low-interest rates and high deficits will be here for a while. From its March lows, the iShares Silver Trust (SLV) is up 117%. Over the last couple of days, precious metals have given back some of these gains due to Treasury yields rising on increasing optimism that a vaccine will be developed and declining case counts. From recent highs, GLD is down by 7%, while SLV is off about 14%. 7 \"SAFE HAVEN\" Dividend Stocks for Turbulent TimesHowever, the positive fundamentals for precious metals are intact. Congress not coming to an agreement means that the Fed will get even more aggressive, and the economy will be softer. These factors will translate into lower interest rates which will be positive for the metal. However, even in bull markets, there can be vicious corrections. Dividend-paying silver stocks are one way that investors can gain exposure to the sector, while locking in an above-average income stream to reduce risk. Silver miners such as Hecla Mining Company (HL), Silvercorp Metals, Inc. (SVM), Wheaton Precious Metals Corp. (WPM) and Pan American Silver Corp. (PAAS) that pay dividends will not only help you generate a steady income but also realize significant capital appreciation. Hecla Mining Company (HL) HL discovers, acquires, develops, and produces precious and base metals. The company offers lead, zinc, and carbon materials to custom smelters, metal traders, and third-party processors. It also offers unrefined gold and silver bullion bars to precious metals traders. It has mining units across the United States, Canada, and Mexico. HL recently expanded its business operations in Canada by acquiring a 10.7% stake in Dolly Varden Silver Corporation through its wholly-owned subsidiary. Though the pandemic forced the mining industry to cease operations during the lockdown, the demand for precious metals has been rising in the international markets amid the ongoing global uncertainty. As a premier mining corporation, HL has benefited from this scenario, as its gross profits increased 230% in the first quarter alone. It restarted operations in all five of its mines after a mandatory 4-week lockdown and produced over 2.70 million ounces of silver and 13,104 ounces of gold. HL’s revenues of $166.40 million for the second quarter ended June 2020 increased 24% year-over-year. Its quarterly gross profit of $34.10 million also increased from the year-ago value. HL also reported a positive cash flow balance of $3.75 million, which is a $4.88 million increase from its negative cash flows of $1.11 million in the second quarter of 2019. HL’s annual dividend of $0.01 per share yields 0.16% on its current price. It has been consistently paying dividends every quarter for the last seven years. The consensus revenue estimate of $176.45 million for the third quarter indicates a year-over-year rise of 9.2%. HL gained 375% to hit its 52-week high of $6.79 since hitting its year-to-date low of $1.40 in March. How does HL stack up for POWR Ratings? A for Trade Grade B for Buy & Hold Grade A for Peer Grade A for Overall POWR Rating You can’t ask for better. HL is also ranked #1 out of 16 in the Miners – Diversified industry. Silvercorp Metals, Inc. (SVM) Headquartered in Canada, SVM engages in the acquisition, exploration, development, and mining of mineral properties in China. The company primarily explores for silver, gold, lead, and zinc. In the first quarter of fiscal 2021, SVM produced approximately 1.80 million ounces of silver, 20.10 million pounds of lead, and 7.50 million pounds of zinc. Lead and zinc production increased by 1% and 4% year-over-year, respectively. SVM aims to produce 6.20-6.50 million ounces of silver, 66.10-68.50 million pounds of lead, and 24.50–26.70 million pounds of zinc in fiscal 2021. SVM’s revenue for the first quarter increased 2% year-over-year to $46.70 million. Its cash flow from operations of $30.10 million indicates a 51.2% improvement from its year-ago number. This strong cash flow balance can help the company sustain its dividend payouts in the future. SVM pays an annual dividend of $0.03, which yields 0.37% based on its current price. Its dividend has grown 25.3% annually over the last four years. SVM gained more than 410% since hitting its 52-week low of $1.50 on March 16th. It’s no surprise that SVM is rated “Strong Buy” in our POWR Ratings system. It has an “A” in Trade Grade, Buy & Hold Grade, Peer Grade, and Industry Rank. Out of 11 stocks in the Miners- Silver industry, SVM is ranked #5. Wheaton Precious Metals Corp. (WPM) WPM is a mining company that sells gold, silver, and palladium ores across Canada and globally. It operates through metal streaming agreements with 20 mines and 9 development stage projects. On June 22nd, WPM’s wholly-owned subsidiary Wheaton Precious metals International Ltd. (WPMI) entered into a Precious Metals Purchase agreement with Caldas Gold Corp for $110 million. In exchange for the cash, WPMI has gained access to 6.5% of the gold production up to 19,000 ounces, and 100% of the silver production up to 2.15 million ounces at Marmato Project, Colombia. Upon reaching the predetermined limit, WPMI has lifetime access to 3.25% of the gold production and 50% of the silver production at the Marmato Project. WPM pays an annual dividend of $0.40, which yields 0.76% based on its current price. Its cash flow to a dividend ratio of 3.18 is better than 92.5% of other dividend-paying stocks in the Stocknews.com universe. WPM’s cash flow balance increased 50% year-over-year to $177 million in the first quarter. Such a strong cash balance ensures sustained dividend payouts for a prolonged period. The company increased its quarterly dividend payments by 11.1% in the first quarter ended March 2020 and has maintained that level in the second quarter as well, despite the effect of the pandemic on its business operations. The consensus EPS estimate of $0.19 for the second quarter ended June 2020 indicates a 90% increase year-over-year. The street revenue estimate of $222.70 million for the about-to-be-reported quarter indicates a 17.5% improvement from the year-ago number. WPM gained more than 210% to hit its 52-week high of $57.89 on August 5th since hitting its 52-week low of $18.66 in March. WPM is rated “Buy” in our POWR Ratings system, consistent with its sound business model. It has an “A” in Trade Grade and Industry Rank, and “B” in Buy & Hold Grade and Peer Grade. It is also ranked #1 out of 11 stocks in the Miners- Silver group. Pan American Silver Corp. (PAAS) PAAS is engaged in exploration, extraction, refining and manufacturing, and sale of precious and base metals such as gold, silver, zinc, copper, and lead. As of June 30th, PAAS had approximately 500 million ounces of silver and 5.20 million ounces of gold as proven and probable mineral reserves. Its measured and indicated mineral resource reserves contain 806 million ounces of silver and 9.40 million ounces of gold. On August 4th, PAAS revised its mineral resource extraction estimate from La Colorada skarn deposit, Mexico to 141 million ounces of silver, indicating a 38% increase from its previous extraction estimate. PAAS recently raised about $39.60 million through a secondary offering of 9 million common shares priced at $4.40 each. Despite the lower extraction capacity due to the ongoing pandemic, PAAS quarterly revenues came in at $249.5 million, due to high silver prices. Its net earnings increased by 4.9% quarter-over-quarter to $19.40 million. PAAS pays an annual dividend of $0.20 per share, which yields 0.55%, based on its current price. It increased its quarterly dividend payouts by 42.8% from $0.035 per share to $0.05 per share and has maintained it for 3 quarters, despite the slowdown of business activities due to the crisis. PAAS’s earnings surprise history is impressive, as the company beat consensus EPS estimates in three of the trailing four quarters. Its revenue estimate of $417.52 million for the upcoming quarter indicates an 18.6% improvement year-over-year. PAAS hit its 52-week low of $10.61 on March 16th due to the market crash. It gained more than 275% since then, hitting its 52-week high of $40.11 on August 6th. It’s no surprise that PAAS is rated “Buy” in our POWR Ratings system. It has an “A” in Trade Grade and Industry Rank, and “B” in Buy & Hold Grade and Peer Grade. It is currently ranked #2 in the 11- stocked Miners- Silver industry. Want More Great Investing Ideas? 9 “BUY THE DIP” Growth Stocks for 2020 How to Trade THIS Stock Bubble? 7 “Safe-Haven” Dividend Stocks for Turbulent Times SLV shares . Year-to-date, SLV has gained 39.87%, versus a 4.46% rise in the benchmark S&P 500 index during the same period."}]}