{"article": [{"url": "https://stocknews.com/news/amzn-baba-crm-3-cloud-computing-stocks-to-buy-right-now/", "published": 1599826100.0, "headline": "3 Cloud Computing Stocks to BUY Right Now!", "body": "The size of the global cloud computing market is expected to grow at a CAGR of 17.5% between 2020 to 2025. The shift to cloud computing is happening quicker than expected due to coronavirus. The company’s servers and applications are now hosted and executed on the cloud. The advent of remote working and learning has been a boon for cloud computing. Moving to the cloud results in lower costs and more flexibility for enterprises. The rising demand for cloud services means that the stocks of cloud companies should rise over the long-term. Stocks such as Amazon.com, Inc. (AMZN), Alibaba Group Holding Limited (BABA), and Salesforce.com, Inc. (CRM) are among the leaders in cloud computing. Investors should consider using the weakness in tech stocks as an opportunity to pick up some shares. 7 \"SAFE HAVEN\" Dividend Stocks for Turbulent TimesAmazon.com, Inc. (AMZN) Amazon has entered into the cloud computing market through its Amazon Web Services (AWS) offerings. AWS has established itself as a market leader in the cloud computing space. The company has recently started Amazon Braket within AWS as a way for customers to use and explore quantum computing. Amazon Braket can be especially useful for those working on technology-intensive areas such as cryptography and biochemistry. AMZN’s revenue from AWS rose by 29% during the second quarter of 2020. AMZN’s operating profit from AWS went up by 58% during the same period. AMZN has made an agreement with FactSet, a global integrated financial information provider, to allow FactSet to migrate its real-time ticker plant to AWS. AMZN’s stock has gained 71.8% year-to-date. The company’s revenue is expected to rise by 31.2% in the current year and 18% next year. AMZN’s EPS is estimated to grow 37.4% this year and 36.3% per annum over the next five years. How does AMZN stack up for the POWR Ratings? A for Trade Grade B for Buy & Hold Grade A for Peer Grade A for Industry Grade B for Overall POWR Rating You can’t ask for better. The stock is also ranked #1 out of 57 stocks on the Internet – Services industry. Alibaba Group Holding Limited (BABA) BABA is widely known as China’s Amazon. Apart from the company’s sprawling e-commerce business, BABA has significant exposure to the cloud computing space through Alibaba Cloud. Alibaba Cloud generated a revenue of $1.75 billion during the most recent quarter, which marked a rise of 59% year-over-year. Alibaba Cloud is expanding into the education sector through its Alibaba Cloud Academic Empowerment Programme which is designed to bring cloud computing technology to students and faculty members. In furtherance of the program, Alibaba Cloud has recently signed an MoU with Universiti Tunku Abdul Rahman (UTAR). Alibaba Cloud has also partnered with a range of SMEs in the design, delivery, online education, real estate spheres to digitize their operations and help them migrate to online platforms. BABA’s stock has returned 26.1% year-to-date. The company’s revenue is expected to rise by 35.3% in the current year and 25.6% next year. BABA’s EPS is estimated to grow 22.8% in the current year and 24.9% next year. BABA’s strong fundamentals are reflected in its POWR Ratings, it has a “Buy” rating with an “A” in Trade Grade and Peer Grade. Within the China industry, it’s ranked #6 out of 115 stocks. Salesforce.com, Inc. (CRM) CRM provides cloud computing solutions for enterprises with a specialty in customer relationship management. The company offers six core services which are customer service and support, sales force automation, marketing automation, analytics, community management, along with a cloud platform for developing applications. The company has recently acquired Mobify, a company that provides modern storefront solutions for delivering better shopping experiences. The company has also recently announced the integration of PandaDoc’s document automation software with Salesforce’s services allowing Salesforce administrators to have more efficient deal-management capabilities. CRM’s stock price has risen 52.4% so far this year. The company’s revenue is expected to grow 21.6% in the current year and 17.7% next year. CRM’s EPS is estimated to rise by 19.5% per annum over the next five years. It’s no surprise that CRM is rated a “Buy” in our POWR Ratings system, with a grade of “A” in Trade Grade and Peer Grade. In the 47-stock Software Business industry, it is ranked #1. Want More Great Investing Ideas? 7 Best ETFs for the NEXT Bull Market Will Stocks Fall into Historical September Slump? 9 “BUY THE DIP” Growth Stocks for 2020 AMZN shares were trading at $3,116.22 per share on Friday afternoon, down $58.89 (-1.85%). Year-to-date, AMZN has gained 68.64%, versus a 4.86% rise in the benchmark S&P 500 index during the same period."}]}