{"article": [{"url": "https://stocknews.com/news/spy-inx-dia-iwm-qqq-3-vital-investing-lessons-from-the-past-40-years/", "published": 1592568500.0, "headline": "3 Vital Investing Lessons from the Past 40 Years", "body": "As the son of a Certified Financial Planner, I got an early start on investing. Even as young as 12 years old I would go to my father’s office to help him with clerical work to make a few extra bucks…but along the way I couldn’t help being curious about all those big books; Value Line, Standard and Poor’s tear sheets and the in-depth research reports from his firm, A.G. Edwards. Sure you could say it was in the blood as I got hooked right away. In fact, my very first investment was a copper mining stock, Asarco, that went up 30% in 3 months. That was pure luck. But it set me on a 40 year journey to keep investing and learning so that my results weren’t a matter of luck. Rather it was about understanding how to stack the odds in my favor to enjoy greater investment success. 7 \"SAFE HAVEN\" Dividend Stocks for Turbulent TimesRecently I had an idea to boil down that 40 years of investment wisdom to help investors. This led to a new online presentation that went live this week. Get access here: 9 Simple Strategies to Regrow Your Portfolio in 2020. Today, I want to give a preview of these insights by focusing on 3 of the key strategies. Strategy #1 = The Benefit of Value Investing There are many different investment styles. Everything from day trading to buy and hold investing. Or a focus on fundamental vs. technical attributes. And then you have the ideas of value vs. growth vs. income vs. momentum approaches. I have explored them all. And the one that makes the most sense to me is a focus on value. Meaning to find stocks that are trading at an ample discount to their fair value allowing an investor to enjoy outperformance as they rebound to their proper price. This is the approach favored by investing legends Benjamin Graham, and his famed mentee Warren Buffett. However, value investing doesn’t mean the same thing to everyone. My twist is to avoid stocks with weak fundamentals like declining earnings. Too often they go from bad to worse. Instead you want a thriving company that has sold off allowing you to pick it up from the discount bin for 20-40% below fair market value. A portfolio of stocks with that spread will enjoy a marked advantage over other portfolios. Also being a value investor you know when stocks are overpriced and set for a fall. This helps with market timing and the ability to construct portfolios that can actually gain as the market heads lower. Strategy #7 = Growth and Value Are Not Opposites Too many investors imagine that there is a singular spectrum for stocks with value on one end and growth on the other. That is rubbish! They are separate concepts that blend incredibly well together. In fact, my two best investments of all time come from this camp. Amazon @ $8.65 back in 2001 after the tech bubble burst Priceline @ $14.62 also in 2001 And yes, I have owned those shares for a long, long time enjoying robust returns. There is simply no way that these stocks, that were originally in the value camp, could keep outpacing others unless they were also incredible growth companies. Long story short, why settle for boring value stocks when you can enjoy exciting growth companies trading at discount prices? And volatile, or even bearish markets, like we have seen of late are the best environment to buy these stocks for serious long term gains. Strategy #9 = Algos & HFTs Have Changed EVERYTHING! We all know about the rise of computer based trading. Algos and High Frequency Traders dominate the investment landscape. Some firms have gained such an unfair advantage that they can go an entire year without having a single losing session. Here is the sad truth: WE CAN’T BEAT THEM! At least not at their own game. They simply have more money, experience, PhD mathematicians and technological firepower than we ever will. Thus, we need to carve out a different path. And that is to play the role of the counter puncher. Like in boxing you aggressively respond to overreactions by your opponent. As it applies here, when the best growth stocks get beaten down by the computer traders…then you buy the stock on the cheap to enjoy outsized gains as they bounce back. What are the Other 6 Strategies Covered in this New Presentation? How to use economic data to understand market direction Value investing pitfalls The power of EER Importance of timeliness When to sell (so important we cover it with 2 of the 9 lessons) And how to use all these lessons to beat the market now Now is the perfect time to watch this presentation to pick up more powerful insights to improve your investment results in the days and weeks ahead. So click below to get access now. Enjoy! 9 Simple Strategies to Regrow Your Portfolio in 2020. Steve Reitmeister …but everyone calls me Reity (pronounced “Righty”) CEO, Stock News Network Editor, Reitmeister Total Return SPY shares . Year-to-date, SPY has declined -3.54%, versus a % rise in the benchmark S&P 500 index during the same period."}]}