{"article": [{"url": "https://stocknews.com/news/aapl-kr-bac-axp-4-stocks-warren-buffett-loves-and-you-should-too/", "published": 1594987700.0, "headline": "4 Stocks Warren Buffett Loves and You Should Too", "body": "Warren Buffett’s Berkshire Hathaway (BRK.A) has been underperforming the market. The stock is trading down about 15%, while the S&P 500 is down less than 1% year to date. It’s not a surprise given the outperformance of growth stocks relative to value stocks. While some are concluding that this means that Buffett’s best days are behind him. It’s more likely that he is aware of something that the market doesn’t understand. And, Buffet is sitting on a record cash haul of $137 billion. 7 Best ETFs for the NEXT Bull MarketThe same thing happened in 2000 when Buffett was bearish on tech stocks, and the Nasdaq fell 80%. Or in 2008, when he famously advised “Buy American. I Am.”, and the market bottomed a few months later. His portfolio gives the clearest insight into his current thinking. It’s loaded up with sectors that have underperformed like financials and energy and would be poised to move higher if economic conditions change. If you’re a believer, as many are, that Buffet is the world’s greatest investor, you’ll want to pay attention to these four stocks that he owns large quantities of: Apple Inc. (AAPL) Although Warren Buffett is typically thought of as a value investor, he has 22% of his portfolio in AAPL. In part, it’s because AAPL has become more like a value stock after years of being in a growth model. It has a wide moat and competitive advantages that are nearly impossible for a start-up or another large company to beat. AAPL also has pricing power. Once users enter the AAAPl ecosystem, they are likely to keep buying more Apple products and use more Apple services. The company continues to hit on all cylinders as its and active installed base of devices reached new highs in all geographical segments across all product categories in the second quarter. Its Services business geared towards enterprise customers also grew faster than expectations. Moreover, the company set a new quarterly record for wearables. AAPL’s strong customer loyalty and the diversification of its product line have ensured that its trajectory remains unaffected by the coronavirus. There has been immense excitement for the first 5G iPhone which could face a launch delay due to the current circumstances. Consumer demand is expected to be strong and most experts are projecting that over 100 million iPhone 12s will be sold within a couple of months of the phone’s release. The company has also diversified its product line to appeal to a wider variety of segments, for example with its lower-priced phones. Since its March lows, the stock is up by approximately 83%. AAPL has an impressive earnings surprise history with the company beating consensus EPS estimate in each of the trailing four quarters. In the fiscal second quarter, earnings per share were up 4% year over year and AAPL’s operating cash flow was up $2.2 billion as compared to the year-ago period. How does AAPL stack up for the POWR Ratings? A for Trade Grade A for Buy & Hold Grade A for Peer Grade A for Industry Rank A for Overall POWR Rating You can’t ask for better. The stock is also ranked #1 out of 28 stocks in the Technology-Hardware industry. American Express Company (AXP) Buffett started investing in AXP in the 1960s when it was a relatively new company. He currently owns about 19% of AXP and has a cumulative gain of 1,400% on the position. AXP is unique in that it handles processing like Visa (V) or Mastercard (MA), but it also handles the lending part of the business. This means it’s on the hook if its customers default. In contrast, V and MA don’t issue credit. This creates more risk but also more upside when the economy is strong. Even though AXP was adversely affected due to the Covid-19 pandemic and hit its 52-week low of $67 in March, the stock is on its way up and has recovered by approximately 45%. AXP has an impressive earnings surprise history with the company beating consensus estimates in three of the trailing four quarters. The company pays an annual dividend of $1.72, which yields 1.77%. The stock has an Industry Rank of “B” according to the POWR Ratings and is ranked #11 out of 45 stocks in the Consumer Financial Services industry. Kroger Company (KR) Buffett recently acquired a 2.3% stake in KR. The investment in KR is off to a strong start, as it’s up 30% year to date. Additionally, KR has been helped by the pandemic which led to a surge in grocery-store sales as consumers stocked up on items. Further, it’s online sales have been growing as it looks to keep up with its competitors. Looking at KR’s financials, it’s not surprising to see what Buffett likes about it. It has a price to earnings ratio of 12 with 11% sales growth and 22% gross margins. It’s cheaper than the average stock in the S&P 500 while growing faster and having higher margins. Further, it has a strong brand identity and customer loyalty. It will certainly face headwinds as Amazon (AMZN) and Walmart (WMT) are aggressively expanding into groceries, but KR has the resources to withstand this pressure. KR has gained more than 20% since low levels it hit in March due to the pandemic-led market crash. For the current quarter, the EPS estimate of $0.49 indicates an increase of 11.4% over the year-ago number and the revenue estimate of $29.46 billion represents a 4.6% increase. In KR’s first quarter ended May 23, 2020, operating profit grew 47.2% and EPS was up 60% year over year. The first quarter also recorded a 92% growth in KR’s digital sales. KR’s POWR Ratings reflect this promising outlook. It has an overall rating of “Buy” with an “A” for Trade Grade and Industry Rank and a “B” for Buy & Hold Grade. Among the 18 stocks in the Grocery/Big Box Retailers group, it’s ranked #8. Bank of America Corporation (BAC) BAC is Buffett’s second-largest investment as he owns nearly a billion shares, worth $23 billion. Investing in BAC reflects his generally optimistic attitude about the American economy’s prospects. BAC, like many financials, has been an underperformer in the past couple of years. Thus, its valuation is very attractive given its price to earnings ratio of 9. BAC is committed to returning capital to shareholders across economic cycles which makes it an attractive stock for income investors. Since the stock hit a low of $17.95 in March, it has grown more than 20%. The company recorded lower revenue and net income for the second quarter as compared to the year-ago quarter. BAC ended the second quarter with record deposits of $1.7 trillion, $242 billion in common equity, and $21 billion in cash reserves which is a testament to its strong balance sheet. The company has a dividend yield of 3.01%. BAC has a Peer Grade of “B” according to the POWR Ratings system and #3 out of 10 stocks in the Money Center Bank group. Want More Great Investing Ideas? 9 “BUY THE DIP” Growth Stocks for 2020 Newly REVISED 2020 Stock Market Outlook 7 “Safe-Haven” Dividend Stocks for Turbulent Times AAPL shares were trading at $385.57 per share on Friday afternoon, down $0.52 (-0.13%). Year-to-date, AAPL has gained 31.97%, versus a 1.03% rise in the benchmark S&P 500 index during the same period."}]}