{"article": [{"url": "https://stocknews.com/news/cvx-hes-wmb-3-oil-gas-stocks-to-add-to-your-long-term/", "published": 1594210100.0, "headline": "3 Oil & Gas Stocks to Add to Your Long-Term Portfolio", "body": "As we know, the pandemic impacted the global Oil & Gas sector more than any other sector of the economy. The demand for petroleum products started decreasing in February 2020 due to the lockdown measures taken by major oil consuming countries and crude futures plummeted to record lows in April. However, oil prices recovered significantly in the quarter ended June, marking their best quarterly performance in the past three decades. And, according to a recent CNBC report, this dramatic recovery convinced Goldman Sachs (GS) analysts to expect global oil demand to return to pre-pandemic levels by 2022. While remote operations, shortened supply chains and regionalization of businesses will keep the demand low in 2020, the sector should start rebounding in 2021. The analysts at the US investment bank expect global oil demand to decline by 8% in 2020 but rebound 8% in 2021. 9 \"BUY THE DIP\" Growth Stocks For 2020Oil prices are oftentimes driven by geo-politics and global events but demand also plays an important role. According to the latest forecast of the U.S. Energy Information Administration (EIA), WTI crude oil would trade at $45.70 per barrel and Brent crude oil would trade at $49.70 per barrel in 2021. Consequently, this is a good time to add the following 3 well-integrated and deeply-entrenched dividend paying oil & gas stocks to your portfolio and hold for the long haul for exceptional returns: Chevron Corporation (CVX) CVX needs no introduction. With a market capitalization of $165.4 billion, the company operates in more than 180 countries worldwide through its Upstream and Downstream segments. As a recovery measure, CVX plans to slash $1 billion of operating expenses this year and reduce capital spending by almost 33%. Its cost containment measures include reduction of up to 15% of its global workforce. Chevron beat the consensus EPS estimates in each of the trailing four quarters. The company is a consistent dividend payer and last increased its dividend by 8.4% in February 2020. CVX’s trailing twelve-month cash flow being more than 96.6% of US dividend stocks, the company should continue rewarding shareholders. The current dividend yield is 6% and payout ratio is 73.2%. CVX is currently trading more than 47% lower than its 52-week high of $127. The average analyst price target for the stock is $103.08, indicating a potential upside of 19.4% from the current price. CVX is rated “Neutral” in the StockNews.com POWR Ratings system with an overall grade of C. Among the POWR components, it has a grade of A for Peer and a C for Buy & Hold. CVX is ranked #1 of the 96 stocks in the Energy – Oil & Gas industry. Williams Companies, Inc. (WMB) With a market capitalization of $22.9 billion, WMB operates as an energy infrastructure company. The company owns and operates 30,000 miles of pipelines, 28 processing facilities, 7 fractionation facilities, and approximately 23 million barrels of NGL storage capacity. WMB is well positioned to capitalize on the projected increase in demand for natural gas in the United States with its impressive portfolio of large-scale value creating projects. WMB beat the consensus EPS estimates in three of the trailing four quarters. WMB has issued more total dividends (as measured in absolute US dollars) over the past six years than 93.2% of other US stocks currently paying dividends. The company last increased its dividend by 5.3% in March 2020. The current dividend yield is 8.5% and payout ratio is 156.9%. WMB is currently trading about 54% below its 52-week high of $29.06. The average analyst price target for the stock is $22.36, indicating a potential upside of 18.2% from the current price. The StockNews.com POWR Ratings have WMB rated “Neutral” with a Peer Grade of A and Buy & Hold Grade of C. WMB’s ranking is #2 in the industry. Hess Corporation (HES) With a market capitalization of $14.9 billion, HES operates as a global independent explorer and producer of crude oil, NGLs, and natural gas. As of December 31, 2019, it had total proved reserves of 1,197 million barrels of oil equivalent. On March 17, HES announced a revised $2.2 billion capital and exploratory budget for 2020, a 27% reduction from the previous budget of $3.0 billion, which primarily will be achieved by shifting from a six-rig program to one rig in the Bakken. Also, in a statement to shareholders on April 24, HES assured its investors that the company’s long-term strategy has positioned it to manage through this low-price environment. HES beat the consensus EPS estimates in two of the trailing four quarters. HES has annual revenue of approximately $6 billion; this puts it in the large-sized revenue generating companies, but its dividend growth rate surpasses that of only 12.83% of US-listed, dividend-paying stocks in the same revenue class. The current dividend yield is 2.07%. HES is currently trading more than 52% lower than its 52-week high of $74.11. The average analyst price target for the stock is $56.70, indicating a potential upside of 16.7% from the current price. HES is rated “Neutral” in the StockNews.com POWR Ratings system with an overall grade of C. Among the POWR components, it has a grade of A for Peer and a C for Buy & Hold. HES is ranked #3 in the industry. View them all below. Also enjoy these other timely investment resources from StockNews.com: Want More Great Investing Ideas? 9 “BUY THE DIP” Growth Stocks for 2020 Is the Bull S#*t Rally FINALLY Over? 7 “Safe-Haven” Dividend Stocks for Turbulent Times Top 3 Investing Strategies for 2020 CVX shares rose $0.19 (+0.22%) in after-hours trading Wednesday. Year-to-date, CVX has declined -26.44%, versus a -0.75% rise in the benchmark S&P 500 index during the same period."}]}