{"article": [{"url": "https://stocknews.com/news/qcom-cci-nok-3-5g-stocks-set-to-soar/", "published": 1593691700.0, "headline": "3 5G Stocks set to Soar", "body": "5G stocks have been talked about for a long time. Though the 5G rollout has slowed due to the coronavirus pandemic, this new technology will undoubtedly shape our future. The challenge lies in pinpointing the stocks that will benefit from 5G technology. Qualcomm (QCOM), Crown Castle (CCI), Nokia (NOK), and Skyworks Solutions (SWKS) are four 5G stocks investors should keep an eye on as we transition to a new era of wireless connectivity. Qualcomm (QCOM) 7 Best ETFs for the NEXT Bull MarketExperienced stock pickers know it pays to invest in companies with a track record of industry success. QCOM is one of those companies. QCOM pioneered the 3G and 4G rollouts. The company is poised to be a 5G trailblazer as it intends to use this technology well beyond the realm of smartphones. QCOM will enable 5G tech for phones as well as multiple devices hooked up to the Internet of Things (IoT). In other words, QCOM makes it possible for 5G to advance the functionality of everything from vehicles to industrial equipment, home appliances, and beyond. Flush with cash, QCOM should push 5G forward, breaking new barriers. QCOM’s has a Strong Buy rating in the POWR Ratings. One of the components of POWR Ratings is the Buy and Hold Grade. This grade measures the long-term bullish or bearishness of a stock. QCOM holds a Buy and Hold Grade of A. The company is ranked #6 out of 86 companies in the Semiconductor & Wireless Chip industry. Crown Castle (CCI) Savvy investors understand REITs can be great investments. CCI is a REIT that owns, operates, and leases more than 40,000 cell towers. The company is a leader in communications infrastructure. CCI will be providing the infrastructure that wireless companies need for 5G networks. In other words, CCI is a creative way to make money in 5G. Oppenheimer analyst Timothy Horan has issued an outperform rating on CCI, setting a price target of $175. Horan and other analysts are particularly bullish on CCI as the company is largely focused on small cells capable of supporting an abundance of data. The small cell market has the potential to grow from 100,000 to a million in the United States alone. Currently, the United States has 100,000 small cells, yet this figure could reach 150 million or more in the years to come. CCI has a Strong Buy rating in the POWR Ratings. The company is also graded A in all four components that make up the POWR Ratings. CCI is ranked #1 out of 40 stocks in the Real Estate Services industry. Nokia (NOK) If you are looking for a 5G supplier play, look no further than NOK. The company’s solid first-quarter results are the result of the company’s 70 plus 5G contracts and the installation of more than 20 live networks. Though further shutdowns resulting from the pandemic could make the road ahead quite bumpy. Simon Leopold, an analyst with Raymond James, has set a $5.50 price target for NOK. The average analyst price target for the stock is $5.03, which could provide a 15% upside. Want More Great Investing Ideas? 9 “BUY THE DIP” Growth Stocks for 2020 Is the Bull S#*t Rally FINALLY Over? 7 “Safe-Haven” Dividend Stocks for Turbulent Times Top 3 Investing Strategies for 2020 QCOM shares were trading at $91.45 per share on Thursday morning, up $1.67 (+1.86%). Year-to-date, QCOM has gained 5.28%, versus a -1.23% rise in the benchmark S&P 500 index during the same period."}]}