{"article": [{"url": "https://stocknews.com/news/zm-vrtu-par-akam-will-shares-of-zoom-video-continue-to-run-higher/", "published": 1600776500.0, "headline": "Will Shares of Zoom Video Continue to Run Higher?", "body": "Zoom Video Communications, Inc. (ZM) is one of the best-performing stocks this year. The company has over 300 million daily active participants worldwide. ZM provides a video-first communications platform in the Americas, the Asia Pacific, Europe, the Middle East, and Africa. It had had an influx of new customers and users so far in 2020, as the pandemic has triggered social distancing measures and forced people to spend time indoors. The demand for ZM’s products has increased exponentially since the onset of the pandemic. At the end of the fiscal second quarter ended July 2020, ZM had approximately 370,200 paid customers. This implied a 458% increase compared to the year-ago quarter. Total revenue of $663.5 million was up 355% year-over-year while EPS for the quarter came in $0.63, improving 3050% year-over-year. With robust growth in virtual working and learning, the stock has gained 588% year-to-date. This impressive performance and the potential upside based on several factors have helped it earn a “Strong Buy” rating in our proprietary rating system. 7 \"SAFE HAVEN\" Dividend Stocks for Turbulent TimesHere is how our proprietary POWR Ratings system evaluates ZM: Trade Grade: A ZM is currently trading higher than its 50-day and 200-day moving averages of $304.66 and $178.66, respectively, indicating that the stock is in an uptrend. The stock’s 83% return over the past three months reflects a solid short-term bullishness. ZM added nearly 988 customers contributing more than $100,000 to its trailing 12 months revenue during the last quarter, growing 112% year-over-year. Net cash generated by operating activities was $401.3 million, compared to $31.2 million a year ago. Buy & Hold Grade: A ZM is well positioned in terms of proximity to its 52-week high, which is a key factor that our Buy & Hold Grade takes into account. The stock is currently trading just 2% below its 52-week high of $478.00. The company strives to deliver a world-class, frictionless, and secure communication experience for its customers across locations. ZM’s popularity led to very inventive hacking, causing thefts of private data from user devices. However, the quick developments within the company are enabling enterprises to safely engage with their employees and customers. In words of Eric S. Yuan, the CEO of ZM, “Organizations are shifting from addressing their immediate business continuity needs to supporting a future of working anywhere, learning anywhere, and connecting anywhere on Zoom’s video-first platform.” Peer Grade: A ZM is currently rated #3 out of 53 stocks in the Technology – Services industry. Other popular stocks in the industry are Virtusa Corporation (VRTU), PAR Technology Corporation (PAR), and Akamai Technologies, Inc. (AKAM). ZM comfortably beat the year-to-date performance of its peers by gaining 588.5%. VRTU, PAR, and AKAM have returned 9%, 37.3%, and 27.5%, respectively, over this period. Industry Rank: B The Technology – Services industry is ranked #42 out of the 123 StockNews.com industries. Since the onset of the health crisis, the remote working and learning culture amplified the dependence on digital infrastructure, resulting in an operational challenge for major firms. The industry rose to the occasion and is catering to the needs of all other industries. Overall POWR Rating: A (Strong Buy) Overall, ZM is rated a “Strong Buy” due to its impressive quarterly performance, growing user base, and solid price momentum, as determined by the four components of our overall POWR Rating. Bottom Line ZM has gained significantly so far this year and is a decent investment for investors looking for stability and growth in the long run. Global Covid-19 cases are still on the rise and some countries may impose further lockdowns or even bring back some earlier restrictions. Moreover, some companies are in the process of adopting a permanent virtual working environment going forward. Hence, we can expect an increase in demand for ZM’s services. Analyst sentiment, which gives a good sense of a stock’s future price movement, is pretty impressive for ZM. The average broker rating of 1.67 indicates a favorable analyst sentiment. Of the 30 Wall Street Analysts that rated the stock, 11 have given it a “Strong Buy” rating. The market expects EPS for the ongoing year to rise 744% from the year-ago value. This outlook should keep ZM’s price momentum alive in the near term. Want More Great Investing Ideas? 7 Best ETFs for the NEXT Bull Market Is the Stock Market Correction Over? Chart of the Day- See the Stocks Ready to Breakout ZM shares were trading at $492.53 per share on Tuesday afternoon, up $24.06 (+5.14%). Year-to-date, ZM has gained 623.88%, versus a 3.46% rise in the benchmark S&P 500 index during the same period."}]}