{"article": [{"url": "https://stocknews.com/news/amzn-fb-googl-3-internet-stocks-that-could-double-by-2021/", "published": 1594037300.0, "headline": "3 Internet Stocks that Could Double", "body": "Choosing great stocks in these uncertain times are a difficult task, but a few high-growth Internet stocks have not only performed well this year, but have seen a significant increases in value. These companies have benefited from the recent switch to online activities due to the pandemic. The Dow Jones Internet Composite Index, which tracks the 40 largest and most actively traded stocks in the internet industry, has returned 26% year to date compared to the S&P 500’s loss of 3.1%. As individuals and companies struggle to find their footing in this “new normal,” these internet companies are poised to gain. 9 \"BUY THE DIP\" Growth Stocks For 2020Here are three internet stocks that could double in price in the not-too-distant future. Amazon (AMZN) Among the dominant internet players, AMZN is set to benefit the most in this “new normal.” Due to the spread of the coronavirus, consumers are doing a larger share of their shopping online. As a result, the biggest e-retailer in the world, AMZN, is expected to continue to grow at a rapid pace. In the first quarter of 2020, Amazon reported a 26% rise in revenue to $75.5 billion. Its subscription service, Amazon Prime, which drives loyalty, saw a jump in sales of 28% in the same quarter. Amazon’s cloud services are also expected to experience rapid growth as businesses shift their operations to the cloud. How does AMZN stack up for the POWR Ratings? A for Trade Grade A for Buy & Hold Grade A for Industry Rank A for Peer Grade A for overall POWR Rating If that wasn’t good enough it is also the #1 ranked stock in the Internet industry, with a year to date return of 56.4%. If AMZN continues this same momentum, its stock price could double in the not-too-distant future. Facebook (FB) FB’s growth story is known to almost everyone, but can the stock continue its success? FB earns 98% of its revenue from advertisements. Across Facebook.com, WhatsApp, and Instagram, this company has a reach of more than 3 billion people, making it the largest social network in the world. Analysts are projecting a growth in ad revenue of around 4.9% this year, which could supercharge FB’s stock price. This stock has already risen to $233 from its low of $146. It will surprise no one that FB is one of the top rated stocks in our momentum based POWR Ratings system . Overall it is the #4 ranked stock in the #1 ranked industry (Internet Stocks). The 63% return year to date on top of a 57% showing last year explains the kind of momentum taking place with Facebook. Alphabet (GOOGL) A number of positive changes at Alphabet could drive the future growth of the company. There has been rapid growth in the usage of Google Cloud, YouTube, and Waymo. Gross revenue at GOOGL rose by approximately 13% in the first quarter of this year. Additionally, the company’s revenue from its cloud services saw an increase of 52%. GOOGL’s stock price has now risen to $1469.23 from this year’s low of $1054.13. If the stock continues to grow with this momentum, it may double in value sooner-than-later. The stock is up 12% for the year. GOOGL has a pretty good poker hand with 4 Aces. By that I mean that all 4 scores of our exclusive POWR Ratings system is an A for the stock. If that wasn’t good enough it is also the $2 ranked stock in the Internet industry. Want More Great Investing Ideas? 9 “BUY THE DIP” Growth Stocks for 2020 Is the Bull S#*t Rally FINALLY Over? 7 “Safe-Haven” Dividend Stocks for Turbulent Times Top 3 Investing Strategies for 2020 AMZN shares were trading at $3,022.26 per share on Monday afternoon, up $131.96 (+4.57%). Year-to-date, AMZN has gained 63.56%, versus a -0.63% rise in the benchmark S&P 500 index during the same period."}]}