{"article": [{"url": "https://stocknews.com/news/ewz-jets-xop-kre-4-etfs-to-avoid-in-october/", "published": 1601986100.0, "headline": "4 ETFs to AVOID in October", "body": "The stock market is not in a downtrend yet despite the major sell-off last month. However, there are increasing odds of a roll down with increasing fears of a second wave, failure to reach a stimulus deal, and lingering uncertainty surrounding the health of President Trump. The economy is apparently showing signs of recovery with the unemployment rate falling to 7.9%, but that was primarily driven by the 700,000 people that left the labor force, meaning they are no longer counted as unemployed. Hence, the market is expected to be extremely volatile in October and thus, can move in either direction. ETFs offer an all-round exposure to an overall sector. Despite the street’s sharp recovery from the March bottom, the pandemic profoundly impacted some sectors, of which, some are still struggling to reach their pre-crash levels. ETFs exposed to technology, pharmaceuticals and precious metals have gained major traction during the pandemic. On the other hand, some sectors like travel, oil & gas, and banking were severely impacted by the virus. Four ETFs that should be avoided this month are the iShares MSCI Brazil Capped ETF (EWZ), U.S. Global Jets ETF (JETS), SPDR S&P Oil & Gas Exploration & Production ETF (XOP), and the SPDR S&P Regional Banking ETF (KRE), as prospects for the ETF holdings look bleak. Moreover, events this month may turn outright negative for the sectors they are exposed to. 7 \"SAFE HAVEN\" Dividend Stocks for Turbulent TimesiShares MSCI Brazil Capped ETF (EWZ) EWZ seeks to track the investment results of an index composed of Brazilian equities, holding the largest and most liquid companies that are domiciled in the South American nation. For investors seeking investment in the nation, EWZ is one of many options and offers the broadest exposure to the country’s large cap segment. EWZ presently has an AUM of $4.73 billion after witnessing approximately $191 million in outflow in September. The ETF commands an expense ratio of 0.59% and pays an annual dividend of $1.03, which translates into a yield of 3.77%. The investment seeks to track the investment results of the MSCI Brazil 25/50 Index. The fund generally invests at least 95% of its assets in the securities of its underlying index and in depositary receipts representing securities in its underlying index. The index is a free float-adjusted market capitalization-weighted index with a capping methodology applied to issuer weights. The ETF has an MSCI ESG Fund Rating of BB based on a score of 3.56 out of 10. In terms of sector exposure, the portfolio has the maximum weightage of 27.6% towards the financial sector, followed by a 17.7% weightage to basic materials. The fund holds 58 companies in total, with an average market capitalization of $26.94 billion. The top 3 holdings in the fund are Vale S.A. (VALE), Itau Unibanco Holding SA (ITUB), and B3 SA – Brasil, Bolsa, Balcao, with the weights of 12.6%, 6.3% and 6.3%, respectively. EWZ has lost 39.5% so far this year to close yesterday’s trading session at $28.38. Brazil’s national debt rose to a record 88.8% of gross domestic product in August, and the public sector primary deficit over the past 12 months through August widened to 8.5% of GDP. Hence, investors should avoid this ETF. EWZ’s poor prospects are also apparent in our POWR Ratings which gives it a “Sell” rating. It also has a grade of “F” for Trade Grade and Industry Rank, and a “D” for Buy & Hold Grade and Peer Grade. U.S. Global Jets ETF (JETS) The investment objective of JETS is to provide investors access to the global airline industry, including airline operators and manufacturers from all over the world. The ETF has an MSCI ESG Fund Rating of B based on a score of 2.28 out of 10. The ETF presently has an AUM of $1.64 billion. JETS witnessed an inflow of $166 million in September, but saw a major outflow of $10 million in the last week of the month. The ETF has an expense ratio of 0.6% and pays an annual dividend of $0.39, translating to a yield of 2.26%. The ETF tracks the US Global Jets Index, which is composed of the exchange-listed common stocks (or depository receipts) of U.S. and international passenger airlines, aircraft manufacturers, airports, and terminal services companies. It also has a segment benchmark of Thomson Reuters Global Transportation Index Total Return. The ETF has a 68.3% weightage in the US-based companies, while also being exposed to companies in Canada and the United Kingdom. JETS is 76% exposed to the Airlines industry, followed by the Airport Services, Air Freight & Courier Services, and Aerospace & Defense industries with 9.2%, 8.2% and 6.6% weightings, respectively. The top 3 out of the 41 holdings in the fund are Southwest Airlines Co (LUV), Delta Air Lines Inc (DAL), and United Airlines Holdings Inc (UAL), each weighing approximately 10%. JETS has lost 39.5% so far this year to close yesterday’s trading session at $17.46. The federal airline aid had expired last week, and could result in over 30,000 job cuts. Officials have pleaded to extend financial aid amid pending job cuts and are looking over a potential stimulus deal with great optimism. Hence, investors should avoid this ETF until airlines start operating back to its pre-COVID levels. According to the POWR Ratings, JETS has a “Sell” rating. It also has an “F” for Trade Grade and Buy & Hold Grade, and a “D” for Peer Grade. It’s ranked #29 out of 33 ETFs in the Industrials Equities ETFs group. SPDR S&P Oil & Gas Exploration & Production ETF (XOP) XOP is a leveraged ETF that seeks to provide investment results that correspond to the total return performance of an index derived from the oil and gas exploration and production segment. This ETF offers exposure to the sub-sector of the domestic energy market, making it a potentially useful tool for those looking to target stocks of companies responsible for discovering and accessing new deposits of oil and gas. XOP presently has an AUM of $1.64 billion after witnessing approximately $10.7 million inflow in September. The ETF commands an expense ratio of 0.59% and pays an annual dividend of $1.03, translating into a yield of 3.77%. XOP tracks the S&P Oil & Gas Exploration & Production Select Industry index, an equal-weighted index of companies in the US oil & gas exploration & production space, providing diversified exposure to primarily large cap, while being biased towards small and midcaps. It also has a segment benchmark of Thomson Reuters US Oil & Gas Exploration and Production index. XOP weighs 68% to exploration, and 27.7% to gas refining companies. The fund is also exposed to 2.7% and 1.4% of coal and renewable fuels, respectively. The top 3 holdings out of the 44 companies held in the fund are Devon Energy Corp (DVN), Diamondback Energy Inc (FANG), and Parsley Energy Inc (PE), with each weighing approximately 3.8%. XOP has lost 53% so far this year to close yesterday’s trading session at $43.49. The energy sector has been stuck in a secular bear market since 2014. Oil and gas companies have struggled the most as the market was in oversupply for most of the year. Consequently, many of these refineries have run out of business. The longer-term trend is also weak as oil demand is expected to start declining due to green energy and electric cars. XOP’s POWR Ratings are consistent with this bleak outlook. It has an overall rating of “Strong Sell” with an “F” for Trade Grade and Buy & Hold Grade, and a “D” for Peer Grade and Industry Rank. Within the Energy Equities ETFs group, it’s ranked #22 out of 36 ETFs. SPDR S&P Regional Banking ETF (KRE) KRE gives investors a way to play regional banks, a sub-sector of the financial sector that offers a unique risk/return profile relative to traditional financial exposure. The fund invests in growth and value stocks of companies across diversified market capitalization. While traditional financial funds are dominated by large cap companies, KRE maintains significant exposure to small and mid-cap banking stocks. The ETF currently has an AUM of $1.1 billion and has witnessed an inflow of $7.8 million in the last month. The ETF has an expense ratio of 0.35% and pays an annual dividend of $1.41, which translates into a 3.82% dividend yield. KRE tracks the S&P Regional Banks Select Industry, an equal-weighted index that covers US regional banks exclusively, and the S&P 500 Index, by using representative sampling techniques. The select industry index is based on the GICS classification, as well as liquidity and market cap requirements. The ETF has an MSCI ESG Fund Rating of BBB based on a score of 4.4 out of 10. KRE has domestic exposure to banks with an equal weightage of approximately 3.7% to its top three holdings. The ETF holds 128 companies in its portfolio and has major holdings in First Republic Bank (FRC), Fifth Third Bancorp (FITB), and Regions Financial Corp (RF). KRE has lost nearly 32% year-to-date. Banking being the most interest sensitive sector has been directly affected by the Fed’s plan to keep the interest rates near zero for the coming years. The Fed also seeks to keep banks’ dividend and buyback limits for the rest of the year. Moreover, presidential nominee Biden’s proposal to roll back corporate tax policy could hurt already weak bank profits. KRE’s POWR Ratings reflect its poor prospects. The ETF is rated a “Sell.” It also has an “F” for Trade Grade, and a “D” for Peer Grade and Industry Rank. Within the 38-ETF Financial Equities ETFs group, it is ranked #28. Want More Great Investing Ideas? Do NOT Buy Stocks Before the Election! 7 “Safe-Haven” Dividend Stocks for Turbulent Times Chart of the Day- See Christian Tharp’s Stocks Ready to Breakout EWZ shares were trading at $28.03 per share on Tuesday afternoon, down $0.35 (-1.23%). Year-to-date, EWZ has declined -40.23%, versus a 5.99% rise in the benchmark S&P 500 index during the same period."}]}