{"article": [{"url": "https://stocknews.com/news/amzn-spg-bpy-high-yield-reits-spg-and-bpy-look-to-be-big-winners/", "published": 1600776500.0, "headline": "2 High-Yield REITs That Look To Be Winners In JCPenney's Bankruptcy", "body": "Is brick-and-mortar retail dead? I’m not so sure. My research points to a different paradigm for retail sales. I believe you will see more coordination and integration between traditional brick-and-mortar retail outlets and the large online sellers. Instead of competing for market share, the smart retailers from both sides of the digital divide will combine forces, growing the whole retail pie. The acquisition out of bankruptcy of J.C. Penney by two premium shopping mall operators will be a catalyst. Simon Property Group (SPG) & Brookfield Property Partners (BPY) According to a September 9 CNBC article, Simon Property Group (SPG) and Brookfield Property Partners (BPY) have offered a deal in bankruptcy court totaling $1.75 billion to acquire the business operations and owned real estate of J.C. Penney. The two companies will each contribute $500 million of equity, with the balance coming from new and assumed debt. About $5 billion of Penney debt and any common stock equity will be wiped out if the court accepts the offer. 7 \"SAFE HAVEN\" Dividend Stocks for Turbulent TimesCurrently, J.C. Penney operates 650 stores with 70,000 employees. The company-owned Penney real estate is valued at $1.4 billion with the stores open, and $700 million with the stores shut down. If the Simon and Brookfield offer is accepted, the two pick up some valuable assets at a great price. Even though the two mall operators will pick up assets at great prices, the real money will be made when they determine and start a plan to integrate the Penney assets into the new world of blended in-store and online shopping. Amazon (AMZN) Last month, the Wall Street Journal revealed a big clue about the future of retailing. The article reported that Simon Property Group was in talks with Amazon.com (AMZN). The two companies discussed (and continue to work on, I suspect) the potential to turn some of Simon’s anchor department stores into Amazon distribution hubs. Both the Brookfield and Simon management teams have outstanding long-term track records of building shareholder values. These recent moves show how the two companies are at the forefront of the changes in retail selling. Simon Property Group (SPG) is a large-cap real estate investment trust (REIT) with over 200 malls, premium outlets, international shopping centers, and lifestyle centers. With the retail shutdown in the early days of the pandemic, Simon reduced its dividend to pay $6.00 per share in 2010. So far, $3.40 in dividends has been paid. The recent $1.30 per share dividend rate should increase significantly as we go into 2021. Brookfield Property Partners (BPY) is a diversified global real estate company that owns, operates, and develops one of the largest portfolios of office, retail, multifamily, industrial, hospitality, triple net lease, self-storage, student housing, and manufactured housing assets. The company has sustained its dividend through the pandemic and currently yields over 11%. As a publicly-traded partnership, Brookfield sends out a Schedule K-1 at tax time. For my Dividend Hunter subscribers, I have recommended two 1099 reporting stocks that provide the same investment potential as Brookfield. Want More Great Investing Ideas? Top Dividend Stock to Own! Download Free Report Today Buy These 3 High-Yield Dividend Stocks All Under $15 Buy and Hold These 3 Dividend Stocks Forever AMZN shares were trading at $3,123.65 per share on Tuesday afternoon, up $163.18 (+5.51%). Year-to-date, AMZN has gained 69.04%, versus a 3.75% rise in the benchmark S&P 500 index during the same period."}]}