{"article": [{"url": "https://stocknews.com/news/msft-orcl-sap-3-buy-rated-software-stocks-that-pay-dividends/", "published": 1601986100.0, "headline": "3 ‘Buy-Rated’ Software Stocks That Pay Dividends", "body": "After a massive rally amid the pandemic, the market has lately been in correction mode. While analysts view this as a healthy affair, it’s not an easy decision for investors to bet on stocks and ignore the economic weakness, uncertainties related to the upcoming presidential election, and the arrival of a coronavirus vaccine. Usually, investors will invest in dividend stocks when the market is volatile, as these stocks ensure a steady income irrespective of their price change. However, it’s always better to pick dividend-paying stocks that have the potential to grow once the volatility is over. And, given the changing behavior of consumers and businesses, the best option is technology. The rapid digital transformation is a permanent shift. 7 Best ETFs for the NEXT Bull MarketMicrosoft Corporation (MSFT), Oracle Corporation (ORCL), and SAP SE (SAP ) pay attractive dividends to their shareholders and should keep riding the tech boom after this correction. So, it’s worth buying the dip in these stocks. Microsoft Corporation (MSFT) Starting as a creator of Windows operating systems, MSFT quickly expanded into the other areas. After dwindling for years, the company bounced back under the vigilant leadership of Satya Nadela in 2014. During his tenure, MSFT became a leader in cloud-based solutions and also introduced Surface Pro laptops and Xbox games. Recently, the company announced its plans to acquire ZeniMax Media, the parent company of Bethesda Softworks, one of the largest privately-held game developers and publishers in the world. MSFT’s revenue increased 13% year-over-year to $38 billion in the fiscal fourth quarter ended June 2020. The increase in revenue was led by the company’s cloud service segment Azure, which witnessed a revenue increase of 47%. Microsoft’s Surface and Xbox revenues grew 28% and 65%, respectively, in the quarter. The market expects MSFT’s revenue to increase by 8% in the current quarter and 9.6% in the current financial year. The company’s EPS is expected to increase 11.6% in the current quarter, 12.3% in the current fiscal year, and at a rate of 15.3% in the next five years. MSFT pays an annual dividend of $2.04 per share, yielding 0.99%. Over the past six years, MSFT has issued more dividends than 98.4% of other dividend-issuing US stocks in the StockNews.com universe. How does MSFT stack up for the POWR Ratings? B for Trade Grade B for Buy & Hold Grade B for Peer Grade B for Industry Rank B for Overall POWR Rating. It is ranked #19 out of 96 stocks in the Software – Application industry. Oracle Corporation (ORCL) ORCL offers a complete suite of integrated applications for sales, service, marketing, human resources, finance, supply chain, and manufacturing. The company operates through cloud service and license support, cloud license, and on-premise license, hardware, and services. At present, the company has 300 Fusion enterprise resource planning (ERP) customers and over 23,000 NetSuite ERP customers in the Oracle Cloud. Over the years, ORCL has transitioned toward a subscription-based software model to take advantage of changing consumer behavior. Recently, the company received a nod over its deal with TikTok. As per the deal, the company will be the technology partner for TikTok’s US operations. Oracle’s non-GAAP EPS for the fiscal first quarter ending August 2020 increased 15% year-over-year to $0.93 and surpassed the consensus estimate by 8.1%. The company earned 74% of its revenue from cloud services and license support while Fusion ERP cloud revenue grew by 33%, and NetSuite ERP cloud revenue was up by 23%. The market expects ORCL’s revenue to increase by 1.9% in the current quarter and 2.1% in the current year. The company’s EPS is expected to grow 11.1% in the current quarter, 9.6% in the current fiscal year, and at a rate of 9.2% in the next five years. The stock is currently trading just 6.9% below its 52-week high, after gaining more than 33% since hitting its low in mid-March. The company pays an annual dividend of $0.96 per share, yielding 1.63%. It’s no surprise that ORCL is rated a “Strong Buy” in our POWR Ratings system, with a grade of “A” in Trade Grade, Buy & Hold Grade, and Peer Grade and a “B” in Industry Rank. In the 96-stock Software – Application industry, it is ranked #1. SAP SE ADS (SAP) SAP develops enterprise resource planning (ERP) software for companies and industries worldwide. This market leader’s Machine Learning (ML), Internet of Things (IoT), and advanced analytics technologies help customers in sound decision making. The company offers co-operative commerce capabilities (Ariba), flexible workforce management (Fieldglass), and expense processing (Concur) under the Intelligent Spend Platform. The company’s SuccessFactors Human Experience management (HXM) solution attracted around 640 customers by the end of the second quarter of 2020. The company was recognized as the world’s 17th most valuable brand in the year 2020 for BrandZ Global Top 100 Most Valuable Brands ranking. The ranking estimates SAP’s brand value at $58 billion, unchanged year-over-year. The company plans to take Qualtrics public through an IPO to strengthen Qualtrics’ ability to capture its full market potential within Experience Management. To further its plans of leading the market segment, in October, SAP acquired Emarsys, a leading omnichannel customer engagement platform provider. The company has also entered into a partnership with J.P. Morgan’s asset management group. According to this partnership, SAP’s substantial Treasury Management customer base will have direct access to Morgan Money, the liquidity management platform. In the second quarter ending June 2020, total revenue grew 2% year-over-year to €6.74 billion, the current cloud backlog was up 20% and cloud revenue grew 21%. The revenue is expected to grow 5.3% for the quarter ended September 2020 and 5.3% this year. The consensus ESP estimate of $1.53 for the third quarter indicates a year-over-year increase of 7%. The EPS is expected to grow 14.3% in the current year and at a rate of 9.4% for the next five years. The company pays an annual dividend of $1.25, yielding 0.8%. The stock gained around more than 66% since hitting its 52-week low in mid-March. The company has an overall rating of “Buy” in our POWR Ratings system with a grade of “B” in each POWR components: Trade Grade, Peer Grade, Buy & Hold Grade, and Industry Rank. Of the 96 Software – Application stocks, SAP is ranked #21. Want More Great Investing Ideas? Do NOT Buy Stocks Before the Election! 7 “Safe-Haven” Dividend Stocks for Turbulent Times Chart of the Day- See Christian Tharp’s Stocks Ready to Breakout MSFT shares fell $0.39 (-0.19%) in after-hours trading Tuesday. Year-to-date, MSFT has gained 31.61%, versus a 5.55% rise in the benchmark S&P 500 index during the same period."}]}