{"article": [{"url": "https://stocknews.com/news/baba-pdd-jd-3-chinese-stocks-ready-to-bounce/", "published": 1593691700.0, "headline": "3 Chinese Stocks Ready to Bounce", "body": "China has been in a vigorous fight against the coronavirus and pioneered social distancing and quarantine measures. It’s also tracing contacts of anyone infected, aggressively testing, and shutting down regions if there are any signs of the disease flaring up. The coronavirus led to a boom in e-commerce sales for China, as it was the most convenient way to shop. Many companies will be realizing the next two years of their growth targets within the next two quarters. However, China’s vigilance and aggressive steps are ensuring that its economy is in a strong position to bounce back. We picked four stocks with the help of our proprietary POWR Ratings that are thriving in this environment and are needed because of the growing demand for online services with people staying at home. 7 Best ETFs for the NEXT Bull MarketAlibaba Group Holding Ltd (BABA) In the same way that the increasing penetration of the Internet into everyday life in the US means more growth for companies like Google (GOOG) and Amazon.com (AMZN), the growth of the Chinese Internet is synonymous with BABA becoming a $550 billion behemoth. In the last 10 years, BABA’s revenues have grown from $10 billion to $70 billion in the last seven years. BABA started as a business to business marketplace but has grown horizontally into multiple segments including cloud computing, food delivery, e-commerce, payments, entertainment, and logistics. In this way, it mirrors US Internet giants as well who use their lucrative, core business to win market share in other, growing areas. BABA has a Strong Buy rating in the POWR Ratings. It’s ranked #1 out of 115 Chinese stocks. Analysts have an average price target of $140, which represents a 19.5% upside. Eighteen analysts have Buy Ratings on BABA. (Note that BABA is just one of 4 stocks currently held in the Reitmeister Total Return newsletter. Learn more.) Pinduoduo Inc. (PDD) PDD is a Chinese social e-commerce powerhouse known for its attractive discounts and offers. The company’s unique “team purchase” model asks customers to invite their friends and form a shopping team so that they can avail of attractive bargains. This model is an effective marketing strategy as customers share information about PDD and its products to their friends who are in a similar income bracket. This model has been remarkably successful. Over the last five quarters, revenue has increased from $1.9 billion to $4.6 billion. PDD has returned 325.34% over the past year and is up 131.57% over the past three months. The YTD Price Return of the stock is an impressive 125.94%. Eight analysts recommend buying PDD and none recommend selling. PDD has a Strong Buy rating in our POWR Ratings and ranks #2 out of 115 Chinese stocks in the group. The stock has an “A” in all categories including Trade Grade, Buy & Hold Grade, Peer Rank, and Industry Rank. JD.com, Inc. (JD ) JD is a Chinese e-commerce company that is the largest retailer in China. The company had humble origins with a 4 square meters retail center in Beijing. It was mainly a retail operation, until the SARS epidemic in 2003 when he saw an opportunity to begin selling online. Like BABA, JD.com has grown with the country, its wealth, and increasing Internet penetration. In recent years, it has grown horizontally by investing in Artificial Intelligence, logistics, delivery, payments, and cloud computing. Since its IPO in 2014, the stock is up 200%. Over the past year, JD is 90.5% higher, and up 57.94 % over the past three months. It’s recently broken out to new highs. Fourteen analysts have a buy rating for JD and none recommend a sell rating. JD has a Strong Buy rating in our POWR Ratings with an “A” for Trade Grade, Peer Grade, Industry Rank, and Buy & Hold Grade. Among Chinese stocks, it’s ranked #3 out of 115. Want More Great Investing Ideas? 9 “BUY THE DIP” Growth Stocks for 2020 Is the Bull S#*t Rally FINALLY Over? 7 “Safe-Haven” Dividend Stocks for Turbulent Times Top 3 Investing Strategies for 2020 BABA shares . Year-to-date, BABA has gained 5.42%, versus a -1.99% rise in the benchmark S&P 500 index during the same period."}]}