{"article": [{"url": "https://stocknews.com/news/regn-gmab-hznp-bio-4-healthcare-stocks-with-high-profit-margins/", "published": 1600171700.0, "headline": "4 Healthcare Stocks with HIGH Profit Margins", "body": "The coronavirus pandemic has taken the world by a storm. Though treatments have improved, so death rates are lower, the disease has paralyzed the world in many ways. Many countries’ curves continue to rise, while countries such as Italy and Spain which had flattened the curve and reopened their economies are witnessing a second wave. With the health and macroeconomic repercussions of coronavirus, the demand for vaccines has risen more than ever. As of September 9th, almost 300 vaccines and drugs have reached phase IV of clinical trials. Pharmaceutical companies are under immense pressure to develop a definitive vaccine or a drug with several aids from the central and state authorities. This is also leading to significant investments in the healthcare industry from the private and public sectors. 9 \"BUY THE DIP\" Growth Stocks For 2020Thus, all types of healthcare stocks should benefit. The biggest winners will likely be companies with huge profit margins like Regeneron Pharmaceuticals, Inc. (REGN), Genmab A/S (GMAB), Horizon Therapeutics Public Limited Company (HZNP), and Bio-Rad Laboratories (BIO). Regeneron Pharmaceuticals, Inc. (REGN) REGN is a commercial developer and manufacturer of biopharmaceutical medicines for serious health conditions. It has developed and/or is in the process of developing effective medication for eye diseases, cancer, cardiovascular problems, arthritis, etc. RGEN has collaboration and license agreements with multiple pharmaceutical companies, as well as the U.S. department of health and human services. REGN is currently focused on developing a coronavirus vaccine. The UK government added REGN’s antiviral antibody cocktail REGN-COV2 in its phase three clinical trial on September 14th. If proven successful, RENG-COV2 is expected to sell 70,000-3,00,000 doses in the United States following an already-signed $450 million deal. REGN entered into a strategic partnership in August to jointly develop and distribute the coronavirus vaccine. As the world is grappling with the pandemic, with serious health and financial repercussions, a definitive vaccine development will come off as a boon for REGN. With various sponsorships and deals in place, REGN reported a profitable second quarter ended in June 2020. Total revenue increased 24% year-over-year to $1.95 billion, while GAAP net income grew 365% from the year-ago value to $897 million. Apart from COVID treatments, REGN made significant breakthroughs in the development of medicine for major health conditions, such as asthma and cancer in this quarter. The company’s EBIT has grown 55% in the past twelve months, which is higher than 83.7% of the U.S. stocks listed in the StockNews.com universe. REGN has a trailing twelve-month gross margin of 54.8%. The consensus EPS estimate of $7.12 for the quarter ending September 2020 indicates a 6.7% improvement from the same period last year. Moreover, REGN beat the street EPS estimates in each of the trailing four quarters, which bodes well for the stock. The consensus revenue estimate of $2.09 billion for the third quarter indicates a slight increase from the year-ago value. REGN has gained more than 100% since hitting its year-to-date low of $328.13 in January. The stock hit its 52-week high of $664.64 in July. RENG has been accorded a grade of “B” for Peer Grade in our POWR Ratings system. Out of 373 stocks in the Biotech industry, it is ranked #58. Genmab A/S (GMAB) Based in Denmark, GMAB is an international biotechnology company that offers antibody therapeutics for cancer treatment. It currently has two approved antibodies, DARZALEX and Arzerra, and over 20 active pre-clinical programs. With a huge client base in the United States, GMAB witnessed soaring revenues and earnings for the second quarter ended in June 2020. Net revenue rose 604.2% year-over-year to DKK 5.54 billion, while net income grew 387.4% to DKK 3.37 billion. Diluted net result per share increased 370.3% to DKK 51.35 during this period. GMAB has delivered a trailing twelve-month gross profit margin of 100%. GMAB growth momentum is expected to continue well into the third quarter, as the consensus revenue estimate of $237.15 billion indicates a 53.1% improvement year-over-year. Moreover, the company has an impressive earnings surprise history, as it beat the street net result per share estimates in three out of the trailing four quarters. GMAB’s one-year PEG ratio is 0.17, indicating a potentially undervalued stock. With favorable analyst sentiment regarding the future performance of the company, buying the stock now can help investors gain big in the months to come. GMAB has gained more than 135% since hitting its 52-week low of $16.24 in March. The stock hit its 52-week high of $38.57 in September. GMAB is rated a “Strong Buy” in our POWR Ratings system, consistent with its sound business model and growth potential. It has an “A” in Trade Grade, Buy & Hold Grade, and Peer Grade. It is currently ranked #2 out of 373 stocks in the Biotech industry. Horizon Therapeutics Public Limited Company (HZNP) HZNP researches and develops medicines catering to mainly rare and rheumatic diseases. It markets approximately 10 medicines internationally, out of which 6 are used for treating various rare and rheumatic diseases. PEOPLE’s magazine has named it one of the ’50 companies that care’ in 2020. With an increasing focus on the healthcare industry, HZNP has benefitted from the higher capital injections in the industry. It reported record sales growth of 44% year-over-year to $462.80 million in the second quarter ended June 2020. Net sales in the orphan segment grew 87% from the same period last year to $379.30 million, representing 80% of total company sales. Gross profit increased 47.4% from the year-ago value to $341.26 million. It has a trailing twelve-month gross profit margin of 73.4%. HZNP is expected to begin clinical trials for at least 4 drugs in the second half of 2020, which is key in developing an effective treatment for rare diseases. This is expected to bolster revenue and earnings in the third quarter ending September 2020. The consensus EPS estimate of $0.93 indicates a 45.3% growth year-over-year. Also, HZNP beat the street EPS estimates in each of the trailing four quarters, which is impressive. The consensus revenue estimate of $511.14 million indicates a 55% rise from the same period last year. HZNP gained more than 230% to hit its 52-week high of $78.93 in August since hitting its 52-week low of $23.81 in March. It’s no surprise that HZNP is rated a “Strong Buy” in our POWR Ratings system, with a grade of “A” in Trade Grade, Buy & Hold Grade and Peer Grade, and a “B” in Industry Rank. In the 232-stock Medical-Pharmaceuticals industry, HZNP is ranked #6. Bio-Rad Laboratories (BIO) BIO is a life science research and development company operating through two segments – Life Science and Clinical Diagnostics. It produces medical accessories for research and diagnosis across the country and sells through its direct sales team and indirect supply channel of agents, brokers, and distributors. BIO is a major COVID testing company in the United States, with 99% specificity and 98% sensitivity of the antibody test kit. It is the first company to receive an Emergency Use Authorization (EUA) from the FDA. BIO COVID testing kit also met the CE mark requirement for testing in Europe. On June 13th, BIO joined the S&P 500 index GICS Life Sciences Tools & Services sub-industry Index. Though the coronavirus pandemic created some business opportunities for BIO, many of its existing services took a back seat during country-wide testing requirements. As a result, its revenue declined slightly in the second quarter ended in June 2020 from the same period last year. However, the company reported a 61.3% year-over-year increase in its net income to $996.80 million. Diluted EPS rose 61.8% from the year-ago value to $32.15 during this period. Its trailing-twelve-month gross profit margin is 54.9%. With a rising number of coronavirus cases across the United States, along with the second wave of infections in many countries that had previously flattened the curve of infected patients, BIO is expected to thrive in the upcoming months. The consensus EPS estimate of $1.80 for the third quarter ending September indicates an 11.8% increase year-over-year. Also, BIO beat the street the EPS estimates in three out of trailing four quarters, which bodes well for the stock. The consensus revenue estimate of $570.58 million indicates a slight rise from the year-ago value. BIO gained more than 70% to hit its 52-week high of $540.06 in July since hitting a 52-week low of $309.38 in March. BIO’s strong fundamentals are reflected in its POWR Ratings. It is rated a “Strong Buy” with an “A” in Trade Grade and Buy & Hold Grade, and a “B” in Peer Grade and Industry Rank. In the 58-stock Medical- Diagnostics/Research industry, BIO is ranked #4. Want More Great Investing Ideas? 7 Best ETFs for the NEXT Bull Market Is the Stock Market Correction Over? Chart of the Day- See the Stocks Ready to Breakout REGN shares were trading at $582.00 per share on Tuesday afternoon, up $17.80 (+3.15%). Year-to-date, REGN has gained 55.00%, versus a 7.16% rise in the benchmark S&P 500 index during the same period."}]}