{"article": [{"url": "https://stocknews.com/news/gld-pall-plpt-sbsw-plg-amrk-will-platinum-and-palladium-follow-gold-to-new-highs/", "published": 1596456500.0, "headline": "Will Platinum and Palladium Follow Gold to New Highs?", "body": "Gold is one of the big winners so far in 2020. From its low in March, gold has gained 37%, and it’s exceeded its previous, all-time highs set in 2011. The combination of a weakening US dollar and a massive dose of stimulus from fiscal and monetary authorities all over the world, has resulted in investors seeking refuge in the shiny metal. So far, platinum and palladium have had nice rallies off the lows, but they remain below their all-time highs. 7 \"SAFE HAVEN\" Dividend Stocks for Turbulent TimesPalladium is 24% off its all-time high set in January of this year. (source: finviz.com) In contrast, platinum is 57% off its 2008 high of $2,300. (source: finviz.com) Precious Metals Bull Market If there were any doubts about gold being in a bull market, they were removed when it hit a new, all-time high last week. When gold makes new highs, it tends to drive interest and inflows into all the other precious metals, as well. This is evident from the last, major gold bull market from October 2008 to May 2011. During this period, gold went from $700 to $1,900 for a 170% gain. During that time frame, palladium had a 435% gain, while platinum was up 165%. If the gold bull market continues to gain steam, investors will find opportunities in platinum and palladium as well. Platinum and Palladium Fundamentals Platinum is a rare metal that has historically been used as a store of value or jewelry, but it has plenty of industrial applications as well. Its major source of demand is for diesel engines and catalytic converters. Thus, it’s well-positioned for this current moment when industrial metals like copper and iron ore are rising in addition to “store of value” assets like gold. Over the last decade, it’s been the weakest metal within the precious metals sector, as it failed to exceed its 2008 high in 2011, unlike the other precious metals. However, this underperformance has led to decreased production and disinterest among investors. But, these are the exact conditions that can lead to upside gains, when fundamentals do improve. One looming catalyst is many car companies are increasing their use of platinum in engines due to its low price. Platinum is also a component of fuel cell vehicles that are being touted as an alternative to electric vehicles. Historically, palladium was seen as an alternative to platinum, and their prices traded in tandem. However, over the last decade, palladium demand has exploded higher, as it became the preferred metal for catalytic converters for gasoline-powered cars. In 2010, automotive demand for palladium was 168 tons, and in 2019, it was 268 tons. Palladium is more prone to supply pressures, as it’s a byproduct of platinum and nickel mining. Platinum and Palladium ETFs Just like investors can buy gold through using ETFs, like the SPDR Gold Trust (GLD) ETF, they can buy platinum with the Aberdeen Standard Physical Platinum Shares ETF (PLPT) and palladium with the Aberdeen Standard Physical Palladium Shares ETF (PALL). Platinum and Palladium Stocks Here are three stocks that will give investors exposure to platinum and palladium: A-Mark Precious Metals (AMRK), Platinum Group Metals (PLG), and Sibanye-Stillwater (SBSW). A-Mark Precious Metals (AMRK) AMRK is a brokerage that wholesales different grades and types of precious metals and sells them to commercial and individual customers. During periods of rising prices, it sees increased demands and higher spreads. The stock has tripled off the March lows and its recent earnings report showed a 158% increase in gross profit. In addition, margins increased from 0.69% of revenue to 1.79%. The company said it was dealing with unprecedented amounts of demand due to the macroeconomic environment, however, there were supply constraints which it expects to be ironed out by the fourth quarter. AMRK is rated a Strong Buy by the POWR Ratings. It has an “A” for Trade Grade, Buy & Hold Grade, and Peer Grade. Among Investment Brokerages, it’s ranked #1 out of 27. Platinum Group Metals (PLG) PLG is an exploration and development company specializing with projects in South Africa and Canada. It’s currently focused on beginning production at one project and has another JV project in development. It’s an early-stage company, so there’s a high level of risk. However, some prominent funds and individuals have significant stakes including Eric Sprott, Franklin Resources, and Liberty. Since the March low, shares have gained more than 100% on increasing platinum prices. According to the POWR Ratings, PLG is rated a Buy. It has an “A” for Trade Grade and a “B” for Peer Grade and Industry Rank. Among Industrial – Metals stocks, it’s ranked #12 out of 33. Sibanye Stillwater (SBSW) SBSW is a South African-based mining company that is the world’s largest producer of platinum. In 2020, the company expects to produce between 1.7 million and 1.85 million ounces of platinum. This means that SBSW accounts for just under 30% of the world’s entire annual platinum production. Currently, SBSW has a forward price to earnings ratio of 12 which is almost 50% lower than other precious metals miners. The stock has gained 175% off the March lows and is 20% off its all-time high. During platinum’s bear market, SBSW has gotten bigger and bought many smaller competitors, so it’s in a good position to make new highs if platinum prices start catching up to gold and palladium. Want More Great Investing Ideas? 9 “BUY THE DIP” Growth Stocks for 2020 How HIGH Can This Tech Bubble Fly? 7 “Safe-Haven” Dividend Stocks for Turbulent Times GLD shares were trading at $185.44 per share on Monday afternoon, up $0.01 (+0.01%). Year-to-date, GLD has gained 29.77%, versus a 3.26% rise in the benchmark S&P 500 index during the same period."}]}