{"article": [{"url": "https://stocknews.com/news/amd-intc-tsm-why-is-advanced-mirco-devices-surging-16/", "published": 1595592500.0, "headline": "Why Advanced Micro Devices is SURGING 16%", "body": "The world’s second largest semiconductor company is down over 16% today. Intel (INTC) reported earnings last night that outperformed estimates but it stated that it was six months behind schedule in developing the 7-nanometer chip technology. The company was even considering outsourcing the work, which is unheard of for INTC. The company’s rivals, Advanced Micro Devices (AMD) and Taiwan Semiconductors (TSM) are both gaining on the news. AMD is up 16%, while TSM has gained 9% INTC reported adjusted earnings per share of $1.23 on revenue of $19.7 billion, compared with estimates of $1.11 per share on $18.55 billion. This is up 16% from the same period last year. The company also provided its outlook for the full year of 2020, with an adjusted EPS of $4.85 on revenue of $75 billion. Those figures are also ahead of analyst estimates of $4.81 per share on revenue of $73.86 billion. Normally, this would have been positive news for the company. 7 \"SAFE HAVEN\" Dividend Stocks for Turbulent TimesWhile INTC is accelerating its transition to 10-nanometer processors for computers and servers, it has fallen behind on its plan for 7-nanometer chips. For reference, the circuit widths on chips are measured in nanometers, one-billionth of a meter. Smaller circuits lead to faster, more power-efficient processors. Not only is INTC behind in the development of the chips, but the company is also considering hiring a third-party manufacturer to make them. Outsourcing manufacturing has become a norm in the industry, but for decades INTC has both designed chips and produced them in-house. The company was even considering manufacturing chips for other companies. The idea that another company would outsource them would take away INTC’s competitive advantage. It could also lower the chips’ efficiency if INTC did not ensure that the chips were manufactured exactly as they were designed. The news contributed to Dow Jones Industrial Average being down for the day. It also resulted in the company being downgraded by Deutsche Bank, Bernstein, Roth Capital, and Barclays. INTC lost almost $43 billion in market valuation due to the news, while boosting its competitors. TSM is ahead in the race to make smaller process nodes for chips. It is currently producing chips at a scale of 5 nanometers. The company focuses on production and leaves design for other companies. Its manufacturing capabilities have even passed INTC. One of the company’s main customers is INTC’s chief rival, AMD. TSM’s manufacturing capabilities have helped AMD catch up to INTC in terms of performance. INTC may even ask TSM to make chips for them, but the company would likely face headwinds due to potential capacity issues at TSM and complaints from TSM’s current customers, aka AMD. AMD has been benefiting from the increase in PC orders due to the work-from-home trend. The company has also become a significant player in the graphics processing industry. The boost from last night’s news will only add to their place in our POWR Ratings system. Before news broke, AMD was already a Strong Buy in the POWR Ratings with grades of A across the board. They are currently the #7 ranked stocks in the Semiconductor & Wireless Chip Industry. Want More Great Investing Ideas? 9 “BUY THE DIP” Growth Stocks for 2020 Newly REVISED 2020 Stock Market Outlook 7 “Safe-Haven” Dividend Stocks for Turbulent Times AMD shares were trading at $69.64 per share on Friday afternoon, up $10.07 (+16.90%). Year-to-date, AMD has gained 51.85%, versus a 0.61% rise in the benchmark S&P 500 index during the same period."}]}