{"article": [{"url": "https://stocknews.com/news/hlt-htht-ihg-wh-stay-5-top-hotel-stocks-with-buy-ratings/", "published": 1599653300.0, "headline": "5 Top Hotel Stocks with \"Buy Ratings\"", "body": "The coronavirus has wrecked the hotel industry. However, some are betting that the world is getting back to normal quicker than anticipated. In the short-ter, there’s been modest improvement in terms of week-to-week and month-to-month travel data showing people are more willing to travel. In the long-term, hotels with large balance sheets and strong brands will be able to survive this rough period. Many smaller and weaker hotels won’t. This will lead to gains in market share and expansion opportunities for certain high-quality names. We can use the POWR Ratings to find hotel stocks with a Buy rating to get a shortlist of candidates. This just might be the perfect time to selectively invest in hotel stocks as their prices are fairly low at the current moment. Let’s take a look at four Buy-rated hotel stocks: Hilton Worldwide Holdings (HLT), Huazhu Group Limited (HTHT), Intercontinental Hotels Group (IHG), Wyndham Hotels (WH), and Extended Stay America (STAY). Hilton Worldwide Holdings (HLT) Just about everyone enjoys staying at Hilton Hotels. This company has been in business for more than a century, providing comfy hotel and resort accommodations across the world. HLT has more than a quarter-million rooms in development outside of the United States alone. The POWR Ratings reveal HLT has B grades in the POWR Components of Trade Grade and Peer Grade. HLT also has solid grades in the remaining POWR Components. Furthermore, HLT is ranked first of 14 stocks in the Travel – Hotels/Resorts category. 9 \"BUY THE DIP\" Growth Stocks For 2020HLT is gradually moving back toward its pre-COVID trading levels. If the economy gradually reopens, HLT should continue making steady progress back toward the $100 level and beyond. At the moment, HLT has more than 96% of its hotels reopened. Though the vacancy rate is down, this figure will inevitably increase in the months to come, possibly propelling HLT toward triple digits. Huazhu Group Limited (HTHT) China has handled the coronavirus pandemic particularly well. There are few positive tests in China and the country’s economy has returned to at least a semblance of normalcy in a reasonable amount of time. As a result, the likes of HTHT have befitted. This economy hotel chain is centered on a lease-and-operate strategy in which the company operates its locations typically positioned in the busiest sections of major cities. The POWR Ratings show HTHT has POWR Component grades of As across the board but for its Industry Rank grade of B. HTHT is ranked fourth of 115 stocks in the China category. The average analyst price target for HTHT is $48.50, indicating the stock has around 10% upside. China’s exemplary handling of the virus has helped HTHT move beyond its pre-COVID price of $35. Look for HTHT to reach new heights as long as the virus is held in check. Intercontinental Hotels Group (IHG) If you are like most people, you enjoy your stay at Holiday Inns, Crowne Plaza Hotels and Resorts, and Intercontinental Hotels and Resorts. IHG provides information and reservations for each of these hotels. The POWR Ratings show IGH has an A grade in the Trade Grade and Peer Grade Components. IHG also has a B Buy & Hold Grade POWR Component. Furthermore, IHG has a #2 ranking of 14 stocks in the Travel – Hotels/Resorts category. IHG has gradually moved back toward its pre-COVID trading price of $65 with each passing month. IHG has boosted its aggregate number of rooms more than 2% each year since ’14, helping revenue spike 20% over this period. Though the current year is a throw-away due to the virus, IHG is undoubtedly a long-term keeper. Wyndham Hotels (WH) The beauty of diversifying operations across the globe is if the coronavirus is particularly prevalent in one region, it will not completely zap revenue. Such is the case with the well-diversified WH. WH has hotels and resorts throughout the UK, Canada, Germany, Mexico, the United States, and numerous other countries. The POWR Ratings show WH has A grades in its Trade Grade and Peer Grade POWR Components. WH is ranked in the top 5 of 14 publicly traded companies in the Travel – Hotels/Resorts category. The analysts insist WH will be fairly priced at $56.33, meaning it has nearly 7% upside. WH plans on opening debut locations in both Bhutan and Nepal soon, expanding its scope all the more. Look for WH to move back to its pre-COVID price level of $55 to $65 before year’s end assuming the pandemic does not worsen. Extended Stay America (STAY) Extended stay hotels will undoubtedly prove that much more popular as more Americans are evicted and foreclosed upon. STAY will benefit from this phenomenon. All in all, STAY manages properties spanning nearly 600 hotels and 60,000+ rooms throughout the country. The STAY POWR Ratings are highlighted by B grades in the Trade Grade, Buy & Hold Grade, and Peer Grade POWR Components. STAY is ranked in the top half of all Travel – Hotels/Resorts stocks. The analysts have set an average price target of $14.31 for STAY, indicating it has the potential to increase by nearly 15%. Buy and hold this highly-rated hotel stock through the remainder of the pandemic and you will likely be quite happy with your return. Want More Great Investing Ideas? 7 Best ETFs for the NEXT Bull Market Will Stocks Fall into Historical September Slump? 9 “BUY THE DIP” Growth Stocks for 2020 HLT shares were trading at $91.11 per share on Wednesday morning, down $0.79 (-0.86%). Year-to-date, HLT has declined -17.73%, versus a 6.62% rise in the benchmark S&P 500 index during the same period."}]}