{"article": [{"url": "https://stocknews.com/news/spy-strategies-for-a-high-volatility-market/", "published": 1596197300.0, "headline": "Strategies for a Highly Volatile Market", "body": "While volatility is based on the VIX, it has retreated by half since the March lows. It still stands at a robust 25% or well above the 20-year mean of 16. And implied volatility in individual names, especially those being buffeted by headline news ranging from COVID shut-down/open up confusion to political maneuvering ahead of the election, are sporting their highest volatility level in years. One of my favorite options strategies in the Options360 Service during high volatility or markets with big swings is the options credit spread. In an option credit spread, one sells short an option, either a put or call or some combination such as a spread, in which premium is collected and the position benefits from time decay. The maximum profit is the amount of premium collected and would be realized at expiration if the options expire worthless. The attraction of credit spreads, especially in a high volatility environment, is that you don’t need to necessarily be right about the direction of a stock movement to profit. The fat premiums supply an extra cushion to collect income just by taking a stand. A stock will hold a certain level; often well below the current price. 7 \"SAFE HAVEN\" Dividend Stocks for Turbulent TimesFor example, shares of “Advanced Micro Devices (AMD)” have run up some 30% in the past month and I’m reluctant to be a buyer here at the $76 level. But I’d feel comfortable they won’t retreat back below $60 anytime soon. With implied volatility at a heightened level, I can sell the September $60/55 put spread for an $0.80 credit. As you can see, as long as shares of AMD stay above $60 for the next 6 weeks until the September expiration I keep the $0.80 or $80 of premium An important point to be aware of is that the risk/reward of a credit position is asymmetrical; that is if you short a call it can go to a trillion or more, and if you short a put the loss is limited by the stock going to zero. That said, even if you use a credit spread — which has a limited risk because it consists of selling a closer-to-the-money option (one with a higher price) while simultaneously buying a lower-cost option further out of the money — you can still benefit from establishing an exit strategy. The 75% Solution My first rule of thumb is that when a credit or short sale position has reached 75% of its maximum profit, it’s time to close the position. So if you sell a call for $2.00, I’d look to buy it back once its value hits $0.50 a contract.Time Is MoneyThis is not to ignore that one of the reasons for selling options and collecting premium is to get time decay, or theta, working on your side. I’d also suggest combining the 75% rule with a sliding scale of time remaining until expiration — such as if the value of the short option slips below a certain profit level relative to the number of weeks remaining until expiration. For example, if there are three weeks remaining and you have made 50% of the maximum profit, or there are two weeks remaining and you can secure 60%-65% of the maximum profit, then close the position, take your profits, and move on to the next opportunity.There were long periods of low volatility, such as most of 2108 and the early part of 2019 in which the Options360 service rarely employed credit spread strategies simply because volatility and the associated premiums were too low. But, in late 2019, and now since March 2020, they have become a mainstay choice for the Option360 Portfolio. I imagine this will remain a go-to strategy heading up and through the election this year. Click here to find out more about Steve’s profitable and unique Options360 service. Want More Great Investing Ideas? 9 “BUY THE DIP” Growth Stocks for 2020 How HIGH Can This Tech Bubble Fly? 7 “Safe-Haven” Dividend Stocks for Turbulent Times SPY shares were trading at $322.68 per share on Friday afternoon, down $1.28 (-0.40%). Year-to-date, SPY has gained 1.29%, versus a % rise in the benchmark S&P 500 index during the same period."}]}