{"article": [{"url": "https://stocknews.com/news/kl-au-agi-gdx-3-undervalued-gold-miners-to-buy-on-dips/", "published": 1596197300.0, "headline": "3 UNDERVALUED Gold Miners to Buy on Dips", "body": "It’s been an outstanding start to the year for the Gold Miners Index (GDX), and the ETF is now the 5th best performing sector year-to-date. While there was previously some anxiety about owning the miners given that we saw stunted production numbers related to government-mandated shutdowns, the gold price (GLD) has risen nearly 15% in the same period, more than offsetting any lost production. In fact, it’s even more bullish that this gold didn’t get sold in the quarter as it can now be sold 15% higher a quarter later. However, the Gold Miners Index remains a little overbought short-term as does gold, and this is why it’s imperative to hunt down the names that are still relatively undervalued vs. those that are now closer to fair value. This article will discuss a few miners to put on one’s shopping list if we see a correction in Q3. 7 \"SAFE HAVEN\" Dividend Stocks for Turbulent Times (Source: Agnico Eagle Company Presentation) As I’ve noted in previous updates, the three main things I look for when it comes to which miners I want to own are relative valuation, margins, and earnings growth. In the case of Alamos Gold (AGI), Kirkland Lake Gold (KL), and AngloGold Ashanti (AU), all three meet these criteria, even if they all have very different production profiles. Let’s take a closer look at the three companies below: (Source: YCharts.com, Author’s Chart) Beginning with Kirkland Lake Gold, the company has had the best earnings trend in the sector for years and managed to grow annual EPS by 2400% from $0.08 in FY-2015 to $2.70 in FY-2019. If we look ahead to FY-2020 estimates, earnings are expected to grow by 24% to $3.35, a material deceleration from prior quarters. However, the company is coming up against two headwinds this year, with one being a higher share count related to an acquisition that closed in January. The other is a temporary shutdown at two of the company’s Canadian operations. Therefore, the fact that the company is expected to grow annual EPS 24% year-over-year after lapping a year of triple-digit-growth and despite headwinds is quite impressive. It’s the valuation here that is the most compelling with KL trading at less than 14x FY-2021 annual EPS estimates of $3.78 at $50.00 per share. This is one of the lowest forward P/E multiples in the sector currently, and the disconnect makes little sense given that Kirkland Lake Gold is one of the largest producers operating out of the top-ranked jurisdictions (Ontario, Quebec, and Australia). Therefore, while the stock has had a nice run the past few weeks, I believe any weakness will be a buying opportunity. Ultimately, I continue to maintain my price target of $62.00 within the next 12 months. (Source: YCharts.com, Author’s Chart) Moving over to AngloGold Ashanti, it’s been a tough week for the stock as Monday’s gains were erased after news the CEO was retiring. While this spooked some investors, I don’t see this news as material. This is because the decision to retire from AngloGold was to spend more time with family, which has been impossible since the CEO’s family lives in Canada, and travel to South Africa and Australia have become much more difficult following COVID-19. Recent news aside, the company has one of the strongest earnings trends in the sector, with FY-2020 annual EPS expected to hit a new all-time high at $2.31 with 29% growth after lapping a year of triple-digit growth in FY-2019. Generally, the best-performing stocks in the market are those consistently growing annual EPS by 17% on an annual basis, and AngloGold Ashanti certainly fits this bill based on FY-2020 and FY-2021 estimates. Therefore, I believe the recent weakness tied to the CEO departure has created a buying opportunity, and any weakness below $30.00 would be a low-risk area to start a position. (Source: YCharts.com, Author’s Chart) Finally, Alamos Gold is a much smaller gold producer than the previous two, but it makes up for this with its industry-leading earnings growth. As we can see above, Alamos Gold managed to grow annual EPS by over 300% last year ($0.05 to $0.21) and is expected to nearly double yearly EPS again this year based on estimates of $0.40. This makes Alamos Gold one of the only companies in the sector with back-to-back triple-digit earnings growth. The catalyst for this is the transition from heavy spending to expanding current projects to a cash-flow phase, set to begin in Q4 2020. Therefore, while Alamos Gold might look expensive to the uninitiated at $10.40 based on trailing annual EPS of $0.20, this valuation multiple is distorted if one is unaware of the future growth. While 50x earnings is undoubtedly an expensive valuation on a trailing-twelve-month basis, 16x forward earnings is dirt-cheap for a company set to grow annual EPS nearly 100% this year. Therefore, I believe any dips below $10.00 will provide a low-risk buying opportunity going forward. While there are over 50 miners in the Gold Miners Index to choose from, the key to outperforming the sector is to find the mispriced companies with the best projects and scoop them up when others are busy chasing momentum. While AGI, AU, and KL have gained considerable ground since their recent pullbacks in Q2, they remain the best of breed names in the sector, and I would expect any weakness to be a buying opportunity. Therefore, for those looking for stocks to add exposure to in the gold sector, these three all look like they have significant long-term upside as long as investors are patient and buy them on dips. Disclosure: I am long GLD, AGI, KL, AU Disclaimer: Taylor Dart is not a Registered Investment Advisor or Financial Planner. This writing is for informational purposes only. It does not constitute an offer to sell, a solicitation to buy, or a recommendation regarding any securities transaction. The information contained in this writing should not be construed as financial or investment advice on any subject matter. Taylor Dart expressly disclaims all liability in respect to actions taken based on any or all of the information on this writing. Want More Great Investing Ideas? 9 “BUY THE DIP” Growth Stocks for 2020 How HIGH Can This Tech Bubble Fly? 7 “Safe-Haven” Dividend Stocks for Turbulent Times KL shares were trading at $52.43 per share on Friday morning, up $1.69 (+3.33%). Year-to-date, KL has gained 19.82%, versus a 1.93% rise in the benchmark S&P 500 index during the same period."}]}