{"article": [{"url": "https://stocknews.com/news/sq-adbe-ldos-qrvo-4-tech-stocks-to-weather-any-economic-storm/", "published": 1594901300.0, "headline": "4 Tech Stocks to Weather any \"Economic Storm\"", "body": "Though the market has shown resilience in the past few months, it’s hard to predict with any accuracy where the stock market will be in 6 months, due to the Covid-19 crisis. For investors, it’s a challenging time. Luckily, you can find stocks whose growth and operations are not affected by economic conditions. Technology is particularly interesting since trends are less sensitive to cyclical factors. For example, smartphone adoption grew rapidly over the last decade despite lackluster growth. 7 Best ETFs for the NEXT Bull MarketThis is why now is a good time to focus your attention on strong tech stocks that are industry stalwarts, providing consistent returns even if the economy slides. Here are four tech stocks that would make fine additions to any portfolio: Square (SQ) Small and medium-sized businesses are now turning to the internet to sell their products. SQ makes it easy for businesses to do just that. SQ’s solutions are also quite appealing to large businesses as well. SQ’s gross purchasing volume from large businesses is up nearly 35% on a year-over-year basis. All in all, more than half of SQ’s gross purchasing volume is attributed to business from large sellers. This is precisely why Wall Street analysts believe SQ sales will triple between ’18 and ’22, hitting nearly $5 billion. SQ does more than help businesses set up online payment systems. SQ also provides everyday people with a quick and easy means of transferring cash through its Cash App system. SQ’s POWR Ratings are quite complementary: A POWR Component grades in every category but for Industry Rank in which the company has a B grade. SQ is ranked third of 137 stocks in the Financial Services (Enterprise) space. Adobe (ADBE) Most people are aware of ADBE as the company behind PDF files and Photoshop. However, ADBE has a number of tools and products for companies that are growing at double-digit rates. These products have become integral to how corporations do their work which makes them recession-proof. These are also made available via subscriptions, so there’s recurring revenue. These are used to help businesses and professionals develop websites, customize web experiences, and manage digital marketing campaigns. The onset of the pandemic certainly bodes well for ADBE’s cloud-based tools. The POWR Ratings show ADBE has As in every POWR Component. ADBE is ranked second of 82 stocks in the Software – Application segment. Out of 22 analysts who have reviewed ADBE, 16 rate it as a Buy, 6 rate it as a hold and none recommend selling. Leidos (LDOS) LDOS is a company that was created to to assist the federal government with complex tech challenges. LDOS has morphed from a government creation into an intelligence and defense private sector superstar. LDOS will likely play a critical role in the newly-created Space Force. Government contracts are less economically sensitive than other factors like consumer spending and business spending. The POWR Ratings show LDOS has a respectable Buy & Hold Grade along with an above-average Industry Rank. LDOS is ranked in the top 10 of 14 Outsourcing – Tech Services stocks. The average analyst price target for LDOS is $118.22, which is 34% above current prices. LDOS is currently trading at a forward P/E ratio of 16.44, indicating it has a fantastic value at its current price of $88. Qorvo (QRVO) The arrival of 5G will buoy a litany of stocks including QRVO. QRVO’s radio-frequency solutions are used in IoT and smartphone devices. Perhaps most important is the fact that QRVO’s RF tech is used in the Apple iPhone. In other words, QRVO will soon see a considerable increase in orders. With an average analyst price target of $122.50, QRVO has around 10% upside before it is priced where it should be. The POWR Ratings show QRVO has A POWR Component Grades in both the Trade Grade and Industry Rank categories. The stock is ranked in the top half of the uber-competitive Semiconductor & Wireless Chip category. QRVO stands a good chance of reaching its 52-week high of $122.37 as the year rounds out. Want More Great Investing Ideas? 9 “BUY THE DIP” Growth Stocks for 2020 Top 5 WINNING Stock Chart Patterns 7 “Safe-Haven” Dividend Stocks for Turbulent Times SQ shares were trading at $122.02 per share on Thursday morning, down $0.18 (-0.15%). Year-to-date, SQ has gained 95.04%, versus a 0.51% rise in the benchmark S&P 500 index during the same period."}]}