{"article": [{"url": "https://stocknews.com/news/pff-aapl-tsla-cnp-ms-ldp-3-pullback-proof-preferred-payouts-averaging-7-4/", "published": 1599739700.0, "headline": "3 Pullback-Proof “Preferred” Payouts Averaging 7.4%", "body": "Is this a quick (buyable) blip? Or the next bear market? While the Wall Street suits guess away, we can do better than the buy and hope crowd. After all, why hope when we can secure our retirement with sustainable cash flows? I’m talking about yields of 6%, 7% or even 8% or more that barely blink when the markets melt down. These investments are easy to buy. In fact, we purchase them just as we would a mere “common” stock. But here, we’re looking past the obvious to purchase these preferred payouts (yielding 7.4% on average, we’ll talk tickers in a moment). 7 \"SAFE HAVEN\" Dividend Stocks for Turbulent TimesThe Power of Preferreds “First-level” investors typically deal with just one kind of stock: common shares. If you buy into a company such as Apple (AAPL) or Tesla (TSLA), those tickers—AAPL and TSLA—represent their common stock. Those shares provide you with (microscopic) ownership in the company, typically some sort of voting rights and, in some cases, a dividend. But occasionally, to raise cash, companies offer up another kind of stock, called preferred stock. They share some elements of common stock but also have a few things in common with bonds. Preferreds trade on an exchange, like stocks. They’re actually known for paying sky-high dividends—and those dividends can’t be cut unless the company first hacks common shares’ payouts, hence their “preferred” status. The result is a source of income that’s typically more generous than junk bonds that, in most circumstances, trades in a cool, calm and orderly manner. Take the past week, for instance—preferreds held their losses within a couple of percentage points, while the NASDAQ dropped more than 10%! Preferred Stocks Held Up Better Than Broader Market They’re not flawless, of course. Because preferreds trade like bonds, it’s difficult to squeeze double-digit returns out of them, especially if you rely on index trackers such as the iShares Preferred and Income Securities ETF (PFF). Also, preferred stocks will trade calmly most of the time, but they can still suffer sharp drops during once-in-a-generation market swings. PFF Wasn’t Immune to 2020’s Panic That’s why I “prefer” to get my exposure to preferreds from closed-end funds (CEFs). The active managers running these funds can identify mispricings that index funds simply can’t, and they can use leverage to squeeze higher yields and better performance out of this otherwise sleepy asset. Let chat about three preferred dividend funds yielding 7.4% on average. Nuveen Preferred & Income Term Fund (JPI) Distribution Rate: 6.8% The Nuveen Preferred & Income Term Fund (JPI) offers up some of the basics we’re looking for in a preferred-stock CEF: A high yield of nearly 7%, A diversified portfolio of mostly investment-grade preferreds, Monthly dividends, and A slight 1.4% discount to NAV, meaning that you’re buying JPI’s assets for about 99 cents on the dollar. Diversification is a strong suit here. JPI is typical in that most of its preferreds are from financial stocks (think: banks and insurers). But well more than a third of the 176-stock portfolio is in international preferreds. Nuveen Preferred & Income Term’s investment mix–67% in BBB (the lowest level of investment-grade) and 26% in BB (the highest level of junk)–allows it to offer ample yield without stretching for truly low-quality preferreds. That yield also is helped by high debt leverage of about 31%. The result? JPI can be a lot jumpier than preferred index funds, but the long-term performance speaks for itself. What Skilled Active Managers Can Do With Preferreds JPI could be cheaper: Its discount is actually less robust than its five-year average, which sits around 3%. But the biggest hang-up for new money is its limited timespan. The “Term” in the fund name refers to the fact that on or before Aug. 31, 2024, JPI can terminate the fund. That’s not as ominous as it sounds—shareholders would receive cash equal to the fund’s NAV at the time. But some funds tend to deleverage close to the termination date, which weighs on returns, and if you’re looking for retirement income, you might not want to hold a fund that you’ll have to change out in four years. John Hancock Preferred Income Fund II (HPF) Distribution Rate: 8.2% John Hancock has cornered the market for high-yield preferreds. In fact, data provider CEF Connect says the four highest-yielding preferred CEFs currently are John Hancock products. No. 2 is John Hancock Preferred Income Fund II (HPF) at a massive 8.2% yield. Like JPI, HPF’s 115-portfolio is mostly built on preferred stocks on the fringes of investment-grade. However, John Hancock’s fund leans more heavily on BB debt (43%) and less on BBB (46%) than Nuveen’s. It’s also far more domestic in nature; 95% of its holdings are from U.S. firms such as CenterPoint Energy (CNP) and Morgan Stanley (MS). While HPF’s returns since inception are commendable, thanks again to high leverage of about 38%, management has really struggled with this downturn. HPF Has a Lot Less Spring in Its Step CEFs usually will be a bumpier ride than index funds. But this wide performance gap in such a short time is concerning. Cohen & Steers Limited Duration Preferred and Income Fund (LDP) Distribution Rate: 7.2% Cohen & Steers has made its name on its excellence in real estate investing management, but it has a noteworthy preferred-stock product on its hands in the Cohen & Steers Limited Duration Preferred and Income Fund (LDP). LDP: Management Makes the Difference LDP’s 7%-plus yield is pretty standard for a preferred closed-end fund, but there’s more here than meets the eye. That’s because this is a “limited duration” fund—the CEF’s average duration is typically just six years or less. Just like you’d buy short-term bonds to avoid interest-rate risk, Cohen & Steers Limited Duration Preferred and Income Fund is a way to buy preferred stocks while fending off the Fed. That’s not exactly a strength given that Jerome Powell has sent interest rates to near-zero and likely won’t change that anytime soon. But that makes its outperformance in recent years all the more impressive. Want More Great Investing Ideas? Your Early Retirement Portfolio: 7.7% Dividends—Every Month—Forever How to Retire on 10% Dividends Paid Monthly The Simple (and Safe) Way to Earn 15% Every Year from Stocks PFF shares were trading at $36.39 per share on Thursday afternoon, up $0.12 (+0.33%). Year-to-date, PFF has gained 0.52%, versus a 6.17% rise in the benchmark S&P 500 index during the same period."}]}