{"article": [{"url": "https://stocknews.com/news/iipr-mj-acb-gwph-cannabis-stock-weekly-recap/", "published": 1596802100.0, "headline": "Cannabis Stock Weekly Recap", "body": "This was a difficult week for cannabis investors as the ETFMJ Alternative Harvest ETF (MJ) closed the week down 3% and the Horizons Marijuana Life Sciences Index ETF (TSE:HMMJ) was down 6%. Amidst the doom and gloom, Innovative Industrial Properties (IIPR) and Trulieve (OTC:TCNNF) shined as both stocks rose for the week. Here are some highlights from the cannabis industry in the past five days: 9 \"BUY THE DIP\" Growth Stocks For 2020IIPR Posts Strong Earnings IIPR reported strong Q2 earnings on Wednesday. Despite a challenging environment for cannabis, IIPR clearly has been weathering the storm. The company reported revenue of $24.3 million, which was a 183% increase. Its net income for the quarter was $13 million, a 322% increase from the prior year. IIPR has performed well, while other companies in the industry have struggled, due to the coronavirus pandemic. The company is also able to provide struggling cannabis companies with capital through their acquisition and sale-leaseback agreement. This should bode well for the long term as it will be able to acquire more properties at potentially discounted valuations. ACB Continues to Lose Steam As the cannabis sector remains in a downtrend, Aurora Cannabis (ACB) continues to lose steam and is heading back to single digits. Earlier in the week, ACB briefly dropped below $10 before recovering. If the stock can’t find any support soon, and no new CEO is announced, there could be plenty more downside in store for the company. GW Pharmaceuticals Reports Earnings GW Pharmaceuticals (GWPH) posted modest earnings in Q2 as revenues increased 68% to $121.3 million. The stock finished Friday down 17.2% as investors were not pleased with the results. The company reported -$0.02 EPS, which reflected a net loss of $8.8 million for the quarter. Earlier in the week, GWPH did announce some positive news. It announced that the FDA had approved Epidiolex Oral Solution to treat seizures associated with Tuberous Sclerosis Complex. The age range for all Epidiolex treatment will be expanded to include patients one year and older. This is the third approval for Epidiolex, which is the first and only FDA-approved cannabidiol (CBD) medicine. Want More Great Investing Ideas? 9 “BUY THE DIP” Growth Stocks for 2020 How to Trade THIS Stock Bubble? 7 “Safe-Haven” Dividend Stocks for Turbulent Times IIPR shares were unchanged in after-hours trading Friday. Year-to-date, IIPR has gained 54.82%, versus a 5.02% rise in the benchmark S&P 500 index during the same period."}]}