{"article": [{"url": "https://stocknews.com/news/acb-6-key-factors-ahead-of-aurora-cannabis-earnings/", "published": 1598357300.0, "headline": "6 Key Factors Ahead of Aurora Cannabis Earnings", "body": "Aurora Cannabis (ACB), which is down 64% year to date, has experienced one of its most challenging years in its history. The company has posted two straight quarters of negative earnings and has consistently seen negative operating income. The company will likely report its third quarter financial results next month. If the company has any hope of turning things around, its needs to show improvements in the following areas. SG&A Expenses Selling, general and administrative expense (SG&A), which is reported on the income statement, is the sum of all direct and indirect selling expenses and all general and administrative expenses. It includes all costs not directly tied to making a product or performing a service. The company’s SH&A, or cash burn, has been trending upwards over the past few years. The company spent $66 million last quarter, $88 million the previous quarter, and $78 million in quarter before that. With revenue of only $56 million, $41 million, and $55 million during those quarters, there is a reason why investors are sour on the company. The company needs to lower this figure going forward. 9 \"BUY THE DIP\" Growth Stocks For 2020Margin and Production Costs Gross margin is the difference between revenue and cost of goods sold divided by revenue. It is essentially the sales revenue a company holds onto after incurring the direct costs associated with producing the goods it sells. ACB had a gross margin of 71.11 on October 1st, and that figure has trended down since. While the company has been able to produce dried flower for under $1 per gram, the decreasing gross margin reflects ACB being aggressive on price to gain market share. That may help increase revenue, but it harms its gross margin. The company needs to increase its margins going forward to help it reach profitability. Recreational and Medical Sales In the previous quarter, ACB saw its revenue increase from $41 million to $56 million due to consumers stocking up on products due to the lockdown. The problem with ACB is that the company’s revenue growth has not been consistent. The company’s competitors have shown weak revenue growth, which is a concern for ACB ahead of its next earnings update. The company needs to show solid sales growth to excite its investors. EBITDA The company has promised investors that it would achieve positive EBITDA by the first quarter of fiscal 2021. EBITDA is earnings before interest, taxes, depreciation, and amortization. In its most recent financial results, the company reported an EBITDA loss of $65.61 million. If the company can improve on that figure, it is a positive sign for investors in the hope that the company can achieve positive EBITDA by its stated goal. Management One factor that has plagued the company for months now has been management, or a lack of one. The company promised investors a new permanent CEO would be announced “in the next few months”, but no news as of yet. If ACB can appoint a permanent CEO in place of Micheal Singer this quarter, investors might have some reason for optimism, but if ACB continues to drag its feet, it’s not a positive sign. Debt Goodwill is an intangible asset that is associated with the purchase of one company by another. ACB had goodwill of $2.2 billion as of its most recent quarter. This is due to its Danish and South American assets. The company had total assets of $3.4 billion as of the same quarter. Goodwill is taking up way too much of ACB’s assets. The company will eventually have to write down this goodwill, negatively affecting its bottom line. Overall, I expect weak numbers from ACB this upcoming quarter. If the company can somehow manage to stay on track with their business initiatives and deliver strong results, it has a chance to achieve positive EBITDA by its stated goal. The stock remains highly speculative and offers plenty of downside if the news is negative, which is why I think investors might want to sit on the sidelines for now, until after the next financial results are announced. (Disclosure: The author is long ACB) Want More Great Investing Ideas? The Best of StockNews 2 Step Process to Sell @ Market Top in September 9 “BUY THE DIP” Growth Stocks for 2020 ACB shares were trading at $9.37 per share on Tuesday afternoon, down $0.14 (-1.47%). Year-to-date, ACB has declined -63.85%, versus a 7.58% rise in the benchmark S&P 500 index during the same period."}]}