{"article": [{"url": "https://stocknews.com/news/zg-cvna-chwy-w-se-z-5-stocks-with-a-high-short-interest-trading-at-all-time/", "published": 1596802100.0, "headline": "5 Stocks With a High Short Interest, Trading at All-Time Highs", "body": "Technology stocks are leading the pack in 2020, several are up more than 50% year-to-date and hitting new, all-time highs. Among these big winners, there are some with high short interest. Investors take short positions in assets when they believe prices are overvalued relative to fundamentals or anticipate that a catalyst will lead to selling. During bullish market environments, many traders will target stocks with heavy short interest to manufacture a “short squeeze”. A short squeeze is when rising prices force shorts to cover to limit losses, avoid margin calls, or reduce exposure. This buying causes prices to rise even more which results in more shorts being forced to cover. 9 \"BUY THE DIP\" Growth Stocks For 2020Zillow Group (Z), Chewy Inc. (CHWY), Wayfair Inc. (W), Carvana Co. (CVNA), and Sea Ltd. (SE) are five stocks, with huge short interests, that made new, all-time highs in the past week. Given the massive rallies in these stocks, most of the shorts are sitting on losses. This makes them a target for a short squeeze. If shares keep moving higher, they will be forced to buy at even higher prices which will add more fuel to their gains. Zillow Group (ZG) Yesterday, ZG reported outstanding second-quarter results with better than expected top and bottom-line. Additionally, the company’s forecasts were better than expected. As a result, the stock gapped up to new, all-time highs. 21% of ZG’s float is short. Based on the stock’s average volume, it would take 7 days for shorts to cover. It’s likely that shorts were among the buyers pushing the stock higher. Zillow’s trajectory is likely to continue higher, as it is at the intersection of “platform” stocks and real estate, both of which are in powerful bull markets. Along with Redfin (RDFN), ZG is quickly becoming the premier real estate platform. Its growth has accelerated due to the coronavirus which has led to people virtually touring homes. In total, the real estate brokerage industry generates $160 billion in revenue annually. There are many adjacent services related to real estate as well. ZG is positioned to capture pieces of this revenue. Already, it’s functioning as a lead-generation service for agents and mortgage brokers. For Millennials and Generation Z, it’s their first stop when looking at homes, so its growth is in the early innings. How does ZG stack up for the POWR Ratings? A for Trade Grade A for Buy & Hold Grade A for Industry Rank A for Overall POWR Rating The stock is also ranked #10 out of 54 stocks in the Internet category. Chewy Inc. (CHWY) Year-to-date, CHWY is up nearly 100%. Despite this gain, 26% of its float is short. The bearish argument is that the stock is undervalued given its $5 billion in sales against a $20 billion market cap. Additionally, CHWY sells mostly low-margin items. The company is competing with the likes of Amazon (AMZN) and Walmart (WMT) who have deeper pockets, and more efficient fulfillment networks. The bullish argument for CHWY is that the company is focused on growth and then will be able to pivot to higher-margin items. It has a remarkable track record in terms of customer retention and then average order size increasing over time. CHWY also managed to absorb the surge in orders during the coronavirus without its facilities getting overwhelmed. The POWR Ratings rates CHWY as a Strong Buy. It has an “A” for Trade Grade, Buy & Hold Grade, and Peer Grade. Among Consumer Goods stocks, it’s ranked #8 out of 34. Wayfair Inc. (W) W is one of the biggest gainers following the market bottom in late-March with a 1,350% gain. Despite this gain, short-sellers have been betting that it would reverse. Currently, 16 million shares have been sold short which equates to 27% of its float. Its average daily volume is 3 million shares. Like ZG, W is at the intersection of two booming trends. E-commerce and home-improvement. With people spending more time at home, and many outlets for spending no longer an option. People are shopping online and choosing to upgrade their homes. This was reflected in its recent earnings report which showed the number of active customers increasing by 46% to 26 million. Revenue increased by 84% to $4.3 billion which was above the consensus of $4 billion. More importantly, W has gotten more people comfortable with the ideas of buying furniture and other home goods online. From early-2019 to March 2020, the stock declined by 85%, as it seemed that it would never be able to grow past a certain threshold due to many people being unwilling to buy furniture online. These positive developments are reflected in W’s POWR Ratings. It’s rated a Strong Buy with an “A” for Trade Grade, Buy & Hold Grade, and Peer Grade with a “B” for Industry Rank. Among Specialty Retailers, it’s ranked #1 out of 33. Carvana Co. (CVNA) CVNA is up 1,200% since its IPO in early-2017 and 790% from its March lows. It’s been one of the strongest stocks during the coronavirus economy, as it made new highs in early-June. Since then, it’s trended higher. Despite this impressive outperformance, it’s become a favorite among short sellers as 47% of its float is short. Short-sellers were probably miffed following its Q2 report in which sales and earnings fell short of estimates, but the stock still ended up 23% higher. CVNA is a used car e-commerce retailer, and it’s quickly growing market share. According to McKinsey, Americans buy 39.4 used cars every year. This represents a massive market opportunity for the company that can become the dominant online platform for used car sales. And the short history of the Internet shows that due to network effects, only one platform can win. So although CVNA slightly missed estimates, investors were more focused on forward-looking indicators like the increased demand on the platform and acceleration in people becoming comfortable with buying used cars online. Another catalyst for CVNA is that used car sales tend to increase during weak economic environments. Additionally, online listings tend to lead to greater transparency and more efficient markets for buyers and sellers. CVNA is rated a Strong Buy by our POWR Ratings system. It has an “A” for Trade Grade, Buy & Hold Grade, Industry Rank, and Peer Grade. Among Internet stocks, it’s ranked #7 out of 54. Sea Limited ADR (SE) SE is a gaming and e-commerce company primarily focused on Southeast Asia. It has multiple, fast-growing units including its Garena games, Shopee online sales platform, and SeaMoney. TenCent has a significant stake in the company. Given that gaming, digital payments, and online spending has exploded during the coronavirus, SE’s stock has also been a big winner. Since the March bottom, SE is up more than 200%. It was one of the first stocks to make new highs which is an indication of relative strength. However, short-sellers are focused on the company’s valuation as 46% of the float is short. Short interest has consistently increased with the rising share price. Bears’ conviction comes from SE’s market cap of $64 billion compared to its $2 billion in revenue and $1 billion in loss over the past 12 months. In terms of its e-commerce and digital payments operations, SE is competing with Alibaba (BABA) in Southeast Asia who is willing to lose money to win market share. Additionally, video games are a tough market as gamers can be fickle, and there’s no guarantee that it can continue churning out big hits. So far, the stock price has scoffed at this logic, as it’s been one of the best-performing stocks in the market. It currently has a dominant market position and first-mover advantage in its part of the world. It’s also backed by TenCent which is a worthy counterweight to Alibaba. The POWR Ratings is consistent with the price action, as it has a Strong Buy rating with an “A” in all categories. Among Internet stocks, it’s ranked #6 out of 54. Want More Great Investing Ideas? 9 “BUY THE DIP” Growth Stocks for 2020 How to Trade THIS Stock Bubble? 7 “Safe-Haven” Dividend Stocks for Turbulent Times ZG shares fell $0.04 (-0.05%) in after-hours trading Friday. Year-to-date, ZG has gained 74.55%, versus a 5.02% rise in the benchmark S&P 500 index during the same period."}]}