{"article": [{"url": "https://stocknews.com/news/aapl-amzn-fb-goog-msft-tech-stocks-heading-into-the-november-election/", "published": 1601899700.0, "headline": "How Will Tech Stocks Perform as We Head into the November Election", "body": "The leading technology companies have dominant positions Facebook, Amazon, Apple, Alphabet, and Microsoft are under a political microscope Bipartisan support for putting a leash on the tech leaders International support for controlling the power of these companies Regulations and taxes are likely to rise starting in 2021 Last week, President Donald Trump and former vice president Joe Biden faced off in their first of a series of debates that lead to the November 3 election. On Friday, the markets received the first of what could be many October surprises as President Trump and First Lady Melania Trump tested positive for COVID-19. While the Presidential election is in the spotlight, voters will also decide the majorities in the House of Representatives and the Senate. A clean sweep by either political party could lead to substantial changes in taxes, energy, regulations, and many other government policies over the coming years. Gridlock would likely continue a circus of political wrangling, as we witnessed over the past years. Political discord between Democrats and Republicans has resulted in a situation where the two sides cannot agree on anything. Even issues with bipartisan support have stalled because either side does not want to give the other any victory when it comes to legislation. 7 Best ETFs for the NEXT Bull MarketTechnology has changed the world. The global pandemic only accelerated the growth in the technology sector. It allows people to work at home and communicate when social distancing and shelter in place guidelines precluded direct human interaction. Many changes in the workplace and social interaction will remain after the coronavirus fades into history. Shares of technology companies soared, taking the NASDAQ to record highs. The market caps of the leading companies in the sector have swelled to levels that created a trillion-dollar club. Apple’s (AAPL) rose to over $2 trillion before the latest correction. After the dust of the election settles, and a clear winner emerges, the US government will likely address dominance by the leading technology companies. Massive amounts of capital and access to data make for a powerful combination that creates dominance when it comes to growing businesses and competing with others. Moreover, the companies’ leaders and founders have seen their wealth grow to levels where they have become American oligarchs. Jeff Bezos, the founder of Amazon (AMZN), has a net worth of around $175 billion. Expect the US government to begin to address the explosive growth in technology and the increase in wealth over the coming months and years. The leading technology companies have dominant positions The top tech businesses have a powerful position in the US and worldwide because of two factors. With massive capital levels, they can acquire competitors and emerging companies with new and improved technology and pursue strategies that maintain their leadership positions. Access to massive cash hordes enhances flexibility. Meanwhile, the data they produce may even be more significant as the technology companies know more about people’s behavior than the government and even individuals. Anyone who doubts the power of data should do a simple search for a product. They will find that a tidal wave of pointed advertising follows any search. Technology has created powerful tools that track and predict all behaviors and pose a threat to privacy. Online searches and activities create records that are often worth their weight in gold. Data equals power. As technology evolves, data capture becomes more efficient and valuable. Facebook, Amazon, Apple, Alphabet, and Microsoft are under a political microscope Facebook (FB) had a market cap of $740 billion as of October 2 at a share price of around $260. The stock traded to a high of $304.67 on August 26, putting the market cap close to the $870 billion level. FB’s dominant social media presence has made the company consistently profitable. For most consumer businesses, advertising on FB is a must. Source: Yahoo Finance FB has consistently earned impressive profits. During the challenging second quarter of 2020, the company reported EPS that beat analysts’ estimates by 41 cents per share. The current forecast for Q3 is for FB to early $1.89 per share. Alphabet (GOOG) is the world’s leading search engine. At $1458.42 per share last Friday, GOOG had a market cap of just under $1 trillion. At the high of $1733.18 on September 2, the market cap was over $1.177 trillion. GOOG is a consistently profitable advertising giant. Source: Yahoo Finance In Q2, GOOG reported EPS of $10.13, beating consensus estimates by $1.79. The current projection for Q3 is for earnings of $11.09 per share. Microsoft (MSFT), the software giant, had a $1.56 trillion market cap on October 2 at $206.19 per share. MSFT reached its most recent high of $232.86 on September 2, putting the market cap at over $1.76 trillion. Source: Yahoo Finance MSFT consistently reports earnings above consensus estimates. The market expects the company to earn $1.54 per share in Q3. AMZN has become the leading e-commerce retailer. At $3125 per share on October 2, AMZN had a market cap of $1.565 trillion. At its high of $3552.25 on September 2, the market cap was at then $1.779 trillion level. Source: Yahoo Finance AMZN earnings have been trending higher. The company reported EPS of $10.30 in Q2, and the market projects $7.25 for Q3. AAPL is the leader of the pack with a $1.933 trillion market cap, with the shares trading at $113.02 on October 2. At its high of $137.98 on September 2, APPL’s valuation reached $2.36 trillion. Source: Yahoo Finance APPL reported an EPS of 64 cents in Q2, which beat projections by 13 cents. Analysts expect EPS of 70 cents for Q3. At the recent highs, the five leading technology companies together had a market cap of just under $7.95 trillion. To put that number into perspective, in 2019, the US GDP was $21.4 trillion. The value of the five companies was over 37% of the entire US economy. The sheer size and influence of the technology sector has put it under a microscope in Washington DC. Bipartisan support for putting a leash on the tech leaders There have been many hearings in the House of Representatives and the Senate over the size and power of the leading technology companies. Both sides of the political aisle have expressed concerns that the top companies are too big. Some members of Congress and Senators have called for regulations that would break up the companies into smaller pieces. The move would allow for an environment where competition could thrive, and data would be distributed to a broader range of businesses. It would limit any company or group of companies having a dominant position in capital or data. The Democrats and Republicans agree on little these days, but there are bipartisan concerns over the power held by the leading technology companies. In the aftermath of the November 3 election in 2021, politicians are likely to address the future of the leading companies. One of the issues will be the enormous wealth created by the growth in the value of these companies. Jeff Bezos, the founder of Amazon, is now the world’s wealthiest person. International support for controlling the power of these companies The internet transcends borders, making technology a worldwide business. The European Union has been busy drafting new laws and regulations, aiming at the heart of the operations of the leading companies in the sector. The increasing rules are likely to protect the privacy of Europe’s citizens. While US and European regulators are likely to work together over the coming months and years to reign in the power of US technology companies, China continues to pose a threat. The growing number of Chinese technology companies operate outside the grips of western regulators. On October 1, EU leaders were backing plans to impose unprecedented rules against big tech, making Europe a global regulator of the US companies. Regulations and taxes are likely to rise starting in 2021 The unprecedented price tag of COVID-19 and concerns over the rising power of the leading technology companies is likely to result in a more restrictive regulatory environment starting in 2021. Moreover, corporate taxes could rise substantially, and taxes on billionaires are likely to move to much higher levels. A sweeping victory by Democrats on November 3 would lead to a highly restrictive environment for tech companies and high tax levels. The Democrat’s progressive wing has long sought to push tax rates for the wealthiest people in the US to multiples of the current level. At the same time, progressives have insisted that a breakup of the technology sector is long overdue. Time will tell if a breakup of the leaders of the technology sector leads to valuations that are higher where the pieces have a total higher than the whole. Raising taxes would likely weigh on earnings and share prices. Politicians in the US and Europe could create an environment where trillion-dollar valuations become a memory. However, rising inflationary pressures are eating away at the value of money. The technology industry’s leadership is likely to argue that they use their capital and data responsibly and that a forced breakup would hand the future growth of the business to Chinese companies. After all, the data’s value in one place is far more useful than if it is spread around among competing commercial entities. However, those arguments are likely to fall on deaf ears as politics and business interests are often mutually exclusive. Meanwhile, we could see lots of two-way volatility in the leading tech stocks in the aftermath of the US election. Want More Great Investing Ideas? Do NOT Buy Stocks Before the Election! 7 “Safe-Haven” Dividend Stocks for Turbulent Times Chart of the Day- See Christian Tharp’s Stocks Ready to Breakout AAPL shares were trading at $114.03 per share on Monday morning, up $1.01 (+0.89%). Year-to-date, AAPL has gained 56.19%, versus a 5.94% rise in the benchmark S&P 500 index during the same period."}]}