{"article": [{"url": "https://stocknews.com/news/crsr-logi-atvi-ea-huya-doyu-bull-vs-bear-should-you-buy-the-corsair-gaming-ipo/", "published": 1600862900.0, "headline": "Bull vs Bear: Should You Buy the Corsair Gaming IPO?", "body": "Corsair Gaming (CRSR) is known for its gaming components and equipment including streaming gadgets, mouses, keyboards, and headsets. The company was founded in the early 90s, selling memory but then quickly branched out into other PC hardware like power supplies, storage products, PC cases, and cooling systems. Now, it also builds high-end PCs. Over the past decade, CRSR’s business took off as its premium products were a hit with gamers. The company has been a beneficiary of gaming’s increasing popularity. Corsair is going public with a valuation of $1.7 billion. It’s hoping to raise around $250 million as shares are slated to open around $18. Its S-1 filing reveals that in 2019, the company generated $1.3 billion in revenue and earned a profit of $31 million. 7 Best ETFs for the NEXT Bull MarketThe Boom in Gaming Video games are a serious business. In 2020, it’s estimated that a total of nearly $160 billion will be spent on gaming, and this amount is expected to grow at a 9% CAGR over the next decade. Within video games, esports’ popularity continues to increase with a total viewership of 645 million expected in 2022. Also, younger people are drawn to esports, so its commercial impact will likely continue to grow in the coming years. One massive catalyst for CRSR is that it has a strong market share in a fast-growing market. In the US, it has an 18% market share of peripherals and 42% market share of gaming PC components. It’s also the number 1 seller of memory, cases, power supplies, and “streaming gear”. Corsair’s Major Competitor – Logitech CRSR does have several competitors with its major products – memory, PC components, and gaming peripherals. The largest and most well-known is Logitech (LOGI). Its stock has been an outperformer since the March lows as the coronavirus resulted in a boom in the sale of its products with more people working and learning from home in addition to the increase in gaming. The POWR Ratings are also bullish on LOGI as it’s rated a Strong Buy. It has an “A” for Trade Grade, Buy & Hold Grade, and Peer Grade. Among Hardware stocks, it’s ranked #7 out of 28. LOGI’s stock price has been a long-term winner as it’s up more than 1,400% over the last seven years. In the short-term, it’s up nearly 150% from the market bottom in March and has been making new, all-time highs monthly since May. This type of relative strength is one characteristic of a “leading stock” in a bull market. Bull Case for CRSR LOGI benefited from a secular tailwind in the increasing popularity of gaming and a cyclical tailwind due to a pandemic which led to a sharp increase in demand for computer accessories. Investors in CRSR hope that these same trends will power the stock. CRSR’s bull case is that spending on gaming will continue to increase at a rapid rate like it has over the last two decades, so it will see continued revenue and earnings growth. We’ve also seen an acceleration in spending and time spent on gaming during the coronavirus since so many options for recreation were unavailable. Corsair is a high-end supplier of PCs and components to gamers that is somewhat of a cult brand. But, a cult brand in a massive and booming niche like video games can become big business. The Reddit subgroup for Corsair has 57,900 users and people post images of their gaming setups using Corsair products. They have a reputed and trusted brand name which gives them some pricing power. They have also become a part of the “gaming ecosystem” through sponsorship of esports athletes and events. In terms of its financials, CRSR is profitable and growing at an above-average rate. It also has decent margins for a hardware company. Bear Case for CRSR The bear case for CRSR is that it’s a hardware company which means there’s a lot of competition, a constant need to innovate, and constant pressure on margins. Further, there’s a steady stream of new entrants into the space. Historically, most hardware stocks are poor investments due to these factors. Manufacturing and shipping physical products are expensive. There’s a constant need to invest in physical equipment which decays in value. Bulls may argue that LOGI’s chart shows us that hardware companies can deliver massive returns, but LOGI also successfully grew earnings over its seven-year climb. In 2013, it lost $216 million in the previous year. By 2020, it was earning $477 million on a trailing 12-month basis. And, it expects to grow earnings by 13% in the next year. However, there are also some major differences between the two companies. Corsair just became profitable after many years of being in the red. It’s possible that this was a one-time bump due to the coronavirus. LOGI also has a much more diversified array of products. It also has a much stronger brand name and market presence compared to Corsair. In its S-1 filing, Corsair listed mobile gaming, cloud gaming, augmented reality, and VR as some of the threats to its business that could lead to a decline in revenue. Cloud gaming can allow any PC to tap into powerful servers that are better than any PC. This would negate the need for people to have their expensive gaming rigs at home. Consider These Types of Stocks Instead Therefore, CRSR’s success as stock will come down to management’s ability to maintain and potentially grow its market share. The company has been remarkably successful in entering new categories and carving out market share. And, it’s part of a growing market. However, it faces the same challenges as any other hardware manufacturer. If you believe in CRSR’s management to execute and keep entering new categories and carving out market share, then it could follow LOGI’s path. However, if an investor is simply looking for exposure to the video game theme, there are better options. Companies that are higher up on the food chain have outperformed in nearly every industry. In video games, this refers to companies like Activision Blizzard (ATVI) or Electronic Arts (EA) which create games. There are platforms that host video game streaming and esports competitions like Huya (HUYA) and Doyou (DOYU). A recent interesting IPO is Unity Software (U) which makes software for game developers. These products can scale and have high-profit margins. These are better vehicles to get exposure to secular growth in gaming. Verdict Corsair gaming is a 24-year old company. It’s had a remarkable ability to find new product categories, create a unique brand, and carve out some market share. Buying the stock is a bet on management’s ability to continue doing this. If you are interested in gaming as an investment theme, CRSR is not the best option. Other stocks can scale and capture value in a much more efficient way. CRSR shares were trading at $14.47 per share on Wednesday afternoon, down $0.65 (-4.30%). Year-to-date, CRSR has declined N/A%, versus a 1.68% rise in the benchmark S&P 500 index during the same period."}]}