{"article": [{"url": "https://stocknews.com/news/xlu-futy-dln-iwx-top-4-dividend-paying-etfs/", "published": 1596197300.0, "headline": "Top 4 \"Dividend Paying\" ETFs", "body": "Dividend-paying ETFs are currently an attractive option for investors given the unusual number of uncertainties in the economy and stock market. During weak economic conditions, there’s a risk that companies may have to cut dividends. This risk is reduced with ETFs due to their broad, diversified exposure. Also, interest rates are at zero percent, and the Fed is not going to raise them for at least a year and a half. This is a positive tailwind for dividend-payers. 9 \"BUY THE DIP\" Growth Stocks For 2020The SPDR Select Sector Fund Utilities (XLU), Fidelity MSCI Utilities Index ETF (FUTY), WisdomTree U.S. LargeCap Dividend ETF (DLN), and iShares Russell Top 200 Value ETF (IWX) are four top ETFs paying dividends that you should consider. SPDR Select Sector Fund – Utilities (XLU) XLU’s portfolio is comprised of stocks of major utility companies operating in America, providing investors diversified exposure. XLU’s major holdings include Nextera Holdings Inc. (NEE), Dominion Energy Inc. (D) and Duke Energy Corporation (DUK). XLU tracks the performance of the Utilities Select Sector Index and has approximately $11.51 million assets under management (AUM). XLU has an expense ratio of 0.13%, which is much lower than its category average of 0.42%. It has returned 9.6% to investors in the last three months and 4.4% over the past year. It currently pays an annual dividend of $1.94, which yields 3.2% based on its current price. XLU is a consistent dividend-paying ETF, with periodic quarterly payouts over the last 7 years. XLU gained more than 35% in value after hitting its 52-week low of $43.44 on March 23rd due to the pandemic-led market crash. How does XLU stack up for POWR Ratings? A for Trade Grade B for Buy & Hold Grade B for Peer Grade B for Industry Rank B for Overall POWR Rating. You can’t ask for better. It is ranked #3 out of 11 ETFs in the Utility ETFs group. Fidelity MSCI Utilities Index ETF (FUTY) FUTY is a passively-managed ETF that tracks and replicates the performance of MSCI USA IMI Utilities Index. It undertakes the ‘Representative Sampling’ approach, wherein at least 80% of FUTY’s portfolio is derived from its underlying index. FUTY has over $8.40 billion AUM and 14.4% of its total asset base is invested in Nextera Energy Inc (NEE). The next two major holdings are Dominion Energy and Duke Energy. FUTY has an expense ratio of 0.08%, significantly lower than its category average of 0.42%. It has returned 8.9% to investors in the past three months and 4.9% alone in the last month. Its annual dividend of $1.24 yields 3.1% on its prevailing price. Moreover, FUTY has a long history of consistently paying dividends. FUTY hit its 52-week low on March 23rd due to the virus-driven market crash and has gained more than 35% since then. FUTY is rated “Buy” in our POWR Ratings system, consistent with its strong sectoral performance and quick recovery. It holds an “A” in Trade Grade, and “B” in Buy & Hold Grade and Industry Rank. FUTY is ranked #5 out of 11 ETFs in the Utility ETFs group. WisdomTree U.S. LargeCap Dividend ETF (DLN) DLN invests in large-cap companies based in the United States that have substantial dividend history and individual security allocation. It follows a dividend weighted methodology based on its underlying WisdomTree LargeCap Dividend Index. It holds stocks of over 282 companies and has a total AUM of $2.82 billion. The major holdings include Microsoft Corp. (MSFT), Apple Inc (AAPL), and AT&T Inc. (T). DLN’s expense ratio is 0.28% compared to its category average of 0.52%. Over the last three months, DLN has returned 10.2% to its investors. Its 1-month price return is 3.4%. DLN’s annual dividend payout is $2.76 per share, which yields 2.86% on its current price. DLN also has a long history of paying dividends consistently. DLN gained more than 40% in value since hitting its 52-week low of $68.29 on March 23rd. DLN is rated a “Buy” ETF in our POWR Ratings system, based on its portfolio holdings and strong recovery. It has an “A” in Trade Grade, and “B” in Buy & Hold Grade, Peer Grade and Industry Rank. It is currently ranked #32 out of 82 ETFs in Large Cap Value ETFs. iShares Russell Top 200 Value ETF (IWX) IWX is a passively-managed ETF investing in large and mega-cap companies based in the United States. Its portfolio holdings include stocks primarily operating in the finance, energy, and healthcare sectors, with low volatility and impressive dividend payout history. With AUM of $656.90 million, IWX holds stocks of 157 companies in its portfolio and tracks Russell Top 200 Value Index. The top three holdings include Berkshire Hathaway Inc (BRK.B), Johnson & Johnson (JNJ), and JP Morgan & Chase Co (JPM). IWX has an expense ratio of 0.20% compared to its category average of 0.52%. It has returned 8.1% to its investors in the past three months and 3.9% last month. IWX pays an annual dividend of $1.51 per share, which yields 2.9% on its current price. It is a reliable ETF for income investors looking for stable payouts, as IWX has paid dividends periodically since 2013. IWX hit its 52-week low of $37.65 on March 23rd and has gained more than 28% since then. IWX is rated “Buy” in our POWR Ratings system, with “B” in Trade Grade, Buy & Hold Grade, and Industry Rank. Out of 82 ETFs in the Large Cap Value ETFs group, IWX is rated #41. Want More Great Investing Ideas? 9 “BUY THE DIP” Growth Stocks for 2020 How HIGH Can This Tech Bubble Fly? 7 “Safe-Haven” Dividend Stocks for Turbulent Times XLU shares were unchanged in after-hours trading Friday. Year-to-date, XLU has declined -4.13%, versus a 2.49% rise in the benchmark S&P 500 index during the same period."}]}