{"article": [{"url": "https://stocknews.com/news/psx-xle-phillips-66-psx-an-inexpensive-energy-stock-that-pays-while/", "published": 1600171700.0, "headline": "Phillips 66 (PSX)- An Inexpensive Energy Stock That Pays While You Wait for A Higher Price", "body": "Bear market action since mid-2018 A long history of energy production in the US A juicy dividend Levels to watch in PSX shares Three reasons to add PSX to your portfolio Phillips 66 (PSX) is an energy manufacturing and logistics company that operates through four segments. Midstream transports crude oil and other feedstocks, delivers refined products to market, provides terminaling and storage services for oil and petroleum production, and does the same for natural gas. The Chemicals segment manufacturers and markets ethylene and other products, aromatics and styrenics products such as benzene, cyclohexane, styrene, polystyrene, and other petrochemicals. The Refining segment processes crude oil into gasoline and distillate products. Finally, the marketing and specialties segment purchases for resale and markets refined petroleum products, including gasoline, distillates, and jet fuels in the US and Europe. PSX also manufactures and markets specialty products, including petroleum coke, waxes, solvents, and polypropylene. 7 Best ETFs for the NEXT Bull MarketPSX has been around since 1875, with its headquarters in Houston, Texas. The Energy Select SPDR (XLE) has 4.61% of its net assets invested in PSX shares as of the end of last week, which was the third-largest holding behind Chevron (CVX) and Exxon Mobile (XOM). Bear market action since mid-2018 PSX hit its all-time high in August 2018 at $123.97 per share. The stock made a lower high in November 2019 at $119.92 before collapsing in March 2020, along with the stock market and energy-related shares. Source: CQG As the chart highlights, the stock fell to its lowest price since 2012, when it hit $40.04 in March. PSX recovered to $89.79 this June before turning south again with the energy sector. Energy shares fell even though the stock market, led by technology companies, moved to record levels through early September 11; PSX shares closed at just over $57 per share on Friday, less than half the price it was trading at the end of 2019. The price action since 2018 has been bearish, along with the rest of the energy sector. A long history of energy production in the US Phillips 66 (PSX) has been around since 1875. PSX’s predecessor companies include Conoco Inc and Philipps Petroleum Company. The two merged in 2002 to form ConocoPhillips. In 2012, the two separated into two stand-alone publicly traded companies, one of which was PSX. Brothers Frank and L.E. Phillips were the company’s founders, which had its headquarters in Bartlesville, Oklahoma, in 1917. During WW II, the company made high-octane aviation fuel, boosting the power of Allied planes. The 2012 breakup of ConocoPhillips was a spinoff of the midstream and downstream businesses. Today, PSX has more than 14,000 employees worldwide, with its headquarters in Houston, Texas. In 2016, the company completed a multibillion-dollar midstream and export project on the Texas Gulf Coast. A juicy dividend As of September 11, the company was paying its shareholders a $3.60 dividend. At $57.07 per share, the 6.3% dividend is attractive for many investors that hold the shares. The company has a market cap of just below $25 billion and trades an average of almost 3.3 million shares each day. PSX has beat analyst consensus EPS estimates in three of the past four quarters. Source: Yahoo Finance As the chart shows, the company missed the consensus estimate in Q4 2019 by only two cents. In the challenging second quarter of 2020, where the price of crude oil in the US fell below zero for the first time, PSX reported a loss of 74 cents per share, which was 18 cents above the estimates. In Q3, the market expects the company to report a profit of 26 cents per share. An average of eighteen analysts has an average price target of $81.78 for PSX, 43.3% above the closing level on September 11. The range is from $73 to $100 per share. Most of the leading Wall Street firms have a buy, outperform, or overweight rating on the company’s stock. Levels to watch in PSX shares PSX shares continue to languish with the rest of the energy sector. Source: Barchart Technical support for PSX stands at the mid-April 2020 low of $53.16 and the March bottom at $40.04 per share. On the upside, resistance is at the August 11 high of $67.47, the July 1 peak at $73.35, and the June 8 $89.79 apex. The support and resistance levels show that risk-reward favors the shares’ upside at just over $57 on September 11. Three reasons to add PSX to your portfolio The energy sector has been among the worst-performing in the stock market over the past year. The market continues to express concern over if companies like PSX and others in the sector will continue paying dividends at the current levels. Even if PSX were to trim or eliminate its yield for a time, the company offers value in a market where it is more than a challenge to identify bargains. The most recent weakness in PSX shares comes as the price of oil moved lower and damage at refineries after Hurricane Laura has weighed on the stock. Like most energy companies, PSX has debt, around $14.45 billion, as of the end of July. The debt to asset ratio was at around 0.26. With approximately one-quarter of its total assets of $54.52 billion funding the debt at the end of July, the company has a prudent approach to borrowing, which is the first reason to consider the shares. A compelling reason to own PSX is the over 6% dividend. The last ex-dividend date was August 17, so the company continues to fund the payments to shareholders. At the current debt level, the company could issue additional debt to continue funding the yield if oil and profits remain depressed over the coming months. Finally, with short-term support at $53.16 and resistance at $67.47, the stock’s technical position implies a risk-reward of better than 2.6:1. At $57.07, short-term support and resistance levels are $3.91 and $10.40 per share away from the current share price. Over the coming weeks, the US election will take the center of the stage in all markets, and energy is no exception. The election will determine the future of US energy policy for the coming years. Markets hate uncertainty, so we could see further weakness in energy-related shares and PSX. I would be a scale-down buyer of PSX during weakness. The company offers value in a challenging environment where there are few bargains. Want More Great Investing Ideas? 7 Best ETFs for the NEXT Bull Market Is the Stock Market Correction Over? Chart of the Day- See the Stocks Ready to Breakout PSX shares rose $0.68 (+1.16%) in premarket trading Tuesday. Year-to-date, PSX has declined -45.01%, versus a 7.14% rise in the benchmark S&P 500 index during the same period."}]}