{"article": [{"url": "https://stocknews.com/news/mu-is-micron-set-for-a-big-move/", "published": 1601294900.0, "headline": "Is Micron Set For a Big Move?", "body": "Making directional trades in this market isn’t easy. On the one hand, you have high flying stocks that are trading well above reasonable valuations. Trading those types of stocks can be dangerous since they can reverse on a dime. On the other hand, value stocks are dead. Stocks trading below reasonable valuations just seem to stagnate. So what can traders do to make money in this high volatility environment with a seemingly total lack of fundamental trading? There is a way to use options to where large moves in either direction can make money. However, this type of trading can be expensive. Still, buying a call and a put at the same strike, known as an options straddle, may be one strategy that can pay off. Micron (MU) 9 \"BUY THE DIP\" Growth Stocks For 2020One stock that may be an excellent straddle candidate is Micron (MU). In fact, it’s possible a fund or well-capitalized trader just made a huge straddle bet on MU for November. With MU trading at $48.32, the trader appears to have purchased the November 50 call and put for a total of $8.38. That means the breakeven for this trade is $58.38 or $41.62. That’s clearly a huge move needed between now and November for the position to pay off. There are earnings between now and then, but still, that’s a lot of premium to pay. So why is this trade even noteworthy? The trader purchased this alleged straddle 15,000 times. That’s $12.5 million in premium that’s at risk. It seems evident that someone with a lot of cash thinks MU is going to move. There is some reason to believe that MU may be set to move, especially with earnings coming up and all the volatility in the market. Even a $50 stock can see 20% swings over a short period of time. What’s more, the directional bias for MU is far from obvious. There is an equally compelling bullish and bearish argument for the stock. Earnings will obviously shed some light on this matter, but so will news related to the global economy, and the recovery from the pandemic. On the bearish side, the pandemic has hurt sales of computers to businesses. Micron provides RAM chips for computers, so that’s big business for them. On the other side, home computing and data center computing has increased with all the work from home jobs these days. That’s bullish for Micron sales. Which one will be more important come earnings? Assuming the trade is a straddle (and we don’t know for sure), it may be suggesting that no one really has a clue what the results will be. The only thing we can guess is that the stock is due for a big move. Still, most people don’t want to pay $8 for straddle on a $50 stock. You could spend less by using the October 16th 50 straddle instead. It still expires after earnings but costs about $5.50 instead of over $8. The issue with straddles is almost always the high upfront cost. Nevertheless, in a volatile market, if you think something will move a lot, you generally have to pay up to take advantage of the situation. Want more great investing ideas? Download free the “10-Step Options Trading Checklist” you need before making a trade. The Virtual Trading Pit Is Open: Trade Set-ups, Training, New Trading Ideas How to Try Out Options Without Risking a Penny MU shares were trading at $49.35 per share on Monday afternoon, up $0.21 (+0.43%). Year-to-date, MU has declined -8.24%, versus a 5.31% rise in the benchmark S&P 500 index during the same period."}]}