{"article": [{"url": "https://stocknews.com/news/ba-xom-wba-the-3-worst-performing-dow-stocks/", "published": 1595592500.0, "headline": "The 3 WORST-PERFORMING Dow Stocks", "body": "Investors should always pay attention to underperformance during rising markets, and outperformance during down markets. For example, during the coronavirus crash, stocks like Netflix (NFLX) and Amazon (AMZN) were down 25%, while the Nasdaq was down 33%. It’s not surprising that since the market bottomed, NFLX and AMZN have been two of the strongest stocks and were among the first to make new highs. It’s equally important during rising markets. From the beginning of the year to its late-February high, the S&P 500 was 5.4% higher but the energy ETF, (XLE) was 10% lower. So, it’s not exactly surprising that it dropped 50% during the crash, while the S&P 500 was down by 35%. 7 \"SAFE HAVEN\" Dividend Stocks for Turbulent TimesWhen the trend changes, the laggards are the most vulnerable. Given the market has had an impressive rally over the last four months, I thought it would be useful to highlight the three worst-performing Dow Stocks – Boeing (BA), Exxon Mobil (XOM), and Walgreens (WBA) – as they are likely to have the worst performance if the market crashes again. Boeing Company (BA) BA was in bad shape going into the pandemic due to issues with the 737 MAX, but the coronavirus has exacerbated these issues as air travel is significantly lower and demand for jets is lower as well. It’s resulted in slower delivery schedules, delayed airline purchases for new jets, and deferred elective maintenance. President and CEO David Calhoun said, “The COVID-19 pandemic is affecting every aspect of our business, including airline customer demand, production continuity, and supply chain stability.” This has been reflected in the stock price as well. BA lost 45.8% year to date, which is much higher than the Dow Jones Industrial average’s year-to-date loss of 5.4%. Spirit AeroSystems (SAVE) shared forecasts with its lenders signaling lower 737 Max deliveries in the coming years in an attempt to persuade lenders to loosen terms of its debt. Furthermore, the 737 MAX has been grounded since March 2019. And the pandemic has slowed down the recertification process of the model with ongoing delays. In the first quarter, revenue decreased 26% year over year, and loss from operations was $1.4 billion as compared to $2.4 billion earnings a year ago. The quarter also recorded a core loss of $1.70 per share as compared to $3.16 EPS a year ago. BA’s consensus revenue estimate of $13.3 billion for the quarter ended June indicates a year-over-year decline of 15.4%. Also, BA’s earnings surprise history looks poor, as the company could not surpass the consensus EPS estimates in three of the trailing four quarters. BA’s POWR Ratings are consistent with this bleak outlook. It has an overall rating of “Sell” with an “F” for Buy & Hold grade and a “D” for Industry Rank, Trade Grade, and Peer Grade. It’s ranked #31 out of 65 Air/Defense Services stocks. Exxon Mobil Corporation (XOM) Although oil prices have improved, the historic lows earlier this year significantly affected XOM. Weakened industry fuel margins, reduced scheduled maintenance activity, and lower crude and natural gas prices were some of the setbacks for XOM. XOM has lost 37.4% year to date which is significantly higher than Dow’s loss over this period. Darren W. Woods, chairman, and the chief executive officer said, “COVID-19 has significantly impacted near-term demand, resulting in oversupplied markets and unprecedented pressure on commodity prices and margins.” XOM’s consensus revenue estimate of $38.16 billion for the quarter ended June indicates a year-over-year decrease of 44.8%. XOM’s earnings surprise history looks dismal, as the company could not surpass the consensus EPS estimates in any of the trailing four quarters. Also, the market expects the company to report a negative EPS of $0.62 for the quarter ended in June 2020, which represents a significant decrease compared to the year-ago EPS of $0.61. In the first quarter, XOM bore a loss of $610 million as compared to $2.4 billion earnings a year ago. The loss per share was $0.14 as compared to $0.55 earnings per share in the year-ago period. XOM’s poor prospects are also apparent in its POWR Ratings which gives it a “Sell” rating. It also has a “D” for Trade Grade, Industry Rank and Buy & Hold Grade, and a “C” for Peer Grade. Among the 96 stocks in the Energy – Oil & Gas group, it’s ranked #18. Walgreens Boots Alliance, Inc. (WBA) Stay-at-home and social distancing have hurt WBA’s financial performance. Shares of this retail and wholesale pharmacy chain have recorded a 30.7% year-to-date loss. The market expects the company to report an EPS of $0.97 for the current quarter, which represents a significant decrease over the year-ago EPS of $1.43. In the fiscal third quarter ended May 31st, WBA’s net loss was $1.7 billion compared to net earnings of $1 billion a year ago. The net loss per share was $1.95 compared to net earnings per share of $1.13 a year ago. WBA’s POWR Ratings reflect its poor prospects. The company is rated a “Sell.” It also has an “F” for Trade Grade, “D” for Buy & Hold Grade, and Peer Grade in addition to a “C” for Industry Rank. Within the 3-stock Medical-Drug Stores group, it is ranked last. Want More Great Investing Ideas? 9 “BUY THE DIP” Growth Stocks for 2020 Newly REVISED 2020 Stock Market Outlook 7 “Safe-Haven” Dividend Stocks for Turbulent Times BA shares rose $0.64 (+0.37%) in after-hours trading Friday. Year-to-date, BA has declined -46.34%, versus a 0.61% rise in the benchmark S&P 500 index during the same period."}]}