{"article": [{"url": "https://stocknews.com/news/nflx-zm-twlo-3-coronavirus-proof-stocks-that-can-soar-higher-in-2020-and/", "published": 1599134900.0, "headline": "3 Coronavirus-Proof Stocks That Can Soar Higher In 2020 and Beyond", "body": "While the number of COVID-19 cases has been declining over the past month, the crisis will continue to haunt investors and businesses in the near-term. It might take at least a year for global markets to stabilize as most major economies reported negative GDP growth for the June quarter. Further, there is also the threat of a second wave of infections that might result in another broader market sell-off. Investors need to ensure their portfolio is coronavirus-proof and buy companies that have shown resilience in these uncertain times. The economy remains sluggish and consumer demand has slumped amid the pandemic. However, here we look at three stocks that have thrived in 2020 and have benefitted from the volatile environment. 9 \"BUY THE DIP\" Growth Stocks For 2020A streaming giant Shares of Netflix (NFLX) are trading at $530 and have gained an impressive 63% year-to-date. As people were confined to their homes and countrywide shutdowns were imposed, entertainment options were limited. As the global populace turned to streaming services, companies such as Netflix experienced a significant spike in subscriptions. Its revenue in the June quarter rose by 24.9% year-over-year to $6.14 billion as subscriptions were up 27.3% at 193 million. Netflix added 26 million subscribers in the first two quarters of 2020, significantly higher than the 12 million additions in the prior-year period. While the company said it expects growth to decelerate in the second half of 2020, it has enough opportunities to grow top-line in the upcoming decade. While the company’s growth in the U.S. is close to saturation, the streaming heavyweight can continue to grow its presence in other international markets. Netflix invests heavily in creating original content that caters to the local audience and is a key driver of subscriber growth. Netflix claimed, “We are developing a growing number of non-English language originals from places such as Mexico, France, Italy, Japan and Brazil, to name just a few. With our global distribution, Netflix is well positioned to bring engaging stories from many cultures to people all across the globe.” A look at Netflix’s valuation Netflix expects sales to increase by 20.6% year-over-year to $6.32 billion in Q3 while subscriber growth is forecast at 23.4%. Analysts tracking Netflix stock expect sales to grow by 23.4% in 2020 to $24.9 billion and by 17.4% to $29.2 billion in 2021. They expect earnings to grow by 49.6% in 2020 and at an annual rate of 35.3% in the next five years. Netflix stock is trading at a price to sales multiple of 9.3x and a forward price to earnings multiple of 89.3x which might seem expensive. However, growth stocks command a higher multiple and Netflix remains a top long-term buy. Analysts have a 12-month average target price of $515.36 for Netflix which is 7% higher than its current trading price. A remote work enabler Zoom Video (ZM) has been one of the hottest stocks in 2020. The company went public in April 2019 at a price of $36 per share and has since returned a staggering 1,075% in less than 18 months. Zoom Video stock has been on an absolute tear in 2020 and is up 500%, crushing broader market returns. The COVID-19 pandemic has accelerated the work from home trend and acted as a major tailwind for collaboration companies including Zoom Video. It recently released its fiscal second quarter of 2021 results and reported revenue growth of 355% year-over-year to $663.5 million. Further its net income rose 11x to $275 million or $0.92 per share. Comparatively, consensus revenue estimates for Zoom’s Q2 stood at $500 million while EPS was forecast at $0.45 per share. The number of customers contributing over $100,000 in trailing 12-month revenue rose 112% year-over-year to 998. It also ended the quarter with 370,000 customers that have over 10 employees which is a growth of 458% year-over-year. Another important metric for Zoom Video was its net dollar expansion rate that stood over 130% in the last 12-month period, for the ninth consecutive quarter. The company also increased its fiscal 2021 guidance to between $2.37 billion and $2.39 billion above its previous guidance of $1.8 billion. This indicates a YoY growth of 280%. Due to Zoom Video stock’s stellar run in 2020, it is now valued at a market cap of $120 billion, indicating a price to sales multiple of 50.4x. Its price to sales multiple also stands at 180x which is sky-high. However, investors should also note that Zoom Video is expected to increase earnings by 577% in 2021. While Zoom faces competition from tech giants such as Microsoft’s Teams and other collaboration players, it now has a massive presence in this space and has aggressively expanded its customer base in 2020. A cloud communications player Another company that has been immune to the dreaded coronavirus is cloud communications company Twilio (TWLO). Twilio stock is up 156% in 2020 and has multiple drivers to outpace the broader indexes in the long-term. Twilio aims to democratize communication channels that include voice, text, video, email, and chat by virtualizing enterprise communications infrastructure through APIs making it easier for the developer to use. This helps companies improve customer engagement and increase sales over time. In the fiscal second quarter, Twilio’s revenue was up 46% year-over-year at $400.8 million while net income rose 189% to $0.09 per share. The company also increased the number of active customer accounts by 24%. According to the market research company, Mordor Intelligence, the cloud-based contact center market is forecast to grow at an annual rate of 23% through 2025 to reach $45 billion. Considering Twilio’s 2020 sales that are forecast at $1.6 billion, the company has enough room to grow top-line at a rapid pace. Similar to other stocks in the list, Twilio is also trading at a premium. It has a price to sales multiple of 23.6x while its price to earnings multiple is north of 1,000x due to low profitability. However, Twilio stock is well poised to move higher and create massive wealth for investors given its rapidly expanding addressable market and its customer net expansion rate of 132%. Want More Great Investing Ideas? 7 Best ETFs for the NEXT Bull Market Beware Stocks in September? 9 “BUY THE DIP” Growth Stocks for 2020 NFLX shares were trading at $525.61 per share on Thursday afternoon, down $27.23 (-4.93%). Year-to-date, NFLX has gained 62.44%, versus a 9.09% rise in the benchmark S&P 500 index during the same period."}]}