{"article": [{"url": "https://stocknews.com/news/pypl-gpn-intu-3-top-fintech-stocks-disrupting-the-financial-industry/", "published": 1597147700.0, "headline": "3 Top Fintech Stocks DISRUPTING the Financial Industry", "body": "The financial tech industry, or fintech for short, is quickly disrupting the traditional banking and payment processing industries. More transactions are being conducted online as opposed to in-person due to the coronavirus. Some people are even choosing to transfer money to family, friends, and businesses digitally rather than through a tangible form of payment with cash or check. Take a close look at the fintech stocks, and you will find there are plenty to choose from. Instead of investing a small percentage of your available funds in the majority of fintech stocks, the better approach is to restrict your investment to the cream of the crop. 9 \"BUY THE DIP\" Growth Stocks For 2020Below, we highlight three fintech stocks disrupting traditional financial companies in 2020: PayPal Holdings (PYPL), Intuit Inc. (INTU), and Global Payments Inc. (GPN). PayPal Holdings (PYPL) The number of payments processed online increases with each passing day. PYPL processes a growing number of these payments through its website and Venmo. It’s become the backbone of the online business world. A large part of PYPL’s growth stems from Venmo, an easy-to-use peer-to-peer payment service. PYPL continues to improve Venmo as time progresses. Though PYPL certainly poses stiff competition to Square’s (SQ) Cash App mobile payment system, PYPL does not implement the same type of website-based payment processing technology as Square. The POWR Ratings reveal PYPL has A grades in every Component. PYPL is ranked 2nd of nearly 50 stocks in the Consumer Financial Services sector. At the moment, PYPL is priced around $193, following a bull run for the ages in the aftermath of the coronavirus outbreak. However, there is still room for PYPL to climb even higher. TipRanks’ analysts expect PYPL to reach $209.77 which is 8% above the current price. This is quite possible because PYPL has added an incredible 70 million new users during the pandemic. Furthermore, PYPL’s head honchos are embracing the crypto movement, a decision that will likely give the stock even more momentum as we head into the third quarter of 2020. Intuit Inc. (INTU) Instead of investing in a business that is solely focused on processing online payments, it might be better to diversify by investing in a fintech company that operates in several segments like INTU. INTU provides fintech services in the segments of consumer tax, small business, and ProConnect. ProConnect is a web-based solution for document management that facilitates the gathering, importing, and storing of data and documents. More than half of INTU’s annual revenue stems from its Small Business segment that provides online financial solutions to comparably diminutive companies. Though INTU does not have the same name recognition as PYPL, SQ, and other high-flying tech stocks, it is a solid company in every regard. INTU’s POWR Ratings are perfect: As in every POWR Component and an industry ranking of three out of 45 stocks in the Consumer Financial Services space. Take a look at the analysts’ take on INTU and you will find the experts anticipate the stock moving toward $315 soon. Out of 11 analysts who have conducted a thorough review of INTU, nine recommend investors buy, two advise holding and none recommend selling. INTU has a relatively moderate forward P/E ratio of 38. Add in the fact that INTU has historically exceeded analysts’ earnings estimates and it is quite tempting to establish a position in this fintech superstar. The bottom line is INTU’s products and services, highlighted by TurboTax and QuickBooks Online, will be in demand for years to come. Global Payments Inc. (GPN) Nowadays, groups ranging from multinational corporations to government agencies, financial institutions, and everyday consumers need electronic transactions processed. GPN processes those transactions, ensuring payments are provided for goods and services of all types. The POWR Ratings reveal GPN has A grades in the POWR Components of Industry Rank and Trade Grade. GPN has a B Peer Grade and a C Buy & Hold Grade. All in all, GPN is ranked in the top 10 of 45 stocks in the Consumer Financial Services space. The average analyst price target for GPN is a whopping $205.92 which is 21% above the current price. If this prediction holds, GPN will have increased by nearly 21%. It is quite remarkable that 13 out of 13 analysts highlighted on TipRanks insist GPN is a Buy. GPN has yet to return to its pre-COVID trading level of $180-$200. Look for GPN to test its 52-week high of $209.62 by the end of the year. Want More Great Investing Ideas? 9 “BUY THE DIP” Growth Stocks for 2020 How to Trade THIS Stock Bubble? 7 “Safe-Haven” Dividend Stocks for Turbulent Times PYPL shares were trading at $189.79 per share on Tuesday morning, down $3.53 (-1.83%). Year-to-date, PYPL has gained 75.46%, versus a 5.52% rise in the benchmark S&P 500 index during the same period."}]}