{"article": [{"url": "https://stocknews.com/news/ino-ostk-acmr-nk-vapo-5-impressive-small-cap-stocks-with-buy-ratings/", "published": 1596110900.0, "headline": "5 Impressive Small-Cap Stocks with BUY Ratings", "body": "Small-cap stocks receive minimal attention from the media yet plenty of these companies are worthy of looking at. Take a close look at the small-cap stocks with exemplary POWR Ratings and you will find some true gems. In particular, the following small-cap stocks are quite attractive at their current prices: Inovio Pharmaceuticals (INO), Overstock.com (OSTK), ACM Research (ACMR), NantKwest (NK) and Vapotherm Inc. (VAPO) Inovio Pharmaceuticals (INO) 9 \"BUY THE DIP\" Growth Stocks For 2020The battle against cancer and infectious diseases is being waged by pharmaceutical companies such as INO. INO’s scientists are hard at work developing active DNA immunotherapies to thwart both cancer and disease. The POWR Ratings reveal INO has an Industry Rank of B and respectable Trade and Peer Grades. INO is ranked in the top 75 of more than 330 Biotech stocks. INO is currently preparing to begin a phase 2/3 clinical study of a potential coronavirus vaccine. Though the initial clinical study of the vaccine shows it is safe and tolerated without problem by the human body, INO did not reveal much else about the vaccine such as the number of patients that generated antibodies. Stay tuned. If INO makes headway with its coronavirus vaccine, the stock will likely move back into the $30 range. Overstock.com (OSTK) Now that retail is quickly transitioning to “e-tail” on the web, the likes of OSTK have the potential for meteoric rises. OSTK sells a little bit of everything from apparel to electronics, home décor, jewelry, sporting goods and beyond. The POWR Ratings show OSTK has A grades in every POWR Component. OSTK is ranked 13th of more than 50 stocks in the Internet category. OSTK is unique amongst e-tailers in that it has branched off into developing blockchain technology. OSTK was recently upgraded by Tom Forte, a respected analyst with DA Davidson. Forte set a price target of $66 for OSTK. His previous price target for the stock has $33. Forte insists if OSTK were merely an e-tailer, its stock would be fairly priced around $42. However, OSTK is quickly becoming a blockchain power to reckon with. Once OSTK’s blockchain technology is accounted for and its cash/assets are added in, its stock is fairly priced between $65 and $70. However, as most experienced investors know, stock prices are dictated by perceived value and multiples of current sales and earnings. OSTK stands a good chance of approaching triple digits before year’s end. ACM Research (ACMR) Semiconductor companies rely on ACMR’s specialized equipment to eliminate contamination and defects in a comprehensive and efficient manner. In short, ACMR’s solutions help make modern day computing possible. The Fremont, California company is a POWR Ratings star with A grades in each POWR Component category. ACMR is ranked in the top 20 of more than 80 Semiconductor & Wireless Chip stocks. Though ACMR is currently trading slightly above the analysts’ average price target of $87.50, three analysts rate the stock as a Buy, two rate it as a Hold and none advise selling. It is particularly interesting to note the majority of ACMR’s business occurs in China where most of its customers are located. All in all, ACMR has nearly 300 patents. ACMR’s cleaning systems are likely to be in considerable demand far into the future. At the moment, ACMR’s wafer-cleaning equipment is a key component of an overarching industry that is worth nearly $3 billion. It is quite possible ACMR will grow its revenue upwards of a dozen times over in the years to come, taking full a advantage of its expanding market and the rise of 5G telecommunications. NantKwest (NK) Though there are plenty of companies working to defeat cancer and infectious diseases, few are as highly regarded as NK. NK is a clinical stage immunotherapy business with a potential coronavirus vaccine. Instead of developing a vaccine that forms antibodies to boost protein along the exterior of the virus, NK’s vaccine candidate expresses the spike protein as well as the nucleocapsid protein along the interior of the virus. This unique approach is just one example of what separates NK from the competition. NK’s vaccine will soon start clinical trials even though it was not one of those included in President Trump’s Operation Warp Speed. NK has an average analyst price target of $18, which is 40% away from its current price. Vapotherm Inc. (VAPO) Now that the coronavirus is spreading across the globe, businesses that develop respiratory treatments are becoming that much more important. VAPO is one such company. VAPO’s respiratory devices are designed to help those with chronic lung and breathing disorders. The POWR Ratings reveal VAPO has A grades in every category but for Industry Rank. VAPO is ranked third of 14 stocks in the Medical – Consumer Goods category. Want More Great Investing Ideas? 9 “BUY THE DIP” Growth Stocks for 2020 How HIGH Can This Tech Bubble Fly? 7 “Safe-Haven” Dividend Stocks for Turbulent Times INO shares were trading at $20.44 per share on Thursday morning, up $0.96 (+4.93%). Year-to-date, INO has gained 519.39%, versus a 1.28% rise in the benchmark S&P 500 index during the same period."}]}