{"article": [{"url": "https://stocknews.com/news/mck-ame-mxim-jkhy-adi-4-buy-rated-stocks-to-buy-now/", "published": 1596715700.0, "headline": "4 “Buy Rated” Stocks to BUY Now!", "body": "If you find it challenging to keep track of the stock market’s latest winners and losers, you are not alone. Though you could attempt to read all of the market-related news and take stock of the biggest winners and losers daily, you would chew up your limited free time. Instead of attempting to keep track of stocks through seemingly endless research, it is better to refer to our exclusive POWR Ratings. This system evaluates stocks based on comprehensive quantitative data to determine which are worthy of being upgraded and which should be downgraded. The latest POWR Rating upgrades reveal the following four stocks have been upgraded to Strong Buys: McKesson (MCK), Ametek (AME), Maxim Integrated Products (MXIM), and Jack Henry & Associates (JKHY). 7 \"SAFE HAVEN\" Dividend Stocks for Turbulent TimesMcKesson (MCK) Healthcare stocks are some of the safest investments during the COVID-19 pandemic. The rise of MCK is evidence of this. MCK provides care management products, information, and other services to decrease healthcare companies’ operational costs and enhance healthcare services quality. The POWR Ratings show MCK has A grades in the Buy & Hold and Trade POWR Components and B grades in the Peer and Industry Rank categories. MCK has moved up to a top-5 ranking out of nearly 70 Medical – Services stocks. Analysts have set an average price target of $180.77 for MCK, which is 15% higher than its current price. Add in the fact that MCK has a forward P/E ratio of 11.13, and it becomes quite clear that the stock is currently undervalued at its trading price of $157. MCK executives recently boosted the company’s ’21 guidance. Non-GAAP earnings per share are projected to be upwards of $15.50, which is quite the leap from the prior forecast of $14.75. MCK’s price returns are highlighted by an increase of 26.72% in 2019. Ametek (AME) Electromechanical devices and electronic instruments are AME’s bread and butter. With operations across the Americas, Asia, and Europe, AME has quite an intriguing business. Top analysts are bullish on AME, setting a price target just under $98. Check out AME’s POWR Ratings, and you will find As in every POWR Component except for Peer Grade, which is a B. AME is ranked 7th of nearly 60 stocks in the Industrial – Machinery sector. AME had a ’19 price return just under 50%. The company’s three-year price return was an impressive 49.50%. Look for AME to gradually move back toward its pre-COVID trading price of $103 in the weeks ahead. Maxim Integrated Products (MXIM) MXIM makes integrated circuits known as analog circuits used in consumer electronics, automobiles, computers, and more. MXIM has an A grade in each POWR Component, but its Peer Component, which is graded as a B. MXIM is ranked 13th of 86 stocks in the Semiconductor & Wireless Chip industry. MXIM has recent positive price returns. The company returned over 25% for 2019. Its three-year price return is over 70%. Take a look at the analysts’ take on MXIM, and you will find a price target of $70.83, meaning the stock is slightly underpriced, according to analysts. Analog Devices (ADI) recently agreed to acquire MXIM. Look for MXIM to continue escalating until the deal officially closes later this summer. Jack Henry & Associates (JKHY) Payment processing stocks have been on fire in recent months, especially those that process online payments. JKHY, a payment processing, and tech solutions provider for banks and credit unions in the United States, is currently trading just below its 52-week high of $195. JKHY has an A grade in its Buy & Hold Grade and Trade Grade POWR components and B grades in the remaining POWR components. JKHY is ranked in the top 10 out of 141 stocks in the Financial Services (Enterprise) industry. Take a look at JKHY’s price returns, and you will find this fintech stock has a one-year price return of 35.64% along with a three-year price return in excess over 75%. JKHY stands a good chance of returning to its 52-week high as the summer rounds out. Want More Great Investing Ideas? 9 “BUY THE DIP” Growth Stocks for 2020 How to Trade THIS Stock Bubble? 7 “Safe-Haven” Dividend Stocks for Turbulent Times MCK shares were trading at $152.99 per share on Thursday morning, down $0.68 (-0.44%). Year-to-date, MCK has gained 11.20%, versus a 4.20% rise in the benchmark S&P 500 index during the same period."}]}