{"article": [{"url": "https://stocknews.com/news/pe-wu-csiq-fang-mdy-spy-4-undervalued-mid-cap-stocks-with-explosive-growth-potential/", "published": 1597234100.0, "headline": "4 Undervalued Mid-Cap Stocks with EXPLOSIVE Growth Potential", "body": "Mid-cap stocks have been underperforming the S&P 500 so far this year. The SPDR S&P MIDCAP 400 ETF (MDY) is down 5%, while the SPDR S&P 500 (SPY) is up over 4% for the year. Over the last two months (June 8 to August 12), the MDY has lagged SPY as well. This leads me to believe that some mid-cap stocks are trading at low valuations. Mid-cap stocks are stocks that have market capitalizations between $2 billion and $10 billion. They are expected to grow faster than large caps but are deemed safer than small-cap stocks. In looking for undervalued mid-caps with explosive growth potential, I searched stocks with 3 to 5-year growth estimates over 20%. For valuation purposes, I only looked at stocks with a price-to-earnings (P/E) ratio under 15. 7 Best ETFs for the NEXT Bull MarketCombining growth and value can lead to finding stocks with significant price appreciation potential. As expected, two out of four of the stocks in my screen are in the energy sector. The energy sector has lagged the market due to low oil prices, but analysts believe that the energy sector will post near 20% revenue growth in 2021. Four mid-cap stocks that I believe are undervalued and offer strong growth potential are Parsley Energy (PE), Western Union (WU), Canadian Solar (CSIQ), and Diamondback Energy (FANG). Parsley Energy (PE) PE is an independent oil and gas producer in the United States that operates exclusively in the Permian Basin. The company drives growth through acquisitions and drilling in the Permian Basin spread across west Texas and New Mexico. PE owns approximately 190,000 acres in the Permian Basin, 148,500 acres in the Midland Basin, and 41,500 acres in the Delaware Basin. PE reached an agreement to acquire Jagged Peak Energy last October in an all-stock deal. The transaction, which was worth $1.8 billion, will help PE maintain a healthy balance sheet. The company reported earnings in August with an EPS of $0.03 compared with the average estimate of -$0.14. PE also lowered its current liabilities to $613 million from $958 million in the previous quarter. PE’s should maintain steady growth in the future due to its operations in the Permian Basin. The company has a 3 to 5-year EPS growth estimate of 36.53% and a trailing twelve-month P/E of 13.19. From a valuation perspective, the company is also undervalued through two different lenses. The stock is trading around $12, and Simply Wall St. set a fair value of $12.31 on the stock based on discounted cash flow analysis. According to TipRanks, the average analyst price target is $15. Western Union (WU) WU provides domestic and international money transfers through its global network of approximately 550,000 outside agents. It is the largest money transfer company in the world, with digital send capabilities in over 70 countries and bank account payout capabilities in over 100 markets. The company’s business is split into three segments: Consumer-to-Consumer, which transfers money between consumers, Business Solutions, which facilitates payments between small and medium-sized companies, and Other, which consists of bill payments in the U.S. and in Argentina. WU sold off its Speedpay business and its Paymap mortgage payments services business. The company can now stay focused on cross-border services for consumers, financial companies, banks, and other businesses. The company has also benefited through the growth of its digital platform. This includes westernunion.com and Mobile Money Transfer. They are WU’s fastest-growing business segment in terms of adding new customers and increasing business. WU has implemented a cost-cutting initiative to improve efficiency, profitability, and revenue growth. The company expects $50 million in annual savings for 2020, $100 million for 2021, and $150 million by 2022. The company has a long-term growth estimate of 25.77% and a trailing P/E of 13.59. PE reported earnings on August 4 with EPS of $0.41 and revenue of $1.11 billion. This beat analyst estimates of $0.35 and $1.08 billion. WU is rated a Buy in our exclusive POWR Ratings system. It holds grades of A in Trade Grade, Peer Grade, and Industry Rank, which are three components that make up the POWR Ratings. WU is also the #10 ranked stock in the Consumer Financial Services industry. Canadian Solar (CSIQ) CSIQ is a Canadian solar power company. It is an integrated provider of solar power products, services, and system solutions. The company engages in designing, developing, and manufacturing solar ingots, wafers, cells, modules, and other solar power products. CSIQ is operated through two business segments: the MSS segment and the Energy segment. The MSS segment involves the design, development, manufacturing, and sale of solar power products, and its Energy segment consists of solar power project development. The majority of the company’s revenue comes from the MSS segment. CSIQ has one of the largest utility-scale solar project development platforms in the world. It has brought into operation over 5.6 GWp of solar power plants in six continents. In the first quarter, the company shipped approximately 2,214MW of solar modules globally. This was an increase of 40.6% on a year-over-year. The company also has a strong project pipeline where it identifies development opportunities to deploy capital and ensure future growth. CSIQ has a strong balance sheet with $3.5 billion in cash. The company has a 3 to 5-year EPS growth estimate of 32% and a trailing P/E of 7.67. CSIQ reported earnings on August 7 with EPS of $0.09 and revenue of 695.5 million, both positive surprises. The company is rated a Buy in our POWR Ratings. It holds a grade of A in Trade Grade, our short-term indicator, and a B in Buy & Hold Grade and Industry Rank. Diamondback Energy (FANG) FANG an independent oil and gas producer in the United States. The company operates exclusively in the Permian Basin with around 394,000 net acres. Drilling activities are focused on the Wolfcamp, Spraberry, Clearfork, Bone Spring, and Cline formations. At the end of last year, the company reported net proven reserves of 1.1 billion barrels of oil equivalent. FANG acquired Energen Corp and Ajax Resources in 2018. These acquisitions have made FANG one of the leading oil producers in the Permian Basin. Energy companies have been transferring assets to a master limited partnership to monetize their properties. FANG is expected to follow this path as it can transfer assets to its Viper Energy Partners subsidiary, which should provide the company with a steady revenue stream. FANG also has an interest in Rattler Midstream, which owns assets in Midland and Delaware Basin. The company has a long-term growth estimate of 21.94% and a trailing P/E of 8.93. FANG also has a price to book (P/B) ratio of 0.7, which is lower than the industry average of 1.0, and the P/B of 3.9 for the S&P 500. The company reported earnings on August 3 with an EPS of $0.15, which was much higher than the consensus estimate of $0.03. Want More Great Investing Ideas? 3 Possible Directions for the Stock Market from Here How to Trade THIS Stock Bubble? 9 “BUY THE DIP” Growth Stocks for 2020 PE shares were unchanged in after-hours trading Wednesday. Year-to-date, PE has declined -33.84%, versus a 5.92% rise in the benchmark S&P 500 index during the same period."}]}