{"article": [{"url": "https://stocknews.com/news/sgen-fate-bpmc-the-3-top-biotech-stocks-that-hedge-fund-managers-love/", "published": 1602245300.0, "headline": "The 3 Top Biotech Stocks That Hedge Fund Managers LOVE", "body": "The biotech industry has been soaring this year, with the SPDR S&P Biotech ETF (XBI) up 26.6% year to date so far. The race for a COVID vaccine has primarily driven this performance, but what if there was another segment of the biotech industry that top hedge fund managers are all going after right now? While many managers are known to take risks, it’s certainly worth looking into if there is a consensus between them. The AlphaClone Alternative Alpha ETF (ALFA) tracks an index of equity securities that hedge funds have significant exposure to. The ETF’s top three holdings are all biotech firms working on cancer drugs. While many investors have their attention on biotech and pharmaceutical companies working on a COVID vaccine, big money has been focused on the next big thing in biotech, the future oncology drug boom. Cancer is the second leading cause of death in the U.S. behind heart disease. Almost everyone knows someone that has been affected by one of the many vicious types of cancer. There are now numerous companies focused on ways to treat and cure the various forms. While COVID is at the forefront, cancer is a long-term play. There is even an ETF that covers the cancer industry, the Loncar Cancer Immunotherapy ETF (CNCR), which is up over 39% over the last six months. 9 \"BUY THE DIP\" Growth Stocks For 2020As the oncology drug market is expected to reach $394 billion by 2027, here are the three top cancer stocks based on a consensus of hedge fund managers: Seattle Genetics (SGEN), Fate Therapeutics (FATE), and Blueprint Medicines (BPMC). Seattle Genetics (SGEN) SGEN is a biotech firm focused on developing antibody-drug conjugates. Its lead lymphoma drug, Adcetris, has been performing quite well since it launched, and it is the primary growth driver for the company. The drug’s label was also expanded, providing more revenue for the company. SGEN has been collaborating with Takeda (OTCMKTS:TKPHF), a Japanese pharmaceutical company, for the global development and commercialization of Adcetris. In addition to Adcetris, the company has a promising pipeline of drug candidates for its antibody-drug conjugate (ADC) technology. In December, the FDA granted accelerated approval to Padcev to treat patients with metastatic bladder cancer, who were previously treated with a checkpoint inhibitor and platinum-based chemotherapy. This drug was created in collaboration with Astellas Pharma (OTCMKTS:ALPMF), another pharmaceutical company. In April, the FDA approved Tukysa for the treatment of metastatic HER2-positive breast cancer. Investors should also be happy with the news Merck (MRK) plans to buy a 2.9% stake in SGEN. The companies are co-developing and selling SGEN’s breast cancer therapy, ladiratuzumab vedotin. The company is rated a “Strong Buy” in our POWR Ratings system, with a grade of “A” in Trade Grade, Buy & Hold Grade, and Peer Grade. Those are three out of the four components that make up the POWR Ratings. The stock is also ranked #2 out of 377 Biotech stocks. Fate Therapeutics (FATE) FATE is a clinical-stage biopharmaceutical company engaged in the development of programmed cellular immunotherapies for cancer and immune disorders. The company has been building up its pipeline of immuno-oncology product candidates. These treatments are designed to elicit an immune response in patients with cancer. The company’s progress with FT596 is encouraging. FT596 is cell cancer immunotherapy derived from its iPSC line. The induced pluripotent stem cell (iPSC) platform provides a competitive advantage for the company as iPSC cells are stem cells that can become almost any cell type. They are grown from the same cell instead of a patient’s donated cells. This means that one engineered cell line can be manufactured for many patients, creating what is known as off the shelf immunotherapy. If the development of this type of therapy is successful, this would reduce the cost of manufacturing and provide a potential cash cow for the company. FATE has entered into collaborations with other companies for fund and research expertise. It is currently working with Ono Pharmaceutical (OTCMKTS:OPHLY) for two off-the-shelf iPSC-derived CAR T-cell product candidates, and Janssen Biotech develop iPSC-derived CAR NK and CAR T-cell product candidates. FATE is rated a “Strong Buy” in our POWR Ratings system. It holds a grade of “A” in Trade Grade, Buy & Hold Grade, and Peer Grade. It is also ranked #24 out of 377 stocks in the Biotech industry. The stock is up a whopping 145.3% after finishing the day up 6.7%. Blueprint Medicines (BPMC) BPMC is a biopharmaceutical company focused on improving patients’ lives with diseases driven by abnormal kinase activation. The company has developed a small molecule drug pipeline in cancer. The firm’s lead product, Ayvakit, was approved by the FDA in January to treat metastatic gastrointestinal stromal tumor. The drug generated $5.7 million in the second quarter, so it’s off to a good start. The company is also looking to expand its label as it is being studied for advanced and smoldering forms of systemic mastocytosis, a condition where certain immune cells, called mast cells, build up under the skin and, or in the bones, intestines, and other organs. If approved for other labels, that should help drive further growth. Last month, the FDA approved the company’s second drug, Gavreto, for the treatment of RET fusion-positive NSCLC or non-small lung cancer. BPMC worked on the drug with Roche (OTCMKTS:RHHBY). Lung cancer is responsible for more cancer deaths than any other in men and women. If Gavreto can become a standard treatment, it could become a goldmine for the company. The drug can also treat medullary thyroid cancers. BPMC is rated a “Strong Buy” in our POWR Ratings system. It has grades of “A” in Trade Grade, Buy & Hold Grade, and Peer Grade. It is also the #9 ranked stock in the Biotech industry. The stock is up over 27% for the past three months and 8.5% over the past week. Want More Great Investing Ideas? 7 Best ETFs for the NEXT Bull Market What is the Cure for Stock Market Volatility? Chart of the Day- See Christian Tharp’s Stocks Ready to Breakout SGEN shares were unchanged in after-hours trading Friday. Year-to-date, SGEN has gained 75.72%, versus a 9.31% rise in the benchmark S&P 500 index during the same period."}]}