{"article": [{"url": "https://stocknews.com/news/spy-inx-dia-iwm-qqq-do-not-buy-this-dip/", "published": 1592050100.0, "headline": "Do NOT Buy This Dip!", "body": "Regular readers of my commentary know how violently I refuted the overdone and “bubble-like” rally in recent articles such as: Bull Market or Bull S#*t? REVISED 2020 Stock Market Outlook 7 \"SAFE HAVEN\" Dividend Stocks for Turbulent TimesYet when stocks broke above 3,000 it was clear that irrational exuberance had kicked in and it was necessary to run with the bulls for a little while. The key was to sleep with one eye open awaiting the eventual return of the bear market. This way you would be one of the first to the life boats when the ship started sinking. Why was the return of the bear market so obvious? Because we are in the midst of the worst economic event in our lifetimes. Yes, worse than the Great Recession. And that the amount of job loss in hand, and yet to come, equates to a severely weak economy that produces lower earnings and SHOULD produce much lower stock prices. And this is not blowing away any time soon. Also on the chart patterns front, there has never been a V bottom in bear market history. NEVER. Generally it is a 6 to 18 month process of making bottom > bouncing > retesting bottom > heading even lower. Then at some distant future the market finally finds an ultimate and lasting bottom before the next bull market emerges. To be believe that we found bottom 3 weeks into this bear market is unprecedented, fanciful and borderline insane. Now let’s face what is in front of us. Stocks bubbled up to a recent high of 3,233. That represents positive territory on the year and a mere 5% away from the all-time high. Pretty irrational when GDP and corporate earnings are cratering. Investors wisely pressed pause at that stage. Then shortly after we have a -6% stampede out the door on Thursday. This was followed by a wild session on Friday that see-sawed all day long. No doubt many investors are confused at this key juncture. Is the bull rally for real and thus we should buy this dip? Or is the illusion of this bear market rally coming to an end and so we should head to the exits? Even better, we should employ strategies to profit from the market heading lower (more on that below). You know what I think SHOULD happen given the fundamental and technical rationale shared above. The key thing is WILL it happen??? I believe the main catalyst to answer this question is the rate of coronavirus cases in the US. Early signs look like there is a meaningful spike in key states like Texas, Florida, Georgia and Arizona that tried to open up early. That was certainly behind the Thursday collapse. As we look across the country we still can’t seem to get below 20,000 cases a day on a regular basis. The needle has really been stuck at this mark for more than a month. And again, does modestly look on the rise of late including a spike to 27,221 on Friday. So if the rate of new cases continues to escalate, then the population will become more fearful leading to lower economic activity. That should have investors hitting the sell button pretty hard resulting in a break below key support 3,000. And that break would likely come with some FOMO trade to the downside as people would head to the exists quickly. Kind of like how the market seemed to go lower minute by minute on Thursday as no one wanted to be the last out the door. What to Do Next? It’s time for investors to give up the fantasy that the next bull market has emerged. Remember that the typical PE at the start of a new bull market is closer to 10…not 25 like now. Plus don’t forget that the virus is still very much in our midst and what that means for continued economic damage, job loss, lower earnings and yes, lower stock prices. My recommendation is to quickly enact strategies that actually produce profits when the market declines. The kind of strategy that I used to produce a +5.13% return the same week the S&P cratered -14.97% (March 16-20, 2020). The 4 stocks and 5 ETFs currently in my Reitmeister Total Return portfolio form an effective hedge allowing investors to enjoy gains while the market tumbles lower. It is not too late to get on board this strategy if you have not protected yourself already. Going forward I will look for spots to emerge from the hedge by buying more and more undervalued stocks for the eventual return to a bull market. I know its crazy out there. And I am trying my best to help investors make sense and profit from the situation. The best way for me to do that is give you 30 days access to the Reitmeister Total Return. This is my newsletter service where I share frequent commentaries on the market outlook, trading strategy, and yes, a portfolio of hand selected stocks and ETFs to produce profits whether we have a bull…a bear…or anywhere in between. Just click the link below to see 4 stocks and 5 ETFs in the portfolio now, and all the future trades as we find bottom on this bear and the new bull emerges. About Reitmeister Total Return newsletter & 30 Day Trial Wishing you a world of investment success! Steve Reitmeister …but everyone calls me Reity (pronounced “Righty”) CEO, Stock News Network and Editor, Reitmeister Total Return SPY shares closed at $304.21 on Friday, up $3.60 (+1.20%). Year-to-date, SPY has declined -4.93%, versus a % rise in the benchmark S&P 500 index during the same period."}]}