{"article": [{"url": "https://stocknews.com/news/tsla-bhp-vale-elon-musk-and-tesla-are-desperate-to-get-more-of/", "published": 1595592500.0, "headline": "Elon Musk and Tesla Are Desperate to Get More of THIS", "body": "This week on Tesla’s (TSLA) second-quarter earnings call CEO Elon Musk said that battery production is the company’s biggest current challenge. Specifically, there’s a shortage of nickel, which is a key ingredient in Tesla’s batteries. On the conference call, Musk pleaded, “any mining companies out there, please mine more nickel. Okay. Wherever you are in the world, please mine more nickel…Tesla will give you a giant contract for a long period of time if you mine nickel efficiently and in an environmentally sensitive way. So hopefully this message goes out to all mining companies. Please get nickel.” Musk is looking to secure nickel supply for his batteries because he understands that demand is going to increase over the coming decade as electric vehicles (EV) start taking greater market share. By 2030, sales of electric vehicles are expected to be higher than gas-powered vehicles. 9 \"BUY THE DIP\" Growth Stocks For 2020 Over the past two years, nickel prices have declined from $8 per lb. to $6 per lb, but the long-term fundamentals remain solid given the growth of the EV market. Nickel consumption for electric vehicles is expected to grow 64% by 2025. Increasing demand for nickel is a problem for Elon Musk, but it’s an opportunity for these two mining companies – BHP Group (BHP) and Vale (VALE): BHP Group (BHP) BHP is a leading, global miner of commodities. It recently made investments in Western Australia to further increase production in anticipation of increased demand for electric vehicles. It currently has 1.5 million tons in nickel reserves and is looking to expand this part of the business. Currently, nickel makes up about a small portion of its earnings, but it anticipates this to be one of its fastest-growing areas in the latter part of this decade as the EV market continues to grow. Its stock has an attractive valuation with a price to earnings ratio of 14. It also pays a 4.9% dividend. In addition to nickel, it also produces iron ore, copper, zinc, and molybdenum. BHP’s POWR Ratings are quite strong with a Strong Buy rating. It has an “A” for Trade Grade, Buy & Hold Grade, and Peer Grade with a “B” for Industry Rank. Among the Industrial – Metals sector, it’s ranked #1 out of 33. Vale (VALE) VALE is the world’s largest producer of nickel with mines in Brazil, Canada, and Indonesia as well as joint-venture partnerships in five continents. Currently, VALE is investing in new projects and partnerships to increase its nickel production by 70% in the next few years to 360,000 tons a year. VALE is up nearly 80% since its bottom in late-March. It has a very attractive forward price to earnings ratio of 6 and pays a 6.1% dividend. Among 8 Wall Street analysts, everyone has a higher price target for Vale than the current market price with an average price target of $13.89. VALE is ranked a Buy by the POWR Ratings. It has an “A” for Trade Grade and a “B” for Peer Grade and Industry Rank. It’s ranked #6 out of 33 in the Industrial – Metals sector. Want More Great Investing Ideas? 9 “BUY THE DIP” Growth Stocks for 2020 Newly REVISED 2020 Stock Market Outlook 7 “Safe-Haven” Dividend Stocks for Turbulent Times TSLA shares were trading at $1,442.13 per share on Friday afternoon, down $70.94 (-4.69%). Year-to-date, TSLA has gained 244.74%, versus a 0.68% rise in the benchmark S&P 500 index during the same period."}]}