{"article": [{"url": "https://stocknews.com/news/ual-wtw-hal-mtb-four-downgraded-stocks-to-avoid/", "published": 1601640500.0, "headline": "Four DOWNGRADED Stocks to AVOID", "body": "The latest POWR Ratings upgrades and downgrades have been calculated. Several stocks have been downgraded, many of which are now rated as Strong Sells. The purpose of running the POWR Rating upgrades/downgrades daily is to determine which stocks should be either purchased, sold, or shorted. If you own any of the stocks listed below, this is your opportunity to decrease your position, sell all of your shares or even short the stocks. 9 \"BUY THE DIP\" Growth Stocks For 2020The following four stocks were recently downgraded to Strong Sell POWR Ratings: M&T Bank (MTB), Halliburton Company (HAL), United Airline Holdings (UAL), and Weight Watchers International (WW). M&T Bank (MTB) Most customers and businesses who bank with MTB agree it is a solid financial institution. However, efficient banking combined with elite customer service does not guarantee a bull run for the stock. Like many other banks, MTB has been downgraded in the POWR Ratings. Though MTB provides a litany of financial services including retail/commercial banking, trusts, mortgage banking, insurance, asset management, and loans, the company’s stock has not bounced back following the coronavirus selloff. MTB has F and D grades in each POWR Component. The stock is ranked 9th of 10 in the Money Center Banks category. MTB has a year-to-date price return of -44% and a three-month price return of -8%. Furthermore, the company’s three-year price return is -39%. The top analysts are hesitant to recommend MTB as a Buy. Out of the eight analysts who have studied the stock, six recommend holding and only two recommend buying. Look for this regional bank stock to test its 52-week low of $85 before year’s end as customer loan defaults pile up. Halliburton Company (HAL) HAL is the latest oil business to be downgraded in the POWR Ratings. HAL conducts business in 80 nations yet its stock is struggling. There is some question as to whether oil will ever bounce back. If the sector continues to struggle through the new year, HAL is likely to test its 52-week low of $4.25 within the next year. HAL is a POWR Ratings dud with F and D grades in each POWR Component. The stock is ranked in the bottom half of 60 in the Energy – Services sector. HAL has a year-to-date price return of -49%. HAL’s one-month price return is -24%. Take a look at HAL analysis conducted by the top market analysts and you will find nearly two times as many recommend holding as opposed to buying. HAL is still priced above where it should be considering the status of its industry. A spike in coronavirus cases in Europe will hinder economic activity, hurting the likes of HAL all the more. Do not consider establishing a position in HAL until its forward P/E ratio drops to 15. This ratio is currently more than 22. United Airlines Holdings (UAL) The airline industry has not bounced back following the coronavirus dip. UAL might not return to its pre-COVID price level until an effective vaccine is provided to the masses. UAL transports passengers throughout North America, Latin America, the Middle East, Europe, and Asia. UAL’s POWR Ratings are concerning: F grades in the Trade Grade and Buy & Hold Grade categories, a D Industry Rank, and an average Peer Grade. UAL’s price returns are primarily in the red. The stock’s year-to-date price return is nearly -60%. UAL also has a three-year return of -42%. Out of seven analysts who have studied UAL, three rates it a Buy, three rates it a Hold, and one considers it a Sell. UAL has a long road ahead. Steer clear of this stock or consider shorting it until positive news emerges in terms of a coronavirus vaccine. Weight Watchers International (WW) The days of WW being a household name are long gone. Though WW had a nice run through the 90s and early aughts, its prime is clearly in the rearview mirror. WW is in desperate need of rebranding. Furthermore, the company has a plethora of competitors, many of which provide superior products. The POWR Ratings show WW has F grades in the Buy & Hold and Trade grade components along with a D Peer grade and an industry rank of 9 out of 14 stocks in the Medical – Consumer Good space. WW has a year-to-date price return of -52%, a three-month price return of -28%, and a three-year price return of -57%. Now that the masses are packing on the pounds during quarantine, it would make sense for WW to increase. However, the stock has moved sideways since a brief bump following its considerable COVID selloff. Unless you think WW is a takeover target, you should not own this stock. Want More Great Investing Ideas? Do NOT Buy Stocks Before the Election! 7 “Safe-Haven” Dividend Stocks for Turbulent Times Chart of the Day- See Christian Tharp’s Stocks Ready to Breakout UAL shares were trading at $34.22 per share on Friday morning, down $0.96 (-2.72%). Year-to-date, UAL has declined -61.15%, versus a 5.34% rise in the benchmark S&P 500 index during the same period."}]}