{"article": [{"url": "https://stocknews.com/news/nio-shares-of-nio-jump-and-the-stock-has-more-room/", "published": 1598443700.0, "headline": "Shares of NIO Jump and the Stock Has More Room To Run", "body": "A lot of attention has been paid to the big tech companies this year, and rightly so. Big tech is leading the market to record highs, despite what the coronavirus pandemic has done (and continues to do) to the global economy. Precious metals are another area getting a lot of space in the financial press. But in my opinion, the most exciting stocks in the market right now are electric vehicle (EV) companies. Unlike big tech companies and precious metals, there isn’t much in the way of fundamentals to support the surge in electric vehicle stocks. It’s all hype and future promise. NIO (NIO) 7 Best ETFs for the NEXT Bull MarketOne EV company that is having a monster year and has actually sold a product is NIO (NIO). NIO is billed as the Tesla of China. The stock has gotten noticed by the hype crowd and is up more than 400% for the year. The company does have over $1 billion in sales; still, NIO isn’t earning a profit, and it’s trading at 19x sales (which is crazy high). Just recently, the stock spiked from about $15 to $18 on a positive upgrade from a UBS analyst. The analyst raised the price target from $1 to $16 on improved fundamentals; however, the stock is trading close to $18, so I’m not sure that price target means all that much. Usually, I would suggest this is a put-buying opportunity, but you never know in this market. This is especially true with EV companies in a bubble. It’s hard to know how long bubbles can last until they’ve already popped. The options market is supporting the stock price of NIO at the moment. While its options are typically the realm of smaller traders, it looks like a big fund or trader took notice of NIO after the recent upgrade. This trader bought roughly 12,000 September 19 calls, with the stock trading just over $16. These calls were purchased in four large blocks, with prices ranging from about $0.80 up to $1.10. Generally speaking, NIO needs to climb above $20 in the next three weeks for these calls to pay off. Essentially, this is a million-dollar bet that NIO is going to keep climbing well over its UBS target price of $16. Despite the irrational valuation, it seems like at least one institutional investor thinks the good times will continue. I’m not sure I agree with that sentiment, but it’s hard to argue with the tape. Want more great investing ideas? Download free the “10-Step Options Trading Checklist” you need before making a trade. The Virtual Trading Pit Is Open: Trade Set-ups, Training, New Trading Ideas How to Try Out Options Without Risking a Penny NIO shares rose $0.18 (+0.88%) in after-hours trading Wednesday. Year-to-date, NIO has gained 408.46%, versus a 9.10% rise in the benchmark S&P 500 index during the same period."}]}