{"article": [{"url": "https://stocknews.com/news/abt-pen-algn-abmd-bio-5-healthcare-stocks-to-rejuvenate-your-portfolio/", "published": 1595333300.0, "headline": "5 Healthcare Stocks to REJUVENATE Your Portfolio", "body": "As the coronavirus began its assault, it became clear that doctor’s offices, hospitals, and dentist’s offices were areas where the disease was spreading. The world quickly adapted to this reality by isolating and separating those who had symptoms. Additionally, all non-emergency medical and dental treatment was halted. In recent weeks, these services are being restarted with an increased level of precaution with PPE, social distancing, and increased cleaning. Medical stocks will benefit from this reopening and should flourish for the rest of 2020 as people once again can see their medical practitioners. 7 \"SAFE HAVEN\" Dividend Stocks for Turbulent TimesHere are 5 healthcare stocks which can help rejuvenate your portfolio: Abott Laboratories (ABT) ABT manufactures and sells healthcare products around the globe, specializing in Diagnostic, Pharmaceutical, Vascular, and Nutritional products. ABT is now on the front line of coronavirus testing. The company has launched its ID NOW COVID-19 rapid test which is being used in nursing homes and urgent care clinics. It is the fastest-growing PCR test in the market today, thanks to its ability to deliver results within five minutes. This is just one of five tests developed by the company that has received authorization by the FDA for emergency use. Earlier this month, Abbott announced FDA approval of its next-generation Gallant implantable cardioverter-defibrillator and cardiac resynchronization therapy defibrillator devices to help manage heart rhythm disorders. These devices offer Bluetooth technology and a new patient smartphone app for improved remote monitoring and enhanced patient-physician engagement. ABT’s stock has gained close to 60% from the 2020 low it hit in March due to the overall dip in the market. The company’s strong recovery could be part of a growth momentum that could last well for the rest of 2020. ABT’s second-quarter EPS of $0.57 beat the consensus estimate by 35.7%. The company’s worldwide sales declined by 8.2% to $7.3 billion during the quarter on a reported basis. On an organic basis, worldwide sales decreased by 5.4%. The company expects a full-year 2020 EPS from continuing operations of at least $3.25. The company’s president and chief executive officer Robert B. Ford said, “Our diversified business model has proven to be a true strength during this time.” How does ABT stack up for the POWR Ratings? A for Trade Grade A for Buy & Hold Grade A for Industry Rank A for Peer Grade A for overall POWR Rating You can’t ask for better. The stock is also ranked #2 out of 213 stocks in the Medical – Pharmaceuticals Industry. Align Technology, Inc. (ALGN) Align designs and manufacturers medical devices and machines for use in dental records, orthodontics, and dentistry industries. The company operates in the United States and Internationally. While the company is expecting a loss in the second quarter due to the spread of the coronavirus and the subsequent shutting down of dentist and orthodontic clinics, ALGN’s earnings are expected to return to its previous trend once the situation normalizes. Though ALGN missed the consensus EPS estimate last quarter due to circumstances outside of its control, it beat estimates in the prior three quarters. The stock has also been performing pretty well as investors seem to have discounted its near-term weakness, adding close to 140% from its 52-week low on March 19th. It’s no surprise that ALGN is rated “Strong Buy” in our POWR Ratings system. It also has an “A” for Trade Grade, Buy & Hold Grade, and Peer Grade. In the 132-stock Medical – Devices & Equipment industry, it is ranked #6. Bio-Rad Laboratories, Inc. (BIO) BIO manufactures and sells medical diagnostics and Life Science research products. The company has been witnessing a growth in sales thanks to its Droplet Digital PCR and core PCR products due to their application in coronavirus research and testing. BIO’s recent price performance reflects its ability to capitalize on the demand for coronavirus research and testing products. The stock has gained more than 60% since hitting its year-to-date low in March. BIO has an impressive earnings surprise history with the company surpassing consensus EPS estimates in three of the four trailing quarters. BIO is rated “Strong Buy” in our POWR Ratings system, consistent with the strength in its business model. It also has an “A” for Trade Grade, Buy & Hold Grade, and Peer Grade. It is also ranked #5 out of 58 stocks in the Medical – Diagnostic/Research industry. ABIOMED, Inc. (ABMD) ABMD is a medical device company that focuses on circulatory support and care for heart recovery and acute heart failure patients. The FDA has recently approved digital data streaming about patient support for ABMD’s Automated Impella Controller (AIC). This new product will help doctors and clinicians to better monitor and care for patients thanks to AI-powered predictive information. ABMD’s stock has climbed close to 120% since hitting its 52-week low on March 23rd due to the overall dip in the market. This momentum should continue due to the expansion in its product line. ABMD’s strong fundamentals are reflected in its POWR Ratings, it has a “Strong Buy” rating with an “A” in Trade Grade, Buy & Hold and Peer Grade along with a “B” in Industry Rank. Within the Medical – Devices & Equipment group, it’s ranked #12 out of 132 stocks. Penumbra, Inc. (PEN) PEN is an innovative medical devices company that focuses on developing and marketing products for challenging medical conditions. The company recently announced the next phase of its vascular franchise – the Indigo System Lighting 12. This system is key to the future growth of the company due to its ability to help physicians with thrombus removal by effective clot detection mechanism. The move could cement PEN’s position as the market leader in clot management technology. PEN’s stock has recovered more than 60% from the 2020 low it hit in March due to the overall market crash. This momentum could be a positive indicator of its performance for the rest of the year. The earnings surprise history for ESTC looks pretty good, as the company beat the consensus EPS estimates in three out of the trailing four quarters. It’s no surprise that PEN is rated “Strong Buy” in our POWR Ratings system. It also has an “A” for Trade Grade, Buy & Hold Grade, and Peer Grade. In the 132-stock Medical – Devices & Equipment industry, it is ranked #15. Want More Great Investing Ideas? 9 “BUY THE DIP” Growth Stocks for 2020 Newly REVISED 2020 Stock Market Outlook 7 “Safe-Haven” Dividend Stocks for Turbulent Times ABT shares fell $0.09 (-0.09%) in after-hours trading Tuesday. Year-to-date, ABT has gained 14.44%, versus a 2.02% rise in the benchmark S&P 500 index during the same period."}]}