{"article": [{"url": "https://stocknews.com/news/clf-ccl-rcl-x-mpc-top-5-large-cap-dividend-stocks-for-july-10-2020/", "published": 1594382900.0, "headline": "Top 5 Large Cap Dividend Stocks for July 10, 2020", "body": "The top winners in the large cap US dividend space for Friday, July 10, 2020 are CLF, CCL, RCL, X, and MPC. Below is a recap of how they fared. Cleveland-Cliffs Inc (CLF) Daily Price Recap Cleveland-Cliffs Inc is up 15.03% ($0.75) since yesterday, marking a reversal from the day prior — and the end of a 3 day negative run. As for how volume fared, yesterday’s volume was up 140.19% from the previous day (Wednesday), and up 274.28% from Thursday of the week before. Below is a daily price chart of Cleveland-Cliffs Inc. Dividend investors may wish to pay attention to the dividend discount model value score of dividend stocks, and for CLF, its higher than that of 57.02% of US dividend-issuing stocks. 7 \"SAFE HAVEN\" Dividend Stocks for Turbulent TimesIs CLF a Buy, Hold or Sell? See the POWR Ratings now! Carnival Corp (CCL) Daily Price Recap 16.16 was the closing price of the day for Carnival Corp, resulting in today being one in which price moved up 10.84% ($1.58) from the previous day. As for how volume fared, yesterday’s volume was up 52.16% from the previous day (Wednesday), and up 141.85% from Thursday of the week before. Here is a daily price chart of Carnival Corp. Dividend investors may wish to pay attention to the annual compound dividend growth rate of dividend stocks, and for CCL, its higher than that of 64.14% of US dividend-issuing stocks. Is CCL a Buy, Hold or Sell? See the POWR Ratings now! Royal Caribbean Cruises Ltd (RCL) Daily Price Recap Royal Caribbean Cruises Ltd entered today at $51.82, up 9.97% ($4.7) from the day prior. As for how volume fared, yesterday’s volume was up 42.39% from the previous day (Wednesday), and up 33.89% from Thursday of the week before. Here is a daily price chart of Royal Caribbean Cruises Ltd. Dividend investors may wish to pay attention to the dividend discount model value score of dividend stocks, and for RCL, its higher than that of 62.81% of US dividend-issuing stocks. Is RCL a Buy, Hold or Sell? See the POWR Ratings now! United States Steel Corp (X) Daily Price Recap The end of a 3 day negative run has come for United States Steel Corp, which finished the previous day up 9.69% ($0.65). As for how volume fared, yesterday’s volume was up 57.52% from the previous day (Wednesday), and up 9.74% from Thursday of the week before. Here is a daily price chart of United States Steel Corp. As for X’s beta, it is currently lower than that of approximately 34.69% US dividend payers. Is X a Buy, Hold or Sell? See the POWR Ratings now! Marathon Petroleum Corp (MPC) Daily Price Recap Marathon Petroleum Corp is up 8.55% ($2.85) since yesterday, marking a reversal from the day prior — and the end of a 3 day negative run. The change in price came along side change in volume that was down 12.75% from previous day, but up 42.28% from the Thursday of last week. The daily price chart of Marathon Petroleum Corp below illustrates. Dividend investors may wish to pay attention to the beta of dividend stocks, and for MPC, its lower than that of 4.12% of US dividend-issuing stocks. Is MPC a Buy, Hold or Sell? See the POWR Ratings now! To further your research on dividend stocks, check out our list of dividend stocks sorted by yield. Want More Great Investing Ideas? 9 “BUY THE DIP” Growth Stocks for 2020 Is the Bull S#*t Rally FINALLY Over? 7 “Safe-Haven” Dividend Stocks for Turbulent Times Top 3 Investing Strategies for 2020 CLF shares fell $0.01 (-0.17%) in after-hours trading Friday. Year-to-date, CLF has declined -30.07%, versus a -0.31% rise in the benchmark S&P 500 index during the same period."}]}