{"article": [{"url": "https://stocknews.com/news/pg-abt-low-tgt-4-stocks-with-a-history-of-raising-dividends/", "published": 1601640500.0, "headline": "4 Stocks with a History of RAISING Dividends", "body": "The US economy is currently in a recession highlighted by lower consumer spending and a high unemployment rate. While the stock market skyrocketed in mid to late March thanks to the pandemic-led tech boom, the rally took a pause as looming uncertainties related to the upcoming presidential election, an arrival of a coronavirus vaccine, and rising geopolitical tensions. So, a more defensive strategy to play the market is to bet on dividend stocks that have the potential to maintain or increase their dividend payments. While many companies reduced or suspended their dividend payments this year, and many are considering following the same path, some companies still stand tall in terms of their dividend payments. The ability to increasingly return capital to shareholders indicates strength in their business models, which could help their stocks outperform the rest of the market. Stocks like Procter & Gamble Company (PG), Abbott Laboratories (ABT), Lowe’s Companies, Inc. (LOW), and Target Corporation (TGT) haven’t just been paying steady dividends, but have also increased their dividends over the last five years. So, these could be safe bets to ride out market uncertainty. 7 Best ETFs for the NEXT Bull MarketProcter & Gamble Company (PG) PG sells consumer goods under various brands. They operate in the health care, home care, grooming, beauty, and fabric care markets. The stock has gained 11.5% so far this year. The company issues an annual dividend of $3.16, which translates to a dividend yield of 2.27%. It has returned more capital to its shareholders over the past six years through dividends than 97.9% of other dividend-paying stocks in the United States. The company has also been steadily increasing its dividend, which has grown to $0.79 in 2020, from $0.48 in 2010. The CAGR for the company’s dividend was 3.1% over the past five years. Among the latest developments, PG has released the Oral-B iO, which is an innovative rechargeable toothbrush that has received approval from the ADA. The brush offers new features such as a redesigned brush head and linear magnetic drive. The company has also released Pampers Preemie Swaddlers, which are diapers meant for premature babies. It helps the development of premature babies by helping them sleep better. The company’s revenue is expected to grow 2.6% in 2021 and 3.6% in 2022. PG’s EPS is estimated to rise 6.9% next year and at a rate of 7.2% per annum over the next five years. How does PG stack up for the POWR Ratings? A for Trade Grade A for Buy & Hold Grade A for Peer Grade A for Industry Grade A for Overall POWR Rating You can’t ask for better. The stock is also ranked #1 out of 34 stocks in the Consumer Goods industry. Abbott Laboratories (ABT) ABT manufactures and markets healthcare products globally. The company operates in four segments: nutritional products, diagnostic products, vascular products, and established pharmaceutical products. ABT’s stock has delivered year-to-date returns of 25%. ABT delivers an annual dividend of $1.44, which translates to a dividend yield of 1.32%. Over the past six years, ABT has returned more capital to investors through dividends than 92.6% of US dividend-paying companies. ABT has increased its dividend from $0.24 in 2015 to $0.36 in 2020. The CAGR for the company’s dividend was 7.8% over the past five years. The company has recently announced the release of FreeStyle Libre 3, which is the world’s smallest sensor for Glucose in people with diabetes. The sensor has received the CE mark in Europe. The company’s revenue is expected to grow 3.6% in 2020 and 12.6% in 2021. ABT’s EPS is estimated to rise 24.9% next year and at a rate of 14.9% per annum over the next five years. It’s no surprise that ABT is rated a “Strong Buy” in our POWR Ratings system, with a grade of “A” in Trade Grade, Buy & Hold Grade, and Peer Grade. In the 239-stock Medical – Pharmaceuticals industry, it is ranked #2. Lowe’s Companies, Inc. (LOW) LOW operates as a home improvement company. It retails products related to remodeling, decorating, home repair, and home maintenance. The company’s stock has gained 39.6% so far this year. LOW issues an annual dividend of $2.2 which translates to a dividend yield of 1.33%. Over the past six years, the company has issued more dividends than 92.3% of US companies that are currently paying dividends. LOW has steadily increased its dividends to $0.6 in 2020 from $0.23 in 2015. The CAGR for the company’s dividend was 20.2% over the past five years. The company has recently announced that it will be offering tool rental services across its stores nationwide. Customers will be able to rent tools and equipment of all kinds for their home improvement needs. The company’s revenue is expected to grow 18.2% in the current quarter and 17.7% in 2021. LOW’s EPS is estimated to rise 48.3% this year and at a rate of 21.8% per annum over the next five years. LOW’s strong fundamentals are reflected in its POWR Ratings. It has a “Strong Buy” rating with an “A” in Trade Grade, Buy & Hold Grade, Peer Grade, and Industry Rank. In the 68-stock Home Improvement & Goods industry, it is ranked #2. Target Corporation (TGT) TGT operates as a general merchandise retailer in the United States and Canada. The company’s retail stores offer a wide selection of apparels, consumables, home products, and so on. TGT’s stock has been steadily bullish since hitting mid-March lows and has gained 23.7% so far this year. TGT pays an annual dividend of $2.72 which translates to a dividend yield of 1.73%. Over the last six years, the company has distributed more dividends than 92.4% of other US dividend-paying companies. TGT has steadily increased its dividends to $0.68 in 2020 from $0.52 in 2015. The CAGR for the company’s dividend was 6.5% over the past five years. The company has recently partnered with Shipt to allow same-day delivery of their apparel products to customers across the nation. The company’s revenue is expected to grow 10.5% in the current quarter and 12.9% in 2021. TGT’s EPS is estimated to rise 12.4% this year and at a rate of 7% per annum over the next five years. It’s no surprise that TGT is rated a “Strong Buy” in our POWR Ratings system, with a grade of “A” in Trade Grade, Buy & Hold Grade, Peer Grade, and Industry Rank. In the 18-stock Grocery/Big Box Retailers industry, it is ranked #3. Want More Great Investing Ideas? Do NOT Buy Stocks Before the Election! 7 “Safe-Haven” Dividend Stocks for Turbulent Times Chart of the Day- See Christian Tharp’s Stocks Ready to Breakout PG shares rose $0.29 (+0.21%) in after-hours trading Friday. Year-to-date, PG has gained 12.69%, versus a 5.19% rise in the benchmark S&P 500 index during the same period."}]}