{"article": [{"url": "https://stocknews.com/news/amzn-pg-t-panw-dltr-5-top-stocks-to-buy-when-the-market-plunges-again/", "published": 1594814900.0, "headline": "5 Top Stocks to BUY When the Market Plunges Again", "body": "No one knows when the current bull market will end, but we know that the economy is in trouble. Consumer spending has decreased, and unemployment hovers around 10%. Even if President Trump agrees to send another stimulus check to Americans, unfortunately, it won’t make a dent. Wall Street is clearly disconnected from Main Street. Many investors don’t realize that if a vaccine is discovered, it will take months to develop enough doses for the American populace. The pandemic’s only other solution is social distancing and mask-wearing, yet Americans are unwilling to take such measures for the greater good. If the market does significantly decline in the weeks or months ahead, there are a few stocks I expect to perform well. These include Amazon (AMZN), Procter & Gamble (PG), AT&T (T), Palo Alto Networks (PANW), and Dollar Tree (DLTR). 9 \"BUY THE DIP\" Growth Stocks For 2020Amazon (AMZN) Though your local mom and pop retail stores might have permanently closed, AMZN is open for business. AMZN is thriving amidst the recession. The beauty of AMZN is it does not require a brick-and-mortar store to make money. Add in the company’s popular video game streaming service known as Twitch, and its cloud infrastructure services, and you have a juggernaut that will excel no matter how bad the recession gets. You cannot go wrong investing in AMZN unless the federal government attempts to break it up due to alleged monopolistic practices. Check out AMZN’s analyst ratings, and you will find 37 analysts recommend buying the stock, while only two recommend holding, and one recommends selling. The POWR Ratings has AMZN rated as a Strong Buy with A grades in all four POWR Components. It should come as no surprise that AMZN is ranked first out of 54 Internet stocks. Procter & Gamble (PG) If we enter a prolonged recession or depression, people will still purchase must-have consumer goods. PG sells a litany of consumer essentials ranging from household care products to grooming products, health products and more. The POWR Ratings have PG ranked first of 33 companies in the Consumer Goods industry. PG has an A Grade in all POWR Ratings components except for Peer Grade. Analysts have set an average price target of $134.44 for PG. The stock is a safe play, even amidst a potential bear market. AT&T (T) T will continue its winning ways even if the market dips. Though T is no longer growing at a rapid pace, it provides a 6.99% dividend. The company’s HBO Max service will help the company capture a chunk of the streaming content market. The POWR Ratings show T has solid grades in all four POWR Components except for Trade Grade. The stock is ranked in the top 10 of Telecom – Domestic companies. T also has an astonishingly low forward P/E ratio of 9.34. Top analysts have set a price target of $35.38 for T. Palo Alto Networks (PANW) The cybersecurity industry will continue to thrive, even if the market sours. PANW provides this essential service, which is sure to rake in cash no matter how bad the economy gets. PANW’s brass was smart to shift toward a subscription service. Analysts anticipate PANW will reach $261.57. The POWR Ratings have PANW ranked first out of 23 stocks in the Software – Security industry. The stock has As in all four POWR Components except for Industry Rank. Dollar Tree (DLTR) A prolonged stock market dip will undoubtedly send more customers to discount stores such as those owned and operated by DLTR. Though DLTR has fared well amidst the coronavirus, the stock cpuld move even higher should we enter a bear market, and consumer purchasing power decreases even more. The stock is in the 16th ranked industry, Grocery and Big Box Retailers. DLTR should gradually climb higher as consumers watch how much they spend. Want More Great Investing Ideas? 9 “BUY THE DIP” Growth Stocks for 2020 Top 5 WINNING Stock Chart Patterns 7 “Safe-Haven” Dividend Stocks for Turbulent Times AMZN shares fell $3.06 (-0.10%) in after-hours trading Tuesday. Year-to-date, AMZN has gained 66.90%, versus a 0.11% rise in the benchmark S&P 500 index during the same period."}]}