{"article": [{"url": "https://stocknews.com/news/avgo-tmus-amt-cci-4-top-stocks-to-own-for-the-5g-revolution/", "published": 1601294900.0, "headline": "4 Top Stocks to Own for the 5G \"Revolution\"", "body": "The 5G revolution began in 2019 and gathered momentum in 2020. It will take several years for 5G to go mainstream as it is a generational shift. The current standard of 4G began in 2010. 5G is much bigger than 4G. It goes way beyond faster data speed and provides low latency, while connecting billions of devices to the internet simultaneously. 5G will make the Internet of Things (IoT) and other mission-critical applications like robotics, industrial automation, and autonomous vehicles a reality. So, early entrants should make a fortune over the coming decade. Knowing the growth potential, many tech and telecom companies are investing billions of dollars in 5G infrastructure in the early stages. Gartner expects worldwide 5G network infrastructure market revenue to almost double in 2020. The 5G revolution has created a tremendous opportunity for the entire supply chain in the communications space. CSPs are building 5G networks that would require more network equipment, cell towers, and fiber-optic wiring than 4G. As an investor, you can capitalize on the 5G opportunity by investing in frontrunners like Broadcom Inc. (AVGO), T-Mobile US, Inc. (TMUS), American Tower Corporation (REIT) (AMT), and Crown Castle International Corp. (REIT) (CCI). 7 Best ETFs for the NEXT Bull MarketBroadcom Inc. (AVGO) AVGO is a giant in the communication semiconductor space, growing through acquisitions. These acquisitions have broadened its portfolio, which now includes data center, networking, enterprise software, broadband, wireless, storage, and industrial. Hence, it comes as no surprise that it provides end-to-end network switching solutions for the Ethernet-based 5G New Radios and base stations. The 5G mobile networks would require 10x more capacity than 4G, driving demand for AVGO’s equipment. Not only infrastructure, but AVGO also caters to end-devices. It is the largest component supplier for Apple (AAPL) and will benefit from 5G iPhones as semiconductor content per phone increases with technological advancement. One thing that works in AVGO’s favor is the feud between the United States and network infrastructure leader Huawei. Many countries are abandoning the Chinese company’s equipment due to national security concerns, which is an opportunity for the US-based AVGO. While 5G has set the momentum for AVGO’s long-term growth, the pandemic-driven remote working culture is driving short-term growth. This is because of AVGO’s entry in the enterprise software space with the acquisition of CA Technologies and Symantec. AVGO stock surged 29% last year, 17% year-to-date, and the analysts expect it to surge another 12.5% to the consensus price target of $401.3. The street expects AVGO’s revenue to increase by 5.5% this year and 8.8% next year. This incremental growth puts AVGO as a “Strong Buy” in our POWR Ratings system. It holds a grade of “A” in Trade Grade, Peer Grade, and Buy & Hold Grade, and a “B” for Industry Rank. It is also the #1 ranked stock in the 86-stock Semiconductor & Wireless Chip industry. T-Mobile US, Inc. (TMUS) TMUS has become the hottest stock in the telecom space, as it finally completed the Sprint merger on April 1st, after years of regulatory issues. Following the merger, TMUS overtook AT&T (T) and Verizon Communications (VZ) and claimed national dominance in low- and mid-band spectrum licenses and mobile 5G network. And TMUS is just getting started. It is adding significant capacity in the mid-band 2.5GHz spectrum, which it acquired from Sprint. Even though the stock is trading near its 20-year high, the street is bullish on the stock because of its spectrum position. The consensus Wall Street price target of $136.9 represents an upside potential of 22%. The stock surged 23% last year and 43% year-to-date. The street expects TMUS’ revenue to increase 47.3% this year because of the Sprint merger and 14.3% next year. TMUS is rated a “Strong Buy” in the POWR Ratings. It holds “A”s in Trade Grade, Peer Grade, and Buy & Hold Grade, and a “B” for Industry Rank. It is the #4 ranked stock in the 24-stock Telecom – Domestic industry. American Tower Corporation (REIT) (AMT) It is not just the tech and telecom companies that are riding the 5G wave. Even the cell tower real estate investment trusts (REITs) are benefitting from the 5G moves. AMT buys land, builds tower infrastructure, and leases the tower to several wireless communications service providers. The more tenants it gets, the higher is its revenue without additional investments. As it enters long-term leases, the cash flows from rental income becomes predictable. The 5G wave is increasing the demand for more cell towers. TMUS is firing from all cylinders to boost 5G infrastructure in the United States. It has signed a new 15-year agreement with AMT, which has a portfolio of around 181,000 communications sites. The street expects AMT’s revenue and EPS to increase by 6.5% and 20.9%, respectively, next year, highlighting its ability to make more revenue and profit from its portfolio. AMT stock surged 48% last year and 5.7% year-to-date. It has a consensus price target of $284.4, representing an upside potential of 18.6%. It comes as no surprise that AMT is rated a “Buy” in the POWR Ratings. It holds an “A” in Peer Grade, and a “B” in Industry Rank and Buy & Hold Grade. It is also the #1 ranked stock in the 50-stock REITs – Diversified industry. Crown Castle International Corp. (REIT) (CCI) Just like AMT, CCI is also benefiting from its portfolio of over 40,000 cell towers, 80,000 route miles of fiber, and 70,000 small cells either on-air or under development. Its macro towers are supporting the US 4G wireless network system. Initially, REITs put in a lot of capital to build their portfolio and earn a higher return on investment over time. CCI’s investments in towers are now giving a 10% return as compared to 3% 20 years back. CCI’s small cells and fiber-optic cables portfolio is currently in the early stages and has lower returns. This segment of its portfolio has a lot of room to accommodate more tenants. As the United States transitions to 5G, the demand for its smaller cells and fiber-optic cables would increase. Just like its tower portfolio, this segment would generate significant returns as 5G becomes more widespread over the long term. The street expects CCI’s revenue and EPS to increase by 6.8% and 37.4%, respectively, next year. The stock surged 35% last year, 16% year-to-date, and it has the potential to rise another 9.5% to the consensus price target of $176.94. CCI stock is rated a “Buy” in our POWR Ratings system. It also has a grade of “B” in Trade Grade, Peer Grade, and Buy & Hold Grade. In the 44-stock Real Estate Services industry, it is ranked #14. Want More Great Investing Ideas? 7 “Safe-Haven” Dividend Stocks for Turbulent Times When Does the Next Bull Run Start? Chart of the Day- See the Stocks Ready to Breakout AVGO shares were trading at $366.46 per share on Monday afternoon, up $9.66 (+2.71%). Year-to-date, AVGO has gained 20.23%, versus a 5.34% rise in the benchmark S&P 500 index during the same period."}]}