{"article": [{"url": "https://stocknews.com/news/ctsh-a-tech-stock-that-has-more-room-to-run/", "published": 1597234100.0, "headline": "A Tech Stock That Has More Room to Run", "body": "On June 10, the Nasdaq closed above 10,000 for the first time in history. Even more remarkable is that the index closed above 11,000 less than two months later! The Nasdaq is heavily weighted with tech stocks, which have been red-hot lately. I’ll give you an example. One of the ratios I like to watch is the Nasdaq Composite divided by the S&P 500. When the line is rising, that means tech stocks are leading the market. Conversely, when the line is falling, tech stocks are lagging. In the late 1990s, this ratio went bonkers. In October 1998, was at 1.5. Less than 18 months later, the ratio peaked at 3.5. That’s an astonishing increase and that shows just how dramatic the tech bubble was. 9 \"BUY THE DIP\" Growth Stocks For 2020Here’s the ratio going back 30 years. The Great Tech Bubble really stands out. But here’s the interesting thing. Yes, the tech bubble burst, and all those dot-com stocks went bust. Yes, the ratio fell all the way back to 1.4. But here we are more than 20 years later, and the ratio is back up to 3.27. In other words, the Nasdaq has nearly outperformed, even if we compare it to that crazy peak. In fact, the ratio has been especially strong over the last year. Since the end of September last year until today, the S&P 500 is up 13%, while the Nasdaq is up 38%. I really like tech stocks, but should the Nasdaq really be doing three times better than the S&P 500? I don’t know about that. Let’s be honest: there’s been some decent news for the market and the economy recently. Goldman Sachs raised its growth estimate for next year to 6.2%, also noting that it sees a vaccine being approved before the end of the year. The Wall Street investment house also predicts unemployment falling to 6.2% by the end of 2021. I hope they’re right. Last Friday, we got the July jobs report and the numbers weren’t that bad. The U.S. economy created 1.763 million jobs last month. Expectations were for 1.48 million. (I think it would be more accurate to say that many of those 1.763 million Americans returned to their jobs rather than a new being created.) The number of unemployed folks fell by 1.4 million to 16.3 million. The unemployment rate dropped to 10.2%. It’s odd to see an unemployment rate of 10.2% as being good, but it’s better than where we were. Two other key stats: The labor force participation rate was 61.4% and average hourly earnings rose 0.2%. Not great, but not bad either. Cognizant Technology Solutions Impressed Wall Street I think there are plenty of stocks poised to ride the recovery. Unfortunately, Nasdaq is not the best place to find bargains, but that doesn’t mean there aren’t opportunities. Cognizant Technology Solutions (CTSH) One stock that looks quite good right now is Cognizant Technology Solutions (CTSH), one of the leading companies in IT outsourcing. In plainer terms, Cognizant runs all those call centers. Technically, Cognizant is based in New Jersey, but its heart is in India, where roughly 200,000 of its 280,000 employees are based. Outsourcing has become a profitable business, enabling American tech companies to cut costs. Despite what its critics think, Cognizant is also a big employer in this country. The company employs about 50,000 people in the U.S. at 32 locations around the country. The company began life as the in-house tech firm of Dun & Bradstreet. It was later renamed Cognizant Technology Solutions and it started trading publicly in 1998. One of the reasons why I highlight Cognizant is that it’s not outrageously expensive. Right now, the shares are going for just under 17 times next year’s earnings. I was also impressed by Cognizant’s last earnings report. For Q2, Cognizant earned 82 cents per share. That was well above Wall Street’s consensus of 69 cents per share. Quarterly revenues hit $4 billion which also beat estimates of $3.84 billion. I was particularly impressed by Cognizant’s guidance for this year. The company now sees 2020 earnings ranging between $3.48 and $3.58 per share. Wall Street had been expecting $3.39 per share. Wall Street is catching on. After the earnings report, the analyst from JP Morgan upgraded the stock and raised his price target to $69 per share. Cognizant is one of the few Nasdaq stocks with a share price that’s not in orbit. This is a company in a great position to profit as the economy gets back on its feet. Want more great investing ideas? Download free the “10-Step Options Trading Checklist” you need before making a trade. The Virtual Trading Pit Is Open: Trade Set-ups, Training, New Trading Ideas How to Try Out Options Without Risking a Penny CTSH shares were unchanged in after-hours trading Wednesday. Year-to-date, CTSH has gained 8.79%, versus a 5.92% rise in the benchmark S&P 500 index during the same period."}]}