{"article": [{"url": "https://stocknews.com/news/spy-how-to-protect-your-retirement-portfolio-from-election-uncertainty/", "published": 1598011700.0, "headline": "How to Protect Your Retirement Portfolio From Election Uncertainty", "body": "In part one of this series, I explained who was likely to win the Presidential election in November, and why that actually matters far less than who wins the Senate, which is shaping up to be the true nailbiter on election night. With the S&P 500 now extremely overvalued, and thus priced for nothing surprising happening, it’s more important than ever for retirees to protect their hard-earned savings from the incredible political uncertainty facing us today. In this article let’s start by examining every potential scenario of how the election might play out and what that might mean for not just the stock market, but more importantly the economy and bond market as well. Finally, I’ll show you how to best protect your retirement portfolio, no matter what happens with the actual election. How the 2020 Election Might Effect the Economy And Stock & Bond Markets Rather than speculate about how the election might affect the fundamentals of the economy and thus the stock and bond markets, I’ll leave it to the blue-chip economists at UBS to do that. MarketWatch tracks 45 teams of economists, and UBS is considered one of the 16 most accurate, thus consistently earning a spot in its “blue-chip economist consensus. In fact, UBS has won MarketWatch’s economist of the month contest no less than 11 times over the past decade, by most accurately forecasting 11 economics reports for each month. How UBS Won the Most Accurate Economist of July Contest 7 \"SAFE HAVEN\" Dividend Stocks for Turbulent Times(Source: MarketWatch) Basically, economists at UBS are among the best in the world at understanding the incredibly complex interplay of how various factors affect the economy. Here’s how UBS estimates the November elections could affect the fundamentals that will ultimately drive the stock and bond markets. (Source: UBS) It might surprise some investors that a blue-wave that sees the Democrats gain control of both the executive and legislative branches might be considered a slight positive for the economy. However, the reason for this has to do with the pandemic and the ravages it’s having on the economy. While Democrats are more likely to raise taxes and increase regulations, they are also more likely to spend heavily on stimulus, which UBS considers sufficient to offset the negative effects of taxes and regulations. You can see that from the HEROS bill that passed the House, which was $3.4 trillion in size, compared to the Senate’s GOP version, the $1 trillion HEALS act. In contrast, a split government, which is normally what Wall Street loves to see (because it means major reforms are less likely due to gridlock) is seen as neutral or even a slight negative. That’s because in the worst economy in 75 years, large stimulus is considered necessary by almost economists to minimize the risks of a double-dip recession. In fact, Moody’s Chief Economist has outright said that without at least a $1.5 trillion Phase four stimulus bill, he expects a double-dip recession that could cause unemployment to remain 10+% until the pandemic is over. According to the Centers for Infectious Disease Research & Policy (CIDRAP), that’s not likely until mid-2022. But that’s the economy, what about the stock and bond markets? (Source: UBS) As far as stocks go, almost any way the election goes is neutral, to slightly positive or negative according to the blue-chip economists at UBS. For the bond market, blue-wave scenarios might use interest rates to rise due to higher stimulus hopes and the potential for a faster economic recovery. In a red wave, scenario interest rates might also rise a bit, though potentially a smaller amount. What if UBS is wrong? This is where the power of risk management comes in, courtesy of another blue-chip economist team, from JPMorgan. The Smartest Way to Protect Your Retirement Portfolio No Matter Who Wins In November (Source: Imgflip) Warren Buffett has managed to successfully compound investors’ wealth at about 20% CAGR since 1965 and he’s done that through every imaginable combination of political outcomes. UBS seems to think that no matter who wins in November, the stock and bond market will be OK. But, with short-term correction risk high, not only from elevated stock valuations, but all manner of other critical risk factors facing us now here’s what JPMorgan’s blue-chip economist team has to say about retiree portfolios. (Source: JPMorgan Asset Management) As far as the election goes, the market isn’t expected to move much in either direction. In fact, the Democratic sweep scenario is likely overly dramatic because it’s based on a President Warren or Sanders and corporate taxes rising from 21% back to 35% Biden has proposed a 28% corporate tax rate and every economist agrees that he’s far more centrist than either Warren or Sanders. Note how even the GOP Sweep that UBS considers neutral to positive for stocks is expected to deliver very modest gains for the stock market. Similarly, the trade war, rising inflation, and of course, the pandemic going poorly are far more important to the equity markets, resulting in 2X to 6X as large a potential negative decline. So here is where the power of prudent risk management comes in. Let’s consider a 75/25 stock/bond portfolio, which Wharton Professor Jeremy Siegel considers the “new 60/40”. Let’s see how this balanced stock/bond portfolio would fair according to JPMorgan’s stress test scenarios, including the uncertainty facing us with the 2020 elections. (Source: JPMorgan Asset Management) Note that the use of bonds has resulted in a far less dramatic portfolio, in any short-term risk scenario. The S&P 500 is expected to fall 22% during a pandemic induced double-dip recession, yet this 75/25 balanced portfolio just 16.5% and a more conservative 60/40 portfolio 15.5%. In either extreme election scenario, where stocks fall or rise by about 4%, this portfolio is far more stable and barely moves more than a 60/40 portfolio. What about the concerns many retirees have about rising interest rates hurting bond returns? (Source: JPMorgan Asset Management) In the event that the 10-year yield soars 1.5% quickly, then bonds are expected to fall by about 11%. That represents a 2% 10-year yield, which happens to be Moody’s long-term average forecast for 10-year Treasuries. But remember that interest rates rising this quickly tends to only happen in a strong economy which means that the stocks in your portfolio would do well. Moody’s, and most economists, including those at the Congressional Budget Office, don’t expect long-term rates to return to 2% to 2.6% until 2030. Yet even if they shot that high within a year, JPMorgan’s economists think a 75/25 and 60/40 portfolio would do just fine. In fact, they would deliver roughly historical returns as they have in the past. If You Are REALLY Concerned About Short-Term Risks Consider an Even More Conservative Asset Allocation What if you are losing sleep at night worried about all the risks facing us now? And what if your portfolio is large enough that strong returns over time take a back seat to merely good enough returns that offset inflation and preserve your standard of living in retirement? Then a more conservative allocation of stocks/bonds/cash is potentially right for your needs and risk profile. We’ve already seen how a 75/25 and 60/40 stock/bond allocations perform in JPMorgan’s stress tests, but here’s how a more conservative 50/50 and even ultra-conservative 30/70 portfolio perform. Note that 30/70 is about as conservative as most financial advisors recommend anyone get, especially in an ultra-low rate world that is expected to continue for the foreseeable future. (Source: JPMorgan Asset Management) Note that the inflation spike scenario that JPMorgan’s economists have model is NOT a decline due to rising interest rates. It models the Fed hiking short-term interest rates too far, too fast and causing a mild recession and thus a stock market correction. Remember that the most severe market scenario as far as stocks go is a 22% bear market that JPMorgan estimates would occur should we experience a pandemic induced double-dip recession. In that scenario, which is the greatest short-term risk to retirees, a 50/50 portfolio falls just 11% while a 30/70 portfolio nearly 2/3 less. The election wouldn’t be expected to move your portfolio much in either direction allowing you to sleep well at night or SWAN, no matter who wins in November. Similarly, a bad outcome in the trade war would barely register on your radar, showcasing the power of asset allocation to build a bunker portfolio no matter what happens with current events or the economy in the short-term. But what about rising interest rates such as that sudden 1.5% spike in 10-year Treasury yields? What if retirees are so worried about stocks in the short-term that they own too many bonds and post-pandemic interest rates soar and crush their portfolios? (Source: JPMorgan Asset Management) Even a 30/70 stock/bond portfolio is expected to deliver modestly positive returns in a booming economy that sees interest rates soar. That’s courtesy of the stock portion of your portfolio that would benefit from strong corporate earnings growth a thriving economy brings. Obviously a 50/50 portfolio would be expected to do better since it has more allocation to stocks. The point is that prudent asset allocation, not market timing, is the smartest way to deal with uncertainty, not just political, but any kind of risks facing us today. Here is how a 60/40 and 40/60 portfolio handled the last 20 years, which saw interest rates ranging from 0.5% to 6.5% on the 10-year yield, and two 50+% market crashes. Note how the average investor, who has a horrible track record of market timing, achieved less than half the nominal returns. And after inflation, they barely saw positive returns at all. Behind insufficient savings (which determine 76% of retirement portfolio success over time) market timing is the greatest retirement dream killer in history. Want More Great Investing Ideas? The Best of StockNews 2 Step Process to Sell @ Market Top in September 9 “BUY THE DIP” Growth Stocks for 2020 SPY shares were trading at $338.41 per share on Friday morning, up $0.13 (+0.04%). Year-to-date, SPY has gained 6.23%, versus a % rise in the benchmark S&P 500 index during the same period."}]}