{"article": [{"url": "https://stocknews.com/news/tsla-as-tesla-shares-slide-today-is-it-an-opportunity-to/", "published": 1598962100.0, "headline": "As Tesla Shares Slide Today, is it a Buying Opportunity?", "body": "Tesla shares are cooling down after the company announces a $5 billion share sale. Tesla’s CEO Elon Musk elevation to become the world’s third-richest may garner attention. The first trading day after the split could trigger a drop, followed by a bounce. There can be too much of a good thing – Tesla (TSLA) has dipped under $500 per share after it announced a sale of around $5 billion worth of stocks. The electric vehicle maker wants to raise some capital, after shares have rallied 70% since August 11. Goldman Sachs, Citibank, Bank of America, Morgan Stanley, and other top banks have been hired to get the new shares into investors’ hands. Pouring more equity onto the markets has disrupted the demand-supply equilibrium and pushed Tesla’s stocks off the highs. Is the $5 billion sale the pinprick bursting the bubble? Skeptics examine the EV maker’s meager sales – especially in comparison to legacy automobile companies – and financial struggles and would agree that shares are due for a retracement. 7 \"SAFE HAVEN\" Dividend Stocks for Turbulent TimesHowever, markets can stay irrationally exuberant for an extended time. Tesla has competitors – Workhorse being one of the more promising ones – but it enjoys the allure of founder Elon Musk. The celebrity billionaire is now the world’s third-richest person, leaving Facebook founder Mark Zuckerberg behind. Musk – who has 38 million+ Twitter followers – is also running SpaceX which just concluded another successful satellite launch en route to his aspiration to go to Mars. Some see the rush into Tesla’s shares as a religion – with believers disinterested in financial figures. For traders, the only consideration is when to buy and when to sell – and the flow of funds into the stock triggers Fear of Missing Out (FOMO). That FOMO can still earn traders a handsome profit. TSLA Stock Price One of the more logical reasons for piling into TSLA was its announcement on August 11 that it would perform a 5- for-1 split in shares, making them more accessible to the retail crowd. That common financial exercise has now happened. On one hand, the news of the sale share and a “buy the rumor and sell the news” response to the split may turn into a perfect storm to push prices lower. On the other hand, the current share price of around $480 and not above $2,000 indeed serves to attract smaller investors and gradually push the price higher. Overall, one could expect a short-term decline in the stock followed by a resumption of gains for TSLA. TSLA shares were trading at $479.57 per share on Tuesday afternoon, down $18.75 (-3.76%). Year-to-date, TSLA has gained 473.20%, versus a 10.32% rise in the benchmark S&P 500 index during the same period."}]}