{"article": [{"url": "https://stocknews.com/news/avgo-adi-nxpi-mxim-4-semiconductor-stocks-ready-to-move-higher/", "published": 1594210100.0, "headline": "4 Semiconductor Stocks Ready to Move Higher", "body": "Business is booming for the semiconductor sector. Though consumer spending has been impacted by the coronavirus, tech spending has increased due to the shift to remote work and school from home. This is on top of the already secular shift towards increased spending on the cloud and software-as-a-service. All tech spending eventually flows to semiconductors, as computer chips are a foundational part. If your portfolio does not have at least one semiconductor stock, it is time to add one – or several. Let’s take a look at four of the more intriguing semiconductor stocks: Broadcom (AVGO), Analog Devices (ADI), NXP Semiconductors (NXPI), and Maxim Integrated Products (MXIM). Broadcom (AVGO) 9 \"BUY THE DIP\" Growth Stocks For 2020When it comes to semiconductors, most investors rightfully favor the industry’s dominant players. AVGO is one of the best and its products are found in Apple (AAPL) phones, computers, and tablets in addition to networking equipment. Based in Singapore, AVGO has weathered the coronavirus storm quite well, reporting nearly $6 billion in earnings in the most recent quarter. This is a 4% increase on a year-over-year basis. AVGO’s growth rate across the past half-decade is an impressive 125%. AVGO’s POWR Ratings are flawless: A ratings in all POWR Components, a ranking of 4 out of 86 stocks in the Semiconductor & Wireless Chip segment, and price returns in the green across all periods going back to 2015. The analysts have set a price target of $353.04 for AVGO, indicating there is still 13% above the current price. With a forward P/E ratio of 14.55, AVGO provides fantastic value for a tech stock in a hot segment. Analog Devices (ADI) Digital signal integrated processing circuits are necessary for computers used by consumers and businesses alike. ADI makes these circuits along with the mixed-signal and high-performance analog varieties. ADI circuits will be used in self-driving vehicles, green electric vehicles, 5G technology, smart sensors, and automated solutions across numerous industries in the years to come. These are all growing rapidly and give ADI a promising outlook. The POWR Ratings show ADI has “A” POWR Component grades in all categories but for its Peer Grade. ADI is ranked 8th of 86 stocks in the Semiconductor & Wireless Chip category. ADI’s average analyst price target is $127. NXP Semiconductors (NXPI) NXPI is expected to grow revenue next year around 10%, however, it remains reasonably valued compared to its peers with a forward p/e ratio of 15. If the trade war between China and the US intensified, NXPI is in a good position to capitalize and pick up more business due to its Netherlands home base and production outside of China. Further, NXPI has exposure to new offerings in emerging spaces such as autonomous vehicles, the internet of things (IoT), and mobile wallets. The POWR Ratings have NXPI ranked 30th of 86 stocks in the Semiconductor & Wireless Chip space with a “B” Trade Grade and an “A” for Industry Rank. NXPI’s average analyst price target is $119.77 which is 4% above the current price. Maxim Integrated Products (MXIM) MXIM has been in the semiconductor business since the 1980s. The company’s bread and butter are integrated circuits, also known as analog circuits. It’s strategically positioned to benefit from growth in a variety of areas including automation, solar cells, vehicular IoT, the 5G rollout, and wearables. Over the last decade, MXIM has generated nearly 80% growth. The POWR Ratings show MXIM is ranked 12 of 86 stocks in the Semiconductor & Wireless Chip segment. MXIM has a Strong Buy rating and an “A” POWR Component grade in every single component. MXIM’s price returns are strong as well: a three-month price return of nearly 20%, a 25% price return in 2019, and a three-year price return of nearly 50%. Want More Great Investing Ideas? 9 “BUY THE DIP” Growth Stocks for 2020 Is the Bull S#*t Rally FINALLY Over? 7 “Safe-Haven” Dividend Stocks for Turbulent Times Top 3 Investing Strategies for 2020 AVGO shares were trading at $317.24 per share on Wednesday afternoon, up $4.12 (+1.32%). Year-to-date, AVGO has gained 3.14%, versus a -1.35% rise in the benchmark S&P 500 index during the same period."}]}