{"article": [{"url": "https://stocknews.com/news/u-snow-amzn-aapl-goog-2-winners-and-2-losers-from-the-unity-ipo/", "published": 1600344500.0, "headline": "2 Winners and 2 Losers from the Unity IPO", "body": "The IPO market is on fire. Yesterday, Snowflake (SNOW) had the largest software IPO in history, as it finished more than 100% higher. The stock was expected to open at $120. Instead, it opened at $245 due to better than expected demand. SNOW ended the day with a valuation of over $70 billion. To put this in perspective, the company raised $400 million at a valuation of $12.9 billion in February. 7 Best ETFs for the NEXT Bull MarketAlthough people piling into the IPO believe SNOW has promising prospects, it’s only generated $400 million in revenue over the last 12 months which makes it one of the most expensive stocks in the market based on price to sales. Unity Software This enthusiasm and strong debut show that there’s an appetite for platform-based companies with accelerating revenue growth, an expanding total addressable market, high margins, and sticky products. Now, another stock is going public with many of these same characteristics – Unity Software (U). The stock is expected to open between $44 and $48 per share, as Unity hopes to raise $1.2 billion which would give the company a valuation of $12 billion. Unity’s Story Unity Software was founded in 2004. Its primary product is a video game development engine. In recent years, its platform and 3D tools are being used by developers across a variety of sectors to develop non-gaming applications. Over the last 12 months, the company generated $541 million in revenue and expects $700 million in revenue over the next 12 months. Currently, the company has 1.5 million monthly active creators in 190 countries. Unity estimates that its software was used to develop 53% of the most popular games on Apple’s (AAPL) App Store and Google’s (GOOG) Android Play in the past year. Additionally, more than 50% of console games in 2019 used Unity’s platform. Unity’s customers are video game developers. Its platform is free to use until the game crosses a certain revenue threshold when it charges a licensing fee. This aligns incentives between Unity and developers. This structure has also attracted talented, independent developers to Unity since they can test out ideas at no cost. Additionally, it forced its major competitor, Epic Games, to drop the price of its development engine. Unlike Epic, Unity doesn’t develop its games so it’s not competing with the developers on its platform. Essentially, Unity helps video game developers build games using its software, and then it helps them monetize their content with advertising or through other means. Currently, 29% of revenue comes from its platform, while 61% of revenue comes from higher-value services like advertising. Like a lot of the best SaaS stocks including SNOW, once a developer starts building a game on Unity, they are very unlikely to switch. The company is growing revenue at a nearly 50% clip and has healthy margins. It also has a massive potential market as gaming continues to rise in popularity, and it’s part of the infrastructure of the video game space. Unity’s Growth Prospects Currently, Unity is smaller than its main rival, Epic Games which had $4.2 billion in revenue over the past 12 months. Additionally, there is another upstart in the space, Roblox, which is popular among younger developers and is expected to go public later this year. However, Unity’s goal is to make its platform accessible for development beyond gaming. Already, its platform is being used by architects, engineers, construction, and movie set design. In its S-1, the company said it anticipates its software being used for manufacturing, auto design, virtual reality, augmented reality, simulations, and training. 2 Winners Apple (AAPL) and Google (GOOG) The Unity IPO is going to give the company more resources to grow more and attract more game developers. This is a win for AAPL. Currently, AAPL is in a contentious battle with Unity’s rival, Epic Games. Apple wants to take a cut of all in-app purchases, while Epic disagrees. AAPL has blocked Fornite and could potentially block all games made on Epic’s Unreal Engine from the iOS app store if the situation escalates Google has had the same issues with Epic Games. It kicked Fortnite out of its App Store due to Epic attempting to bypass fees. For Unity, it’s a win since it may incentivize developers to choose Unity over Epic. For Apple and Google, Unity’s rise is a counterweight to Epic, giving them more leverage. 2 Losers Take-Two Interactive Software (TTWO) For video game companies, the rise of these game engines means an increase in competition, since independent developers are now being armed with tools that were only available to the larger companies. Many video game companies are adapting to this new reality by moving their development to these engines, so they only have to focus on creating games rather than also building the tools to make games. TTWO has several popular titles including GTA and Red Dead. Investors have bid up the stock as they anticipate another strong year especially with the release of the new Microsoft (MSFT) and Sony (SNE) consoles. While TTWO certainly has a strong brand and strong titles, Unity’s business is more attractive as it’s become like the Shopify (SHOP) of video games. Just like SHOP gives the businesses on its platform tools to grow and makes money as they make more sales, Unity benefits from its developers’ games becoming more popular. Amazon (AMZN) AMZN has had so many successes that it’s easy to forget its misses like the Fire phone, Amazon Wallet, or Amazon Local. However, the company released its own video game development engine and high-profile game in May but so far, it’s a flop. It’s surprising given that it owns Twitch and has limitless resources, but its game and engine have been panned by gamers. They’ve already pulled the beta-release of its first game, Crucible, due to the poor response and lack of people playing the game despite heavy promotions. Amazon’s interest in the space also validates Unity’s business model. Amazon understands that creating a game development engine is a sticky business with high margins, growth, and profit potential. Its failure to win over developers also shows that there are considerable barriers to entry that can’t be solved by money. This is also another indication that Unity’s business has a strong moat. Want More Great Investing Ideas? 7 Best ETFs for the NEXT Bull Market Is the Stock Market Correction Over? Chart of the Day- See the Stocks Ready to Breakout "}]}