{"article": [{"url": "https://stocknews.com/news/hp-rig-nog-3-energy-stocks-to-avoid-for-the-remainder-of-2020/", "published": 1594123700.0, "headline": "3 Energy Stocks to Avoid for the Remainder of 2020", "body": "Due to the spread of the deadly virus, the demand for crude oil had fallen to historic lows in April 2020. The price of oil has regained a portion of its value since then, trading at about $40. However, it is still significantly lower than the 52-week high of $63. As a result, companies in the US Oil & Gas industry have witnessed a severe downturn in business. There have been widespread cuts in jobs, production, and capital spending for many companies in the second quarter of 2020. Which has led to Chesapeake Energy (CHK) filing for bankruptcy. With the future of the oil and gas industry in question, here are three energy stocks that you should avoid for the remainder of 2020: 9 \"BUY THE DIP\" Growth Stocks For 2020Helmerich & Payne (HP) Helmerich & Payne is a drilling company that has operations in South America, Africa, and the Middle East. Drilling companies such as HP have been hit hard due to the fall in demand for oil. Production is being kept low in an attempt to return oil prices to previous levels. HP has had to cut down on capital expenditure, postpone new projects, and delay payments. Over the past twelve months, HP has reported a fall in earnings of about 410%. All these factors have had a significant effect on the value of its stock. HP has lost about 55% year to date. It has also delivered negative price returns in the one-month, six-month, one-year, and three-year time periods. HP has an overall rating of F in the StockNews.com POWR Ratings, along with an F in three POWR components — Trade, Buy and Hold, and Industry Rank. This indicates a Strong Sell recommendation for the stock. Transocean (RIG) Transocean is a drilling company that does offshore drilling for oil and gas wells. RIG has also been severely hit by the fall in demand for oil. RIG is also largely debt-ridden and there are fears that the company may have to file for bankruptcy. RIG’s stock has delivered a YTD price return of -71.6%. It has also delivered negative price returns in the one-month, six-month, and one-year time periods. RIG has an overall rating of D under StockNews.com POWR Ratings, which indicates a Sell. It also has an F for three of the four POWR components- Trade, Buy and Hold, and Industry Rank. Northern Oil and Gas (NOG) NOG operates in the exploration, development, and production of oil and natural gas in the US. The company has witnessed a significant drop in revenue and it is estimated that the company is estimating its revenue growth to decline by -58.3% in the current quarter. The company has delivered a YTD price return of -63.6% along with negative price returns for the one-month, six-month, and one-year time periods. NOG has an overall rating of F under StockNews.com POWR Ratings, which indicates a Strong Sell. It also has an F for three of the four POWR components — Trade, Buy and Hold, and Industry Rank. Want More Great Investing Ideas? 9 “BUY THE DIP” Growth Stocks for 2020 Is the Bull S#*t Rally FINALLY Over? 7 “Safe-Haven” Dividend Stocks for Turbulent Times Top 3 Investing Strategies for 2020 HP shares were trading at $18.46 per share on Tuesday afternoon, down $0.67 (-3.50%). Year-to-date, HP has declined -56.82%, versus a -1.08% rise in the benchmark S&P 500 index during the same period."}]}