{"article": [{"url": "https://stocknews.com/news/tsla-w-zm-inx-3-stocks-that-let-me-know-were-in-a-bubble/", "published": 1598270900.0, "headline": "3 Stocks That Let Me Know We're in a Bubble", "body": "According to Wikipedia, the definition of a stock market bubble is “a type of economic bubble taking place in stock markets when market participants drive stock prices above their value in relation to some system of stock valuation.” If we look at the S&P 500 using valuation metrics, it certainly looks like it’s in bubble territory. For instance, the average price to earnings (P/E) ratio for the S&P 500 has historically been between 13 and 15. It is currently 29.50, which is higher than it has been on only two other occasions, during the end of the dot-com era and in January 2009. Historically, when the P/E for the S&P 500 has risen this high, it was followed by a market crash. If we consider the forward P/E ratio of the S&P 500, which is currently 26.17, according to Birinyi Associates, it has only ever been this high one other time, in 1999 at the height of the dot-com era. Another valuation metric, the Shiller P/E, based on the average inflation-adjusted earnings from the previous ten years, is at the second-highest mark ever, second only to 1999. See the chart below. 7 Best ETFs for the NEXT Bull Market (Shiller P/E Courtesy of Multpl.com) The S&P 500’s price-to-sales ratio is 2.44, its highest ever. Another valuation indicator is the “Buffet Indicator.” This metric takes the total market Wilshire 5000 index and divides it by the annual U.S. GDP. The ratio currently sits at 1.7, its highest level since right before the dot com bubble burst in 2000. All these valuation metrics point to a highly overvalued stock market, but what about the stocks themselves. How overvalued are some of the big names in the market? In this article, I will cover examples trading at sky-high valuations: Tesla (TSLA), Wayfair (W), and Zoom (ZM). Tesla (TSLA) TSLA, which was founded in 2003, is a vertically integrated sustainable energy company that aims to transition the world to electric vehicles. The company also sells solar panels and solar roofs, plus batteries for stationary storage for residential and commercial properties. The stock’s price, as of the end of Monday, was 2,014.20. That price represents a P/E ratio of 1,042.55, a ridiculous figure. Other valuation metrics are just as absurd. The company’s price to sales ratio is 15, and its price to book ratio is 38.1. For comparisons’ sake, the industry P/E is 82.6, its price to sales ratio is 0.6, and its price to book ratio is 1.3. Yes, the company recently posted its fourth consecutive quarterly profit, but four successive quarters should not lead to such a high valuation. The average analyst price target for TSLA is 1,295, well below its current price. TSLA, currently up 33% for the month, has a market cap of $375 billion, higher than even Walmart (WMT). While TSLA has a first-mover advantage, more automakers are developing and marketing their own electric vehicles. This will reduce the company’s market share in the electric vehicle market. In terms of profitability, the company has a meager return on invested capital (ROIC), which I believe is the best measure of profitability. Its ROIC is 4.3% compared to the S&P 500’s ROIC of 15.3%. While TSLA may be a good momentum stock, its price has gotten way ahead of its underlying fundamentals and risks. The company is entering a spending cycle with the construction of new factories in Germany and here at home, which will act as a significant drag on free cash flow for the next several quarters. Wayfair (W) W engages in e-commerce in the United States and Europe. At the end of last year, the company offered approximately 18 million products from more than 12,000 suppliers for the home sector under its brands Wayfair, Joss & Main, AllModern, DwellStudio, Birch Lane, and Perigold. Products include a selection of furniture, decor, decorative accent, housewares, seasonal decor, and other home goods. The stock ended Monday’s trading at 338.00, up 55% for the month. The company has a P/E of -29.7. The figure is negative since the company only had its first positive earnings for this past quarter. Its price to free cash flow ratio is a very high 87.8. Another measure of valuation is the EV/EBITDA ratio, which measures a company’s enterprise or total value (EV) to its earnings before interest, taxes, depreciation, and amortization (EBITDA). This is one of my favorite valuation metrics. The stock has a negative EV/EBITDA -119.7. While the company has been a beneficiary of the pandemic, as its online presence has made shopping from home more accessible, its outlook could revert to pre-COVID levels once shelter-in-place orders are lifted. A recent S&P report stated that W has a 25% chance of defaulting in the next two tears. This is due to the company having a negative Stockholder’s Equity (-787) on its balance sheet. Stockholders’ equity is the amount of assets remaining in a business after all liabilities have been settled. Other risks for the company include higher costs on goods due to U.S. tariffs on Chinese imports and a history of negative earnings and cash flow. Zoom (ZM) ZM provides a communications platform that connects people through video, voice, chat, and content sharing. The company’s cloud-native platform enables face-to-face video and connects users across various devices and locations in a single meeting. The company, founded in 2011, became a household name due to the pandemic forcing people to work from home and children to learn from home. TSLA may have a sky-high P/E, but ZM has it beat with a P/E of 1,670.30. The company also has a price to sale ratio of 103.11 and a price to book ratio of 90.95, both way above its industry averages. To say the stock is overvalued is an understatement. The stock ended Monday with a price of 282.28, and a year to date return of 314.87%. The price does not support the company’s fundamentals. The company has a low ROIC of 3.6% and a low return on equity of 5.4%. ZM’s market cap of $80 billion is insane, considering it last reported earnings in April with a net income of only $27 million. The company will report its most recent financial results on August 31st after the market closes. Its outrageous valuation doesn’t align with a business model that has to compete with companies like Microsoft (MSFT) and Cisco (CSCO) that already have an existing customer base. These companies are also better capitalized. Final Word As evident by the various valuation metrics in both the large-cap S&P 500 index and the three stock examples, I genuinely believe we’re in a bubble. It’s hard to know when the bubble will burst, but it always does. Eventually, the stock market will reconnect with the economy, and when it does, watch out. The market has been able to withstand the pandemic so far, but there will likely be another catalyst that will serve as the “pin.” Want More Great Investing Ideas? The Best of StockNews 2 Step Process to Sell @ Market Top in September 9 “BUY THE DIP” Growth Stocks for 2020 TSLA shares . Year-to-date, TSLA has gained 381.49%, versus a 7.64% rise in the benchmark S&P 500 index during the same period."}]}