{"article": [{"url": "https://stocknews.com/news/amrs-tpb-vff-nept-4-cannabis-stocks-with-the-runway-necessary-to-reach-new/", "published": 1600862900.0, "headline": "4 Cannabis Stocks With the Runway Necessary to Reach New Highs", "body": "The cannabis sector has been on fire in recent months. If Joe Biden is elected president, the chances of a federal decriminational or legalization of cannabis increase. This is driving buying interest in the sector. The problem with investing in the cannabis space is the sheer number of stocks to sort through. Instead of spending your time crunching the numbers and performing qualitative analysis on every cannabis stock, let us do the work for you. Below, we provide an in-depth look at four cannabis stocks poised to reach new highs: Amyris (AMRS), Turning Point Brands (TPB), Village Farms International (VFF) and Neptune Wellness Solutions (NEPT). 7 \"SAFE HAVEN\" Dividend Stocks for Turbulent TimesAmyris (AMRS) Renewable products are increasing in importance with each passing day. AMRS provides such products. AMRS technology is advanced to the point that it facilitates the scaling of the components of the cannabis plant that are rare and otherwise difficult to generate. AMRS works closely with Lavvan, a biotech startup, to create synthetic cannabinoids. In short, this is a synthetic biotech company with significant potential. The AMRS POWR Ratings are admittedly a bit of a disappointment yet the stock has a B industry Rank. Furthermore, AMRS has a three-month price return of just under 38%. The top analysts insist AMRS will not be fairly priced until it hits $10, meaning it has a massive upside of 264%. The stock’s 52-week high is $6.07. AMRS moved up above the $5 mark this past spring following the market-wide decline yet tumbled right back down below $3 in recent weeks. Even the slightest bit of positive news about AMRS’ pending litigation will send the stock higher. Buy this stock, hold it for years and you will likely be quite happy with your return. Turning Point Brands (TPB) Investing in the tobacco industry might not seem like the best decision. However, tobacco companies such as TPB that are expanding their boundaries into the cannabis space are worthy of close analysis. To be clear, TPB specialize in tobacco alternatives such as vaporizers and smokeless tobacco. TPB is also investing in the development of CBD products for wellness. The company has established key distribution partnerships that transport cannabis to dispensaries throughout Canada. Reports from TPB’s brass indicate the recreational cannabis market will hit $50 within six years. The POWR Ratings show TPB has an A Trade Grade and B grades in the other POWR Components. Out of nine stocks in the tobacco category, TPB is ranked third. TipRanks analysts report TPB will be fairly priced when it reaches $39.75. If this prediction holds true, TPB will have increased in value by nearly 40%. The prediction might prove accurate considering TPB currently has a low forward P/E ratio of 12. It should come as no surprise if TPB breaks through its 52-week high of $34.56 before year’s end, especially if cannabis-friendly Joe Biden is elected president this November. Village Farms International (VFF) It is not often you find publicly traded companies that grow vegetables as well as cannabis. That is exactly what VFF does. VFF offerings range from bell peppers to tomatoes and cannabis. Though VFF’s POWR Ratings are a mixed bag, the stock does have a respectable Trade Grade and an Industry Rank of B. The top analysts insist VFF is underpriced, putting a $14.05 price target on the stock. If VFF moves up to this price, it will have increased by 174%. Furthermore, six out of six analysts who have studied the stock insist it is a Buy. Though VFF has not moved all the way back to its 52-week high slightly above $10, the stock has rebounded quite nicely following its coronavirus decline this spring. VFF jumped right back up to $7 in June and has hovered between $5 and $7 in the months since. Look for VFF to reapproach the $10 level as investors’ positive sentiment about the company’s cannabis offerings continues to increase. Neptune Wellness Solutions (NEPT) If you have been following the stock market’s daily top-gainers in recent weeks, you have spotted NEPT listed amongst them. NEPT is garnering significant attention as it provides myriad health and wellness products including cannabis, hemp, white label goods, nutraceuticals and more. This Quebec-based company has a solid Industry Rank in the POWR Ratings, a price target that equates to 90% upside and significant upward momentum as a result of the pandemic. NEPT stands to benefit if a second wave of the virus emerges this fall and winter as the company also makes hand sanitizer. NEPT is a well-diversified company likely to generate a considerable return regardless of the direction the economy takes through 2020 and beyond. You should feel perfectly comfortable and fully confident pulling the trigger on a NEPT purchase. Want More Great Investing Ideas? 7 Best ETFs for the NEXT Bull Market Is the Stock Market Correction Over? Chart of the Day- See the Stocks Ready to Breakout AMRS shares were trading at $2.53 per share on Wednesday afternoon, down $0.23 (-8.33%). Year-to-date, AMRS has declined -18.12%, versus a 2.09% rise in the benchmark S&P 500 index during the same period."}]}