{"article": [{"url": "https://stocknews.com/news/nke-crox-deck-3-footwear-stocks-running-ahead-of-the-pack/", "published": 1597666100.0, "headline": "3 Footwear Stocks \"Running Ahead\" of the Pack", "body": "The shoe industry has felt the ramifications of the coronavirus since its onset. With global lockdown and restrictions on travel, the demand for shoes has significantly declined. Lower sales combined with retail outlets being shutdown had an adverse impact on the industry. Yet, companies selling sports shoes and casual shoes have seen revenues increase since late May or early June, while the demand for dress shoes and formal shoes declined year-over-year. According to an NPD report, athletic shoe sales increased 25% in June, recovering strongly from the declines in March and April. Running footwear sales grew 30% year-over-year in the week ended June 20th, according to another NPD report. While athletic footwear sales have rebounded, other types of footwear sales remain depressed. The global apparel and footwear sectors are estimated to shrink 19.5% year-over-year, leading to a $395.60 billion loss in sales. 7 \"SAFE HAVEN\" Dividend Stocks for Turbulent TimesAs people are choosing comfort and function over fashion, Nike, Inc. (NKE), Deckers Outdoor Corporation (DECK), Crocs, Inc. (CROX) are outperforming their peers by a huge margin. Nike, Inc. (NKE) One of the most popular names in the athletic footwear industry, NKE has fared well during the recovery phase of the pandemic. The stock has gained more than 90% since hitting its 52-week low in March and hit its 52-week high in August. With the increasing demand for footwear in recent times as individuals are adjusting to the gradual reopening of the country, NKE stands to make profits in the second half of 2020. NKE compensated for losses incurred due to the shutdown of physical outlets and stores across the globe by focusing on its digital sales channels. NKE’s digital sales increased 75% year-over-year during the fourth quarter ended in May 2020. Greater China revenues increased by 11% year-over-year. NKE secured a $2 billion credit facility in the fourth fiscal quarter to ensure adequate liquidity and flexibility for dealing with the economic repercussions of the pandemic. Its total liquidity of $12.50 billion (including cash and cash equivalents and short-term investments) at the end of the quarter indicates a 48.8% growth year-over-year. NKE’s EPS is expected to grow at 23.64% per annum over the next five years. How does NKE stack up for the POWR Ratings? A for Trade Grade A for Buy & Hold Grade A for Peer Grade B for Industry Rank A for Overall POWR Rating. You can’t ask for better. It is also ranked #1 out of 32 stocks in the Athletics & Recreation industry. Deckers Outdoor Corporation (DECK) DECK is a designer and manufacturer of footwear, apparel, and accessories for casual use and high-performance activities. It sells products under the following brand names of UGG, Teva, Sanuk, Hoka, Ahnu, and Koolaburra. Along with a robust retail distribution chain, DECK also has a strong e-commerce presence. DECK reported positive earnings for the first fiscal quarter of 2021 ended June 2020. Net sales of $283.20 million grew 2.3% year-over-year. Domestic sales increased 10.2% from its year-ago number to $183.40 million. Direct to customer (DTC) net sales increased 74.2% year-over-year to $139.80 million. DECK’s gross margin increased to 50.3% in the first quarter of 2021, as compared to 47% for the same period last year. Its cash and cash equivalents improved 31.6% year-over-year to $661.90 million. Though the consensus EPS estimates for the second quarter 2021 ending September 2020 indicates a year-over-year decline, DECK has a pretty impressive earnings surprise history, as it beat street EPS estimates in each of the trailing four quarters. DECK hit its 52-week high of $225.70 in August, thereby gaining more than 185% since hitting its 52-week low in March. DECK is rated “Strong Buy” in our POWR Ratings system, with an “A” in Trade Grade, Buy & Hold Grade, and Peer Grade. In the 65-stock Fashion & Luxury industry, DECK is ranked #4. Crocs, Inc. (CROX) CROX is known for its uniquely designed casual lifestyle footwear products such as sandals, flips and slides, shoes, and boots. CROX is gaining popularity amid the work-from-home culture, as people are switching to casual and comfortable wear. CROX managed to establish its e-commerce presence amid the rising demand for its casual lifestyle products. The company’s global e-commerce revenue grew 67.7% year-over-year in the second quarter ended June 2020. The operating margin increased from 3.8% to 17.1% during the same time period. Income from operations of $56.60 million increased by 18.3% year-over-year. Gross margin increased by 1.5% from its year-ago value to 54.3%. The consensus EPS estimate of $0.56 for the third quarter indicates a year-over-year decline. However, CROX has an impressive earnings surprise history, as it surpassed the consensus EPS estimates in three of the trailing four quarters. CROX gained more than 370% since hitting its 52-week low of $8.40 in March. CROX is rated “Buy” in our POWR Ratings system, due to its rising profit levels as a result of increasing global demand. It has an “A” in Trade Grade and Peer Grade and “B” in Buy & Hold Grade. In the 65-stock Fashion & Luxury industry, CROX is ranked #8. Want More Great Investing Ideas? The Best of StockNews 3 Possible Directions for the Stock Market from Here 9 “BUY THE DIP” Growth Stocks for 2020 NKE shares were trading at $105.17 per share on Monday afternoon, down $1.26 (-1.18%). Year-to-date, NKE has gained 4.36%, versus a 6.01% rise in the benchmark S&P 500 index during the same period."}]}