{"article": [{"url": "https://stocknews.com/news/caj-hpe-stx-ntap-4-worst-performing-large-cap-tech-stocks-year-to-date/", "published": 1596715700.0, "headline": "4 WORST Performing Large-Cap Tech Stocks Year-to-Date", "body": "As the technology sector is performing well right now, investors see it as the most reliable sector to invest in during these uncertain times. One indicator for performance is the NASDAQ 100 Technology Sector Index, which is up by 17.7% year to date. However, certain large-cap technology stocks are finding it hard to keep up with the rest of the sector. This is due to a fall in demand for their products due to the spread of the coronavirus. These stocks have chronically underperformed this year and their negative momentum may continue for the rest of the year. One of the more adversely affected segments in technology is data storage. 7 \"SAFE HAVEN\" Dividend Stocks for Turbulent TimesCanon, Inc. (CAJ), Hewlett Packard Enterprise Company (HPE), Seagate Technology (STX), and NetApp, Inc. (NTAP) are 4 large-cap tech stocks that you should stay clear of. Canon, Inc. (CAJ) Canon needs no introduction since it has been a mainstay in the photography and printing sectors for decades. However, this $17.56 billion company has been adversely affected by the fall in demand due to the pandemic. The company’s stock reached a two-decade low after reporting its first loss since the company started reporting quarterly earnings in 2001. CAJ has forecast an annual profit of $428 million, which is 65.6% lower than the previous year and is less than even the most conservative estimates. For the quarter ending June 30th, CAJ reported a loss of approximately $83 million or 8.8 billion Yen. CAJ delivered a negative earnings surprise of -166.7% in the same quarter and has had negative surprises in three of the last four quarters. CAJ has lost 38.6% year to date, and the bearishness of the stock may continue until the company witnesses pre-coronavirus levels of demand. CAJ’s POWR Ratings are consistent with this bleak outlook. It has an overall rating of “Sell” and an “F” for Trade Grade, with a “D” for Buy & Hold Grade and Peer Grade. Within the Technology – Hardware industry, it’s ranked #19 out of 28 stocks. Hewlett Packard Enterprise Company (HPE) HPE offers IT consulting and technology services. This $12.8 billion company has been struggling this year due to a slowdown in demand for its services. HPE has also been facing manufacturing issues caused by the spread of the coronavirus. For the second quarter that ended on April 30th, the company reported revenue of $6 billion, which was 16% lower than the same period last year. The GAAP operating profit margin was -13.9% during the same period. HPE delivered a negative earnings surprise of -24.1%. HPE’s price has fallen 37.2% year to date. This price decline may continue for the rest of the year. According to the POWR Ratings, HPE has a Sell rating. It also has a grade of D for Trade Grade, Buy & Hold Grade, and Peer Grade. In the 48-stock Technology – Services industry, it is ranked #33. Seagate Technology plc (STX) With a market cap of $11.58 billion, STX is a data storage company that focuses on consumer pen drives and hard drives. The company had to lay off 500 employees in a bid to improve operational efficiencies. STX focuses on manufacturing lower-cost hard-disk drives rather than solid-state drives, but the company may be adversely affected by a reduced-price gap between them. For the quarter that ended July 3rd, 2020, the operating margin of the company declined to 10.6% from 14% a year ago. The company also witnessed a sharp decline in net income to $166 million from $983 million a year ago. EPS for the quarter was $0.64 compared to $3.54 a year ago. STX has fallen by 24.1% year to date. According to the POWR Ratings System, STX is rated Neutral” It has a grade of D for Trade Grade and Industry Rank. NetApp, Inc. (NTAP) NTAP focuses on providing software systems and services for the management and storage of customer data. This $9.56 billion company offers a diverse array of storage solutions for different types of deployment models and various data types. However, the stock has been consistently underperforming this year due to a fall in sales and issues with handling the pandemic. In the fourth quarter that ended April 2020, the company reported a net revenue of $5.41 billion, which was lower than the $6.15 billion from the same period last year. Similarly, net income of the company also fell to $819 million from $1.17 billion a year ago. For the quarter end July 2020, NTAP is expected to deliver earnings per share of $0.41, which would indicate a year-over-year decline of 36.9%. NTAP is currently rated Neutral in our POWR Ratings system. It has a grade of D for Trade Grade, Peer Grade, and Industry Rank. Want More Great Investing Ideas? 9 “BUY THE DIP” Growth Stocks for 2020 How to Trade THIS Stock Bubble? 7 “Safe-Haven” Dividend Stocks for Turbulent Times CAJ shares were unchanged in after-hours trading Thursday. Year-to-date, CAJ has declined -37.36%, versus a 4.94% rise in the benchmark S&P 500 index during the same period."}]}