{"article": [{"url": "https://stocknews.com/news/spy-inx-dia-iwm-qqq-is-the-stock-market-correction-over/", "published": 1599653300.0, "headline": "Is the Stock Market Correction Over?", "body": "(Please enjoy this updated version of my weekly commentary from the Reitmeister Total Return newsletter). On August 28th we took Step 1 in the process of getting more defensive coming into what looked like a scary September for stocks. That culminated in taking profits on our most aggressive long positions, then buying inverse ETFs for the expected mover lower. That plan looked downright terrible for the next three sessions as the market raged to a new high at 3588. But since then it has looked “spot on” as the market tanked all the way down to its current perch @ 3331.84. Waking up to the continuation of this downtrend on Tuesday led to our next step. That being selling of two of our tech positions to get more defensively positioned in our hedge. The net effect of these moves is that we have only lost a modest 1.71% since the selloff began vs. a heftier -7.14% beating for the S&P 500 and a much scarier -10.03% comeuppance for the tech heavy Nasdaq. 7 \"SAFE HAVEN\" Dividend Stocks for Turbulent TimesNow we need to discuss what happens next for the market and our corresponding game plan. Market Commentary The key piece of strategy to consider at this time is whether this is just a good old fashioned selloff versus more of a rotation from tech stocks into other undervalued groups. That was the center of our discussion in my latest RTR Members Only webinar recorded Friday 9/4. Watch now if you have not already. Click here to watch now The main strategy point repeated time and time again in the webinar was that the hectic swirling action of stock prices last week was not proof of future direction. Instead we determined it was best to let investors enjoy the peace and quiet of the extended Labor Day weekend to come ready to invest on Tuesday. And that likely that action would be more telling of what they think is the right thing to do going forward. Indeed Tuesday’s action looked a lot more like your classic broad based market selloff with the most economically sensitive, Risk On, sectors showing the weakest results. Yes, the more conservative groups were also down, but overall fared much better than the rest. (Sector results for Tuesday taken from Finviz.com). The early action on Tuesday led me to take the next step in our journey to get more defensive. This was explained in the morning trade alert where we sold off our remaining tech positions. Gladly we squeezed out a nice little gain in PNQI in the short time it was in the portfolio. In the case of BABA we were able to sock away a full +52.7% return over the past eleven months. All in all we lost a very modest -0.39% today while the S&P shed 7X more at -2.78%. And Nasdaq even worse at -4.11%. And just for laughs TSLA was down -21.06%. I guess some folks woke up this morning and realized that it was actually a car company that should have a MUCH LOWER valuation. Still more juice to squeeze from that overripe fruit. As it stands now the portfolio is constructed as follows: 24% Precious Metals 22% Inverse ETFs 20% long stocks 34% Cash Now we have a hedgier, hedge in place with longs and shorts pretty well balanced. The wild card for our daily performance going forward will the success of precious metals. That looked like a painful mistake early on today, but then they rallied sharply to close the session and looking strong on Wednesday morning. I believe this is a better place to wait and see what happens next. As shared in Friday’s webinar a clear sign of this sell off gaining real steam would be breaking below the 50 day moving average. That is now just a stone’s throw away from today’s close at 3305. In most ways we are well constructed for a break below that level as long as that sign of panic comes hand in hand with the typical rush towards precious metals. However, it is quite possible the market bounces at this level with a “buy the dip” mentality. Or perhaps what unfolds is more of a consolidation period where we just hang out around 3300 for a while. That could come hand in hand with what some call a “rolling correction”. This is like a sector rotation where the market averages stay relatively level, but each group is beaten up severely for a few sessions pushing prices way down like 10-20%. And once properly “right sized” they bounce back up. Since this kind of action happens only a few sectors at a time, then your daily results very much depend on what you are overweight and underweight at that time. But again, that is what could happen. What will happen continues to be a mystery given the series of curve balls thrown at investors this year. Here is my current market outlook. I think the S&P will break below the 50 day moving average on a sell off that gets us closer to the 200 day moving average at around 3,100. There should be ample support there. But it will be hard to bounce too much higher til we see 2 things: First, does the economy continue to heal from the Coronavirus recession or did the markets overestimate how quickly that will happen? Second, is about FINAL election results. Yes, I put the emphasize on FINAL. This is not about Trump vs. Biden. Or Republican vs. Democrat. This is about whether the growing concerns about mail in ballots turns into a contested election result and the pandemonium that would follow. Both sides are already gearing up for that battle and thus more and more appears to be an increasingly likely result. Let me say unequivocally that a contested election would be very bad for the country. And very, very bad for the stock market. This election story made the cover of The Economist this week and tells you how seriously this idea is being contemplated as a potential reality. So at this time I am hard pressed to imagine emerging in a bullish posture from the hedge before the election given this potential complication. However, with 34% cash on hand I may look for some unique opportunities. But likely any long added will be matched by more inverse ETFs as I think odds of downside are greater than upside at this time. I love investing. And generally root for a bull market. But even more than that, I root for logic and reason to rule the day. That is why I was such an unhappy camper the last few months as stocks rallied nonstop to a new record high of 3,588 all the while the economy was in shambles. That was PURE insanity. Gladly we saw it unfolding and played ball by leaning into the best performing groups. But now I say enough is enough. September was the right time to see the market get cut down to size. And gladly it is going fairly well according to plan. Will that continue or will Mr. Market throw us a fresh curve ball? I don’t know for sure. However, if indeed the overall market is returning to more rational investment decision making, then lower prices makes the most sense. If true, then our portfolio is well calibrated for that outcome. And if things change…then we will sniff that out and realign our portfolio sails to the prevailing winds. What To Do Next? Right now my Reitmeister Total Return portfolio has already taken steps to protect against the September selloff that has already unfolded. All in all we have 9 positions that are just right for the times. 3 stocks that are uniquely built to excel during the Coronavirus recession. 3 precious metals ETFs because when the US government and Fed throw money out of a helicopter it devalues the dollar and makes precious metals all the more valuable. 3 inverse ETFs that rise as the market falls. This has been our saving grace the past week as the S&P tumbled over 7%. And likely will continue to rise in value as this correction has not yet run its course. But let’s be honest with ourselves. Its crazy out there! That’s why I am trying my best to help investors make sense of it all and profit from whatever scenario comes our way. The best way for me to do that is give you 30 days access to the Reitmeister Total Return. This is my newsletter service where I share more frequent commentaries on the market outlook, trading strategy, and yes, a portfolio of hand selected stocks and ETFs to produce profits whether we have a bull…a bear…or anywhere in between. As shared above, we properly called an end to the stock bubble in September and already aligned our portfolio to protect against the downside. That explains how we continue to handily top the market at this time while others are seeing dramatic losses. Just click the link below to see all 9 stocks and ETFs in this uniquely successful portfolio. Plus get ongoing commentary and trades to adjust your strategy as 2020 continues to the wildest market in history. Gladly it can be tamed. About Reitmeister Total Return newsletter & 30 Day Trial Wishing you a world of investment success! Steve Reitmeister …but everyone calls me Reity (pronounced “Righty”) CEO, Stock News Network and Editor, Reitmeister Total Return SPY shares were trading at $337.44 per share on Wednesday morning, up $4.23 (+1.27%). Year-to-date, SPY has gained 5.92%, versus a % rise in the benchmark S&P 500 index during the same period."}]}