{"article": [{"url": "https://stocknews.com/news/atvi-ea-ttwo-3-leading-video-game-stocks-to-add-to-your-portfolio/", "published": 1598270900.0, "headline": "3 Leading Video Game Stocks to Add to Your Portfolio", "body": "The gaming industry is gaining more popularity with each passing day, as people are turning toward sports and online gaming for spending their leisure time during the pandemic. As such, research expert David Lange expects the eSports audience to grow to 495 million globally this year. The audience is expected to grow at a CAGR of 10.4% through 2023 to reach 646 million. A report released by Newzoo indicates the global gaming industry to gain $159.30 billion in revenues in 2020. The market is predicted to be valued at $200 billion by 2023. The growth potential of this industry has brought together two rival companies —Microsoft (MSFT) and Sony (SNE)— to collaborate to develop next generation gaming solutions. The long standing competitors Microsoft Xbox and Sony PlayStation have joined hands after 15 years of rivalry to partner on new innovations and enhance customer experiences. Companies such as Activision Blizzard, Inc. (ATVI), Electronic Arts, Inc. (EA), and Take Two Interactive Software, Inc. (TTWO), which are involved in developing video games, stand to profit in the upcoming months from increasing user bases. 7 Best ETFs for the NEXT Bull MarketActivision Blizzard, Inc. (ATVI) ATVI develops and distributes content and services on video game consoles, personal computers (PC), and mobile devices in the Americas, Europe, the Middle East, Africa, and the Asia Pacific. Operational since 1979, the most famous product franchises owned by ATVI include Call of Duty, World of Warcraft, Diablo, Hearthstone, Overwatch, and Candy Crush. As one of the most popular gaming platforms worldwide, ATVI had a monthly active user base (MAU) of 428 million as of June 30th. With virtual gaming gaining popularity during these unprecedented times, ATVI’s impressive second-quarter results indicate the dominating position of the company in this market. ATVI’s net revenues increased 37.8% to $1.93 billion in the second quarter ending June 2020. Net revenue from digital channels of $1.59 billion increased 45.8% from the year-ago value. Operating metrics such as net bookings of $2.08 billion improved 71.9% from the same period last year. This can be attributed to the 80.1% and 76% year-over-year increase in the net bookings from digital channels and in-game net bookings, respectively. With the new normal here to stay, the gaming industry is expected to grow in the remaining months of 2020. In this regard, ATVI net bookings are expected to be $1.65 billion in the third quarter ending September 2020. To reach this target, ATVI raised $2 billion in unsecured senior notes as of August 10th for financing and general corporate purposes. The consensus EPS estimate of $0.64 for the third quarter ending September quarter indicates a 100% rise year-over-year. Also, ATVI has an impressive earnings surprise history, as it beat the street revenue estimates in each of the trailing four quarters. The consensus revenue estimate of $1.69 billion for the upcoming quarter indicates a 39.8% growth from the same period last year. ATVI gained more than 70% to hit its 52-week high of $ 87.73 in August since hitting its year-to-date low of $$50.51 in mid-March. How does ATVI stack up for our POWR Ratings? A for Trade Grade A for Buy & Hold Grade B for Peer Grade B for Industry Rank A for Overall POWR Rating ATVI is also ranked #1 out of 13 stocks in the Entertainment – Toys & Video Games industry. Electronic Arts, Inc. (EA) EA is a major video game developer and distributor, publishing games in various genres. It also provides advertising and licensing services, as well as engages in third party distribution. EA is the maker and distributor of popular games such as FIFA, Need for Speed, Madden NFL and Star Wars Jedi. EA’s business model allowed it to weather the economic downturn efficiently, by taking advantage of the booming gaming industry. It has launched several new games over the past few months. Also, a new subscription service called EA Play is set to launch on August 31st. In the first fiscal quarter ending June 2020, EA delivered 30 new content updates, over 50 mobile updates, and 2 major game expansions. Net revenue for this quarter increased 20.8% year-over-year to $1.45 billion. Operating cash flow of $378 million improved 139.2% from the year-ago value. Gross profit rose 14.5% year-over-year to $288 million. Operating income of $471 million increased 13.4% for the same period last year. EA has strong expectations from the ongoing second fiscal quarter ending September 2020, with estimated net revenue of $1.125 billion and net income of $61 million. Its EPS is expected to grow 14.1% per annum over the next five years. EA has an impressive earnings surprise history, as it beat the consensus EPS estimates in each of the trailing four quarters. EA gained more than 70% in value since hitting its 52-week low of $85.69 in mid-March. The stock hit its 52-week high of $147.36 in August. EA is rated as a Strong Buy our POWR Ratings system, with a grade of A for Trade Grade and Buy & Hold Grade, and a B for Peer Grade and Industry Rank. It is ranked #2 out of 13 stocks in the Entertainment – Toys and Video games industry. Take Two Interactive Software, Inc. (TTWO) TTWO develops and markets interactive gaming and entertainment solutions under Rockstar Games, 2K labels, private division and social point labels. TTWO’s games are designed for console gaming systems as well as computers and smartphones. TTWO’s impressive fiscal first quarter performance adequately represents the company’s fundamentals, as its GAAP net revenue grew 54% year-over-year to a record of $831.30 million. Its adjusted unrestricted operating cash flow of $324 million increased 595% from the year-ago value, while net cash from operating activities increased 310% during the same time to $445.40 million. TTWO’s net bookings rose 136% year-over-year to a record of $996.20 million. TTWO’s EPS is expected to grow 14.7% per year for the next five years. Moreover, TTWO beat the street EPS estimates in three out of the trailing four quarters, which is impressive. TTWO has gained 54% since hitting its 52-week low of $100 in March. In fact, the momentum helped the stock to hit its 52-week high of $156.32 in July. TTWO is rated a Strong Buy in our POWR Ratings, consistent with its impressive performance in the previous quarter. It holds a grade of A in Trade Grade, Buy & Hold Grade, and Peer Grade, and a B in Industry Rank. Out of 13 stocks in the Entertainment – Toys and Video Games industry, TTWO is ranked #3. Want More Great Investing Ideas? The Best of StockNews 2 Step Process to Sell @ Market Top in September 9 “BUY THE DIP” Growth Stocks for 2020 ATVI shares were trading at $82.69 per share on Monday afternoon, down $0.52 (-0.62%). Year-to-date, ATVI has gained 40.08%, versus a 7.44% rise in the benchmark S&P 500 index during the same period."}]}