{"article": [{"url": "https://stocknews.com/news/dhi-lgih-len-3-homebuilders-for-the-second-half-of-2020/", "published": 1593691700.0, "headline": "3 Homebuilders for the Second Half of 2020", "body": "The US housing market has rebounded since the Great Recession and been in a bull market starting in 2013. The current low mortgage rate environment is undoubtedly positive for homebuilders, as it boosts demand by increasing affordability. The iShares U.S. Home Construction ETF (ITB) is up 43% in the past three months In contrast, the S&P 500 is 24% higher over the same period. This outperformance is a reflection of the positive fundamentals and falling rate environment. Most of the surveys show that millennials want to be homeowners rather than renting. Since mortgage rates are down now and expected to stay at the current levels for some time, home buying and refinancing activities should continue to increase. As a result, investors can expect the rally in housing stocks to continue. The coronavirus is also leading to a surge in buying as people move out of the cities to suburbs and rural areas. 9 \"BUY THE DIP\" Growth Stocks For 2020Here are three homebuilder stocks worth considering for the second half of 2020: D.R. Horton, Inc. (DHI) DHI is the largest US homebuilder. Despite the positive fundamentals of homebuilders, they haven’t been that attractive to investors at least based on multiple expansion. For example, DHI’s price to book value is at its lowest level since 2006 which implies that its business is outpacing its stock price. Since 2010, DHI has grown revenues by 17% and earnings by 23% on an annual basis. Margins have also expanded from 6% to 10%. DHI’s stock has gone up by 68.2% over the past 3 months. The average analyst price target for this stock is $58.09 with the highest target being $69. Out of the 13 analysts covering the stock, 10 have recommended ‘Buy’, 3 have rated ‘Hold’. The POWR Ratings have DHI ranked a “Buy”. It’s ranked an “A” in Peer Grade and a “B” in Trade Grade and Buy & Hold Grade. Among the homebuilders, it’s ranked #1 out of 21 stocks. Lennar Corporation (LEN) The coronavirus has resulted in booming sales for LEN as it reports increased demand with people looking to move from densely populated areas in search of more living spaces. Of course, this is being enabled by the rise of remote work. LEN is the largest homebuilder in terms of revenue. The biggest driver of the stock over the next few years will be the increased pace of new home construction to meet increasing demand from Millennials. Additionally, since 2008, new home construction has lagged behind population growth. The POWR Ratings have LEN ranked as a Buy. It has a “B” in Trade Grade and an “A” in Peer Grade. Among homebuilders, it’s ranked #2 out of 21 stocks. The average analyst price target for this stock is $67.96 with the highest forecast being $77. Out of the 14 analysts covering the stock, 7 have recommended ‘Buy’ and 7 have recommended ‘Hold’. LGI Homes, Inc. (LGIH) LGIH is a value investor’s dream with a price to earnings ratio of 11. However, it could also appeal to a growth investor given its double-digit sales growth and 23% gross margins. On top of this, the company is benefitting from a variety of secular and cyclical trends. LGIH has also gained 152.3% over the past 3 months. The company’s EPS grew 31.95% between 2014 and 2019 and is expected to grow 14.4% in 2020, while the industry is expected to witness a decline in EPS of 7.5% in the same period. LGIH is rated a “Buy” by POWR Ratings. It’s ranked #3 out of 21 homebuilding stocks. It has an “A” for Trade Grade and Peer Grade with a “B” for Buy & Hold Grade. Want More Great Investing Ideas? 9 “BUY THE DIP” Growth Stocks for 2020 Is the Bull S#*t Rally FINALLY Over? 7 “Safe-Haven” Dividend Stocks for Turbulent Times Top 3 Investing Strategies for 2020 DHI shares . Year-to-date, DHI has gained 3.18%, versus a -1.99% rise in the benchmark S&P 500 index during the same period."}]}