{"article": [{"url": "https://stocknews.com/news/nke-is-now-a-good-time-to-buy-shares-of-nike/", "published": 1600085300.0, "headline": "Is Now a Good Time to Buy Shares of Nike?", "body": "Even during the coronavirus pandemic, Nike, Inc. (NKE) has remained the biggest sports apparel and equipment manufacturer in the world. Just take a look at the stock, which has gained 16.4% year-to-date. Source: MarketWatch.com 9 \"BUY THE DIP\" Growth Stocks For 2020The company has compensated for its lower in-store sales with online traffic. This is likely due to people needing new fitness gear as they transitioned from working out in gyms to exercising outdoors. And with the gradual reopening revival of the economy, most countries have been resuming organized sports tournaments. This is expected to increase NKE’s sales are expected to increase in the upcoming months. NKE’s impressive year-to-date performance, improving financials and favorable market expectations helped the stock earn a “Strong Buy” rating in our proprietary rating system. Here’s how our proprietary POWR Ratings system evaluates NKE: Trade Grade: A NKE is currently trading way above its 50-day and 200-day moving averages of $104.05 and $96.14, indicating a golden cross (a bullish technical signal). Moreover, the stock returned 22.7% in the past three months, reflecting a short-term bullishness. NKE improved its digital market presence substantially in the past couple of months to overcome the barriers of coronavirus. Though revenues declined slightly in the fourth fiscal quarter ended May 2020, NKE’s digital sales increased 47% year-over-year. Revenue from Greater China alone, grew 11% on a currency-neutral basis from the year-ago value. Buy & Hold Grade: A In terms of proximity to its 52-week high, which is a key factor that our Buy & Hold Grade takes into account, NKE is well positioned. It is currently trading just 1% below its 52-week high of $119.25, which it hit on September 11th. NKE’s stock has returned 128% over the past three years. The company’s impressive performance over this period can be attributed to its increasing market presence, particularly in the Asia- Pacific region. The company’s total assets grew at a CAGR of 10.5% over the past three years. Also, NKE has undertaken a massive share repurchase program since 2018, thereby increasing shareholder returns. NKE retired 33.50 million shares worth $3 billion in fiscal 2020. Peer Grade: A NKE is ranked #1 out of 33 stocks in the Athletics & Recreation industry. Other popular stocks in the industry include Dick’s Sporting Goods, Inc. (DKS), Hibbett Sports, Inc. (HIBB) and Marine Products Corporation (MPX). While HIBB and MPX beat NKE by gaining 35.3% and 24.2%, respectively, so far this year, DKS returned 13.6% over the same time period. Industry Rank: B Athletics & Recreation industry is ranked #36 out of the 123 industries in the StockNews.com universe. The coronavirus pandemic has had a disruptive effect on this industry, with a temporary closure of gyms and fitness centers. However, the fitness industry has adapted to the social distancing norms by creating a strong virtual platform, which allows individuals to work out remotely under the supervision of instructors. So, the industry’s near-term prospects don’t look dull. Overall POWR Rating: A Overall, NKE is rated “Strong Buy” due to a solid price momentum, short-and-long-term bullishness, strength in financials and the recovery of its industry as determined by the four components of our overall POWR Rating. Bottom Line Betting on NKE shares right now can help generate significant returns in the upcoming months, as it is expected to witness increased attention with countries resuming sporting tournaments and other athletic events. Moreover, NKE has potential to grow based on its continued business growth and favorable analyst sentiment. NKE has an average broker rating of 1.23, which indicates a bullish sentiment. Also, out of the 31 Wall Street analysts that rated the stock, 23 rated it a “Strong Buy.” Want More Great Investing Ideas? 7 Best ETFs for the NEXT Bull Market Is the Stock Market Correction Over? Chart of the Day- See the Stocks Ready to Breakout NKE shares were unchanged in after-hours trading Monday. Year-to-date, NKE has gained 18.62%, versus a 6.24% rise in the benchmark S&P 500 index during the same period."}]}