{"article": [{"url": "https://stocknews.com/news/pypl-v-ma-3-e-commerce-stocks-hedge-fund-titan-david-tepper-just-bought/", "published": 1597925300.0, "headline": "3 E-commerce Stocks Hedge Fund Titan David Tepper Just Bought", "body": "David Tepper has one of the most successful, long-term track records in investing. He built Appaloosa from a small shop into a behemoth with more than $14 billion in assets. &nbsp In recent years, he’s been returning investors’ and focusing on managing his and his employee’s money as he pursues philanthropic interests and lives out his childhood dream by owning an NFL team. &nbsp However, his 13F SEC filings reveal that he remains active and engaged in the markets. In the second quarter, Tepper was a net buyer and established new positions in several publicly traded companies. &nbsp 7 Best ETFs for the NEXT Bull MarketGiven Tepper’s long history of making successful investments, investors should pay attention to his moves. He seems particularly interested in the payment processing space as he added Visa (V), Mastercard (MA), and PayPal Holdings (PYPL) to his portfolio. Visa (V) Though we are in the midst of a recession, it still makes sense to invest in payment processing stocks such as V. Even if V cardholders default on their credit lines, the company is not directly liable for resulting losses. Rather, V prints the actual credit cards, leaving financial institutions with the ensuing legal liability should customers default. V’s global electronic payments network is revered throughout the financial community. Furthermore, V’s brass is delving into cryptocurrencies, possibly setting the stage for a transition to digital currency. The V POWR Ratings are unbeatable: A grades in each POWR Component category along with an industry rank of #1 out of 45 stocks in the Consumer Financial Services space. Furthermore, the top analysts insist V is fairly priced at $218.25, meaning the stock has about 10% upside. It won’t be long until V returns to its pre-COVID trading level of $210 – $220. V’s ascension to new heights will likely stem from its focus on digital payments. Digital payments will continue to increase during the pandemic, putting V in the perfect position to boost its revenue and capture even more market share. V’s e-commerce purchases minus those related to travel spiked 12% across the past six months alone. Furthermore, V added more than 80 million contactless tap-to-pay cards since the start of the year. Add in the fact that V is working with FB on a brand new system for peer-to-peer payments and it is easy to see why Tepper is so bullish on this stock. Mastercard Incorporated (MA) Tepper has been a long-term holder in MA. Like V, it doesn’t take on any financial risk, merely serving as an intermediary between businesses and the bank. Payment processing is quite difficult to disrupt. MA is currently the second-largest credit card payment network in the world, spanning 210 nations and 150+ currencies. From web-based payments to mobile payments, credit, debit, and more, MA nearly does it all. MA also provides marketing solutions, product development, information services, consulting, and more. If you are hesitant to invest in a payment processing company that issues credit cards, consider the fact that MA has A grades in each POWR Component. MA is ranked second of 45 Consumer Financial Services stocks. The top analysts insist MA should be priced around $345.90. If MA reaches this price point, it will have increased by 4.50% in value. Though MA has not yet returned to its pre-COVID trading level of $340-$350, the stock has steadily ascended in recent months. The case for MA is made even stronger with the acquisition of Nets, an account-to-account payment processor that will help MA obtain a portion of the real-time payments market. Scoop up MA today, hold it for years and you will likely be quite content with its growth. PayPal Holdings (PYPL) Tepper recently acquired nearly 900,000 shares of PYPL. This digital/mobile payments giant has become that much more valuable during the pandemic. PYPL is the world’s largest web-based payments solution provider, partially fueled by its Venmo peer-to-peer payment service. As long as PYPL holds off Square (SQ) in the years ahead, it should continue to increase in value, possibly breaking through its 52-week high of $204 and change by the end of this summer. The only question is whether some of the money that seemed destined for PYPL will end up being redirected to SQ following its stellar quarterly earnings. If you have any questions as to whether PYPL is worth your money, consider its POWR Rating grades of straight As in each POWR Component. PYPL is ranked third of 45 stocks in the Consumer Financial Services sector. Add in the fact that the top analysts insist PYPL is fairly priced around $211.34 and it becomes increasingly clear this stock will reach new heights, possibly shortly. If PYPL reaches this price point, it will have increased by nearly 10%. PYPL will have added around 70 million new customers during the pandemic alone, making the case that it is a legitimate growth stock worthy of a position in just about every investor’s portfolio. Want More Great Investing Ideas? The Best of StockNews 2 Step Process to Sell @ Market Top in September 9 “BUY THE DIP” Growth Stocks for 2020 PYPL shares were trading at $193.80 per share on Thursday morning, up $1.36 (+0.71%). Year-to-date, PYPL has gained 79.16%, versus a 5.76% rise in the benchmark S&P 500 index during the same period."}]}