{"article": [{"url": "https://stocknews.com/news/acb-will-aurora-cannabis-keep-falling-now-that-terry-booth-has/", "published": 1593691700.0, "headline": "Will Aurora Cannabis Keep Falling Now That Terry Booth Has Left the Board?", "body": "It’s been a tough few weeks for shares of Aurora Cannabis (ACB) as the stock has continued its fall. Despite posting a solid earnings report last quarter, which beat analyst expectations, the stock has not been able to hold onto the momentum that followed and it is now trading around $12. Now it looks like the stock has further down to go. Investors have been waiting patiently for the company to announce who their next permanent CEO will be but nothing has been released yet. Though, it’s not all doom and gloom for the company. ACB has a long road to recovery, but things are changing, which leaves me cautiously optimistic. 7 Best ETFs for the NEXT Bull MarketThe company announced that co-founder and former CEO Terry Booth gave up his seat on the board of directors this past Friday. Although Terry Booth was one of the founding fathers of ACB, many retail investors had blamed him for his carelessness when it came to acquisitions and share dilution. In my opinion ACB was a perfect example of what happens when an inexperienced CEO gets paid too much and doesn’t know how to allocate capital appropriately. I view Terry Booth’s departures as a step in the right direction. ACB did not provide a reason for Booth’s departure, and Booth did not make any public statements on the matter. There is no information available as to what Booth plans on doing after stepping away from the company. This comes less than two weeks after co-founder and board member, Steve Dobler left. In the press release ACB continued to credit Booth saying that, “He helped set the table for the company to lead in Canada and globally, and we continue to execute our plan to do so profitably.” One analyst who has been bearish on ACB for a while now offered his opinion. GLJ Research founder Gordon Johnson recently discussed Canadian cannabis stocks, which have made a comeback since the market hit bottom in March. Johnson remained bearish, saying that the best data on the Canadian cannabis market is from Stats Canada, and recent trends are not encouraging. Johnson mentioned that, “In March, Canadian cannabis sales skyrocketed. What happened? Everybody got scared. They thought we were going to be locked in for a long time, so people stocked up on inventory.” Due to the uptick in sales, investors thought the Canadian market had finally reached a turning point in the fall in 2019 when stocks rallied. The sales were down in April. Due to the high inventory levels that remain in Canada, Johnson said cannabis stocks need consistent growth in sales, or cannabis prices will face significant pressure. New cannabis store openings were down in April, and cannabis prices were down in June. Johnson added that, “I think the stocks trade-off significantly. And when I say the stocks, I’m talking about Aurora and Tilray,” he said. “I’d be short Aurora, and I’d be short Tilray. On the flip side of that, you may look positively on some of the U.S. MSOs.” This is one concern we have stressed time and time again when it comes to ACB and the fact that investor optimism has been baked into the stock after its recent rally. As we can see, if ACB wants to hold on to its recent gains, or what’s left of them, the company needs to deliver next quarter, and they need a new CEO as soon as possible. Overall, I remain bullish over the long term, but ACB could see some further downward pressure in the short term. Disclosure: The author is long ACB Want More Great Investing Ideas? 9 “BUY THE DIP” Growth Stocks for 2020 Is the Bull S#*t Rally FINALLY Over? 7 “Safe-Haven” Dividend Stocks for Turbulent Times Top 3 Investing Strategies for 2020 ACB shares were trading at $12.10 per share on Thursday afternoon, down $0.17 (-1.39%). Year-to-date, ACB has declined -53.32%, versus a -1.44% rise in the benchmark S&P 500 index during the same period."}]}