{"article": [{"url": "https://stocknews.com/news/mnst-kdp-fizz-3-top-beverage-stocks-to-refresh-your-portfolio/", "published": 1596024500.0, "headline": "3 Top Beverage Stocks to \"Refresh\" Your Portfolio", "body": "The stock market has mostly been sideways since the beginning of June with the S&P 500 range-bound between 3,000 and 3,280. The market’s near term direction is difficult to determine given the number of uncertainties like Congress’ decision on extending unemployment benefits, the virus’ spread, and how the economy reacts. One way to protect your portfolio is to add some true value stocks to balance out the swings in growth stocks. Beverage stocks just might refresh your portfolio as investors park their money in these relatively safe havens. In particular, Keurig Dr. Pepper Inc. (KDP), Monster Beverage Corporation (MNST) and National Beverage Corp. (FIZZ) have a good chance of increasing in value throughout the remainder of the summer and into fall. Keurig Dr. Pepper Inc. (KDP) Just about everyone loves Dr. Pepper and Keurig coffee machines. Take a sip of KDP’s Green Mountain coffee and your spirit will be lifted. Headquartered in Plano, Texas, KDP is one of America’s top beverage companies. KDP has yearly revenue over a whopping $11 billion. If you have any doubt as to whether KDP is worthy of your investing dollars, consider the stock’s POWR Ratings. KDP has A grades in each POWR Component but for its Industry Rank. KDP is ranked second of 29 stocks in the Beverage category. In short, it is hard to find a stock with a better POWR Rating profile than KDP. The average analyst price target for KDP is an impressive $33.50. At the moment, KDP is trading at $31, meaning if the analysts’ expectations are correct, the stock still has nearly 8% upside to go. 7 Best ETFs for the NEXT Bull MarketIt is hard to believe KDP dropped down below the $20 level in March. After all, people will still consume soft drinks and coffee even if the economy is mired in a prolonged recession. Monster Beverage Corporation (MNST) There is a sharp divide between older individuals who dislike energy drinks and the millennials, members of Generation Z, and younger individuals who cannot get enough of energy drinks. Fortunately for MNST investors, those who favor energy drinks are the prime earners of the future. MNST makes and sells energy drinks as well as fruit juices, iced tea, lemonade, and vitamin-infused juice beverages. Check out the analysts’ take on MNST and you will find seven rates it as a Buy, four rates it as a Hold, and one advises investors to Sell. MNST’s forward P/E ratio of 36 is reasonable because it is considered a growth company. MNST’s customer base is growing with each passing year. Youngsters are likely to continue purchasing energy drinks through adulthood and possibly even into their golden years across the decades to come. This is precisely why MNST is merely a dollar away from its 52-week high of $77 and change. Even if Coca-Cola rolls out a buyout offer the MNST brass cannot refuse, MNST shareholders will still benefit as the stock will inevitably soar on the news. National Beverage Corp. (FIZZ) If you are like most people, you have consumed a LaCroix Sparkling Water, Faygo or Shasta drink in recent months. FIZZ makes each of these popular beverage lines. Take a look at FIZZ’s one-year chart and you will be quite impressed. The stock is currently trading around $70 yet it was selling for a mere $42 one year ago. FIZZ’s multi-flavored beverages range from juice drinks to specialty drinks, water, and beyond. The FIZZ POWR Ratings are perfect: As in every single POWR Component along with a rank of six out of nearly 30 stocks in the Beverages category. Furthermore, FIZZ has a forward P/E ratio of 25, meaning it is a solid value at its current trading price of $68 and change. FIZZ recently beat analysts’ estimates for both revenue and earnings per share, indicating the company has considerable momentum moving into the second half of the year. FIZZ is quickly approaching its 52-week high of $69.80. There are a good chance FIZZ blasts right through this level, reaching a new high in the low to mid-$70s as we head into the home stretch of summer. Want More Great Investing Ideas? 9 “BUY THE DIP” Growth Stocks for 2020 Newly REVISED 2020 Stock Market Outlook 7 “Safe-Haven” Dividend Stocks for Turbulent Times MNST shares were trading at $76.61 per share on Wednesday morning, up $0.42 (+0.55%). Year-to-date, MNST has gained 20.55%, versus a 1.43% rise in the benchmark S&P 500 index during the same period."}]}