{"article": [{"url": "https://stocknews.com/news/spy-pru-the-smartest-way-to-profit-from-the-greatest-rally-of/", "published": 1598616500.0, "headline": "The Smartest Way to Profit From the Greatest Rally of All Time", "body": "In part 1 of this series, I explained why UBS’ theory that stocks could go up another 9% in the next year isn’t just plausible, history says it’s actually likely. However, just because stocks could go up significantly in the short-term doesn’t mean there aren’t smart and stupid ways to try to earn tasty profits. There is one final fact that investors need to know about the smart way to profit from the greatest bear market recovery rally in US history. A fact that will both help you maximize your short-term profits, as well as avoid some nasty short-term volatility and potentially catastrophic losses when the party inevitably comes to a halt. UBS Is Correct About Interest Rates…But There Is an Important Catch UBS talked about how the average equity risk premium has averaged 3.8% over the past five years. Five years is not actually a statistically significant period of time in the stock market. 7 \"SAFE HAVEN\" Dividend Stocks for Turbulent TimesAccording to JPMorgan Asset Management, the 4th largest asset manager in the world, since 1995 just 45% of five-year returns are explained by fundamentals. It takes 10+ years for 90% to 91% of returns to become a function of fundamentals. But there is some good news for bulls hoping UBS is right. According to Goldman Sachs, over the last 20 years, the equity risk premium has averaged 3.7%. So what does that mean? That the equity risk premium is relatively stable over time, including the entire modern era that includes interest rates ranging from 0.5% to 6.5%, as well as the current low rate, debt-funded buyback, and Fed QE era. So that settles it right? Time to plow all our money into the market and make some sweet sweet money right? Actually no. In part 1 I showed how the Congressional Budget Office backed up UBS’s expectation that 10-year yields, the proxy for long-term interest rates, would be at 0.9% through the end of 2021. That’s the level of interest rates UBS says is required for the market to justify a forward PE of 22 and hit its 3,700 June 2021 target. But take a look at what the CBO estimates will happen in 2022 and beyond. 10-year yields are expected to finish 2022 at 1.1% finish 2024 at 1.5% finish 2030 at 2.6% In other words, the CBO estimates long-term rates will rise by about 2% once the economy recovers. Moody’s has its own estimates of long-term average 10-year yields, and those are 1.75% to 2.25% or basically an average of 2.0%, a 1.5% increase. The blue-chip consensus among economists, meaning the 16 most accurate out of the 45 tracked by MarketWatch, is for 10-year yields to eventually return to 2.0% to 2.6% as well. So what does that mean for long-term PE ratios for stocks? That the market’s historical fair value range of 16.5 to 17.5 is where the best economists in the world, expect the market to eventually return. (Source: F.A.S.T Graphs, FactSet Research) Does that mean a huge market crash is coming soon? Nope. It does mean that volatility risk is very high right now and that any one of the numerous risk factors facing us could trigger a historically normal, and healthy correction. More importantly, it means that over the next 10 years, stocks are likely to see the current 23.6 forward PE (43% historically overvalued) contract by a significant amount. the current yield on the S&P 500: 1.74% the long-term consensus growth rate (adjusting for the historical probability of recessions): 6.4% CAGR valuation drag from PE mean reversion: -3.6% CAGR 10-year total return potential: 4.5% CAGR probability-weighted 10-year expected return: 3.4% CAGR Stocks aren’t likely to suffer another lost decade…unless this decade is bookended by two bear markets like the 2000s were. Rather stocks are likely to merely deliver highly disappointing but perfectly reasonable returns for anyone who understands how the market really works over the truly long-term. This is the downside of a red hot, TINA/FOMO driven rally. The bigger downside, from the perspective of most investors, is that stocks never move in a straight line. Buying today doesn’t mean that stocks will just float higher by 3.4% CAGR and end up at fair value in 2030. Rather the market always trends higher interrupted by periods of intense and frightening (to most people) volatility. (Source: Advisor Perspectives) Fortunately, there is a way to not just profit from the great bear market recovery rally in history, but avoid losing your shirt when the party invariably stops, and the bears once more run rampant on Wall Street. The Best Way To Profit From The Rally…Without Losing Your Shirt When It Finally Ends My fellow Dividend King co-founder Chuck Carnevale likes to remind us often that it’s a “market of stocks, not a stock market.” By which he means that something great is always on sale if you just know where to look. Through August 18th 62% of the S&P 500 companies were negative for the year, including a lot of companies that are still in bear markets and trading at some of the most attractive valuations in years. For example, just 14% of financials are positive for the year. Financials will likely benefit very strongly from the eventual 1.5% to 2% increase in long-term interest rates that are ultimately what will make this current market bubble unsustainable. No, I don’t mean you should run out and buy low quality yield traps, I’m talking about world-class blue-chips that are trading at valuations that price in negative growth which analysts say is highly unlikely. Take Prudential Financial (PRU) for example. PRU Fundamentals quality score: 9/11 Blue-Chip safety score: 5/5 above-average (2% to 3% dividend cut risk in this recession, 0.5% risk in a normal recession), stable outlook Max portfolio risk cap recommendation: 7% or less yield: 6.4% current price: $68.37 Potential good buy price: $87 2020 average historical fair value: $103 ($87 to $120 range, Morningstar estimate $78, uncertainty “high”, Morningstar fair value based on adjusted book value of 0.8 vs 0.94 historical) approximate discount to fair value: 33% DK rating: potentially strong buy historical fair value: 9 to 9.5 current blended PE: 6.6 Earnings yield (Chuck’s “essence of valuation”): 15.1% vs 6.7% recommended Growth price into stock: about -1.0%% CAGR according to Graham/Dodd fair value formula Growth priced into the stock: about 4.2% based on historical PEG long-term growth consensus: 9.0% CAGR the margin of error adjusted analyst long-term consensus growth forecast: 6% to 11% CAGR 5-year total return potential: 18% to 23% CAGR (analyst consensus 20.6% CAGR) PEG ratio: 0.81 vs 1.56 historical vs 2.73 S&P 500 vs 2.35 historical S&P 500 Investment Decision Score: 100% = A+ exceptional (Source: Dividend Kings Investment Decision Tool) PRU is one of the highest quality insurance giants on earth. S&P and Fitch both rate it “A stable” and Moody’s rates it A3, the equivalent of A- stable. It has 20% debt/capital, a safe level of leverage for an insurance company. It has a 47% 2020 consensus payout ratio vs 50% safe for insurance companies in normal economic times. PRU’s 2020 consensus payout ratio is 47% and that’s after analysts are factoring in an expected 20% decline in earnings this year. 2021 consensus EPS growth: +23% 2022 consensus EPS growth: +12% Prudential can be bought for about $69 today, but its fair value is $103 in 2020, $119 in 2021, and $131 in 2022. Prudential Valuation Matrix Metric Historical Fair Value (6 yr timeframe) 2020 2021 2022 5-Year Average Yield 3.61% $120 $128 $133 Earnings 9.3 $87 $107 $120 EBITDA 7.3 $104 $122 $130 EBIT 7.3 $99 $119 $143 Average $103 $119 $131 (Source: F.A.S.T Graphs, FactSet Research) The very same rising interest rates, courtesy of the post-pandemic economic recovery that has doomed the current market rally eventually, sets up PRU for some truly incredible long-term gains. (Source: F.A.S.T Graphs, FactSet Research) Gains like a 95% consensus return potential through 2022, which amounts to 33% CAGR returns. PRU returning to historical fair value, a modest 9.3 PE, combined with its generous and very safe 6.4% yield and strong earnings growth, is what can deliver returns that are far superior to what the S&P 500 is likely to deliver during its short-term rally. (Source: F.A.S.T Graphs, FactSet Research) Compare PRU’s 2022 consensus return potential to the S&P 500’s. Which would you rather own? A collection of companies that are so overvalued that if the economy recovers and internet rates rise to levels that the world’s best economists say is likely, stocks would deliver basically zero returns over the next 2 years? Or an A-rated insurance giant (and one of the world’s largest asset managers) that yields a very safe 6.4% and analysts expect to hike its dividend 5% in both 2021 and 2022? Would you rather that the inevitable rise in interest rates allow you to enjoy great returns and safe dividends while you wait? Or would you rather pray that “bad news keeps being good news” for stocks? Successful long-term investing is all about making high-probability/low-risk choices with your hard-earned savings. I and Dividend King’s portfolios have now bought Prudential six times in recent months, and we’re sitting on a nice 12% capital gain. More importantly, we’ve locked in almost 7% yield on cost and are now just patiently waiting to earn the kind of market-smashing long-term returns that are guaranteed as long as this anti-bubble stock generates 0+% CAGR growth over the long-term. Want More Great Investing Ideas? 7 Best ETFs for the NEXT Bull Market Why Stocks Could Drop 20% in September? 9 “BUY THE DIP” Growth Stocks for 2020 SPY shares . Year-to-date, SPY has gained 9.34%, versus a % rise in the benchmark S&P 500 index during the same period."}]}