{"article": [{"url": "https://stocknews.com/news/vsto-swbi-rgr-swph-2-gun-stocks-thatll-soar-on-a-biden-win/", "published": 1593691700.0, "headline": "2 Gun Stocks That'll Soar on a Biden Win", "body": "2020 has been a strange year, and it’s only halfway over. The global pandemic, economic shutdown, protests, riots, stock market crash, and the government’s money printer running at full blast are just an appetizer for the main event – November’s elections. Recent developments have been bullish for the gun industry, but the elections are going to be another major catalyst for sales, especially if recent trends hold. 2008 and 2012 saw big spikes in gun sales following a Democrat winning the Presidential election. If Biden wins the Presidential election and the Democrats have a majority in Congress, I believe that the odds of gun control legislation passing are significant. This legislation could ban certain weapons and increase background checks. 7 Best ETFs for the NEXT Bull MarketAs a result, we could see an increase in demand for guns, as many will stockpile guns in fear of increased regulation. A previous article discussed the recent strong price action in gun stocks, highlighting Smith & Wesson Brands (SWBI) and Sturm, Ruger & Company, Inc (RGR). Here are two more stocks that could soar on a Biden victory. Vista Outdoor Inc. (VSTO) VSTO sells a wide variety of outdoor products including ammunition and firearms. Its stock has done very well in recent months due to the coronavirus leading to an increase in outdoor recreational activities. Recent political unrest has also led to increased gun purchases. The balance of power changing in Washington DC is another catalyst. VSTO’s POWR Ratings are very strong as well with a “Strong Buy” rating. It has an “A” for Trade Grade, Buy & Hold Grade, and Peer Grade with a “B” in Industry Rank. Among the Athletics & Recreation group, it’s ranked #5 out 32. Sportsman’s Warehouse Holdings Inc. (SPWH) Due to public and political pressure, many major retailers like Walmart (WMT) and Dick’s (DKS) are opting to not sell firearms or ammunition. SPWH is a beneficiary of this decision. This is in line with changing public attitudes that have shifted due to a variety of high-profile incidents of gun violence and younger people being more liberal and favoring gun control. This is evident from Gallup polling on the subject: A company that appeals to “middle America” now has to get out of the gun business. But, it creates opportunities for other companies. SPWH has 103 stores in 27 states. In addition to guns, it sells all sorts of outdoor items. This category has done very well as it’s one of the only forms of vacation or recreation that’s possible with social distancing. During the early days of the coronavirus, lines were forming early at stores due to these factors. The stock has nearly tripled over the past three months. However, it retains an attractive financials with a forward price to earnings ratio of 16 and 33% gross margins. Sales were 41% higher this quarter compared to last year. Want More Great Investing Ideas? 9 “BUY THE DIP” Growth Stocks for 2020 Is the Bull S#*t Rally FINALLY Over? 7 “Safe-Haven” Dividend Stocks for Turbulent Times Top 3 Investing Strategies for 2020 VSTO shares . Year-to-date, VSTO has gained 104.01%, versus a -1.99% rise in the benchmark S&P 500 index during the same period."}]}