{"article": [{"url": "https://stocknews.com/news/mdlz-hsy-k-hain-ths-5-food-stocks-for-profit-hungry-investors/", "published": 1597320500.0, "headline": "5 Food Stocks for PROFIT-HUNGRY Investors", "body": "Minimalism is en vogue especially now that a global pandemic has made people appreciate what they used to take for granted. It’s leading people to spend more time outdoors, prepare meals at home, and reconnect with their families over the phone or Zoom (ZM). The shift toward minimalism will undoubtedly hurt businesses in many sectors. More time at home and less eating out are positive for food stocks. Though people are certainly willing to cut spending on entertainment, fashion, and other luxuries, everyone will continue to spend on food. Let’s take a look at a couple of the more intriguing food stocks: Mondelez International (MDLZ), The Hershey Company (HSY), Kellogg Company (K), The Hain Celestial Group (HAIN) and TreeHouse Foods (THS). Mondelez International (MDLZ) 9 \"BUY THE DIP\" Growth Stocks For 2020Snacking is on the rise as people are stuck inside, working from home, binging on Netflix (NFLX), and killing time during the quarantine. MDLZ’s snacks and other foods are flying off the shelves. MDLZ offerings include Nabisco products, Cadbury chocolates, Oreo, Trident, and Tang powdered beverages. The MDLZ Power Ratings are nearly flawless: A grades in all POWR Components along with a B Peer Grade. MDLZ is ranked first of more than 50 Food Makers stocks. The top analysts are quite bullish on MDLZ, setting a price target of $62.08. If MDLZ reaches this price, it will have increased by more than 11%. The bottom line is MDLZ comfort foods will be consumed far and wide as the pandemic plays out. This trend is evidenced by MDLZ’s second-quarter numbers that show a 16% year-over-year spike in North American per-share profits. The Hershey Company (HSY) Just about everyone loves Hershey products. Though the temporary closure of Hersheypark will take a chunk out of HSY’s revenue, the company’s tasty delights just might make up the losses and then some. The fact that HSY’s North American operating segment consists of nearly 90% of its net sales bodes well for the stock because United States residents will likely be subjected to quarantine for months if not years into the future. While most other countries will reopen their economies and resume fairly normal living, the United States will likely be battling the virus for at least another couple of quarters. As we all know, spending more time indoors means the consumption of junk food sold by the likes of HSY will increase. HSY’s POWR Ratings are exemplary: A Trade and Industry Rank grades, a B Buy & Hold Grade, and a solid Peer Grade. HSY is ranked in the top third of Food Makers stocks. If the analysts are correct, HSY will hit $149.58 in the months ahead, rising nearly 5%. Kellogg Company (K) Cereal, snacks, and vegan food are K’s specialties. If you are wondering how K has entered the vegan market, you have likely seen its MorningStar Farms vegan line at your local store yet did not know K is behind the brand. All in all, K’s products are marketed in nearly 200 countries. K’s POWR Ratings are just about perfect: A grades in every POWR Component but for its Peer Grade of B. K has a ranking of six out of 56 Food Makers stocks. The analysts insist K is currently underpriced, having set a price target of just under $72. With a forward P/E ratio of 17.50, momentum stemming from its MorningStar Farms vegan line of faux meat and consumers across the land packing on the pounds while under quarantine, K is in the catbird seat. The Hain Celestial Group (HAIN) The societal shift toward organic and natural foods is in full swing. Health-conscious consumers are steering the market toward nutritious, clean, and eco-friendly foods that benefit the body as well as the environment. HAIN makes these products. HAIN’s growing vegan line makes the company even more attractive from an investor’s perspective as that many more members of the millennial and Generation Z age cohorts adopt the vegan diet. HAIN has exemplary POWR Ratings highlighted by As in each POWR Component along with a B Peer Grade. HAIN is ranked 13th of 56 Food Makers stocks. HAIN’s strength is exemplified by its rapid one-week rebound from the coronavirus sell-off. The stock moved right back to its pre-COVID trading level in merely five days and has escalated even higher in the months since. Look for HAIN to break through its 52-week high in the months ahead, possibly reaching the $40 mark before year’s end. TreeHouse Foods (THS) Pickles, peppers, relish, soup, and baby food. Each is a near-necessity – if you have good taste, that is. If these food products suit your fancy, THS will whet your appetite. THS has 50+ manufacturing facilities in the US, Canada, and Italy. The beauty of THS products is they are shelf-stable, meaning consumers far and wide are stocking up on them while hunkering down during a pandemic that might last a year or even longer. THS offerings include organic, natural, and preservative-free food products sure to appeal to health-conscious consumers. Though the THS POWR Ratings are not fantastic, the company has an A Industry Rank grade along with a solid Buy & Hold Grade. Furthermore, THS is ranked near the top half of all Food Makers stocks. THS currently trades at a forward P/E ratio of 16, meaning it likely has some room to move upward as the pandemic plays out. If THS approaches the top analysts’ price target of $55.80, the stock will have risen nearly 30%. MDLZ shares were trading at $56.16 per share on Thursday afternoon, up $0.13 (+0.23%). Year-to-date, MDLZ has gained 3.16%, versus a 6.10% rise in the benchmark S&P 500 index during the same period."}]}