{"article": [{"url": "https://stocknews.com/news/cmcsa-ffin-mant-mdc-4-top-stocks-still-increasing-dividends/", "published": 1600085300.0, "headline": "4 Top Stocks Still INCREASING Dividends", "body": "The pandemic has significantly affected many businesses, leaving limited room to return capital to shareholders. As staying afloat has become difficult for several companies due to declining sales and poor cash flow, those that pay dividends either suspended or cut their payments. During the second quarter, the number of companies cutting dividends increased 931% year-over-year to 639. So, there are only a few stocks in that market today that have been able to increase dividends. A pandemic-ready business model and sound financials helped these companies escape market downturns and enhance shareholder returns. Needless to say, these stocks are better poised to help an investor to survive the ongoing market volatility with a steady flow of income. Here are four stocks that have a reliable history of dividend growth: Comcast Corporation (CMCSA), First Financial Bankshares, Inc. (FFIN), ManTech International Corporation (MANT), and M.D.C. Holdings, Inc. (MDC). 9 \"BUY THE DIP\" Growth Stocks For 2020Comcast Corporation (CMCSA) CMCSA is a global media and technology company. It is one of the largest high-speed internet, video, and phone providers in the United States with three primary businesses – Comcast Cable, NBCUniversal, and Sky. It operates through the following segments – Cable Communications, Cable Networks, Broadcast Television, Filmed Entertainment, Theme Parks, and Sky. CMCSA has been consistently paying a dividend each quarter since 1986 and increasing its payout during the first quarter every year. The company raised its dividend by 9.5% in March amid the pandemic. The most recent dividend declared by the company was $0.23 for the second quarter, cumulating to an annual dividend of $0.92. Over the last 10 years, the average dividend per share growth for CMCSA was 16.9% per year. The current annual dividend translates into a 2.06% yield. The company delivered free cash flow of $5.6 billion in the last reported quarter, increasing 40% year-over-year. It generated $8.6 billion cash flow from operations, growing 23% compared to the year-ago quarter. The top-line came in at $23.7 billion as the total customer relationships increased by 217,000 to 32.1 million in the second quarter of 2020. EPS for the quarter came in $0.69, delivering a surprise of 25.5%. CMCSA’s NBCUniversal successfully launched the Peacock streaming service in April, with 10 million sign-ups through the quarter that ended in June. Sky successfully retained 99% of total customers and 95% of sports subscribers since the crisis began. Hence, the street estimates EPS to grow 22.9% next year. How does CMCSA stack up for the POWR Ratings? A for Trade Grade A for Buy & Hold Grade A for Peer Grade B for Industry Rank A for Overall POWR Rating. It is ranked #1 out of 14 stocks in the Entertainment – TV & Internet Providers industry. First Financial Bankshares, Inc. (FFIN) FFIN provides commercial banking products and services in Texas. With assets of $10.3 billion, the company operates multiple banking regions with 78 convenient locations, plus a Trust Company with nine convenient locations. The company accepts checking and deposits, and offers loans to businesses, individuals, and farm and ranch operations. FFIN pays an annual dividend of $0.52, translating into a dividend yield of 1.78%. The company has been uniformly paying quarterly dividends since 1993. The most recent dividend declared by the company was $0.13 for the second quarter that ended in June, implying an 8.3% increase. Over the last five years, the average dividend per share growth for FFIN was 11% per year. FFIN’s second-quarter results did not fail to impress the street. Free cash flow for the quarter came in at $81.3 million, increasing 133% year-over-year. The company funded nearly 6,500 loans totaling over $700 million during the quarter. Net interest income for the quarter increased $17.62 million year-over-year to $89.3 million. EPS for the quarter came in $0.38, beating the consensus estimates by 46.2%. The company has been positively affected by its participation in the Small Business Administration Paycheck Protection Program (PPP), with an increase in investment securities and the reduction in interest rates paid on deposits. The market expects EPS to grow 9.1% in the current year. In our POWR Ratings system, the company has been accorded a grade of “A” for Peer Grade. Among the 29 stocks in the Southwest Regional Banks industry, it’s ranked #2. ManTech International Corporation (MANT) MANT is a leading provider of innovative technologies and solutions for mission-critical national and homeland security programs. The company provides solutions and services for U.S. defense, the intelligence community, and federal civilian agencies worldwide. MANT has been consistently paying a dividend each quarter since 2011, and increasing its payout during the first quarter every year. The company raised its dividend by 18.5% in March, amid the pandemic. The most recent dividend declared by the company is $0.32 for the third quarter, cumulating to an annual dividend of $1.28. Over the last three years, the average dividend per share growth for MANT was 8.7% per year. The current annual dividend translates into a 1.73% yield. Free cash flow for the last reported quarter came in at $42 million, while the company generated $62 million in cash flow from operations. Quarterly revenues grew 18% year-over-year to $632.5 million, primarily due to $663 million bookings, resulting in a book-to-bill ratio of 1. EPS for the quarter came in at $0.74, increasing 23.3% year-over-year. The company recently announced that it has been awarded a five-year $87 million contract to provide advanced IT software research, development and engineering in support for the Naval Sea Systems Command (NAVSEA) ship maintenance mission. The market estimates EPS to grow 22.8% in the current year. In our POWR Ratings system, MANT has a grade of “B” for Peer Grade. It is ranked #23 out of 65 stocks in the Air/Defense Services industry. M.D.C. Holdings, Inc. (MDC) MDC engages in homebuilding and originating mortgage loans. Its homebuilding subsidiaries, which operate under the name Richmond American Homes, have built and financed the “American Dream” for more than 210,000 home buyers since 1977. MDC pays an annual dividend of $1.32, which translates into a dividend yield of 2.95%. The company has been unvaryingly paying dividend every quarter since 1984. It raises its dividend during the first quarter each year. The company increased its payout by 10% this year, compared to the preceding year. The last dividend paid by the company was $0.33 in August 2020. The company has grown its dividend at a CAGR of 13% in the last three years. MDC produced $86.4 million in free cash flow in the last reported quarter, compared to the year-ago negative free cash flow of $6.2 million. Cash flow from operations increased 6,936% year-over-year to $93 million. Home sale revenues increased 21% year-over-year to $886.8 million, as order activity rebounded sharply from the initial weeks of the pandemic. Unit deliveries were up 25% year-over-year to 1,900. EPS for the quarter came in $0.38, beating the consensus estimate by 18.8%. MDC is benefiting from the favorable industry dynamics, including a low mortgage rate environment, a lack of available supply, and highly motivated buyers. The last couple of quarters also reflect its continued shift in focus to the more affordable segments of the market, and the benefits of a build-to-order strategy. The street expects EPS to rise 43% year-over-year in the current quarter. MDC’s strong momentum is reflected in its POWR Ratings. It has a “Strong Buy” rating with a grade of “A” in Trade Grade and Buy & Hold Grade, and a “B” in Peer Grade and Industry Rank. Within the Homebuilders industry, it’s ranked #4 out of 21 stocks. Want More Great Investing Ideas? 7 Best ETFs for the NEXT Bull Market Is the Stock Market Correction Over? Chart of the Day- See the Stocks Ready to Breakout CMCSA shares were trading at $45.46 per share on Monday morning, up $0.79 (+1.77%). Year-to-date, CMCSA has gained 2.84%, versus a 6.72% rise in the benchmark S&P 500 index during the same period."}]}