{"article": [{"url": "https://stocknews.com/news/xom-vips-acb-3-stocks-to-avoid-at-all-costs-in-october/", "published": 1601986100.0, "headline": "3 Stocks to Avoid at All Costs in October", "body": "The stock market has fared surprisingly well considering the state of the economy and the coronavirus putting a damper on economic activity. However, there’s increasing reason for concern: the weeks before a Presidential election tend to be bearish; Congress and the President have failed to ended stimulus talks; the economic recovery seems to be losing momentum. &nbsp This is the perfect time to review your portfolio and consider taking some profits off the table. It might even make sense to cut bait on the losers in your portfolio before they drop even further. &nbsp Below, we shed light on three stocks investors should avoid this October: Exxon Mobil Corporation (XOM), Vipshop (VIPS), and Aurora Cannabis (ACB). &nbspExxon Mobil Corporation (XOM) Oil might not move back its pre-COVID price within the next year – or ever. We are rapidly transitioning toward electric vehicles and weaning off of fossil fuels. XOM might have a few “dead cat bounces” through the remainder of 2020 yet this stock should be avoided unless you are considering shorting it. It appears as though XOM’s third-quarter loss will be significantly worse than initially feared simply because economic activity has yet to return to normal. The arrival of winter combined with a seemingly inevitable second wave of the virus will likely depress XOM stock all the more. The latest reports from Tudor, Pickering, Holt & Co. indicate XOM will likely suffer a drop of 30 cents per share. Though oil is up from its low in the second quarter, it is clearly a dying industry, as reflected by XOM’s murky outlook. Check out the XOM POWR Ratings and you will find nothing but negativity: F grades in the Buy & Hold and Trade components along with a D Industry Rank. Out of nine analysts who have studied XOM, two recommend buying, seven advise holding and two insist investors should sell. 9 \"BUY THE DIP\" Growth Stocks For 2020While XOM’s peers are making progress in reducing carbon dioxide emissions, XOM will increase its emissions by nearly 20% in the next half-decade. If it appears as though a second wave of the virus is picking up steam, investors should consider buying put options on XOM as well as other oil stocks. Vipshop (VIPS) Hedge funds are bearish on VIPS moving into the final quarter of the year. Through VIPS was a popular hedge fund holding earlier in the year, it is no longer favored by the market experts, falling out of the top 30 most popular stocks held by fund managers. It appears as though VIPS reached its ceiling of $23.91 in mid-August. The web-based discount retailer provides branded products to Chinese customers. The POWR Ratings show VIPS has an F Trade grade and Ds in the Peer and Buy & Hold components. VIPS is ranked 49 out of 115 China stocks. VIPS revenue is up a mere 6% on a year-over-year basis even though it is in the hot e-commerce sector. The question is whether China’s discount retail sales will increase, stagnate, or decrease in the years to come. If the pandemic continues and people primarily remain at home, VIPS could bounce back. However, it appears as though China’s government has a handle on the virus, thanks to its draconian measures that most other countries view as totalitarian. Add in the fact that VIPS’ CFO is leaving the company and you have even more reason to sell. Aurora Cannabis (ACB) It was not long ago when investment analysts were bullish on ACB. ACB was tabbed as the cannabis industry leader yet the company’s cultivation facilities have largely been halted, sold, or closed. Adding insult to injury is the company’s minimal income from markets outside of the United States. ACB has yet to develop meaningful partnerships. The company is also lacking equity investments. Perhaps the final nail in ACB’s coffin is the drop in cannabis prices all the way down to under $2.70 per gram. ACB is attempting to generate interest by diluting its shares to 115 million. Merely 1.3 million shares were available in 2014. Out of 13 analysts who have performed a deep dive into ACB, two recommend buying and 11 recommend holding. ACB has F grades in the Buy & Hold and Trade components along with a D Peer Grade. It is hard to believe this stock was trading more than $50 at this time last year. If you want in on the ACB action, your only play is to short the stock or buy shares of its competitors. Want More Great Investing Ideas? Do NOT Buy Stocks Before the Election! 7 “Safe-Haven” Dividend Stocks for Turbulent Times Chart of the Day- See Christian Tharp’s Stocks Ready to Breakout XOM shares . Year-to-date, XOM has declined -49.55%, versus a 5.55% rise in the benchmark S&P 500 index during the same period."}]}