{"article": [{"url": "https://stocknews.com/news/ew-algn-var-podd-4-strong-buy-medical-device-stock-to-own-for-the/", "published": 1601035700.0, "headline": "4 \"Strong Buy\" Medical Device Stock to Own for the NEXT Decade", "body": "Medical device stocks manufacture equipment and supplies, including surgical and medical instruments, dental equipment, and surgical appliances. The pandemic, lockdowns, and social distancing precautions resulted in a significant drop in surgical procedures, as patients canceled their elective surgeries. As a result, the demand for surgical supplies fell significantly. Since, patients cannot defer the treatments indefinitely, there will be a resurgence of demand. Medical device stocks have remained overlooked with pharmaceuticals stocks attracting investors’ attention amid the pandemic. However, they may be a better investment choice as the iShares U.S. Medical Devices ETF (IHI) has gained 158% over the past five years, significantly outperforming the 10.5% gain of the iShares U.S. Pharmaceutical ETF (IHE). Edwards Lifesciences Corporation (EW), Align Technology, Inc. (ALGN), Varian Medical Systems, Inc. (VAR) and Insulet Corporation (PODD) are the top medical device stocks. 7 \"SAFE HAVEN\" Dividend Stocks for Turbulent TimesEdwards Lifesciences Corporation (EW) EW is the global leader of patient-focused medical innovations for structural heart disease and critical care monitoring. The company provides its products and technologies in the United States and internationally. It is a manufacturer of heart valve systems and repair products used to replace or repair a patient’s diseased or defective heart valve. EW has recently received FDA approval to initiate the EVOQUE tricuspid replacement pivotal trial system. In July, the company also received approval from the FDA for its KONECT RESILIA aortic valved conduit (AVC), the first ready-to-implant solution for bio-Bentall procedures, a complex surgery that involves replacement of a patient’s aortic valve. EW’s revenue for the year ending 2019 was $4.3 million, up 16.8% year-over-year. Over the last five years, revenue grew at a CAGR of 12%. However, the company’s revenue for the last reported quarter declined 15% year-over-year due to the pandemic, as patients continued to weigh the risk of COVID-19 against the severe effects of progressive heart valve disease. Additionally, the company reduced current year clinical trial activity due to the crisis, causing a decline in its research and development expenditure. EPS for the last reported quarter came in at $0.34, beating the consensus estimate by 100%. EW grew its net income at an average rate of 1.3% in the last three years. The top-line for the next quarter is anticipated to grow 7% to $1.26 billion. The consensus top-line estimate for the next year of $5.1 billion indicates a 16% increase year-over-year. Moreover, the market expects EPS to grow 12.2% annually for the next five years. EW has lost 4% so far this year to close yesterday’s trading session at $74.67. However, the stock has gained more than 13% in the last six months and is trading 15% below its 52-week high of $87.79. How does EW stack up for the POWR Ratings? B for Trade Grade B for Buy & Hold Grade B for Peer Grade B for Industry Rank B for Overall POWR Rating. It is ranked #1 in the 138-stock Medical – Devices & Equipment industry. Align Technology, Inc. (ALGN) ALGN is a medical device company that manufactures and markets Invisalign clear aligners system, an invisible teeth aligner, and iTero intraoral scanners and services for orthodontists and general practitioner dentists, and restorative and aesthetic dentistry in the United States and internationally. It operates in two segments – Clear Aligner, and Scanners and Services. ALGN has served over 8 million patients with the Invisalign system. The company reached a 1 millionth Invisalign patient milestone in the Asia-pacific region in August this year. The company closed the acquisition of privately held exocad Global Holdings GmbH, a global leader in the dental CAD/CAM software market that offers fully integrated workflows to dental labs and dental practices via a broad customer base in over 150 countries during the second quarter. ALGN generated $2.4 billion in revenue for the year ending 2019. This marked a growth of 22.4% from the year-ago revenue of $1.97 billion. Over the last five years, revenue grew at an average rate of 22% per year. Revenue for the recently reported second-quarter came in at $352.3 million, declining 41% year-over-year due to lockdowns. Nevertheless, the Invisalign providers are now using virtual tools to minimize in-office appointments and deliver doctor-directed, personalized treatment. The company reported a loss of $0.52 per share for the last quarter. However, ALGN grew its EPS by 2058% year-over-year in the preceding quarter. The company’s net income grew at a CAGR of 92.8% in the last three years. The top-line for the next quarter is anticipated to grow by 1.3% to $658 million. The consensus top-line estimate for the next year of $2.85 billion indicates a 37% increase year-over-year. Moreover, the market expects EPS to grow 13% annually for the next five years. The stock closed yesterday’s trading session at $311.88, gaining 11.8% year-to-date. Furthermore, it gained huge momentum in the last six months and has returned 76% during the period. It’s no surprise that ALGN is rated a “Buy” in our POWR Ratings system. It also has an “A” for Trade Grade and Peer Grade, and a “B” for Buy & Hold Grade and Industry Rank. It is ranked #2 out of 138 stocks in the Medical – Devices & Equipment industry. Varian Medical Systems, Inc. (VAR) With over 70 years in the industry, VAR develops and delivers innovative cancer care technologies and solutions for its clinical partners around the globe. With an Intelligent Cancer Care approach, the company is harnessing advanced technologies like AI, machine learning, and data analytics to enhance cancer treatment and expand access to care. It operates in Oncology Systems and Proton Solutions segments. VAR has recently announced that it has received FDA clearance for its Eclipse v16.1 treatment planning software for proton therapy, a sophisticated radiotherapy technology accelerated to about two-thirds the speed of light, to destroy cancer cells while minimizing exposure to nearby healthy tissue. Moreover, VAR entered into a definitive agreement to combine with Siemens Healthineers AG valued at $16.4 billion in August this year. The combination will create a multi-disciplinary global healthcare leader with the most comprehensive cancer care portfolio in the industry. VAR’s revenue for the year ending 2019 was $3.2 billion, up 10.5% year-over-year. Over the last three years, revenue grew at a CAGR of 6.5%. The top-line for the second quarter ended June 2020 came in $694 million, declining 16% year-over-year. However, the company is continuing investments in its strategic enablers, positioning it well to exit the pandemic stronger, and extend its global leadership in oncology. EPS for the quarter came in at $0.67, growing 109% year-over-year and beating the street estimates by 50%. Its innovative and patient-centric culture has enabled VAR to become an iconic leader in radiotherapy and multidisciplinary cancer care, with a trusted global brand and strong customer loyalty. Revenue for the next quarter is estimated to be $838.6 million, translating into an 1.5% increase year-over-year. The top-line for the next year is anticipated to grow 12.4% to $3.5 billion. The consensus EPS estimates for the next five years indicate a 9.9% increase per year. VAR closed yesterday’s trading session at $171.86, with a year-to-date gain of 21%. The stock is presently trading at a 2.5% discount to its 52-week high of $176.19. VAR’s strong momentum is reflected in its POWR Ratings, it has a “Strong Buy” rating with an “A” in Trade Grade, Buy & Hold Grade and Peer Grade, and a “B” in Industry Rank. Within the Medical – Devices & Equipment industry, it’s ranked #6 out of 138 stocks. Insulet Corporation (PODD) PODD develops, manufactures, and sells insulin infusion systems for people with insulin-dependent diabetes in the United States. It is the global leader in tubeless insulin pump technology with its Omnipod Insulin Management System. PODD has recently expanded its commercial launch of Omnipod DASH Insulin Management System in 10 additional countries. The company has also launched a new Omnipod DASH release in the United States with the ability to automatically upload data cloud-to-cloud, and push future software updates wirelessly to customers. PODD also completed a $500 million follow-up offering of its common shares in the second quarter to further strengthen the balance sheet. PODD generated $738 million in revenue for the year ending 2019. This marked a growth of 31% from the year-ago revenue of $564 million. Over the last five years, revenue grew at an average rate of 26.4% per year. Revenue for the recently reported second-quarter came in at $226.3 million, increasing 29% year-over-year in constant currency. Total Omnipod revenue of $202 million increased 26.8% in constant currency while Drug Delivery revenue of $24.3 million increased 49% year-over-year. EPS for the quarter came in at $0.22, growing 1000% year-over-year. The consensus revenue estimates for the current quarter and the succeeding quarter stand at $221.5 million and $229.3 million, implying an increase of 15.3% and 9.5%, respectively. The current year revenue is anticipated to increase by 18.4% to $874 million. Additionally, EPS for the next year is expected to grow 239%. The market estimates the earnings to grow 171.5% annually for the next five years. With a year-to-date gain of 26.5%, the stock closed yesterday’s trade at $216.55. The stock is currently trading 7.5% below its 52-week high of $233.99. It is rated a “Buy” in our POWR Ratings system, with an “A” in Trade Grade and Peer Grade, and a “B” in Buy & Hold Grade and Industry Rank. Out of 138 stocks in the Medical – Devices & Equipment industry, PODD is rated #8. Want More Great Investing Ideas? 7 Best ETFs for the NEXT Bull Market Is the Stock Market Correction Over? Chart of the Day- See the Stocks Ready to Breakout EW shares were trading at $77.45 per share on Friday afternoon, up $2.78 (+3.72%). Year-to-date, EW has declined -0.40%, versus a 3.60% rise in the benchmark S&P 500 index during the same period."}]}