{"article": [{"url": "https://stocknews.com/news/plug-krnt-be-cyrx-4-industrial-stocks-with-strong-revenue-growth-potential/", "published": 1598530100.0, "headline": "4 Industrial Stocks with STRONG Revenue Growth Potential", "body": "Once, the coronavirus made its way to the US and forced the economy to shut down, the consensus was that the industrial sector would be badly damaged due to weak demand and supply chain disruptions. However, economic data shows this is not the case. Industrial production is bouncing back, and even more so in Asian and European countries that are ahead of the US in curbing the virus. We can also see this in how oil demand has dropped less than expected. Additionally, industries that are connected to the industrial sector like trucking and rails are near 52-week highs. Dow Theory tells us that this is a harbinger of strength in industrial stocks. U.S. Industrial production has been showing signs of improvement in the past three months. Industrial production plunged 12.5% in April but eventually recovered the lost ground with gains of 1.4%, 5.7%, and 3% in May, June, and July, respectively. The recovery is also evident from the Industrial Select Sector SPDR Fund’s (XLI) 17.7% gain in the past three months. 7 Best ETFs for the NEXT Bull MarketPlug Power Inc. (PLUG), Kornit Digital Limited (KRNT), Bloom Energy Corporation (BE), and CryoPort, Inc. (CYRX) are three industrial stocks with considerable upside due to their impressive revenue growth. Plug Power Inc. (PLUG) PLUG is an alternative energy technology provider that engages in the design, development, manufacture, and commercialization of fuel cell systems for the industrial off-road markets worldwide. It provides hydrogen fuel cell turnkey solutions for the electric mobility and stationary power markets. The company has been on an expansion spree lately. It has recently announced a $314 million worth follow-up public offering. It has also issued $200 million worth convertible senior notes to improve its liquidity. Additionally, PLUG completed acquisitions of United Hydrogen and Giner Elx in the second quarter to accelerate its green hydrogen strategy. PLUG’s revenue for the year ending 2019 was $230 million, a 32% increase year-over-year. Over the last five years, revenue grew at a CAGR of 22%. Additionally, it managed to generate a revenue of $68 million in the most recent second quarter, an 18% increase year-over-year, despite the pandemic. The company has efficiently managed and grown the capability of its supply chain to meet increased volumes while reducing costs. The top-line for the current year is anticipated to grow 34% to $317.2 million. Revenue for the current quarter is estimated to be $110 million, indicating a year-over-year improvement of 80%. The consensus top-line estimate for the next year of $421.6 million indicates a 33% increase year-over-year. PLUG closed yesterday’s trading session at $13.05, gaining 313% year-to-date. The stock has recently made a 52-week high of $14.35 and is exhibiting strong momentum. How does PLUG stack up for the POWR Ratings? A for Trade Grade B for Buy & Hold Grade A for Peer Grade B for Industry Rank B for Overall POWR Rating. It is ranked #15 in the 57-stock Industrial – Equipment industry. Kornit Digital Limited (KRNT) KRNT is an Israel-based company that develops, manufactures, and markets industrial and commercial printing solutions for the garment, apparel, and textile industries worldwide. The company serves decorators, online businesses, brand owners, and contract printers. KRNT has recently acquired Custom Gateway, a cloud-based software provider, expanding its cloud software workflow portfolio for end-to-end management of on-demand apparel and home décor production. The company has also introduced a NeoPigment Robusto Softener solution for fashion on demand. KRNT generated $180 million in revenue for the year ending 2019. This marked a growth of 26% from the year-ago revenue of $142 million. Over the last five years, revenue grew at an average rate of 20%. Revenue for the recently reported second-quarter came in at $37.4 million due to inflection in online channels during the pandemic and accelerated digital transformation in the textile industry. Revenue for the current quarter is estimated to grow 23.7% to $55.14 million. The consensus top-line estimate for the next quarter stands $54.93 million, indicating a 13% increase year-over-year. Moreover, revenue is expected to rise by 41% next year to $246.13 million. The stock closed yesterday’s trading session at $61.76, gaining more than 80% year-to-date. Furthermore, KRNT is hitting fresh highs every trading day. It’s no surprise that KRNT is rated “Strong Buy” in our POWR Ratings system. It also has an “A” for Trade Grade, Buy & Hold Grade, Peer Grade, and Industry Rank. It is ranked #19 out of 59 stocks in the Industrial – Machinery industry Bloom Energy Corporation (BE) BE manufactures solid-oxide fuel cell systems for on-site power generation. It offers Bloom Energy Server, a stationary power generation platform that converts standard low-pressure natural gas or hydrogen into electricity through an electrochemical process without combustion. BE has recently affirmed a financing partnership with NextEra Energy Resources to capitalize on a fuel cell project. The company has also announced its initial strategy to enter into the commercial hydrogen market by introducing hydrogen-powered fuel cells and electrolyzers that produce renewable hydrogen. Moreover, to improve its liquidity, the company has issued $135 million worth Convertible Senior Notes. BE’s revenue for the year ending 2019 was $785 million, a 24% increase year-over-year. Over the last four years, revenue grew at a CAGR of 55%. The top-line for the second quarter ended June 2020 came in $188 million, rising 20% quarter-over-quarter. The company is pushing to innovate and reimage its future operating models that could sustainably power communities. Revenue for the next quarter is estimated to be $257.3 million, translating to an increase of 20.4% year-over-year while the top-line for the current year is anticipated to grow 7.3% to $843.2 million. The consensus top-line estimate for the next year of $1.07 billion, indicating a 26.7% increase year-over-year. BE closed yesterday’s trading session at $16.23, with a year-to-date gain of 113%. The stock is presently trading at a 17.5% discount to its 52-week high of $19.67. BE’s strong momentum is reflected in its POWR Ratings, it has a “Buy” rating with an “A” in Trade Grade, and a “B” in Peer Grade and Industry Rank. Within the Industrial – Equipment industry, it’s ranked #20 out of 57 stocks. CryoPort, Inc. (CYRX) CYRX provides temperature-controlled logistics and bio-storage services to the life sciences industry in the Americas, Europe, the Middle East, Africa, and the Asia Pacific. It operates in two segments — Global Logistics Solutions and Global Bioservices. The company has recently announced an agreement to acquire MVE Biological Solutions to expand CYRX’s role in the cell and gene therapy supply chain ecosystem; alongside acquiring CRYOPDP to expand its global supply chain platform. It has also partnered with Medical Holdings, one of Japan’s leading pharma wholesalers, to bring temperature-controlled supply chain solutions to the Japanese market. Moreover, it has issued $100 million worth convertible senior notes in the last quarter. CYRX generated $34 million in revenue for the year ended in 2019. This manifested a growth of 73% from the year-ago revenue of $19.6 million. The company has been consistently growing its annual top-line for the last decade. Over the last four years, revenue has grown at an average rate of 64%. Revenue for the recently reported quarter came in at $9.4 million, increasing 11% year-over-year due to an excellent performance by the bio-pharma segment amid the pandemic. The consensus revenue estimates for the current quarter and the succeeding quarter stands at $10.8 million and $15.24 million, implying an increase of 12.5% and 65%, respectively. The current year revenue is anticipated to increase by 33.3% to $45.25 million. Additionally, revenue for the next year is expected to grow 133.4% to $105.6 million. With a year-to-date gain of 213%, the stock closed yesterday’s trade at $51.51 after hitting an all-time high of $56.56. The stock is up more than 315% from its 52-week low of $12.4. It is rated a “Strong Buy” in our POWR Ratings system, with a grade of “A” in Trade Grade and Peer Grade, and a “B” in Buy & Hold Grade and Industry Rank. Out of 18 stocks in the Industrial – Packaging industry, CYRX is rated #8. Want More Great Investing Ideas? 7 Best ETFs for the NEXT Bull Market Why Stocks Could Drop 20% in September? 9 “BUY THE DIP” Growth Stocks for 2020 PLUG shares fell $0.01 (-0.08%) in after-hours trading Thursday. Year-to-date, PLUG has gained 311.08%, versus a 9.34% rise in the benchmark S&P 500 index during the same period."}]}