{"article": [{"url": "https://stocknews.com/news/avgo-key-rf-3-dividend-growth-stocks-that-have-increased-payouts-by-up/", "published": 1599566900.0, "headline": "3 Dividend Growth Stocks That Have Increased Payouts by Up to 55%", "body": "The COVID-19 pandemic has wreaked havoc across a multitude of sectors including retail, airline, energy, and hospitality. Due to business shutdowns, global economies came to a standstill and consumer demand plummeted. This had a direct impact on company cash flows and revenue which led to a dividend cut for 60 S&P 500 firms. However, there have been some exceptions to this rule. A few companies have managed to raise dividends and maintain payouts amid the uncertainty. Here we look at three stocks that have raised their dividends at an annual rate of up to 55% in the last five years. A semiconductor heavyweight 7 \"SAFE HAVEN\" Dividend Stocks for Turbulent TimesThe first stock on this list is Broadcom (AVGO) which is arguably the top dividend stock in the last decade. Broadcom stock went public back in August 2009 just before the financial crisis erupted. In the last 11 years, the stock has returned a staggering 2,110%. Despite the massive gain, the company also has an attractive dividend yield of 3.6%. Further, Broadcom’s dividend per share has risen from $0.07 in December 2010 to $3.25 per share in June 2020. This indicates an annual dividend growth rate of a monumental 47% per year. In the last five years, Broadcom has increased dividends by 55% annually. So, if you invested $1,000 in Broadcom stock in August 2009, you could have bought 61 shares. Investors would have earned close to $25 in annual dividend payouts in 2011 and this figure would have risen to $100 in 2015. Now if you still own 61 Broadcom shares you can earn $793 in annual dividend payments. We have seen how Broadcom has increased its dividend yield of 2.5% in 2011 to a mind-boggling 79.3% by increasing dividends over time for long-term investors. Broadcom (AVGO) beat analyst estimates in the recent quarter Broadcom continues to remain a quality tech stock and should continue to outperform broader markets in the upcoming decade as well. In the fiscal third quarter, it reported revenue of $5.82 billion and adjusted earnings of $5.4 per share. This was above consensus revenue and earnings estimates of $5.76 billion and $5.24 respectively. It ended Q3 with an adjusted EBITDA of $3.3 billion and a free cash flow of $3.1 billion, up 21% year-over-year. The semiconductor giant has successfully expanded into other markets over the last few years including the high margin software services and cybersecurity space via acquisitions. This will help the company offset business cyclicality that is associated with semiconductor products. Broadcom’s high debt of $44 billion might concern investors. However, its cash balance of $8.9 billion and robust cash flows provide enough liquidity to meet interest payments and keep increasing dividends. Broadcom has about 420 million outstanding shares and pays over $1.37 billion a quarter or $5.5 billion in annual dividends. This indicates a payout ratio of less than 50% considering its operating cash flow of $11.2 billion, which provides Broadcom with enough room to increase dividend payouts going forward. KeyCorp (KEY) has increased dividends by 22.4% a year since 2015 Another large-cap stock that has increased dividends at a stellar rate is Keycorp (KEY). The regional-bank has been hit by a one-two punch due to a low-interest-rate environment and rising unemployment rates. Lower interest rates impact the profit margins of banks while an uptick in unemployment rates might result in higher default rates. This has meant shares of KeyCorp are trading at $12.9 which is 37% below its 52-week high. The Federal Reserve has cut interest rates by 150 basis points or 1.5% in March 2020 which as stated above will have a direct negative impact on the profit margins of most banks and lending institutions. Analysts tracking KeyCorp in fact expect company earnings to decline by 45.5% year-over-year to $0.9 per share in 2020. However, the company maintained its quarterly dividend per share of $0.185 despite a weak macro environment. However, the pullback in KeyCorp stock has also increased the company’s forward dividend yield to a tasty 5.74%. KeyCorp is a dividend growth company and has increased pay-outs at an annual rate of 22.4% in the last five years. If you bought 100 shares of KeyCorp back in 2013, you would have received $22 in annual dividend payments that year. This figure should increase to $74 in 2020, given the stock’s quarterly dividend of $0.185 per share. Is Regions Financials’ (RF) dividend safe? The final stock on the list is another large-cap bank, Regions Financials (RF). Similar to other banking stocks, Regions Financials has also lost significant momentum in recent times. The stock is trading at $11.8 per share which is 33% below its 52-week high. The Federal Reserve updated capital requirements for banks recently, which is a metric that allows lenders to absorb future losses in case of defaults. However, if the capital requirements move higher, it will also mean banks have lower flexibility to invest in income or interest generating assets. The Federal Reserve said that Regions Financials will have to increase its common equity tier 1 (CET1) capital ratio from 7% to 7.5%. The company ended Q2 with a CET1 ratio of 8.9%. With RF’s liquidity tied up in capital requirements, let’s see if its forward yield of 5.3% remains safe. In Q2, Regions Financials reported a net loss of $214 million and the company expects to generate about $350 million in net profits in Q3 which means the company can sustain dividends given its quarterly dividend payout of $150 million. RF has managed to increase dividends at an annual rate of 24% in the last five years. If you bought 100 shares of Regions Financials back in 2014, you would have received $18 in annual dividend payments that year. This figure should increase to $62 in 2020, given the stock’s quarterly dividend of $0.155 per share. The Final takeaway We can see how dividend growth stocks can increase investor wealth considerably over time. While the three companies have been dividend growth leaders, we can easily see that Broadcom remains well placed to generate outsized gains in the upcoming decade. In case the pandemic worsens, banking companies will be under pressure which might lead to dividend cuts as well. A dividend payment is not a guarantee but it remains a viable option for income investors given the current interest rate environment. Want More Great Investing Ideas? 7 Best ETFs for the NEXT Bull Market Beware Stocks in September? 9 “BUY THE DIP” Growth Stocks for 2020 AVGO shares . Year-to-date, AVGO has gained 18.01%, versus a 7.53% rise in the benchmark S&P 500 index during the same period."}]}