{"article": [{"url": "https://stocknews.com/news/db-xlf-spy-ubs-wdr-the-3-best-financial-stocks-under-15/", "published": 1595246900.0, "headline": "The 3 BEST Financial Stocks Under $15", "body": "The financial sector has not performed well this year. The Financial Select Sector SPDR ETF (XLF) is down 22% compared with a slight gain (0.5%) for the SPDR 500 ETF (SPY). Bank and insurance stocks have taken a hit due to the pandemic and low-interest rates. However, though the broad financial sector has struggled, some solid financial stocks offer a lot of growth opportunities. Those opportunities lie within low priced stocks. Low priced stocks can be beneficial to investors due to the greater potential of price appreciation. The pandemic and resulting sell-off have pushed a lot of financial stocks under $15. The trick is to find the companies worth investing in. 9 \"BUY THE DIP\" Growth Stocks For 2020Here are the three best financial stocks under $15 for your portfolio: Deutsche Bank (DB) DB is the largest bank in Germany and one of the largest in Europe. The company offers a wide range of financial, investment, and related financial products. In July of last year, the company announced a restructuring plan to reduce costs and return to profitability. The most significant change was its exit from global equity sales and trading. DB has outperformed (XLF) over the last six months by a wide margin. DB is up 20% while XLF is down 23%. The company’s restructuring plan has worked out well by reducing costs. Its adjusted costs declined at an annual rate of 4.9%. DB’s reported a first-quarter adjusted profit of $334.3 million, up 13% year over year. The company is also seeing increased deposits as its annual growth rate is 1.3% over the last four years. The stock, currently trading around $10, is rated a Buy in our exclusive momentum-based POWR Ratings. It holds grades of A for two of the components that make up the POWR Ratings, Trade Grade, and Peer Grade. The company is the #4 ranked stock in the Foreign Banks industry. UBS Group (UBS) UBS is the world’s largest wealth manager and one of the big broker-deals in the United States. The company is structured through four units, including Global Wealth Management, Investment Banking, Asset Management, and Personal and Corporate Banking, which offers financial products to retail and institutional clients in Switzerland. UBS, which currently trades around $12, is up 25% over the past three months, compared with XLF’s 8% gain. The company reported net profit minus minority interests of $1.6 billion in its latest quarterly earnings report, compared to $1.14 billion last year. This was a result of higher net interest income and a rise in fee and commission income. The company has also been entering into partnerships with other firms to gain new high net worth client bases. UBS also has a Buy rating in our POWR Ratings system. Four out of five scores in the POWR Ratings are an A or B. The stock is ranked #2 out of 44 stocks in the Foreign Banks industry. Waddell & Reed Financial (WDR) WDR is an American asset management and financial planning company. It currently has $56 billion in assets under management as of the most recent quarter. The firm provides investment services for individual and institutional investors, but WDR only serves the U.S. market, unlike the other two firms. The company employs 1,300 financial advisors that cater to the retail market. WDR also holds the distinction of being one of the country’s oldest mutual fund firms. WDR has less credit risk than other firms in the industry with cash of $16 billion and debt of $9.4 as of March 31st. The company also started to outsource transfer agency transactional processing operations, resulting in lower operating expenses in 2019. WDR invests heavily in its wealth management division by providing advisors enhanced technology, client relationship management tools, and training that should help the firm expand its assets under management. WDR’s stock price is just under 15 a share. How does WDR stack up for the POWR Ratings? A for Trade Grade B for Buy & Hold Grade B for Industry Rank B for Peer Grade B for overall POWR Rating All As and Bs reflect a Buy or Strong Buy rating in every component of the POWR Ratings. The stock is also the #15 ranked stock in the Asset Management industry. Want More Great Investing Ideas? 9 “BUY THE DIP” Growth Stocks for 2020 Newly REVISED 2020 Stock Market Outlook 7 “Safe-Haven” Dividend Stocks for Turbulent Times DB shares were unchanged in after-hours trading Monday. Year-to-date, DB has gained 30.85%, versus a 1.80% rise in the benchmark S&P 500 index during the same period."}]}