{"article": [{"url": "https://stocknews.com/news/spy-here-is-whos-likely-to-win-the-november-election/", "published": 1601035700.0, "headline": "Here Is Who's Likely to Win the November Election & What it Means For Your Portfolio", "body": "The current market decline is being blamed by some investors on rising election uncertainty. That’s certainly one plausible explanation for the S&P 500’s current pullback, which is flirting with correction territory. Fortunately, while this election is perhaps the most important in history, occurring as it is during a pandemic that shattered the US economy and threatens to push it back into a double-dip recession, we have some pretty powerful tools for forecasting who is the most likely winner in November. Biden Is Heavily Favored To Win The White House 9 \"BUY THE DIP\" Growth Stocks For 2020 Every day FiveThirtyEight, the most accurate forecasters of US elections since 2008, input the latest polls, and via the most advanced model of any media outlet, run 40,000 simulations of the election. (Source: FiveThirtyEight) Biden’s probability of victory has been stable in a range of 70% to 80% since June 1st, and he’s currently returning to the upper end of that range. Now probabilities are NOT certainties, such things don’t exist in our world. There will be just one election, not 40,000 but by simulating 40,000 daily elections with the best available data, FiveThirtyEight is able to tell us the probabilities of all the most plausible and not so plausible outcomes. However, as useful as this tool is for data nerds like me, there is a far more important race to watch than the Presidential one. Who controls the Senate is likely to determine the fate of the currently gridlocked stimulus debate, and according to Moody’s, whether or not the US is likely to fall back into a recession. The Democrats Are Slightly Favored To Win The Senate (Source: FiveThirtyEight) According to 538, the Democrats have a 61% probability of winning control of the Senate, most likely ending up with 50 or 51 seats. Real Clear Politics agrees, saying that if the current Senate polls prove accurate Democrats would end up with 51 seats and control of the chamber. Whatever your personal political leanings are, what matters for your portfolio is what’s likely to happen, not what you want to happen. So here is what a Democratic Sweep which is looking more likely with each passing day, is likely to mean for your portfolio. What An Increasingly Likely Democratic Win Means For Your Portfolio “If you mix politics and investing you’re making a big mistake.” – Warren Buffett Successful long-term investing requires second-order thinking, not knee-jerk reactions. For example, Goldman Sachs now puts the probability of corporate taxes going up from 21% to 28% next year due to a Democratic victory at 53%. ;The 53% probability of corporate tax reform is in line with the prediction market’s 54% probability of a Democratic sweep this November, Goldman highlighted… While corporate and tax hikes from the Biden administration would reduce 2021 S&P 500 earnings by 9% and likely hurt stocks, large fiscal expansion initiatives and less uncertainty with trade policy could be a tailwind for stocks, Goldman said. ” – Business Insider UBS and JPMorgan are two of the most accurate economists out of 45 tracked by MarketWatch. Here is what UBS is telling its clients about any possible outcome for the election. (Source: UBS) Based on the proposals of each party, UBS actually considers a sweep by either party to be slightly positive, even a blue-wave. That’s because, as Goldman points out, reduced trade tensions and record stimulus is likely to be beneficial for the economy. A recent poll of 32 economists at the end of August actually found that a Democratic Sweep is viewed more favorable than a Trump win, as far as what would cause them to increase Q4 GDP growth estimates. But what about the stock market? Surely higher taxes and regulations are bad for stocks, right? Not necessarily, at least according to UBS. (Source: UBS) Note that regardless of who wins in November, UBS considers it to be slightly negative to slightly positive for stocks. This implies they don’t expect the market to make any major moves regardless of who wins. (Source: JPMorgan Asset Management) JPMorgan also considers the election to be relatively a minor short-term risk factor for stocks. For example, a Democratic sweep, in which Bernie Sanders became president and a Democratic Congress raised corporate taxes to 35% (Biden proposes a 28% corporate rate) would, according to one of the most accurate economic teams in the world, cause stocks to fall less than 4%.In contrast, a full-blown Trade War would be expected to hurt stocks twice as badly as a Democratic sweep scenario that is now off the table. The point is that you need to think of your portfolio not as a casino, but like the business it is. (Source: imgflip) I have 100% of my life savings invested in my retirement portfolio. I am not losing sleep over the election, no matter who wins.The reason is that I am confident in the diversified and prudently risk-managed nature of my holdings. I own quality companies with strong balance sheets, competent and adaptable management, who are paid handsomely to overcome challenges that are constantly threatening my companies abilities to grow. Ultimately, no one knows exactly how November’s election will turn out. But we can make high-probability, low-risk decisions with our hard-earned savings that are most likely to achieve our long-term financial goals. Want More Great Investing Ideas? 7 “Safe-Haven” Dividend Stocks for Turbulent Times When Does the Next Bull Run Start? Chart of the Day- See the Stocks Ready to Breakout SPY shares were trading at $324.44 per share on Friday morning, up $0.94 (+0.29%). Year-to-date, SPY has gained 2.25%, versus a % rise in the benchmark S&P 500 index during the same period."}]}