{"article": [{"url": "https://stocknews.com/news/luv-jpm-mar-plnt-spg-5-turnaround-stocks-for-the-second-half/", "published": 1594901300.0, "headline": "5 TURNAROUND Stocks for the Second Half", "body": "Due to record amounts of monetary and fiscal stimulus, financial markets are thriving. This is clear from the Nasdaq at all-time highs, earnings from Wall Street banks, and other measures like corporate bond issuance. Also, the economy is doing better than initially expected due to enhanced unemployment insurance and the CARES Act which have prevented incomes and consumer spending from cratering. Despite these positives, certain industries have not participated in the recovery due to changes in the economy and consumer behavior. While the majority of sectors are near their 52-week highs, some are closer to their 52-week lows. 9 \"BUY THE DIP\" Growth Stocks For 2020These companies are facing serious challenges. Banks are struggling with low-interest rates which makes lending less profitable and higher defaults due to the rising unemployment rate. The travel industry is hurting because people aren’t vacationing or traveling for business. So, the airlines and hotels are experiencing a sudden loss of revenue. Restaurants and retail stores are in peril because they are dependent on people visiting their locations. Many are either shut down or continuing to operate but with higher costs and lower revenue, due to social distancing measures and increased cleaning mandates. However, there’s some hope that a Covid-19 vaccine may be developed by the end of the year. Several candidates are in clinical trials and are showing evidence of an increase in antibodies. A vaccine is the ultimate solution to this crisis and would allow life to become normal again. As the possibility of a successful vaccine increases, the most-affected industries will have the biggest gains. Investors will pile into these beaten-down shares as expectations for future revenue and earnings growth would be much higher. Here are five, compelling turnaround plays: Southwest Airlines (LUV) Goldman Sachs upgraded LUV to a buy from a sell and increased its price target to $45 which is 32% above current prices. Goldman believes that LUV’s domestic-focused business will recover faster than other airlines who are exposed to international travel. Additionally, LUV competes with smaller, regional airlines along many of its routes. Unfortunately, these carriers are going to be more affected by this crisis. They will emerge with fewer planes and less capacity, creating an opportunity for Southwest to take market share. JPMorgan (JPM) JPM’s earnings report was a reflection of the economy. Its trading business reported an astounding 72% increase in revenue, while its banking side lost money. The company set aside $8 billion in loss provisions. Banking is tough when the economy is weak, and interest rates are low. The high unemployment rate means an increase in the number of mortgages and loans that will go into default. It also means that loan demand is weak. Low rates mean that the profitability of these loans is lower as well. While JPMorgan’s short-term outlook will be negatively affected, it has one of the strongest balance sheets and will survive this period. The same can’t be said for its competitors. Just like in the previous crisis, JPMorgan was able to increase its deposits and buy out smaller, over-leveraged competitors. Simon Property Group (SPG) SPG is the largest retail REIT and the largest shopping mall operator in the US. It owns some of the premier retail properties. Physical retail and malls were struggling even before the coronavirus due to an increase in online shopping, hollowing out of the middle class, and overbuilding. However, the coronavirus has turned it into a crisis. Many locations are shut down due to government decree, and it’s unlikely that visitors to stores will return to previous levels until the health crisis passes. Despite these challenges, SPG has survived and will emerge from this crisis stronger than its peers who lack its strong balance sheet and attractive properties. This is reflected in its ability to continue making dividend payments. And once a vaccine becomes available, there is going to be pent-up demand as people will want to go to stores and eat at restaurants, once again. Marriott (MAR) A similar theme resonates with MAR. The hotel business is enduring a down period as travel is limited. However, there’s an embedded desire within humans to travel, explore new places, and take vacations. This desire is in hibernation, but it won’t be extinguished. Once a vaccine is available, and the crisis is over, demand for hotel bookings will spike. MAR also has a franchise model which means it has downside protection. Due to the crisis, many smaller hotels will go out of business. Construction of new properties has also come to a standstill. Demand will increase, and supply will be lower. This will translate into higher prices for MAR, and it will be in a good position to expand its number of rooms. Planet Fitness (PLNT) The coronavirus has forced fitness enthusiasts to workout at home. Currently, the gym is not a good place to be given that people are indoors, close together, and breathing heavily. So, the short-term outlook for PLNT is grim. However, it’s even grimmer for other gyms, who are majority-owned by small businesses or individuals without the resources to survive a prolonged shutdown or period of lower revenues. In contrast, PLNT has the resources to survive these conditions, since it’s a $5 billion company with $500 million in cash. When the health crisis passes, people will be eager to resume their regular routines. PLTN will be able to expand to fill the hole created by the number of gyms that will be shuttered. Additionally, there will be an abundance of cheap, commercial real estate locations available. Want More Great Investing Ideas? 9 “BUY THE DIP” Growth Stocks for 2020 Newly REVISED 2020 Stock Market Outlook 7 “Safe-Haven” Dividend Stocks for Turbulent Times LUV shares fell $0.12 (-0.35%) in after-hours trading Thursday. Year-to-date, LUV has declined -36.38%, versus a 0.69% rise in the benchmark S&P 500 index during the same period."}]}