{"article": [{"url": "https://stocknews.com/news/aapl-dell-hpq-3-tech-stocks-to-buy-and-hold-for-the-next/", "published": 1599653300.0, "headline": "3 Tech Stocks to Buy and Hold for the Next 20 Years", "body": "The last 10 years have seen a tech boom with technology socks gaining more weight in the market indices. The tech-heavy Nasdaq grew to become the second-largest stock exchange in the world, housing stocks with a total of four trillion-dollar market capitalization. These include hardware, software, cybersecurity, internet, cloud, etc. Today we’re going to focus on three companies in the hardware industry, which has grown by leaps and bounds over the past couple of decades. First, there was the PC trend, then the smartphone revolution, and now the data center and cloud networking boom, which is driving the industry. 7 Best ETFs for the NEXT Bull MarketThe year 2015 and 2016 was a difficult time for the hardware industry. It faced technology stagnation that discouraged consumers from upgrading, thereby reducing demand for PCs and smartphones. Hardware giants took some strategic decisions and revived their business. There was significant consolidation that created some giants that dominate the entire market. Apple (AAPL) and Samsung dominate the smartphone market, whereas HP Inc. (HPQ) dominates the PC and printer market. Then there is the enterprise storage market where Dell Technologies (DELL) is the leader. The United States is the design hub, while China is the manufacturing hub of smartphones and PCs. The hardware industry has the tenth rank in the StockNews’ POWR Ratings universe of 123 industries. And the remote working and learning trend should keep driving these stocks for a very long period. Apple Inc. (AAPL) Apple is the world’s No. 1 brand. Its high-quality products create customer loyalty that helps it demand a premium price for its products. It recently crossed the $2 trillion market valuation and is still growing. AAPL found its first trillion-dollar value in its iPhones and MacBooks. It earns more than 50% of its revenue from iPhones. In 2016, smartphone sales slowed, and AAPL reported its first decline in iPhone sales. It knew that it can no longer thrive on just iPhones. Hence, it leveraged its iOS ecosystem and ventured into services like Apple Music, Apple Arcade, and Apple TV. These services provided recurring revenue in the form of subscriptions. This helped it earn its next trillion-dollar valuation. AAPL still has a long way to go. Analysts expect fiscal 2021 to be very strong for AAPL, with revenue and EPS expected to increase by 12% and 18.7%, respectively. It is a must-have stock in your portfolio. Recently, it had a 4-for-1 stock split, making its shares cheaper in price. The company also announced a $100 billion stock buyback as it looks to use its $200 billion cash pile to give returns to shareholders. The stock has grown by 350% in the past five years. There is a reason why Warren Buffett’s Berkshire Hathaway (BRK.A) has its largest holdings in AAPL. You can buy and forget about this stock. It will grow your money multiple fold in 20 years. How does AAPL stack up for the POWR Ratings? A for Trade Grade B for Industry Rank B for Peer Grade B for overall POWR Rating The stock is also ranked #3 out of 28 stocks in the Technology – Hardware industry. Dell Technologies Inc (DELL) While AAPL thrives on selling smartphones, DELL thrives on selling its laptops and enterprise storage solutions. This 35-year old company is the world’s third-largest PC vendor. The technology conglomerate has a portfolio of businesses, including Dell, Dell EMC, Pivotal, RSA, SecureWorks, Virtustream, and VMware. The company divides its business into Infrastructure Group, which includes servers, networking, and storage, and Client Solutions Group, which includes PCs and laptops. In the last five years, the company has undergone a remarkable change. In 2016, Dell completed the $67 billion merger with EMC, creating the world’s largest privately-controlled tech company. CEO Michael Dell’s efforts paid off and the company grew its revenue. He is once again looking to restructure the company and spin-off its software arm VMware, in which Dell has an 81% stake. The remaining 19% is publicly traded. The spin-off will take at least a year and generate significant value to shareholders. Dell stock has surged 86% in the last six months and will continue to surge as the date of spin-off nears. DELL is also selling its RSA security business to private equity firm Symphony Technology Group for $2.08 billion. With this, the company aims to reduce its massive $43 billion debt it accumulated during the EMC merger. The COVID-19 pandemic has triggered the remote working and learning trend, driving the demand for consumer PCs. Companies have realized the benefits of remote working. They are now investing in data centers and virtual desktop infrastructure, which is driving the demand for commercial PCs and Infrastructure Services. Analysts expect DELL’s fiscal 2021 revenue to fall 2.6%, and EPS to rise by 5.2% as the company focuses on improving profits. DELL is rated a “Strong Buy” in the POWR Ratings. It holds straight “A” in Trade Grade, Buy & Hold Grade, and Peer Grade, and a “B” in Industry Rank. It is also the #1 ranked stock in the Technology – Hardware industry. HP Inc. (HPQ) Founded in 1939, HP is one of the oldest tech companies. It is well-known for its printers and PCs. However, the age of digitization has consolidated the printer market. However, HPQ’s PC sales offset the weakness in printer sales. Back in 2016, when the PC sales were falling, HP split its business into two; HPQ took the printer and PC businesses, and Hewlett-Packard Enterprise took the enterprise storage business. This strategy paid off with HPQ stock doubling between 2016 and 2020. The remote learning and working trend have treated HPQ well, driving demand for consumer laptops. Its fiscal 2020 third-quarter revenue dropped 2% year-over-year as a 7% surge in personal systems was offset by a 20% decline in printer revenue. Weak demand for commercial PCs and printers reduced its non-GAAP EPS by 15.5% to $0.49. Analysts expect HPQ’s fiscal 2021 revenue to fall by 4.7% and EPS to rise by 5.7% as the company focuses on improving profits. HPQ is rated “Buy” in our POWR Ratings system. It also has an “A” for Trade Grade and a “B” for Peer Grade, and Industry Rank. In the 28-stock Technology – Hardware industry, it is ranked #7. Investor Takeaway AAPL, DELL, and HPQ have been successfully serving the market for years. They have overcome challenges, such as technology stagnation and decelerating demand, and returned to growth. Their strong management has time and again taken strategic decisions that benefitted shareholders. You can buy these tech stocks on dips and feel confident about holding them for the next 20 years. Want More Great Investing Ideas? 7 Best ETFs for the NEXT Bull Market Will Stocks Fall into Historical September Slump? 9 “BUY THE DIP” Growth Stocks for 2020 AAPL shares fell $0.18 (-0.15%) in after-hours trading Wednesday. Year-to-date, AAPL has gained 60.69%, versus a 6.66% rise in the benchmark S&P 500 index during the same period."}]}