{"article": [{"url": "https://stocknews.com/news/csco-amat-ntes-bidu-4-buy-rated-stocks-reporting-earnings-this-week/", "published": 1597061300.0, "headline": "4 “Buy” Rated Stocks Reporting Earnings THIS WEEK", "body": "Earnings season occurs once every quarter and is when the majority of publicly traded companies report their profits or losses during the previous few months. This is an important time for traders, investors, and analysts because they use this information to gauge whether a company’s stock price is fairly valued, overvalued, or undervalued. Therefore, a stock’s volatility often ensues after earnings are released. This has been a particularly interesting earnings season because of the coronavirus pandemic. Traders, investors, and analysts have been understandably concerned over the impact of Covid-19 on corporate financials. Most of the companies reporting have been adding their commentary and response plans about the crisis to their earnings release and adjusting their guidance. Though we are at the tail-end of earnings season, a number of large companies will be reporting this week. Cisco Systems, Inc. (CSCO), Applied Materials, Inc. (AMAT), NetEase Inc. (NTES) and Baidu, Inc. (BIDU) are the four “Buy” rated stocks in our proprietary POWR Ratings System that are scheduled to report their quarterly results over the next four days. 9 \"BUY THE DIP\" Growth Stocks For 2020Cisco Systems, Inc. (CSCO) CSCO is scheduled to report its results for the fiscal fourth quarter ended July 2020 after the close of the market on August 12th. The market expects the company to report EPS of $0.74 for the quarter which indicates a 12.2% decline from the year-ago number. Moreover, CSCO’s consensus revenue estimate of $12.08 billion for the quarter indicates a year-over-year decline of 10%. However, CSCO’s earnings surprise history looks impressive, with the company beating the consensus EPS estimates in each of the trailing four quarters. For the fiscal third quarter, revenue decreased by 8% year-over-year and EPS increased 1% year over year. The stock has grown 46.4% since its March lows. CSCO’s recent acquisition of ThousandEyes, an internet and cloud intelligence platform will help improve network and application performance across enterprise and cloud networks as well as provide customers with an end-to-end view into digital delivery over the internet. OTEGLOBE, which is a leading wholesale carrier in South East Europe, enhanced its network backbone with Cisco ASR 9900 5th Generation Line Cards in order to meet increased Internet demand and prepare for expected growth in 5G. Furthermore, CSCO and Acacia are engaged in the ongoing review conducted by the State Administration for Market Regulation of the People’s Republic of China and expect the acquisition to get regulatory clearance. The closing of this potential acquisition will provide growth opportunities for CSCO. How does CSCO stack up for the POWR Ratings? A for Trade Grade B for Buy & Hold Grade B for Industry Rank B for Overall POWR Rating The stock is also ranked #16 out of 51 stocks in the Technology-Communication/Networking industry. Applied Materials, Inc. (AMAT) This materials engineering solutions company will hold its earnings webcast on August 13th to discuss the financial results of its fiscal third quarter. The market expects AMAT to report EPS of $0.95 for the quarter which indicates a 28.4% increase over the year-ago number. Moreover, AMAT’s consensus revenue estimate of $4.13 billion for the quarter indicates a year-over-year increase of 16%. AMAT’s earnings surprise history looks impressive, with the company beating the consensus EPS estimates in three of the trailing four quarters. For the fiscal second quarter, revenue was up 12% and EPS was up 27% year-over-year. The stock has returned more than 70% since it hit its 52-week low of $36.64 on March 18th this year. AMAT recently announced a new addition to its Centris® Sym3® etch product family which helps chipmakers pattern features for advanced memory and logic chips. The Sym3 etch system is one of AMAT’s most successful products and the company reached a milestone of shipping its 5,000th Sym3 chambers recently. Furthermore, AMAT’s new Selective Tungsten process technology removes the contact resistance bottleneck which hinders performance scaling and transistor power in foundry-logic nodes. It’s no surprise that AMAT is rated “Buy” in our POWR Ratings system. It also has an “A” for Trade Grade and Industry Rank, and a “B” for Buy & Hold Grade and Peer Grade. In the 86-stock Semiconductor & Wireless Chip industry, it ranks #30. NetEase Inc. (NTES) NTES is an interactive online Internet Services company that primarily focuses on the following segments: E-commerce, online game services, advertisement services, email and others. The company is scheduled to announce its second quarter results on August 13th before the markets open. The market expects the company to report EPS of $4.56 for the quarter ended June, which indicates a 15.2% improvement over the year-ago number. NTES’s earnings surprise history looks pretty good with the company beating the consensus EPS estimates in each of the trailing four quarters. NTES’s consensus revenue estimate of $2.44 billion for the quarter ended June indicates a year-over-year decline of 8.9% In the first quarter, net revenue increased 18.3% year-over-year and the company reported net income from continuing operations per ADS of US$3.83 as compared to US$2.99 in the year-ago period. The stock has grown more than 65% since its March lows. NTES’s POWR Ratings reflect this promising outlook. It has an overall rating of “Buy” with an “A” for Trade Grade and Peer Grade and a “B” for Buy & Hold Grade and Industry Rank. Among the 115 stocks in the China group, it’s ranked #3 Baidu, Inc. (BIDU) BIDU will report its second quarter results after the market closes on August 13th. The earnings surprise history for BIDU looks pretty good, as the company beat the consensus EPS estimates in each of the trailing four quarters. Also, the market expects the company to report EPS of $1.37 for the quarter ended June 2020, which indicates a 4.4% decline from the year-ago number. The consensus revenue estimate for BIDU’s June-end quarter of $3.69 billion reflects a year-over-year decrease of 1.8%. In the first quarter, total revenues decreased 7% and earnings per ADS increased 219% year-over-year. Since its March lows caused by the virus-led market crash, the stock has grown more than 55%. According to a PR Newswire report, which quoted a recent report from International Data Corporation (IDC), BIDU has the highest market share, invocations and offers the most AI products in the AI public cloud services market in China. BIDU is rated “Buy” in our POWR Ratings system. It also has a “B” for Trade Grade, Peer Grade, and Industry Rank. It also ranks #18 out of 115 stocks in the China industry. Want More Great Investing Ideas? 3 Possible Directions for the Stock Market from Here How to Trade THIS Stock Bubble? 9 “BUY THE DIP” Growth Stocks for 2020 CSCO shares rose $0.12 (+0.25%) in after-hours trading Monday. Year-to-date, CSCO has gained 2.00%, versus a 5.30% rise in the benchmark S&P 500 index during the same period."}]}