{"article": [{"url": "https://stocknews.com/news/ge-bynd-spwr-3-top-climate-change-stocks-to-invest-in/", "published": 1597147700.0, "headline": "3 Top Climate Change Stocks to Invest In", "body": "Scientists far and wide insist we are nearing the point of no return in the context of climate change. Potentially irreparable harm has been inflicted on our planet. Unfortunately, there is no “Earth 2.0” nor are there any inhabitable planets within reach of our space shuttles. If significant changes are not made, the entire Middle East may warm to the point that the region becomes uninhabitable. Water levels will rise, flooding major coastal cities in the United States and other nations. However, some environmentally responsible corporations make headway in the battle to conduct business in a manner that preserves our surroundings. These three stocks are making investors’ money while simultaneously combating climate change: General Electric Company (GE), Beyond Meat (BYND), and SunPower Corporation (SPWR). 7 Best ETFs for the NEXT Bull MarketGeneral Electric Company (GE) My, how the mighty have fallen. GE, once a titan of capitalism, has been reduced to a has-been. Currently trading around $6, GE has essentially become a rebuilding project. However, there is a beacon of hope in the form of GE’s Renewable Energy. In particular, GE’s wind energy business can serve as a disruptive force that captures market share, boosts the stock price, and gets this company back on the track to success. GE’s Renewable Energy unit has installed more than 42,000 units throughout the world. These wind energy solutions include both offshore and onshore turbines and digital optimization. The company even provides assistance financing and permitting wind power solutions. In short, if you are a believer in wind power, GE belongs in your portfolio. Check out TipRanks’ average analyst price target for GE, and you will see analysts have set a price target 25% above its current price. The company will likely be industrial free cash flow positive at some point next year. The path has been paved for GE to return to profitability. Look for GE to move toward $10 in the years to come. Beyond Meat (BYND) Our taste for animal flesh is contributing to the destruction of the environment. In particular, cow meat and cow byproducts are taking an enormous toll on our land and resources. Enter BYND. BYND makes faux-meat that tastes halfway decent. Though BYND meat has plenty of chemicals and potentially unhealthy artificial ingredients, its unique approach to sustenance can save the planet or at least keep it habitable for thousands of years to come. BYND recently gained entry into Chinese supermarkets after losing out on a potential deal to provide McDonald’s restaurants with vegan burgers. BYND should continue to climb or at least stagnate until other vegan food companies go public. Its increased sales in grocery stores have offset BYND’s lost revenue stemming from restaurant closures. BYND grocery store sales grew by nearly 200% in the second quarter while its restaurant sales dropped 60%. BYND should move back toward its 52-week high of $172.29 as more people hop on the vegan bandwagon. SunPower Corporation (SPWR) Solar and wind energy are the clean energy our planet desperately needs to prove habitable and healthy for millennia to come. If you are not currently invested in solar power, the time to add solar industry stocks to your portfolio is now. SPWR is one such stock worthy of your attention. SPWR designs and makes solar electric systems for homeowners as well as power plant customers. SPWR’s solar panels and solar cells are centered on semiconductors that convert the sun’s rays into electricity. SPWR recently moved above its pre-COVID trading level of $10. Now that SPWR has sold the majority of its solar manufacturing unit and microinverter business, it can square its focus on providing solar solutions to residential property owners and private companies. Furthermore, SPWR is adding energy storage to its offerings along with virtual power plants. SPWR’s profitability will likely increase in the quarters to come, as evidenced by its gross margin increase (apart from its Maxeon spin-off business) from 9.4% to nearly 18% in the second quarter of 2020. Look for SPWR to break through its 52-week high of $15.57 by the end of the year. Want More Great Investing Ideas? 3 Possible Directions for the Stock Market from Here How to Trade THIS Stock Bubble? 9 “BUY THE DIP” Growth Stocks for 2020 GE shares rose $0.01 (+0.15%) in after-hours trading Tuesday. Year-to-date, GE has declined -39.54%, versus a 4.46% rise in the benchmark S&P 500 index during the same period."}]}