{"article": [{"url": "https://stocknews.com/news/xlk-smh-sil-arkg-icln-5-outperforming-etfs-that-pay-dividends/", "published": 1597838900.0, "headline": "5 Outperforming ETFs That Pay Dividends", "body": "The coronavirus is leading to a bifurcation on Wall Street. Some sectors like technology and housing are making new highs, while others that remain impaired by the coronavirus are 50% off previous highs. It’s a challenging situation for investors. Either buy stocks whose fate is dependent on the health situation improving or chase stocks that are at high multiples. One solution is to look at ETFs which have outperformed and are paying dividends. Dividends guarantee some income from the position and would also be a tailwind if interest rates were to fall further due to the economic or health situation deteriorating. On the other hand, if the recovery continues, the companies in the ETF would earn more and fuel more gains. ETFs also eliminate any sort of single-stock risk that can come from a poor earnings report or corporate misstep. 7 \"SAFE HAVEN\" Dividend Stocks for Turbulent TimesFive dividend-paying ETFs that stand out for their exceptional performance are SPDR Select Sector Fund – Technology (XLK), VanEck Vectors Semiconductor ETF (SMH), Global X Silver Miners ETF (SIL), ARK Genomic Revolution ETF (ARKG) and iShares S&P Global Clean Energy Index Fund (ICLN). SPDR Select Sector Fund – Technology (XLK) XLK is a passively-managed, non-diversified ETF that grants investors the opportunity to gain exposure to numerous powerhouse tech firms all under a single ticker. The ETF seeks to provide precise exposure to companies from technology hardware, and peripherals; software; communications equipment; semiconductors; IT services; and electronic equipment, instruments, and components. The ETF has the Technology Select Sector Index, a representation of the technology and telecom sector of the S&P 500 Index, as its underlying benchmark. XLK closed yesterday’s trading session at $115.07 with a year-to-date gain of 25.5%. The ETF has gained huge momentum in this tech-driven market rally and is making fresh highs every day. Furthermore, the ETF has an impressive record of paying dividends. It paid a dividend at the end of each quarter for twelve years now. It has a dividend yield of 1.05%. The fund holds 71 companies in total with an average market capitalization of $777.6 billion. It has a 34.1% exposure to the Software industry followed by a 22.16% exposure to the Technology Hardware Storage & Peripherals. The top 3 holdings of the fund are Microsoft Corporation (MSFT), Apple Inc. (AAPL) and Visa Inc. (V), with the weights of 21.9%, 21.1%, and 4.6%, respectively. XLK has an AUM of $34.9 billion and an expense ratio of 0.13%. How does XLK stack up for the POWR Ratings? A for Trade Grade A for Buy & Hold Grade B for Peer Grade A for Industry Rank A for Overall POWR Rating. You can’t ask for better. It is ranked #2 out of 91 ETFs in the Technology Equities ETFs group. VanEck Vectors Semiconductor ETF (SMH) SMH tracks the overall performance of the 25 largest, US-listed companies that produce semiconductors. As technology continues to expand in this “new normal,” these chips are invariably in demand to help power new devices. The ETF has MVIS US Listed Semiconductor 25 Index, an equally weighted semiconductor index, as its underlying benchmark. The ETF closed yesterday’s trading session at $172.1 after making a fresh high of $174.33. SMH has gained 21.7% year-to-date when the S&P Semiconductor Select Industry Index has gained only 17.8% over the same period. It has also outperformed the Dow Jones U.S. Semiconductors Index that has gained 18.8% year-to-date. SMH paid an annual dividend of $2.122 last year, a 29.5% increase from the preceding year dividend of $1.638. SMH’s current dividend yields 1.4%. Apart from a 74.8% weightage to the US-based companies, the fund is also exposed to companies based in Taiwan, Netherlands, and Switzerland. The top 3 holdings of the fund are Taiwan Semiconductor Manufacturing Company Limited (TSM), Nvidia Corporation (NVDA) and Intel Corporation (INTC) with weights of 14.5%, 8.7%, and 6.8%, respectively. SMF has $2.7 billion as AUM and an expense ratio of 0.35%. SMF is rated a “Strong Buy” in our POWR Ratings system, consistent with its strong momentum. It holds an “A” in Trade Grade, Buy & Hold Grade, and Industry Rank. It is ranked #14 out of 91 ETFs in the Technology Equities ETFs group. Global X Silver Miners ETF (SIL) SIL is a leveraged ETF that provides investors an opportunity to achieve exposure to silver without holding the physical metal or encountering the nuances of a futures-based strategy. It aims to deliver investors access to a broad range of silver mining companies across the globe. The investment objective of the SIL ETF is to provide investment results that correspond to the price and yield performance of the Solactive Global Silver Miners Total Return Index. The index is a non-diversified, free-float market capitalization-weighted index designed to measure broad-based equity market performance of companies involved in the silver mining industry. SIL closed yesterday’s trading session at $48.86 with a year-to-date gain of 47.3%. Due to the accelerated demand of precious metals amid the crisis, the S&P GSCI Silver index generated a year-to-date return of 57.6%, but the ETF managed to outperform the S&P GSCI Silver Capped Component index that gained only 12.4% year-to-date. The ETF paid an annual dividend of $0.55 last year. SIL declared a dividend of $0.139 in the second quarter which is a 41.8% increase from the similar quarter last year. SIL has a dividend yield of 1.11% SIL is heavily exposed to Canadian-based companies with a 56% country weightage. This is followed by a 13% and 11.5% exposure to Russia and the United States, respectively. The top 3 holdings of the fund are Wheaton Precious Metals Corp (WPM), Polymetal International PLC (listed on the London Stock Exchange as POLY), and Pan American Silver Corp (PAAS) with 22.8%, 13.7%, and 10.8% weights, respectively. SIL has an AUM worth $655.6 million and an expense ratio of 0.66%. It is rated “Buy” in our POWR Ratings system, with an “A” in Trade Grade, and a “B” in Buy & Hold Grade and Industry Rank. Out of 35 ETFs in the Precious Metals ETFs group, SIL is rated #24. ARK Genomic Revolution ETF (ARKG) ARKG is an actively managed multi-cap thematic ETF that tries to pick the companies best positioned to profit from advancements in health care, energy, automation, manufacturing, materials, and transportation. It is concentrated in issuers in any industry or group of industries in the health care sector, including issuers having their principal business activities in the biotechnology industry. Since it is a unique multi-cap ETF, it has no underlying benchmark and tracks no index. ARKG closed yesterday’s trading session at $61.74, with a year-to-date of 84%. It has significantly outperformed the S&P 500 Healthcare index’s year-to-date gain of 5.2%. Moreover, the ETF outdid the S&P Biotechnology Select Industry Index which gained 18.6% year-to-date. The ETF currently offers a dividend yield of 3.5%. It declared a dividend of $2.11 last year. ARKG has the largest exposure to companies focussed on the Molecular Diagnostics segment; with a weightage of 22.4%. This is followed by a weight of 17.7% and 17.6% in Beyond DNA segment and Gene Therapy segment, respectively. The top 3 holdings of the fund are Invitae Corporation (NVTA), CRISPR Therapeutics AG (CRSP), and Illumina Inc. (ILMN) with 12%, 10%, and 7% weights, respectively. The ETF has an expense ratio of 0.75% and an AUM worth $1.3 billion. The portfolio’s 44.2% is occupied by the stocks in the medium market capitalization, followed by 43% small-cap stocks and 10.5% large-cap securities. It’s no surprise that ARKG is rated a “Strong Buy” in our POWR Ratings system. It also has an “A” for Trade Grade, Buy & Hold Grade, Peer Grade, and Industry Rank. ARKG is ranked #8 out of 35 ETFs in the Health and Biotech ETFs group. iShares S&P Global Clean Energy Index Fund (ICLN) ICLN is a non-diversified exchange-traded fund that offers a way to invest in the global clean energy theme, including both domestic and international stocks in its portfolio. With the global cult of people relying on alternative energy, ICLN is exposed to companies that produce energy from solar, wind, and other renewable sources. The ETF tracks approximately 30 energy-related companies and has an objective to track the S&P Global Clean Energy Index, a market capitalization-weighted index composed of global equities in the clean energy sector. ICLN closed yesterday’s trading session at $16.35. It has gained 39.2% year-to-date, slightly in excess to its benchmark that has a year-to-date yield of 38.7%. Moreover, the ETF significantly outperformed the S&P Kensho Clean Energy Index that has lost 1.9% year-to-date. The ETF has a history of paying dividends semi-annually. It has an annual dividend payout of $0.14, which translates to a 0.83% yield. ICLN has 37% exposure to the renewable electricity sector followed by a 17% exposure to the semiconductor equipment sector. The top 3 holdings of the portfolios are Xinyi Solar Holdings Ltd (listed on the Hong Kong Stock Exchange as 0968), Plug Power, Inc. (PLUG) and SolarEdge Technologies, Inc. (SEDG) with a 5.6%, 5.6%, and 5.5% weightage, respectively. It has $1.17 billion as AUM and an expense ratio of 0.46%. ICLN is rated “Strong Buy” in our POWR Ratings system, consistent with its strong sectoral performance. It holds an “A” in Trade Grade, Buy & Hold Grade, and Peer Grade. It is ranked #1 out of 35 ETFs in the Energy Equities ETFs group. Want More Great Investing Ideas? The Best of StockNews 3 Possible Directions for the Stock Market from Here 9 “BUY THE DIP” Growth Stocks for 2020 XLK shares were trading at $115.32 per share on Wednesday afternoon, up $0.25 (+0.22%). Year-to-date, XLK has gained 26.80%, versus a 6.24% rise in the benchmark S&P 500 index during the same period."}]}