{"article": [{"url": "https://stocknews.com/news/amgn-immu-trvn-cldx-4-biotech-stocks-to-buy-for-2021/", "published": 1602245300.0, "headline": "4 Biotech Stocks to Buy for 2021", "body": "Biotechnology has been one of the most sought-after industries amid the coronavirus outbreak. This makes sense, as a huge investment has been made for the development of a vaccine or treatment by both government and private organizations. In addition, the search for COVID treatments has put renewed focus on the demand for new drugs for other conditions. The iShares Nasdaq Biotechnology ETF (IBB), which can be used as an indicator of the performance of biotech stocks, gained more than 36% since hitting its low in mid-March. This compares to the S&P 500’s 27.1% return over the same period. Performance for the sector should continue into next year whether the pandemic is over or not. With a promising pipeline of candidates, Amgen, Inc. (AMGN), Immunomedics, Inc. (IMMU), Trevena, Inc. (TRVN), and Celldex Therapeutics, Inc. (CLDX) are four biotech stocks worth considering for the long-term. 7 Best ETFs for the NEXT Bull MarketAmgen, Inc. (AMGN) AMGN is one of the world’s leading independent biotechnology companies. It is focused on developing human therapeutic medication for the treatment of cardiovascular, oncology, and neuroscience related diseases. On October 8th, AMGN, Cytokinetics (CYTK), and Servier announced positive topline results from GALACTIC-HF, a Phase 3 pivotal clinical trial of omecamtiv mecarbil in patients with heart failure with reduced ejection fraction (HFrEF). The results of GALACTIC-HF show that treatment with omecamtiv mecarbil achieved the primary composite efficacy endpoint and demonstrated a statistically significant effect to reduce cardiovascular (CV) death or heart failure events compared to a placebo given to patients in the study. On October 5th, the company announced positive topline Phase 2 results from the CodeBreaK 100 clinical study, evaluating sotorasib (proposed INN for AMG 510) in 126 patients with KRAS G12C-mutant advanced non-small cell lung cancer (NSCLC), who had failed a median of two prior lines of anti-cancer therapies (immunotherapy and/or chemotherapy). In September 2020, the company had entered into a global antibody manufacturing collaboration with Eli Lilly and Company (LLY) to significantly increase the supply capacity available for Lilly’s potential COVID-19 therapies. This would allow the two companies to generate profits from scaled up production and supply. AMGN reported a 6% year-over-year increase in total revenues to $6.20 billion for the second quarter ending June 2020. EPS increased 7% from the year-ago value to $4.25, surpassing the consensus estimates by 11.3%. The market expects company’s revenue to grow 10.7% in the current quarter and 7.1% in the current year. EPS is expected to grow 3.8% in the current quarter and 6.4% in the current year. Also, the market expects the EPS to grow at a rate of 6.9% per annum over the next five years. AMGN has gained more than 35% since hitting its 52-week low in mid-March. The stock hit its 52-week high of $264.97 in July. How does AMGN stack up for the POWR Ratings? A for Trade Grade B for Buy & Hold Grade A for Peer Grade B for Overall POWR Rating. It is also ranked #1 out of 377 stocks in the Biotech industry. Immunomedics, Inc. (IMMU) IMMU is a leading biopharmaceutical company developing monoclonal antibody-based products for targeted cancer treatment. It recently transitioned from a research and development organization into a fully-integrated global biopharmaceutical company. Its pipeline comprises six clinical stage product candidates. In September, Gilead Sciences (GILD) announced that it has entered into an acquisition agreement with IMMU for $21 billion, which is expected to close by the fiscal fourth quarter ending December 2020. IMMU’s product Trodelvy has garnered $20.10 million in sales over the first two months of its commercial launch in April. The company’s revenue is expected to grow 143.5% for the next year. The company maintained a strong liquidity position of $987.50 million at the end of the second quarter. The market expects the company’s EPS to grow 49% in the current quarter and 39.7% in the current year. IMMU gained more than 885% to hit its 52-week high of $86.91 in September, since hitting its 52-week low of $8.80 in April. IMMU’s strong fundamentals are reflected in its POWR Ratings. It is rated a “Strong Buy” with a grade of “A” in Trade Grade, Buy & Hold Grade, and Peer Grade. In the 377-stock Biotech industry, IMMU is ranked #4. Trevena, Inc. (TRVN) TRVN is a biopharmaceutical company focused on the development and commercialization of novel medicines for patients affected by central nervous system, or CNS, disorders. The company operates in one segment, and has its principal office in Chesterbrook, Pennsylvania. Since commencing operations in 2007, the company has devoted substantially all of its financial resources and efforts to research and development, including nonclinical studies and clinical trials. The company is currently in its clinical stage and hence as of the second quarter ending June 2020, the company has not generated any revenues. In August 2020, the U.S. Food and Drug Administration (FDA) approved its new opioid agonist, called OLINVYK, for the management of acute pain in adults severe enough to require an intravenous opioid pain reliever and for whom alternative treatments are inadequate. OLINVYK is expected to be delivered in the fourth quarter ending December 2020. The company is fully funded through the end of 2021, including OLINVYK’s commercialization. Hence, the market expects the company’s revenue to grow by a whopping 706.5% in the next quarter and significantly in the current year. EPS is expected to grow at 55.6% in the current quarter and 22.2% in the current year. Also, the market expects the EPS to grow at a rate of 14.3% per annum over the next years. The stock has gained more than 608% since hitting its 52-week low earlier this year. TRVN’s POWR Ratings reflect this promising outlook. It has an overall rating of “Buy” with an “A” for Trade Grade and Peer Grade, and a “B” for Buy & Hold Grade. Among the 377 stocks in the Biotech industry, it’s ranked #43. Celldex Therapeutics, Inc. (CLDX) CLDX is developing targeted therapeutics to address devastating diseases for which available treatments are inadequate. The company’s pipeline consists of therapeutic antibodies, antibody-drug conjugates, immune system modulators and other protein-based therapeutics. CLDX experienced a dip in revenue for the second quarter ending June 2020, however, revenues increased 43% year-over-year to $3 million for the six months ending June 2020. The increase in revenue was primarily due to the $1.8 million milestone payment from Rockefeller University related to the company’s manufacturing and development services agreement. The market expects company’s revenue to grow at 6.4% in the current year and 1.3% next year. EPS is expected to grow 52% in the current quarter and 49% in the current year. Also, the market expects EPS to grow 14.5% next year. The stock has gained more than 1,000% since hitting its 52-week low in March. CLDX’s POWR Ratings reflect a promising outlook. It has an overall rating of “Strong Buy” with an “A” for Trade Grade and Peer Grade, and a “B” for Buy & Hold Grade. Among the 377 stocks in the Biotech industry, it’s ranked #36. Want More Great Investing Ideas? 7 Best ETFs for the NEXT Bull Market What is the Cure for Stock Market Volatility? Chart of the Day- See Christian Tharp’s Stocks Ready to Breakout AMGN shares were trading at $237.30 per share on Friday afternoon, down $2.79 (-1.16%). Year-to-date, AMGN has gained 0.47%, versus a 9.40% rise in the benchmark S&P 500 index during the same period."}]}