{"article": [{"url": "https://stocknews.com/news/amwl-tdoc-lvgo-goog-onem-should-you-buy-the-american-wellness-after-its-ipo/", "published": 1600344500.0, "headline": "Should You Buy American Well After its IPO?", "body": "The coronavirus has disrupted our way of life in a variety of ways. For some industries like hotels and restaurants, it’s caused a drastic reduction in sales. For others like housing and e-commerce, it’s led to an acceleration in sales. For healthcare, the coronavirus has resulted in a sharp decrease in the number of in-person patient visits, prescriptions, and operations. Doctors and patients want to minimize exposing already vulnerable people to the virus. Early outbreaks have been traced to hospitals and doctor’s offices, where infected people were spreading the disease to doctors, nurses, and other patients in waiting rooms and examination rooms. Of course, this was before protocols like social distancing and PPE were put into place. 7 Best ETFs for the NEXT Bull MarketOf course, the need for healthcare hasn’t evaporated. Not getting care can lead to even bigger problems in the long-term. Just like schools and offices have gone remote, people have been conducting doctor’s visits virtually. American Well’s Story American Well (AMWL) is one company that’s enabling this transition. It’s the second-leading telehealth company in the US. During the peak of the pandemic, it was facilitating 45,000 telehealth appointments per day. In contrast, it averaged 2,000 visits per day in 2019. In its last quarter, AMWL generated $68 million in revenue which was a 94% increase from the previous year. It also lost $87 million in the last quarter as the company focuses on growth rather than near-term profits. Its customers include 150 health systems, 55 health plans including Anthem (ANTM), and Blue Cross. Several companies have also contracted with AMWL to use its platform for its employees including Oracle (ORCL), Campbell (CPB), and Wellpath. On Thursday, the company went public. Its stock opened for trading at $25.50, which was above expectations of $18 per share. In total, the company raised $747 million and has a valuation of nearly $5 billion. Google (GOOG) invested $100 million in the company, and it retains a 3% stake, although it did cash out some at the IPO. As part of the investment, Amwell will use the Google Cloud platform. The company’s strong debut is a reflection of the robust demand for new issues and excitement about telehealth. Teladoc (TDOC), which is the leading telehealth company, has gained 137% YTD. Another competitor, 1Life Healthcare (ONEM) IPO’d in January and is up 100% since then. Growth in Healthcare Spending The major factor which makes AMWL attractive is the long-term, secular growth in healthcare spending, as the US population continues to get older. Additionally, healthcare inflation has averaged around 5.5% over the last 25 years, while average inflation has been around 2%. This is due to the demand for healthcare continually rising, while supply is fixed. It’s also leading to a shortage of doctors, especially with 1 in 3 doctors over the age of 50. In rural areas, the problem is much worse. Telehealth is one possible solution to this problem. Healthcare spending in the US was nearly $3 trillion in 2019 and is expected to reach $6 trillion by 2027. This means that there are going to be major opportunities for companies in the healthcare space. Telehealth is one of the most attractive since it allows for more efficiency and better health outcomes since patients can connect to doctors more frequently rather than waiting for a visit. Rise of Telehealth The coronavirus caused a huge spike in telehealth visits. According to McKinsey, 76% of people who used these services during the pandemic will use it going forward. The consulting firm believes that eventually up to $250 billion of healthcare spending could be virtualized. In addition to the pandemic, another catalyst for telehealth has been the loosening of regulations that made it difficult for patients to get care from doctors across state lines. Doctors also like telehealth, because they can see more patients. Many illnesses can be treated and diagnosed virtually. If necessary referrals can be given for an appointment with a local doctor or specialist for an in-person visit. For patients, they can get treated with greater convenience and at less cost. This type of innovation marrying technology and convenience is an important step in making healthcare more effective and efficient in terms of cost and health outcomes. High-Margin, High-Growth Business There’s a similarity between telehealth stocks and other industries which have seen the best performance over the past few months, like e-commerce, digital payments, and cloud computing. These were already areas with impressive secular growth, but the coronavirus resulted in an acceleration of adoptions. Even when things go back to normal, there will be some segment of customers who these companies retain. In essence, they pulled forward years of growth in a couple of quarters. In addition to high-growth, another similarity is that these companies are high-margin businesses. Once, the platform is built, there is no marginal cost to add new users. Further, AMWL will be able to find further monetization opportunities in terms of adding higher-value services for doctors, patients, insurers, and employers. TDOC bought Livongo Health (LVGO) as it wants to give patients and doctors the ability to monitor patients’ health metrics in real-time. Another commonality between some of these best-performing stocks and telehealth companies is high amounts of recurring revenue. Once users are comfortable on the platform, have their records stored on it, and have their appointments scheduled, they will be less likely to switch. This moat will grow deeper and wider as the longer they use it, the cost of changing platforms will increase. As a result, AMWL’s pricing power will also increase. What Could Go Wrong? AMWL certainly has a strong start and a bright future. However, it’s important to consider the bearish arguments. The major obstacle for AMWL is the competition because nearly everyone understands the massive opportunity in telehealth. There are several competitors in this space, but going public will be helpful for AMWL because it gives it resources to survive and expand. It does mean that the company won’t be profitable anytime soon. Another factor is valuation. It’s valued at $5 billion but is only generating just over $250 million in revenue. And that’s during a pandemic when many doctor’s offices were only open for virtual visits. Thus, a lot of good news is already baked into the stock. If the company fails to meet these high expectations, it will have a steep fall. Conclusion Although there are risks, AMWL is a buy. We are in a bull market, and stocks with revenue growth and expanding markets will outperform. In the last couple of years, the stock market has been remarkably forward-looking in terms of not punishing stocks for not being profitable and rewarding them for focusing on growth. This lines up well with AMWL’s strategy. Want More Great Investing Ideas? 7 Best ETFs for the NEXT Bull Market Is the Stock Market Correction Over? Chart of the Day- See the Stocks Ready to Breakout AMWL shares . Year-to-date, AMWL has declined 0.00%, versus a 5.42% rise in the benchmark S&P 500 index during the same period."}]}