{"article": [{"url": "https://stocknews.com/news/msft-microsoft-buy-sell-or-hold/", "published": 1598357300.0, "headline": "Microsoft: Buy, Sell, Or Hold?", "body": "It’s been a strong start to the year for the mega-cap tech space, and Microsoft (MSFT) has been no exception, up 36% year-to-date, and working on its seventh consecutive quarterly gain in a row. The significant outperformance vs. the S&P-500 (SPY) has been driven by Microsoft’s impressive earnings growth, and consistent double-digit revenue growth rates. This impressive growth is what’s allowed Microsoft to command one of the highest price to sales ratios among its peers, currently trading at close to 12x. While the stock is beginning to a little expensive here, history would suggest that the stock could get much more expensive if we’re in the latter stages of a long-term bull market where valuations tend to get very frothy. Therefore, while I wouldn’t be chasing the stock above $216.00, there could be additional upside here medium-term. 7 \"SAFE HAVEN\" Dividend Stocks for Turbulent Times (Source: TC2000.com) Microsoft released its fiscal Q4 2020 results last month and reported a blow-out quarter, with quarterly revenue up 13% year-over-year, driven by continued strength from Azure, and a surprise contribution from Xbox, where sales soared 65% year-over-year. This massive acceleration in a non-core business and continued dominant positions in cloud computing allowed the company to grow relatively in line with its already robust trailing-twelve-month revenue growth rate of 14%. Meanwhile, the significant repurchase of $5.1 billion in stock in Q2 alone should help to bolster annual earnings per share growth, as the share count continues to shrink. Let’s take a look at the company’s earnings trend below. As we can see from the chart below, Microsoft has seen a powerful earnings trend since FY2016, which marked an earnings breakout for the stock. Since that time, annual earnings per share [EPS] has grown rapidly, with a compound annual EPS growth rate of 19.8% over the four years. Amazingly, this trend in higher highs for annual EPS is not expected to slow, with FY2021 estimates sitting at $6.45, and FY2020 estimates sitting at $7.35. While a minor deceleration from the 21% growth reported in FY2020, these are still incredible growth rates for a company of Microsoft’s size. Assuming the company meets analyst estimates, annual EPS would grow by approximately 28% over the next two years ($7.35 vs. $5.76). Typically, the best-performing stocks in the market are small to large caps growing annual EPS by a minimum of 17% year-over-year, or mega caps growing at 10% or more consistently. Therefore, Microsoft fits in the latter category, and until this growth rate slows to a crawl in the single-digit range, there’s no reason to think the stock can’t go higher long-term. (Source: YCharts.com) (Source: YCharts.com, Author’s Chart) If we look at quarterly revenues, we’re seeing a similar trend, with new highs each year as Microsoft’s products remain a staple, while cloud grows at a rapid pace, with $50 billion in revenue for the segment in FY2020. As we can see above, fiscal Q4 revenues hit a new all-time high of $38 billion, and Q1 2021 estimates are sitting at $36.0 billion, which would translate to 9% growth year-over-year. While this is a minor deceleration from the trailing-twelve-month revenue growth rate, which is closer to 14%, I don’t see this as material. This is because the Q2 2021 estimates forecast 11% growth, so Microsoft should have no trouble maintaining its double-digit growth rate through FY2021. To maintain confidence in the above annual EPS estimates of $6.45 for FY2021, investors will want to see the company beat estimates in Q1 and Q2 2021 ($36.0 billion and $40.8 billion, respectively). (Source: YCharts.com) If we move over to Microsoft’s valuation, it’s easy to understand why some investors hesitant to get involved. As we can see, Microsoft’s price to sales ratio is at 20-year highs and continues to climb. However, if we take a zoomed-out view, we hit a price to sales ratio above 30 in the Tech Bubble in early 2000 and traded above 16x sales for over a year. While I am not attempting to justify the current valuation and suggest that it’s cheap, I am merely pointing out that things can get a lot more expensive than some investors think. Therefore, while paying above 11.5x sales for Microsoft might not be the best idea, staying along for the ride with a trailing stop is a low-risk way to play for a potential melt-up. Let’s see what the technical picture looks like: (Source: TC2000.com) If we look at the above chart, we can see that Microsoft is getting a little extended short-term, with the current range for the stock being $175.00 – $225.00. However, while the stock is extended in its channel, it’s not far above its 40-week moving average (pink line). Typically, this area has been a floor for the stock outside of cyclical bear markets, so I expect the $185.00 level to be a strong area of support. Given that we’re extended on a channel basis, but only 15% above the 40-week moving average, the best course of action here is to hold. However, if we were to see Microsoft move above $240.00 before year-end, I would consider this an area to be open to booking some profits. This is because moves outside of the upper channel typically lead to at least 13-17% corrections. (Source: TC2000.com) If we zoom in a little, we can see that the $185.00 support level also coincides with the previous breakout area, suggesting that this is a very low-risk spot to add shares. Currently, the stock is building a base just below its upper channel line, so new positions above $215.00 carry elevated risk. While Microsoft had a blow-out quarter and should continue to grow at above 10% sales through FY2021, I do not see it as a buy. This is because some of this is likely priced in with the stock hovering just below its upper channel line. Therefore, while Microsoft is a staple for a diversified portfolio given its respectable 1.0%~ dividend yield and steady annual EPS growth, I see the best trade here as holding the stock. Currently, I am not long the stock, as I favored the high-growth FAANG names like Netflix (NFLX) and Amazon (AMZN) at the mid-March lows. However, if we saw Microsoft drop below $190.00 before year-end, I would begin to build a position in the stock. Disclosure: I am long AMZN, NFLX, and short SPY Disclaimer: Taylor Dart is not a Registered Investment Advisor or Financial Planner. This writing is for informational purposes only. It does not constitute an offer to sell, a solicitation to buy, or a recommendation regarding any securities transaction. The information contained in this writing should not be construed as financial or investment advice on any subject matter. Taylor Dart expressly disclaims all liability in respect to actions taken based on any or all of the information on this writing. Want More Great Investing Ideas? The Best of StockNews 2 Step Process to Sell @ Market Top in September 9 “BUY THE DIP” Growth Stocks for 2020 MSFT shares were trading at $215.10 per share on Tuesday afternoon, up $1.41 (+0.66%). Year-to-date, MSFT has gained 37.48%, versus a 7.59% rise in the benchmark S&P 500 index during the same period."}]}