{"article": [{"url": "https://stocknews.com/news/kgc-gfi-btg-auy-hmy-5-gold-stocks-that-should-keep-glittering-in-2020/", "published": 1594296500.0, "headline": "5 Gold Stocks That Should Keep Glittering in 2020", "body": "Gold (GLD) tends to move higher during times of political and economic uncertainty. During the liquidation in March, gold fell 15%. It quickly rebounded to move past its pre-coronavirus highs and has been trending higher since then. Gold broke the resistance of $1,800 per ounce earlier this week, for the first time since 2011. There’s an abundance of reasons for gold’s strength. For one, the political climate has been tenuous due to the coronavirus, shutdowns, and riots in many major cities. Gold is a safe-haven asset that people gravitate towards in such circumstances. 7 \"SAFE HAVEN\" Dividend Stocks for Turbulent TimesThe economy has been weak and will remain weak which will require interest rates to stay low and multiple rounds of fiscal and monetary stimulus. Gold does well during periods of inflation or falling rates – either outcome is likely. The federal government is likely to have a $2 trillion deficit this year, and this seems unlikely to change in a meaningful way in the next couple of years. With gold doing well, companies that dig it out of the ground will also do well. Increases in the price of gold will flow to the bottom line and make their assets more valuable. Here are five gold mining stocks that should keep gaining from this astonishing gold price momentum: Kinross Gold Corporation(KGC) KGC is a gold mining company with operations in the US, Chile, Brazil, Mauritiana, Russia, and Ghana. With a market capitalization of over $9 billion, the company is one of the largest players in the gold mining market. In June, the company reached an agreement with the Government of Mauritiana and gained a 30-year license for gold mining in the Tasiast Sud. This move could significantly benefit the future of the company. KGC has delivered a YTD price return of 61.6%. Since the March low, it’s more than doubled. In the past week, it’s breaking out to a new, 52-week high. How does KGC stack up for the POWR Ratings? A for Trade Grade A for Buy & Hold Grade B for Industry Rank C for Peer Grade A for overall POWR Ratings KGC ranks #3 out of 30 stocks in the Miners – Gold industry Gold Fields Limited (GFI) Gold Fields is a gold and silver mining company that has operations in Australia, South Africa, Ghana, and Peru. GFI has delivered an impressive earnings report for the second quarter of the year. It witnessed profit margins of 5.4% and its return on assets was 2.6%. The company has recently signed a gas supply deal with Santos which will enable operations to continue smoothly. GFI has delivered a YTD price return of 58.5%. It’s been one of the stronger gold mining stocks with a 25% gain since it broke out of its sideways consolidation in June. GFI has an overall rating of Strong Buy in the POWR Ratings, along with an “A” for Trade Grade, Buy & Hold Grade, and Industry Rank. Out of 30 gold mining stocks, it’s ranked #4. B2Gold Corp. (BTG) B2Gold is a gold mining company that develops and mines properties in Nicaragua, Chile, Nambia, Burkina Faso, and the Philippines. While BTG missed its consensus ESP estimate in the quarter ended March 2020, it beat the estimates in two of the prior three quarters. BTG is one of the strongest stocks in the gold mining sector, since its low in March with a 195% gain. YTD, the stock is up 51.4%. BTG has an overall rating of Strong Buy in the POWR Ratings, along with an “A” for Trade Grade and Buy & Hold Grade. GFI is ranked as #5 in the StockNews.com Miners – Gold industry. Yamana Gold Inc. (AUY) AUY has operations in Mexico, Canada, Chile, Brazil, and Argentina. This week, it made a new 52-week high of $5.7. In the last quarter, it increased its dividend by 23.1% to $0.06 per share. AUY recently invested $4.2 million in Monarch Gold to increase its stake in the emerging corporation. YTD, the stock is 42.6% higher. Over the last 12 months, it earned $0.29 per share which gives it a very attractive price to earnings ratio. Its dividend is rare for a gold miner and signals that it’s a stable operator. AUY is rated a Strong BUY by its POWR Ratings. It also has an “A” for Trade Grade, Buy & Hold Grade, and Peer Grade with a “B” for Industry Rank. It’s currently ranked #6 out of 30 stocks in the Gold mining category. Harmony Gold Mining Company Limited (HMY) HMY has gold mining operations in Papua New Guinea and South Africa. The company recently announced that it has raised $200 million in a bid to acquire more assets in South Africa. This significant expansion in the operations of the company could bode well for the stock and boost earnings down the line. HMY was an underperformer for the first couple of months of this gold bull market. However, it’s caught up with an 80% gain over the last three weeks on strong volume. Overall, HMY is up 175% from its March lows and 59% YTD. Over the last 12 months, it lost $0.15 per share but forecasts earning $0.51 per share over the next 12 months which gives it an attractive forward price to earnings of 11.3. HMY has delivered a YTD price return of 59.8% along with positive price returns in the one-month, six-month, one-year, three-year, and five-year periods. HMY has an overall POWR Rating of Strong Buy along with an “A” for Trade Grade, Buy & Hold Grade, and Peer Grade with a “B” for Industry Rank. It’s ranked #8 out of 30 gold mining stocks. 9 “BUY THE DIP” Growth Stocks for 2020 Is the Bull S#*t Rally FINALLY Over? 7 “Safe-Haven” Dividend Stocks for Turbulent Times Top 3 Investing Strategies for 2020 KGC shares rose $0.02 (+0.26%) in after-hours trading Thursday. Year-to-date, KGC has gained 61.81%, versus a -1.40% rise in the benchmark S&P 500 index during the same period."}]}