{"article": [{"url": "https://stocknews.com/news/aig-chart-of-the-day-a-rectangle-pattern-in-american-international/", "published": 1597925300.0, "headline": "Chart of the Day: A Rectangle Pattern in American International Group (AIG)", "body": "A rectangle pattern has emerged in the chart of American International Group (AIG), which means that traders should be ready for the stock to breakout or breakdown soon. AIG is one of the largest insurances and financial services firms in the world. It operates through a wide range of subsidiaries that provide property, casualty, and life insurance. The company remains exposed to weather-related accidents and its revenue will be under pressure as long as the pandemic lasts. The company will benefit from cost-cutting initiatives. Take a look at the 1-year chart of AIG below with added notations: 7 \"SAFE HAVEN\" Dividend Stocks for Turbulent Times Chart of AIG provided by TradingView Back in the spring, AIG had formed a clear level of resistance in the $28 area (green), which then turned into a support level once the stock had broken above it. More recently, the stock has formed a new level of resistance at $33 (red). At some point, AIG will approach either of those two levels again. A trader could enter a long position on a break above $33, with a stop placed under the level of entry. And a short trade could be made on a break below the $28 mark. Want to Discover More Great Trades? I have explored virtually every flavor of technical analysis and chart pattern known to mankind. The sad fact is that the vast majority of them don’t work at all. That is why I recently put together this presentation to help investors focus on the only 5 chart patterns that matter…the ones that lead to the most timely and profitable stock trades. Click below to learn these patterns and how to quickly find the 5 to 7 best trades today. 5 WINNING Stock Chart Patterns Have a good trading day! Good luck! Christian Tharp, CMT @cmtstockcoach AIG shares were trading at $29.31 per share on Thursday morning, down $0.55 (-1.84%). Year-to-date, AIG has declined -41.59%, versus a 5.63% rise in the benchmark S&P 500 index during the same period."}]}