{"article": [{"url": "https://stocknews.com/news/nvda-intc-sq-ostk-4-blockchain-stocks-to-own-for-the-next-5-years/", "published": 1599221300.0, "headline": "4 Blockchain Stocks to Own for the Next 5 Years", "body": "When it comes to the blockchain, most investors assume the technology is tied to cryptocurrencies such as Bitcoin and shift their attention to something more traditional. However, some of the world’s top companies are investing in blockchain. Even if you own Bitcoin and other cryptocurrencies, you owe it to yourself to consider the merits of companies making use of blockchain. Blockchain may prove fundamental to currency and the transfer of money in the years ahead. Without further ado, let’s take a look at the most intriguing blockchain stocks at the moment: NVIDIA Corporation (NVDA), Intel Corporation (INTC), Square (SQ), and Overstock.com (OSTK). 7 Best ETFs for the NEXT Bull MarketNVIDIA Corporation (NVDA) When it comes to graphics processing, few companies compare to NVDA. NVDA’s specialties are graphics processing units, communications/media processors, and electronics used by consumers worldwide. NVDA is expanding its scope to include the blockchain. Plenty of cryptocurrency miners rely on NVDA products to mine Bitcoin. As an example, NVDA has a blockchain platform that is AI-based. This platform makes it easier for healthcare companies to facilitate the analysis of complicated three-dimensional models. If you are looking for a POWR Ratings stud, look no further than NVDA. The stock has A grades in each POWR Component. NVDA is ranked second of 86 stocks in the Semiconductor & Wireless Chip industry. Out of 29 analysts who have analyzed NVDA, 24 rate it as a Buy, four rate it as a Hold, and only one advises selling. Add in the fact that NVDA is a key cog in the seemingly unstoppable gaming industry, and you have an attractive stock. Intel Corporation (INTC) As the world’s top supplier of semiconductors, chipsets, and microprocessors, INTC is more than worthy of close analysis from every investor despite its recent decline. INTC is broadening its horizons, expanding to AI, autonomous driving, and the blockchain. INTC has the potential to shape the development of blockchain technology. The company devotes an entire page of its website to its work on the blockchain. INTC strives to enhance the blockchain through technological innovation. INTC is particularly intriguing as it recently dipped way down to $47 after trading more than $60. TipRanks, which provides an average of analysts estimates, shows analysts have set a price target of $56.58 for INTC. Square (SQ) Businesses of all types are looking for new and innovative ways to sell their value offering. SQ makes it easy for companies to sell products and services on the web. Furthermore, SQ facilitates money transfers between everyday people. SQ recently won a patent for quite the unique fiat-crypto payment network. The company also has a Bitcoin auto-payment function to boot, making it easy for users to purchase Bitcoin through Cash App automatically. SQ is poised to be a blockchain leader as we rapidly transition to a future in which digital currency will become the norm. Overstock.com (OSTK) It is particularly interesting that OSTK has ventured into blockchain technology. After all, most people know OSTK as a web-based closeout e-merchant that provides merchandise ranging from kitchenware to electronics and apparel. OSTK is determined to be a blockchain ecosystem pioneer. It was one of the first e-tailers to accept Bitcoin as a form of payment. Furthermore, OSTK even keeps half of Bitcoin payments in-house as an investment. OSTK has gone as far as starting a venture capital firm known as Medici Ventures to provide seed money for blockchain startups. OSTK’s top crypto subsidiary is tZERO, a group that strives to eliminate brokers and directly compete with the leading stock exchanges. OSTK has an average analyst price target of $121.50, which is nearly 50% higher than its current price. Want More Great Investing Ideas? 7 Best ETFs for the NEXT Bull Market Beware Stocks in September? 9 “BUY THE DIP” Growth Stocks for 2020 NVDA shares were trading at $497.24 per share on Friday morning, down $23.38 (-4.49%). Year-to-date, NVDA has gained 111.61%, versus a 7.95% rise in the benchmark S&P 500 index during the same period."}]}