{"article": [{"url": "https://stocknews.com/news/tgtx-tril-meso-3-biotech-stocks-with-strong-momentum/", "published": 1600258100.0, "headline": "3 Biotech Stocks with STRONG Momentum", "body": "Cancer has remained one of the biggest challenges for the medical industry in the past 40 years, with no definitive cure to date. Though cancer in its earlier stages is often treatable, the fear of remission remains. Aside from affecting the quality of life, cancer treatments are immensely expensive. According to Zion Market research, the cost of cancer care has increased by 27% in the last decade. The pandemic is leading to even more stress and poor lifestyle choice. Down the road, it could lead to a spike in cancer cases. The direct medical cost of cancer is estimated to be approximately $58 billion in 2020 and will rise at double-digit rates over the next decade according to the National Institutes of Health. However, many pharmaceutical companies have reported progress in developing effective treatments for various types of cancer. Companies such as TG Therapeutics, Inc. (TGTX), Mesoblast Ltd. (MESO), and Trillium Therapeutics, Inc. (TRIL) have reported substantial progress in developing effective treatments. These drugs are awaiting approval, but their stocks have soared substantially year-to-date and could gain further. 7 \"SAFE HAVEN\" Dividend Stocks for Turbulent TimesTG Therapeutics, Inc. (TGTX) TGTX is a biopharmaceutical company engaged in the research, development, and commercialization of cancer treatment drugs and autoimmune disease medication. TGTX has gained more than 125% year-to-date. The stock hit its 52-week high of $27.62 on September 2nd. In the past couple of weeks, TGTX successfully rolled out an effective FDA-approved Umbralisib drug for treating different types of lymphoma. It also made significant progress in the development of drugs catering to leukemia. The breakthrough advancement in the field of cancer and lymphoma has allowed the company to garner the attention of the global medical industry. TGTX expects to roll out its new drugs for commercial use in the market by the second half of 2020, as well as complete phase three trials and receive FDA approval on two of its drugs currently under development. How does TGTX stack up for the POWR Ratings? A for Trade Grade B for Buy & Hold Grade A for Peer Grade B for Overall POWR Rating. It is also ranked #26 out of 373 stocks in the Biotech industry. Mesoblast Ltd. (MESO) MESO develops and supplies regenerative allogeneic cellular medicines. Its proprietary regenerative technology is based on mesenchymal lineage adult stem cells, which targets advanced stages of critical ailments. On September 15th, MESO was awarded the Fierce Biotech Innovation of the Year award for remestemcel-L. It received ethics approval and recommendation of the Data Safety Monitoring Board (DSMB) to conduct phase three randomized clinical trials for remestemcel-L in treating critical COVID patients. MESO’s breakthrough in this drug drove its earnings for the fourth quarter and fiscal year ended June 2020. It reported a 92% year-over-year increase in net revenue to $32.20 million for fiscal 2020. Milestone revenues increased 127% from the year-ago value to $25 million, while commercialization revenue from sales rose 32% from the same period last year to $6.60 million. MESO’s cash and cash equivalents balance improved 156.5% year-over-year to $129.33 million for fiscal 2020. MESO’s EPS is expected to grow at 48.8% per annum over the next five years. Its revenue grew at 45.3% in the trailing twelve months, making it better than 89.1% of the U.S. stocks in the StockNews.com universe. MESO has returned over 140% to its investors year-to-date. The stock has gained more than 580% to hit its 52-week high in August since hitting its 52-week low of $3.12 in March. Under our POWR Ratings, the company has been accorded a “B” rating in Peer Grade and Industry Rank. In the 232-stock Medical – Pharmaceuticals industry, MESO is ranked #52. Trillium Therapeutics, Inc. (TRIL) TRIL, a clinical-stage immuno-oncology company, engages in developing therapies for the treatment of cancer. TRIL’s growth momentum for this year is impressive, as it gained 1324.3% year-to-date. The stock hit its 52-week high of $15.36 on September 14th. TRIL sold 2.30 million shares to Pfizer Inc. (PFE) in exchange for $25 million. The net proceeds from this deal are expected to fund the ongoing clinical trials, working capital requirements, as well as general corporate expenses. TRIL also announced a public offering of 1.50 million shares worth $130 million on September 10th. TRIL is rated a “Strong Buy” in our POWR Ratings system, consistent with its sound business model and solid growth momentum. It also has an “A” in Trade Grade, Buy & Hold Grade and Peer Grade, and “B” in Industry Rank. The stock is ranked #18 out of 232 stocks in the Medical- Pharmaceuticals industry. Want More Great Investing Ideas? 7 Best ETFs for the NEXT Bull Market Is the Stock Market Correction Over? Chart of the Day- See the Stocks Ready to Breakout TGTX shares were trading at $24.84 per share on Wednesday afternoon, down $0.39 (-1.55%). Year-to-date, TGTX has gained 123.78%, versus a 6.35% rise in the benchmark S&P 500 index during the same period."}]}