{"article": [{"url": "https://stocknews.com/news/exk-ag-mag-paas-fsm-5-silver-miners-exploding-to-new-highs/", "published": 1595506100.0, "headline": "5 Silver Miners EXPLODING to New Highs", "body": "Over the past week, silver miners have been breaking out to new, 52-week highs on strong volume. (source: stockcharts.com) 7 Best ETFs for the NEXT Bull MarketThe sector has been displaying impressive relative strength since the March lows when silver miners were a victim of the market’s liquidation. However, since the market started moving higher, they have been one of the strongest sectors due to falling interest rates and aggressive monetary and fiscal stimulus. Due to the increased spread of the coronavirus around the world, especially in the US, it is assumed that the recovery is going to take longer which increases the odds of more stimulus. Besides this development, some other catalysts include the EU agreeing on a fiscal compact and the dollar trending lower. These factors have led silver (SLV) and silver miners to gain more than 25% so far this month. The Global X Silver Miners ETF (SIL) made a new, 52-week high yesterday. Gold (GLD) is also rallying and closing in on its all-time high of $1,920. Gold breaking out to all-time highs would lead to even more money flowing into the precious metals and mining sector. (source: stockcharts.com) As the chart above shows, when gold decisively broke its all-time non-inflation adjusted high in November 2009, it went on to gain 80% over the next 18 months. During this same period, silver climbed from $18 to $46 for a 175% gain. At about $23, silver remains 50% below its 2011 highs of about $46. So, there is considerable upside potential. Silver miners are leveraged to the price of silver, so they will experience even bigger gains during bull markets. Given the silver miners’ recent rally, some sort of pullback is certainly possible. However, investors should look to accumulate silver miners on pullbacks given the sector’s favorable fundamentals and longer-term upside. Here are five silver miners to keep on your radar: Endeavour Silver Corp. (EXK) EXK is a silver miner operating in Mexico. It’s one of the smaller companies in the sector with a $500 million market cap. About 60% of its revenues come from silver with the other 40% from gold. Historically, it’s been a laggard to other stocks in the sector, since it has a high cost of production – around $22 per ounce. However, this makes it one of the biggest gainers, in terms of share price, as the recent rally in silver gives it the biggest boost in earnings in relative terms. EXK’s POWR Ratings are consistent with this strength as it has a Strong Buy rating with an “A” for Trade Grade, Buy & Hold Grade, Industry Rank, and a “B” for Peer Grade. First Majestic Silver Corp. (AG) AG is up 36% in July and 220% since its March lows. In its last quarter, AG produced 3.5 million equivalent silver ounces. AG also temporarily stopped production due to the coronavirus but operations have already resumed. Over the last few years, it’s consistently increased production, and it’s been bringing down costs. In the last quarter, its net cost of production was $12.62 per ounce. AG’s POWR Ratings are also very strong, as it has a Strong Buy rating. It has an “A” for Trade Grade, Buy & Hold Grade, and Industry Rank. Among silver miners, it’s ranked #4 out of 11. Fortuna Silver Mines (FSM) FSM’s stock price has been strong despite production disruptions due to COVID-19, as investors are looking at the impact of higher silver prices on future profitability and the increase in the value of its holdings. FSM’s all-in costs for silver is just under $11 per ounce. Under normal circumstances, FSM expects to produce 2 million ounces of silver per quarter. Currently, the company expects production to return to these levels sometime in the third quarter. FSM is up 30% in July, and 320% since its March-lows, so investors seem to have discounted these issues and are focused on the future. The POWR Ratings are also very bullish on FSM as it has a Strong Buy rating with an “A” across all POWR components. It’s ranked #8 out of 11 silver mining stocks. MAG Silver Corp. (MAG) MAG is another miner that will thrive during a silver bull market. In the last 12 months, it’s been transitioning from explorer to producer. It’s going to begin producing in Q3 and by the middle of 2021 expects to be running at full-scale. Many companies stumble going from developing projects to actual mining but so far MAG seems to be proceeding on schedule. The company has a strong balance sheet with $132 million which ensures that it’s going to be able to keep investing money into exploration to find new projects. Despite MAG quadrupling from the lows, it remains 35% below analysts’ average price target of $22.4. Based on the company’s projections, it will produce silver at a cost between $6 and $9 per ounce. The POWR Ratings confirms this bullish picture for MAG as it has a Strong Buy rating. It has an “A” for Trade Grade, Buy & Hold Grade, and Peer Grade with a “B” for Industry Rank. Among silver miners, it’s ranked #5 out of 11. Pan American Silver Corp. (PAAS) While all the silver miners have been strong, PAAS has been an outperformer. It’s up 230% since its March lows and 18% in July, but what’s intriguing about the stock is that it’s closing in on its all-time high from May 2011, when silver was around $50 per ounce. Most silver miners are closer to 50% below these levels. This relative strength is due to PAAS’ success in ramping up production over the last decade. Recently, production has been disrupted due to the coronavirus, but in 2021, PAAS expects to produce 25 million ounces of silver at $10 per ounce. It also has several mines that are producing so a disruption in anyone is less of a problem than it would be for other miners that don’t have these diversified operations. PAAS’ POWR Ratings are consistent with this picture, as it has a Strong Buy rating. It’s the #2 ranked silver miner, and it has an “A” for Trade Grade, Buy & Hold Grade, and Industry Rank. Want More Great Investing Ideas? 9 “BUY THE DIP” Growth Stocks for 2020 Newly REVISED 2020 Stock Market Outlook 7 “Safe-Haven” Dividend Stocks for Turbulent Times EXK shares were trading at $4.05 per share on Thursday afternoon, down $0.13 (-3.11%). Year-to-date, EXK has gained 68.05%, versus a 1.20% rise in the benchmark S&P 500 index during the same period."}]}