{"article": [{"url": "https://stocknews.com/news/aapl-regn-mas-lrcx-tsm-4-top-stocks-youll-regret-not-buying-now/", "published": 1597320500.0, "headline": "4 Top Stocks You'll Regret Not Buying NOW", "body": "One of the best ways to measure corporate performance is through return on invested capital (ROIC), also referred to as return on capital. ROIC is used to assess a company’s efficiency at allocating capital to profitability. In other words, it measures how much profit a company can generate for every dollar invested in the company. The higher the figure, the more profit a company makes. ROIC is calculated by dividing net operating profit after taxes by invested capital. Investors can use ROIC to evaluate how attractive an industry is, or compare companies within an industry. Efficiency tells us how competitive the company is in its industry. For instance, if a company has a high ROIC, it most likely has an economic moat. An economic moat refers to a business’ ability to sustain its competitive advantage. That means a company sells products that are not only liked by consumers but also in high demand. ROIC can also be used to evaluate corporate management. If a company has a high ROIC, it means management is doing an excellent job at allocating capital. A company is creating value as long as it’s ROIC is higher than 2%. The 2% is the bare minimum, though. Levels above 10% are considered good, and over 15% reflect a company with a sustainable advantage. To find very strong companies, I limited my selection to stocks with an ROIC of over 20%. Here are four companies that fit the bill: Apple (AAPL), Regeneron Pharmaceuticals (REGN), Masco (MAS), and Lam Research (LRCX). 7 Best ETFs for the NEXT Bull MarketApple (AAPL) AAPL designs a wide variety of consumer electronic devices, but the iPhone makes up most of the company’s total revenue. The company’s portfolio also includes the App Store, Apple Music, AppleCare, Apple Pay, and wearable devices such as the Apple Watch and AirPods. AAPl currently has an ROIC of 29.4%. Its ROIC has, for the most part, stayed above 20% for the last 30 years. The company, which reported earnings last month, showed continued momentum in the services segment. This was driven by strong performance in the App Store, Apple Music, and video and cloud services. AAPL has more than 550 million paid subscribers across all of its services products. The iPhone also recovered due to strong demand for the iPhone SE in May and June. The company’s wearable segment is expected to drive revenues through the end of 2020. On Monday, the company announced a 4-for-1 stock split, which will take effect on August 31. This will be Apple’s fifth stock split since the company went public. The company is rated a Strong Buy in our POWR Ratings system. It holds the distinction of holding five aces. In other words, the stock has a grade of A in all five POWR Ratings metrics. It is also the #1 stock in the Technology – Hardware industry. Regeneron Pharmaceuticals (REGN) REGN discovers, develops, and commercializes products that fight eye disease, cardiovascular disease, cancer, and inflammation. The company has six marketed products including, Eylea, which is approved for wet age-related macular degeneration and other eye diseases. Its other products include Praluent to lower LDL cholesterol, Zaltrap for colorectal cancer, Dupixent foratopic dermatitis, asthma, and nasal polyposis, Libtayo for cutaneous squamous cell carcinoma, Arcalyst for CAPS, and Kevzara to treat rheumatoid arthritis. REGN currently has an ROIC of 25.4% REGN stock is up over 50% year-to-date as it is one of the biotech companies working on drugs and vaccines for the coronavirus. The company has an agreement with the U.S. Department of Health and Human Services (HHS) to develop new treatments to combat the coronavirus. The other primary growth driver for the company is Eylea. The drug is approved in the United States, EU, Japan, and more countries to treat neovascular age-related macular degeneration, diabetic macular edema (DME), and macular edema. Due to aging trends in the U.S., this drug should continue to drive revenue for REGN. The company is also working on expanding the drug’s label for other conditions. The company reported earnings last week with an EPS of $7.16 and revenue of $1.95 billion. These were both positive surprises over analyst estimates of $5.59 and $1.74 billion. REGN is rated a Buy in our POWR Ratings. For the components that make up the POWR Ratings, REGN holds a grade of A in Trade Grade and Peer Grade, and a B in Buy & Hold Grade and Industry Rank. It is the #1 ranked stock in the Biotech industry. Masco (MAS) MAS is a global leader in home improvement and building products. The company’s $4 billion plumbing unit, led by the Delta and Hansgrohe brands, sells faucets, showerheads, and other plumbing components. It’s $2.7 billion decorative architectural segment mainly sells paints and other coatings under the Behr and Kilz brands. MAS currently has an ROIC of 52.7%. The company is one of the dominant players in the faucets market, and its Behr brand is the number one brand in the DIY market for architectural coatings. The company reported impressive numbers for its second quarter. Its results were driven by strong growth in Decorative Architectural Products and better-than-expected performance in North American Plumbing. MAS also saw strong paint sales growth during the quarter. The company forecasts a strong demand for its products in the third quarter. The company has a long-term growth catalyst in the purchase of homes by Millennials and Generation Y. Their paints and plumbing products will come in handy for new home buyers, not to mention that the company has very few competitors. The stock, which is up 21% year to date, is rated a Strong Buy in our POWR Ratings system. Like AAPL, MAS holds straight As in every POWR score. The company is also the #4 ranked stock in the Home Improvement & Goods industry. Lam Research (LRCX) LRCX manufactures equipment used to fabricate semiconductors. The company is focused on the etch, deposition, and clean markets, which are vital steps in the semiconductor manufacturing process. The company’s flagship Kiyo, Vector, and Sabre products are sold in all major geographic areas to customers such as Samsung Electronics and Taiwan Semiconductor Manufacturing (TSM). The company has a current ROIC of 23.1%. LRCX is poised to benefit from increased demand in memory. Memory has become a focal point for cloud computing, mobile devices, big data, and even the IoT. The amount of data being used for these services has increased exponentially, so there is a huge demand for storage, which creates the need for chips. Also, LRCX will benefit from technological advancements in the semiconductor manufacturing process. The company has invested in R & D to stay on top of new advances, helping the company stay ahead of the competition. The future looks bright for LRCX, as it is only one of a few large companies that produce semiconductor manufacturing equipment. The stock is rated a Strong Buy in our POWR Ratings service. It holds As across the board and is the #7 ranked stock in the Semiconductor & Wireless Chip industry. Want More Great Investing Ideas? 3 Possible Directions for the Stock Market from Here How to Trade THIS Stock Bubble? 9 “BUY THE DIP” Growth Stocks for 2020 AAPL shares fell $2.14 (-0.47%) in after-hours trading Thursday. Year-to-date, AAPL has gained 57.74%, versus a 5.73% rise in the benchmark S&P 500 index during the same period."}]}