{"article": [{"url": "https://stocknews.com/news/nem-kl-gold-buy-the-dip-on-these-3-gold-miners/", "published": 1594901300.0, "headline": "\"Buy the Dip\" on These 3 Gold Miners", "body": "We’ve seen an exceptional first half from the Gold Miners Index (GDX) as the group is the 3rd best performing sector year-to-date, with an outstanding 32% return. The solid performance has come on the back of rising gold (GLD) prices and lower fuel prices, which has contributed to significant margin expansion for most miners. While most have shied away from the group given the COVID-19 shutdowns that have disrupted production, it’s worth noting that this 5% drop in production on average for the sector has more than offset by a 20% higher gold price since last year’s average gold price of $1,455/oz. However, while the group has done well, the key is to select the best names in the group, as there are quite a few duds in every sector. In this article, we’ll examine the lowest-risk producers with the most impressive earnings growth rates to see where investors can still find value even after this rally. 7 Best ETFs for the NEXT Bull MarketWhen investing in the gold sector, the two things I watch the closest are jurisdiction and margins. This is because I want the gold producers I select to not only have high margins but also be in jurisdictions that won’t nationalize mines or raise taxes if the going gets tough. There are several high-margin producers with promising projects in Greece, Turkey, and Tanzania, but there are zero benefits from a high-margin project if the gold isn’t coming out of the ground or it’s being taxed to death. The three names that meet these two requirements and also are seeing positive earnings revisions are Barrick Gold (GOLD), Newmont Corporation (NEM), and Kirkland Lake Gold (KL), with the latter being my most significant position. Let’s take a closer look at the three below: (Source: YCharts.com, Author’s Chart) Newmont Corporation is a name that many investors might be familiar with as it’s the only gold miner in the S&P-500 (SPY). The company produced over 1.5 million ounces in Q1 but will likely see significant headwinds in Q2 production due to its Canadian and Mexican operations being offline temporarily. Despite this, the company is expected to report earnings growth of 70% in FY-2020, based on estimates of $2.24 in annual EPS. The catalyst for this massive growth in earnings is significant margin improvement over the past year, and significantly higher gold and silver (SLV), with Newmont Corporation having the highest exposure to silver among the 1-million ounce plus producers. This is incredible growth, but we should see further robust earnings growth to come in FY-2021, with annual EPS estimates sitting at $3.23. Assuming the company can hit these forecasts, this would translate to a 44% growth rate year-over-year after lapping a year of 70% growth or a 2-year stacked growth rate of over 110%. Therefore, while investors looking at the stock at $61.00 per share may think it looks expensive at a trailing P/E ratio of over 45, it’s worth noting that Newmont is trading at just 18.8x FY-2021 earnings, a dirt-cheap valuation for a high-octane earnings grower. Based on Newmont’s industry-leading dividend of 1.6%, safe jurisdictions, and significant earnings growth, I believe any 7% pullbacks towards $56.00 should provide buying opportunities. (Source: YCharts.com, Author’s Chart) Moving over to the next company, Barrick Gold, the company is one of the largest gold producers in the sector, with a diverse portfolio spread across Africa, the USA, and the Americas. While Barrick doesn’t have as impressive of a yield as Newmont or as attractive of jurisdictions, the company makes up for this in margins, with higher margins of 35% last quarter, a 1000 basis improvement over Q1 2019 margins. Meanwhile, the earnings trend could not look better, with the stock set to post an earnings breakout year in FY-2020. As we can see above, Barrick has seen annual EPS bounce around in a range between $0.30 and $0.75 for five years, but we’re likely to see a breakout from this range in FY-2020. This is because earnings estimates are sitting at $0.84, and are trending higher the past few weeks. Generally, earnings breakouts are very bullish developments, and the share price usually follows, suggesting that a move above $30.00 for Barrick by year-end would not be out of the question. Therefore, if investors can buy the stock below $25.75, this would provide a low-risk entry. (Source: YCharts.com, Author’s Chart) Last but not least, we have Kirkland Lake Gold, a smaller producer, but a leader compared to the two in margins and jurisdictions. Kirkland Lake Gold’s primary operations are located in Canada, and Australia, two of the world’s top 5 ranked mining jurisdictions. Meanwhile, the company’s margins are exceptional, with costs expected to be below $775/oz this year. At a current gold price above $1,775/oz, this would translate to gross margins above 55% this year, dwarfing the average gross margins in the sector, which are closer to 35%. Kirkland Lake Gold continues to be out of favor in the sector after limited updates surrounding its bonanza-grade Fosterville Mine in Australia, as the market seems to believe that it might only have a few years of production left. While this is certainly possible in a worst-case scenario, the valuation has more than priced this in. As we can see from the chart above, Kirkland Lake Gold is expected to see annual EPS of $3.04 in FY-2020, and $3.83 in FY-2021. Based on the current share price of $45.00 and more than $2.00 in cash, the company is currently trading at only 11.2x FY-2021 earnings, and also pays a 1% dividend. If we use FY-2020 estimates, the stock is trading at less than 14.5x earnings, and the stock is the only one in the peer group that is debt-free; therefore, this valuation doesn’t include the cash balance. This is a massive undervaluation compared to other senior gold producers, as the below chart shows. (Source: YCharts.com) As we can see above, the average forward P/E ratio of the three senior producers in Tier-1 jurisdictions is above 33, which is more than double KL’s current valuation. It’s worth noting that these names deserve a premium to KL as they are larger producers, with GOLD producing over 5 million ounces, NEM over 6 million ounces, and AEM over 2 million ounces. However, even as a 1.6 million-ounce producer, KL remains quite undervalued against this peer group. Therefore, I believe that the stock is significantly undervalued if there are no issues at Fosterville and close to fairly valued if there are. Based on this, I continue to see KL as a strong buy below $43.00 per share, and I plan to add to my position on any sharp corrections. Not all miners are created equal, and the key is to own the best at the right prices, not search for the lowest-priced names in the GDX that are cheap for a reason. When it comes to quality, it’s hard to find a better group than KL, GOLD, and NEM, and the three have an average dividend yield of over 1% to sweeten the strong earnings growth they offer. For investors interested in hedging outside of the major market averages, I believe these three continue to be attractive on any sharp corrections, especially if gold can hit new all-time highs in the next 12 months. Disclosure: I am long GLD, KL Disclaimer: Taylor Dart is not a Registered Investment Advisor or Financial Planner. This writing is for informational purposes only. It does not constitute an offer to sell, a solicitation to buy, or a recommendation regarding any securities transaction. The information contained in this writing should not be construed as financial or investment advice on any subject matter. Taylor Dart expressly disclaims all liability in respect to actions taken based on any or all of the information on this writing. Want More Great Investing Ideas? 9 “BUY THE DIP” Growth Stocks for 2020 Top 5 WINNING Stock Chart Patterns 7 “Safe-Haven” Dividend Stocks for Turbulent Times NEM shares were trading at $61.61 per share on Thursday afternoon, down $0.53 (-0.85%). Year-to-date, NEM has gained 42.81%, versus a 0.39% rise in the benchmark S&P 500 index during the same period."}]}