{"article": [{"url": "https://stocknews.com/news/qcom-if-qualcomm-trades-under-this-level-expect-a-decisive-move/", "published": 1600690100.0, "headline": "If Qualcomm Trades Under This Level, Expect a Decisive Move Lower", "body": "A bearish head and shoulders pattern has developed in the chart of Qualcomm (QCOM). If the neckline of this pattern is crossed, I expect QCOM to have a breakdown. QCOM develops and licenses wireless technology and designs chips for smartphones. It is one of the largest manufacturers of wireless chipset based on baseband technology. Due to the 5G rollout, the company is benefiting from investments made towards building a mobile licensing program. Take a look at the 1-year chart of QCOM below with added notations: 9 \"BUY THE DIP\" Growth Stocks For 2020 Chart of QCOM provided by TradingView Over the past two months, QCOM has created a major level of support at $110 (green). That line is also the “neckline” for the stock’s head and shoulders (H&S) reversal pattern. Above the neckline you can see the H&S pattern (red) has been completed. Confirmation of the head and shoulders pattern would occur if QCOM were to break the neckline. Therefore a trader could enter a short on a break below $110 with the expectation of seeing the stock continue lower. Want to See My Favorite Stock Trades Today? The process I use to select these “Chart of the Day” stocks is just the starting point for what I put in my private portfolio. There I take a deeper dive into the stock market outlook. And determine which sectors are likely to outperform. Then and only then to do I pull the trigger on the most timely trades. If you would like to be notified of my best trades, then just click on the link below to get started! See Christian Tharp’s Top Stock Picks Now Have a good trading day! Christian Tharp, CMT @cmtstockcoach QCOM shares were trading at $108.79 per share on Monday morning, down $1.90 (-1.72%). Year-to-date, QCOM has gained 25.92%, versus a 1.82% rise in the benchmark S&P 500 index during the same period."}]}