{"article": [{"url": "https://stocknews.com/news/jnj-expd-pool-jpm-usb-axp-v-ma-wfc-bp-ba-f-msft-aapl-amzn-mpw-well-vtr-o-these-31-dividends-are-on-the-move-higher/", "published": 1596715700.0, "headline": "These 31 Dividends Are On the Move — Higher!", "body": "These 31 dividends are more than just safe. They are likely going up between now and October! Recently, S&P Dow Jones Indices’ Howard Silverblatt put a hard number on 2020’s tough dividend decay, writing that second-quarter payouts were whittled down by $42.5 billion during the second quarter. The worst might now be over. Here’s a key excerpt from Silverblatt’s latest note about the month of July (emphasis mine): “There were significantly fewer dividend actions, as 15 issues increased their dividend rates, one issue initiated dividends, two decreased them (including Wells Fargo’s USD 6.8 billion cut, the second-largest in index history), and one suspended them. … At this point, the significant damage appears to be done, with fewer and lower increases expected through 2020.” 7 Best ETFs for the NEXT Bull MarketWith most dividends clocking in under 2% today, the prospect of “fewer and lower increases” is troubling. A sub-$20,000 income stream on a million-dollar portfolio is lame enough. Now, add to it the rising threat of inflation, and we must find meaningful payout growth. Fortunately, over the next two months, there are 31 companies still on track to raise their payouts. They haven’t said so yet, but by the time they do, their stock prices will probably be higher! We’ll get to tomorrow’s dividend news in a moment. First, let’s consider a few of the names that kept the pedal on their dividends during the worst of COVID. Johnson & Johnson (JNJ) has been consistently raising its payout for nearly six decades without a break. It rarely offers a high current yield because investors know they have to “pay up” for the right to own JNJ. They never have to worry about whether next quarter’s check will come. You Can Set Your Watch By J&J’s Dividend Expeditors International of Washington (EXPD), a lesser-known Aristocrat, announced its 26th year of consecutive payout improvements in May. Shares have since recovered all of their bear-market losses and then some as it continues an eight-year uptrend roughly in line with its dividend growth. Wall Street Is Increasingly Getting Wise to EXPD’s Worth Pool Corp. (POOL) might have been down this year, but it certainly wasn’t out. It announced a 5.5% upgrade to its dividend in late April, and has shot 58% higher ever since. It might need to cool down in the short-term, but investors obviously have been rewarding the company’s more aggressive dividend growth in recent years. Everybody Is Jumping Into POOL Now, let’s get into our upcoming 31 hikes. We like to look for meaningful raises, which I define as high-single-digits or better, because we’re looking for double-digit returns from our dividend growers. And most don’t pay much at the moment, so we need these payouts to move higher every year to meet our return goals. Let’s split them up into four groups of dividend growers: Bank stocks (many of which are dirt-cheap right now), Blue-chip stocks (which are usually pricey thanks to their popularity), Frequent dividend raisers (including aristocrats that are less well known (and hence, cheaper), and finally Off-the-radar plays. The Banks Many bank stocks today trade for less than book value, which makes them sound like bargains at first blush. They still might be. In fact, my “#1 Income Investment” right now is a bank. But low price-to-book ratios telegraph a lot of uncertainty and doubt about their ability to generate profits going forward. Plus, the Fed’s low interest rates are choking bank returns. So is depressed economic activity. If it weren’t for astonishingly strong mortgage demand and, for the bigger banks, high trading activity, banks might not have anything going for them. The Fed has put some serious temporary dividend and buyback limitations on some of America’s largest banks following discouraging stress tests. So, while JPMorgan Chase (JPM) and US Bancorp (USB) typically would make their move in Q3, they might be mum this fall. But watch their reports for signs of health that will enable these solid yielders to push their payouts higher once the clouds break. Smaller banks and nonbank financials have no such restrictions, so we might just get a big move or two from the sector’s strongest operators. Company Ticker Payout Yield Timing Estimate Payout Freq. Raise Freq. American Express AXP $0.43 1.8% Late September Quarterly Annually BancFirst BANF $0.32 2.9% Late August Quarterly Annually City CHCO $0.57 3.7% Late September Quarterly Annually Community Bank System CBU $0.41 2.9% Late August Quarterly Annually Glacier Bancorp GBCI $0.29 3.3% Late September Quarterly Annually* JPMorgan Chase JPM $0.90 3.7% Mid- September Quarterly Annually State Street STT $0.52 3.3% Mid- September Quarterly Annually TFS Financial TFSL $0.28 7.9% Late August Quarterly Annually US Bancorp USB $0.42 4.6% Mid- September Quarterly Annually * Note: GBCI has raised dividends at varying times over the past few years. Its last dividend increase announcement was in late September 2019. Dividend Spotlight: American Express (AXP) has grown its payout by almost 140% since 2012, and the firm only pays out about a third of its profits as payouts. In a normal year, we’d be able to expect a big raise. Unfortunately, this is 2020. Unlike competitors Visa (V) and Mastercard (MA), which merely process credit card transactions for other banks, American Express is on the hook for debt, making it more like a bank. Spending volumes already bottomed, in April, but the second quarter was still a disaster. Profits were slashed by 85% in the second quarter. AXP was forced to nearly double the money it sets aside for losses, to $1.6 billion. That’s why AXP is down 25% in 2020 while Visa and Mastercard have rebounded to small gains. AmEx’s road to recovery will be much slower, but it can set the tone with a Q3 dividend increase. Even based on a gutted consensus estimate for 2020’s income, American Express’ payout ratio still is barely half its profits. It has the room for a decent hike, especially if it’s confident in a quick business rebound. What AXP does with its dividend might tell us more than anything else it reports this fall. The Blue Chips Blue chips haven’t been exempted from dividend issues. No sir. Wells Fargo (WFC) and BP (BP) have cut their dividends in recent months, while Boeing (BA), Ford (F) and General Motors (GM) have all suspended theirs. Don’t expect too many fireworks from this group during the fall, though. Few blue-chip companies announce dividend increases during the third quarter, and most of those on the schedule aren’t in dire straits. Company Ticker Payout Yield Timing Estimate Payout Freq. Raise Freq. Honeywell International HON $0.90 2.4% Late September Quarterly Annually Lockheed Martin LMT $2.40 2.5% Late September Quarterly Annually McDonald’s MCD $1.25 2.6% Late September Quarterly Annually Microsoft MSFT $0.51 1.0% Mid- September Quarterly Annually Philip Morris International PM $1.17 6.1% Mid- September Quarterly Annually Texas Instruments TXN $0.90 2.8% Mid- September Quarterly Annually Verizon Communications VZ $0.615 4.3% Early September Quarterly Annually Dividend Spotlight: It’s like Microsoft (MSFT) never missed a beat. Analysts are looking for 10% revenue growth this year and 12% next, and they’re modeling low-teens profit growth in both years. Fine, fine, its Azure cloud business growth slowed from 59% to “only” 47% last quarter. That’s a COVID pinch most companies would kill to feel. Microsoft shares are up a cool 35% this year, and for good reason. Not only has the coronavirus actually benefited tech companies with strong cloud presences, but it has benefited the relative-safety plays in mega-cap tech that are dripping in cash, like MSFT and its $136 billion war chest. Microsoft is averaging 10% annual dividend growth over the past five years. It’s a “have” among a sea of “have-nots.” A merely modest hike amid its 2020 largesse would almost be a slap in the face. Realistically, though, Microsoft has the potential to deliver a generous increase this September. The Lesser-Knowns This isn’t an exciting bunch, and that’s good news for you. Boring, under-the-radar plays like the stocks below don’t make for great conversation starters, but they’re among the best ways to build wealth when you can buy them at discounted prices and plump yields. When the rest of the market is ogling Apple (AAPL) and Amazon.com (AMZN) next earnings season, tune into these reports instead. Company Ticker Payout Yield Timing Estimate Payout Freq. Raise Freq. EastGroup Properties EGP $0.75 2.3% Late August Quarterly Annually Ingredion INGR $0.63 2.9% Mid- September Quarterly Annually Lam Research LRCX $1.15 1.2% Late August Quarterly Annually* Logitech LOGI $0.73 1.0% Early September Annually Annually Masco MAS $0.135 0.9% Late September Quarterly Annually Medical Properties Trust MPW $0.27 5.4% Mid-August Quarterly Annually** Nordson NDSN $0.38 0.8% Mid-August Quarterly Annually OGE Energy OGE $0.3875 4.7% Late September Quarterly Annually RPM International RPM $0.36 1.8% Early October Quarterly Annually Westlake Chemical WLK $0.2625 1.9% Mid-August Quarterly Annually * Note: LRCX has raised dividends at varying times over the past few years. Its last dividend increase announcement was in late August 2019. ** Note: MPW often increases dividends in February, but it also announced an increased payout in August 2019, putting August 2020 on the watchlist. Dividend Spotlight: Medical Properties Trust (MPW) is an old favorite of ours, and a good real estate investment trust (REIT) to watch come fall. Health care REITs have been an adventure this year. Some, such as Welltower (WELL) and Ventas (VTR), which have exposure to senior living facilities, are still off more than 30% this year. But Medical Properties Trust, which has recovered to just 5% losses, focuses exclusively on hospitals. Hospitals have their own problems. They’ve had to prioritize COVID-19 patients and halt or delay more lucrative non-critical procedures, and founder Edward Aldag noted earlier this year that this was causing uncertainty around cash flows. But in its Q2 report, MPW announced that 100% of rents and interest are either now paid or subject to definitive repayment agreements since the onset of the pandemic. And the REIT even raised its full-year outlook to $1.68-$1.71 per share of normalized funds from operations (NFFO), from $1.65-$1.68 in its earlier forecast. Ed and his team are only paying out $1.08 per share in dividends as it is, so the current 5.4% yield is well-buffered by cash flow—and it’s likely to improve sometime in mid-August. The Frequent Raisers A few companies go above and beyond with their dividend hikes. Rather than waiting a full year before raising the payout in one lump sum, they spread out the increases across the calendar. Income investors like us love that, as it allows compounding returns to make us rich just a little bit faster. Company Ticker Payout Yield Timing Estimate Payout Freq. Raise Freq. American Tower AMT $1.10 1.6% Late September Quarterly Quarterly International Bancshares IBOC $0.55 3.6% Mid- September Semi- annually Semi- annually* Realty Income O $0.2335 4.7% Late September Monthly Quarterly TTEC TTEC $0.34 1.4% Late September Semi- annually Semi- annually W.P. Carey WPC $1.042 5.8% Mid- September Quarterly Quarterly * Note: In March, IBOC kept its dividend steady for the first time in years. Dividend Spotlight: Realty Income (O) has a reputation to uphold, and it has no one but itself to blame. The company calls itself “The Monthly Dividend Company.” It even keeps a running tab of its dividend-related accomplishments on its homepage: 600 monthly dividends paid, 4.5% compound annualized dividend growth since it listed on the NYSE in 1994, and 91 consecutive quarterly dividend increases. But 2020 has been tough on the triple-net retail REIT. It’s telling that Realty Income, arguably the best-in-class member of its industry, is still off 17%. While much of its portfolio is somewhat insulated from COVID-19, it still rents out space to gyms, theaters and other heavily affected businesses. The REIT hasn’t collected about 13.5% of contractual second-quarter rents from its portfolio. It has issued nearly $1 billion in notes over the past few months to bolster liquidity. The signal we’re looking for from Realty Income isn’t blaring, but subtle. The company’s dividend growth slowed down substantially in the first few years after the Great Recession, and the next couple of quarters could indicate whether we’re in for more of the same. Expect the announcement to come in late September, followed by its next quarterly update a few weeks later. Want More Great Investing Ideas? Your Early Retirement Portfolio: 7.7% Dividends—Every Month—Forever How to Retire on 10% Dividends Paid Monthly The Simple (and Safe) Way to Earn 15% Every Year from Stocks JNJ shares were trading at $146.94 per share on Thursday afternoon, down $1.46 (-0.98%). Year-to-date, JNJ has gained 2.08%, versus a 4.34% rise in the benchmark S&P 500 index during the same period."}]}