{"article": [{"url": "https://stocknews.com/news/acb-aurora-cannabis-reports-q4-earnings-and-investors-are-not-happy/", "published": 1600862900.0, "headline": "Aurora Cannabis Reports Q4 Earnings and Investors Are Not Happy", "body": "Shares of Aurora Cannabis (ACB) were up nearly 16% yesterday in anticipation of a strong fourth quarter. In addition, Jefferies analyst Owen Bennett had upgraded the stock to hold from underperform on Monday. Bennett praised ACB for cutting operating costs. This positive sentiment was short-lived though. The company reported results after the bell on Tuesday, and they were not good. ACB posted a Q4 net loss from continuing operations of almost CA$1.9 billion. That is quite significant since its previous quarter’s net loss was only CA$136.1 million. To be fair, investors were expecting this number. The company’s net revenue and cannabis net revenue also decline from the previous quarter. Total net revenue came in at CA$72.1 million, which is down nearly 5% from the previous quarter. Cannabis revenue came in at CA$67.5 million, a 3% drop from last quarter. While these numbers aren’t exactly positive, they’re not the main reason investors are spooked. The stock is down over 25% for the day so far. 7 Best ETFs for the NEXT Bull MarketThe most worrisome figure from the release is the company’s outlook for next year. ACB projects Q1 cannabis revenue between CA$60 million and CA$64 million. This represents another decline in cannabis net revenue. If cannabis revenue drops to $60 million, that would be an 11% drop in revenue. That would make it the second quarter in a row of declining revenue. The company has been cutting costs to become profitable, but that only works if it can increase sales. Miguel Martin, the recently appointed Chief Executive Officer at Aurora stated, “My focus is therefore to reposition the Canadian consumer business immediately. We look to expand beyond the value flower segment, leverage our capabilities in science and product innovation and put our effort on a finite number of emerging growth formats. This entails prioritizing our San Rafael, Aurora and Whistler premium brands in flower, pre-rolls and vapor, which will be shortly followed by strategic marketing and innovation efforts in concentrates and edibles.” Although ACB posted a record loss, it needed to finally consolidate its balance sheet and get rid of remaining goodwill. If Martin can succeed in re-positioning its business and generating more revenue, the company still has a fighting chance. (Disclosure: The author is long ACB) Want More Great Investing Ideas? 7 “Safe-Haven” Dividend Stocks for Turbulent Times When Does the Next Bull Run Start? Chart of the Day- See the Stocks Ready to Breakout ACB shares were trading at $5.17 per share on Wednesday afternoon, down $2.15 (-29.37%). Year-to-date, ACB has declined -80.05%, versus a 1.68% rise in the benchmark S&P 500 index during the same period."}]}