{"article": [{"url": "https://stocknews.com/news/cof-htz-pff-fpf-jpc-jps-ldp-4-cheap-funds-with-safe-7-dividends/", "published": 1595506100.0, "headline": "4 Cheap Funds With Safe 7% Dividends", "body": "Preferred stocks are hands-down the most ignored investments in this crisis. That’s too bad, because they’re one of the best ways to get a high, safe income stream. And you can supercharge their dividends by purchasing these “dividend unicorns” through preferred-stock closed-end funds. Before I go further, let me say that if the term “preferred shares” has your eyes glazing over, I get it: most people feel these investments are too obscure to bother with. But stick with me, because preferreds are actually perfectly suited to today’s contradictory economy, with its high numbers of bankruptcies and a rising stock market. Built for a Crisis 9 \"BUY THE DIP\" Growth Stocks For 2020Preferred stocks that are bought individually—that is, outside of a fund—yield 5.6% as I write this. But purchasing through a CEF can upsize that payout to 7%, 8%—even 9%. CEFs do this in two ways, both of which are badly misunderstood by the mainstream crowd. The first happens when a CEF trades at a discount to net asset value (NAV). This is a unique feature of CEFs, and an indicator you can easily spot on any fund screener. It basically means that the fund’s market price—or what we pay when we buy the CEF on the market—is lower than its NAV, or the per-share value of its portfolio. The upshot is that the yield as a percentage of NAV is lower than the yield on the discounted market price—and therefore easier for management to cover through the returns (and dividends) they make in the market. The best way to think of it is like this: the bigger the discount, the safer the dividend. The other way CEFs get us this larger yield is by borrowing to invest. That sounds dangerous, but preferred-stock CEFs cut risk by limiting these borrowings to 35% of their portfolios or less, on average. Leverage risk is also mitigated by the fact that these funds have hundreds of holdings, and preferred stocks are less volatile than regular stocks. Limited Drawdowns From a Lower-Volatility Asset Class As you can see from this chart, with the exception of the COVID-19 crisis, preferred stocks decline less than the market (and even the COVID-19 returns are misleading, as I’ll explain in a bit). This makes preferred-stock CEFs a great alternative when the market is overheated (like now) and a great asset to hold over the long haul because of their big dividend payouts. Another Preferred-Stock “Safety Valve” Another benefit of preferred stocks is that they’re higher up the corporate capital structure than regular stocks. This means that in the event of bankruptcy, owners of preferreds are compensated sooner, while “common” shareholders get the scraps—if they get anything at all. And as we already discussed, preferred stockholders get a higher dividend, much like creditors for debt and bonds. Preferred stocks’ higher payouts also make them a great way to get income from a company that doesn’t pay much in dividends. Take, for instance, Capital One Financial (COF), whose regular shares yield 2.5%. That’s more than the S&P 500 average but less than Capital One Series I preferred shares, which yield 5.4%. So the preferred stock is more than doubling our yield here. That’s not all it’s doing. When we compare Capital One common shares (in orange below) with the preferred stock (in blue), we see that the preferred stock has performed much better during this crisis. Capital One Preferreds Outperform Their “Common” Cousins This is no fluke: many preferred stocks fared much better in the selloff, with the exception of those in the energy sector. And since energy accounts for a big slice of the preferred-stock market, the performance of preferred funds as a whole looked worse than it actually was. Tactical preferred-stock investing actually saw a much smaller drawdown. I’m sure you can see where I’m headed here: in a world where we’re facing bankruptcies from the likes of J.C. Penney, Hertz Global Holdings (HTZ) and Frontier Communications, a few carefully selected preferred-stock CEFs make a nice addition to any investor’s portfolio. Let’s dive into four bargains in the space now. 4 Cheap Preferred-Stock CEFs Yielding 7.1%+ The beauty of a preferred-stock CEF is that you get access to professional management. That’s critical in the preferred market, which is tough for you and I to access and research on our own. And because they have a savvy human at the helm, all of these funds outperform their benchmark. That’s no typo: of the 16 preferred-stock CEFs on the market, all have beaten the benchmark iShares Preferred & Income Securities ETF (PFF), which follows a passive index of the broader preferred-stock market. While that makes all preferred-stock CEFs worth a look, I want to highlight just four for you, for one reason. The market is well aware of preferred-stock CEFs and their big dividends, so most trade at a premium—with the exception of these four, which slipped through the cracks. Symbol Name Premium/Discount Dividend Yield Long-Term Annualized Returns FPF First Trust Intermediate Duration Preferred & Income -2.7% 7.5% 5.7% JPC Nuveen Preferred Income Opportunities Fund -4.1% 7.6% 9.6% JPS Nuveen Preferred Securities income Fund -2.6% 6.9% 9.0% LDP Cohen & Steers Limited Duration Preferred and Income Fund -4.3% 7.6% 6.6% In addition to yields of 6.9% and up, these funds have diversified portfolios of preferred stocks in several sectors (including finance, telecommunications and technology) while also trading for less than their portfolios are worth. That makes them compelling income options for today’s unpredictable market. Want More Great Investing Ideas? Free Report: 5 Bargain Funds with Safe 11% Dividends A “1-Click” Way to Grab Safe 8% Dividends The $43,000 “dividend secret” Wall Street hides from you COF shares were trading at $66.03 per share on Thursday afternoon, up $1.98 (+3.09%). Year-to-date, COF has declined -35.16%, versus a 2.01% rise in the benchmark S&P 500 index during the same period."}]}