{"article": [{"url": "https://stocknews.com/news/cmg-pzza-loco-yumc-4-restaurant-stocks-thriving-during-the-pandemic/", "published": 1595419700.0, "headline": "4 Restaurant Stocks THRIVING During the Pandemic", "body": "The coronavirus outbreak has devastated countless traditional sit-down restaurants while boosting restaurants that deliver food and offer carryout or drive-thru service. Overnight, many restaurants were forced to adapt to this new reality. Examples included “walk-up” windows for patrons to order food, kits for people to prep and cook food at home, and opening of outdoors areas where people can eat and be served while waiters wear masks and gloves. There was some optimism around reopening, however recent developments seem to implicate indoors dining as a culprit in the virus’ spread in many parts of the country. Credit card spending at restaurants was a predictor of increasing case counts in areas that first reopened. Therefore, indoor dining traffic is starting to decline with many local governments shutting it down altogether. 7 \"SAFE HAVEN\" Dividend Stocks for Turbulent TimesFor restaurants, this new reality is going to last at least until a vaccine is available and widely distributed. These four restaurant stocks are perfectly positioned to keep thriving: Chipotle Mexican Grill (CMG) Think back to the last time you were in a CMG restaurant. You likely stood within the foot of a couple of other customers as you waited upwards of 10 minutes in line to get a burrito, burrito bowl, or tacos. The allure of this traditional CMG ordering experience is you get to observe your food being made directly in front of you. However, fewer people are interested in standing in long lines now that a contagious virus is on the loose. CMG has pivoted toward carryout and delivery service. It is now possible to place your CMG order online and swing by your local restaurant for a quick and easy pickup. Alternatively, if you prefer that your CMG order be delivered directly to you, DoorDash will make it happen. CMG is currently testing cauliflower rice in several markets, assuming its stereotypically health-oriented customers will prove receptive to cutting down their carbohydrates. With a focus on organic and fresh ingredients, CMG is a must-own stock worthy of every investor’s attention. Even if you don’t like Mexican food, you should still consider building a position in CMG simply because the enormous millennial age cohort is obsessed with CMG’s offerings. When it comes to the POWR Ratings, few stocks top CMG. CMG has As in each POWR Component but for its Industry Rank which is graded as a C. CMG is the top-ranked stock of nearly 50 publicly traded companies in the Restaurants category. Out of the 27 analysts who have thoroughly reviewed CMG, 14 recommend buying, 13 recommend holding and none recommend selling. Yum China Holdings (YUMC) As China’s largest restaurant operator, Yum China pays a licensing fee to its corporate parent, Yum! Brands, equating to 3% of net sales. The licensing fee stems from both franchise restaurants and company-owned restaurants. Examples of YUMC restaurants include Taco Bell, Pizza Hut, and KFC. Lesser-known YUMC eateries include COFFii & Joy, Little Sheep, and East Dawning. The POWR Ratings reveal YUMC has A grades in each POWR Component. YUMC is ranked third of 115 China stocks. Check out the analysts’ average price target for YUMC and you will find the stock has some room for growth: a $54.25 target with three analysts recommending investors buy while one recommends holding and none recommend selling. YUMC has soared up beyond the $50 level after dipping below $40 at the outset of the pandemic. YUMC is only a couple of dollars away from its 52-week high. The company recently rolled out Beyond Meat at its Taco Bell, Pizza Hut, and KFC restaurants. The beauty of owning and operating these fast food restaurants during the pandemic is they do not force diners to sit elbow-to-elbow in cramped dining rooms. Rather, each of YUMC’s restaurants provides a drive-thru and carryout service to minimize the chances of contracting the virus. YUMC should continue its upward ascent or at the very worst, trade sideways until the pandemic ends. Papa John’s International, Inc. (PZZA) Delivery and carryout are now the primary channels for restaurant sales with social distancing becoming the norm. PZZA specializes in pizza carryout and delivery. With operations in 49 states, PZZA is in the perfect position to benefit from the coronavirus pandemic. The company’s pizza tastes great, is affordably priced, and does not require sitting next to potential virus-carriers. The POWR Ratings show PZZA has As in all POWR Component categories but for its excusable Industry Rank of C. PZZA is ranked in the top five of nearly 50 restaurant stocks. PZZA has had three straight months of double-digit same-store sales growth. Even if the economy fully reopens in the next couple of months, the public will have developed such a strong taste for PZZA offerings that the stock should hold onto its gains for the foreseeable future or possibly move even higher. El Pollo Loco Holdings, Inc. (LOCO) Readers hailing from the east coast and northern part of the country might not be familiar with LOCO. However, even if you have not stepped foot in a LOCO restaurant, this stock is worthy of your attention. LOCO’s quick-service restaurants provide delicious flame-grilled chicken along with other Mexican-influenced food such as quesadillas and burritos. To the surprise of many, LOCO has nearly flawless POWR Ratings Components, grading out with an A in each Component but for its Industry Rank. LOCO is ranked in the top five of 48 restaurant stocks. Add in the fact that LOCO trades at a forward P/E ratio of a somewhat reasonable 36.40 and it is easy to understand why investors are flocking to this growth stock. Furthermore, LOCO chefs are working on perfecting their plant-based chicken to generate inroads with the Generation Z and millennial age cohorts. Want More Great Investing Ideas? 9 “BUY THE DIP” Growth Stocks for 2020 Newly REVISED 2020 Stock Market Outlook 7 “Safe-Haven” Dividend Stocks for Turbulent Times CMG shares were trading at $1,177.58 per share on Wednesday afternoon, up $14.48 (+1.24%). Year-to-date, CMG has gained 40.67%, versus a 2.23% rise in the benchmark S&P 500 index during the same period."}]}