{"article": [{"url": "https://stocknews.com/news/tsm-asml-avgo-3-semiconductor-stocks-set-to-rise/", "published": 1593778100.0, "headline": "3 Semiconductor Stocks Set To Rise", "body": "Semiconductor companies play a significant part in today’s IT-driven world. Digitization of business processes is taking place across the world, and semiconductor manufacturers are an integral part of this transition. Further boosting the prospects of such companies is the shift to cloud computing. This is ongoing, but the next phase of the process will be the introduction of machine learning and AI that will make the software even more powerful. The latest trends in the technology space such as smart sensors, connected devices, and virtualization will drive the next cycle for semiconductor stocks. In the near-term, the coronavirus has resulted in increasing investments in devices, computers, and servers that are leading to outperformance for the semiconductor sector. Micron’s (MU) recent earnings show that the company’s number of units sold and the average price per unit were higher than analysts’ expectations. 9 \"BUY THE DIP\" Growth Stocks For 2020Here are three semiconductor stocks with promising prospects: Taiwan Semiconductor Manufacturing (TSM) TSM recently lost business from Chinese technology company Huawei as the US Government restricted Huawei’s operations in the country. However, the blow to TSM proved to be short-lived, as the company reported that it has already recouped new customers. TSM’s customer list includes some of the most well-known names in the industry like Apple (AAPL), Broadcom (AVGO). Nvidia (NVDA), Qualcomm (QCOM), and AMD (AMD). Its chips are an integral part of many ubiquitous tech products including phones, PCs, servers, and network equipment that play a central role in the global economy’s function. TSM has an overall POWR Rating of Strong Buy with an “A” in every category including Trade Grade, Buy & Hold Grade, Peer Grade, and Industry Rank. Among semiconductor stocks, it’s ranked #1 out of 86 stocks. ASML Holding (ASML) ASML Holding is a key link in the semiconductor manufacturing industry. It has a virtual monopoly in the deployment of lithography systems. Lithography systems are an essential component of computer hardware manufacturing. This technology powers semiconductor manufacturing. With the growing importance of semiconductors for the US and the world, ASML is in a unique position to receive strong long-term gains. ASML’s technology also has a high probability of being used in the manufacturing of DRAM memory chips. Recently, DRAM pricing and demand has been very strong. ASML is a leading stock in the semiconductor segment, ranked #3 out of 86 stocks. It has an overall POWR Ratings of Strong Buy with an “A” in all categories including Buy & Hold Grade, Trade Grade, Industry Rank, and Peer Grade. Broadcom (AVGO) AVGO is a leading chip-manufacturer that develops and provides a wide range of analog and digital semiconductor connectivity solutions. The company’s offerings are used in data center networking, home connectivity, telecommunications equipment, broadband access, smartphones, and more. The company’s core business remains in growth mode due to the world’s insatiable appetite for chips, but it’s also been growing via acquisitions. AVGO recently acquired key industry players CA Technologies, Brocade, and Symantec which gives it a presence in adjacent markets like the infrastructure software and security space. AVGO has an overall POWR Rating of Strong Buy and an “A” in all POWR categories including Trade Grade, Peer Grade, Buy & Hold Grade, and Industry Rank. Among semiconductor stocks, it’s ranked #4 out of 86. Want More Great Investing Ideas? 9 “BUY THE DIP” Growth Stocks for 2020 Is the Bull S#*t Rally FINALLY Over? 7 “Safe-Haven” Dividend Stocks for Turbulent Times Top 3 Investing Strategies for 2020 TSM shares were trading at $58.62 per share on Friday afternoon, up $1.80 (+3.17%). Year-to-date, TSM has gained 2.25%, versus a -1.99% rise in the benchmark S&P 500 index during the same period."}]}