{"article": [{"url": "https://stocknews.com/news/phm-dhi-len-mth-xhb-top-4-homebuilders-built-for-a-rising-housing-market/", "published": 1595851700.0, "headline": "TOP 4 Homebuilders “Built” for a Rising Housing Market", "body": "Sales of new single-family homes neared a 13-year high last month, with home sales rising 13.8% to a seasonally adjusted annual rate of 776,000 units. This was the highest level reached since July 2007. The housing market has been outperforming the rest of the broader market against a backdrop of low-interest rates. The 30-year fixed mortgage rate has been hovering around 3%, close to a 49-year low. The news followed an announcement from the National Association of Home Builders/Wells Fargo Housing Market Index that Homebuilder sentiment went up by 14 points in July and a separate report of a rise in existing-home sales of 21% in June. As the coronavirus has forced employees to work from home, there has been an emerging demand for homes away from the big cities. The SPDR S&P 500 Homebuilder ETF (XHB) is up more than 51% over the past three months. The pandemic has not affected home buyers as much as it has with renters. New homebuyers, which have a median age of 47, are less likely to have worked in the service industry jobs that were shut down due to the pandemic. 9 \"BUY THE DIP\" Growth Stocks For 2020Four homebuilders that should continue to perform well in this environment are PulteGroup (PHM), D.R. Horton (DHI), Lennar (LEN), and Meritage Homes (MTH). PulteGroup (PHM) PHM is one of the largest homebuilders in the United States, operating in 44 markets across 24 states. The company mainly builds single-family homes and offers products to entry-level and active-adult buyers. The company also provides homebuyers with mortgage financing and title agency services through its financial services segment. The company reported earnings on July 23rd and easily beat estimates with EPS of $1.15 compared with the consensus estimate of $0.84. PHM’s revenues of $2.59 billion was a 4.2% increase from a year ago. The company has benefitted from low-interest rates, a limited supply of existing homes, and pent up demand due to the pandemic. PHM’s focus on the growing market for new home buyers has served the company well, as affordability is currently an issue. PHM currently has a Buy rating in our momentum-based POWR Ratings. Overall, it is the #6 ranked stock in the Homebuilders industry. D.R. Horton (DHI) DHI is a leading homebuilder in the US with operations in 90 markets across 29 states. Similar to PHM, the company mainly builds single-family detached homes. Homes vary in sizes up to 4,000 square feet, with home prices ranging from $100,000 to $1,000,000. The company derives revenue from the sale of completed homes built on lots it develops and on finished lots purchased for home construction. DHI reported earnings on July 23rd with EPS of $1.44, which beat the consensus of $1.09. Affordable homes are what is mainly driving profits for the company. First-time homebuyers represented over 50% of closings in the second quarter of this year. The company has also benefited from cost control measures. Management has been able to cut costs through efficient home design and paying competitive prices on construction materials and labor. DHI holds four aces with grades of A in four out of five scores in the POWR Ratings. The stock, which is rated a Strong Buy, is the #1 ranked stock in the Homebuilders industry. Lennar (LEN) LEN is now the largest homebuilder in the United States after merging with CalAtlantic in 2018. The company focuses on first-time, move-up, and active adult homebuyers, but is also involved in multifamily construction. While the company has a financial services business, homebuilding accounts for 93.4% of total revenues. This includes the sale and construction of single-family attached and detached homes, and the purchase, development, and sale of residential land. The company reported earnings last month with an EPS of $1.65, which handily beat analysts’ expectations of $1.29. This was due to cost control and a focus on making its homebuilding platform more efficient. This led to higher operating leverage. LEN focused on acquiring low-cost new home sites during the market downturn in March, which put the company in a position to meet the growing demand since. The company has also benefited from a combination of low-interest rates and slower price appreciation. LEN is currently a Strong Buy in the POWR Ratings. It has a grade of A in Trade Grade, Buy & Hold Grade, and Peer Grade. Overall, it is the #2 ranked stock in the Homebuilders industry. Meritage Homes (MTH) MTH primarily builds single-family and active adult housing communities across the western, southern, and southeastern parts of the United States and has a presence in 25 metro markets. The company has expanded into Texas, Florida, Georgia, and the Carolinas. MTH is considered an industry leader in building energy-efficient homes. The company completes almost 6,000 home orders every year. MTH reported earnings on July 22nd, destroying analyst expectations with EPS of $2.38, which is 57% more than the consensus estimate of $1.52. Revenues increased by 23% for the first in half of 2020. The company expects total home closings between 10,850-11,350 units in 2020, increasing from 9,267 homes in 2019. The company’s LiVE.NOW product, which targets entry-level and move-up buyers, is gaining steam and should continue to boost performance over the long term. How does MTH stack up for the POWR Ratings? A for Trade Grade A for Buy & Hold Grade B for Industry Rank A for Peer Grade A for overall POWR Rating MTH is also the #4 ranked stock in the Homebuilders industry. Want More Great Investing Ideas? 9 “BUY THE DIP” Growth Stocks for 2020 Newly REVISED 2020 Stock Market Outlook 7 “Safe-Haven” Dividend Stocks for Turbulent Times PHM shares were trading at $43.70 per share on Monday afternoon, up $1.08 (+2.53%). Year-to-date, PHM has gained 13.39%, versus a 1.24% rise in the benchmark S&P 500 index during the same period."}]}