{"article": [{"url": "https://stocknews.com/news/aem-eqx-or-ngd-4-strong-buy-gold-stocks-to-invest-in-now/", "published": 1599739700.0, "headline": "4 “Strong Buy” Gold Stocks to Invest in NOW", "body": "Being a highly liquid commodity, Gold is always in-demand. It is known as the most reliable safe-haven asset, as it is easily redeemable in times of emergencies. So, the commodity typically has an inverse relationship with stock market performance. The more uncertain the stock market is, the more investors shift their investments to the yellow metal. Quite naturally, the economic and market slump caused by the pandemic helped gold soar this year, before taking a nosedive during the technology boom, which pushed stocks to abnormally high levels. The yellow metal hit its all-time high of $2,067 per ounce in early August, and is currently trading at $1,934, gaining more than 28% year-to-date. After taking a pause, the precious metal has resumed its rally and is well positioned to hit new highs with a recent increase in market volatility, the tech sell-off, a weakening US dollar, and a growing rift between the UK and the EU concerning Brexit. Investors are also turning to this safe-haven asset with expected uncertainty in the upcoming US presidential election. 9 \"BUY THE DIP\" Growth Stocks For 2020As companies that are engaged in the exploration and mining of this precious metal benefit directly from its rising prices, their stocks should gain significant momentum in the upcoming months. Gold stocks such as Agnico Eagle Mines Limited (AEM), Equinox Gold Corporation (EQX), Osisko Gold Royalties Limited (OR), and New Gold, Inc. (NGD) may be attractive bets right now. Agnico Eagle Mines Limited (AEM) AEM explores and develops mineral properties in the United States, Canada, Europe, and Latin America. The company is currently engaged in expanding their operations in the Kittila mines in Finland. AEM is also exploring development opportunities in Santa Gertrudis, Kirkland Lake Project, and Canadian Malartic Underground. AEM has returned 34.9% year-to-date thanks to uncertainty caused by the pandemic. AEM is expected to witness revenue growth of 23.2% in the current year, and 25.8% next year. AEM’s EPS is estimated to grow at a rate of 53.58% per annum over the next five years. The company, in its second-quarter earnings report, increased its production guidance for 2020 to 1.68 to 1.73 million ounces, compared to the previous guidance of 1.63 to 1.78 million ounces. How does AEM stack up for the POWR Ratings? A for Trade Grade A for Buy & Hold Grade A for Peer Grade B for Industry Rank A for Overall POWR Rating The stock is also ranked #3 out of 30 stocks in the Miners – Gold industry. Equinox Gold Corporation (EQX) EQX focuses on the development and mining of gold-related properties. Its operations consist of the aurizona gold mine, castle mountain, copper projects, and mesquite gold mine. The company has acquired Leagold Mining, which has significantly expanded the company’s operations. In the second quarter of 2020, the company reported that their production was at record highs, despite disruptions caused by the spread of the coronavirus. The company’s Castle Mountain mine is expected to witness a growth rate in production of 20% per annum. The stock has gained 53.51% year-to-date. EQX is expected to increase its sales at a rate of $285 million per quarter on top of its second-quarter levels. Additionally, the company is expected to see greater profits in the coming quarters due to the rise in gold prices. EQX’s strong fundamentals are reflected in its POWR Ratings, it has a “Buy” rating with a grade of “A” in Trade Grade and a “B” in Buy & Hold Grade, Peer Grade, and Industry Rank. Within the Miners – Gold industry, it’s ranked #16 out of 30 stocks. Osisko Gold Royalties Limited (OR) OR is a mining royalty and exploration company. The company primarily operates in gold, silver, and diamond mines. The company also invests in the exploration activities of other companies through equity. The company has recently expanded its investments by acquiring a 15% stake in a portfolio of Canadian royalties held by Caisse de dépôt et placemer. In the second quarter, the company realized a price of gold at $1711 per ounce. This is a marked increase from $1583 per ounce that the company realized in the first quarter. The company is expected to realize an even higher price due to the rising price of gold in the third quarter. OR’s stock has returned 28.1% year-to-date. It’s no surprise that OR is rated a “Strong Buy” in our POWR Ratings system, with a grade of “A” in Trade Grade, Buy & Hold Grade, and Peer Grade. In the 30-stock Miners – Gold industry, it is ranked #6. New Gold, Inc. (NGD) NGD is focused on the acquisition, exploration, and development of mineral properties in the United States, Canada, Mexico, Chile, and Australia. The company has recently closed the sale of the Blackwater Project to Artemis Gold, Inc. (OTCMKTS:ARGTF) for a consideration of $190 million. Additional consideration includes a gold stream of 8% from the gold produced by the Blackwater Project. The company also received approximately $34.4 million worth of shares in Artemis Gold. NGD’s revenue is expected to rise 6.9% in the current year and 29.9% next year. The company’s EPS is estimated to grow 20% in the current year and 83.3% next year. Despite disruptions caused by the coronavirus, the company’s stock has delivered a year-to-date return of 114%. NGD’s strong fundamentals are reflected in its POWR Ratings. It has a “Strong Buy” rating with a grade of “A” in Trade Grade, Buy & Hold Grade, and Peer Grade. Within the Miners – Gold industry, it’s ranked #16 out of 30 stocks. Want More Great Investing Ideas? 7 Best ETFs for the NEXT Bull Market Will Stocks Fall into Historical September Slump? 9 “BUY THE DIP” Growth Stocks for 2020 AEM shares were trading at $81.77 per share on Thursday afternoon, down $1.35 (-1.62%). Year-to-date, AEM has gained 34.00%, versus a 4.78% rise in the benchmark S&P 500 index during the same period."}]}