{"article": [{"url": "https://stocknews.com/news/ffiv-rp-mtls-3-oversold-tech-stocks-to-buy/", "published": 1596802100.0, "headline": "3 OVERSOLD Tech Stocks to Buy", "body": "There have been a number of consequences due to the coronavirus pandemic including a stock market crash and changes in behavior. It’s also led to increased dependence on technology for consumers and businesses. Tech stocks have been screaming higher with the Nasdaq hitting, new all-time highs. However, over the past couple of weeks, the pace of gains has moderated. The number of advancing stocks has thinned. This is normal behavior as bull markets mature. There has been profit-taking in certain technology stocks. They’ve now become oversold on a technical basis and are presenting advantageous, entry points for savvy traders and investors. Due to the Nasdaq’s relentless advance since March, these opportunities have been rare. 9 \"BUY THE DIP\" Growth Stocks For 2020F5 Networks, Inc. (FFIV), RealPage, Inc. (RP) and Materialise NV (MTLS) are 3 such oversold tech stocks with intriguing upside. F5 Networks, Inc. (FFIV) FFIV operates as a multi-cloud application services provider. It helps organizations seamlessly scale cloud, data center, telecommunications, and software-defined networking deployments to successfully deliver applications and services to anyone, anywhere, at any time. The company launched a new cloud platform in Bahrain last month. This marks FFIV’s first MidEast presence fortifying as it looks to expand internationally. FFIV is also planning to improve business outcomes by employing interconnection to multiple clouds, through Equinix, a virtual interconnection solution provider. FFIV has recently announced its financial report for its fiscal third quarter ended June. Revenue grew 4% year over year to $586 million in the quarter. The software segment grew 43% and the services segment grew 5%, compared to the year-ago quarter. Moreover, 73% of the software revenue was from subscriptions. The stock has gained more than 75% since its March lows. Since late-April, the stock has consolidated between $155 and $135. In bull markets, these sideways, trading ranges tend to resolve higher especially for stocks with solid fundamentals in fast-growing categories. How does FFIV stack up for the POWR Ratings? B for Trade Grade B for Buy & Hold Grade B for Industry Rank B for Overall POWR Rating The stock is also ranked #18 out of 47 stocks in the Software – Business Industry. RealPage, Inc. (RP) RP is a software and data analytics leader for the real estate industry in the United States. It provides comprehensive property management software solutions for the multifamily, commercial, single-family, and vacation rental housing industries. RP’s platform integrates property management, sales and marketing, revenue and utility management, and all other property operations under a single cloud. The company introduced artificial intelligence (AI) ChatBot in May. The AI successfully supports the 24/7 Virtual Leasing Office by providing a cost-effective and quality solution due to reduced onsite staffing amidst the pandemic. RP also reported that its AI Revenue Management systems, introduced earlier this year, delivered significantly increased revenue yield for clients. The second-quarter financial performance of RP was better than expected with total revenue growing 17% to $286 million. RP reported an EPS of $0.49, beating the consensus estimate by 19.5%. On-demand for services grew 19% for the quarter with the resident services segment and property management segment growing 28% and 18% year over year, respectively. RP’s current RSI level is 38.84. The stock has gained more than 70% since hitting its lows in mid-March. According to the POWR Ratings, RP is a “Buy.” It also has a “B” for Trade Grade, Buy & Hold Grade, and for Industry Rank. It’s ranked #20 out of 47 stocks in the Software – Business industry. Materialize NV (MTLS) MTLS is a Belgium based company that provides additive manufacturing and medical software and 3D printing services in Europe, the Americas, Europe, and Africa, and the Asia-Pacific. It offers a platform that enables and enhances the functionality of 3D printers and 3D printing operations. The company is uniquely positioned in the medical ecosystem which enabled it to quickly respond to this health crisis. Its hands-free door opener went from idea to product in less than 1 week. MTLS has also developed a Materialise NIP mask, which allows oxygen to be provided to patients without ventilation. The company reported an earnings surprise of 28.6% for the second quarter. MTLS’s gross profit was 52.4% of total revenue. The manufacturing segment contributed 44% of the revenue while the cross-segment revenue from software products amounted to 38%. The EPS is expected to grow at 188.9% next year. The stock’s current RSI level is 49.48. Since hitting its lows in mid-March, the stock has gained more than 140% and it could witness further upside. MTLS’s POWR Ratings has an overall rating of “Buy” with an “A” for Trade Grade and “B” in Buy & Hold Grade. It is ranked #3 of 6 Technology – 3D Printing stocks. Want More Great Investing Ideas? 9 “BUY THE DIP” Growth Stocks for 2020 How to Trade THIS Stock Bubble? 7 “Safe-Haven” Dividend Stocks for Turbulent Times FFIV shares were unchanged in after-hours trading Friday. Year-to-date, FFIV has gained 0.67%, versus a 5.02% rise in the benchmark S&P 500 index during the same period."}]}