{"article": [{"url": "https://stocknews.com/news/amzn-msft-fb-pypl-4-tech-stocks-to-buy-after-the-nasdaqs-recent-sell-off/", "published": 1600085300.0, "headline": "4 Tech Stocks to Buy After the NASDAQ’s Recent Sell-Off", "body": "The major stock-market indices have recently been in correction mode, with the major tech stocks witnessing a heavy sell-off. The tech-heavy Nasdaq has sunk close to 10% through Friday since September 2nd, after gaining more than 70% since its March low. Rather than an indication of another market crash, this correction is seen as the return of a highly overvalued market to fair levels. Stocks in the technology sector have mainly borne the brunt of this correction. However, instead of taking this correction as a sign of weakness in the tech sector, this may provide a good opportunity for investors to enter the sector at more reasonable prices. Technology stocks have been driving the US stock market since the start of the coronavirus pandemic, and there is no reason they shouldn’t do the same going forward. The demand for technology-oriented products is increasing and a widespread digital transformation is underway. 7 \"SAFE HAVEN\" Dividend Stocks for Turbulent TimesAmazon.com, Inc. (AMZN), Microsoft Corporation (MSFT), Facebook, Inc. (FB), and PayPal Holdings, Inc. (PYPL) are strong tech companies because of their solid long-term growth potential. Amazon.com, Inc. (AMZN) Shares of AMZN have been performing exceptionally well so far this year. The stock has largely gained due to its e-commerce business, which has seen growth in demand due to the spread of the coronavirus and the resultant lockdowns. AMZN’s cloud computing platform is also in high demand due to digital transformation and more companies shifting their operations to the cloud. AMZN’s stock has delivered a year-to-date price return of 68.6% so far. The company has recently received approval for the use of drones as part of their delivery operations. This move could help the company make faster deliveries in a more cost-effective manner. The company has also unveiled its Whole foods e-commerce store. As more and more people are looking to do their entire shopping online, AMZN’s online grocery store could not have come at a better time. AMZN is expected to see a rise in revenue of 31% in the current year and 18% next year. AMZN’s EPS is estimated to grow 37.4% in the current year and at a rate of 36% per annum over the next five years. How does AMZN stack up for the POWR Ratings? A for Trade Grade B for Buy & Hold Grade A for Peer Grade A for Industry Grade B for Overall POWR Rating The stock is also ranked #1 out of 57 stocks in the Internet – Services industry. Microsoft Corporation (MSFT) MSFT has also had a stellar year so far, with its cloud computing platform Azure witnessing a period of high demand. MSFT has also benefited from the spread of the coronavirus since its operating systems and licensed software offer a way for people to work remotely. MSFT’s stock price has risen 29.3% so far this year. MSFT is set to release its next generation gaming console Xbox before the end of the year, which could lead to a significant uptick in its gaming revenue. The company has entered into an agreement with Nutanix (NTNX) for the integration of the latter’s hybrid cloud infrastructure onto MSFT’s Azure. The company is also making forays into the 5G technology market with its intention to acquire Metaswitch Networks. MSFT’s revenue is expected to rise 9.6% in the current year and 11.5% next year. MSFT’s EPS is estimated to grow 12.2% this year, and at a rate of 15.2% per annum over the next five years. MSFT is rated a “Buy” in our POWR Ratings system, with a grade of “A” in Trade Grade and Industry Rank. In the 92-stock Software – Application industry, it is ranked #6. Facebook, Inc. (FB) The social media giant, which runs Facebook.com, Instagram, and Whatsapp, has been witnessing increased user engagement since people are spending more time at home. The company has also positioned itself as the go-to destination for digital marketing efforts. FB recently announced the launch of Facebook Campus, which is a college-students only platform allowing students to find and connect with each other and attend college events. The company is also working on integrating the functionality of its family of apps. It has already integrated Messenger and Instagram chat to allow users to access both together. FB is expected to see a revenue increase of 13.4% this year and 24% next year. FB’s EPS is estimated to grow 24.6% in the current year and 16.4% per annum over the next five years. FB’s stock price has gained 29.9% so far this year. FB’s strong fundamentals are reflected in its POWR Ratings. It has a “Buy” rating with a grade of “A” for Trade Grade, Peer Grade, and Industry Rank. Within the Internet industry, it’s ranked #4 out of 57 stocks. PayPal Holdings, Inc. (PYPL) PYPL is one of the most popular payments services companies in the world, with operations in around 200 countries. As the market shifts towards e-commerce and digital payments, PYPL is well poised to gain from this change. PYPL’s stock price has gained 70.1% so far this year. In the second quarter of the year, PYPL added 21.3 million new users to its platform which was an increase of 137% year-over-year. PYPL and Visa (V) have announced the continuation of their partnership along with enhancements. Under Visa Direct, eligible PayPal user’s will be able to instantly send and receive funds to and from Visa cards. The company is also working on a touchless QR code-based payment method in physical stores. PYPL’s revenue is expected to grow 20.4% in the current year and 19.3% next year. The company’s EPS is estimated to grow 20.3% this year and at a rate of 23.37% per annum over the next five years. PYPL is rated a “Buy” in our POWR Ratings system, with a grade of “A” in Trade Grade, Peer Grade, and Industry Rank. In the 45-stock Consumer Financial Services industry, it is ranked #4. Want More Great Investing Ideas? 7 Best ETFs for the NEXT Bull Market Is the Stock Market Correction Over? Chart of the Day- See the Stocks Ready to Breakout AMZN shares were trading at $3,167.01 per share on Monday morning, up $50.79 (+1.63%). Year-to-date, AMZN has gained 71.39%, versus a 6.50% rise in the benchmark S&P 500 index during the same period."}]}