{"article": [{"url": "https://stocknews.com/news/spy-inx-dia-iwm-qqq-these-5-charts-lead-to-more-winning-stock-trades/", "published": 1594901300.0, "headline": "THESE 5 Charts Lead to More Winning Stock Trades", "body": "On Thursday July 16th we hosted the largest investment strategy event in StockNews.com history. This is where trading expert, Christian Tharp CMT, unveiled his detailed presentation on: 5 Winning Stock Chart Patterns. Click Here to Watch Now! 9 \"BUY THE DIP\" Growth Stocks For 2020Let me take a step back and tell you the genesis behind this important event. As you know at the heart of StockNews.com is the coveted POWR Ratings system. This quantitative model provides one of the best ways to quickly find stocks enjoying the healthiest momentum that should continue to run even higher. Unfortunately right now there are actually 2,093 Buy rated stocks (A & B). And it truly could be a full time occupation narrowing down that list to the rare few that end up in your portfolio. This led me to reach out to one of the world’s foremost traders and market technicians, Christian Tharp CMT. I asked him to analyze the POWR Ratings and help overlay his favorite chart pattern set ups to quickly help traders narrow down to a group of 5-7 timely trades with the best odds of success. And that is exactly what you will find at the heart of his new presentation “5 Winning Stock Chart Patterns” that is available to watch on demand. Click Here to Watch Now! Here is the outline what you will learn in Christian Tharp’s new presentation: * Quant models, like the POWR Ratings, exist to help you quickly find the stocks that are leading the market. * The best of those trades are found by overlaying proven chart patterns. * The key word above is “proven”. Meaning most chart patterns don’t really work on a consistent basis. So Christian will share 5 patterns that consistently find the best trade set ups. * When all is said and done you can easily narrow down to 5 to 7 of the most timely stock trades. All this and more awaits you now in the 5 Winning Stock Chart Patterns presentation. Click Here to Watch Now! Steve Reitmeister…but everyone calls me Reity (pronounced “Righty”) CEO, StockNews & Editor of Reitmeister Total Return SPY shares . Year-to-date, SPY has gained 0.69%, versus a % rise in the benchmark S&P 500 index during the same period."}]}