{"article": [{"url": "https://stocknews.com/news/spy-snow-how-to-protect-your-retirement-portfolio-after-moodys-lost-decade/", "published": 1601640500.0, "headline": "How to Protect Your Retirement Portfolio After Moody's 'Lost Decade' Prediction", "body": "In Part one of this series, I explained how Moody’s was predicting a lost decade for stocks, due to its new baseline economic forecast that 10-year US treasury yields would rise to 4.1% by the end of 2030. If Moody’s is right, then stocks could potentially enter a multi-year bear market, similar to the 2000 to 2002 tech crash, which saw stocks fall for three consecutive years. That’s despite one of the strongest economic and labor market recoveries in US history (4% unemployment by mid-2022). What’s more sobering is the fact that Moody’s doesn’t believe that the S&P 500’s fundamentals will justify a higher level than 3,000…until the end of 2030. For context, as I write this the S&P 500 is at 3,355, indicating Moody’s baseline long-term forecast is expecting stocks to post a nearly 10% decline over the next decade. Including dividends, that means very modest gains of approximately 10%, or about 1% CAGR. Not entirely a “lost decade” but pretty darn close, especially compared to the almost 14% CAGR that stocks have delivered over the past 10 years. Why is Moody’s apparently so bearish on stocks, when its own economists are saying that GDP could recover pre-pandemic levels by the end of 2021 and unemployment could be back to 4.0% by mid-2022? The Terrifying Power Of The Equity Risk Premium 7 Best ETFs for the NEXT Bull MarketThe equity risk premium is just the earnings yield of the S&P 500 minus the risk-free 10-year US treasury yield. It represents the extra returns investors are supposed to get for taking on the risk of owning stocks, the most volatile (but best performing) asset class in history. The only thing more volatile than US large caps, as represented by the S&P 500, are emerging market stocks, which have 19% average annual volatility, compared to 15% for the S&P 500.In other words, in any given year, investors should be prepared for the stock market to fall by 15%. That happens to be the average intra-year peak decline in stocks since 1980. It’s also about equal to the average correction decline since 1945, which is 14%. (Source: Guggenheim Partners, Ned Davis Research) What’s the normal equity risk premium? according to UBS (also one of the 16 most accurate economists on earth): the five-year average risk premium is 3.8%. according to Goldman Sachs (also one of the 16 blue-chip economists), it’s averaged 3.7% since 2000 Over the past 20 years and just the last five, the equity risk premium has been relatively stable at 3.7% to 3.8%. What does that mean for fair value stock multiples if Moody’s is right about long-term interest rates rising not to 2% over the next 10 years (its previous forecast) but 4.1%? 10-Year Treasury Yield Historical Fair Value Earnings Yield (3.7% Risk Premium) Interest Rate Adjusted Fair Value Forward PE Historical Overvaluation Market Decline If 10-Year Yield Rises To 2.6% Market Decline If 10-Year Rises To 4.1% 4.1% (Moody’s 2030 Forecast) 7.8% 12.82 -22.0% 28.2% 43.3% 3.0% 6.7% 14.93 -9.2% 10.1% 34.0% 2.6% (CBO 2030 Forecast) 6.3% 15.87 -3.4% 3.5% 29.8% 2.5% (Blue-Chip Economist Consensus 2030 Forecast) 6.2% 16.13 -1.8% 1.9% 28.6% 2.0% (Moody’s Old 2030 Forecast) 5.7% 17.54 6.8% -6.3% 22.4% 1.5% 5.2% 19.23 17.0% -14.6% 14.9% 1.0% 4.7% 21.28 29.5% -22.8% 5.9% 0.5% 4.2% 23.81 44.9% -31.0% -5.4% 0.3% 4.0% 25.32 54.1% -35.1% -12.0% 0.1% 3.8% 26.32 60.2% -37.6% -16.4% 0.0% 3.7% 27.03 64.5% -39.2% -19.6% Over the past 10 years, including the era of Fed QE and debt-funded buybacks, the average PE for stocks was 17.0. Market-Determined Long-Term Fair Value For Stocks: About 17X Earnings (Source: F.A.S.T Graphs, FactSet Research) Over the last 10 to 20 years, when 90% to 91% of stock returns were a function of fundamentals, not sentiment or luck, the average PE for stocks was 16.5 to 17.5. That’s what the blue-chip economist consensus expects the S&P 500 to return to over the next decade. Moody’s? If they are correct, then the fair value for stocks COULD fall to 13, or nearly half of what it was at the market’s recent peak. How can you protect your portfolio from a potentially decade-long bear market? How To Protect Your Portfolio From The Lost Decade Moody’s Is Expecting First, it’s important to never panic over the prediction of any economist or analyst firm, even if they are one of the 16 most accurate in the world. After all, the blue-chip economist consensus is NOT predicting 4.1% 10-year yields, but just 2.5%. It’s also important to point out that forecasting long-term interest rates is notoriously difficult even for the most accurate economist teams and the greatest investors in history, such as Peter Lynch. This is why the best investors in history don’t tend to predict interest rates at all but just focus on the fundamentals. That means focusing on quality companies, with decent to strong long-term growth prospects that are trading at reasonable to attractive valuations. During the 2000s the tech bubble resulted in such absurd valuations (stocks were 66% historically overvalued) that combined with the Great Recession’s smashing earnings, stocks experienced a -0.9% CAGR return for an entire decade. (Source: F.A.S.T Graphs, FactSet Research) Remember how stock PEs averaged 16.5 to 17.5 over the last 10 to 20 years? Well, 10-year Treasury yields over that time period ranged from 0.5% to 5.5%. Historically, stocks are NOT hurt by rising interest rates…unless the 10-year yield goes above 5.0%, not 4.1%. That’s because for long-term rates to rise that high requires a very strong economy, and guess what benefits from a strong economy? Earnings, cash flow, and dividends, all things that directly determine intrinsic value, which is what stock prices always return to over time. Now, Moody’s is correct that the equity risk premium for tech stocks such as red hot darlings like Snowflake (SNOW), which recently traded at a price/SALES of as much as 175, are likely in trouble. Today SNOW trades at 132 times sales, not earnings, sales. It’s not actually profitable. During the height of the tech bubble the CEO of Sun Microsystems, one of Wall Street’s hottest tech darlings, actually called it crazy to pay 10X sales for a company. Today there are stocks on Wall Street that trade for 10X, 20X, 60X, and yes, 130X. These are the kind of speculative madness that can result in a catastrophic loss of capital that can kill your retirement dreams…if you let it. Today, Tesla (TSLA) trades at about 230X forward earnings, pricing in insane 27% CAGR growth for the next decade. For context, at the height of the tech mania in 2000 Cisco peaked at 132X earnings, and then delivered almost -2% CAGR total returns for the next 20 years. That’s despite growing 50% faster than the S&P 500 over that time. (Source: F.A.S.T Graphs, FactSet Research) So how do you protect yourself from the potential popping of tech bubble 2.0 that Moody’s considers its base case scenario? (Source: Imgflip) Simple, strive to be consistently not stupid just like Charlie Munger and Warren Buffett. Phoenix Portfolio Fundamentals The current yield on cost: 3.5% Current yield: 3.1% Morningstar long-term growth forecast: 13.1% CAGR Weighted average forward PE: 14.9 vs 16.9 historical norm vs 22.6 S&P 500 Average discount to fair value (Morningstar estimate): 12% 5-year total return potential: 3.1% yield + 13.1% CAGR long-term growth +2.6 % CAGR valuation boost = 18.8% CAGR vs 5.1% S&P 500 Risk-Adjusted Expected Return: 13.8% vs 3.8% CAGR S&P 500 (3.6X market’s expected return) Here are the fundamental stats of the Dividend Kings Phoenix portfolio: This is a dividend growth portfolio that combines the highest quality companies in the world, to generate relatively generous, very safe, and rapidly growing income over time. It’s likely to absolutely smash the market over time, because of superior quality, yield, growth, and of course, valuation. In fact, the PE of this portfolio is currently less than 15, the Graham/Dodd/Carnevale rule of thumb for “reasonable and prudent” long-term investments. That rule of thumb is based on 200 years of market historical returns, which are about 7% CAGR, and thus the recommendation to strive for an earnings yield of about 6.7% (a PE of 15). Actually, over the last 20 years, the average PE of that portfolio has been about 17X, basically the historical fair value for stocks. But the point is that the Dividend Kings Phoenix portfolio, which my retirement portfolio is mirroring exactly with 100% of my life savings, doesn’t have to worry about stock multiples contracting over the next few years, or even the next decade. Through a focus on quality first, and prudent valuation & risk management always, the probability of this portfolio experiencing a lost decade is 9% to 10%. While you can never achieve 100% certainty on Wall Street, achieving your long-term financial goals is all about high probability/low-risk decisions with your hard-earned savings. Needless to say, after reading Moody’s latest long-term forecast, I’m not losing any sleep over the prospects of a multi-year bear market beginning in 2021, or even a lost decade for the stock market. If that does happen, then I and Dividend Kings subscribers following along with my Daily Blue-Chip Deal Videos, will sleep well at night knowing that financial success is just a matter of time. Want More Great Investing Ideas? Do NOT Buy Stocks Before the Election! 7 “Safe-Haven” Dividend Stocks for Turbulent Times Chart of the Day- See Christian Tharp’s Stocks Ready to Breakout SPY shares were trading at $337.30 per share on Thursday afternoon, up $2.41 (+0.72%). Year-to-date, SPY has gained 6.30%, versus a % rise in the benchmark S&P 500 index during the same period."}]}