{"article": [{"url": "https://stocknews.com/news/pep-ko-coca-cola-vs-pepsico-which-stock-is-a-better-buy/", "published": 1601640500.0, "headline": "Coca-Cola vs. PepsiCo: Which Stock is a Better Buy?", "body": "The stock prices of two global leaders in the carbonated soft drinks (CSD) industry, PepsiCo, Inc. (PEP) and Coca-Cola Company (KO) remain well-off their pre-coronavirus levels. Naturally, the decline in dining and events has led the demand for soda to decline. While the revenue in the CDS segment is down 19.3% year-over-year in the United States, the market is expected to witness a CAGR of 6.2% between 2020 and 2025. So, both PEP and KO should witness significant growth in the years ahead especially as economies return to normal in the coming years. Both stocks have generated significant returns over the past five years. While PEP returned 73.2% over this period, KO gained 43.7%. In terms of year-to-date return or performance, PEP is a clear winner with a 5.3% return versus KO’s loss of 8.8%. But which of these non-alcoholic beverage giants is the better buy now? Let’s find out. 9 \"BUY THE DIP\" Growth Stocks For 2020Business Structure and Latest Movements With a market share of over $190 billion, PEP is one of the largest soft drink manufacturing companies in the world. The company’s product portfolio includes a wide range of foods and beverages with 23 brands in more than 200 countries around the world. PEP is also known for its snacks subsidiary Frito Lays, which is one of the most popular chips manufacturers across the globe. Recently, PEP and Vail Resorts have announced an expansion of their longstanding partnership to 18 additional Vail Resorts locations across North America, totaling 33 total resorts globally, to advance sustainability. PEP has also teamed up with Red Lobster to leverage its iconic food and beverage brands and create a variety of new menu items, starting with the DEW Garita, the first official MTN DEW cocktail. On the other hand, KO is a total beverage company that manufactures and markets various nonalcoholic beverages worldwide. The company offers over 500 brands in more than 200 countries and territories. The 134-year old company is constantly transforming its portfolio by reducing sugar in their drinks and bringing innovative new products to market as people are turning away from high-sugar beverages. The company recently expanded its presence in the hot-beverage market through its acquisition of Costa, a leading coffee company in the United Kingdom. The beverage giant is hoping a coffee-spiked Coke will restart sales growth in January 2021, as the company is introducing Coca-Cola with coffee in the thirsty U.S. market. KO has also entered into an exclusive agreement with Molson Coors Beverage Company (TAP) to manufacture, market, and distribute Topo Chico Hard Seltzer — an alcoholic beverage — in the United States. Latest Financial Results and Outlook PEP’s organic revenue for the fiscal third quarter ended June 2020 increased 4.2% year-over-year, reflecting continued strength in its global snacks and food business and a significant improvement in the global beverage business. Core constant currency EPS increased 9% year-over-year. The company expects full-year organic revenue to grow 4% and core EPS to decline by 0.5% to $5.50 year-over-year. Also, the company expects the cash return to shareholders to be approximately $7.5 billion for the full year. KO’s organic revenue for the second quarter ended in June 2020 declined 26%. This was primarily driven by pressure in away-from-home channels, which represent approximately half of the company’s revenues. Non-GAAP EPS declined 33% year-over-year to $0.42. Non-GAAP free cash flow declined 40% to $2.3 billion. The company expects a 3% to 4% currency headwind for full-year organic revenue. Here PEP is clearly in an advantageous position. Past and Expected Financial Performance PEP’s revenue and EPS grew at a CAGR of 2.4% and 1.3%, respectively, over the past 3 years. Also, the 3-year CAGR of the company’s total assets has been 5.2%. The market expects the company’s revenue to increase by 1.3% in the current year and 5% next year. PEP’s EPS is expected to grow 40.8% next year and at a rate of 5.5% per annum over the next five years. On the other hand, the CAGR for KO’s revenue was negative 4.1% over the past 3 years, but the EPS grew at a CAGR of 30.8% over this period. The CAGR of the company’s total assets has been 1.3% over the same period. The market expects KO’s revenue to decline by 12% in the current year but increase by 10.4% next year. The company’s EPS is expected to grow 14.4% next year and at a rate of 2.9% per annum over the next five years. PEP has an edge over KO here as well. Profitability PEP’s trailing-12-month revenue is almost two times what KO generates. But KO is the more profitable with a gross profit margin of 60% versus PEP’s 55.4%. However, PEP’s ROE and ROA of 51.81% and 7.92% compare favorably with KO’s 46.64% and 6.59%, respectively. Valuation In terms of forward P/E, PEP is currently trading at 25.64x, 5.6% less expensive than KO which is currently trading at 27.16x. PEP is also less expensive than KO in terms of trailing-12-month P/S (2.9x versus 6.14x). Moreover, PEP forward PEG of 4.43x is 49.6% lower than KO’s 8.79x. In terms of trailing-12-month price/cash flow as well, PEP’s 20.05x is 16.9% lower than KO’s 24.13x. So, PEP looks much cheaper compared to KO by all means. POWR Ratings It’s no surprise that PEP is rated “Strong Buy” in our proprietary POWR Ratings system while KO is a “Buy.” Here are how the four components of overall POWR Rating are graded for PEP and KO: PEP has straight “A”s for Trade Grade, Buy & Hold Grade and Peer Grade, and a “C” for Industry Rank. In the 29-stock Beverages industry, it is ranked #1. KO has a “B” for Trade Grade and Peer Grade, and a “C” for Buy & Hold Grade and Industry Rank. It is ranked #4 in the 29-stock Beverages industry. The Winner As the market has been extremely volatile lately because of the uncertainties related to the upcoming presidential election, the ability of medical science to contain the spread of the deadly virus, and the increasing geopolitical tensions, investing in companies like PEP and KO such, which have a huge market valuation and goodwill in the industry, can help investors secure their finances. Also, both PEP and KO pay solid dividends, ensuring a steady income for investors amid this market volatility. While both PEP and KO are good long-term investments, PEP appears to be a better buy based on the factors discussed here. Want More Great Investing Ideas? Do NOT Buy Stocks Before the Election! 7 “Safe-Haven” Dividend Stocks for Turbulent Times Chart of the Day- See Christian Tharp’s Stocks Ready to Breakout PEP shares were trading at $138.08 per share on Friday afternoon, down $2.72 (-1.93%). Year-to-date, PEP has gained 3.24%, versus a 5.51% rise in the benchmark S&P 500 index during the same period."}]}