{"article": [{"url": "https://stocknews.com/news/clr-rrc-kmi-3-turnaround-plays-in-the-energy-sector/", "published": 1595592500.0, "headline": "3 TURNAROUND Plays in the Energy Sector", "body": "There’s a subtle change going on under the surface in the stock market over the last couple of weeks. Tech stocks made a lower high and are now selling-off, while underperforming parts of the market like energy, small-caps, and emerging markets are starting to outperform. To be clear, it’s far from certain whether this is temporary or the beginning of a trend change. However, If it’s a trend change, then huge profits await early-buyers. And, it’s not entirely crazy to think that a bull market in energy is beginning. For one, the sector has been out of favor for years. Oil’s front-month contract dipping into negative territory and the media hysteria it generated may have marked maximum bearishness, in the same way, that headlines about “peak oil” coincided with its top in 2008. 7 \"SAFE HAVEN\" Dividend Stocks for Turbulent TimesIt’s also interesting to note that energy stocks made a higher low, while oil made a lower low. A similar thing happened in February 2016 during oil’s last major bottom, when energy stocks made a higher low, while oil made a lower low. Fundamentally, supply has been cut as has investments into new projects. On a book value basis, oil stocks are trading at half of their historical values. Every so often being a contrarian leads to massive profits. Right now, contrarians should take a look at energy stocks. Range Resources (RRC), Kinder Morgan (KMI), and Continental Resources (CLR) are three turnaround plays in the sector: Continental Resources (CLR) CLR is one of the best-positioned stocks to gain from an increase in oil prices since it doesn’t hedge its exposure. This gives it a considerable amount of leverage on the upside and downside. Since the coronavirus, the company has reduced production and focused on conserving cash. It’s in a strong position due to these steps. Total liabilities are valued at 57% of assets which means there’s no risk of bankruptcy. CLR is one of the lowest-cost producers in the world at $8 per barrel. This means that it remains profitable even at today’s prices, but it’s choosing to reduce production because it expects prices to be meaningfully higher in 12 months. During this period, insiders are buying the stock in massive quantities which signals that they have confidence in this plan. Range Resources (RRC) RRC is a leading, low-cost producer of natural gas. It has the highest-quality deposits in the Marcellus region which puts it in close proximity to the Northeast, where demand is the greatest. In the coming years, demand for natural gas is expected to increase with the retirement of coal and nuclear reactors. In the last decade, natural gas has gone from 21% of power generation to 38%. In the next decade, it’s expected to cross 50% due to its low-rate of emissions. Over the last decade despite increasing demand, natural gas prices remained low. The major factor was drilling for oil in the shale patch. Natural gas was a byproduct which meant that supply wasn’t sensitive to lower prices. However, this is changing as one casualty of the coronavirus and oil’s bear market has been shale oil projects. Investing in new shale, oil projects only make sense when there is confidence that the price of oil will stay over $70. This means that no new projects are being planned which will result in lower natural gas production. Another reason to expect lower supply is Democrats winning control of the Presidency and Senate which would result in restrictions on new fracking projects. RRC is rated a Buy by the POWR Ratings. It has a “B” for Trade Grade and an “A” for Peer Grade. Among Oil & Gas stocks, it’s ranked #2 out of 96. Kinder Morgan (KMI) KMI is an energy infrastructure stock. It operates natural gas and energy product pipelines in addition to terminals. Increasing demand, use, and prices for natural gas and energy will be a positive catalyst for KMI’s share price. KMI also has a healthy dividend yield above 7%. It has a forward price to earnings of 15.5. On a longer-term chart, the stock seems to be putting in a double bottom. Recently, Warren Buffett made an investment into natural gas infrastructure, when he purchased natural gas pipelines from Dominion (D) energy. This is a vote of confidence that the industry conditions for the sector are going to improve. Want More Great Investing Ideas? 9 “BUY THE DIP” Growth Stocks for 2020 Newly REVISED 2020 Stock Market Outlook 7 “Safe-Haven” Dividend Stocks for Turbulent Times CLR shares rose $0.03 (+0.17%) in after-hours trading Friday. Year-to-date, CLR has declined -49.71%, versus a 0.61% rise in the benchmark S&P 500 index during the same period."}]}