{"article": [{"url": "https://stocknews.com/news/sq-v-pypl-cash-bans-are-coming-3-stocks-driving-the-trend/", "published": 1594642100.0, "headline": "Cash Bans are Coming: 3 Stocks Driving The Trend", "body": "Before the pandemic, the U.S. was already on a path to becoming a cashless society. Each year, more and more Americans come to rely solely on credit cards or smartphones to make payments. But, there is always that one place: the small store that is “cash only,” the gas station that charges less if you pay in cash, or the eclectic food truck with awesome tacos, that definitely doesn’t take cards. These exceptions to the increasingly cashless world ensured that I always carried around at least a few twenties, just in case. No more. The pandemic has very rapidly accelerated the move to “contactless delivery,” “cashless” stores, and an aversion—by anyone concerned with catching the virus—to touching bills and coins that may be a transmission mechanism for COVID-19. 7 Best ETFs for the NEXT Bull MarketCompanies that were literally built for contactless delivery, and digital movement of currency, are prospering. This transition has also been a boon for certain other companies, but it is causing issues—some expected and others unexpected—for other companies across the country. Additionally, low-income individuals who do not have access to digital banking are not faring as well. In response, some major cities, including Los Angeles and New York City, are even going as far as making it illegal for businesses to not accept paper money. The move to cashless has also disrupted our money supply. The Federal Reserve has cut back on coin production in an effort to maintain the safety of its workers. And, as people spend less paper money and coins, retailers that take cash are having trouble getting access to coins, and in some cases demanding exact change only. Square (SQ) Square (SQ) is one of the companies seeing a surge in business as more and more transactions move to digital. Square, which was created as a replacement for the cash register at small businesses, was originally designed as a point of sale system. The company recently received an upgrade from Sun Trust with a $150 price target. This after the company had already seen multiple rating raises from a variety of brokerage analysts to the $120-$130 range. Square technology allows small businesses to take payment in the form of credit cards or smartphone payments. Even businesses doing under $10K in revenue can get a Square reader and accept credit cards at craft shows or one off pop-up events. But, SQ stock has not been rising rapidly only because of the original Square technology. A new app, Cash App, is driving growth at the company, and has Wall Street aglow. The app, which has grown from 7 million users at the end of 2017 to almost 24 million users today, allows you to transfer funds seamlessly from individual to individual, or to a business to pay for a service or good. The Cash App is easy to set up and use, and has caught on with millennials and younger users who use the app for everything from online shopping to paying for their friend’s coffee. In Q1, the Cash App generated $528 million in revenue for Square, a 197% year-over-year increase. It is safe to say Square is “squarely” in the middle of the new cashless society, and the stock likely has more room to run. Visa (V) Another company benefiting from the acceleration of the cashless trend is Visa (V). Visa, as the New York Times reports, is benefiting from the promotion of cashless payments as “governments from India to Kenya to Sweden, as well as the United Nations, are promoting cashless payments in the name of public health.” Not only is Visa benefitting from an increased number of payments being processed, but from new regulations that have raised the cap on contactless payments. Originally, shoppers in Europe had to enter their pin number for purchases over 20 euros. But, to address COVID-19 that cap has been raised to 50 euros, increasing purchases easily made using contactless payments. In its recent first quarter report, Visa beat on both earnings per share—coming in at $1.39, higher than estimates of $1.35—and revenue, which was $5.58 billion versus an estimate for $5.75 billion. And, this was as the company reported that “underlying business drivers slowed” due to COVID-19. Paypal (PYPL) Finally, Paypal (PYPL) stock has been on a major run recently, from the low $80s in March, to over $180 today, as the company has been a big beneficiary of digital payments. Pre-COVID-19, many small businesses attempted to dodge the 3-4% fees imposed by digital payments by imposing minimum purchase amounts in order to use credit. These companies, which just a few years ago could see 10% of payments in the form of credit cards, are now seeing digital payments breach the 80% level. Such a groundswell in digital is nearly impossible to fight, and plays directly to the strength of a company like Paypal. Dan Shulman, Paypal CEO, recently said about the pandemic, “[N]ow it’s morphing into a psychological crisis as well. People are redefining how they think about things they used to do every day, thinking about what the new normal is going to look like. This is resulting in an immense shift from physical to digital.” In its most recent quarter, Paypal reported revenue of $4.96 billion, up 17% year-over-year. Want More Great Investing Ideas? Top Dividend Stock to Own! Download Free Report Today Buy These 3 High-Yield Dividend Stocks All Under $15 Buy and Hold These 3 Dividend Stocks Forever SQ shares fell $0.20 (-0.17%) in after-hours trading Monday. Year-to-date, SQ has gained 90.27%, versus a -1.17% rise in the benchmark S&P 500 index during the same period."}]}