{"article": [{"url": "https://stocknews.com/news/khc-mkc-cag-gis-frpt-5-top-performing-consumer-goods-stocks/", "published": 1595506100.0, "headline": "5 TOP Performing Consumer Goods Stocks", "body": "Consumer Goods companies sell products purchased by individuals and households rather than by manufacturers and industries. This sector has thrived during the past 5 months as the coronavirus pandemic has caused people to spend significantly more time at home. Instead of going to restaurants people are cooking more in their own kitchens. Instead of going to bars, they are drinking beers and wine in their backyards. And because of the virus, home-cleaning products have been flying off the shelves. So it’s not surprising that the largest consumer goods ETF, the Consumer Discretionary Select Sector SPDR (XLY), is up about 7% year-to-date (YTD), compared to the S&P 500 that is flat on the year. 9 \"BUY THE DIP\" Growth Stocks For 2020Here are five consumer goods stocks that have outperformed in 2020 and should continue to perform well as the Covid-19 crisis continues to drag on: The Kraft Heinz Company (KHC) KHC is one of the leading food and beverage companies with a diverse portfolio of iconic and emerging brands. KHC has been focused on growing its business across all segments by investing in product development and its e-commerce platform. The company has also been undertaking measures to augment efficiency in supply chain management and control costs. The higher pricing in the United States and international segments has increased KHC’s overall pricing 1.6% year-over-year in the first quarter. However, net sales were up 3.3% and operating income increased 37.1% year over year. KHC currently pays an annual dividend of $1.60 per share, which yields 4.58% based on its current price. While the company cut its quarterly dividend in 2019, the current dividend yield is attractive for income investors. The company should be able to sustain the current dividend level, as it has been witnessing continued growth in free cash flow. Moreover, KHC has an impressive earnings surprise history with the company beating consensus EPS estimate in each of the trailing four quarters. Moreover, the consensus revenue estimate for the quarter ended June indicated an increase of 1.7% year over year. KHC has been showing a bullish trend and is up by more than 70% from its March lows. How does KHC stack up for the POWR Ratings? A for Trade Grade A for Buy & Hold Grade A for Peer Grade B for Industry Rank A for Overall POWR Rating You can’t ask for better. The stock is also ranked #1 out of 56 stocks in the Food Makers industry General Mills, Inc. (GIS) GIS continues to meet short-term opportunities by matching elevated demand and has plans for long-term growth which involves investments in innovation, strategic capabilities and brand development. The increased demand for at-home food and the pet-segment products in the form of stock-up purchase has driven GIS’s net sales growth in the last reported quarter. During the Covid-19 pandemic, the company’s manufacturing and distribution facilities worked without any hindrance and accelerated its agility to meet the rise in demand for its products. GIS is focused on maintaining strong service levels and has been utilizing its website to fuel e-commerce sales. For fiscal 2021, GIS aims to increase brand penetration, strengthen customer partnerships, gain market share and reduce its leverage for a better financial position. GIS has refinanced its short-term debt to remain prepared for any liquidity crisis. In the fourth fiscal quarter ended May 31st, net sales increased 21% and operating profit increased 16% year over year. GIS has an impressive earnings surprise history with the company beating consensus estimates in each of the trailing four quarters. The consensus EPS estimate of $0.87 for the quarter ended August 2020 indicates a year-over-year increase of 10.1%. The revenue estimate of $4.19 billion also indicates an increase of 4.7% over the year-ago quarter. Since its March lows, GIS has grown by more than 20% GIS’s strong financials are reflected in its POWR Ratings, it has a “Strong Buy” rating with an “A” in Trade Grade, Buy & Hold Grade, Peer Grade, and an “B” in Industry Rank. Within the Food Makers group, it’s ranked #2 out of 56 stocks. McCormick & Company, Incorporated (MKC) MKC is an American Fortune1000 food company that manufactures condiments, flavorful products, seasonal mixes and spices. MKC leads the global flavor market with a differentiated flavor portfolio which is delivered across all channels. Although the flavor segment was adversely affected due to more consumers cooking at home, its consumer segment performed well due to higher demand. Although, the stock price has spiraled down over the past few years, this year could be a turning point for MKC due to the increased demand for its products in the “new normal.” In the second quarter ended May 31st, MKC’s sales increased 8%, operating income was up 24% and adjusted earnings per share rose 27% year over year. The company also generated a strong cash flow. The year-to-date net cash provided for operating activities was $356 million at the end of the second quarter as compared to $314 million in the previous year. In fiscal 2019, the company recorded the eighth consecutive year of record cash flow from operations and the 34th consecutive year of dividend increase. The company pays an annual dividend of $2.48 per share, which yields 1.31% based on its current price. The consensus estimates for MKC’s earnings and revenue for the quarter ended August 2020 indicate improvement over the year-ago quarter. Also, it’s impressive to note that the company beat consensus ESP estimates in each of the trailing four quarters. MKC’s POWR Ratings reflect a promising outlook. It has an overall rating of “Strong Buy” with an “A” for Trade, Buy & Hold and Peer Grade and a “B” for Industry Rank. Among the 56 stocks in the Food Makers group, it’s ranked #4. ConAgra Brands, Inc. (CAG) CAG offers branded food products and operates in three segments — commercial foods, consumer foods and private brands. CAG recently announced that more than twenty-four new products will be launched in the summer which involves new meal options for various diet choices, new plant-based meals and new snack options to meet evolving consumer tastes. Since its lows in March due to the coronavirus led market crash, CAG has gained more than 50%. CAG’s earnings surprise history is impressive, with the company surpassing consensus EPS estimates in three of the trailing four quarters. The market also expects the company to report EPS of $0.57 for the current quarter, representing a 32.6% improvement over the year-ago number. Moreover, CAG’s consensus revenue estimate of $2.61 billion for the current quarter indicates a year-over-year increase of 9.1%. In the fourth quarter ended May 31st, net sales increased 25.8% year-over-year which was driven by a surge in at-home consumption and e-commerce growth. Earnings per share from continuing operations grew 57.7% and gross profit increased 30.3% year over year. WPM is rated “Strong Buy” in our POWR Ratings system, consistent with the increased at-home food consumption during this period. It also has an “A” for Trade Grade, Buy & Hold Grade and Peer Grade, and a “B” in Industry Rank. It is also ranked #6 out of 56 stocks in the Food Makers industry. Freshpet, Inc. (FRPT) FRPT manufactures and sells fresh fruits, vegetables, meat and refrigerated meals for cats and dogs. The stock has been rising since hitting its March lows and has gained more than 70% so far. FRPT’s EPS is expected to grow 82.4% per annum in the next five years. The consensus EPS estimate for the quarter ended June 2020 is negative $0.06 which indicates a 62.5% year-over-year improvement. In the first quarter, net sales increased 27.9% and adjusted EBITDA increased 106.1% year over year. FRPT’s price to trailing twelve month operating cash flow is currently 196.8, higher than 98.31% of US stocks with positive operating cash flow. It’s no surprise that FRPT is rated “Strong Buy” in our POWR Ratings system. It also has an “A” for Trade Grade, Buy & Hold Grade and Peer Grade, and a “B” for Industry Rank. In the 56-stock Food Makers industry, it is ranked #9. View them all below. Also enjoy these other timely investment resources from StockNews.com: Want More Great Investing Ideas? 9 “BUY THE DIP” Growth Stocks for 2020 Newly REVISED 2020 Stock Market Outlook 7 “Safe-Haven” Dividend Stocks for Turbulent Times KHC shares were unchanged in after-hours trading Thursday. Year-to-date, KHC has gained 11.80%, versus a 1.38% rise in the benchmark S&P 500 index during the same period."}]}