{"article": [{"url": "https://stocknews.com/news/goog-googl-edit-amwl-onem-4-modern-healthcare-stocks-google-is-investing-in/", "published": 1602245300.0, "headline": "4 Modern Healthcare Stocks Google is Investing In", "body": "Google (GOOG) is one of the most successful and innovative companies in the world. It’s core product – Google Search – is a money-printing machine and accounts for the bulk of the company’s profits. Last year, it earned $31 billion in profits, and it’s used these proceeds to build businesses in adjacent areas and invest in other promising companies. Google’s Search business also gives it unusual insight into the world and human behavior. Search volume around a subject can be a leading indicator of trends. For example, it can foreshadow when a politician is rising in the polls or predict what areas are likely to experience coronavirus outbreaks based on increased search volume around these subjects. 7 Best ETFs for the NEXT Bull MarketGoogle’s venture division is one way it’s leveraging these insights by investing in upcoming companies. So, investors should pay close attention to the moves they are making. In recent years, Google has been heavily investing in healthcare companies. American Well Corp. (AMWL), 1Life Healthcare (ONEM), Editas Medicine (EDIT), and Clover Health (IPOC) are four companies that Google invested in that have further upside. Opportunities in Healthcare Before examining these individual companies, it’s interesting to consider why Google’s venture investments have been so heavily geared towards healthcare given that Google is a tech company. According to Google, 7% of searches are related to healthcare which means that every minute, there are 70,000 healthcare-related inquiries on its platform. So far, Google has invested in 57 healthcare companies, and they account for a third of its venture portfolio. Google’s interest also makes sense in terms of demographics as the US population is getting older and living longer. This means the demand for healthcare will continue rising at a faster rate than overall economic growth. For Google, there are also synergies with its Search and Cloud businesses. It’s looking to partner with EHR providers to use Google Search to help them find data. And, it wants Google Cloud to be the cloud platform of choice for storing and organizing healthcare records. American Well Corp. (AMWL) The rising cost of healthcare means that there will also be a need for companies that can create greater efficiencies in terms of cost-savings and better health outcomes. A part of the solution is telehealth which can help doctors see more patients. It’s also a more convenient option for patients, saving them time, especially when it comes to less serious issues. Telehealth platforms also lead to more frequent contact between doctors and patients which also correlates to better health outcomes. AMWL is the second-leading telehealth company in the US. The coronavirus led to a sharp increase in telehealth visits since so many doctors’ offices were closed. Additionally, patients were minimizing visits to reduce exposure to the virus. Average daily visits in AMWL’s last quarter were 45,000 versus 2,000 per day in 2019. Further, telehealth has been very successful with 76% of patients reporting that they will keep using it even after the pandemic. It also is following the same pattern as other growth industries like fintech and eCommerce which were growing fast before the pandemic but experienced a massive acceleration due to the conditions. In its last quarter, AMWL’s revenue grew 94% compared to the previous year. Google has invested $100 million into the company, and it retains a 3% stake. As part of the investment, AMWL is using Google Cloud. Clover Health (IPOC) Clover Health is a health insurance startup. It’s attracted significant venture investment from Google Ventures, Sequoia Capital, and First Round Capital. It differentiates itself by collecting and analyzing health and behavioral data to lower costs and improve outcomes. This week, Chamath Palihapitiya announced that he is taking Clover Health public through a SPAC which values the company at $3.7 billion. In an interview, Palihapitiya said, “What we have is a business that’s delivering the promise of technology-improving, better outcomes, and lower-cost health care…a market that I think is huge and growing quickly”. He added that he expects Clover Health to become profitable in 2023 and expects it to continue growing market share. Clover Health sells Medicare Advantage in seven states and has 57,000 members. The company will raise $1.2 billion in cash and will use the proceeds to invest in growth and offer more services to seniors. Google has invested in several insurance startups that are using technology such as Collective Health, Oscar Health, and Lemonade. to providers including Oscar Health. Google’s investment in Clover was at a $1.2 billion valuation, so it has a hefty profit on the position. Editas Medicine (EDIT) EDIT is a gene-editing company. Gene-editing stocks have been strong performers over the last couple of years as they have significant potential in screening early drug candidates. There is also a lot of excitement about future applications, like removing cells, changing them at a chromosomal level, and then reinjecting them into patients. Even further down the road, scientists believe that they will be able to edit cells without having to remove them. This could have major implications in terms of treating all types of diseases by targeting them at the cellular level. It also could result in lengthening lifespans and improving the quality of life by repairing damaged cells. Google originally invested in the company in 2015 along with other luminaries like Bill Gates, Khosla Ventures, and Cowen Private Investments which valued the company at $100 million. Currently, EDIT has a valuation of $2 billion. EDIT’s core product is its gene-editing platform that can be used for multiple diseases. It developed a CRISPR-Cas9 which is a protein that can turn on or off disease-causing genes. It’s considered more precise with fewer side effects than other similar treatments. 1Life Healthcare (ONEM) ONEM went public in January. Since then, its stock is just over 100% higher. The company has an innovative model in which patients pay an annual fee of $199 per year to get access to ONEM’s physicians and services. Customers can text their doctors at any time, schedule same-day appointments, and get access to a digital platform with patients’ complete health records. 1Life believes that improving primary care and fostering more communication between patients and doctors will lead to better outcomes. It also believes that people are willing to pay for convenience. The platform also appeals to physicians who are often inundated with paperwork and dealing with insurance rather than tending to patients. 1Life offers the opportunity for doctors to focus on their patients rather than other responsibilities. The company is gaining traction. In its last quarter, it increased its membership count to 475,000 which is a 25% increase compared to last year. Net revenue increased to $78 million which is an 18% increase. It’s also expanding into new markets and adding new partners. Currently, 1Life is focused on adding patients and doctors to its platform, but it believes that it will be able to offer higher-value-added services in the future like constant-monitoring devices, smart scales, and other resources that will lead to doctors being able to monitor patients’ health more vigorously. Currently, it estimates it’s a market opportunity to be $34 billion to offer “concierge-level healthcare” but expects this to expand to $81 billion over the next five years. Conclusion GOOG has built a broad portfolio of investments in various healthcare companies. Through these investments, it has exposure to nearly every facet of healthcare. Despite these companies going public and increasing in value, Google continues to retain a stake in them. Investors, interested in healthcare, should consider adding them to their portfolios. Want More Great Investing Ideas? 7 Best ETFs for the NEXT Bull Market What is the Cure for Stock Market Volatility? Chart of the Day- See Christian Tharp’s Stocks Ready to Breakout GOOG shares were trading at $1,504.89 per share on Friday afternoon, up $18.96 (+1.28%). Year-to-date, GOOG has gained 12.56%, versus a 9.12% rise in the benchmark S&P 500 index during the same period."}]}