{"article": [{"url": "https://stocknews.com/news/nvda-coup-2-tech-stocks-with-fast-earnings-growth/", "published": 1598530100.0, "headline": "2 Tech Stocks With FAST Earnings Growth", "body": "We’ve seen an incredible recovery from the mid-March lows for the Nasdaq Composite (QQQ), with the index now up nearly 80% in 110 trading days, which is the 3rd strongest rally in the past thirty years. This incredible rally is only behind the near 90% rallies we saw in 100 trading days in Q4 1998 through Q1 1999 and Q4 1999 through Q1 2000, suggesting that the market might be running out of gas here. However, in a low-interest-rate environment with tech companies being the least affected by COVID-19, any sharp pullbacks of 13% or more are likely to be buying opportunities. Therefore, this is the best time to build a shopping list of the highest-growth names to prepare, in case we see some weakness over the coming weeks. There are several names to choose from, but two stand-out names are Coupa Software (COUP) and Nvidia (NVDA), who have industry-leading earnings growth and a dominant position in their industries. Let’s take a closer look below: 9 \"BUY THE DIP\" Growth Stocks For 2020 (Source: TC2000.com) While Nvidia and Coupa Software are both from different industries and don’t have much in common, they share one common trait that the top growth stocks of the past half-century all have, and that’s powerful earnings growth. Since 1950, the top-performing stocks each year were those consistently grew annual EPS by 17% or more each year, with strong sales growth. When it comes to COUP and NVDA, they both fit this bill, and their double-digit sales growth suggests that annual earnings per share [EPS] estimates for FY2021 might be on the conservative side. While this doesn’t mean that both stocks have to head higher from current levels, it does suggest that they’re great candidates for buying the dip. Beginning with Coupa Software, the company is a leader in the Business Spend Management Software space, which helps organizations to get the best bang for their buck using Coupa’s intuitive cloud-based platform. The company believes it has a massive TAM of over $50 billion. To date, the company has barely scratched the surface on even 10% of this total TAM, with trailing-twelve-month revenue of $425 million. However, the company is quickly emerging as the leader in the space, and funds seem to be rushing to start positions, with fund ownership up from 634 funds in Q1 to 840 funds as of the most recent filing. Given the company’s consistent 40% revenue growth rates, the demand for Coupa shares isn’t overly surprising. (Source: YCharts.com, Author’s Chart) As we can see in the chart above, the company has a solid earnings trend, as annual EPS finally flipped positive in FY2019, and grew by an incredible 188% last year ($0.52 vs. $0.18). While some investors are spooked by annual EPS taking a rest this year, it’s important to note that a pause is not out of the ordinary after a year of high triple-digit growth, and the decline year-over-year is merely an aberration in the overall trend. This is because FY2021 annual EPS estimates are currently sitting at $0.70, a new all-time high for Coupa. Therefore, while it’s not ideal to see a down year for earnings, the 66% growth rate in annual EPS more than offsets this. So, why not pay up for the stock here? Unfortunately, while Coupa has incredible growth and one of the top-100 revenue growth rates in the US Market, the stock is ahead of itself short-term as it’s up 120% year-to-date. This means that new purchases above $320.00 carry elevated risk and are probably not a good idea. However, if we were to see the stock come down near its weekly moving average (white line), I believe this would be a low-risk area to start a position. This would allow the stock’s valuation to cool off a little and reset the current overbought condition. (Source: TC2000.com) Moving over to Nvidia (NVDA), the stock has had an incredible year as well, up over 100% year-to-date. The catalyst for this outstanding performance has been material acceleration in sales growth, with NVDA’s revenue growth rate jumping by 1100 basis points sequentially, from 39% to 50%. As we can see below, this pushed the two-quarter average revenue growth rate to 44.5%, which marked a new 2-year high for this metric. While the company was undoubtedly up against relatively easy year-over-year comps and the Mellanox acquisition helped, we saw outstanding performance across the board, with gaming revenues up 26% year-over-year, and consumer spending on video games should be a tailwind until we have a resolution to COVID-19. (Source: YCharts.com, Author’s Chart) If we look at the company’s earnings trend below, we saw a significant decline in FY2020 ($5.79 vs. $6.64), but the drop in annual EPS was coming after a year of substantial growth. Fortunately, like Coupa, Nvidia’s annual EPS is expected to bounce back in a big way, with FY2021 annual EPS estimates currently sitting at $9.25. Assuming the company can meet this figure, this would translate to 60% year-over-year growth in yearly EPS, a growth rate that most mid-cap companies struggle to attain, let alone a mega-cap like Nvidia. Therefore, while Nvidia might look expensive at 86x FY2020 earnings, this is a stale figure given the growth we see next year. If we calculate using FY2021 annual EPS, Nvidia is trading at just over 50x forward earnings, a more than reasonable figure for a company growing at Nvidia’s pace. (Source: YCharts.com, Author’s Chart) So, what’s the best course of action? While Nvidia has incredible growth, even great companies should be bought on weakness, not when they’re up 180% in less than six months. Therefore, while I see Nvidia as a Hold here for long-term investors, I believe the best entry would be on a pullback towards the $429.00 level. Assuming we could get a pullback of this size, this would significantly improve the valuation to closer to 45x earnings and completely reset the current weekly overbought condition. While there’s no guarantee a pullback of this size shows up, this is the area I have marked down to add exposure. Currently, I am long NVDA from $284.00, but I have no plans to add here. While many stocks are extended with sub-par fundamentals, Nvidia and Coupa are two names that, while extended, likely have large runways ahead. Therefore, for investors eager to get into the market, I believe these are two names worth watching if we can see sharp pullbacks to improve their valuations. It is possible that buying at these levels could work, but I see no real margin of safety here, so I remain on the sidelines for now. However, if NVDA pulls back to $429.00 and COUP to $255.00, these would be compelling areas to start a small position in each stock. Disclosure: I am long NVDA Disclaimer: Taylor Dart is not a Registered Investment Advisor or Financial Planner. This writing is for informational purposes only. It does not constitute an offer to sell, a solicitation to buy, or a recommendation regarding any securities transaction. The information contained in this writing should not be construed as financial or investment advice on any subject matter. Taylor Dart expressly disclaims all liability in respect to actions taken based on any or all of the information on this writing. Want More Great Investing Ideas? 7 Best ETFs for the NEXT Bull Market Why Stocks Could Drop 20% in September? 9 “BUY THE DIP” Growth Stocks for 2020 a NVDA shares were trading at $507.84 per share on Thursday afternoon, down $3.08 (-0.60%). Year-to-date, NVDA has gained 116.05%, versus a 9.55% rise in the benchmark S&P 500 index during the same period."}]}