{"article": [{"url": "https://stocknews.com/news/apha-will-aphrias-new-supply-agreement-spark-a-rally/", "published": 1596715700.0, "headline": "Will Aphria's New Supply Agreement Spark a Rally?", "body": "This week Aphria (APHA) signed an agreement with Israeli leader Canndoc to provide access to Israel’s largest drugstore chain. Products will be co-branded under APHA and Canndoc brands and distributed throughout Israel. The agreement states that APHA will supply Canndoc with dried bulk flower over a two-year period. The companies will have the option to extend for two additional terms of two years each, and an option for an additional year after that. Aphria’s CEO Irwin D Simon said, “We are excited about our strategic partnership with Canndoc, a well-established Israeli leader, and the opportunity to continue to expand our medical cannabis brand internationally. Today’s announcement is about more than a supply agreement. It’s about the strength and quality of our medical brand, Aphria, being continuously validated by the world’s medical cannabis markets, including countries in which we have no distribution today. The Agreement represents a significant step for Aphria, and we look forward to bringing our high-quality medical cannabis products to patients in Israel.” 7 \"SAFE HAVEN\" Dividend Stocks for Turbulent TimesEhud Barak, former Israeli Prime Minister and Chairman of the Canndoc Board of Directors said, “We are proud to partner with Aphria, a global leader who shares with us the same quality values and commitments of meeting patients’ needs and improving their quality of life. This is another vote of confidence in Canndoc’s leadership and the Israeli market.” The partnership also provides a possibility of the two companies collaborating on research initiatives such as clinical trials focused on the use of medical cannabis with leading hospitals and research institutions in Israel and exploring potential collaboration in the EU market. I am pleased to see APHA continue to expand into international markets, and remain bullish on the company. I favor a business model that delivers results in the form of profits, as they’ve done in many previous quarters (minus the most recent) and then focus on expansion and further revenue growth. Disclosure: The author is long APHA Want More Great Investing Ideas? 9 “BUY THE DIP” Growth Stocks for 2020 How to Trade THIS Stock Bubble? 7 “Safe-Haven” Dividend Stocks for Turbulent Times APHA shares were trading at $4.68 per share on Thursday morning, down $0.13 (-2.70%). Year-to-date, APHA has declined -10.34%, versus a 4.07% rise in the benchmark S&P 500 index during the same period."}]}