{"article": [{"url": "https://stocknews.com/news/msft-baba-plug-apps-4-high-growth-stocks-to-scoop-up-at-a-discount/", "published": 1601640500.0, "headline": "4 High-Growth Stocks to SCOOP UP at a Discount", "body": "Growth stocks, mostly the tech players, have been a major contributor to the strong recovery of the market after the March crash. These are companies that increase their revenue and earnings at a faster rate than the market average. Hence, they often trade at premium valuations. In fact, it makes sense to many investors to pay this premium considering their future growth potential that can help them beat the market. Growth stocks have historically outperformed value stocks as well as the broader market. In the last five years, the SPDR Series Trust SPDR Portfolio S&P 500 Growth ETF (SPYG) has gained 128.8%. In comparison, the SPDR Series Trust SPDR Portfolio S&P 500 Value ETF (SPYV) grew merely 50% and the SPDR S&P 500 ETF (SPY) has returned 90.7% over the same time period. So, if you can get high-potential growth stocks at a discount due to headwinds that are temporary in nature, that’s probably an opportunity you should not miss. This is perhaps that time, as the market witnessed a massive correction last month, leading some solid growth stocks to trade at a discount. 7 Best ETFs for the NEXT Bull MarketHere are four high-growth stocks that are currently trading at a discount: Microsoft Corporation (MSFT), Alibaba Group Holding Limited (BABA), Plug Power Inc. (PLUG), and Digital Turbine, Inc. (APPS). Microsoft Corporation (MSFT) MSFT develops, licenses, and supports software, services, devices, and solutions, enabling companies with digital transformation in the era of cloud computing. It operates through three segments – Productivity and Business Processes, Intelligent Cloud and More Personal Computing. MSFT is on a strategic expansion spree. It has extended a long-standing partnership with Telstra, Australia’s leading telecommunications and technology company, to focus on accelerating the development and release of innovative and sustainable cloud-based solutions combined with 5G. MSFT has also acquired ZeniMax Media and its game publisher Bethesda Softworks to accelerate growth in its gaming business. Over the past three years, MSFT’s top-line grew at a CAGR of 14%. For the most recent fiscal fourth quarter that ended June 2020, revenue grew 13% year-over-year to $38 billion. The Intelligent Cloud segment revenue witnessed a 17% increase year-over-year, primarily driven by server products and cloud services amid the pandemic. The More Personal Computing segment and the Productivity and Business Processes also witnessed a year-over-year growth of 14% and 6%, respectively. MSFT reported an EPS of $5.76 for the fiscal year 2019, growing 13.8% year-over-year. In the last three years, the company has grown its net income at an average rate of 20.2% per year. For the last reported quarter, MSFT’s EPS came in at $1.46, beating the street estimate by 9%. Moreover, the company has beaten EPS estimates in each of the trailing four quarters. This massive acceleration in business and continued dominant positions in cloud computing allowed the stock to reach fresh highs. The street expects current year revenue to rise 8% from the year-ago value. The consensus EPS for the current quarter is anticipated to grow 11.6% year-over-year to $1.54. MSFT commands a trailing P/E ratio of 36.52 compared to the sector’s median P/E ratio of 33.62, indicating that the company is outperforming the industry. The stock closed yesterday’s trading session at $212.46, gaining nearly 39% in the past six months. It is currently trading just 9% below its all-time high of $232.86. How does MSFT stack up for the POWR Ratings? B for Trade Grade B for Buy & Hold Grade B for Peer Grade B for Industry Rank B for Overall POWR Rating. It is ranked #21 out of 96 stocks in the Software – Application industry. Alibaba Group Holding Limited (BABA) BABA operates as an online and mobile commerce company in China, providing internet infrastructure, e-commerce, online financial, and internet content services. It has operations in four primary segments – Core Commerce, Cloud Computing, Digital Media and Entertainment, Innovation Initiative, and others. BABA owns and manages both wholesale and retail marketplaces, and third-party online and mobile commerce platforms. BABA has been developing its cloud segment for a decade. The company has recently unveiled Alibaba Cloud’s first cloud computer, a cloud-native intelligence product to accelerate digital transformation. BABA had also entered into a strategic collaboration with Total (China) Investment by signing a memorandum of understanding (MoU) in the last quarter. The agreement aims to drive the operations in China and globally. The company is also in talks to hike its stake in a Chinese courier major, YTO Express. BABA has grown its revenues at a CAGR of 46% over the last three years. Top-line for the last reported fiscal first quarter that ended June 2020 increased 34% year-over-year to $21.76 billion as annual active consumers on retail marketplaces reached 742 million, an increase of 16 million compared to the preceding quarter. The mobile monthly active users increased by 3.3% quarter-over-quarter to 874 million. Income from operations came in $4.91 billion, increasing 42% compared to the year-ago quarter. EPS for the last fiscal year came in at $7.9, increasing 59% year-over-year. Over the last three years, the company has grown its net income at an average rate of 51.2% per year. BABA reported EPS of $2.15, implying an increase of 18% year-over-year and an earnings surprise of 7.5%. The company has also beaten the street estimate by 50.6% in the previous quarter and has consistently delivered earnings surprises in each of the trailing four quarters. BABA has become one of the biggest names in the cloud computing market in a short span. It is the biggest provider of Infrastructure-as-a-service (IaaS) in Asia, and the third-largest platform in the world. Hence, the street expects current year revenue and EPS to grow 36.2% and 23.5%, respectively, year-over-year. BABA commands a forward P/E ratio of 37.88 compared to the sector’s median P/E ratio of 24.33, implying the company’s edge over the industry. The stock closed yesterday’s trade at $290.05, gaining more than 55% over the last six months. It is currently trading just 3% below its all-time high of $299.00. It’s no surprise that BABA is rated a “Strong Buy” in our POWR Ratings system, with a grade of “A” in Trade Grade, Buy & Hold Grade, Peer Grade, and Industry Rank. It is also ranked #1 out of 115 stocks in the China group. Plug Power Inc. (PLUG) PLUG is an alternative energy technology provider that engages in the design, development, manufacture, and commercialization of fuel cell systems for the industrial off-road markets worldwide. It provides hydrogen fuel cell turnkey solutions for the electric mobility and stationary power markets. PLUG had announced a new 1kW ProGen fuel cell system intended for small scale robotics, automatic guided vehicles (AGVs) and other aerospace applications in August. The company has recently announced a memorandum of understanding for the demonstration of ProGen fuel cell engine in Class 6 and Class 8 vehicles, which will be used by Linde for delivery of products. Additionally, PLUG has partnered with Apex Clean Energy, a leading developer and operator of utility-scale wind and solar power facilities after the acquisition of United Hydrogen and Giner Elx in the second quarter to accelerate its green hydrogen strategy. Over the past three years, PLUG’s top-line grew at a CAGR of 45.4%. Despite the pandemic, PLUG managed to generate a revenue of $68 million in the last reported quarter, increasing 18% year-over-year. The company has efficiently managed and grown the capability of its supply chain to meet increased volumes while reducing costs. It delivered record gross billings of $72.4 million during the quarter. The company reported a loss of $0.36 per share for the previous fiscal year. While PLUG is not profitable yet, the company is making big moves by signing new clients. The company reported a negative EPS of $0.03 for the last quarter, significantly improving from the quarter-ago loss of $0.12 per share. Environmental concerns have boosted demand for clean hydrogen power and hence, the stock is exhibiting strong momentum. Revenue is estimated to increase 33.4% while the EPS is anticipated to grow 22.2%, year-over-year, in the current year. PLUG commands a forward P/S ratio of 17.89 compared to the sector’s median P/S ratio of 1.20. This indicates that the company is significantly outperforming the industry. The stock closed yesterday’s trading session at $13.99, gaining 342.7% year-to-date. It is currently trading 2.6% below its 52-week high of $14.35. PLUG’s POWR Ratings reflect this promising outlook. It has an overall rating of “Strong Buy” with an “A” for Trade Grade, Buy & Hold Grade, and Peer Grade, and a “B” for Industry Rank. Among the 58 stocks in the Industrial – Equipment industry, it’s ranked #6. Digital Turbine, Inc. (APPS) APPS provides unique software platforms and solutions for mobile operators and advertisers. It is uniquely positioned for growth as the pandemic has contributed significantly to its primary business of brokering advertisements on smartphones. Its technology platform has been adopted by more than 40 mobile operators and OEMs. The company’s Application Media software was installed on more than 43 million devices during the last reported quarter, and has been installed on more than 450 million devices so far. The company has recently launched its first cross-sell opportunity from the Mobile Posse, Inc. acquisition it made earlier this year. The management is highly optimistic about the potential to capitalize on additional cross-selling opportunities across its Application and Content businesses as the year progresses. APPS has grown its revenues at a CAGR of 74.8% over the last three years. The company reported a top-line of $59 million for its fiscal first quarter that ended June 2020, indicating a 93% increase year-over-year. It delivered a gross margin of 44.3%. APPS has achieved new highs for the percentage of total revenue derived with international partners and revenue derived from life-of-device and content-themed products during the quarter. Net income for the last reported quarter improved significantly to $9.94 million compared to the year-ago loss of $1.82 million. EPS for the quarter came in at $0.13, beating the consensus estimate by 44.4%. The company is benefitting from the higher conversion rates generated by its platform as businesses and consumers everywhere are increasingly engaging with applications and mobile content as part of their daily routines. New over-the-top (OTT) TV relationships will enable APPS to strategically extend its platform beyond smartphones to additional screens. Hence, the street expects current year revenue to grow 76% compared to the year-ago value. Moreover, current year EPS is estimated to rise 130% year-over-year to $0.46. APPS commands a forward P/E ratio of 91.26 compared to the sector’s median P/E ratio of 32.63. The stock closed yesterday’s trading session at $35.20, after hitting its all-time high of $35.35. The stock plunged as low as 13% in the first week of September, but is presently up more than 33% from the past month, with a year-to-date gain of 393.7%. As per our POWR Ratings, APPS is rated a “Strong Buy”. It holds a grade of “A” in Trade Grade, Buy & Hold Grade, Peer Grade, and Industry Rank. It is currently ranked #15 out of 96 stocks in Software – Application Industry. Want More Great Investing Ideas? Do NOT Buy Stocks Before the Election! 7 “Safe-Haven” Dividend Stocks for Turbulent Times Chart of the Day- See Christian Tharp’s Stocks Ready to Breakout MSFT shares . Year-to-date, MSFT has gained 31.79%, versus a 5.21% rise in the benchmark S&P 500 index during the same period."}]}