{"article": [{"url": "https://stocknews.com/news/etsy-se-cvna-snap-is-etsy-a-great-e-commerce-stock-to-buy-for-2021/", "published": 1601640500.0, "headline": "Is Etsy a Great E-Commerce Stock to Buy for 2021?", "body": "ETSY is known as the leading marketplace for handmade items and vintage products, connecting sellers and artists directly with a buyer. The company’s revenue is expected to grow at a CAGR of 24% from 2019 to 2021, making it the fourth fastest-growing online marketplace in the world based on revenue. On September 21st, ETSY was moved to the S&P 500 index from the S&P MidCap 400. The company’s impressive growth over the past couple of years primarily contributed to this upgrade. The pandemic positively contributed to the ETSY’s growth as well, as the demand for handmade masks and other items surged. The stock gained 197.3% year-to-date. Gross revenue from masks alone stood at $346 million for the second quarter ended June 2020, and Etsy Ads for premium listings crossed the $1 billion mark in July. This, coupled with several other factors, has helped the stock earn a “Strong Buy” rating in our proprietary rating system. 9 \"BUY THE DIP\" Growth Stocks For 2020Here’s how our proprietary POWR Ratings system evaluates ETSY: Trade Grade: A ETSY is currently trading higher than its 50-day and 200-day moving averages of $120.15 and $78.78, respectively, indicating an uptrend in the stock. It has gained 18.4% in the past three months, reflecting solid short-term bullishness. ETSY gross merchandise sales (GMS) increased 145.6% year-over-year to $2.69 billion in the second quarter ended in June 2020. Revenue grew 136.7% from the year-ago value to $428.38 million, while net income rose 429.1% from the same period last year to $96.43 million. ETSY recently announced senior notes offering to raise approximately $639.50 million, which it plans to use for share buybacks and general corporate expenses. Buy & Hold Grade: A In terms of proximity to its 52-week high, which is a key factor that our Buy & Hold Grade takes into account, ETSY is well-positioned. The stock is currently trading just 7.4% below its 52-week high of $141.41, which it hit on August 10th. ETSY has gained 680.2% in the past three years, owing to its impressive revenue and earnings growth. Revenue and EBITDA grew at a CAGR of 41.5% and 108.3%, respectively, over the past three years. Its free cash flow increased at a CAGR of 192.3% over the same period. ETSY’s long-term bullishness can be attributed to its unique business model. It connects buyers directly with local sellers in a region, eliminating the need for middlemen. This allows buyers to purchase quality products at competitive prices from authentic sellers. Peer Grade: B ETSY is ranked #7 out of 57 stocks in the Internet industry. Other stocks in this industry are Sea Ltd. (SE), Carvana Co. (CVNA), and Snap Inc. (SNAP). While SE beat ETSY by gaining 297.8% year-to-date, CVNA and SNAP returned 158.7% and 64%, respectively, over this period. Industry Rank: B The Internet industry is ranked #5 out of 123 industries listed in the StockNews.com universe. The coronavirus pandemic has increased reliance on internet-based services significantly, as people are working, learning, and even shopping from the comfort of their homes. Many analysts expect this new normal to sustain even after the pandemic is over, due to its convenience. Also, the 5G boom is expected to add to the immense popularity of this industry, as it is expected to revolutionize the technology sector. Overall POWR Rating: A (Strong Buy) ETSY is rated “Strong Buy” due to its short-and long-term bullishness, impressive past performance, and underlying business strength, as determined by the four components of our overall POWR Rating. Bottom Line ETSY has immense potential to soar through the remainder of this year and the next year given its solid business growth and favorable analyst sentiment. ETSY has an average broker rating of 1.12, indicating favorable analyst sentiment. Out of 17 Wall Street Analysts that rated the stock, 16 rated it “Strong Buy.” The consensus EPS estimate of $0.58 for the third quarter ended in September 2020 indicates a 38.3% improvement year-over-year. The consensus revenue estimate of $409.98 million for the quarter indicates a 107.1% growth from the same period last year. Want More Great Investing Ideas? Do NOT Buy Stocks Before the Election! 7 “Safe-Haven” Dividend Stocks for Turbulent Times Chart of the Day- See Christian Tharp’s Stocks Ready to Breakout ETSY shares were trading at $131.44 per share on Friday afternoon, down $0.25 (-0.19%). Year-to-date, ETSY has gained 196.70%, versus a 5.52% rise in the benchmark S&P 500 index during the same period."}]}