{"article": [{"url": "https://stocknews.com/news/slv-wpm-svm-paas-sil-3-silver-miners-to-buy-now/", "published": 1599221300.0, "headline": "3 Silver Miners to Buy NOW", "body": "There’s an increasing amount of evidence supporting the theory that gold and silver are in the early stages of a multiyear bull market. From the March lows, precious metals have been one of the best performers. Gold is up 33% and silver is 130% higher. Both have also exceeded their pre-coronavirus levels by a significant margin. Silver is 42% above its pre-coronavirus highs, and gold is 14% above these levels. In contrast, the S&P 500 is 1.5% above its previous highs. 9 \"BUY THE DIP\" Growth Stocks For 2020In recent weeks, prices have backed off. Gold made an all-time high of $2,089 in early August. Silver made a new, 52-week high just under $30 before backing off. Both are about 7% off recent highs. Improving Fundamentals In addition to strong price action, the sector’s fundamentals have continued to improve. This means that pullbacks in the sector should be considered an opportunity to add exposure. Two of the most important factors that affect gold prices are interest rates and inflation. In terms of rates, the Fed has said it won’t be raising rates until 2020 at least. Additionally, the Fed recently revised its inflation policy that effectively raises the hurdle for future rate hikes. Meanwhile, inflation expectations have been rising due to the better-than-expected bounceback in the economy, tremendous amounts of fiscal support, and weakness in the dollar. Two threats to gold are a rise in interest rates and a strong dollar. The Fed has removed the first threat for the next 15 months and possibly longer given its new playbook. The dollar is also unlikely to rise given the record-level of deficits, the Fed’s policy shift, and other countries doing a better job in preventing and managing coronavirus outbreaks. Parallels to 2009 There are many parallels between the current rally in precious metals and the last precious metals bull market between 2009 and 2011. During this period, gold climbed 180% and silver soared 492% higher from 2008 to 2011. In both 2009 and 2011, markets and economies were recovering from major setbacks. All asset prices were recovering but precious metals were the leader in terms of performance and leadership. Two more similarities are concerns about a “double-dip” recession and rising inflation expectations. In 2009, the Fed also tolerated a rise in inflation expectations and had zero percent rates and asset purchases every month. This time, the Fed has signaled that it intends to do the same. In both circumstances, the Fed was aggressive and creative with its toolkit to support the economy. There was also considerable amounts of fiscal stimulus in both cases. Case for Silver Miners Within the precious metals sector, investors have a lot of options. They can buy bullion, coins, ETFs, or miners. And, they can choose between gold, silver, platinum, and palladium. Out of these options, I believe that silver miners will outperform in a precious metals bull market. History shows that silver tends to have the most outperformance especially in the later stages of bull markets. It’s also 45% below its all-time high, while gold is making new highs. The ratio between silver to gold also remains depressed relative to its historical norms. This tends to go from one extreme to another during bull markets which signal upside and outperformance for silver. All of these factors are leading to increased investment demand for silver. The iShares Silver Trust’s (SLV) holdings are higher now than they were at its prior high of $49 in May 2011. Another bullish catalyst is going to be increased industrial demand as well. Silver is a component of electric batteries and used in solar cells, both are industries with above-average growth rates. According to the Silver Institute, about 50% of the world’s silver supply is used for industrial purposes. Among different silver investments, the silver miners have the highest potential for gains. The coronavirus has created challenges for the industry due to production disruptions and higher costs to increase sanitization and social distancing measures. Yet, their last earnings report showed that the silver miners’ all-in-costs per ounce haven’t significantly risen. And, costs likely decline as production increases. Over the next year, this sector will benefit from rising silver prices and lower costs per ounce which will boost earnings per share and the assets on their balance sheet. Like the other precious metals, the silver miners have had a shallow pullback – about 10% off recent highs. Investors should consider using this pullback to add or initiate positions in high-quality silver miners like Wheaton Precious Metals (WPM), Pan American Silver (PAAS), and Silvercorp Metals (SVM). Wheaton Precious Metals (WPM) WPM has mining streaming agreements with 20 mines and 9 development stage projects. The streaming model is advantageous for investors because there is less risk. Streamers invested in a variety of projects and receive a share of production. This diversified model meant that it was better-positioned to survive this crisis. In the second-quarter, WPM’s revenue increased by 39% which was the highest in the sector. WPM’s stock is a clear leader among silver miners due to its size and superior business model. The stock is also 50% above its May 2011 highs despite silver being 45% lower. This is due to the company successfully increasing production by investing in high-quality projects. WPM is rated a Buy in our POWR Ratings system. It has an “A” in Trade Grade and Industry Rank, and “B” in Buy & Hold Grade and Peer Grade. It is also ranked #3 out of 11 stocks in the Silver – Miners group. Pan American Silver (PAAS) PAAS has some of the world’s most accessible and high-quality silver and gold reserves. In total, it has 806 million ounces of silver and 9 million ounces of gold. PAAS is engaged in the exploration, extraction, refining and manufacturing, and sale of precious and base metals such as gold, silver, zinc, copper, and lead. PAAS did better than its peers. The coronavirus shutdowns resulted in production being about 20% lower, however, the company still increased profits by 5% due to strength in gold and silver prices. It also continues to execute its plan to increase production to 25 million ounces per silver while targeting costs of under $10 per ounce. This would make PAAS one of the most profitable silver miners in the world. PAAS’ POWR Ratings are consistent with this picture, as it has a Buy rating. It’s the #4 ranked silver miner, and it has an “A” for Trade Grade, Buy & Hold Grade, and Industry Rank. Silvercorp Metals (SVM) SVM’s second-quarter earnings showed that the company’s operations were less affected than other miners. Total revenue was higher by 2% and earnings were 7% higher. This resilience is a positive sign for the company. In addition to silver, SVM is a major producer of zinc and lead. Both of these commodities have also recovered their coronavirus losses and are trending higher. SVM pays an annual dividend of $0.03, which yields 0.37% based on its current price. Its dividend has grown 25.3% annually over the last four years. SVM gained more than 410% since hitting its 52-week low of $1.50 on March 16th. It’s not surprising that SVM is rated a “Strong Buy” in our POWR Ratings system. It has an “A” in Trade Grade, Buy & Hold Grade, Peer Grade, and Industry Rank. Out of 11 stocks in the Miners- Silver industry, SVM is ranked #1. Want More Great Investing Ideas? 7 Best ETFs for the NEXT Bull Market Beware Stocks in September? 9 “BUY THE DIP” Growth Stocks for 2020 SLV shares were trading at $24.73 per share on Friday afternoon, down $0.01 (-0.04%). Year-to-date, SLV has gained 48.26%, versus a 6.38% rise in the benchmark S&P 500 index during the same period."}]}