{"article": [{"url": "https://stocknews.com/news/cvna-sedg-bynd-frpt-buy-these-recently-upgraded-stock-now/", "published": 1601640500.0, "headline": "Buy These Recently UPGRADED Stocks Now!", "body": "The POWR Ratings have been updated, revealing several new stocks worthy of your investing dollars. Check out the latest upgrades, and you will find there are numerous stocks with bullish outlooks. Though the market might be overbought and due for a significant contraction, there are still plenty of stocks likely to increase before year’s end. Let’s take a look at the latest POWR Rating upgrades, highlighted by these four stocks: Carvana (CVNA), SolarEdge Technologies (SEDG), Beyond Meat (BYND), and Freshpet (FRPT). 9 \"BUY THE DIP\" Growth Stocks For 2020Carvana (CVNA) Online businesses are all the rage these days as people pivot away from in-person interactions to buy and sell in a contactless manner on the web. CVNA specializes in web-based car sales. CNVA revenue is up fourfold across the past three years. A large part of CVNA’s success is its business model that includes all aspects of the used car sales process ranging from financing to sales, repair, inspection, and more. In fact, CVNA is even involved in software development. Take a look at CVNA’s POWR Ratings, and you will find it has “A” grades in its Trade Grade and Buy & Hold Grade components. CVNA is ranked third out of 57 stocks in the Internet industry. CVNA has a year-to-date price return of nearly 140%, a six-month price return of 380%, and a three-month price return of 71%. Analysts are quite bullish on CVNA. Out of 17 analysts who cover CVNA, 11 rate it as a “Buy” and six rate it a “Hold”. CVNA just keeps on climbing as more customers opt for used vehicles sold online than at traditional car dealerships where the virus might lurk. The company’s second-quarter revenue was up 13% on a year-over-year basis. CVNA executives insist its third-quarter earnings will be record-setting. SolarEdge Technologies (SEDG) The solar industry is on fire (pun intended). SEDG serves residential solar installations along with utility-scale solar panels and commercial solar installations. SEDG’s inverter solutions, optimizers, and cloud monitoring are selling like gangbusters. SEDG has “A” grades in two of the four POWR components along with a “B” grade in Industry Rank. It is the top-ranked Solar stock out of 14 in the industry. SEDG has a year-to-date price return of 151%, a 2019 price return of 170%, and a six-month price return of 220%. SEDG fell to $70 in April, climbed toward $160 in June, and has since taken off, ascending all the way to $240. If this stock declines as investors take profits off the table, it may provide a buying opportunity. Beyond Meat (BYND) Meat has become quite problematic for a number of reasons. Meat production hastens global warming, requires an abundance of our limited water, requires people to stand shoulder-to-shoulder in meatpacking facilities amidst a pandemic, and is not exactly the healthiest food. This is precisely why BYND and other vegan/vegetarian stocks have rosy outlooks. BYND sells faux beef, sausage, and chicken products. The BYND POWR Ratings are nearly perfect. BYND has “A” grades in each POWR component and a “B” for Industry Rank. BYND is ranked second out of 27 stocks in the Agriculture industry. BYND’s price returns are in the green across many periods of time. In fact, BYND has a year-to-date price return of 121%, a six-month price return of 179%, and a one-month price return of 23%. Now that BYND products are sold in China, and Walmart is increasing its distribution of BYND faux meat threefold, the future looks bright for this this stock. Freshpet (FRPT) Pet food will continue to be a big business, regardless of the state of the economy. Pet owners are more than happy to spend on their furry friends, even amidst a lengthy recession. FRPT makes and markets fresh pet food throughout North America. FRPT’s uber-healthy pet food is upscale and somewhat expensive, yet pet owners far and wide insist it is worth every penny. FRPT has “A” grades in each POWR component, but for its Industry Rank. Furthermore, FRPT is ranked 6th of nearly 60 publicly traded companies in the Food Makers industry. FRPT had a 2019 return of 83%, a six-month price return of 86%, and a three-month price return of 25%. However, FRPT’s forward P/E ratio is more than 700, meaning it currently trades at a high multiple. If the price dips, it may provide a buying opportunity. Want More Great Investing Ideas? Do NOT Buy Stocks Before the Election! 7 “Safe-Haven” Dividend Stocks for Turbulent Times Chart of the Day- See Christian Tharp’s Stocks Ready to Breakout CVNA shares were trading at $236.81 per share on Friday morning, down $1.29 (-0.54%). Year-to-date, CVNA has gained 157.26%, versus a 4.86% rise in the benchmark S&P 500 index during the same period."}]}