{"article": [{"url": "https://stocknews.com/news/mchp-now-lng-gwre-crm-moat-spy-5-companies-with-strong-competitive-advantages-in-their-industries/", "published": 1596715700.0, "headline": "5 Companies with Strong COMPETITIVE ADVANTAGES in Their Industries", "body": "One way to invest for the long-term is to find companies with substantial competitive advantages over their competitors. These companies have sustainable dominant market positions that make it difficult for companies to enter their market or competitors to challenge them. Another term for stocks with competitive advantages is “wide moat stocks.” If you think of a company as a castle, it has a wide moat around it that can prevent intruders from entering. Wide moat stocks are tracked through an index by Morningstar, called the Morningstar Wide Moat Focus Index. The index is composed of undervalued high-quality companies in the universe of stocks that Morningstar covers. These companies must have a wide moat where their advantages will fend off competitors for at least 20 years. The index even has an ETF that tracks it called the VanEck Vectors Morningstar Wide Moat ETF (MOAT). Over the long run, the ETF has outperformed the SPDR 500 ETF (SPY) as MOAT is up 77.6% over the past five years, compared with SPY’s gain of 59.7%. 9 \"BUY THE DIP\" Growth Stocks For 2020For investors, it can be challenging to find companies with these advantages, so I’ve selected five of the top holdings in the MOAT ETF: Microchip Technology (MCHP), ServiceNow (NOW), Cheniere Energy (LNG), Guidewire Software (GWRE), and Salesforce.com (CRM). Microchip Technology (MCHP) MCHP, which was spun off from General Instrument in 1989, develops and manufactures microcontrollers (MCU) and memory and analog and interface products for embedded control systems. Over half the company’s revenue comes from MCUs, which are used in electronic devices such as remote controls, garage door openers, and power windows in cars. MCHP is one of the fastest-growing providers of 8-bit, 16-bit, and 32-bit MCUs in the world. The company holds a competitive advantage in microcontrollers due to its significant market share. The company is also expanding its business of touch products to automotive, industrial applications. The company should benefit from the continued adaptation of the Internet of Things (IoT). MCHP develops a wide range of innovative linear, mixed-signal, and interface products that drive the growth of its analog business, providing sustainable sales growth and expanded margins. MCHP’s analog business is one of the largest in the industry. The company reported earnings per share (EPS) of $1.54 on Tuesday, which was higher than the consensus estimate of $1.44. MCHP is rated a Buy in our momentum-based POWR Ratings. It holds grades of A or B for Trade Grade, Buy & Hold Grade, and Industry Rank. ServiceNow (NOW) NOW provides software solutions to structure and automate various business processes through software as a service (SaaS) model. The company focuses on the IT function for enterprise customers. The firm started with IT service management and expanded within the IT function, and now directs its workflow automation logic to areas beyond IT such as customer service, HR service delivery, and security operations. NOW is the dominant company in the IT service market. The company has grown market share by replacing legacy on-premise systems with cloud-based processes. NOW focuses on large-sized public and private companies to drive top-line growth. The company specifically targets companies in the Fortune 500 for business growth. The firm’s expansion into human resource and security solutions will cement its status as the top IT service provider. The company has also driven growth through acquisitions. For instance, NOW’s acquisitions of Neebula Systems, BrightPoint Security, and ITapp helped the company expand its security and ITOM solutions. NOW reported earnings of $1.23 on July 29, which was 515% more than the consensus estimate of $0.20. The stock is rated a Strong Buy in our POWR Ratings system. In four out of the five components that make up the POWR Ratings, NOW has a grade of A. The company is also the #2 ranked stock in the Software-Business industry. Cheniere Energy (LNG) LNG owns and operates the Sabine Pass liquefied natural gas terminal via its stake in Cheniere Partners. The terminal is the first large scale liquefied gas export facility in the United States. The company also owns the under-development Corpus Christi LNG terminals and Cheniere Marketing, which markets liquefied natural gas (LNG) using Cheniere’s gas volumes. The company has a wide moat in the liquefied natural market due to its first-mover advantage. It was the first company to receive Federal Energy Regulatory Commission (FERC) approval to export liquefied natural gas from its 2.6 billion cubic feet per day Sabine Pass terminal. This advantage sets the company up for healthy revenue and earnings growth on the back of long-term contracts. The company reported earnings this morning with an EPS of $0.78 compared to analyst estimates of $0.43. Its revenue of $2.4 billion beat estimates by $40 million. The revenue figure was partially driven by the company collecting fees from customers who were canceling deliveries due to the pandemic. Guidewire Software (GWRE) GWRE provides software solutions for property and casualty insurers. Its flagship product InsuranceSuite is an on-premises system of records. It is comprised of ClaimCenter, a claims management system, PolicyCenter, a policy management system, and BillingCenter, which is for billing management, payment plans, and agent commissions. The company also offers InsuranceNow, which is a cloud-based offering. The company has a strategic competitive advantage due to its unique business. GWRE’s suite of software targets explicitly the property and casualty insurers sector, so there is not much competition. The firm is shifting from a term license-based model to a subscription-based model. This will be profitable in the long run as most businesses are expected to move towards cloud-based infrastructure. GWRE is focused on improving its Guidewire Cloud platform with new capabilities such as digital frameworks, automation, and other cloud services. This should lead to higher sales. GWRE is rated a Strong Buy in our POWR Ratings system. It holds grades of A for Trade Grade and Buy & Hold Grade. For Peer Grade and Industry Rank, it has a grade of B. The company is the #10 ranked stock in the Software-Business industry. Salesforce.com (CRM) CRM is the leading provider of customer relationship management (CRM). It is the largest CRM seller in the world, with close to a 20% market share. The company dominates the market due to its clientele and the attractiveness of its cloud-based solutions. Its primary customer relationship management software is Sales Cloud. The company also offers Service Cloud for customer support, Marketing Cloud for digital marketing, Commerce Cloud for e-commerce, and the Salesforce Platform, allowing firms to build applications and other solutions. The company is benefiting from strong demand as customers are adapting to the new digital world. This has led to accelerated adoption of its cloud-based solutions. CRM’s integrated solutions for customer problems help drive growth. The firm’s continued focus on introducing new products that align with customers’ needs will drive growth. Acquisitions have also helped drive growth. The company’s buyouts of ClickSoftware, CloudCraze, Datorama, Mulesoft, and Tableau have been profitable for the company. CRM has made inroads into international markets due to partnership agreements with Amazon (AMZN) and Alphabet (GOOGL). CRM is rated a Strong Buy in our POWR Ratings system. It holds grades of A in Trade Grade, Buy & Hold Grade, and Peer Grade. It is also the number #1 ranked stock in the Software-Business industry. Keep an eye out on August 25, as the company is expected to report earnings after market close. Want More Great Investing Ideas? 9 “BUY THE DIP” Growth Stocks for 2020 How to Trade THIS Stock Bubble? 7 “Safe-Haven” Dividend Stocks for Turbulent Times MCHP shares were unchanged in after-hours trading Thursday. Year-to-date, MCHP has declined -4.56%, versus a 4.94% rise in the benchmark S&P 500 index during the same period."}]}