{"article": [{"url": "https://stocknews.com/news/msft-intc-csco-sap-4-large-cap-tech-stocks-that-pay-a-dividend/", "published": 1595419700.0, "headline": "4 Large-Cap Tech Stocks that Pay a Dividend", "body": "The Technology Select Sector SPDR ETF (XLK) is up 29% over the last month. The pandemic has created an environment where people work from home, and children learn from home. This has only accelerated the move to the digital world, providing a growth catalyst for technology stocks. If you’re looking for stable technology stocks, find companies that pay a dividend. These companies provide growth and income. They typically have solid financials that allow them to pay their shareholders. Here are four large-cap technology companies that pay dividends: 7 Best ETFs for the NEXT Bull MarketMicrosoft Corporation (MSFT) Over the last 6 years, Microsoft has paid back more capital in dividends than 98.4% of other dividend-paying stocks in the StockNews.com universe. Furthermore, the company generates a lot of free cash flow, which is currently more than 97.9% of US dividend-paying stocks. MSFT has a long history of paying dividends. The company has also steadily increased its dividend payout over the last 10 years. MSFT has a dividend yield of almost 0.98%, and its dividend payout ratio stands at 36%. The company is set to release its quarterly earnings report on Wednesday. The consensus ESP estimate of $1.37 is in line with the year-ago number. Moreover, MSFT’s earnings surprise history looks pretty good, as the company beat the consensus EPS estimates in each of the trailing four quarters. Microsoft has recently added two new monitoring and device management options to Microsoft Teams, called Rooms Standard and Rooms Premium. With the shift towards remote working, this could lead to further upside for the stock. MSFT has also been performing pretty well in this “new normal.” It has added close to 54% to its stock price since this year’s low of $132.5 on March 23rd. How does MSFT stack up for the POWR Ratings? A for Trade Grade A for Buy & Hold Grade A for Industry Rank A for Peer Grade A for overall POWR Rating You can’t ask for better. The stock is also ranked #1 out of 82 stocks in the Software – Application industry. Intel Corporation (INTC) Intel has returned more capital to its shareholders in the form of dividends than 97.2% of other dividend-paying US stocks over the last six years. The company also generated more free cash flow over the last 12 months than 96.9% of US dividend stocks. INTC also has a long history of paying dividends, and has steadily increased its dividend payout over the last twenty years. The dividend yield of INTC stands at 2.17%, with a payout ratio of 24.2%. The company is expected to release its quarterly earnings report on Thursday. The current earnings estimate of $1.11 indicates a 4.7% improvement from its EPS of $1.06 for the same time period last year. INTC’s earnings surprise history is impressive, with the stock beating consensus EPS estimates in each of the trailing four quarters. INTC’s stock has recovered around 36% from the 52-week low in mid-March. The company’s strong recovery could bode well for the rest of 2020. The company is also making forays into the autonomous driving market, thanks to its expanded partnership with Ford Motor (F). Under a new partnership agreement, INTC will help Ford with the camera-based detection capabilities for its vehicles. It’s no surprise that INTC is rated “Buy” in our POWR Ratings system. It also has an “A” for Industry Rank. In the 86-stock Semiconductor and Wireless Chip industry, it is ranked #31. Cisco Systems, Inc. (CSCO) Cisco has issued more total dividends, measured in absolute US dollars, than approximately 97.2% other US dividend companies over the last six years. The company has been steadily increasing its dividend payout over the last five years. The dividend yield of CSCO is currently 3% with a payout ratio of 44.6%. CSCO has an impressive earnings surprise history with the company surpassing consensus EPS estimates in all of the trailing four quarters. CSCO’s stock has recovered 41% from its low this year in March. This momentum could be seen as a positive indicator for the stock going forward. The company is also reportedly in talks to acquire ThousandEyes, which is a network monitoring company. This new deal could help Cisco elevate the performance of its application performance and monitoring business. CSCO’s strong fundamentals are reflected in the POWR Ratings. It has a “Buy” rating with an “A” in Trade Grade. Within the Technology – Communication/Networking industry, it’s ranked #10 out of 51 stocks. SAP SE ADS (SAP) SAP has distributed more dividends to shareholders in terms of absolute dollars than 91.5% of US dividend stocks over the last twelve months. The company also has better average cash flow over the last five years than 91.6% of dividend-paying US stocks in the StockNews.com universe. SAP has been increasing its dividend payout over the last three years. SAP currently has a dividend yield of 0.77% and a payout ratio of 24.7%. In the run-up to its quarterly earnings, expected on July 27th, it is estimated that the company will deliver an EPS of $1.10. Moreover, the stock has been rising since hitting its 52-week low of $90.9 on March 19th. SAP has gained 67% during this period. This momentum may continue given the strength of its business model. The company has recently launched the SAP Fieldglass External Talent Marketplace, allowing businesses to find and hire temporary workers to support business continuity. Even though the service is free until the end of this year, this move could mark further profitability for the company. It’s no surprise that SAP is rated a “Strong Buy” in our POWR Ratings system. It also has an “A” grade for Trade Grade, Buy & Hold Grade, Peer Grade, and Industry Rank. In the 82-stock Software – Application industry, it is ranked #3. Want More Great Investing Ideas? 9 “BUY THE DIP” Growth Stocks for 2020 Newly REVISED 2020 Stock Market Outlook 7 “Safe-Haven” Dividend Stocks for Turbulent Times MSFT shares fell $5.61 (-2.65%) in after-hours trading Wednesday. Year-to-date, MSFT has gained 35.02%, versus a 2.60% rise in the benchmark S&P 500 index during the same period."}]}