{"article": [{"url": "https://stocknews.com/news/googl-adbe-snps-how-to-screen-for-the-best-growth-stocks/", "published": 1599048500.0, "headline": "How to Screen for the Best Growth Stocks", "body": "Today, I cover a strategy that uses a scoring system to identify growth stocks with the characteristics that lead to outperformance. Read on to learn more about AAII’s G-score screens and see lists of tech companies currently meeting the criteria. Grading Growth Stocks With the G-Score Technology stocks have helped to propel the S&P 500 index to new highs, overcoming the sudden and severe bear market experienced during 2020. Tech stocks have gained 38.5% in the first eight months of this year, compared to the S&P 500 gain of 10.6% over the same time frame. Many tech companies were uniquely positioned to thrive during the coronavirus pandemic. The strong price performance of the stocks in this sector has stretched the valuations of technology stocks. Most academic research suggests that investing in glamour growth stocks is a losing proposition. On average, firms with high valuations determined by factors such as the price-earnings ratio or price-to-book-value ratio underperform the market over the long term. While the market does a good job of valuing securities in the long run, in the short run it can overreact to information and push prices away from their true value.Some growth stocks deserve their high valuations while many do not. Partha Mohanram, who holds the John H. Watson chair in value investing and is area coordinator of accounting at Rotman School of Management, University of Toronto, developed a scoring system to help separate the winners from the losers among stocks trading with high price-to-book-value ratios. The grading system looks at company profitability and cash flow performance, adjusts for likely mistakes due to naive growth projections and considers the impact of conservative accounting policies to form a growth score, or G-score.Mohanram’s work identified fundamental factors that are useful when studying growth companies. Investors tend to naively extrapolate current fundamental growth stocks or even ignore the implications of using conservative accounting to project future earnings. Mohanram refers to the signals of his grading system as “growth” fundamental signals since they measure the fundamental strength of these companies in a context appropriate for growth firms. Mohanram feels that stocks with stronger growth fundamentals stand a better chance of expanding earnings and avoiding exchange delisting and are more likely to beat earnings forecasts. Most importantly, Mohanram uses a number of simple measures based solely on financial statement data that can separate winners from losers.Profitability, naive extrapolation and accounting conservatism are examined using popular ratios and basic financial statement data to create the G-score. Mohanram found that high price-to-book-value stocks with higher G-scores outperformed growth stocks with lower G-scores. AAII modified Mohanram’s scoring system to create a seven-point G-score seeking out strong-performing tech stocks with attractive G-scores, as well as identifying stocks with troublesome weak G-scores. The tables below present exchange-listed technology stocks that have outperformed 80% of all companies over the last 52 weeks. The first table lists the 10 stocks that have attractive G-scores of seven, while the second table lists the five tech stocks flashing a warning sign with G-scores of zero. Today’s Technology Growth Stock Ideas Hot Technology Stocks With Attractive G-Scores Hot Technology Stocks With Poor G-Scores 7 \"SAFE HAVEN\" Dividend Stocks for Turbulent Times Mohanram awarded up to three points for profitability—one for return on assets (ROA) above the industry median (midpoint), one for a ratio of cash flow from operations to assets above the industry median and one point if the cash flow from operations exceeds net income. Mohanram highlights academic research indicating that ratio analysis benefits from industry comparisons.ROA examines the return generated by the assets of the firm. A high return implies that the assets are productive and well-managed. If a company has an ROA greater than the sector median, it is given one point, otherwise it is given a zero. The stocks in the tech sector have a median ROA of negative 3.0%, indicating that more than half of the 888 stocks in the tech sector experienced a loss over the last four quarters. Software company Adobe Inc. (ADBE) has an attractive ROA of 17.7%, well above the norm for the sector.Earnings may be less meaningful than cash flow for technology growth companies. Operating cash flow is reported on the statement of cash flows and is designed to measure a company’s ability to generate cash from day-to-day operations as it provides goods and services to its customers. A positive cash flow from operations implies that a firm was able to generate enough cash from continuing operations without the need for additional funds. A negative cash flow from operations indicates that additional cash inflows were required for day-to-day operations of the firm. Mohanram also measures profitability by dividing the cash flow from operations by total assets. This is like the ROA calculation, but it is based upon cash flow instead of net income. A stock is awarded one growth point if the cash flow ROA exceeds the firm’s sector median, otherwise a zero is recorded. The median cash flow ROA was a positive 4.7% for the tech sector. Facebook Inc. (FB) has a strong cash flow ROA of 25.9%, well above the sector median.The final profitability score examines the relationship between the earnings and cash flow. A growth point is awarded if cash from operations exceeds net income. This measure tries to avoid firms making accounting adjustments to earnings in the short run that may weaken long-term profitability. Naive Extrapolation Too often the market simply examines the past growth pattern of a company and expects it to continue into the future. Two companies with the same historical growth might have the same high valuation, but a company with more stable and predictable earnings and sales is more desirable and more likely to continue its growth. Mohanram feels that stability of earnings may help to distinguish between “firms with solid prospects and firms that are overvalued because of hype or glamour.” Mohanram measures earnings variability as the variance of a firm’s return on assets in the past five years. A company is awarded one growth point if its variance in ROA is below the sector median. A company must have at least three years of data to calculate the variance or it is given a value of zero for this signal. Alphabet Inc. (GOOGL) not only had an ROA above the sector median, but year-to-year variance in the ratio was much lower than the norm in the tech sector.The second growth signal in this category relates to the stability of year-to-year sales growth. A firm that has stable growth is less likely to disappoint in the terms of future growth. Mohanram examined the stability of sales growth to help overcome the issues of negative earnings that many early-stage growth stocks may have. Sales growth may also be more persistent and predictable than earnings growth because it is less subject to accounting judgments. Here again AAII compares the company variance of year-over-year sales growth to its sector median. Companies with lower variance than their sector median are awarded a growth point. We present the annual sales growth to see the rate of annual growth these companies have experienced over the last five years. Facebook sales have expanded at a 41.5% annual rate over the last five years. While the year-by-year trend has been down, its sales growth has been more stable than that of most tech stocks. In contrast, stocks with poor G-scores have either negative sales growth or have not been around long enough to establish a measurable track record. Accounting Conservatism The final two growth signals deal with company actions that might depress current results but should result in greater growth and profitability in the future. Conservatism in accounting standards forces companies to expense outlays for many research and development (R&D) efforts even if they create valuable intangible assets that do not show up in a firm’s book value calculation.A firm is awarded a growth point for R&D intensity if its ratio of R&D to assets is higher than its sector median. The typical tech stock R&D intensity ratio is 9.4%. Software company Synopsys Inc.’s (SNPS) annual R&D spending represented 16.1% of assets. The same is true for capital expenditures (capex). One point is given for capex intensity if its ratio of capex to assets is higher than its sector median. Tech stocks spend more on building up their intangibles through R&D spending than on their capex. The median capex intensity ratio for the tech sector is 1.3%. Facebook and Alphabet stand out for their strong capex intensity ratios of 10.3% and 8.7%, respectively. Summing It Up Overall, Mohanram found that high-growth stocks with stronger G-scores outperformed those with lower G-scores, suggesting that the market fails to grasp the future implications of current fundamentals. Even with these financial tests, it is important to perform a careful analysis of any passing stock. However, the individual components of the G-score represent a useful checklist for investors examining growth stocks. The stocks meeting the criteria of the approach do not represent a “recommended” or “buy” list. It is important to perform due diligence. If you want an edge throughout this market volatility, become an AAII member. GOOGL shares were unchanged in after-hours trading Wednesday. Year-to-date, GOOGL has gained 28.22%, versus a 12.28% rise in the benchmark S&P 500 index during the same period."}]}