{"article": [{"url": "https://stocknews.com/news/dell-dg-dltr-3-buy-rated-stocks-reporting-earnings-this-week/", "published": 1598357300.0, "headline": "3 'Buy Rated' Stocks Reporting Earnings This Week", "body": "A company’s quarterly earnings reports are sought-after financial releases, as they give investors insight to a company’s business activities and its expectations of future performance. In addition, the management commentary helps investors assess the company’s efforts to improve the growth of their businesses. Management commentaries have been very useful for investors in this earnings season, as most of the companies reported so far have shed light as to how they are dealing with the problems caused by the coronavirus pandemic. Dell Technologies Inc. (DELL), Dollar General Corporation (DG), and Dollar Tree, Inc. (DLTR) are three ‘Buy Rated’ stocks scheduled to report their earnings this week. So keep an eye out for these stocks because they’re likely to see increased volatility. 7 Best ETFs for the NEXT Bull MarketDell Technologies Inc. (DELL) The multinational computer technology company has gained more than 90% since its March lows. DELL will conduct a conference call on August 27, 2020 at 4:30 p.m. CDT to discuss its fiscal 2021 second-quarter financial results. DELL has an impressive earnings surprise history with the company surpassing consensus EPS estimates in three of the trailing four quarters. DELL’s consensus revenue estimate of $22.52 billion for the second quarter indicates a year-over-year decrease of 4%. The market expects the company to report an EPS of $1.39 for the same quarter, which represents a 54.7% decline from the year-ago number. DELL is exploring a potential spin-off of its 81% ownership of VMware which could unlock value for shareholders, benefit team members as well as customers by simplifying capital structures and creating additional long-term enterprise value. However, the spin-off would not occur prior to September 2021. In the first quarter fiscal 2021 ended May 1st 2020, DELL’s total net revenue remained almost the same and net income decreased 5% year-over-year. How does DELL stack up for the POWR Ratings? A for Trade Grade A for Buy & Hold Grade A for Industry Rank B for Peer Grade A for Overall POWR Rating You can’t ask for better. The stock is also ranked #3 out of 28 stocks in the Technology-Hardware industry. Dollar General Corporation (DG) The discount retailer based in Tennessee has returned more than 30% since its March lows. DG is scheduled to release its financial results for the fiscal 2020 second quarter on August 27, 2020. The market expects the company to report an EPS of $2.44 for the quarter, which represents a 40.2% increase over the year-ago number. DG’s consensus revenue estimate of $8.35 billion for the same quarter indicates a year-over-year increase of 19.6%. DG’s earnings surprise history looks pretty good with the company surpassing consensus EPS estimates in each of the trailing four quarters. DG plans to expand its distribution footprint through the addition of one traditional distribution center in Walton, Kentucky and three DG Fresh cold storage facilities in Bowling Green, Kentucky; Ardmore, Oklahoma and West Sacramento, California. In the fiscal year 2020 first quarter ended May 1st 2020, DG’s net sales increased 27.6% and EPS increased 73% year-over-year. It’s no surprise that DG is rated “Strong Buy” in our POWR Ratings system. It also has an “A” for Trade Grade, Buy & Hold Grade and Industry Rank, and a “B” for Peer Grade. In the 18-stock Grocery/Big Box Retailers industry, it is ranked #4. Dollar Tree, Inc. (DLTR) DLTR is a single-price-point retailer in North America which operates thousands of stores across 48 states and five Canadian provinces. The stock has grown more than 30% since its March lows. DLTR will host its conference call on August 27th, 2020 to discuss financial results for the second quarter ended August 1, 2020. DLTR’s consensus revenue estimate of $6.2 billion for the quarter indicates a year-over-year increase of 8%. The market expects the company to report an EPS of $0.91 for the same quarter, which represents a 19.7% increase over the year-ago number. In the first quarter ended May 2nd 2020, DLTR’s consolidated sales were up 8.2% year-over-year and earnings per share was $1.04 as compared to $1.12 per share in the year-ago quarter. DLTR’s POWR Ratings reflect this promising outlook. It has an overall rating of “Buy” with an “A” for Trade Grade and Industry Rank and a “B” for Buy & Hold Grade. Among the 18 stocks in the Grocery/Big Box Retailers group, it’s ranked #9. Want More Great Investing Ideas? The Best of StockNews 2 Step Process to Sell @ Market Top in September 9 “BUY THE DIP” Growth Stocks for 2020 DELL shares rose $0.56 (+0.92%) in after-hours trading Tuesday. Year-to-date, DELL has gained 18.00%, versus a 8.02% rise in the benchmark S&P 500 index during the same period."}]}