{"article": [{"url": "https://stocknews.com/news/amzn-t-nflx-roku-4-streaming-stocks-to-consider-as-lockdowns-resume/", "published": 1593605300.0, "headline": "4 Streaming Stocks to Consider as Lockdowns Resume", "body": "Streaming stocks are all the rage these days as more households cut the cord on cable. The beauty of streaming video is it’s low-cost. There also aren’t as many commercials on streaming that plague cable. As more people are now stuck inside due to the spread of COVID-19, streaming video stocks make a lot of sense. Most investors would be surprised to learn that one-quarter of all households with the internet subscribe to a streaming video service. It is also quite interesting to learn that nearly three-quarters of homes in the United States still shell out money for cable TV. It won’t take long for this figure to start moving down. Amazon (AMZN), AT&T (T), Netflix (NFLX), and Roku (ROKU) have the potential to reach new highs as streaming popularity continues to skyrocket. 9 \"BUY THE DIP\" Growth Stocks For 2020Amazon (AMZN) If you go on AMZN’s Prime service, I’m sure you would find something you enjoy watching. Even if you are not into movies and dramas, you or someone in your family will still find a way to be entertained by AMZN’s uber-popular Twitch video game streaming service. Twitch is the largest video game streaming platform in the United States. When you also consider that AMZN is making a lot of money from its other businesses, such as online sales, you have more reason to consider the stock for your portfolio. AMZN is looking to spend $7 billion on Amazon Prime content this year, but that is merely a drop in the company’s bucket. POWR Ratings have AMZN ranked as the top stock out of 52 stocks in the Internet industry. The company also has an overall rating of Strong Buy. AT&T (T) T is now a player in the streaming video space. The company provides telecommunications services for phones and the internet, yet it is continuously looking to expand with additional new offerings. T is responsible for HBO Max, a combination of HBO and Warner Media entertainment content. The service features the content from DC Universe films, Friends, Game of Thrones, and more. Revenue growth should also continue to soar thanks to the arrival of their 5G wireless service. The POWR Ratings have T ranked 9th of 24 stocks in the Telecom – Domestic industry. The average analyst price target is $34.26. Netflix (NFLX) If you don’t have an NFLX account, you likely know someone that does. If even you consider NFLX’s original content to be subpar, the stock keeps on climbing. NFLX’s Tiger King series went viral when the coronavirus pandemic began, boosting the streaming video provider’s subscriptions to all-time highs. NFLX stock followed suit, jumping from $298 to its current price of $455. NFLX makes money from its subscription fees, as well as the data it collects on nearly 200 million worldwide subscribers. NFLX should reach 80 million subscribers in the United States by this time next year after more Americans cut the cord on cable. NFLX has a Strong Buy in the POWR Ratings and is ranked #2 out of 52 stocks in the Internet industry Roku (ROKU) ROKU is still a video streaming power player even though it does not directly provide original content. Instead, ROKU devices connect TVs to streaming services, including video games, and the company takes a cut from each subscription. ROKU devices are small and easy to forget about, yet they seem to have staying power. ROKU also now sells its own Roku TVs that are growing in popularity. The company makes one of every three smart televisions sold in the United States. ROKU’s active accounts are up nearly 40% in the first quarter of 2020. Want More Great Investing Ideas? 9 “BUY THE DIP” Growth Stocks for 2020 Is the Bull S#*t Rally FINALLY Over? 7 “Safe-Haven” Dividend Stocks for Turbulent Times Top 3 Investing Strategies for 2020 AMZN shares fell $6.90 (-0.24%) in after-hours trading Wednesday. Year-to-date, AMZN has gained 55.79%, versus a -2.53% rise in the benchmark S&P 500 index during the same period."}]}