{"article": [{"url": "https://stocknews.com/news/kodk-kndi-htbx-tsla-most-popular-stocks-robinhood-investors-are-buying-today/", "published": 1596110900.0, "headline": "MOST Popular Stocks Robinhood Investors Are Buying Today", "body": "In some circles, the stock trading app Robinhood is seen as a harbinger of where millennials are putting their money. After the market hit bottom in March, the rally over the ensuing four months not only provided investors an opportunity to recoup losses but attracted short term traders on Robinhood looking for massive gains. The Robinhood platform has brought a new generation of day traders that search for the latest speculative stock story. By now, many investors are familiar with the Robinhood 100, a list of the top 100 popular stocks held by their customers published on the Robinhood site. But many are not familiar with an independent website that provides analytics on Robinhood customers. This website, Robintrack, published a list of the largest changes in popularity. This list can give us insight into the most popular stocks Robinhood customers add to their portfolios each day. The most popular stocks over the past 24 hours are Eastman Kodak (KODK), Kandi Technologies Group (KNDI), and Heat Biologics (HTBX). 7 Best ETFs for the NEXT Bull MarketEastman Kodak (KODK) KODK operates via several business segments, including Print Systems, Brand, Film and Imaging, 3D Printing Technology, and more. The most popular stock over the last 24 hours was up over 200% on Tuesday and 318% on Wednesday. Investors are excited about new capital infusion and a new business line. The company, which is primarily known as an imaging company, is taking a $765 million government loan to start a generic drug-ingredient business. While it’s difficult to forecast how this will play out, the loan more than doubles the company’s size to a valuation above $1 billion. Almost 110,000 Robinhood accounts have added this stock over the past three days. Only 9,278 accounts held KODK 3 days ago. The stock is now up 674% year to date and 1,558% over the past five days. Kandi Technologies Group (KNDI) KNDI is engaged in the development, production, and distribution of electric vehicle products, parts, and off-road products in the Chinese market. The company announced today the launch of the most affordable electric cars in the U.S. market. The models, the Kandi K27 and K23, will initially be sold in the Dallas-Fort Worth area where Kandi America is located. The stock was up 140% on Wednesday and is already up over 30% today due to the news. The two models are small and affordable. The K27 has a 17.7 kWh battery with an estimated range of 100 miles. The car will be priced at $19,999 before incentives. The K23 has a 41.4 kWh battery with an estimated range of 188 miles. That model will cost $29,999 before incentives. Those aren’t exactly Tesla (TSLA) prices, so I can see why investors are excited. Over the last 24 hours, 16,446 Robinhood accounts added the stock to their portfolios. KNDI has a Buy rating in our exclusive POWR Ratings system. It is the #19 ranked stock in the China sector. Heat Biologics (HTBX) HTBX is a US-based immuno-oncology company. The company develops therapies that activate a patient’s immune system against cancer by utilizing an engineered form of gp96. The company has two T cell-stimulating therapeutic vaccine platform technologies, Immune Pan-Antigen Cytotoxic Therapy (ImPACT) and Combination Pan-Antigen Cytotoxic Therapy (ComPACT). The company’s stock was up over 7% yesterday in response to a positive update on its COVID-19 vaccine. HTBX announced that its vaccine candidate had exhibited evidence of immunogenicity, which is the ability to stimulate the body’s immune response. The news certainly caught the attention of traders on the Robinhood platform, as 4,829 investors added the stock to their portfolio. Investors are hoping that HTBX can get a government grant to help in developing a vaccine. Want More Great Investing Ideas? 9 “BUY THE DIP” Growth Stocks for 2020 How HIGH Can This Tech Bubble Fly? 7 “Safe-Haven” Dividend Stocks for Turbulent Times KODK shares were trading at $36.37 per share on Thursday morning, up $3.17 (+9.55%). Year-to-date, KODK has gained 682.15%, versus a 1.28% rise in the benchmark S&P 500 index during the same period."}]}