{"article": [{"url": "https://stocknews.com/news/tsla-nkla-nio-trading-options-on-the-next-tesla/", "published": 1594814900.0, "headline": "Trading Options On The “Next Tesla”", "body": "In a year of unpredictable market action, perhaps the most eye-opening moves are occurring in electric vehicle (EV) stocks. EV companies like TSLA are all the rage right now. Just about any stock that has some relationship to electric vehicles sees a ton of action (in the stock and the options). Tesla (TSLA) Just look at what Tesla (TSLA) has done. The 52-week range in TSLA’s stock price runs from a low of $211 to a high of… $1,795. That’s some range. As of this writing, the share price was up 257% year to date, making it the 19th largest company listed on US exchanges. 7 \"SAFE HAVEN\" Dividend Stocks for Turbulent Times As wild as the rise in TSLA has been, at least the company is selling a popular product. Annual sales are something like $26 billion. Yet, other EV stocks are flying and haven’t sold a single vehicle. Nikola (NKLA) Look at Nikola (NKLA), for example. The electric truck company has seen its stock climb over 400% since it went public this spring. The company is now valued at $20 billion…without selling a single truck. Typically, this is the sort of behavior we see in a stock bubble (for instance, internet stocks circa 2000). NIO (NIO) By comparison, the stock action in Chinese electric vehicle manufacturer NIO (NIO) looks almost reasonable. NIO makes electric SUVs in China, and unlike many competitors, it actually has sales. In fact, annual sales are over $1 billion. The market cap of $15 billion for NIO doesn’t seem nearly as surprising relative to NKLA. Still, NIO stock is up 240% this year and is trading at roughly 15x sales. That’s expensive by any measure. (As insane as TSLA’s move has been, it’s still trading at about 10x sales.) Could NIO (sometimes referred to as the Tesla of China) be worth its sky-high valuation? After all, China is really pushing EVs in the country…and, we know the market there is massive. Another thing NIO has going for it is that the stock is only trading for around $14. That means the options on the stock will also be inexpensive compared to other stocks in the space. And sure enough, options volumes on NIO have been extreme. The 90-day average options volume for NIO is 160,000 contracts. That’s in a similar ballpark to Disney (DIS)! As you can imagine, most of the activity in NIO options appears to be bullish. In fact, over the last 30 days, 75% of the order sentiment looks bullish. (Call buying is of course considered bullish, but so is selling puts.) Looking at a big order from this week, it looks like one trader is making a pretty large upside bet on NIO that expires on July 31. The trader bought 3,300 July 31 18 calls for $0.92, with the stock trading at $13.46. That means the stock has about two weeks to go to $18.92 for the trade to break even at expiration. It cost the trader just over $300,000 to make this trade, which is also the max loss on the position. Of course, the upside is unlimited should NIO take off. Considering how much NIO has moved this year, 92 cents isn’t a crazy price to pay for out-of-the-money options. The main challenge is that they have to pay off in just about two weeks, so the clock is ticking. Want more great investing ideas? Download free the “10-Step Options Trading Checklist” you need before making a trade. The Virtual Trading Pit Is Open: Trade Set-ups, Training, New Trading Ideas How to Try Out Options Without Risking a Penny TSLA shares . Year-to-date, TSLA has gained 269.57%, versus a 1.03% rise in the benchmark S&P 500 index during the same period."}]}