{"article": [{"url": "https://stocknews.com/news/ufpi-bcc-eva-3-lumber-and-wood-product-stocks-to-add-to-your/", "published": 1596629300.0, "headline": "3 \"Lumber and Wood\" Product Stocks to Add to Your Portfolio", "body": "Lumber and wood product stocks have had significant growth in the last couple of years due to rising demand and increasing application diversity. In 2019, the gross value associated with paper, wood, and furniture manufacturing industries totaled nearly $107.5 billion. In the US, paper, wood, and furniture manufacturing industries contributed 5.7% of total manufacturing GDP. The industry is also an integral part of the US workforce. Forestry-related businesses support 2.9 million total jobs and are associated with $128.1 billion in total payroll. These stocks are especially benefiting from rising lumber prices due to the strength in housing. According to CoreLogic, home prices in the US increased by 4.9% annually in June, a much greater gain than the 4.1% annual rise in May. And home prices climbed 1% month to month, which is the fastest monthly gain for June since 2013. 7 Best ETFs for the NEXT Bull MarketTherefore, investors should consider lumber and wood product stocks to diversify their portfolio. Universal Forest Products Industries, Inc. (UFPI), Boise Cascade, L.L.C. (BCC), and Enviva Partners (EVA) are the three lumber and wood stocks that are poised for more gains. Universal Forest Products Industries, Inc. (UFPI) UFPI is one of the world’s largest producers of wood and wood-alternative products. It provides capital, management, and administrative resources to subsidiaries that supply wood, wood composite, and other products to three robust markets: retail, construction, and industrial markets. With over 143 facilities worldwide, the company is operating in 8 countries of North America, Europe, Asia, and Australia. UFPI recently acquired T&R Lumber, which manufactures a range of products used primarily by nurseries, including tree boxes, plastic containers, stakes, and trellises. Moreover, the company also went for a share repurchase program in the first quarter of 2020. The second-quarter results impressed the market. Earnings from operations of $92.4 million grew more than 24.7%, year over year. Operating cash flow more than doubled to $147.2 million for the first six months of 2020, up 106.8% over the same period of 2019. There was a positive earnings surprise of 86.2% as reported EPS stood $1.08 versus the consensus estimate of $0.58. The company’s EPS is expected to grow at 17% per year for the next 5 years. UFPI is up more than 100% from its 52-week low of $29.17 and since June, has been making new, all-time highs. How does UFPI stack up for the POWR Ratings? A for Trade Grade A for Buy & Hold Grade B for Peer Grade A for Industry Rank A for Overall POWR Rating You can’t ask for better. The stock is also ranked #1 out of 3 stocks in the Industrial – Wood industry. Boise Cascade, L.L.C. (BCC) BCC is a leading manufacturer and distributor of building materials and wood products. It operates in the United States and Canada where it sells its products to wholesalers, home improvement centers, retail lumber yards, and industrial converters. The company strengthened its liquidity in the current quarter by issuing $400 million worth of Senior Notes. Further, the company witnessed no significant supply chain disruptions amid the pandemic. For the second quarter, the company reported a $1.2 billion top-line figure which was up nearly 1% year over year. Moreover, net income increased 21.3% year over year to $33.6 million. BCC reported an EPS of $0.85, beating the consensus estimate by 57.4%. Also, the company surpassed street EPS estimates in three of the trailing four quarters. BCC hit a 52-week low of $20.08 in the virus-led crash on March 23rd but it is already up more than 135% from that level. The street is expecting the company’s EPS to grow by 22.7% next year. As per our POWR Ratings, BCC is a “Buy”. It also holds an “A” in Trade Grade. It is currently ranked #3 out of 3 stocks in the Industrial – Wood industry. Enviva Partners, LP (EVA) EVA focuses on the production and distribution of utility-grade wood pellets to power generators. The company specializes in sustainable wood bioenergy. It is one of the world’s largest producers of sustainable wood pellets, which provide a low-carbon alternative to fossil fuels. Its manufacturing facilities provide utility customers with reliable, renewable fuel to replace coal and complement wind and solar technologies. EVA has nine manufacturing plants in six US states. EVA completed the acquisition of Georgia Biomass, a leading global energy company specializing in sustainable wood bioenergy, in the current quarter. The deal will help the company to work closely with local leaders, private forest landowners, and conservation organizations to continue to make a positive impact. Moreover, the company is planning a recapitalization and new equity commitment to finance future growth. The street awaits the second-quarter financial report, which is scheduled to be announced this week. The consensus estimate for the EPS stands at $0.34, which indicates a 70% increase year over year. Revenue is expected to be $208.7 million, which indicates a year-over-year improvement of 24.2%. For the first quarter of 2020, the EVA reported a net income of $7.6 million compared to a loss of $8.9 million a year ago. EVA has already recovered close to 90% from its March low of $20.63 and is currently trading at $39.06, close to its pre-crash high of $39.31. EVA’s POWR Ratings reflect this promising outlook. It has an overall rating of “Strong Buy” with an “A” for Trade Grade, Buy & Hold Grade, and Industry Rank. The stock is currently ranked #2 out of 3 stocks in the Industrial – Wood industry. Want More Great Investing Ideas? 9 “BUY THE DIP” Growth Stocks for 2020 How to Trade THIS Stock Bubble? 7 “Safe-Haven” Dividend Stocks for Turbulent Times UFPI shares were unchanged in after-hours trading Wednesday. Year-to-date, UFPI has gained 28.69%, versus a 4.13% rise in the benchmark S&P 500 index during the same period."}]}