{"article": [{"url": "https://stocknews.com/news/spy-the-best-and-worst-thing-retirees-can-do-ahead-of-66210704/", "published": 1595592500.0, "headline": "The Best and Worst Thing Retirees Can do Ahead of a Big Market Decline", "body": "In part one of this series, I explained what JPMorgan’s (JPM) head quant thinks is potentially driving the craziest stock market bubble in history. Why The Craziest Bubble In History Might Get Even Bigger In part two I explained one of the smartest ways retirees can protect themselves from the carnage that always follows the eventual popping of all bubbles. How to Protect Your Retirement Portfolio From the Craziest Bubble in History In part three I explained the potential exact catalyst that could send the S&P 500 plunging 30% in short order, possibly by the end of the year. Why the Stock Market Might Soon Plunge 30% 7 Best ETFs for the NEXT Bull MarketNow, in the final and most important installment of the crazy bubble series, I’ll explain the best and worst ways retirees can prepare for the inevitable short-term market pain that’s to come. One of these I’ve already covered in part two. What makes this article the most important one of the series is that the smartest immediate way you can protect your net egg is the one you can use immediately if your personal prudent risk-management rules require it. After that, I’ll explain the single worst mistake retirees can make, that has killed more retirement dreams than any bear market in history. Prudent Portfolio Rebalancing: The Smartest Way to Protect Yourself From the Inevitable Popping of This Bubble In part two of this series, I explained the importance of sensible diversification and prudent asset allocation for your risk profile. Well over time, you must maintain that proper balance between stocks, cash, and bonds because stocks will naturally outperform the other two. Here is how a 60/40 stock/bond portfolio would look over time. At the height of the tech bubble it was 77% stocks and at the end of 2019, the 2nd best year for equities in 20 years, it was 80%. Today, depending on which indexes you owned, it could be 85% stocks, 15% cash and bonds. While such a “buy and hold forever” approach might work for a few truly volatile insensitive investors, it leads to truly gutwrenching volatility that can turn all but the most disciplined investors into forced sellers in a bear market. 60/40 Portfolio Rebalancing Strategies 1994 to 2019 Over the last 25 years, annual rebalancing has been the most effective way of achieving both strong absolute and volatility-adjusted total returns. It’s also been the most tax-efficient strategy other than not rebalancing at all. Dividend Kings recommends annual rebalancing, on a schedule, so that you avoid overtrading, one of the cardinal sins that, as I’ll soon explain, is the single biggest retirement killer in history. If your current asset allocation is dangerously out of whack, meaning outside of your stock/bond/cash allocation ranges, then trimming your most overvalued stocks to rebalance into bonds/cash is NOT market timing, it’s prudent risk-management. But be very careful to not use a market bubble such as this as an excuse to market time. The difference between prudent rebalancing and market timing is that rebalancing means bringing your asset allocations back into a reasonable range for your risk profile. If you’re targeted asset allocation is 70%, and you’re now 85% stocks, then you’d only trim enough stocks to get back to your target allocation range. You’d still own 70% to 75% stocks. You NEVER jump “all in or all out” of stocks or otherwise make major and sudden shifts in asset allocation that aren’t likely to meet your long-term goals. And here’s why. Market Timing: The Single Biggest Retirement Dream Killer In History And a Strategy to Avoid At All Costs You might think that I’m recommending selling all your stocks and going 100% into cash or bonds. Such market timing seems the ideal strategy when all the facts we have to say that the craziest market bubble in history is likely to end sooner rather than later and likely in dramatic fashion. That’s actually the exact opposite of what I’ve been advising Dividend Kings member and Seeking Alpha readers for weeks now. Why? Because markets only have to make sense in the long-term. Time Frame (Years) Total Returns Explained By Fundamentals/Valuations 1 9% 2 18% 3 27% 4 36% 5 45% 6 54% 7 63% 8 72% 9 81% 10+ 90% to 91% (Source: Dividend Kings S&P 500 Valuation & Total Return Potential Tool) It takes 6 years for 54% of total returns to be explained by fundamentals and 10 years before fundamentals and valuations explain 90% of returns. Valuations and fundamentals can NOT be used to time the market. All high valuations can tell us is that long-term returns will be much lower than when valuations are sensible or low. There is no question that eventually sentiment gives way to facts and sound valuations. But for many years, up to six or even seven in the case of the tech bubble, sentiment and wild speculative frenzy can rule the day. Over the last 20 years, market timing has resulted in 0.3% inflation-adjusted total returns, killing millions of retirement dreams. (Source: Dalbar) Over the last 30 years, an entire investing lifetime for many people, the same has held true, not just for stocks but for bond investors as well. In contrast, look at how simple dollar-cost averaging has done. Here is an excerpt from a wonderful Schwab report published last week which recommends dollar-cost averaging as the “antidote for market timing”. A built-in benefit of dollar-cost averaging is that it is an antidote to market timing. We all hear about people who want to find that perfect moment to invest and make a killing. And I hear you when you say that you don’t want to invest just to see your values go down. But at Schwab we have a saying that it’s time in the market, not timing the market, that matters. In fact, the length of time you invest matters much more than entering the market at the best time. Let me share some more statistics that illustrate this point. Investments in stocks have outperformed cash over every 20-year period from 1926 to 2019, by a large margin. During these 90-plus years, the average ending wealth for an investor who put $2,000 a year in cash investments for 20 years is approximately $64,500. The average ending wealth for an investor who put their $2,000 a year in the stock market with perfect timing (always investing at the low) is approximately $175,000. And the most interesting data point of all is that the investor who put their $2,000 in the market on the first day of the year, without any thought for timing, would end up with approximately $162,000. In other words, they made almost as much as the perfect timer and outperformed the procrastinator by a three-fold margin.” – Charles Schwab According to this research from Schwab (SCHW), over the past 20 years, simple dollar-cost averaging would have resulted in 93% of the same returns as PERFECT market timing. And when you factor in taxes? Then there was basically no difference at all. And in case Schwab isn’t enough for you, how about these incredible findings from Ritholtz Wealth Management’s chief data scientist Nick Maggiuelli. From 1970 to 2019 Mr. Maggiulli found that perfect market timing of the Dow Jones Industrial Average would have resulted in 22% better total returns compared to just buying stocks on a predetermined schedule. This amounts to 0.4% CAGR better returns, for following a strategy that is actually impossible to pull off in real life. After taxes, perfect market timing would have made LESS money than perfect market timing. What does this ultimately mean? Market timing is impossible If it were possible, it wouldn’t be worth doing In contrast, prudent asset allocation, diversification, and overall risk-management are all simple, effective and time tested principles that can construct a bunker sleep well at night portfolio. Build The Ultimate Sleep Well At Night Retirement Portfolio With These 15 High-Yield Blue-Chips This is exactly what I do in this step-by-step article, in which I create a high-yield, low-volatility blue-chip portfolio that fell just 10% during the peak of the Great Recession. While every downturn is slightly different, I think its reasonable to assume that if the 2nd biggest market crash in history didn’t cost investors any sleep back then, that you’ll sleep well at night no matter what happens next with the economy, pandemic or stock market. Bottom Line: The Craziest Bubble In History Will End Eventually, So Use Smart Asset Allocation & Prudent Rebalancing to Ensure Your Retirement Goals Survive When It Does I’m not a market timer, and I can’t tell you whether the craziest bubble in history will pop tomorrow or six years from now. What I can tell you is that broader market valuation has never been more disconnected from fundamental reality, and we’re facing several risk factors, anyone one of which might trigger a major market correction The worst pandemic in 100 years and the worst economy in 75 years An election that could increase risks of a corporate tax hike in 2021 to about 80% A sudden spike in volatility that reverses the flow of $400 billion in algo-driven hedge funds that only care about volatility and ignore valuations and fundamentals The panicking of new retail investors who, while not driving the majority of this bubble, have increased overall volatility and could thus making the next correction faster and briefly more painful I haven’t spent weeks and dozens of pages trying to scare anyone out of stocks. Quite the contrary, my goal has been to warn retirees about both the realities of what we face today and how to prudently protect your hard-earned savings from a perfectly normal and healthy correction that is eventually inevitable. Market timing SEEMS like the natural approach to take. If stocks are set to eventually fall 20%, 30% or even 40%, then why not just go to cash and buy back in later? Yet the studies I’ve shown in this article, from Schwab and Ritholtz Wealth Management make very clear that Market timing is almost impossible to do Even if you could do it with perfection, the net benefit, after taxes, would be basically zero Meanwhile, the studies from JPMorgan Asset Management and Dalbar make it very clear that market timing is a siren song that has killed more retirement dreams than any bear market in history. Trusting prudent diversification and proper risk-management, in other words, smart portfolio construction, is the best way retirees can navigate today’s dangerous market and economic risks. I and Dividend Kings members are NOT losing sleep at the prospects of a major correction coming at some point, possibly even by the end of the year. To be forewarned is to be forearmed. We are combining a prudent and potent combination of smart dollar-cost-averaging into undervalued and safe blue-chip dividends stocks, with a reasonable asset allocation into bonds/cash so we can aggressively take advantage of the coming market mayhem. I like to say that only God knows what the market will do next, and he doesn’t hand out stock tips. The timing, duration, and magnitude of the next correction are irrelevant to the prudent long-term investor. (Source: AZ quotes) Gamblers, speculators, and market timers pray for luck. Prudent long-term income investors make their own luck through a steadfast and time-tested dedication to what works, which is a focus on quality first and prudent valuation & risk-management always. Want More Great Investing Ideas? 9 “BUY THE DIP” Growth Stocks for 2020 Top 5 WINNING Stock Chart Patterns 7 “Safe-Haven” Dividend Stocks for Turbulent Times SPY shares were trading at $320.34 per share on Friday afternoon, down $2.62 (-0.81%). Year-to-date, SPY has gained 0.55%, versus a % rise in the benchmark S&P 500 index during the same period."}]}