{"article": [{"url": "https://stocknews.com/news/gld-gold-nem-golds-bull-market-still-has-a-long-run-ahead-of/", "published": 1600258100.0, "headline": "Gold’s Bull Market Still Has a Long Run Ahead of It — Here’s Why", "body": "Raise your hand if you knew nothing about gold stocks in March 2020. It’s OK if you didn’t — you wouldn’t be alone. Few folks paid attention to gold’s recent price explosion, which caught many of the “experts” by surprise. 7 \"SAFE HAVEN\" Dividend Stocks for Turbulent TimesOnly some of us watched as a stealthy bull market crept into gold these last two years. As recently as September 2018, the price of gold was below $1,200 per ounce. It steadily climbed out of that hole to peak at $1,680 per ounce in March… only to plunge 12% in just 10 days. At that point, hardly anyone cared. That is, until it was clear that only bailouts could save the world’s economies. Money printing, economic crises, and fear of inflation are like gasoline on a fire when it comes to gold prices. That’s exactly what happened. Suddenly, at the height of the pandemic, no gold bullion was available. The yellow metal’s price soared from $1,471 on March 19 to an all-time high of $2,063 per ounce on August 6. That’s a 40% gain since March, and a 75% return in just two years. Meanwhile, the long-forgotten mining companies that produce gold are back in the spotlight, with gold and gold stocks making headlines all the time. Even big-time investors like Warren Buffett have started buying gold miners. The reason, as I laid out for you here, is that miners will soon cash in on these higher prices. Now, retail investors are looking at gold stocks, too. And the overwhelming question they have is: “Did I miss it?” My answer to you is: “No.” Let me show you why… Gold’s Price May Have Soared, But Mining Stocks Haven’t Gold’s recent move higher is comparable to its move from 2008 to 2011. Here’s a chart showing the movement in gold over that time period. During that same period, the NYSE Gold Bugs Index (HUI) rose 320%. This index tracks major gold miners like Barrick Gold (GOLD) and Newmont Mining (NEM). As you can see on the following chart, in October 2008, HUI hit a low of 151 points before peaking in September 2011, at 635 points. As you can see on the following chart, in October 2008, HUI hit a low of 151 points before peaking in September 2011, at 635 points. Let’s compare that activity to what’s happened recently. Gold’s price blew through its previous high, set back in 2011 (which you see in the highlighted part of the chart). Now, it seems poised to make a new all-time high within the next couple of years. Yet the Gold Bugs Index hasn’t matched that move. Just take a look at this chart: As you can see, today the index is well below the 2011 high (highlighted on the chart). The truth is that most investors won’t leave technology stocks or the tech-heavy Nasdaq. In fact, the bulk of the investment universe has ignored metal and mining stocks for years. While the major gold miners have moved higher, they’re nowhere near their peak from 2011. And yet the price of gold is already above that point. This means that all of these gold miners will make a lot of money selling gold — something that hasn’t happened in a decade. As next quarter’s results trickle in, I expect gold miners to get much more attention than we’ve seen so far. And the Gold Bugs Index could double this year. In other words, the gold miners’ big move is still ahead of us. So there’s still plenty of room for investors to make a ton of money off of them. Good Investing, Matt Badiali Want More Great Investing Ideas? Free Report: The Right Investment At The Perfect Time The Shocking Truth Why You Don’t Make More Money In Stocks Discover the Strategy That’s Delivered Over a 90% Win Rate and Could Have Turned $10,000 into $233,000 in Just One Year GLD shares were trading at $184.60 per share on Wednesday afternoon, up $1.15 (+0.63%). Year-to-date, GLD has gained 29.18%, versus a 7.17% rise in the benchmark S&P 500 index during the same period."}]}