{"article": [{"url": "https://stocknews.com/news/amgn-gmba-alxn-immu-4-biotech-stocks-to-own-for-the-rest-of-2020/", "published": 1600949300.0, "headline": "4 Biotech Stocks to Own for the Rest of 2020", "body": "The struggling healthcare industry is currently relying on biotech and pharmaceutical companies to beat the pandemic. From detecting the deadly virus caused disease thorough tests to appropriate medication, the biotech industry has stepped up to facilitate medical care during these challenging times. Apart from working on COVID related issues, the industry has revolutionized treatment of several diseases through the integration of technology. Biotech companies are often termed as building blocks of the future, as they constantly strive to develop medication for the most challenging ailments. Companies such as Amgen Inc. (AMGN), Alexion Pharmaceuticals (ALXN), Genmab A/S (GMAB) and Immunomedics, Inc. (IMMU) are involved in treating or finding a treatment for cancer, one of the most complicated and fatal diseases of the 21st century. These companies should benefit significantly as their clinical trials show impressive results for their cancer drug candidates. 7 Best ETFs for the NEXT Bull MarketAmgen Inc. (AMGN) AMGN develops human therapeutic medication for the treatment of cardiovascular, oncology and neuroscience related diseases. Its supply chain comprises wholesale distributors and direct-to-consumer channels. AMGN has recently been included in the Dow Jones Industrial Average AMGN collaborated with Eli Lilly and Company (LLY) to manufacture Lilly’s potential COVID vaccine. This would allow the two companies to generate profits from scaled up production and supply. AMGN has also shown significant progress in its ongoing clinical trials for refractory melanoma and lung carcinoma. AMGN reported a 6% year-over-year increase in total revenues to $6.20 billion in the second quarter. Non-GAAP EPS increased 7% from the year-ago value to $4.25, while non-GAAP operating income rose 9% from the same period last year to $3.20 billion. The consensus EPS estimate of $3.80 for the third quarter ending September 2020 indicates a 3.8% rise year-over-year. Moreover, AMGN has an impressive earnings surprise history, as it beat the street EPS estimates in each of the trailing four quarters. A consensus revenue estimate of $6.35 billion for the upcoming quarter indicates a 10.7% rise from the same period last year. AMGN has gained more than 45% since hitting its 52-week low of $177.05 in March. The stock hit its 52-week high of $264.97 in June. How does AMGN stacks up for the POWR Ratings? A for Trade Grade B for Buy & Hold Grade A for Peer Grade B for Overall POWR Rating. It is also ranked #1 out of 373 stocks in the Biotech industry. Alexion Pharmaceuticals (ALXN) ALXN is a biopharmaceutical company commercially engaged in the production of therapeutic products. On September 21st, it received positive opinion and marketing recommendations from the Committee for Medicinal Products for Human Use and the European Union respectively for its product Ultomirisis. ALXN also partnered with Caelum Biosciences to develop an amyloid fibril targeted therapy, which is in phase III clinical trials. The company reported a 20% year-over-year increase in net revenue to $1.44 billion in the second quarter that ended in June 2020. Non-GAAP diluted EPS rose 17.8% to $3.11 during this time period. Though the consensus EPS estimate of $2.47 for the third quarter ending September 2020 indicates a year-over-year decline, ALXN beat the street EPS estimates in each of the trailing four quarters, which bodes well for the stock. The consensus revenue estimate of $1.39 billion for the third quarter indicates a 10% rise year-over-year. ALXN has gained more than 65% since hitting its 52-week low of $72.67 in March. The stock hit its 52-week high of $121.50 in June. It’s no surprise that AMGN is rated a “Buy” in our POWR Ratings system, with a grade of “A” for Trade Grade and Peer Grade, and “B” for Buy & Hold Grade. It is also ranked #3 out of 373 stocks in the Biotech industry. Genmab A/S (GMAB) Based in Denmark, GMAB is an international biotechnology company that offers antibody therapeutics for cancer treatment. It currently has two approved antibodies, DARZALEX and Arzerra, and over 20 active pre-clinical programs. GMAB also has a licensing agreement with Janssen Biotech, making it entitled to royalties from the sale of daratumumab. With a huge client base in the United States, GMAB witnessed soaring revenues and earnings for the second quarter that ended in June 2020. Net revenue rose 604.2% year-over-year to DKK 5.54 billion, while net income grew 387.4% to DKK 3.37 billion. Diluted net result per share increased 370.3% to DKK 51.35 during this period. GMAB has delivered a trailing twelve-month gross profit margin of 100%. GMAB growth momentum is expected to continue well into the third quarter, as the consensus revenue estimate of $241.41 billion indicates a 55.8% improvement year-over-year. Moreover, the company has an impressive earnings surprise history, as it beat the street net result per share estimates in three out of the trailing four quarters. GMAB has gained more than 135% since hitting its 52-week low of $16.24 in March. The stock hit its 52-week high of $38.87 in September. GMAB is rated a “Buy” in our POWR Ratings system, consistent with its sound business model and growth potential. It has a grade of “A” in Trade Grade and Peer Grade, and a “B” in Buy & Hold Grade. It is currently ranked #2 out of 373 stocks in the Biotech industry. Immunomedics, Inc. (IMMU) IMMU is a clinical stage biopharmaceutical company developing monoclonal antibody-based products for targeted cancer treatment. Its pipeline comprises six clinical stage product candidates. Gilead Sciences (GILD) has recently announced that it has entered into an acquisition agreement with IMMU for $21 billion, which is expected to close by the fiscal fourth quarter. IMMU’s product Trodelvy has garnered $20.10 million in sales over the first two months of its commercial launch in April. The company maintained a strong liquidity position of $987.50 million at the end of the second quarter. IMMU gained more than 885% to hit its 52-week high of $86.91 in September since hitting its 52-week low of $8.80 in April. IMMU closed yesterday’s trading session at $85.17. IMMU’s strong fundamentals are reflected in its POWR Ratings. It is rated “Strong Buy” with a grade of “A” for Trade Grade, Buy & Hold Grade, and Peer Grade. In the 373 stock Biotech industry, IMMU is ranked #4. Want More Great Investing Ideas? 7 “Safe-Haven” Dividend Stocks for Turbulent Times When Does the Next Bull Run Start? Chart of the Day- See the Stocks Ready to Breakout AMGN shares were trading at $239.08 per share on Thursday afternoon, down $3.51 (-1.45%). Year-to-date, AMGN has gained 1.23%, versus a 1.81% rise in the benchmark S&P 500 index during the same period."}]}