{"article": [{"url": "https://stocknews.com/news/nke-pg-txn-cci-4-powr-ratings-upgrades-worth-a-look/", "published": 1593605300.0, "headline": "4 POWR Ratings Upgrades Worth a Look", "body": "Many stocks have rebounded from their March lows due to both fiscal and monetary stimulus steps implemented by the Fed and Congress. The markets have also seen a bounce from the slow reopening of the economy. This has helped several companies struggling during the lockdown period. The StockNews.com proprietary POWR Ratings are updated daily to reflect changes in the market. Many stocks in the system have been upgraded to Strong Buy. However, four stocks have separated themselves from the pack and have great potential to do well during these troubling times. Nike (NKE) 9 \"BUY THE DIP\" Growth Stocks For 2020NKE is diverting resources to digital to accommodate social distance guidelines and enhance profitability. There has been a surge in demand for their workouts during the lock down. These are available on the Nike Training Club app. NKE’s acquisition of cloud-based predictive analytics firm Celect last year should help the company manage its resources more wisely and create better products. NKE has returned 72.21% over the past three years and is up 16.83% over the last year. The average analyst price target is $110, which could mean a 13% upside. Twenty-two analysts have a Buy rating for NKE. The stock also has a Strong Buy in our POWR Ratings. One of the components that make up the POWR ratings is the Buy & Hold Grade. This measures the long-term bullish or bearishness of a stock. NKE has a Buy & Hold Grade of A. Procter & Gamble (PG) Procter & Gamble needs no introduction. With a market cap of $295 billion, the stock is known for its stable dividends. The company has a current dividend yield of 2.64%. PG has returned 67% over the past year and 4.89% over the past three months. PG has businesses in various consumer segments such as beauty, grooming, hair care, and home care. These areas are expected to see steady demand regardless of how the pandemic plays out. The stock has an average analyst price target of $134 which could mean that the stock still has 13% of upside. Eight analysts have Buy Ratings on PG. PG has a Strong Buy rating in the POWR Ratings. The company also tops the POWR Industry Rank as it is ranked #1 out of 33 Consumer Goods Stocks. The stock also has Trade Grade and Buy & Hold Grade of A. This means that the company has a positive outlook in both the short term and the long term. Texas Instruments (TXN) TXN is in the business of integrated circuits and semiconductors. The company recently introduced a new boost battery charger with integrated circuits that offer higher efficiency and power density. The new charger can be used in various functions and should help diversify TXN’s product list. TXN has an efficient production system that should help the company weather the current storm. The company has returned 11.78% over the past year and 24.56% over the past three months. Analysts have a price target of $140, which would represent 10% upside from yesterday’s closing price of $127. The stock has Strong Buy rating in our POWR Ratings and ranks #5 out of 86-company Semiconductor and Wireless Chip stocks. Crown Castle International (CCI) CCI owns and leases approximately 40,000 cell towers in the United States. The company operates as a real estate investment trust (REIT). REITs are highly dependent on debt, so the low-interest rate environment should reduce CCI’s interest expenses. This would help keep the company on a firm ground. CCI has returned 88.28% over the past three years and 16.61% over the past three months. The company currently sports a 2.87% dividend yield. CCI has a Strong Buy rating in our POWR Ratings. The company is ranked #1 out of 40 companies in the Real Estate Services industry. The stock has a Peer Grade of A. The Peer Grade compares a security’s performance versus other stocks in its industry. Want More Great Investing Ideas? 9 “BUY THE DIP” Growth Stocks for 2020 Is the Bull S#*t Rally FINALLY Over? 7 “Safe-Haven” Dividend Stocks for Turbulent Times Top 3 Investing Strategies for 2020 NKE shares were unchanged in after-hours trading Wednesday. Year-to-date, NKE has declined -3.35%, versus a -2.53% rise in the benchmark S&P 500 index during the same period."}]}