{"article": [{"url": "https://stocknews.com/news/amzn-baba-nio-atvi-4-buy-rated-robinhood-stocks-set-to-soar/", "published": 1602072500.0, "headline": "4 “Buy-Rated” Robinhood Stocks Set to SOAR", "body": "Vladimir Tenev and Baiju Bhatt built the Robinhood platform with the aim that everyone should have access to the financial markets, not just the wealthy. The platform leverages technology to encourage everyone to participate and rose to fame primarily by offering commission-free trades, no account minimums, and an easy-to-use mobile app. With people spending more time at home and many sports being shut down, Robinhood found an audience with young and first-time investors. While Robinhood doesn’t force users to trade and the platform can be used responsibly, critics say it gamifies investing. Robinhood publishes a list of the 100 most popular stocks on its platform based on how many users own the stock. For a stock to be listed on Robinhood’s 100 list, it usually has created some type of buzz in the market. Sometimes these stocks may not be the best investments long-term. While not all stocks listed on Robinhood are fundamentally sound, there are definitely some stocks that possess both popular sentiment and underlying financial strength. Amazon.com, Inc. (AMZN), Alibaba Group Holding Ltd (BABA), NIO Inc. (NIO), and Activision Blizzard, Inc (ATVI) are four such Robinhood-listed stocks that still have upside left. 7 Best ETFs for the NEXT Bull MarketAmazon.com, Inc. (AMZN) Unless you have been living under a rock and even then, you must have heard about AMZN. What started out in 1994 as a bookstore, now has become “an everything store” as envisioned by founder and CEO, Jeff Bezos. Already the world’s largest online retailer, AMZN also earns revenues through subscriptions from Amazon Music, and Prime Video. Besides manufacturing and selling electronic devices like the Fire tablet, Fire TV, Echo, Alexa, and Kindle, its Amazon Web Service (AWS) has been dominating the cloud computing industry. AMZN’s net sales increased 40% year-over-year to $88.9 billion in the second quarter. The company’s EPS is expected to increase 71.4% in the current quarter, 37.5% in the current fiscal year, and at a rate of 36.0% over the next five years. The market expects AMZN’s revenue to increase 32% in the current quarter and 31.4% in the current financial year. The stock has gained 83.5% since hitting its 52-week low of $1626.03 in mid-March. With the ‘Prime Day’ around the corner, the fall season could spell even more profits for AMZN. The market correction in September and the House Judiciary subcommittee recommending antitrust action, including the possible breakups of the Big Tech stocks, led to a decline in price of AMZN shares recently. However, this only means that it could be a good time to scoop up shares at a discount and benefit from future revenues. How does AMZN stack up for the POWR Ratings? B for Trade Grade B for Buy & Hold Grade B for Peer Grade B for Industry Rank B for Overall POWR Rating The stock is also ranked #9 out of 57 stocks in the Internet industry. Alibaba Group Holding Ltd (BABA) Often known as “the Amazon of China,” BABA is the leading platform for global wholesale trade operating mainly in China. It operates through four segments: Core Commerce, Cloud Computing, Digital Media and Entertainment, and Innovation Initiatives and Others. The company’s business has performed well especially as it met demand for the delivery services during the pandemic. A lesser known fact about BABA, is that it owns 47% of logistics affiliate Cainiao. In June 2020, Cainiao Post recorded over 100% year-over-year growth in average daily package volume. BABA has an impressive earnings surprise history with the company surpassing EPS estimates in each of the trailing four quarters. The market expects BABA’s revenue to increase 55.4% in the current quarter and 36.2% in the current financial year. The company’s EPS is expected to increase 15.7% in the current quarter, 23.5% in the current fiscal year, and at a rate of 3.4% in the next five years. The cloud computing industry has been the talk of the town and Alibaba Cloud was the largest public cloud service provider in China for the quarter that ended March 31, 2020. In the June 2020 quarter, cloud computing revenue grew 59% year-over-year to $1,747 million, primarily driven by an increased revenue contribution from both public cloud and hybrid cloud businesses, reflecting higher average revenue per customer. The stock has gained 37.85% year-to-date. BABA’s POWR Ratings reflect this promising outlook. It has an overall rating of “Strong Buy” with an “A” for Trade Grade, Peer Grade, Buy & Hold Grade, and Industry Rank. Among the 115 stocks in the China industry, it’s ranked #1. It simply can’t get better than this. NIO Inc. (NIO) Founded in November 2014, NIO is known as “the Tesla of China.” Based in China, but operating in Hong Kong, the United States, United Kingdom and Germany, it manufactures and markets electric vehicles under the EP9, EVE, and ES8 brand names. The company is also innovating into self-driving technology space and offers a battery swap service. While it hit its 52-week low in October 2019 due to news of the coronavirus in China at the time, it has gained 1,176% since then. China recovered fast from the virus and its promising outlook is reflected in NIO’s data. The market expects NIO’s revenue to increase 137.4% in the current quarter, 95.8% in the current financial year, and 75.4% in the next year. The company’s EPS is expected to increase 92.9% in the current quarter, 52.7% in the current year, and 33.8% next year. As the demand for electrical vehicles is expected to increase exponentially, it could be beneficial to hold shares of NIO for the long-term. The company’s total revenues were $526.4 million in the second quarter of 2020, representing an increase of 146.5% year-over-year. In the words of William Bin Li, Founder, Chairman and Chief Executive Officer of NIO, “The current constraints on the productions will be lifted in the near future and we are confident that our production capacity can meet the accelerated demand of our models.” It’s no surprise that NIO is rated “Strong Buy” in our POWR Ratings system. It also has an “A” for Trade Grade, Peer Grade, and Industry Rank. Our of 115 China stocks, it is ranked #3. Activision Blizzard, Inc (ATVI) ATVI, together with its subsidiaries, develops and distributes content and services on video game consoles, personal computers (PC), and mobile devices internationally. It’s best known for its franchises including Candy Crush, Call of Duty, World of Warcraft, Overwatch, Hearthstone and Diablo. The company operates through three segments: Activision, Blizzard Entertainment, King Digital Entertainment, and its independent studios, including Infinity Ward, Sledgehammer Games, Toys for Bob, Treyarch, and Vicarious Visions. The stock has gained 39.4% since hitting its 52-week low of $50.51 in mid-March. Its revenue is expected to grow at a rate of 39% this quarter and at the rate of 23.6% in the current year. The company’s EPS is expected to increase 100% in the current quarter, 45.3% in the current fiscal year, and at a rate of 24.41% over the next five years. At the end of the second quarter, Activision reported revenue growth of 270% year-over-year with Monthly Active Users of 125 million. Blizzard’s revenue grew 20% year-over-year driven by another strong quarter for World of Warcraft, and King’s revenue grew by 11% year-over-year with a high monthly active user base of 271 million. While the company has delayed the latest release of its popular World of Warcraft series until later this year, it shouldn’t have any material impact as John Hight, the executive producer for World of Warcraft said, “We made the decision to do what’s right for the game and take the extra time, and we think players will enjoy this expansion even more as a result of the additional work.” ATVI’s strong fundamentals are reflected in its POWR Ratings. It has an overall “Buy” rating with an “A” in Trade Grade and a “B” in Peer Grade, Buy & Hold Grade, and Industry Rank. Within the Entertainment – Toys & Video Games industry, it’s ranked #1 out of 14 stocks. Want More Great Investing Ideas? 7 Best ETFs for the NEXT Bull Market What is the Cure for Stock Market Volatility? Chart of the Day- See Christian Tharp’s Stocks Ready to Breakout AMZN shares were trading at $3,170.00 per share on Wednesday afternoon, up $70.04 (+2.26%). Year-to-date, AMZN has gained 71.55%, versus a 6.94% rise in the benchmark S&P 500 index during the same period."}]}