{"article": [{"url": "https://stocknews.com/news/acn-infy-ctsh-3-best-it-services-stocks-that-pay-dividends/", "published": 1598011700.0, "headline": "3 \"Best IT Services\" Stocks That Pay Dividends", "body": "Outsourcing is a practice in which one company pays another company to carry out certain business processes that they specialize in. The primary objective of the companies that outsource work is specialization and cost containment. IT and cloud spending are expected to continue rising in the coming years. As a result, companies that outsource the installation, configuration, and management of these systems have been reporting strong earnings. The rise in remote work has increased the dependence on edge computing, creating an opportunity for IT outsourcing stocks. Many of these stocks also pay healthy dividends which adds to their attractiveness. 7 Best ETFs for the NEXT Bull MarketHere are the three outsourcing stocks that stand out for their exceptional fundamentals and dividends: Accenture plc (ACN), Infosys Limited (INFY), and Cognizant Technology Solutions Corporation (CTSH). Accenture plc (ACN) ACN is an Ireland-based company that provides management consulting, technology, and business process outsourcing services worldwide. The company’s segments include Communications, Media & Technology, Financial Services, Health & Public Service, Products, and Resources. The stock has been uniformly paying dividends every alternate quarter for the past decade. During the past 5 years, the average dividends per share growth rate for ACN was 9.4% per year. The company has now shifted its dividend payout policy from semi-annual to quarterly basis. The most recent quarterly dividend declared by the company was $0.8 for its fiscal third quarter ended May. The annual dividend for the company cumulates to $3.2, translating into a yield of 1.35%. ACN generated a free cash flow of $2.6 million in its last reported quarter, registering a 31% growth from its comparable quarter last year. The company also generated $2.7 billion in cash flow from operating activities during the quarter, accounting for a 29% rise, year-over-year. The cash dividend payouts totaled $509 million for the quarter. Moreover, ACN is producing more trailing twelve-month cash flow than 93.6% of US dividend stocks in the StockNews.com universe. The company has been steadily gaining traction in its outsourcing as well as consulting businesses backed by high demand for services. The company reported a top-line of $11 billion in its last quarter. EPS for the quarter came in $1.9, beating the consensus estimate by 2.7%. The recent acquisition of CreativeDrive, a tech-driven content production company, is expected to boost ACN’s content, digital-marketing, and commercial-service offerings. Another recent buyout of Organize Cloud Lab has helped the company’s user-experience consultancy services to expand. Additionally, the company repurchased 3.7 million shares worth $627 million in the previous quarter. With the growing need for cloud-based applications and software, the street expects ACN’s EPS to grow 6% next year. ACN closed yesterday’s trading session at $236.61, with a year-to-date gain of 12.4%. How does ACN stack up for the POWR Ratings? A for Trade Grade A for Buy & Hold Grade A for Peer Grade A for Industry Rank A for Overall POWR Rating. You can’t ask for better. It is ranked #1 out of 14 stocks in the Outstanding – Tech Services industry. Infosys Limited (INFY) Headquartered in India, INFY is one of the most popular technology services outsourcing stocks. The company provides consulting, technology, outsourcing, and next-generation digital services in North America, Europe, India, and internationally. INFY declared a dividend of $0.127 per share in its most recent quarterly report, an increase of 12.4% from the preceding dividend. Investors are prospecting better dividends despite the company’s debt issues. During the past 5 years, the average dividend per share growth rate was 14%. The annual dividend for the company culminates to $0.21, translating to a yield of 1.64%. Furthermore, the company’s dividend yield has gone up over the past 12 months, with a 5-year average dividend yield of 2.58%. INFY’s fiscal first-quarter results impressed the market. The company generated a free cash flow of $728 million for the quarter. This implied a 50% growth year-over-year. The company also reported $783 million as cash flow from operations. Revenues in the previous quarter grew 1.5% year-over-year in constant currency to $3.1 billion. Digital revenues, forming 44.5% of total revenues, increased 25.5% year-over-year in constant currency to $1.4 billion. Operating margins improved 2.2% year-over-year to 22.7%. EPS for the quarter came in $0.13, representing a surprise of 8.3%. Moreover, after the acquisition of Simplus, a salesforce ecosystem advisor, earlier this year, INFY has elevated its position as an end-to-end Salesforce enterprise cloud solutions and services provider. The increasing reliance on technology due to the remote working culture and the Indian Rupee constantly depreciating against the western currencies is making INFY’s offering more competitive. Hence, the street expects EPS to grow 11% next year. INFY closed yesterday’s trading session at $12.82, with a year-to-date gain of 24.5%. The stock has gained momentum and is making fresh highs every trading day. It’s no surprise that INFY is rated “Strong Buy” in our POWR Ratings system. It also has an “A” for Trade Grade, Buy & Hold Grade, Peer Grade, and Industry Rank. It is ranked #2 out of 14 stocks in the Outstanding – Tech Services industry. Cognizant Technology Solutions Corporation (CTSH) CTSH is a provider of information technology, consulting, and business process outsourcing services. The company operates in four segments: financial services segment, Healthcare segment, Manufacturing/Logistics segment, and Other Segments which include Communications and High Technology. The stock has been consistently paying dividends each quarter for the last four years. In the past three years, the company has increased its dividend at an average of 14% a year. The most recent dividend declared by CTSH was $0.22 during the current third quarter. This amounts to an annual dividend of $0.88, translating to a forward dividend yield of 1.3%. CTSH reported a free cash flow of $886 million for its fiscal second quarter, up 85% year-over-year. It generated $979 million as cash flow from operations, growing 70% compared to the year-ago quarter. The company returned $121 million to its shareholders in the form of a dividend in the last quarter. Moreover, CTSH is producing more trailing twelve-month cash flow than 89.28% of US dividend stocks in the StockNews.com universe. The top-line for the second quarter came in $4 billion. The healthcare segment, forming 29% of the revenues, grew 2.2% year-over-year in constant currency amid the pandemic. The net income came in $361 million and the company reported EPS of $0.82. Furthermore, CTSH beat the consensus EPS estimates in each of the trailing four quarters and reported a positive surprise of 18.8% for the quarter. CTSH has recently announced the acquisition of New Signature, an independent Microsoft (MSFT) public cloud transformation specialist, to expand its cloud advisory services. It had also acquired Collaborative Solutions, a privately-held global consultancy specializing in Workday enterprise cloud applications for finance and human resources, in May this year. The depreciating Indian Rupee is also favoring CTSH as the company has over 78% of its total employees in India. Hence, the street expects EPS to grow 12.8% next year. CTSH closed yesterday’s trading session at $66.3, gaining 6.4% year-to-date. The stock has gained more than 26% in the last three months. CTSH is rated “Strong Buy” in our POWR Ratings system, consistent with its strong momentum. It is rated “A” in Trade Grade, Buy & Hold Grade and Industry Rank, and “B” in Peer Grade. It is ranked #3 out of 14 stocks in the Outstanding – Tech Services industry. Want More Great Investing Ideas? The Best of StockNews 2 Step Process to Sell @ Market Top in September 9 “BUY THE DIP” Growth Stocks for 2020 ACN shares were trading at $237.49 per share on Friday afternoon, up $0.88 (+0.37%). Year-to-date, ACN has gained 14.15%, versus a 6.55% rise in the benchmark S&P 500 index during the same period."}]}