{"article": [{"url": "https://stocknews.com/news/pbr-uso-a-rebound-in-petrobras-brazil-shares-could-be-on-the/", "published": 1597666100.0, "headline": "A Rebound in Petrobras Brazil Shares Could Be on The Horizon", "body": "Crude oil is sitting near the highs and production, and inventories are falling The Brazilian real has recovered against the dollar PBR is Brazil’s energy giant PBR shares are inexpensive Volatility in the crude oil market (USO) was wild over the first four months of 2020. In early January, the price of nearby NYMEX crude oil futures rose to a high of $65.65 per barrel and Brent futures peaked at $71.99 when US and Iranian tensions rose to a boiling point in Iraq. By late April, the nearby futures dropped to negative $40.32 per barrel and $16 on WTI and Brent futures. The price carnage came on the back of evaporating demand on the back of coronavirus’s spread around the globe. Shares of energy-related companies had been weak throughout 2019 and into early 2020 and had lagged the price move to the upside in the crude oil market. When the price of oil plunged, the stock prices in the sector collapsed. Petrobras (PBR), the Brazilian oil company, has had a rough time as the decline in the price of oil and weakness in the Brazilian currency versus the US dollar weighed on the price of the stock. In 2008, when crude oil was on its high at over $147 per barrel on the nearby NYMEX futures contract, and the Brazilian real was at over $0.60 against the US dollar, PBR shares reached an all-time high at $77.61. In March 2020, when crude oil fell into negative territory for the first time, and the Brazilian real was below $0.20 against the dollar, the shares reached a low of $4.01. Since then, PBR has more than doubled in value, and there could be more upside in the stock. 7 \"SAFE HAVEN\" Dividend Stocks for Turbulent TimesCrude Oil is Sitting Near the Highs and Production, and Inventories are Falling At the end of last week, the price of nearby September crude oil futures was trading at just above the $42 per barrel level. Source: CQG As the daily chart highlights, the price of the active month futures contract was just below the recent high and level of short-term technical resistance at $43.52, the August 5 high. Price momentum and relative strength indicators were above neutral readings, with room to move higher. The total number of open long and short positions at 2.060 million contracts at the end of last week has been steady since June. Daily historical volatility had reached a high of over 171% in March and was just above 19% at the end of last week. The decline in the price variance metric reflects the narrow range during the consolidation over the past months. The technical landscape reflects a pattern of higher lows and higher highs and is supportive of more price gains in the crude oil futures market. Meanwhile, supply and demand data has also been bullish for the energy commodity. As of August 7, crude oil inventories in the United States declined for the third consecutive week. Source: American Petroleum Institute Over the past three weeks, US oil stocks declined by almost twenty million barrels. Gasoline stockpiles dropped by just under two million barrels, while distillate stocks have increased by just above one million barrels. Source: Energy Information Administration Over the same period, the EIA reported a decline of 22.5 million barrels of crude oil inventories. Gasoline stocks were up by only 419,000 barrels, and distillates fell by 200,000 barrels. At 10.7 million barrels per day, US output has declined by 18.3% from the March record high at 13.1 mbpd. The inventory data has been bullish for the crude oil market. According to Baker Hughes, the number of oil rigs operating in the US stood at 172 as of August 14, 598 below last year’s level. Fundamentals and technical factors continue to be supportive of gains in the crude oil market in mid-August. The Brazilian Real has Recovered Against the Dollar PBR shares are sensitive to the price of crude oil and the value of the Brazilian real versus the US dollar. The US dollar is the world’s reserve currency and benchmark pricing mechanism for most commodities. Crude oil is no exception. Since local production costs in the South American nation are in local currency, a rising real tends to be a bullish factor for energy commodity and the price of PBR shares. Source: CQG The chart of the currency relationship between the real and the dollar shows that it hit a low at $0.1673 in mid-May. Since then, the real recovered to the $0.18410 level on August 14, a rise of over 10%. Technical resistance for the currency pair stands at the June high at $0.2073. The rising level of the Brazilian real is supportive of the country’s oil-producing company. PBR is Brazil’s Energy Giant Petrobras produces and sells oil and gas in Brazil and worldwide. The company engages in prospecting, drilling, refining, processing, trading, and transporting crude oil from on and offshore oil fields, and shale properties. PBR also has interests in power production, ethanol output, and petrochemical production. Petrobras’ headquarters are in Rio de Janeiro, and the company has been in business since 1953. At $8.61 per share at the end of last week, the company had a market cap of $54.807 billion, trades an average of over 23 million shares each day, and pays shareholders a $0.35 or 4% dividend. Over the past two challenging quarters, PBR reported losses, reflecting the environment in the global oil and gas business. Source: Yahoo Finance As the chart shows, PBR has consistently missed analyst’s consensus EPS estimates. The company lost 39 cents per share in Q2 2020. However, the estimates for Q3 are for an improvement and a marginal loss of six cents per share. An average of twelve analysts surveyed on Yahoo Finance has an average price target of $13.66 per share, with a low of $9.30 and a high of $19.00. the stock was trading below the low end of the range at the end of last week. PBR Shares are Inexpensive PBR shares remained at a bargain-basement price as of August 14. Source: Barchart As the long-term chart illustrates, PBR shares have more than doubled in value from the March 2020 low. However, the stock’s technical resistance is at the March 2019 high at $17.90, which is over double the current price. PBR could be a diamond in the rough in the oil market. The fundamentals and technical factors for the energy commodity point to higher prices. A falling dollar is bullish for commodities, and a continuation of a rise in the value of the Brazilian currency would support the share price of the nation’s oil company. I am bullish on the prospects for Petrobras and consider the current share price a steal. Want More Great Investing Ideas? The Best of StockNews 3 Possible Directions for the Stock Market from Here 9 “BUY THE DIP” Growth Stocks for 2020 PBR shares fell $0.05 (-0.58%) in premarket trading Monday. Year-to-date, PBR has declined -45.47%, versus a 6.07% rise in the benchmark S&P 500 index during the same period."}]}