{"article": [{"url": "https://stocknews.com/news/sq-enph-grub-3-stocks-options-traders-should-target/", "published": 1596110900.0, "headline": "3 Stocks Options Traders Should Target", "body": "Schaeffer’s Volatility Scorecard (SVS) is a lagging indicator that measures a stock’s realized volatility against the volatility expectations priced into that stock’s options over the past year. The goal is to find which stocks have been the best — and worst — for premium buyers. The SVS is a very useful tool for premium sellers too, as “the worst” for a premium buyer can be construed as “the best” for a premium seller. Using our robust historical database, we conduct extensive research on each underlying equity and determine which of those underlying equities’ options have historically had underpriced or overpriced options. We rank each equity’s options relative to the others in our universe, with scores ranging from zero to 100. For more information on how to use these scores, please review instructions following the scorecard. Below is a deeper dive into three stocks that showed up on our comprised list; payments processing specialist Square Inc (NYSE:SQ), clean energy stock Enphase Energy Inc (NASDAQ:ENPH), and food delivery service GrubHub Inc (NYSE:GRUB). 7 Best ETFs for the NEXT Bull MarketWhat’s the uniting thread between these three unique stocks? Right now SQ, ENPH, and GRUB all boast SVS’ of 98, 100, and 96, respectively. In simpler terms, all three stocks have tended to exceed option traders’ volatility expectations during the past year, a good thing for option buyers. At last check, SQ was up 3.4% to trade at $127.75, a chip-shot from its July 9 record high of $133.81. The shares have almost quadrupled off their March 18 lows of $32.33, and have more than doubled in 2020. During this channel of higher highs, the ascending equity’s 20-day moving average has stepped up as admirable support. A short squeeze could be fueling these gains. Short interest fell 13.8% in the two most recent reporting periods, yet still accounts for a healthy 8.2% of SQ’s total available float. The security could also benefit from a shift in analyst sentiment, as 22 of the 35 in coverage still rate it a “hold” or worse. Switching over to ENPH, the California-based solar energy name was last seen up 3.6% at $59.32. Like Square, Enphase stock has also more than doubled in 2020, but remains way off its May 19 record high of $70.36. Enphase shorts are headed for the exits, down 5.7% in the two most recent reporting periods. Yet that 11.63 million shares sold short still take up 10.1% of ENPH’s total available float, so a continued exodus of bearish bets could keep the wind at the equity’s back. And lastly there’s GrubHub stock, which at last check was up 1.4% at $71.06. GRUB is up 109% in the last nine months, with its 30-day moving average containing the last month’s consolidation on the charts. Now looks like a good time to get in on GrubHub with options, too. Despite its July 30 earnings report, GRUB’s Schaeffer’s Volatility Index (SVI) of 50% ranks in the 10th percentile of its annual range. This suggests options players have been pricing in relatively low volatility expectations of late. SQ shares rose $1.12 (+0.87%) in after-hours trading Thursday. Year-to-date, SQ has gained 106.41%, versus a 1.69% rise in the benchmark S&P 500 index during the same period."}]}