{"article": [{"url": "https://stocknews.com/news/cat-el-amat-swk-usx-5-recently-upgraded-stocks-to-buy-right-now/", "published": 1597320500.0, "headline": "5 Recently Upgraded Stocks to BUY Right Now!", "body": "The stock market becomes much more unpredictable with each passing day. No one is quite sure whether the market will continue its bull run or if the outlook through the end of the year is bearish. There is a good chance the market ends up stagnating in the months ahead, trading sideways until the election. If you are uncertain as to which stocks are worthy of an investment, you are not alone. However, our exclusive POWR Rating system does a lot of the work for you. The POWR Ratings are updated at the end of each trading day based on several important quantitative factors. The latest POWR Ratings update reveals these five stocks have ascended to a Strong Buy rating: Caterpillar (CAT), The Estee Lauder Companies (EL), Applied Materials (AMAT), Stanley Black & Decker (SWK) and U.S. Xpress Enterprises (USX). 7 Best ETFs for the NEXT Bull MarketCaterpillar (CAT) The widespread destruction resulting from the urban riots has created the opportunity for CAT to add to its revenue. CAT and other builders will help American cities rebuild in the aftermath of the arson and other destruction. CAT operations also include mining, natural gas, and diesel gas engines. The company’s three primary business lines are machinery, engines, and finance. The POWR Ratings show CAT is nearly flawless, boasting A grades in every POWR component, but its Peer Grade of B. CAT is ranked in the top third from almost 60 Industrial – Machinery stocks. CAT price returns are primarily green, highlighted by a 19.51% return in 2019 and a three-year return of 36.84%. CAT’s second-quarter earnings beat analysts’ expectations by a 56% margin. Furthermore, if politicians elected in November decide rebuilding America’s infrastructure is a priority, CAT will surely benefit. The Estee Lauder Companies (EL) The vast majority of women and a small, but growing number of men are hooked on cosmetics similar to how drug addicts are hooked on their substance of choice. In other words, EL’s customer base is locked in for the long haul. Besides cosmetics, EL also sells hair care products, fragrances, and skincare solutions in markets throughout the world. The POWR Ratings show EL has an industry rank of six out of 65 stocks in the Fashion & Luxury industry with A grades in each POWR component except for Industry Rank. EL price returns are green except for the six-month period. EL’s price return in 2019 was an impressive 60.34%. A large part of the reason EL bounced back from the market-wide pandemic sell-off is its newfound alliance with Paolo Sassone-Corsi, an epigenetics researcher. The tandem will work in unison to create molecular ingredients to develop products that combat skin aging. Applied Materials (AMAT) The semiconductor industry is on fire as consumers and businesses scoop up many more computers and computing devices. AMAT develops, makes, and sells the services fabrication tools used by semiconductor businesses. Check out AMAT’s POWR Ratings, and you will struggle to find a bad grade. AMAT has A grades in all POWR components, but its Peer Grade, which is a B. AMAT, is ranked in the top third of the publicly traded companies in the Semiconductor & Wireless Chip category. AMAT price returns are just as attractive: 89.86% in 2019 and 57% across the past three years. AMAT machines will continue to sell briskly as AI and 5G devices require the latest and greatest chips. Look for AMAT to return to its 52-week high of $69.44 in the months to come. Stanley Black & Decker (SWK) Take a look around your home, and you are likely to find at least one product made by SWK. SWK sales are bound to spike simply because more people spend time at home, diving headfirst into home improvement projects and making the most of their living space. SWK’s POWR Ratings are just about perfect: A grades in each POWR component and a B Peer Grade. SWK is ranked in the top 20 of nearly 70 Home Improvement & Goods stocks. Out of the dozen analysts who have performed a deep dive into SWK, nine recommend buying, three advise holding, and none believe SWK should be sold. SWK has a relatively low forward P/E ratio of 23 yet has not yet broken through its 52-week high of $172.69. In other words, there is value here. U.S. Xpress Enterprises (USX) Transportation services, including rail and trucking services, are still necessary despite technological innovations. USX provides these services. USX recently reported a quarterly profit of 18 cents based on revenue in excess of $420 million. Analysts anticipated a per-share loss of 13 cents. If you question whether investors are interested in this relatively traditional business, all you have to do is take one look at its one-year chart. USX is clearly on the upswing. USX has above average POWR Rating Components across the board, highlighted by an A Buy & Hold Grade and an A Trade Grade. The stock has a year-to-date price return of 105% and a three-month price return of 189%. Want More Great Investing Ideas? 3 Possible Directions for the Stock Market from Here How to Trade THIS Stock Bubble? 9 “BUY THE DIP” Growth Stocks for 2020 CAT shares were trading at $141.48 per share on Thursday morning, down $1.09 (-0.76%). Year-to-date, CAT has declined -1.91%, versus a 6.01% rise in the benchmark S&P 500 index during the same period."}]}