{"article": [{"url": "https://stocknews.com/news/len-mas-aaon-3-top-stocks-for-long-term-growth/", "published": 1600430900.0, "headline": "3 TOP Stocks for Long-Term GROWTH", "body": "Growth stocks typically have high revenue and earnings growth, whereas value stocks have attractive valuations. Investors looking for growth stocks don’t mind paying a premium as long as the company has underlying strength in its business model and an impressive financial outlook. Growth stocks have so far played an outsized role in the overall recovery of the stock market since the pandemic-driven crash earlier this year. The SPDR Portfolio S&P 500 Growth ETF (SPYG), which can be considered a benchmark for the performance of growth stocks, has risen 56.6% since hitting its low in March. Over the same period, the S&P 500 has gained 47.9%. As the Fed’s continued low-interest-rate regime and the gradual recovery of the economy might lead stocks to rotate out of the high-flying tech sector. Assuming that’s the case, investors should consider recharging their portfolio with some solid non-tech growth stocks that might have plenty of upside left. 7 \"SAFE HAVEN\" Dividend Stocks for Turbulent TimesLennar Corporation (LEN), Masco Corporation (MAS), and AAON, Inc. (AAON) have a proven history of earnings and revenue growth, and the market expects their financials to improve further. Lennar Corporation (LEN) LEN is a construction company that focuses on homes and other types of real estate in the United States. After the acquisition of CalAtlantic Group, LEN has become the largest US homebuilder. The company had a better than expected third quarter and managed to sell more homes and at higher prices during the COVID-19 pandemic. The company reported that fundamentals in the housing market, particularly a record low interest rate environment, remained in its favor. The company witnessed a 16% year-over-year increase in new orders for home. The company is poised to bring 350 more homes in the Durham region. Also, LEN has acquired 130 acres of land in Henderson, NV, and it plans to build a housing community with 900 home sites. LEN’s revenue is expected to grow 0.4% in the current year and 7.9% next year. The company’s EPS is expected to grow 28.6% this year. Also, the company’s EPS is estimated to rise at a rate of 11.4% per annum over the next five years. The stock has returned 40% year-to-date. How does LEN stack up for the POWR Ratings? A for Trade Grade A for Buy & Hold Grade A for Peer Grade B for Industry Grade A for Overall POWR Rating The stock is also ranked #2 out of 21 stocks in the Homebuilders industry. Masco Corporation (MAS) MAS manufactures and markets home improvement products worldwide. The company primarily operates in Cabinets and Related Products, Plumbing products, Decorative Architectural products, and other Specialty segments. During the second quarter of the year, the company’s operating margins increased by 50 basis points year-over-year. The company’s income from continuing operations also increased to $0.84 per share, from $0.74 per share a year ago. Sales for the company’s Decorative Architectural Products segment increased 8% due to strong demand for paints and coatings. The company has completed its acquisition of SmarTap, which developed a shower system that can monitor and control water pressure, temperature, flow of water, and duration. The company’s revenue is expected to grow 2.8% this year, and 3.5% next year. MAS’ EPS is estimated to grow 19.6% this year and 9.7% next year. Also, the company’s EPS is also expected to grow at a rate of 14.2% per annum over the next five years. The stock has gained 19.9% year to date. It’s no surprise that MAS is rated a “Strong Buy” in our POWR Ratings system, with a grade of “A” in Trade Grade, Buy & Hold Grade, and Industry Rank. In the 68-stock Home Improvement & Goods industry, it’s ranked #5. AAON, Inc. (AAON) AAON focuses on the engineering, manufacture, and marketing of air conditioning and heating products. The company is also involved in making makeup air units, custom rooftop units, condensing units, energy recovery units, and more. For the second quarter of 2020, the company reported an increase in net sales of 5.2% year-over-year. The company’s gross profit improved 26.2%. AAON’s EPS rose 36% year-over-year. The company was awarded a Platinum level in the 2020 Sustainable Tulsa verification program. The company’s focus on energy efficiency and green features is expected to drive tfuture growth for the company. AAON’s revenue is expected to grow 10.5% in the current quarter and 8% this year. Its EPS is estimated to grow 36.3% this year. Moreover, EPS is expected to rise at a rate of 12% per annum over the next five years. The stock has returned 17% year-to-date. AAON’s strong fundamentals are reflected in its POWR Ratings. It has a “Strong Buy” rating with a grade of “A” in Trade Grade and Buy & Hold Grade. Within the Industrial – Building Materials industry, it’s ranked #5 out of 42 stocks. Want More Great Investing Ideas? 7 Best ETFs for the NEXT Bull Market Stock Market Outlook: Before & After the Election Chart of the Day- See the Stocks Ready to Breakout LEN shares were trading at $78.94 per share on Friday afternoon, up $0.80 (+1.02%). Year-to-date, LEN has gained 42.45%, versus a 3.46% rise in the benchmark S&P 500 index during the same period."}]}