{"article": [{"url": "https://stocknews.com/news/eqix-irm-cor-3-data-center-reits-that-could-surge-on-snowflakes-ipo/", "published": 1596456500.0, "headline": "3 Data Center REITS That Could SURGE on Snowflake's IPO", "body": "If you pay attention to news about upcoming IPOs, you have likely caught wind of the much-anticipated debut of Snowflake. Snowflake is a data storage and management specialist which is sure to make quite the splash once it goes public. The arrival of Snowflake’s IPO will undoubtedly generate interest in the data center sector. The sector’s fundamentals are quite solid as demand has accelerated due to companies’ increasing investment into cloud computing, and demand for remote servers due to more people working from home. The following data center stocks are currently en vogue and will likely prove even more popular as discussions swirl around Snowflake’s debut: Equinix (EQIX), Iron Mountain Incorporated (IRM), and CoreSite Realty Corporation (COR). 9 \"BUY THE DIP\" Growth Stocks For 2020Equinix (EQIX) Well-prepared investors will hop on the data center train in the weeks leading up to Snowflake’s debut as similar data center stocks are also likely to rise if Snowflake’s strong sees strong demand. One such data center stock worthy of your attention and hard-earned dollars is EQIX. EQIX provides data centers, managed IT infrastructure services, interconnection and colocation, and more to customers throughout the US and Asia. EQIX customers include network providers, systems integrators, and content companies. The POWR Ratings are quite complimentary toward EQIX, doling out As in each POWR Component except for a Peer Grade of B. EQIX is the #1 overall REIT – Data Center stock out of six companies in the category. Add in EQIX’s green price returns and it is easy to see why the analysts are so bullish on this stock. Out of 18 analysts who have studied EQIX, 17 rates it a Buy, one rates it a Hold and none advise selling. The average price target for the stock is $801.65 which is 3% above current prices. Though EQIX is a high-flying tech stock, it has a forward P/E ratio of 32.20, which is fairly reasonable given its growth rate and margins. Iron Mountain Incorporated (IRM) Data storage and protection has never been more important. IRM stores and safeguards copious amounts of data. The company’s data center solutions are available in 50+ countries. IRM serves more than 225,000 clients across a litany of industries. IRM’s bread and butter is data storage rental and related services. The POWR Ratings show IRM has A grades in the Industry Rank and Trade Grade Components. IRM also has an above-average Buy & Hold Grade. IRM has a fairly low forward P/E ratio of 13.43, indicating it might be undervalued at its current trading price of $28. Though it might take a quarter or two for IRM to return to its pre-COVID trading price of $34, the stock certainly has the potential to do so. Look for IRM to move back toward its 52-week high of $34.49 in the months ahead. CoreSite Realty Corporation (COR) Businesses ranging from telecommunications companies to media businesses, educational institutions, financial companies, governments, and entertainment providers rely on COR data centers. COR has A grades in each POWR Component but for its Peer Grade of D. COR’s price ratings are green across the board but for ’18. COR had a 34% price return in ’19. Combine COR’s reasonable forward P/E ratio of 25 with its immaculate POWR Ratings, recent upward momentum, and plans to launch even more data centers in the upcoming quarters and you have quite the juggernaut of an investment. Investors’ strong interest in COR is displayed quite clearly in its six-month chart. COR dropped slightly below $95 in March only to spike right back up to $116 a week later and climbing even higher toward the $130 mark. COR should break through its 52-week high of $130.21 in the days to come. Add this stock to your portfolio, hold it a couple of months beyond the hoopla surrounding Snowflake’s uber-popular IPO and you should walk away with a significant profit. Want More Great Investing Ideas? 9 “BUY THE DIP” Growth Stocks for 2020 How HIGH Can This Tech Bubble Fly? 7 “Safe-Haven” Dividend Stocks for Turbulent Times EQIX shares were trading at $777.82 per share on Monday afternoon, down $7.66 (-0.98%). Year-to-date, EQIX has gained 34.35%, versus a 3.41% rise in the benchmark S&P 500 index during the same period."}]}