{"article": [{"url": "https://stocknews.com/news/abbv-pfe-gsk-bntx-synh-3-large-cap-healthcare-stocks-with-dividends-yielding-more-than-4/", "published": 1595333300.0, "headline": "3 Large-Cap Healthcare Stocks With Dividends Yielding More Than 4%", "body": "Many investors turn to healthcare stocks as a defensive stalwart in their portfolios in times of economic distress. While the healthcare sector rebounded nicely from its low on March 23rd, it hasn’t outperformed the S&P 500 by much. Nevertheless, there are a few areas of the healthcare industry worth taking investing in. Especially companies that are benefiting from demand due to the coronavirus pandemic. One way to spot quality health care companies is through high dividends. Large, established companies that pay a high dividend yield typically offer investors an opportunity to buy stocks with solid balance sheets and stable growth prospects. As the number of corona cases continues to soar, here are three large-cap healthcare companies that pay high dividend yields. AbbVie Inc. (ABBV) 7 Best ETFs for the NEXT Bull MarketABBV operates in the realm of key therapeutic areas in medicine such as virology, neuroscience, immunology, oncology, and gastroenterology amongst other specializations. This $146.99-billion company is in the race to find a cure for the coronavirus to develop a novel antibody therapeutic. The company joined forces with Harbour BioMed, Utrecht University and, Erasmus Medical Centre. ABBV’s stock has gained about 61% from the 52-week low it hit in mid-March due to the overall dip in the market. ABBV has paid more total dividends over the past six years than 97% of other US stocks currently paying dividends. ABBV pays an annual dividend of $4.72, which yields 4.68%. The company has increased its dividend by 195% since it started paying dividends in 2013. ABBV’s consensus revenue estimate of $10.05 billion for the quarter ending June 2020 indicates a year-over-year increase of 21.8%. Also, ABBV beat its consensus EPS estimates in each of the trailing four quarters. How does ABBV stack up for the POWR Ratings? A for Trade Grade A for Buy & Hold Grade A for Peer Grade A for Industry Rank A for Overall POWR Rating You can’t ask for better. The stock is also ranked #6 out of 213 stocks in the Medical-Pharmaceuticals industry. Pfizer, Inc. (PFE) PFE, one of the world’s largest pharmaceutical companies with a market cap of $202.75 billion, is working in collaboration with BioNTech (BNTX) to develop a vaccine for coronavirus. The company recently announced that two out of the four vaccine candidates under the BNT162 Mrna-based vaccine program were granted Fast Track designation from the FDA. Two of the vaccine candidates currently undergoing phase 1/2 clinical studies in Germany and the United States have demonstrated positive initial data. PFE and BNTX plan to start phase 2b/3 later this month, contingent on regulatory approval. If the trials are successful, the companies will be able to manufacture up to 100 million doses by the end of 2020 and more than 1.2 billion doses by the end of next year. Over the past 6 years, PFE has returned more capital to shareholders through its dividend issuances than 97.9% of other dividend-paying US stocks. The company paid $2.1 billion of dividends in the first three months of 2020. With an annual dividend of $1.52, PFE’s dividend yield comes to 4.19%. The recent three-year agreement signed between PFE and Syneos Health (SYNH) will help optimize PFE’s portfolio. PFE has also been performing well in this “new normal”, and has added approximately 30% to its stock price since this year’s low of $27.88 on March 23rd. PFE has an impressive earnings surprise history with the company beating consensus EPS estimates in three out of the trailing four quarters. According to the POWR Ratings, PFE has an “A” for Industry Rank and a “B” for Buy & Hold Grade and Peer Grade. In the 213 stock Medical Pharmaceuticals industry, it is ranked #43. GlaxoSmithKline PLC (GSK) GSK is a leading research-based healthcare and pharmaceutical company with a market cap of $104.3 billion. GSK has announced a collaboration with Medicago, which couples innovative plant-based and adjuvant technologies to develop a Covid-19 vaccine. Furthermore, GSK also recently announced that it would collaborate with CureVac to develop and manufacture up to 5 mRNA-based vaccines and monoclonal antibodies for infectious disease pathogens. The stock has been rising since hitting its 52-week low of $31.43 on March 23rd due to the coronavirus-led market crash and has gained more than 30% so far. GSK’s earnings surprise history is impressive, with the company beating consensus EPS estimates in three of the trailing four quarters. As for its position relative to other healthcare stocks that issue dividends, GSK offers a higher dividend yield than 97% of them. GSK pays an annual dividend of $1.87, which yields 4.47% based on its current price. GSK has an “A” for Industry Rank and a “B” for Buy & Hold Grade and Peer Grade. It ranks #44 out of 213 stocks in the Medical-Pharmaceuticals industry. Want More Great Investing Ideas? 9 “BUY THE DIP” Growth Stocks for 2020 Newly REVISED 2020 Stock Market Outlook 7 “Safe-Haven” Dividend Stocks for Turbulent Times ABBV shares were unchanged in after-hours trading Tuesday. Year-to-date, ABBV has gained 14.54%, versus a 2.07% rise in the benchmark S&P 500 index during the same period."}]}