{"article": [{"url": "https://stocknews.com/news/stk-ccd-tdf-aapl-msft-these-3-crisis-resistant-dividends-pay-8-5-a-year/", "published": 1599826100.0, "headline": "These 3 “Crisis-Resistant” Dividends Pay 8.5% a Year", "body": "Closed-end funds (CEFs) are the ultimate “sleeper” investment—if you hold them, you know they hand out massive dividends (7% yields, on average!). Plus, their often-discounted share prices set you up for serious upside, too. But it looks like the mainstream crowd is about to crash our CEF party. That means if you’re not in now, this is the time to climb aboard, before our CEFs’ big discounts become a distant memory. CEF Managers Put Out the Bait 7 Best ETFs for the NEXT Bull MarketFunnily enough, the ones drawing attention to CEFs these days are CEF managers themselves. According to The Wall Street Journal, these pros have been cutting their fees in a bid to draw in new investors. It’s working—this fee reduction is one reason why CEFs’ prices have moved up, and CEFs’ average discount to net asset value (NAV, or what their underlying portfolios are worth) has narrowed to around 8.6%. That metric—our go-to measure of CEF valuation—is now closing in on its pre-crisis level of 7.5%. Lower fees are just one reason why these discounts are shrinking. Another is strong performance. The average equity CEF saw a 2.7% total NAV return (or the increase in its underlying portfolio, including dividends) last month, and the best performers have seen year-to-date returns in the high double digits. A “3-Click” CEF Portfolio Paying 8.3% (With Upside) And even though there are only about 500 CEFs out there, you can easily build yourself a diversified portfolio with these funds; the Columbia Seligman Premium Tech (STK), for example, focuses on tech; the Calamos Dynamic Convertible and Income Fund (CCD) splits its portfolio between stocks and convertible bonds; and the Templeton Dragon Fund (TDF) is one of the most-respected Asian stock funds out there. And these are just some of the best; literally dozens of CEFs have been crushing the S&P 500 over the long haul. And yes, all three of the funds I just mentioned trade at discounts, with both CCD and TDF sporting markdowns above 10%. Again, these discounts aren’t because of poor performance. While STK has been on a tear since its inception, returning 12.4% annualized, CCD has also done well, with an 8.4% average yearly total return in the last decade, thanks to its more-conservative focus on bonds. TDF, for its part, has delivered very handsomely, handing investors a massive total return over its long history. TDF’s Amazing Track Record Big profits are great, but they’re just one part of the story. The real prize with these funds is their rich dividends. How CEF Income Stays High for the Long Haul So let’s talk about how CEFs yield 7.1%, on average, and often higher. A portfolio of these three funds, for example, would deliver an 8.3% dividend yield if you bought in today. Ticker Yield on Price STK 4.5% CCD 8.4% TDF 11.9% If you’re wondering how 8.3% yields are sustainable, consider the annualized-return numbers we just discussed. These funds pay out less than their profits, and as long as they do that, they can keep paying those profits out as dividends essentially forever. Many CEFs have done just that: the oldest of these funds have been around for a century or more and have survived the Great Depression, World War II and the subprime-mortgage meltdown. The best of the younger funds have the staying power to last just as long, since they survived the spring 2020 selloff and are now seeing their assets rise in value. Another key factor: CCD, STK and TDF earn their profits by investing in large-cap companies, not by making high-risk bets on unknown entities. Apple (AAPL) and Microsoft (MSFT) are among STK’s largest holdings; likewise, CCD holds bonds issued by Wells Fargo (WFC), Tesla (TSLA), Square (SQ), Workday (WORK) and other high-flyers. TDF holds $75 million worth of Tencent (TCEHY) alone, with investments in China’s biggest tech names—again driving its portfolio higher. What these funds do is simple and ingenious. They pool hundreds of millions of dollars (or, in BST’s case, a billion) from investors, put these funds in a portfolio of diversified stocks (or bonds, real estate investment trusts or private equity, in the case of some CEFs), then manage that portfolio by buying and selling as the market rises and falls. This keeps you diversified and in the market while also converting assets from these funds’ portfolios into cash that’s handed out as dividends. Put $500,000 in these three funds and you’d average over $3,400 per month in dividends that you can either reinvest or use to live on. The choice is yours, thanks to the big yields CEFs provide. Want More Great Investing Ideas? Free Report: 5 Bargain Funds with Safe 11% Dividends A “1-Click” Way to Grab Safe 8% Dividends The $43,000 “dividend secret” Wall Street hides from you STK shares were unchanged in after-hours trading Friday. Year-to-date, STK has declined N/A%, versus a 4.88% rise in the benchmark S&P 500 index during the same period."}]}