{"article": [{"url": "https://stocknews.com/news/etsy-pins-aprn-3-stocks-to-take-advantage-of-the-do-it-yourself-trend/", "published": 1598011700.0, "headline": "3 Stocks to Take Advantage of the ‘Do-it-Yourself’ Trend", "body": "In this coronavirus-afflicted world, it seems that everyone is living life through their screen. So, it’s nice to so do something with your hands once in a while. Do-it-yourself solutions have been gaining popularity, and it’s leading to increased sales and earnings for certain companies. Due to many activities and travel not being possible, people have taken up hobbies to fill their spare time including cooking, gardening, cleaning, and home renovation projects. Companies such as Pinterest, Inc. (PINS), Etsy, Inc. (ETSY), and Blue Apron Holdings, Inc. (APRN) are thriving due to the increasing popularity of do-it-yourself activities. 7 \"SAFE HAVEN\" Dividend Stocks for Turbulent TimesPinterest, Inc. (PINS) PINS is a visual discovery engine, where users can create, manage, and share theme-based image collections. It acts as a visual pinboard, where users primarily share images relating to events, hobbies, and interests. PINS is one of the most popular creativity platforms with more than 322 million active monthly users worldwide at the end of 2019. PINS has gained more popularity during these stay-at-home times, as it provides motivation and creative ideas in a visually appealing and aesthetic manner. This is reflected in the 29.1% increase in PINS’s active monthly user base to 416 million in the second quarter of 2020. Global monthly active users increased by 39% year-over-year in the second quarter ended in June 2020. PINS’ revenue of $272 million improved 4% from the year-ago value. PINS’ estimate for the third quarter ending September 2020 indicates a 30% year-over-year growth in revenues. For July alone, revenue is expected to increase by 50% from its year-ago value. The consensus EPS estimate of $0.02 for the third quarter indicates a 100% increase year-over-year. Also, PINS’ earnings surprise history is impressive, as it beat the street EPS estimates in three out of trailing four quarters. PINS gained more than 275% to hit its 52-week high of $38.23 in August after hitting its 52-week low of $10.10 in March. How does PINS stack up for the POWR Ratings? A for Trade grade B for Buy & Hold Grade B for Peer Grade A for Industry Rank B for Overall POWR Rating. Etsy, Inc. (ETSY) ETSY operates online marketplaces for buyers and sellers to connect and trade goods and services across the United States, Canada, United Kingdom, Germany, France, and Australia. ETSY aims to support local sellers in a particular region and provides various seller services such as Etsy payments, Etsy ads, and Etsy shipping labels. It offers more than 66 million products in various retail categories to buyers. On August 20th, ETSY announced an offering of convertible senior notes worth approximately $650 million. Such funds can help ETSY plan and execute business expansion plans seamlessly. ETSY reported impressive earnings in the second quarter ended June 2020, with a 145.6% year-over-year rise in gross merchandise sales (GMS) to $2.68 billion. ETSY’s net revenue of $428.73 million grew 136.7% from the year-ago value. Market revenue grew 145.6% year-over-year to $332.03 million, while services revenue of $96.70 million grew 110.7% for the same period last year. Net income grew 429.1% year-over-year to $96.42 million, and adjusted EBITDA (non-GAAP) grew 279.4% from the year-ago value to $150.62 million. As evident from the second-quarter results, the demand for ETSY’s products and services have increased substantially despite the COVID driven disruptions. More than 18.70 million new or reactivated buyers used ETSY services during the second quarter. ETSY expects to gain from this growth momentum in the third quarter as well, with estimated GMS and revenue growth of 80-110% and 85-115% year-over-year, respectively. The consensus EPS estimate of $0.58 for the third quarter ending September 2020 indicates a 190% improvement year-over-year. ETSY hit its 52-week low of $29.95 in March due to the virus-driven market crash. It gained more than 370% since then, hitting its 52-week week high of $141.41 in August. ETSY is rated “Buy” in our POWR Ratings system, consistent with its impressive performance in the second quarter. It has an “A” in Trade Grade and Industry Rank, and a “B” in Buy & Hold Grade and Peer Grade. It is ranked #20 out of 54 stocks in the Internet industry. Blue Apron Holdings, Inc. (APRN) APRN is a direct-to-consumer platform providing recipes and fresh and seasonal ingredients for home cooking. Its e-commerce platform Blue Apron market sells cooking tools, utensils, and pantry items among other products. APRN also services direct-to-consumer wine delivery service under Blue Apron Wine. Since the onset of coronavirus, eating out has become less popular due to fears of catching the virus. As a result, APRN’s services gained popularity, indicated by a 10% year-over-year increase in its net revenues to $131 million for the second quarter ended June 2020. Net revenues increased 29% from the first quarter ended April 2020. APRN served 20,000 additional customers during the quarter, with a 25 % year-over-year increase in average revenue per customer. The average number of orders placed by customers increased by 17% from the year-ago value. Adjusted EBITDA increased 148% year-over-year to $11.1 million. APRN’s net income of $1.1 million indicates a substantial increase from $7.7 million loss reported in the prior-year quarter. APRN’s third-quarter ending September 2020 revenue estimate of $112 million indicates a 13% year-over-year increase. On August 6th, APRN announced a public offering of 4 million Class A shares, priced at $9.25 per share. APRN plans to raise $37 million through equity, which is expected to fund the higher volume of business operations and future expansion plans. As the restaurant sector is still reeling from the effects of the pandemic, APRN’s unique business model is expected to become more popular in the upcoming months, as people are more inclined towards home cooking than dining out due to fear of catching the virus. APRN hit its 52-week low of $2.01 on March 13th and gained more than 865% in just 5 days to hit its high of $19.49 on March 18th. Want More Great Investing Ideas? The Best of StockNews 2 Step Process to Sell @ Market Top in September 9 “BUY THE DIP” Growth Stocks for 2020 ETSY shares were trading at $130.64 per share on Friday afternoon, up $0.55 (+0.42%). Year-to-date, ETSY has gained 194.90%, versus a 6.58% rise in the benchmark S&P 500 index during the same period."}]}