{"article": [{"url": "https://stocknews.com/news/fcx-wpm-cog-3-cheap-commodity-stocks-with-major-upside/", "published": 1594123700.0, "headline": "3 Cheap Commodity Stocks With Major Upside", "body": "Though the stock market has outperformed commodities in recent years, that might not be the case going forward. The underperformance in commodities has resulted in decreased production and exploration. This creates the conditions for a future bull market, as increasing demand results in surging prices. Another factor is the unprecedented amount of stimulus – monetary and fiscal – that has been thrown at the market by the Federal government and the Federal Reserve. These types of aggressive measures are now normalized and will be a part of policymakers’ toolkit to combat any sort of economic slowdown going forward. 7 Best ETFs for the NEXT Bull MarketAdditionally, the European Union is also moving towards increased fiscal stimulus which would be another boost to global demand. Finally, in terms of valuation, commodities are looking attractive to stocks. They’re reaching levels that marked previous turning points and heralded major rallies. (Source: Katusa Research) Here are three commodity stocks to take advantage of this shifting tide: Freeport-McMoran (FCX) FCX is a producer of primarily gold and copper. Both commodities have been doing well in recent months with gold 10% off its all-time highs. Given the FOMC’s commitment to keeping interest rates at zero until 2022, gold will continue to have a bid under it. In terms of copper, it makes sense that it would be lagging given the dropoff in economic activity due to the coronavirus. However, it’s been quite strong and is firmly above its pre-coronavirus levels. (Source: Stockcharts.com) It’s always interesting when price action deviates from the accepted narrative. More often, the narrative is probably wrong rather than the price action. In its latest earnings report, FCX said copper sales exceeded guidance by 8%, and gold sales were higher by 10%. FCX’s strong fundamentals are reflected in its POWR Ratings, it has a “Strong Buy” rating with an “A” in Trade Grade, Buy & Hold Grade, Peer Grade, and Industry Rank. Among the Industrials – Metals group, it’s ranked #2 out of 33 stocks. Cabot Oil & Gas (COG) COG is a high-quality company in the natural gas space. It’s one of the few, natural gas stocks which was profitable over the last few years despite low prices. It also has a strong balance sheet which means that it’s going to survive the bear market in natural gas. In the first quarter, its production cost was $1.46 per thousand cubic feet (Mcfe) inclusive of all costs. It sits on the largest, proven reserves in the US in the Marcellus Shale which puts it near the Northeast, where natural gas demand is highest. Cabot could also easily increase production if prices rise. COG is making money during some of the lowest natural gas prices over the past couple of decades. But, there’s reason to think that natural gas prices could rise in the coming years. Natural gas prices have been stuck at their lows due to shale drilling where natural gas is a byproduct. Drilling in the shale patch is plunging due to low prices as new projects are not viable. However, the demand for natural gas remains quite strong as more power-generation moves to this source due to environmental concerns. Countries all over the world are shifting from coal to natural gas as well which could lead to more export opportunities. Just like in other commodities, the natural gas market is unprepared for a spike in demand. Exploration and investment in the sector have been stymied by the rock-bottom prices of the last decade. COG has thrived during its bear market by scooping up undervalued land and is poised to grow and dominate when prices do rebound. Wheaton Precious Metals (WPM) WPM has an interesting business model in that it gives investors exposure to silver without the risk of mining. Miners are risky because they are exposed to the price underlying metal. This gives them a massive upside during bull markets but makes them fall precipitously during bear markets. However, they have additional risks in terms of operating their mines which could be shut down due to environmental regulations, safety issues, labor strife, or simply some sort of mishap in terms of operations. WPM bypasses the latter set of risks because it’s a streaming company. This means that it provides upfront capital to other miners and in exchange gets a royalty on all production. This means that it is diversified and any disruption at a mine doesn’t meaningfully affect its bottom line. In the last quarter, Wheaton’s average cost per ounce of gold was $403. Based on current prices around $1,800 with the production of 182,000 ounces makes the company very profitable. This profitability should increase in future quarters as more projects come online, and the price of gold continues to rise. WPM’s POWR Ratings are consistent with the strength in precious metal and its insulated business model with a Strong Buy Rating. It has an “A” for Trade Grade, Buy & Hold Grade, and Peer Rank and a “B” in Industry Rank. Want More Great Investing Ideas? 9 “BUY THE DIP” Growth Stocks for 2020 Is the Bull S#*t Rally FINALLY Over? 7 “Safe-Haven” Dividend Stocks for Turbulent Times Top 3 Investing Strategies for 2020 FCX shares were trading at $12.69 per share on Tuesday afternoon, down $0.06 (-0.47%). Year-to-date, FCX has declined -2.92%, versus a -1.11% rise in the benchmark S&P 500 index during the same period."}]}