{"article": [{"url": "https://stocknews.com/news/nke-ely-dks-3-golf-stock-to-get-your-portfolio-swinging/", "published": 1594987700.0, "headline": "3 Golf Stock to Get Your Portfolio SWINGING", "body": "In 2019, 24.3 million Americans played golf. This is equivalent to 7% of the US population. This presents a huge market for businesses that sell golf products. What’s interesting is that golf’s popularity peaked in 2000 on the heels of Tiger Woods beginning his epic run. 20 years later, there’s reason to believe that golf could be making a comeback. Just like Tiger Woods, who’s winning Majors again. It’s also the perfect sport for the social distancing world since it’s played outdoors and players can stay apart from each other. Golf courses that reopened reported that tee-times have been quickly getting booked, and clubs are filling up with new members. 9 \"BUY THE DIP\" Growth Stocks For 2020A resurgence in golf’s popularity will lead to increased sales of golf equipment, apparel, and footwear. Here are three stocks to take advantage of golf’s increasing popularity: Nike, Inc. (NKE) Nike needs no introduction. As one of the most popular brands in athletic and recreational products, NKE has managed to survive the economic implications of the COVID-19 pandemic through its extensive digital marketing strategies. The company sells golf apparel and footwear and sponsors some of the world’s top golfers. In the last quarter, it managed to compensate for its loss in sales due to closed physical outlets by increasing digital sales by 75%, thereby generating 30% of the total revenue in the second quarter of 2020. NKE’s losses from retail locations being closed for over 2 months amounted to a $790 million loss just in the Chinese market. Long-term, these challenges could be a blessing as digital sales accelerated which is a channel that will lead to higher margins and more customer retention. With most Nike outlets reopening around the country, sales are coming back. While explaining the vision for 2021, NKE CEO John Donahoe stated, “Amid macroeconomic uncertainty, we will continue to operate with agility, focused on optimizing marketplace supply and demand, cost management and leveraging our financial strength to drive long-term sustainable, profitable growth.” NKE is looking to increase sales in the women’s apparel market, which currently accounts for just 10% of the total sales. NKE has gained more than 60% since hitting its 52-week low in mid-March. It has continuously outperformed the S&P 500 in the past year, showing its relative strength. With an expected annualized earnings growth of 23.6% for the next five years and a dividend yield of 1.01%, the stock is an attractive bet. How does NKE stack up for the POWR Ratings? A for Trade Grade B for Buy & Hold Grade B for Peer Grade B for Industry Rank B for Overall POWR Rating The stock is also ranked #8 out of 32 stocks in the Athletics & Recreation industry. Dick’s Sporting Goods, Inc. (DKS) DKS is one of the most popular companies under the Athletic and Recreation industry. With a comprehensive product range of fitness machinery, clothes, and footwear, DKS has managed to gain market share in the first half of 2020, as people are looking to move from crowded gyms to setting up their home workout stations. DKS managed to gain more than 200% since hitting its 52-week low in mid-March due to the pandemic-led market crash. With a strong e-commerce presence, revenue lost due to closure of all physical outlets was compensated with a 210% rise in online sales during the lockdown period. With the gradual reduction of restrictions, almost 80% of DKS stores have reopened for business since May, which is estimated to boost its revenues. The company expects to experience a combined sales momentum of 250% from online and in-store. The consensus revenue estimate of $2.25 billion for the quarter ending July is almost in line with the year-ago number. Moreover, DKS has an impressive earnings surprise history with the company beating consensus ESP estimates in three of the last four quarters. DKS reported a surplus cash balance of $1.2 billion for the first quarter ending May 2020, demonstrating its strong liquidity position. According to the POWR Ratings, DKS is a “Buy.” However, it has a “B” for Trade Grade, Buys & Hold grade, and Industry Rank. It’s ranked #13 out of 32 Athletics & Recreation stocks. Callaway Golf Company (ELY) Specializing in golf equipment, ELY is one of the oldest sports tools and accessories manufacturers, operating since 1982. ELY has captured significant market share through its USP designs consisting of wood designs, iron, and wedge collection as well as hybrid products. ELY also engages in sales of pre-owned golf clubs, licensing, and trademark business, which accounts for a steady flow of royalties. As the lockdown has decreased the popularity of outdoor sports, ELY’s net sales might have taken a hit. The consensus EPS estimate for the second quarter is a loss of $0.01 compared to a positive value of $0.37 a year ago. ELY has recovered by over 270% since hitting its 52-week low of $4.75 in March due to the pandemic crisis. Unlike DKS and NKE which have diversified revenues, ELY is a pure-play golf stock. Its fortunes will rise and fall with the popularity of the sport. The company has a “B” grade in Industry Rank according to our POWR ratings system. In the 32-stock Athletics & Recreation industry, it is ranked #22. Want More Great Investing Ideas? 9 “BUY THE DIP” Growth Stocks for 2020 Newly REVISED 2020 Stock Market Outlook 7 “Safe-Haven” Dividend Stocks for Turbulent Times NKE shares were trading at $96.47 per share on Friday afternoon, down $0.79 (-0.81%). Year-to-date, NKE has declined -4.27%, versus a 1.10% rise in the benchmark S&P 500 index during the same period."}]}