{"article": [{"url": "https://stocknews.com/news/acb-mj-apha-gwph-cannabis-stock-weekly-recap/", "published": 1594987700.0, "headline": "Cannabis Stock Weekly Recap", "body": "Overall it was a positive week for cannabis stocks. The ETFMG Alternative Harvest ETF (MJ) was up almost 3% as of the close on Friday and the Horizons Marijuana Life Sciences Index ETF (TSX: HMMJ) finished up over 4%. Aurora Cannabis and Aphria’s merger falls apart This week, it was reported that Aurora Cannabis (ACB) and Aphria (APHA) recently held advanced talks to merge the two cannabis producers in what would have been one of the largest mergers in the cannabis sector to date. Those discussions broke down late last week, according to two people familiar with the matter. 7 \"SAFE HAVEN\" Dividend Stocks for Turbulent TimesSources told BNN Bloomberg that both companies took a step back from negotiations surrounding the merger that took place over several weeks ago after failing to agree on board structure and compensation for senior-level executives. Currently, we don’t know if the two companies will come back to the negotiation table regarding the merger talks. GW Pharmaceuticals gets downgraded Despite GW Pharmaceuticals (GWPH) outperforming the broader cannabis sector, one analyst thinks that right now investors should be a lot more cautious and believes that the rally could soon be ending. GWPH fell over 2% after Stifel analyst Paul Matteis downgraded the company by noting disappointing physician feedback regarding “off-label” use of the drug Epidiolex. Matteis cut his rating to hold after maintaining a buy rating for at least two years. He also cut his price target to $140 from $150. Matteis noted that the downgrade wasn’t a call on GW’s second-quarter results, which are expected in early August. He stated that he believes the company will beat expectations as the impact of COVID-19 doesn’t seem as bad as projected. Matteis said, “Instead, what’s led to a change in our view is conservative physician expectations for Epidiolex use in ‘off-label’ refractory epilepsy, whereas we believe substantial uptake here is: 1) key to the bull case; and 2) necessary to meet or beat 2021-2025 consensus sales projections,” The Florida Cannabis Market Posts Strong Numbers As the cannabis sector looks for more clarity from the impact of the COVID-19 pandemic, we can turn to market data for clues. Florida has always done a fantastic job reporting data regarding the cannabis industry. This past Friday there saw a substantial jump in medicinal marijuana patient growth, which increased by more than 5% over the past 4 weeks and has grown by more than 51% over the past year, as reported by New Cannabis Ventures. The weekly sales of medical cannabis products and flower both set records as well. Over the past year, THC product unit volume has gained 66% with patient counts increasing by 51%. Companies such as Trulieve Cannabis (OTC:TCNNF) hit fresh 52-week highs as it’s evident that Florida has one of the strongest and most resilient cannabis markets in America. It’s safe to say that companies focusing on Florida have great potential to grow revenue. Want More Great Investing Ideas? 9 “BUY THE DIP” Growth Stocks for 2020 Newly REVISED 2020 Stock Market Outlook 7 “Safe-Haven” Dividend Stocks for Turbulent Times ACB shares fell $0.03 (-0.25%) in after-hours trading Friday. Year-to-date, ACB has declined -54.17%, versus a 0.99% rise in the benchmark S&P 500 index during the same period."}]}