{"article": [{"url": "https://stocknews.com/news/carr-dxcm-regn-3-best-performing-stocks-in-the-sp-500-so-far/", "published": 1594210100.0, "headline": "3 Best Performing Stocks in the S&P 500 So Far in 2020", "body": "This has been a particularly crazy year in the stock market. The S&P 500 started 2020 at 3,244 and gained 4.81% by February 19th. The index then dropped about 34% to 2,191 on March 23rd due to the uncertainty surrounding the coronavirus. From there the S&P 500 rallied and as of Tuesday’s close, it was trading at 3,245, which is a 46.5% gain. Overall, the S&P 500 is still negative for the year, with a loss of 2.65%. 9 \"BUY THE DIP\" Growth Stocks For 2020Source: Yahoo Finance Throughout this volatility, three stocks have been soaring so far this year. Here are the top three performers in the S&P 500 as of July 7th: Carrier Global (CARR) CARR, a spin off from former industrial multinational conglomerate United Technologies, is a newly listed company. The company provides heating, ventilating, and air conditioning (HVAC) technologies to companies and consumers worldwide. CARR is poised to take advantage of one byproduct of the pandemic, air quality. There will soon be more awareness about air quality in buildings. The company launched the Healthy Buildings Program in early June. The program is an expanded suite of advanced solutions to help deliver healthy, safe, efficient, and productive indoor environments. CARR also can benefit from trends that favor HVACR, including rising urban temperatures, a growing middle class demanding indoor climate control, and urbanization. The stock is up a whopping 99.54% year to date, especially considering it only started trading on March 19th. Source: Yahoo Finance DexCom (DXCM) DexCom is a medical device company, focused on the design, development, and commercialization of continuous glucose monitoring (CGM) systems. People with diabetes and healthcare providers use these systems. As diabetes is affecting more people, DXCM has become a key provider in helping patients fight the disease. The company’s STS Continuous Glucose Monitoring System helps diabetes patients get continuous real-time glucose measurements. Their main product, a G6 monitoring device, is a patch that attaches to the patient’s skin and sends glucose readings to their smartphone app. Patients prefer this to pricking their fingers for blood samples. This came in handy during the pandemic when patients couldn’t go into their doctor’s offices. Doctors were able to access their patient’s readings remotely. Investors love the stock, as it is up 95.42% for the year. Source: Yahoo Finance It shouldn’t be a surprise that DXCM is also one of the top rated stocks in our momentum based POWR Ratings system. Overall, it is the #2 ranked stock in the #10 ranked industry (Medical – Devices & Equipment Stocks). Regeneron Pharmaceuticals (REGN) REGN is a biopharmaceutical company that discovers, invents, manufactures, and commercializes medicines for treating various medical conditions. The biotech industry has seen rapid growth attributed to the search for COVID-19 therapies. The SPDR S&P Biotech ETF (XBI) is up 20.95% for the year. REGN has developed a drug called REGN-COV2, which is a possible COVID-19 treatment. The drug seeks to prevent the coronavirus from entering a host’s cells. Other drugs have also driven REGN’s stock up, including eczema drug Dupixent and eye disorder treatment Eylea. The company also signed a $450 million contract with the federal government’s Biomedical Advanced Research and Development Authority. Under the agreement, REGN will provide a fixed number of doses of its REGN-COV2 treatment. Add this up together, and you have a stock up 71.66% for the year. REGN Chart REGN is holding all Aces. By that I mean that all 5 scores of our exclusive POWR Ratings system is an A for the stock. It is also the #3 ranked stock in one of the top industries, (Biotech). Want More Great Investing Ideas? 9 “BUY THE DIP” Growth Stocks for 2020 Is the Bull S#*t Rally FINALLY Over? 7 “Safe-Haven” Dividend Stocks for Turbulent Times Top 3 Investing Strategies for 2020 CARR shares were unchanged in premarket trading Wednesday. Year-to-date, CARR has gained 100.82%, versus a -1.38% rise in the benchmark S&P 500 index during the same period."}]}