{"article": [{"url": "https://stocknews.com/news/intc-ayx-fsly-3-tech-stocks-to-avoid/", "published": 1599480500.0, "headline": "3 Tech Stocks to AVOID", "body": "From its March low to its recent high on Wednesday of last week, the Nasdaq had gained 82%. There were a number of indications that the stock market rally was venturing into dangerous territory. Some of the “red flags” included weakening market breadth, excessively bullish sentiment, and historic levels of stocks being overbought by some measures. This increased the market’s vulnerability to a major selloff. Between last Wednesday’s high and Friday’s low, the Nasdaq has lost 11%, essentially wiping out August’s gains. This is the first significant pullback since early-June when the Nasdaq lost 6.3%. Pullbacks can offer low-risk, attractive entry points for stocks that you want to own for the long-term. It might also be appealing to anyone who’s patiently been waiting for markets to dip before entering long positions. 9 \"BUY THE DIP\" Growth Stocks For 2020Of course, there’s a divide between people who anticipate that the dip will lead to a V-shaped rebound back to new highs and those who see it as the start of a more extended correction. Tech Stocks Look Iffy While there is a great deal of focus on the big swings in the indices over the last week, one interesting development is that many of the “reopening” stocks like airlines, cruises, hotels, and restaurants are demonstrating some constructive price action. Fundamentals are supportive in terms of case counts dropping in hotspots and the continued month over month recovery in the economy. Many are trading in a tight range and look primed to make a big move. So far, they have not participated in the sell-off. Additionally from a bottom-up level, a handful are starting to break out of their ranges on high volume. In contrast, technology stocks have been the weakest among all groups during the first two days of this sell-off. It’s possible that rather than a correction, this is a rotation from overextended tech stocks into beaten-down sectors. Another piece of evidence to support this thesis is the difference in performance between the Invesco QQQ Trust (QQQ) aka the Nasdaq 100 ETF and the iShares Russell 2000 (IWM). While QQQ is down 11% from Wednesday’s high to its low on Friday, IWM was only down 6% over the last two days. Valuations in tech stocks have hit extreme levels. On a technical level, they’ve also become very overbought. QQQ hit a record at Wednesday’s peak by being 35% over its 200-day moving average. These factors mean that there is more downside risk. In an extended correction scenario, tech will sustain the heaviest losses as valuations come in and prices revert to the mean. And if it’s more like a V-shaped dip then other sectors, showing accumulation, are more likely to outperform. 3 Stocks to Avoid Within the tech stock universe, you want to avoid companies that have some combination of an earnings miss, high multiples, and disarray in their business. Intel Corporation (INTC), Alteryx (AYX), and Fastly, Inc. (FSLY) have some of these characteristics and are three stocks that you should avoid. Intel (INTC) At first glance, INTC looks like a great opportunity. Unlike FSLY and AYX, it has low multiples. INTC has a price-to-earnings (p/e) ratio of 9.2 which is a third of the S&P 500’s p/e of 27. It pays a 2.64% dividend which is four times the 10-year Treasury’s yield of 0.68%. It turns out that Intel’s stock is like many things in life that seem too good to be true. Instead, it has all the makings of a classic “value trap”. In the same way, that adhering to traditional valuation metrics can keep you out of growth opportunities, these metrics can suck you into companies whose prospects are deteriorating. INTC has simply failed to keep up with its competitors, and its recent conference call indicated that it is falling even further behind in terms of 7 nm chips. This is concerning, so while its present business looks strong, its future prospects are deteriorating. Intel is losing its leading-edge position in semiconductors to upstarts like AMD (AMD) and NVIDIA (NVDA). It likely means that they will lose market share in data center chips which is the fastest-growing part of the semiconductor industry. Fastly (FSLY) FSLY is a content delivery network. It specializes in “edge computing” which means decentralizing processing power to the clients and devices on the network rather than from a central server. It makes cloud systems faster and more agile. FSLY has been one of the biggest winners since the market bottom. It bottomed around $10 and then topped above $110 in early-August which means the stock had more than a 1,000% gain in less than five months. The stock is down 32% since its top. FSLY gets 12% of revenues from TikTok, so there were concerns that a shutdown of its US operations would affect FSLY. The company also delivered earnings that were in-line with expectations rather than beating and raising guidance as it has done in the past. FSLY doesn’t have a p/e ratio, since it’s not profitable. It has a price-to-sales (p/s) ratio of 34. It has an $8 billion market cap but expects a little under $300 million in sales. A stock like FSLY that is overextended has very high valuations and is showing a slowdown in earnings momentum is most vulnerable to further losses if the Nasdaq continues to sell-off. Alteryx (AYX) AYX is another cloud computing stock that saw massive gains before selling-off on an earnings miss. AYX is a cloud-based data analytics company that helps its customers optimize their cloud’s operations to save money and increase efficiency. AYX’s stock had gained nearly 120% since the March bottom, however, the stock sold off 35% following its earnings report. AYX topped guidance but warned that it had noticed a slowdown in corporate IT spending due to the pandemic with a longer sales cycle and more focus on costs. AYX’s recent results make it clear that there’s going to be a slowdown in the company’s trajectory. Over the last six years, its revenues had grown by 10x. Even after its massive correction, AYX has a forward p/e of 116 and a p/s of 16. These numbers are inflated for a company whose growth rate is decelerating. Like FSLY, AYX is an interesting business with long-term upside but its high multiples and slowing growth forecast make them stocks to avoid especially in this market environment. AYX’s POWR Ratings are consistent with this picture. The stock is rated a Sell, and it has an “F” for Trade Grade with a “D” for Buy & Hold Grade and Peer Grade. Among Software – Application stocks, it’s ranked #58 out of 92. Want More Great Investing Ideas? 7 Best ETFs for the NEXT Bull Market Beware Stocks in September? 9 “BUY THE DIP” Growth Stocks for 2020 INTC shares were trading at $50.08 per share on Monday morning, down $0.31 (-0.62%). Year-to-date, INTC has declined -14.86%, versus a 7.53% rise in the benchmark S&P 500 index during the same period."}]}