{"article": [{"url": "https://stocknews.com/news/ajg-bc-band-cmcsa-rbbn-3-stocks-that-wall-street-analysts-recommend-to-buy/", "published": 1596629300.0, "headline": "3 Stocks that Wall Street Analysts Recommend to Buy", "body": "When a financial analyst offers coverage on a stock, Wall Street and retail investors pay attention. That is because analysts keep a close eye on every development a company makes. To trigger a Buy, Strong Buy, Hold, Sell, or Strong Sell, something has usually changed for a company. It could be a surprise earnings beat or miss, a new executive being hired or fired, a shift the economy, a delay in the release of a product or service, etc. When a stock is rated a Buy, it often moves higher, and when it is rated a Sell, it often moves lower. Which is why during this uncertain economic environment, it could be a good idea to stay away from stocks with Sell ratings and focus on stocks with Buy ratings. 7 \"SAFE HAVEN\" Dividend Stocks for Turbulent TimesTake a look at Arthur J. Gallagher & Co. (AJG), Brunswick Corporation (BC), and Bandwidth Inc. (BAND), three companies that have Buy Ratings from Wall Street analysts and our StockNews POWR Ratings system. Arthur J. Gallagher & Co. (AJG) Seven out of Nine Wall Street analysts currently have a buy rating on AJG. The average analyst price target for AJG is $115.78, which is 9.4% higher than its current price. This insurance brokerage and risk management services company has grown more than 60% since its March lows. In the second quarter, AJG’s EBITDAC increased by 33.9%, and EPS increased 36.2% year over year. AJG pays an annual dividend of $1.80, which yields 1.7%. In fact, AJG has increased its dividend for 22 quarters in a row. AJG’s consensus revenue estimate of $1.41 billion for the quarter ending September 2020 indicates a marginal increase year over year. Also, the market expects the company to report earnings of $0.88 per share, which indicates an 8.7% improvement over the year-ago number. Moreover, AJG has an impressive earnings surprise history with the company beating consensus EPS estimates in each of the trailing four quarters. How does AJG stack up for the POWR Ratings? A for Trade Grade A for Buy & Hold Grade B for Peer Grade B for Industry Rank A for Overall POWR Rating You can’t ask for better. The stock is also ranked #3 out of 8 stocks in the Insurance-Brokers industry. Brunswick Corporation (BC) Eight out of Ten Wall Street analysts currently have a buy rating on BC. The average analyst price target for the stock is $78.67, which is 15% higher than its current price. BC is a player in the recreation sector and has returned more than 170% since it hit its 52-week low of $25.22 on March 23rd. The earnings surprise history for BC looks pretty good, as the company beat the street EPS estimates in each of the trailing four quarters. BC’s consensus revenue estimate of $1.07 billion for the quarter ending September 2020 indicates a year-over-year increase of 7.8%. BC’s CEO David Foulkes said, “While we remain very cognizant of potential future macroeconomic headwinds and other uncertainties, our resilient second quarter performance, together with a surging marine retail environment, has created substantial growth opportunities for the remainder of 2020 and 2021. Given recent sustained demand, elevated production levels over time will be required to rebuild pipelines, and together with substantial upcoming new product offerings, should drive wholesale growth through 2021 and potentially beyond.” Furthermore, cash and marketable securities at the end of the second quarter totaled $553.9 million, up by $221.2 million from 2019 year-end level. BC anticipates its revenue and operating earnings in the second half of 2020 would exceed that of the year-ago period. The company also anticipates free cash flow generation in 2020 to be in excess of $325 million, which was its pre-Covid-19 target. It’s no surprise that BC is rated a “Buy” in our POWR Ratings system. It also has an “A” for Trade Grade, and a “B” for Buy & Hold Grade, Peer Grade, and Industry Rank. In the 32-stock Athletics & Recreation industry, it is ranked #14. Bandwidth Inc. (BAND) This software company focused on enterprise communication has grown more than 155% since its March lows. Six out of Seven Wall Street analysts have a buy rating on BAND. The average analyst price target for BAND is $162.50, which is 6% higher than its current price. BAND recently announced a partnership with Comcast (CMCSA) to delivery authenticated calls between their networks, which will help combat robocalling and malicious phone number spoofing practices. BAND also announced the availability of Duet for Microsoft Teams, which provides a solution for Direct Routing and Dynamic E911. In addition, Ribbon Communications’ (RBBN) recent collaboration with BAND will expand network capacity for BAND customers quickly using Amazon Web Services. In the second quarter, revenue was up 35% year over year, active CPaas customers were up 30% year over year, and dollar-based net retention rate was 133% compared to 113% a year ago. The market expects the company to report a loss per share of $0.02 for the quarter ending September 2020, which represents a significant improvement over the year-ago loss per share of $0.06. Moreover, you should note that BAND beat the consensus EPS estimates in three of the trailing four quarters. BAND’s POWR Ratings reflect this promising outlook. It has an overall rating of “Strong Buy” with an “A” for Trade Grade, Buy & Hold Grade, and Peer Grade, and a “B” for Industry Rank. Among the 51 stocks in the Technology-Communication/Networking industry, it’s ranked #8. Want More Great Investing Ideas? 9 “BUY THE DIP” Growth Stocks for 2020 How to Trade THIS Stock Bubble? 7 “Safe-Haven” Dividend Stocks for Turbulent Times AJG shares were unchanged in after-hours trading Wednesday. Year-to-date, AJG has gained 11.77%, versus a 4.25% rise in the benchmark S&P 500 index during the same period."}]}