{"article": [{"url": "https://stocknews.com/news/ogi-is-organigram-finally-a-buy/", "published": 1594123700.0, "headline": "Is Organigram Finally a Buy?", "body": "Last week OrganiGram (OGI) announced that it would be reducing staff by 25% as the COVID-19 pandemic weighs on the industry. The decision to cut staffing will affect approximately 220 employees, including a small number of employees not on temporary layoff. The company also plans to move forward with 433 active employees who operate out of its indoor production facility in Moncton, New Brunswick. OGI has a total workforce of 609 employees, including 84 employees who remain on temporary layoff, but may be called back to work. With its reduced workforce, the company believes that it can continue to meet current and anticipated near-term demand levels. 7 \"SAFE HAVEN\" Dividend Stocks for Turbulent TimesOrganiGram's CEO Greg Engel said, “These decisions are never easy to make, but we are committed to ensuring the Company is appropriately sized relative to market conditions - we are incredibly grateful for the commitment that our affected employees have made in helping build the Company that Organigram is today.” I view the reduction in staff as positive for the company as it adjusts to the current market environment, I remain optimistic in the long-term for many reasons. First, the company has a healthy balance sheet compared to some of its peers. OGI has very little debt, a strong cash position, and fewer operating expenses than some of its larger competitors with huge facilities. Furthermore, the company will be focusing on 2.0 products with a new production line capable of producing 4 million kgs of edible chocolate per year. Though layoffs are never pleasant, it is prudent for the company to reduce its size and become leaner and more efficient as the economy faces major headwinds due to the spread of the coronavirus. OGI shares were trading at $1.61 per share on Tuesday afternoon, up $0.05 (+3.21%). Year-to-date, OGI has declined -34.29%, versus a -1.04% rise in the benchmark S&P 500 index during the same period."}]}