{"article": [{"url": "https://stocknews.com/news/crwd-chkp-net-pept-should-you-buy-shares-of-crowdstrike-under-150/", "published": 1601554100.0, "headline": "Should You Buy Shares of CrowdStrike Under $150?", "body": "With businesses being forced to go online and operate over cloud computing, as a result of the pandemic, corporations are placing an emphasis on cybersecurity and cloud protection. CrowdStrike (CRWD) rose to the occasion by providing cloud-delivered endpoint protection. Leveraging artificial intelligence (AI), the CrowdStrike Falcon platform protects customers against cyberattacks on endpoints on or off the network by offering visibility and protection across the enterprise. CRWD is one of the best performing cybersecurity stocks of 2020, with a powerful business model generating record revenue. In the second quarter that ended in July, top-line was up 84% year-over-year to $199 million, and annual recurring revenue (ARR) increased 87% year-over-year to $790.6 million. The company reported a loss of $0.14 per share, significantly improving from the year-ago loss of $0.4 per share. With the robust growth in its operating results, the stock has gained 175.4% year-to-date. This impressive performance and a potential upside based on a number of factors, has helped it earn a “Buy” rating in our proprietary ratings system. 7 \"SAFE HAVEN\" Dividend Stocks for Turbulent TimesHere is how our proprietary POWR Ratings system evaluates CRWD: Trade Grade: A CRWD is currently trading higher than its 50-day and 200-day moving averages of $119.11 and $82.76, respectively, indicating that the stock is in an uptrend. In fact, the stock’s 37% return over the past three months reflects this solid short-term bullishness. CRWD added 969 net new subscription customers in the last reported quarter to take the total to 7,230 subscription customers. This represents 91% year-over-year growth. CRWD’s subscription customers that have adopted four or more cloud modules increased to 57%, and those with five or more cloud modules increased to 39%, compared to the year-ago quarter. Moreover, the company was identified as the fastest-growing endpoint security software vendor in the IDC Worldwide Endpoint Security Software Market Shares 2019 report. Buy & Hold Grade: B In terms of proximity to its 52-week high, which is a key factor that our Buy & Hold Grade takes into account, CRWD is fairly positioned. The stock is currently trading 10.3% below its 52-week high of $153.10. CRWD has recently announced that it has completed the acquisition of Preempt Security, a leading provider of Zero Trust and conditional access technology for real-time access control and threat prevention. Moreover, CRWD also formed an alliance with workforce and customer identity software provider Okta (OKTA), and security peers Proofpoint (PFPT) and Netskope earlier this year. In words of George Kurtz, the CEO of CRWD, “A favorable competitive environment and strong secular tailwinds are fueling our growth. Organizations are shedding outdated systems and accelerating their move to modern cloud-native technologies to meet the demands of today’s threat landscape.” Peer Grade: A CRWD operates in the cybersecurity industry. Other popular stocks in the group are Check Point Software Technologies (CHKP), Cloudflare (NET), and Proofpoint (PFPT). CRWD comfortably beat the year-to-date gains of its peers as CHKP, NET, and PEPT returned 8.5%, -8%, and 104.7%, respectively, over this period. Overall POWR Rating: B (Buy) Overall, CRWD is rated a “Buy” due to its impressive quarterly performances, diligent alliances, and solid price momentum, as determined by the components of our overall POWR Ratings. Bottom Line As more companies adopt cloud-based services, security will be of the uttermost importance. This should continue to create demand for the company’s offerings. Unlike some of the older cybersecurity outfits, CRWD isn’t simply interested in taking over market share. Rather, the company is trying to architect a brand-new type of security for the modern age. However, the company needs to do more than protect endpoints to continue its momentum in the long run. Analyst sentiment, which gives a good sense of a stock’s future price movement, is pretty impressive for CRWD. The street expects revenues for the current quarter ending October 2020 to grow 69.9% year-over-year. The consensus EPS estimate for the ongoing quarter indicates a 100% rise from the year-ago value. This outlook should keep CRWD’s price momentum alive in the near term. Want More Great Investing Ideas? Do NOT Buy Stocks Before the Election! 7 “Safe-Haven” Dividend Stocks for Turbulent Times Chart of the Day- See Christian Tharp’s Stocks Ready to Breakout CRWD shares were trading at $143.03 per share on Thursday afternoon, up $5.71 (+4.16%). Year-to-date, CRWD has gained 186.81%, versus a 6.08% rise in the benchmark S&P 500 index during the same period."}]}