{"article": [{"url": "https://stocknews.com/news/sap-eric-wit-sqm-4-undervalued-international-stocks-for-sale/", "published": 1597147700.0, "headline": "4 UNDERVALUED International Stocks \"For Sale\"", "body": "While the S&P 500 is 2% off its all-time highs, many stocks are still trading at significant discounts from their pre-coronavirus highs. Rather than chasing stocks that are making new highs, this is a good time to sort through stocks that are lagging the market. Among these stocks, international stocks are interesting, because they will benefit from the dollar’s weakness. Leading indicators of global growth like the New Orders Index and PMIs have surged into expansion mode which is consistent with a meaningful inflection point. 7 \"SAFE HAVEN\" Dividend Stocks for Turbulent TimesAdditionally, many countries are ahead of the US in terms of curbing the coronavirus’ spread, and their economies are further along on the path to normalization. SAP SE ADS (SAP), Ericsson (ERIC), Wipro Limited (WIT), and Sociedad Quimica y Minera S.A (SQM) are trading at significant discounts from pre-coronavirus levels, but these stocks will rise as the global economy continues to heal. SAP SE ADS (SAP) Though this German company faced challenges due to the pandemic, more than 400 companies have gone live with SAP SuccessFactors solutions in the first half of 2020. More than 70 new customers selected SAP solutions for procurement and external workforce management. Besides, more than 160 existing SAP customers licensed additional SAP Ariba and SAP Fieldglass capabilities. Luka Mucic, CFO of SAP said, “We were happy to see such a strong sequential improvement in software licenses revenue and robust margin expansion. Our broad solution portfolio, unmatched industry and geographic diversification coupled with our strong base of more predictable revenue have allowed us to manage the COVID-19 crisis this quarter. With our investments in strategic growth areas, we are confident we will not only weather the crisis but emerge even stronger. We were also pleased to see a strong acceleration in free cash flow despite the current market dynamics.” In the second quarter, earnings per share were up 54% and operating profit increased 41% year-over-year. Since its March lows, the stock has gained about 70%. SAP has a forward P/E ratio of 27.13 and a Cash/Price ratio of 0.04 which are both lower than their respective industry averages. SAP’s consensus revenue estimate of $8.11 billion for the quarter ended September 2020 indicates a year-over-year increase of 4.9%. Also, the market expects the company to report earnings per share of $1.53 for the quarter ended in September 2020, which represents a 7% improvement over the year-ago EPS. in SAP has an impressive earnings surprise history with the company beating consensus EPS estimates in three of the trailing four quarters. SAP’s EPS is expected to grow by 9.5% per annum in the next five years. How does SAP stack up for the POWR Ratings? A for Trade Grade A for Buy & Hold Grade A for Industry Rank B for Peer Grade A for Overall POWR Rating You can’t ask for better. The stock is also ranked #3 out of 83 stocks in the Software-Application industry. Ericsson (ERIC) ERIC, a Swedish company that provides communication technology and services, has demonstrated a strong performance in the 5G and cloud-native space with investments in R&D and strategic collaborations with companies. Moreover, ERIC has maintained its group financial targets for 2020 and 2022 and has witnessed increased market share in various markets. ERIC’s PEG ratio of 0.79 and cash flow (dollars per share) of 0.40 are both lower than the respective industry averages. Since ERIC hit its 52-week low of $6.15 on 16th March, the stock has grown more than 85%. ERIC’s consensus revenue estimate of $6.42 billion for the quarter ended September 2020 indicates a year-over-year increase of 8.1%. SAP’s EPS is expected to grow 26.3% per annum in the next five years. In the second quarter, the company’s EPS increased by 45% and free cash flow before M&A increased by 102% year-over-year. It’s no surprise that ERIC is rated “Strong Buy” in our POWR Ratings system. It also has an “A” for Trade Grade, Buy & Hold Grade, and Peer Grade. In the 35-stock Telecom-Foreign industry, it is ranked #1. Wipro Limited (WIT) There have been many positive developments associated with WIT lately such as the company’s collaboration agreements with Intel and Metro Bank, the selection of Google Cloud for advanced digital transformation strategy, its agreement to acquire 4C which is one of the largest Salesforce partners in UK, Europe, and the Middle East and the announcement that it will launch its 5G edge services solutions suite. The global information technology consulting and business process services company based in India has forward P/E and price/cash flow ratios of 18.85 and 15.31, respectively, which are lower compared to the industry averages. The stock has returned about 60% since its March lows. WIT’s EPS is expected to grow 9% per annum in the next five years. For the quarter ended June 30th, 2020, earnings per share increased 5.7% and total revenue increased 1.6% year-over-year. Shareholder yield, a measure of how much is returned to shareholders via dividends and share repurchases, for WIT came in at 599.9% which is higher than that of 99.08% of stocks in the StockNews.com universe. WIT’s POWR Ratings reflect this promising outlook. It has an overall rating of “Strong Buy” with an “A” for Trade Grade, Buy & Hold Grade and Peer Grade, and a “B” for Industry Rank. Among the 14 stocks in the Outsourcing-Tech Services group, it’s ranked #4. Sociedad Quimica y Minera S.A (SQM) SQM is a Chile-based company focused on strategic industries for humans and operates in five business lines: Specialty Plant Nutrition (NVE), Iodine and derivatives, Lithium and derivatives, Potassium, and Industrial Chemicals. In the first-quarter earnings report, CEO Ricardo Ramos said, “We believe that our sales volumes should be higher in the remaining quarters of 2020, especially in the lithium business line. We have seen some markets starting to get back to normal levels of activity while in some others, the economic activity continues at weaker levels. Fertilizers have been declared essential in most places, and the demand for some of the products that we produce and sell may not be significantly impacted by the pandemic. We have always maintained a strong balance sheet to allow us to react to opportunities and challenges.” As per the company’s first-quarter report, cash and cash equivalents increased 23.6% quarter-over-quarter. SQM has a PEG ratio of 3.17 and a Cash/Price ratio of 0.09 which are both lower than their respective industry averages. Since the stock hit its 52-week low of $15.20 on 18th March this year, it has grown more than 105%. SQM is rated “Strong Buy” in our POWR Ratings system. It also has an “A” for Trade Grade, Buy & Hold Grade, and Peer Grade. It is also ranked #4 out of 68 stocks in the Chemicals group. Want More Great Investing Ideas? 9 “BUY THE DIP” Growth Stocks for 2020 How to Trade THIS Stock Bubble? 7 “Safe-Haven” Dividend Stocks for Turbulent Times SAP shares . Year-to-date, SAP has gained 20.02%, versus a 4.46% rise in the benchmark S&P 500 index during the same period."}]}