{"article": [{"url": "https://stocknews.com/news/amzn-baba-msft-pypl-4-mega-cap-stocks-to-buy-and-hold-for-decades/", "published": 1601554100.0, "headline": "4 Mega-Cap Stocks to Buy and Hold for “Decades”", "body": "Now that the market is undulating on a weekly basis, it may be time to shift some of your money away from risky small and mid-cap stocks, to mega-cap stocks. Though plenty of the most intriguing mega-cap stocks are in the tech sector, these companies are comparably safe plays simply due to their proven business models. Do not invest your limited free time searching through mega-cap stocks. Instead, let us do the work for you. We have identified some of the most intriguing mega-cap stocks worth buying and holding across the long haul. Let’s take a look at four mega-caps every investor should buy and hold for years: Amazon (AMZN), Alibaba (BABA), Microsoft (MSFT), and PayPal (PYPL). 7 \"SAFE HAVEN\" Dividend Stocks for Turbulent TimesAmazon (AMZN) AMZN has emerged as the king of mega-cap stocks. The company has expanded its tentacles into the gaming, streaming, movie, and grocery realms in recent years. If the federal government does not step in to break up AMZN, there is no telling how big this company will get. It is quite possible AMZN will even gain market share from the likes of Fiverr (FVRR) and Upwork in the WFH (work from home) space through its mechanical turk remote work platform. Check out the POWR Ratings and you will find AMZN has “B” grades in the Peer Grade and Buy & Hold Grade POWR components. The stock is ranked in the top 10 of nearly 60 Internet stocks. If you take a look at analysts’ view on AMZN and you will find they have high expectations, setting an average price target of $3,732.29. In fact, 37 of 37 analysts recommend buying the stock. Though AMZN is priced at more than $3,000 per share, it still has a forward P/E under 100. This is important to note as AMZN is a technology company with seemingly limitless growth. AMZN is making strides outside of the United States as well, gaining market share and widening its product and service scope with each passing day. It is difficult, if not impossible, to find a better “buy and hold” mega-cap than AMZN. Alibaba (BABA) If you are hesitant to invest in AMZN due to its elevated price and potential to be broken up due to anti-trust issues, shift your attention to the AMZN of the East, BABA. BABA is China’s go-to e-commerce business. BABA also provides services ranging from cloud computing to food delivery and beyond. BABA has nearly perfect POWR Ratings with “A” grades in the Peer Grade and Trade Grade components. BABA is ranked in the top 10 of 115 China stocks. The analysts think BABA will ascend to $308.33, meaning there may be 11% upside. BABA’s forward P/E ratio is surprisingly low at 30.69, indicating the stock is likely to climb even higher as more business shifts online due to the pandemic and the gradual societal shift to the web in China. Microsoft (MSFT) Few companies are as worthy of your investing dollars as MSFT. MSFT has its fingers in a seemingly countless number of tech pies. From computer operating systems to software, video games, the cloud, infrastructure-as-a-service, platform-as-a-service, productivity applications, desktop/server management tools and beyond, MSFT does just about everything computer-related. MSFT has “B” grades in each POWR component, but its Trade Grade. MSFT is ranked in the top 15 of nearly 100 Software – Application stocks. Analyst view MSFT is currently undervalued, setting an average price target of $230.92 for the stock, which could mean more than 11% upside. MSFT has a reasonable forward P/E ratio of 32, indicating it has sufficient runway to increase in value in the months and years ahead. MSFT is down 12% from its 2020 high. This just might be the best time to buy. This is a great company with a net profit in excess of $44 billion and more than $70 billion in cash reserves. PayPal (PYPL) More payments will be processed over the web as economic activity, including labor, shifts online in the near future. PYPL is the world’s go-to payment processor on the web. PYPL’s Venmo service is also quite popular for transferring money between parties. In short, if you believe online payments will become the norm, you owe it to yourself to consider PYPL. As long as Venmo does not lose significant market share to Square’s Cash App, it will continue to drive PYPL revenue growth. PYPL has fantastic POWR components, highlighted by an “A” Peer Grade and a top five ranking of nearly 50 stocks in the Consumer Financial Services industry. This might be an opportune time to scoop up some PYPL shares considering analysts have set a price target of $220.27 for the stock. PYPL’s expanding merchant network, pandemic tailwinds, and 22% annual revenue growth make it quite tempting, especially at a price point below $200 per share. Want More Great Investing Ideas? Do NOT Buy Stocks Before the Election! 7 “Safe-Haven” Dividend Stocks for Turbulent Times Chart of the Day- See Christian Tharp’s Stocks Ready to Breakout AMZN shares rose $55.27 (+1.76%) in premarket trading Thursday. Year-to-date, AMZN has gained 73.35%, versus a 6.44% rise in the benchmark S&P 500 index during the same period."}]}