{"article": [{"url": "https://stocknews.com/news/orcl-msft-twtr-is-oracles-partnership-with-tiktok-good-for-the-stock-price/", "published": 1600258100.0, "headline": "Is Oracle’s Partnership With TikTok Good For the Stock Price?", "body": "One of the more interesting situations in the investing world over the last couple of months concerns the fate of TikTok, the video streaming app that is hugely popular among teens. This is a target market that most companies are dying to have access to. TikTok is owned by a Chinese company called ByteDance, which means the massive amount of data pouring into the TikTok app from American users is readily available to management at the corporate headquarters in Beijing and therefore potentially to the Chinese government. Not only is the U.S. engaged in a trade war with China, but also access to that much U.S. data does pose something of a national security concern. Because of these concerns, the White House demanded that ByteDance sell its U.S. TikTok operations to an American company, or the app would be banned. As a result, several big players began the bidding and lobbying process to woo ByteDance into selling them TikTok. 7 \"SAFE HAVEN\" Dividend Stocks for Turbulent TimesOracle (ORCL), Microsoft (MSFT) and Twitter (TWTR) Of course, ByteDance had no desire to sell the product outright (given how popular it is). Plus, China probably doesn’t like the idea of being pushed around by the U.S. Nevertheless, big tech companies like Microsoft (MSFT), social media giants like Twitter (TWTR), and enterprise software giant Oracle (ORCL) all made known their interest in TikTok. Surprisingly, ORCL is set to become the winner in the TikTok stakes. Well, not entirely: the company is going to partner with ByteDance, with user data stored on secure U.S. servers. Early indications are the White House will sign off on the deal. (It turns out the CEO of Oracle, Larry Ellison, is a big supporter and fundraiser for the Trump reelection campaign… go figure.) So what would a database and enterprise software company want with TikTok anyhow? Mostly, it’s about breaking into the cloud computing space. That’s where the present and future are in terms of networking/storage technology. And, it’s one area ORCL needs a boost in. So is this partnership going to be good for ORCL’s share price? We don’t know the terms of the deal yet, but in the options market, the action has been mostly bullish. One strategist is making a short-term bet that ORCL has at least some upside left (it’s already up 10% after the TikTok announcement, as of this writing). With the stock trading at around $60, this trader purchased the October 23rd 61-65 call spread for $1.35. A call spread is when the lower call strike is bought and the higher strike is sold. It is used to lower the cost of the trade, but in return it caps the upside potential. In this case, the trader paid $1.35 per spread (500 of the spreads were bought), which is also the max loss on the trade. However, if ORCL is at $65 or above at expiration, max gain is $2.65 — a 196% potential return. That’s not bad for a call spread with over a month to go until expiration, and it is just above the current price of the stock. It suggests ORCL doesn’t have too much more upside, but still provides a way to earn solid returns should the stock price continue to climb. Want more great investing ideas? Download free the “10-Step Options Trading Checklist” you need before making a trade. The Virtual Trading Pit Is Open: Trade Set-ups, Training, New Trading Ideas How to Try Out Options Without Risking a Penny ORCL shares . Year-to-date, ORCL has gained 15.60%, versus a 6.35% rise in the benchmark S&P 500 index during the same period."}]}