{"article": [{"url": "https://stocknews.com/news/znga-psec-fit-3-robinhood-100-stocks-under-10-actually-worth-buying/", "published": 1602245300.0, "headline": "3 “Robinhood 100” Stocks Under $10 Actually Worth Buying", "body": "Founded in April 2013, the trading platform Robinhood rose to fame by offering commission-free trades, no account minimums, and an easy-to-use mobile app. It removes a lot of obstacles which otherwise might have deterred young investors from participating in the financial markets. Even though not directly responsible, Robinhood has received its share of criticisms too, with the users making risky decisions and facing the consequences. Leaving controversies aside, the Robinhood 100 List can provide a gauge of where the millennial generation is investing its money. The list is created based on how many users own each stock. Whether stocks on the list are worthy investments or not, is another story. Many stocks on the list could be considered risky investments, but there are some stocks worth considering. Here are three stocks in the Robinhood 100, trading under $10, and worth a look due to their underlying financial strength: Zynga Inc. (ZNGA), Prospect Capital Corporation (PSEC), and Fitbit, Inc. (FIT). 9 \"BUY THE DIP\" Growth Stocks For 2020Zynga Inc. (ZNGA) ZNGA develops, markets, and operates online social games as live services played on the internet, social networking sites, and mobile platforms in the United States, Asia, and Europe. Its games include FarmVille, Zynga Poker, Words with Friends, Hit it Rich! Slots and CSR. For the quarter that ended June 2020, Empires & Puzzles, Merge Dragons!, Merge Magic! and Game of Thrones Slots Casino were the largest drivers of the company’s year-over-year growth in revenue. For the quarter that ended June 2020, ZNGA recorded a revenue of $452 million, up 47% year-over-year. Operating cash flow of $145 million was the highest since the fourth quarter of 2011, up 47% year-over-year. The stock has gained more than 50% year-to-date, with a closing price of $9.30 after yesterday’s trading session. The company has continued to grow based on acquisitions. ZNGA acquired Small Giant Games and Gram Games, which have performed well. On October 2nd, ZNGA closed its acquisition of Istanbul-based Rollic, a leader in the Fast-Growing Hyper-Casual Games business. ZNGA’s EPS is expected to grow 20% next year and at a rate of 16.8% per annum over the next five years. The company’s revenue is estimated to increase 21.4% next year. ZNGA’s earnings surprise history also looks impressive with the company missing the consensus estimate in just one of the trailing four quarters. How does ZNGA stack up for the POWR Ratings? A for Trade Grade B for Buy & Hold Grade B for Peer Grade B for Industry Rank B for Overall POWR Rating The stock is also ranked #4 out of 15 stocks in Entertainment – Toys & Video Games industry. Prospect Capital Corporation (PSEC) PSEC is a leading provider of private debt and private equity. It invests primarily in first and second lien secured loans and unsecured debt, senior and subordinated debt and in equity of companies in need of capital for acquisitions, divestitures, growth, development, recapitalizations and other purposes. Based in New York, it operates mostly in the United States and Canada. For the fiscal quarter that ended June 30, 2020, PSEC announced a 2.5% increase in net asset value per share. On September 3rd, it announced the launch of a cash tender offer for its outstanding 4.95% Senior Convertible Notes due 2022. That stock closed yesterday’s trading session at $5.19, gaining almost 34% since hitting its 52-week low in April. The market expects the company’s revenue to increase 4.7% next year. PSEC’s EPS is expected to grow 1.5% next year and at a rate of 5% per annum over the next five years. PSEC’s POWR Ratings reflect this promising outlook. It has an overall rating of “Buy” with an “A” for Trade Grade and Peer Grade, and a “B” for Buy & Hold Grade. Among the 55 stocks in Private Equity industry, it’s ranked #4. Fitbit, Inc. (FIT) FIT is a pioneering developer of wearable fitness-tracking devices, primarily providing health solutions in the United States and internationally. The company makes both wrist bands and clippable devices that monitor a user’s fitness activity. With people spending more time at home and trying to stay fit, FIT has been in focus. Fitbit Premium, a paid membership service that gives one guidance to help move more, manage stress, sleep better and eat well, has reached more than 500,000 paid subscribers in less than a year since its launch. FIT reported revenue of $261 million for the quarter that ended June 30, 2020. The market expects the company’s revenue to increase 5.3% next year. EPS is expected to increase 1.6% next year and at a rate of 22.5% per annum over the next five years. The stock has gained 4.6% year-to-date to close yesterday’s trading session at $6.87. Despite having the first mover advantage in the wearables market, it faced stiff competition from the likes of Apple and Xiomi. Fortunately, FIT has received regulatory clearance in the United States and Europe for its ECG app that identifies atrial fibrillation (AFib). Plus, Google’s (GOOGL) win of EU antitrust approval for its purchase of FIT is also encouraging for investors. It’s no surprise that FIT is rated “Strong Buy” in our POWR Ratings system. It has an “A” for Trade Grade and Buy & Hold Grade, and a “B” for Peer Grade and Industry Rank. In the 33-stock Athletics & Recreation industry, it is ranked #4. Want More Great Investing Ideas? 7 Best ETFs for the NEXT Bull Market What is the Cure for Stock Market Volatility? Chart of the Day- See Christian Tharp’s Stocks Ready to Breakout ZNGA shares were trading at $9.34 per share on Friday afternoon, up $0.04 (+0.43%). Year-to-date, ZNGA has gained 52.61%, versus a 9.28% rise in the benchmark S&P 500 index during the same period."}]}