{"article": [{"url": "https://stocknews.com/news/plug-be-fcel-bldp-4-hydrogen-stocks-to-ignite-your-portfolio/", "published": 1595851700.0, "headline": "4 Hydrogen Stocks to IGNITE Your Portfolio", "body": "Hydrogen is a fuel that, when consumed in a fuel cell, produces only heat and water. This makes it a much cleaner energy source. It can be produced from various resources such as natural gas, nuclear power, biomass, and renewable power, such as solar and wind. Hydrogen fuel can be produced through natural gas reforming, electrolysis, and solar-driven and biological processes. It is an attractive fuel option for electricity generation and transportation. It can be used in homes, cars, and portable power. It is an important option as it is a highly reliable energy source, and it reduces greenhouse emissions and the demand for foreign oil. There is a growing consensus that hydrogen will provide energy in situations where solar and wind are not viable. This includes backup power and heavy transport. The European Union recently unveiled a plan to invest hundreds of billions of euros in technology that would enable it to get a considerable share of its energy from hydrogen by the year 2050. 7 Best ETFs for the NEXT Bull MarketPLUG Power (PLUG), Bloom Energy (BE), FuelCell Energy (FCEL), and Ballard Power Systems (BLDP) are four stocks to consider in this soaring industry. PLUG Power, Inc. (PLUG) PLUG develops hydrogen-fueled cell turnkey solutions to generate electric mobility and stationary power. The company pioneers in proton exchange membrane (PEM) fuel cell technologies, fuel drive/ cell hybrid technologies, and dispensing infrastructure to develop GenDrive, GenFuel, and GenCare. PLUG is one of the biggest companies in the hydrogen energy sector, providing an eco-friendly alternative fuel to the heavy transport and backup industries. It recently acquired two companies – United Hydrogen Group and Giner ELX, which would provide an unrestricted supply of hydrogen to the fuel cell maker. This acquisition is expected to take the total revenues for PLUG to $1.2 billion by 2024. With rising concerns related to climate change, the popularity of hydrogen energy is rising. PLUG is the biggest buyer of liquid hydrogen across the United States and is a major player in the emerging fuel cell electric vehicles (FCEVs) industry, which is valued at $300 billion. On July 16th, PLUG launched GenSure HP, a zero-emission stationary fuel system designed to support high power backup systems. The latest invention allows PLUG to tap into the $15 billion stationary power market. PLUG’s consensus EPS estimates indicate a 25% growth per annum over the next 5 years. PLUG hit its year-to-date low of $2.68 on March 16th due to the overall dip in the market, but has gained more than 200% since then. Out of 57 stocks in the Industrial– Equipment sector, PLUG is ranked #25. Bloom Energy Corporation (BE) BE facilitates on-site power generation through solid-oxide fuel systems by converting hydrogen or other low-pressure natural gas into electricity through an electrochemical process. BE is planning to expand its business operations in the commercial hydrogen market, through its extended partnership with SK Engineering & Construction (SK E&C). Its solid oxide electrolyzer technology has been awarded 19 patents worldwide and is one of the most popular technologies facilitating renewable hydrogen production. South Korea is one of the main markets for BE’s products at the moment. Through its partnership with SK E&C, BE plans to supply 400MV of fuel cells to South Korea by 2021, generating a $1 billion in revenues. Also, BE has entered into a deal with Samsung heavy industries to design and develop fuel cell-powered ships, making the marine shipping industry more sustainable and environmentally friendly. BE’s consensus EPS estimates indicate a 25.2% growth per year over the next 5 years. BE has gained more than 450% since hitting its year-to-date low of $3 on March 18th due to the virus-driven market crash. BE is rated “Buy’ in our POWR Ratings system, consistent with its strong business model and growth potential for the upcoming years. It has an “A” for Trade grade, and a “B” for Hold Grade, Peer Grade, and Industry Rank. It is ranked #21 out of 57 stocks in the Industrial – Equipment sector. FuelCell Energy, Inc. (FCEL) FCEL operates and services fuel cell power plants for distributed power generation, utility grid support distributed hydrogen as well as multi-megawatt applications. The US Department of Energy announced two investment programs facilitating the development and distribution of state-of-the-art fuel cell technologies over the next five years, which is good news for FCEL. The company’s $60 million carbon capture technology partnership with ExxonMobil has led to a 105% year-over-year growth in revenues. The company entered into a biofuel construction project to provide 1.4-megawatt fuel cell platforms in San Bernardino, California. Operational from December 2020, this project is expected to generate substantial revenues for the company in the near future. The EPS estimates for FCEL indicate a 15% growth annually for the next 5 years. FCEL has a “B” grade for Trade Grade and Industry Rank. It is ranked #31 out of 57 stocks in the Industrial – Equipment sector. Ballard Power Systems, Inc. (BLDP) BLDP designs, manufactures, and sells proton exchange membrane (PEM) fuel cells for heavy duty modules, backup power systems, and portable power/unmanned aerial vehicles. Headquartered in Canada, BLDP operates in the United States, China, Taiwan, and Europe. Earlier this month, BLDP received a purchase order for $7.7 million of membrane electrode assemblies (MEAs) for use in manufacturing FCvelocity-9SSL fuel cell stacks from Guangdong Synergy Ballard Hydrogen Power Co., Ltd., which led to the stock soaring to its 17-year high. The company has also received a follow-on order for 15 fuel cell modules to power buses in the United Kingdom. The popularity of fuel cell engines in commercial trucks bodes well for BLDP. Following the advanced clean truck regulation passed by California Air Resources Board, which requires every new truck to be zero-emission by 2045, BLDP expects to be a major player in this $120-billion fuel cell industry. It currently supports the operations of more than 2200 commercial cell-based trucks, mainly in China. The consensus revenue estimate for the second quarter indicates a 12.60% increase to $26.63 million. BLDP gained more than 95% after hitting its year-to-date low in the first quarter due to a global stock market crash. BLDP has a grade of “B” in Trade Grade and Industry Rank. It is ranked #22 out of 57 in the Industrial/ Equipment sector. Want More Great Investing Ideas? 9 “BUY THE DIP” Growth Stocks for 2020 Newly REVISED 2020 Stock Market Outlook 7 “Safe-Haven” Dividend Stocks for Turbulent Times PLUG shares were unchanged in after-hours trading Monday. Year-to-date, PLUG has gained 164.24%, versus a 1.46% rise in the benchmark S&P 500 index during the same period."}]}