{"article": [{"url": "https://stocknews.com/news/de-fbhs-ggg-3-stocks-to-buy-in-anticipation-of-another-stimulus-bill/", "published": 1600430900.0, "headline": "3 Stocks to Buy in Anticipation of Another Stimulus Bill", "body": "Many Americans are hoping for another $1,200 stimulus check. This has been talked about for months now, and it is finally inching closer to reality. The holdup appears to be a disagreement between Democrats and Republicans on the amount of an overall stimulus, and if there will be direct payments to individuals. Democrats just turned down a proposal from Republicans that didn’t include payments to individuals. Still, a bipartisan group of lawmakers is proposing a bill for the second round of $1,200 checks and an additional $500 per child. President Trump is in support of this bill. If the bill passes both houses of congress and the President signs it into law, there is hope for a stronger economic turnaround. As investors, we want to position our portfolios to take advantage of an economic recovery. The industrial sector has suffered from the global recession as industrial output has shrunk. When the economy contracts, activity in the sector drops due to companies postponing expansion. But when economies enter a new growth stage, industrial stocks tend to benefit. Over the past month, the Industrial Select Sector SPDR Fund (XLI) is up 2.4%, compared to the 8% loss for the Technology Select Sector SPDR Fund (XLK), so momentum has already started for the sector. Here are three stocks that should benefit as the economy begins to grow again: Deere & Company (DE), Fortune Brands Home & Security (FBHS), and Graco (GGG). 7 \"SAFE HAVEN\" Dividend Stocks for Turbulent TimesDeere & Company (DE) DE is the world’s leading manufacturer of agricultural equipment. The company is divided into two segments: agriculture and turf, and construction and forestry. DE provides a complete portfolio of agriculture equipment, including tractors, planting equipment, sprayers, harvesters, and more. The company also manufactures construction equipment. In the agricultural equipment industry, DE’s John Deere brand is one of the most recognizable and valuable brands globally. The company had a strong quarter, despite the coronavirus. Revenue came in at $2.57 per share, compared to estimates of $1.26. The operating margin for DE’s agriculture segment jumped to 16.6%. DE is positioned for growth over the long-term due to investments in new products with advanced technology. DE’s goal is to change agriculture with technology by making farming more of an automated process. DE should benefit from increasing U.S farm income, which will drive demand for agricultural equipment. The company’s work in expanding into precision bodes well, and its cost-cutting actions should further improve margins. The stock is rated a “Strong Buy” in our POWR Ratings system, with grades of “A” across the board in every POWR component. DE is also ranked #4 out of 60 stocks in the Industrial-Machinery industry. Fortune Brands Home & Security (FBHS) FBHS is a leading home and security products company that operates in four segments. The cabinets segment sells cabinets and vanities under the MasterBrand family of brands. The plumbing segment, known by the Moen brand, sells faucets, showers, and other plumbing fixtures. The doors and security segment sells entry doors under the Therma-Tru brand name, and locks and other security devices under the Master Lock and SentrySafe names. The company was spun off from its holding company Fortune Brands, Inc. in 2011. Since then, FBHS has achieved strong revenue growth and profitability. The company’s second-quarter financial results came in better than expected, as its operating margin increased to 14.3%. This was driven by cost-control measures. FBHS has also had strong cash flow, with the company generating $218 million in free cash flow for the first half of the year. The plumbing segment was the best performing segment of the quarter. The plumbing segment operating margin increased to 24.5%. This is due to a rebound in demand from China. The company should see continued growth due to strength in its plumbing and doors & security segments going forward. FBHS is rated a “Strong Buy” in our POWR Ratings system. Similar to DE, it holds grades of “A” in every POWR component, including Trade Grade, Buy & Hold Grade, Peer Grade, and Industry Rank. It is also ranked #6 in the Home Improvement & Goods industry. Graco (GGG) GGG is a manufacturer of equipment used for managing fluids, coatings, and adhesives. The company is organized into three segments: industrial, process, and contractor. The firm serves a variety of markets, including industrial, automotive, and construction. Its products include pumps, valves, meters, sprayers, and equipment used to apply coatings, sealants, and adhesives. The company differentiates itself from its peers by manufacturing specialized products that can handle difficult-to-move liquids. The company reported strong second-quarter results with both earnings and revenue outperforming analyst expectations. This was primarily due to stronger than expected performance in the contractor segment. Its cash flow from operations improved to $89 million from $54 million in the first quarter. GGG has weathered the pandemic well with a stock return of 18.6% year to date. The company has been able to keep the production lines running with a strong customer base and an efficient management team based on its return on invested capital of 21.9%. The firm is poised for long-term growth due to investments in product innovation and capacity expansion. Exposure to new markets should also aid growth. The company is rated a “Strong Buy” in our POWR Ratings system. It holds a grade of “A” in Trade Grade, Buy & Hold Grade, Peer Grade, and Industry Rank. This makes it the third stock on my list with grades of “A” across the board. It is also the #16 ranked stock in the Industrial-Machinery industry. Want More Great Investing Ideas? 7 Best ETFs for the NEXT Bull Market Stock Market Outlook: Before & After the Election Chart of the Day- See the Stocks Ready to Breakout DE shares were trading at $222.87 per share on Friday morning, up $2.93 (+1.33%). Year-to-date, DE has gained 30.02%, versus a 5.03% rise in the benchmark S&P 500 index during the same period."}]}