{"article": [{"url": "https://stocknews.com/news/eqt-swn-cnx-3-stocks-to-add-to-your-watchlist-as-natural-gas/", "published": 1598011700.0, "headline": "3 Stocks to Add to Your Watchlist as Natural Gas Rebounds", "body": "Since peaking in 2008 around $14 per bcf, natural gas has trended lower and hit an all-time low in April. However, prices look to be turning a corner. Demand for natural gas is expected to surge as the temperature drops in winter. Industrial production is also increasing which is another source of demand for natural gas. Finally, production is going to be lower in the coming months due to reduced drilling in the shale patch. EQT Corporation (EQT), CNX Resources Corporation (CNX), and Southwestern Energy Company (SWN) have already bounced back on the optimism surrounding the industry and should continue to move higher given these constructive developments. 9 \"BUY THE DIP\" Growth Stocks For 2020EQT Corporation (EQT) EQT is a natural gas company with operations focused in the cores of the Marcellus and Utica Shales in the Appalachian Basin. Since hitting its 52-week low of $4.21 in late February, EQT has returned more than 270%. EQT has reported earnings growth of 548.91% over the past twelve months, putting it ahead of 97.3% of US stocks in the Stocknews.com universe. EQT has improved its operational performance due to efficient drilling, regular application of a proven well design as well as strong schedule design. In the second quarter, horizontal drilling speeds increased 63% year-over-year, and production uptime on producing wells was over 98%. Moreover, EQT achieved an industry first 24-hour drilling record of 10,566 feet which is more than 2 miles in a day. The company achieved well costs of $680 per foot in the Pennsylvania Marcellus beating the target well cost by $50 per foot and also reduced total debt by $417 million. How does EQT stack up for the POWR Ratings? A for Trade Grade A for Peer Grade B for Buy & Hold Grade B for Overall POWR Rating The stock is also ranked #6 out of 97 stocks in the Energy-Oil & Gas industry. CNX Resources Corporation (CNX) CNX is involved in natural gas exploration, development, and production, with operations centered in the major shale formations of the Appalachian basin. The stock has grown by more than 120% since its March lows. Nicholas J. DeIuliis, president and CEO of CNX said, “There are three main tenets that underlay our plan. First, we generate free cash flow on a day in, and day out basis. Our programmatic hedging helps drive our free cash flow generation and will continue to be a key tactic in the future.” He further said, “Second, we take the organic free cash flow that we generate and roll in a very modest amount of assets sales, which produce our cumulative free cash flow. Over our 7-year plan, we expect to generate over $3 billion of cumulative free cash flow, which leads to the third and last tenet: allocate that free cash flow into the right places at the right times.” In the second quarter, CNX’s production costs were lower as compared to the previous year as a result of improvements in LOE, transportation, gathering and compression, taxes, and DD&A. CNX has an impressive earnings surprise history with the company surpassing consensus EPS estimates in each of the trailing four quarters. CNX’s EPS is expected to grow 35.7% per annum in the next five years. CNX has returned 47.2% over the past year and 67.7% over the past six months. CNX’s POWR Ratings reflect this promising outlook. It has an overall rating of “Buy” with an “A” for Trade Grade and Peer Grade. Among the 9 stocks in the Coal industry, it’s ranked #1. Southwestern Energy Company (SWN) SWN is an independent energy company that is focused on natural gas, natural gas liquids, and oil exploration, development, production, and marketing. The stock has gained more than 100% since its March lows. SWN agreed to acquire Montage resources in an all-stock transaction which will make the company the third-largest producer in Appalachia as well as enhance economic inventory and free cash flow. The company achieved a record single-well cost of $505 per lateral foot and expects to achieve an average of $650 per foot in the second half of the year. SWN’s cost reductions and operational progress will help in sustaining the company’s long-term value. The analyst’s average price target of $3.30 is 24.1% higher than its last closing price. SWN has an impressive earnings surprise history with the company surpassing consensus EPS estimates in each of the trailing four quarters. SWN has an “A” in Peer Grade according to our POWR Ratings System. The stock ranks #15 out of 97 stocks in the Energy-Oil & Gas industry. Want More Great Investing Ideas? The Best of StockNews 2 Step Process to Sell @ Market Top in September 9 “BUY THE DIP” Growth Stocks for 2020 EQT shares were trading at $16.06 per share on Friday afternoon, up $0.20 (+1.26%). Year-to-date, EQT has gained 48.18%, versus a 6.58% rise in the benchmark S&P 500 index during the same period."}]}