{"article": [{"url": "https://stocknews.com/news/vz-ibm-mmm-td-cmp-5-safe-stocks-that-pay-high-yield-dividends/", "published": 1598530100.0, "headline": "5 'Safe Stocks' that Pay High-Yield Dividends", "body": "While the stock markets are hitting all-time highs, there is still a great deal of risk given the economy’s fragility. Although there’s a fewer number of bargains in the market given the recent rally, many dividend-paying stocks remain attractive especially with the drop in interest rates. While most dividend-paying stocks are considered safe, there’s always the risk that companies are forced to cut dividends. One way to avoid this is by looking at stocks that have a low payout ratio and a strong balance sheet. Verizon Communications Inc. (VZ), International Business Machines Corporation (IBM), 3M Company (MMM), Toronto Dominion Bank (TD) and Compass Minerals International, Inc. (CMP) are five such fundamentally sound stocks that could be a steady source of income for you. 7 Best ETFs for the NEXT Bull MarketVerizon Communications Inc. (VZ) VZ provides communications, information and entertainment products and services to consumers, businesses, and governmental agencies. Its segments include Wireless and Wireline. The stock has been uniformly paying dividends every quarter since becoming a public company in 1983. During the past 10 years, the average dividends per share growth rate for VZ was 3.4% per year. The company has also been consistently increasing its dividend payout amount after its third-quarter each year. The most recent dividend declared by VZ was $0.615 for its second quarter ended June. VZ pays an annual dividend of $2.46 which yields 4.14%. The company has issued more total dividends over the past six years than 98.21% of other US stocks currently paying dividends in the StockNews.com universe. VZ generated a free cash flow of $10.2 billion in its last reported quarter, registering a 100.8% growth from its comparable quarter last year. The company also generated $14.7 billion in cash flow from operating activities during the quarter, accounting for a 68% rise year-over-year. EPS for the quarter came in at $1.18, beating the consensus estimate by 2.6%. This also indicates a year-over-year increase of 19%. Moreover, EPS is expected to grow by 3.4% next year. The stock closed yesterday’s trading session at $59.46. It has already recovered more than 21% from its March low. How does VZ stack up for the POWR Ratings? A for Trade Grade A for Buy & Hold Grade A for Peer Grade A for Industry Rank A for Overall POWR Rating. You can’t ask for better. It is ranked #1 out of 24 stocks in the Telecom – Domestic industry. (VZ is one of the stocks currently in Steve Reitmeister’s Total Return portfolio. Learn more here.) International Business Machines Corporation (IBM) IBM operates as an integrated solutions company that provides information technology (IT) products and services worldwide. Its Cloud & Cognitive Software segment offers software for vertical and domain-specific solutions in health, financial services, and Internet of Things (IoT), and other services application areas. The stock has been consistently paying dividends each quarter for the last six decades. Over the last five years, dividend payout for IBM grew at a CAGR of 8.3%. The most recent dividend declared by the company was $1.63 for the last reported quarter, which amounts to an annual dividend of $6.52. While the four-year average dividend yield for IBM is 4.5%, the current annual dividend translates to a 5.2% yield. IBM generated a free cash flow of $2.9 billion in the second quarter, a 14.7% increase year-over-year. It also reported a free cash flow margin of 16%. Operating cash flow for the quarter stood $3.6 billion. Furthermore, IBM’s average cash flow over the past 5.75 years is greater than 96.46% of current dividend-paying stocks in the StockNews.com universe. Despite the top-line declining 2% year-over-year in constant currency to $18.1 billion, the total cloud revenue was up 34% to $6.3 billion. The gross profit margin for the quarter stood 48%. EPS for the quarter came in at $2.18, delivering an earning’s surprise of 5.3%. Moreover, IBM has beaten EPS estimates in each of the trailing four quarters. IBM is currently trading at $124.17, 22% below its 52-week high of $158.75. Additionally, the stock has gained more than 37% from its March lows. It’s no surprise that IBM is rated “Buy” in our POWR Ratings system. It also has an “A” for Industry Rank and a “B” in Trade Grade and Peer Grade. It is ranked #8 out of 28 stocks in the Technology – Hardware industry. 3M Company (MMM) 3M manufactures products related to electronics, telecommunications, industrial, consumer and office, health care, safety, and other markets. It operates through four business segments: Safety and Industrial, Transportation and Electronics, Health Care, and Consumer. The stock has been consistently paying dividends every quarter since becoming a public company in 1983. During the past 10 years, the average dividends per share growth rate for MMM was 10.9% per year. The company has also been constantly increasing its dividend payout amount during the first quarter each year. The most recent dividend declared by 3M was $1.47 for its third-quarter ending in September. MMM pays an annual dividend of $5.88 which yields 3.61%. Over the past six years, the company has issued more dividends than 96.29% of other dividend-issuing US stocks in the StockNews.com universe. Free cash flow for the firm increased 23.5% year-over-year to $1.5 billion in the last reported quarter. The company also generated $1.9 billion in cash flow from operations, a 14% improvement year-over-year. EPS for the quarter came in at $1.78, increasing 15% year-over-year. Moreover, EPS is expected to grow by 9.6% next year. The stock closed yesterday’s trading session at $163.9, gaining more than 10% in the last six months. Additionally, MMM is trading at a 10.2% discount to its all-time high of $182.55. MMM’s strong momentum is reflected in its POWR Ratings, it has a “Buy” rating with an “A” in Trade Grade and Industry Rank, and a “B” in Buy & Hold Grade and Peer Grade. Within the Industrial – Machinery, it’s ranked #21 out of 59 stocks. Toronto Dominion Bank (TD) TD provides across-the-board commercial and retail banking services and products, along with wealth management services. The company operates through Canadian Retail, U.S. Retail, and Wholesale Banking segments. The stock has been consistently paying dividends each quarter since 1996. Over the last three years, dividend payout for TD grew at a CAGR of 10.3%. The most recent dividend declared by the company was $0.585 for the last reported quarter, raising the payout by 3.5%. While the four-year average dividend yield for TD is 3.86%, the current annual dividend of $2.33 translates to a 4.76% yield. TD’s second quarter ended April was extensively affected by the pandemic. As a result, the company reported a negative free cash flow per share of $12.6. Net interest income remained relatively the same compared to the year-ago quarter. Average loan volumes increased $20 billion, or 5%, reflecting 4% growth in personal loans and 9% growth in business loans. Average deposit volumes increased $33 billion, or 10%, reflecting 8% growth in personal deposits, 10% growth in business deposits, and 22% growth in wealth deposits. The street awaits the company’s third-quarter financial report to be announced later this month. The stock has lost more than 10% year-to-date due to the weakness in the financial sector. TD closed yesterday’s trading session at $50.46, 13.8% below its all-time high of $58.51. TD is rated “Buy” in our POWR Ratings system. It is rated an “A” in Trade Grade and Peer Grade, and a “B” in Buy & Hold Grade. TD is ranked #2 out of 44 stocks in the Foreign Banks industry. Compass Minerals International, Inc. (CMP) CMP produces and markets salt, sulfate of potash specialty fertilizer (SOP), plant micronutrients, and magnesium chloride primarily in North America and the United Kingdom. It operates through three segments — Salt, Plant Nutrition North America, and Plant Nutrition South America. The stock has been consistently paying dividends each quarter since 2004. During the past 10 years, the average dividends per share growth rate for CMP was 7.3% per year. The most recent dividend declared by the company was $0.72 for the last reported quarter, cumulating to an annual dividend of $2.88. While the four-year average dividend yield for CMP is 4.98%, the current annual dividend translates to a 5.02% yield. CMP generated $5.3 million in cash from operating activities in the second quarter. The top-line grew 4.5% year-over-year to $256 million while the operating margins stood 10%. EPS for the quarter came in $0.04, delivering an earning’s surprise of 122.2%. Additionally, EPS is estimated to grow 51% in the current year. The stock closed yesterday’s trading session at $57.75, gaining more than 14.5% in the last three months. Moreover, CMP is trading at a 12.7% discount to its all-time high of $66.14. CMP’s POWR Ratings reflect a promising outlook. It has an overall rating of “Buy” with an “A” for Trade Grade, and a “B” for Peer Grade, Buy & Hold Grade and Industry Rank. Among the 33 stocks in the Industrial – Metals industry, it’s ranked #11. Want More Great Investing Ideas? 7 Best ETFs for the NEXT Bull Market Why Stocks Could Drop 20% in September? 9 “BUY THE DIP” Growth Stocks for 2020 VZ shares were unchanged in after-hours trading Thursday. Year-to-date, VZ has declined -0.04%, versus a 9.34% rise in the benchmark S&P 500 index during the same period."}]}