{"article": [{"url": "https://stocknews.com/news/ldos-afg-alk-mog-a-4-downgraded-stocks-to-avoid/", "published": 1593691700.0, "headline": "4 Downgraded Stocks to Avoid", "body": "We update our exclusive POWR Ratings on a daily basis to provide investors with quality investment insight. POWR Ratings is a proprietary rating system that is based on 4 different components of a stock’s attractiveness. This sums up to a final POWR Rating that clearly tells you a stocks future potential. Here are four stocks that were recently downgraded in the POWR Ratings: Leidos Holdings (LDOS), American Financial Group (AFG), Alaska Air Group (ALK) and Moog (MOG.A). Leidos Holdings (LDOS) 7 Best ETFs for the NEXT Bull MarketOne would think a cybersecurity, IT modernization, and data analytics business would be in prime position to benefit from the current digital transition. However, LDOS is losing ground to the competition. LDOS traded at $125 prior to the pandemic and is now priced around $95 per share. LDOS’ POWR Ratings are quite ugly: a “F” Trade Grade, a “D” Peer Grade and a ranking of 8 out of 14 stocks in the Outsourcing – Tech Services category. LDOS had a horrid -16% price return in ’18 and a -3% price return year to date. American Financial Group (AFG) This is a challenging time to be an investor in a holding company that provides insurance through its subsidiaries. Though there are some attractive stocks in the financial industry, AFG is not one of them. The POWR Ratings have AFG listed as a Strong Sell primarily because of its terrible Trade Grade and Buy & Hold Grade. The stock also has a “D” for it’s Peer and Industry Grades. All in all, AFG is ranked 39 of 58 stocks in the Insurance – Property & Casualty category. Check out AFG’s price returns and you will be taken aback by the influx of red: -43% year to date, -4% in the past three months, -44% across the past six months, -40% in the past year and -32% in the past three years. AFG earnings estimates have been revised to lower figures twice in recent months. Alaska Air Group (ALK) 2020 has been tough for airline investors. ALK provides air service to 100+ destinations across North America and the United States has extremely high coronavirus numbers. So ALK’s business is likely to be quite sluggish for the foreseeable future. Check out ALK’s POWR Ratings and you will find “F’s” and “D’s” across the board and a “C” Peer Grade. The price returns are even uglier with a sea of red. The company’s one-year price return is -41%. ALK has a -45% price return year to date. Furthermore, ALK’s price return has been negative for two of the past three years. Though ALK bumped up to $50.24 after the coronavirus dip, the stock has hovered around the $35 mark since. Moog (MOG.A) MOG.A is a motion control products designer and manufacturer that was doing quite well at the beginning of 2020. However, after the coronavirus spread throughout the world, MOG.A plummeted and is currently trading at about 45% below 52-week highs. In the POWR Ratings, MOG.A has a “F” Trade Grade and a “F” Buy & Hold Grade, along with a ranking of 44 of 65 stocks in the Air/Defense Services category. MOG.A price returns are in the red across the past three years but for 2019 when it hit +11.41%. Want More Great Investing Ideas? 9 “BUY THE DIP” Growth Stocks for 2020 Is the Bull S#*t Rally FINALLY Over? 7 “Safe-Haven” Dividend Stocks for Turbulent Times Top 3 Investing Strategies for 2020 LDOS shares . Year-to-date, LDOS has declined -3.63%, versus a -1.99% rise in the benchmark S&P 500 index during the same period."}]}