{"article": [{"url": "https://stocknews.com/news/spy-dia-qqq-the-most-important-news-investors-need-to-watch-over-the/", "published": 1596197300.0, "headline": "The Most Important News Investors Need to Watch Over the Next 2 Weeks: Part 2", "body": "In part 1 of this series, I explained why the stock market rally was looking more and more like a dangerous and completely irrational bubble. (Source: Jeff Miller) 9 \"BUY THE DIP\" Growth Stocks For 2020 (Source: Ycharts) The S&P 500, Dow Jones Industrial Average, and Tech-focused Nasdaq, have seen remarkable gains since March’s lows predicated on the assumption that the pandemic would quickly be placed in the rearview mirror, or at least its most severe economic effects would. That article walked readers through the saddening objective reality of an economy that is shattered at the microlevel, meaning households and small businesses are facing their worst fundamental conditions since the Great Depression. Well, things might get a lot worse before they get better, because of the most important economic news in months, that’s coming in the next two weeks. Congress Could Decide How Strong This Recovery Will Be By August 7th…And The Preliminary News Isn’t Promising Right now Congress is debating the so-called “phase 4 stimulus” bill and the risks to the microeconomic fundamentals of tens of millions are incredibly high. Within the trillion-dollar package, there are certain things that have a timeframe that is a bigger priority, so we could look at doing an entire deal, we could look at doing parts,” Mnuchin said… He also suggested that some thornier issues could be kicked down the road to a Phase 5 or 6 bill.” – Fox Business (FOXA) According to Treasury Secretary Mnuchin, the new supplemental weekly amount will be designed to replace 70% of pre-recession income. We’re not going to pay people more money to stay at home than work, but we want to make sure that the people out there that can’t find jobs do get a reasonable wage replacement,” he told CNBC. “So it will be based on approximately 70% wage replacement.” That would equate to about $200 a week, said Ernie Tedeschi, an economist at Evercore ISI.” – CNN The CARES act passed in March, provided $600 per week in supplemental unemployment income, on top of what states were already providing. The preliminary reports out of the White House and Senate are that this could drop by 66% to $200 per week. This amounts to $1600 per month in reduced income for 25 million Americans who were recently collecting those direct cash transfers. This is just the biggest fiscal cliff that Oxford Economics says is a major risk to the US recovery. And Oxford is hardly the only one sounding the warnings. Here’s what the JPMorgan Institute (JPM), a think tank run by the 4th largest asset manager on earth and America’s largest bank, has to say about the topic. About one in five U.S. workers received unemployment insurance benefits in June 2020, which is five times greater than the highest UI recipiency rate previously recorded. Yet little is known about how unemployment benefits are affecting the economy today. To fill this gap, we study the consumption of benefit recipients during the pandemic. In normal times, spending among unemployment benefit recipients falls by about seven percent in response to unemployment because typical benefits replace only a fraction of lost earnings. However, in March 2020, the Coronavirus Aid, Relief, and Economic Security (CARES) Act added a $600 weekly supplement to state unemployment benefits, replacing lost earnings by more than 100 percent for two-thirds of unemployed workers eligible, by some estimates. As a result, for benefit spells that begin after workers receive this supplement, we find dramatically different spending patterns for the unemployed compared to normal times. Although average spending fell for all households as the economy shut down at the start of the pandemic, we find that unemployed households actually increased their spending beyond pre-unemployment levels once they began receiving benefits. The fact that spending by benefit recipients rose during the pandemic instead of falling, like in normal times, suggests that the $600 supplement has helped households to smooth consumption and stabilized aggregate demand. We also examine the spending patterns of the unemployed while waiting for benefits to arrive. Households that receive benefits soon after job loss show no relative decline in spending, while households that wait two months to receive benefits due to processing delays have large spending declines. Compared to the employed, spending falls by 20 percent prior to receiving benefits. This suggests that delays have imposed substantial hardship on benefit recipients. The $600 supplement to unemployment insurance benefits is scheduled to expire at the end of July. Our estimates suggest that expiration will result in large spending cuts, with potentially negative effects on both households and macroeconomic activity. The estimates also provide a guide to projecting the economic consequences of alternative supplement levels. Finally, our results also underscore the importance of making unemployment benefits broadly available and bolstering states’ ability to process claims promptly.” – JPMorgan Institute Strategas Research estimates the $70 billion per month in supplemental unemployment is fueling an additional 2% in GDP growth this year and supporting nearly 3 million jobs. The Bureau of Economic Analysis estimates that if the supplemental unemployment were cut off completely 5.1 million additional job losses could occur by 2021. Moody’s (MCO) Analytics is forecasting a drop to $300 per week in supplemental claims via a $1.6 trillion stimulus bill and even that is expected to result in 270K additional job losses in Q3 alone. Here is what former U.S. International Trade Commission Chief Economist Peter Morici recently told Fox Business (FOXA). This crisis is lasting much longer than we anticipated when the first stimulus was passed in March and most of the benefits are running out… “Unemployment benefits are essential…We have at least 15 million people that don’t have many prospects of working in the next few weeks and to say that they’re not working because they’re getting the benefits is silly… “It would really be nice if they weren’t interrupted…They don’t have to be at $600 a month. They can be at the level of which they were before, that would be fine… “There are an awful lot of places right now where businesses simply can’t reopen…There are also other places where the viruses are such that even if you don’t have lockdowns, the foot traffic is not there… “We have tracking data in this crisis that we didn’t have in the financial crisis…“Are people making reservations through these apps? We also have weekly tracking data on hiring, which we didn’t have in past crises and they all show in the last few weeks the economy turning down… “The reality is aid is needed, it’s time to compromise to get it done.” – Fox Business Good News And Bad News In The Stimulus Proposals The good news is that by the time Congress leaves for its August recess on August 7th, a stimulus bill is almost certain to pass. No less than Senate Majority leader Mitch McConnell has said as much and he also made clear that another $1,200 stimulus check was likely coming to everyone who got one last time. The last stimulus check took about three weeks for most people to get the money, though millions are still waiting. This time it’s hoped that the money will arrive faster, potentially by the end of August, or at least early September. But according to a March Bankrate survey of nearly 1000 Americans, 55% of Americans spent all of the stimulus (on essentials like utilities, rent, and food) within a month or less. Moody’s Analytics says that this next stimulus bill is likely to impact consumer spending not just in 2020, but all the way through 2023. The good news is that $1200 stimulus checks plus some kind of supplemental unemployment payments, which are rumored to last through the end of 2021, will provide much-needed help to tens of millions of suffering families. Economically speaking, JPMorgan, Moody’s the Bureau of Economic Analysis, the Economic Policy Institute, and virtually all economists think that this stimulus will keep many small businesses and families afloat…for awhile. In May personal incomes actually went up, entirely due to government transfers. Those are set to continue but at a smaller level. In other words, for 25 million Americans currently collecting supplemental unemployment, their incomes are set to decrease, potentially by $1,600 per month ($3,200 per household if a married couple is totally unemployed). Unless we get another $1,200 stimulus check (which might be coming in phase 5 or 6 according to Treasury Secretary Mnuchin) a decrease in supplemental emergency income could have lasting negative effects on the US economy. (Source: US Census Bureau) At the end of June, 60% of small businesses told the US Census Bureau that they had 3 months or less worth of cash on hand, and that was partially due to the PPP loans that have been keeping millions of businesses from going under. According to JPMorgan, Moody’s, and other economists and analysts, decreased stimulus, in an economy that continues to be ravaged by the coronavirus, could lead to cascading business failures, and layoffs at businesses of all sizes. New Infections Not Expected To Surge To New Records…But Not Expected To Decline Significantly Either (Source: IHME) While cases are expected to taper off soon, they are not expected to decline significantly either, according to the IHME. A vaccine is not going to be ready in large amounts until the second half of 2020 according to Merck and most healthcare experts. States won’t be able to reopen fully (or at least phase 3) this year and possibly not until 2022. This means that it will likely take a lot more stimulus to minimize the risk of a double-dip recession. What does this mean for our portfolios? That a correction, which was inevitable at some point, is likely coming sooner rather than later. The Best… And Worst Thing Retirees Can Do Ahead Of A Big Market Decline In this article, I explain in detail the smartest and most dangerous ways of protecting your nest egg from painful market downturns. Just like the one that could occur over a few months if Economic data continues to weaken Corporate earnings expectations start to decline (such as over higher 2021 corporate tax risk) The outlook for the pandemic worsens (some experts say it might now last into 2023) I’m not trying to scare anyone out of owning stocks within a diversified and prudently risk-managed portfolio. I remain 100% invested myself and have no plans to try to market time my way to avoiding the coming correction (whenever it finally arrives, and for whatever reason). My goal is to point out the reality of the risks our economy and battered households/small businesses are facing so that you can be prepared for what might be coming next. As the Latin proverb says, “Praemonitus, praemunitus”, or “forewarned, forearmed”. (Source: AZ quotes) Right now prudent long-term investors, such as 1600 Dividend Kings members, are safely hunkered down in bunker sleep well at night retirement portfolios. We have the right asset allocation in cash, bonds, and strong blue-chip dividend stocks, whose payouts are likely safe, even in the worst recession in 75 years. We have nothing to fear from the massive economic uncertainty swirling around us, that’s not likely to dissipate for a few years at least. Everyone else though? Such as speculators and market timing gamblers who have relied on the craziest bubble in US market history to score quick gains in recent months? Well, trees don’t grow to the sky, and stocks can’t ignore bad fundamentals forever. Want More Great Investing Ideas? 9 “BUY THE DIP” Growth Stocks for 2020 Top 5 WINNING Stock Chart Patterns 7 “Safe-Haven” Dividend Stocks for Turbulent Times SPY shares were trading at $323.96 per share on Wednesday afternoon, up $2.79 (+0.87%). Year-to-date, SPY has gained 1.69%, versus a % rise in the benchmark S&P 500 index during the same period."}]}