{"article": [{"url": "https://stocknews.com/news/amzn-baba-jd-meli-4-growth-stocks-rated-a-strong-buy/", "published": 1598011700.0, "headline": "4 Growth Stocks Rated a “Strong Buy”", "body": "While the US economy is expected to shrink 6.5% this year (the worst decline since 1946), the S&P 500 index is hitting all-time highs. The stock market appears disconnected from the economy, so investors can’t rely on just market momentum alone. Growth stocks have helped the market hit record highs. Some will fall out of favor when the market turns, while others will hang on due to the underlying strength of their businesses. So picking the best growth stocks for your portfolio is important to survive a market correction in the near to mid-term. The SPDR Portfolio S&P 500 Growth ETF (SPYG), which is a benchmark for the performance of large-cap growth stocks, has risen by 20.3% this year, compared to its value counterpart, the SPDR Portfolio S&P 500 Value ETF’s (SPYV), which has lost -12.2%. Stocks such as Amazon.com, Inc. (AMZN), Alibaba Group Holding Ltd. (BABA), JD.com, Inc. (JD), and MercadoLibre, Inc (MELI) could be smart choices for growth investors nervous about a correction. 7 Best ETFs for the NEXT Bull MarketAmazon.com, Inc. (AMZN) AMZN is a global leader in the e-commerce space by a significant margin, and is well-positioned to benefit from the increasing adoption of online shopping. As of April 21st, e-commerce has recorded a 129% year-over-year growth in the US and Canada alone. AMZN also stands to capitalize on the expansion in the size of the cloud computing market thanks to its Amazon Web Services offering. Due to these factors, it is estimated that AMZN will witness sales growth of 31.2% in the current year, and an improvement of 17.9% in 2021. EPS is expected to grow 37.5% this year and 39.9% next year. AMZN’s stock has also been performing quite well so far, and has added close to 95% to its stock price since this year’s low of 1,626 in March. How does AMZN stack up for the POWR Ratings? A for Trade Grade A for Buy & Hold Grade A for Peer Grade A for Industry Rank A for Overall POWR Rating You can’t ask for better. The stock is also ranked #1 out of 54 stocks in the Internet industry. Alibaba Group Holding Ltd. (BABA) Despite certain fundamental differences, BABA is referred to as the “Amazon of China” and the company stands to benefit from the same macroeconomic factors. The company delivered strong performance in terms of sales, which rose 34%, and operating income, which rose by 42%, year-over-year. The company’s e-commerce division saw an expansion of 21% while its cloud computing services expanded by 59%. It is estimated that the company’s overall revenue will rise by 32.2% this year and 26% next year. EPS for the stock is expected to grow by 15.9% this year and 28.2% next year. The company has more than recovered from the virus-driven market crash, and has risen in value by close to 42% from its low in March. BABA’s strong fundamentals are reflected in its POWR Ratings It is rated a Strong Buy with grades of A in Trade Grade, Buy & Hold Grade, and Peer Grade. Within the China industry, it’s ranked #1 out of 115 stocks. BABA is one of the stocks currently in the Steve Reitmeister’s Total Return portfolio. Learn more here. JD.com, Inc (JD) JD is another e-commerce giant on our list that has strong potential in the near-term and long-term. This China-based company primarily focuses on electronics and home appliances, but also offers general merchandise. The company is looking to expand operations and enter into several sectors such as healthcare through JD Health, and cloud computing through JD Cloud. The JD Health service alone saw an increase in consultations by 400% in the first half of the year. The number of active customers on JD’s platform rose almost 30% year-over-year. JD’s revenue is expected to grow by 27.7% this year and by 20.9% in 2021. The EPS for the stock is estimated to grow by 43.7% for this year along with a growth of 45.9% next year. JD’s recent price performance reflects its ability to capitalize on the recent trend to go digital. The stock has gained more than 86% since hitting its year-to-date low in mid-March. It’s no surprise that JD is rated a Strong Buy in our POWR Ratings system. It also has a grade of A for Trade Grade, Buy & Hold Grade, and Peer Grade. In the 115-stock China industry, it is ranked #2. MercadoLibre, Inc. (MELI) MELI operates online shopping portals in Latin America. It offers both fixed-price purchase as well as auction-based purchase options. The company has expanded into finance and digital payments through Mercado Pago, which creates synergies within its core e-commerce business. The company has benefited from the quicker adoption of e-commerce caused by the spread of the coronavirus and also sees high growth potential in the Latin American market, which is still largely untapped. For the quarter ending June 2020, the company saw its active users grow by 45.2%. The commerce revenues of the company also grew by 79.5% year-over-year. It is estimated that MELI’s revenue will grow by 51.9% this year and 33.9% next year. MELI’s EPS is expected to grow by 43.7% this year and 45.9% next year. The company has also witnessed strong price momentum as its stock price has risen by almost 160% since its mid-March lows. MELI’s strong fundamentals are reflected in its POWR Ratings. It is rated a Strong Buy with grades of A in Trade Grade, Buy & Hold Grade, and Industry Rank. Within the Internet industry, it’s ranked #5 out of 54 stocks. Want More Great Investing Ideas? The Best of StockNews 2 Step Process to Sell @ Market Top in September 9 “BUY THE DIP” Growth Stocks for 2020 AMZN shares were trading at $3,281.48 per share on Friday afternoon, down $15.89 (-0.48%). Year-to-date, AMZN has gained 77.58%, versus a 6.35% rise in the benchmark S&P 500 index during the same period."}]}