{"article": [{"url": "https://stocknews.com/news/pool-jout-bc-yeti-4-leisure-stocks-surging-even-during-the-pandemic/", "published": 1595506100.0, "headline": "4 Leisure Stocks Surging Even During the Pandemic", "body": "When the coronavirus pandemic hit, leisure stocks plummeted due to the expectation that people would stop traveling, visiting amusement parks, and going to the movies. As things began to reopen, leisure stocks rebounded. The Invesco Dynamic Leisure and Entertainment ETF (PEJ) is up 20% over the last three months, compared with the SPDR 500’s (SPY) 15% gain. While many investors were right to be concerned with the growth prospects of many leisure stocks during the pandemic, a segment of the leisure sector has performed well. These stocks are part of solitary leisure, meaning you can enjoy yourself without taking part in traditional entertainment. For example, there are now more people adding pools in their backyards or going on boats than before the pandemic. 7 Best ETFs for the NEXT Bull MarketHere are four leisure stocks that are seeing gains during the pandemic: Pool Corporation (POOL) POOL is the world’s largest wholesale distributor of swimming pool supplies and equipment. The ongoing healthcare crisis did not affect POOL’s business in the second quarter. POOL’s net revenues rose 14% year-over-year to $1.28 billion in the quarter. This increase can be attributed to higher demand for residential pool usage as families spend more time at home. POOL’s quarterly gross profit also increased 13% to a record $373.50 million. POOL’s president and CEO said, “The second quarter of 2020 presented a unique opportunity for our business as families continued to search for safe, at-home leisure activities, which drove earlier pool openings and increased demand for a variety of products.” As industry demand is expected to remain healthy, POOL’s dominance in construction and remodeling should help it thrive in the upcoming quarters. After releasing earnings this morning for the second quartet, POOL has surpassed market estimates in each of the trailing five quarters, which is impressive. POOL gained approximately 81% in value after hitting its 52-week low of $160.35 on March 23rd. How does POOL stack up on our POWR Ratings? A for Trade Grade A for Buy & Hold Grade A for Peer Grade B for Industry Rank A for Overall POWR Rating You can’t ask for better. POOL is also ranked #2 out of 32 stocks in the Athletics and Recreation industry. YETI Holdings, Inc. (YETI) YETI is one of the biggest retail producers and distributors of outdoor recreation products in the United States, Canada, Japan, and Australia. It also provides accessories for storage and transport, facilitating outdoor living. YETI witnessed a 12% year-over-year increase in its net sales in the first quarter to $174.4 million. Gross profit increased 21% due to cost reduction, a favorable shift in channel mix, higher sales, and lower inventory reserves. However, as the spread of the virus began during mid-March, sales fell by over 25% in the last two weeks of the first quarter.Yes YETI’s supply chain services remained operational even during the complete lockdown period. As YETI is bearing the brunt of the lockdown, the consensus EPS estimate for the second quarter indicates a 54.5% year-over-year decline. However, YETI managed to surpass market estimates in each of the trailing four quarters. YETI’s shares hit its 52-week low of $15.28 on March 23rd, but have gained around 206% since then. YETI is rated “Strong Buy” in our POWR Ratings system, consistent with its robust recovery amid the pandemic crisis. It is ranked “A” in Trade Grade, Buy & Hold Grade, Peer Grade and Industry Rank. Out of 33 stocks in the Consumer Goods industry, YETI is ranked #7. Brunswick Corporation (BC) BC is globally known for its recreational marine products. The company is involved in designing, manufacturing, and supplying marine engines, boats, and various parts and accessories of marine electronics and control integration systems. BC managed to retain most of its business despite the start of the unprecedented global crisis in the first quarter. Though revenues generated by its propulsion segment declined by 0.8% year over year, operating profits increased 2.3%. As the demand for marine electronics has plunged, BC’s performance in the upcoming quarterly report is uncertain. In this regard, CEO David Foulkes said, “The strategic portfolio actions and cost reduction efforts executed in the last two years, together with our strong pipeline of new products and successful execution of our capital strategy, position us well to navigate the near-term economic conditions and resume our growth trajectory as we exit the COVID-19 economic environment.” The consensus EPS estimate of $0.45 for the second quarter indicates a year-over-year decline of 69%. However, BC managed to surpass market estimates in each of the trailing four quarters. BC has gained 62% since hitting its 52-week low on March 23rd, reflecting investors’ confidence in its business model. BC is rated a “Strong Buy” in our POWR Ratings system, with an “A” in Trade Grade, Buy & Hold Grade and Peer Grade, and “B” in Industry Rank. It is ranked #3 out of 32 stocks in the Athletics and Recreation Industry. Johnson Outdoors Inc. (JOUT) JOUT is a multipurpose company manufacturing adventure sports equipment as well as military purpose tents. It has several subsidiaries focused on supplying goods required for fishing, diving, adventure water sports, and more. The operating profit for the second quarter increased 14% year over year to $31.8 million. Its profit margin also increased from 44.5% to 46.1% due to a stronger pricing regime. The consensus EPS estimate of $1.6 indicates a year-over-year decline for the fiscal third quarter. However, JOUT beat the consensus estimates for the last three out of four quarters. JOUT hit its year-to-date low of $49.38 in March due to the virus-driven market crash but managed to recover more than 77% since then. In fact, the strong momentum helped JUOT hit its 52-week high on July 17th at $94.90. JOUT is rated a “Strong Buy” in our POWR Ratings system, consistent with its sound financials, allowing it to sustain itself through the current economic slump. It is graded a “A” in Trade Grade and Buy & Hold Grade, and a “B” in Industry Rank. Out of the 32 stocks in the Athletics & Recreation industry, JOUT is ranked #7. Want More Great Investing Ideas? 9 “BUY THE DIP” Growth Stocks for 2020 Newly REVISED 2020 Stock Market Outlook 7 “Safe-Haven” Dividend Stocks for Turbulent Times POOL shares fell $0.57 (-0.19%) in after-hours trading Thursday. Year-to-date, POOL has gained 42.27%, versus a 1.38% rise in the benchmark S&P 500 index during the same period."}]}