{"article": [{"url": "https://stocknews.com/news/mdc-trtn-ftai-3-absurdly-cheap-dividend-stocks-to-buy-in-october/", "published": 1602158900.0, "headline": "3 Absurdly Cheap Dividend Stocks to Buy in October", "body": "The year 2020 will be remembered for several reasons: the outbreak of a global pandemic, economic recession, skyrocketing stock market, and a wild election cycle. After the record-setting rally of the stock market after the March bottom, September witnessed a tech-led sell-off with investors’ concerned over stalled fiscal stimulus talks, the upcoming election, and rising coronavirus case counts. With concerns over these issues still remaining in place, the market is expected to remain extremely volatile this month. In such uncertain times, relying solely on capital appreciation for returns can prove risky. Moreover, given the low-interest rates, this is perhaps the right time to invest in a few dividend-paying stocks that are trading at cheap valuations to enjoy a stable income stream and with major upside. M.D.C Holdings, Inc. (MDC), Fortress Transportation and Infrastructure Investors LLC (FTAI), and Triton International Ltd. (TRTN) are cheap stocks that offer a reasonable dividend yield and have decent potential for appreciation. 7 \"SAFE HAVEN\" Dividend Stocks for Turbulent TimesM.D.C. Holdings, Inc. (MDC) Operating under the name Richmond American Homes, MDC’s homebuilding subsidiaries have built more than 210,000 homes since 1977. Among the nation’s largest homebuilders, MDC’s subsidiaries have operations in Arizona, California, Colorado, Florida, Maryland, Nevada, Oregon, Utah, Virginia, and Washington. MDC’s subsidiaries also offer mortgage lending, plus insurance and title services. The stock has gained 29.7% year-to-date. MDC’s revenues increased 22% year-over-year to $919.7 million in the second quarter ended June 2020. Home sale revenues increased 21% to $886.8 million and financial services revenues rose 77.3% to $33 million. EPS for the second quarter increased by 52.3% year-over-year to $1.31 and surpassed the consensus estimate by whooping 57.8%. During the quarter, the company delivered 1,900 homes, registering a 25% growth year-over-year. The market expects MDC’s revenue to increase by 25% in the current quarter and 17% in the current financial year. The company’s EPS is expected to increase 54.4% in the current quarter, 28.2% in the current fiscal year, and at a rate of 14.4% in the next five years. The company has been consistently paying quarterly dividends since 1994. Most recently the company paid a dividend of $0.33 for the second quarter, which cumulates to an annual dividend of $1.32 and yields 2.77%. The 3-year dividend CAGR stands at 13%. MDC recorded a free cash flow of $1.37 million in the last reported quarter, generated $92.9 million as cash flow from operations, and returned $20.9 million to its shareholders in the form of dividends. In terms of the forward P/E ratio, MDC is currently trading at 9.85, 55.8% lower than the sector median. How does MDC stack up for the POWR Ratings? A for Trade Grade A for Buy & Hold Grade A for Peer Grade B for Industry Rank A for Overall POWR Rating The stock is also ranked #8 out of 21 stocks in the Homebuilders industry. Triton International Ltd. (TRTN) TRTN is the world’s largest lessor of intermodal containers, which are large steel boxes used to transport freight by ship, rail, or truck. The company’s equipment leasing operations include the acquisition, leasing, re-leasing, and ultimate sale of multiple types of intermodal transportation equipment. The company also purchases containers from shipping line customers, and other sellers of containers, and resell these to container retailers and other users. Along with a global network of 20 offices and 3 independent agencies in 16 countries, TRTN has 410 third-party-owned container depot facilities across 44 countries. The stock has gained 30.6% in the last three months. The company reported total leasing revenue of $321.4 million for the fiscal second-quarter ending June 2020, down 5.1% year-over-year. Its leasing demand and deal activities are expected to increase considerably in the third quarter. TRNT’s EPS for the second came in at $0.86, down 25.2% year-over-year. However, the reported EPS surpassed the consensus estimate by 10.3%. The market expects the company’s revenue and EPS to increase by 4.1% and 10.3% in the next financial year. EPS is also expected to grow at a rate of 10% over the next five years. TRTN is using strong cash flows to drive shareholder value through dividends, share repurchases, and de-leveraging. The company started paying dividends in 2016. The most recently paid dividend was $0.52 in September 2020, which cumulates to an annual dividend of $2.08 and yielding 5.44%. TRTN recorded a free cash flow of $1.49 million in the last reported quarter, generated $218.6 million as cash flow from operations, and returned $46.4 million to its shareholders in the form of dividends. In terms of the forward P/E ratio, TRTN is currently trading at 9.38, 56.4% lower than the sector median. TRTN’s POWR Ratings reflect its promising outlook. It has an overall rating of “Strong Buy” with an “A” for Trade Grade, Peer Grade, and Buy & Hold Grade. Among the 46 stocks in the Shipping industry, it’s ranked #4. Fortress Transportation and Infrastructure Investors LLC (FTAI) FTAI owns and acquires high-quality infrastructure and equipment that are essential for the transportation of goods and people globally. The company is externally managed by an affiliate of Fortress Investment Group LLC, a leading, diversified global investment firm. FTAI has a diversified portfolio of products across the aviation, energy, port, and rail sectors. The stock has gained 34% over the past three months. The company reported revenues of $94.3 million for the fiscal second quarter ended June 2020, down 37.1% year-over-year. However, equipment leasing revenues increased 0.8% year-over-year to $79.8 million. The company’s infrastructure revenues were hit by the deteriorating global crude demand driven by COVID-19. As of June 30, 2020, FTAI owned and managed 272 aviation assets, including 80 aircraft and 192 commercial jet engines, with 75 of 80 aircraft and 88 of 192 engines on lease. In the next fiscal year, the revenue is expected to grow by 30% whereas EPS is expected to grow by a whopping 869.2%. The company has been consistently paying a quarterly dividend since 2015. Most recently, the company paid a dividend of $0.33 for the third quarter, which adds up to an annual dividend of $1.32, yielding 7.69%. For the last reported quarter, the company generated $56.5 million as cash flow from operations and returned $32.5 million to its shareholders. FTAI’s POWR Ratings reflect its promising outlook. It has an overall rating of “Buy” with a grade of “A” in Trade Grade and Peer Grade and a “B” in Buy & Hold Grade. Among the 65 stocks in the Air/Defense Services industry, it’s ranked #9. Want More Great Investing Ideas? 7 Best ETFs for the NEXT Bull Market What is the Cure for Stock Market Volatility? Chart of the Day- See Christian Tharp’s Stocks Ready to Breakout MDC shares were trading at $50.33 per share on Thursday afternoon, up $2.13 (+4.42%). Year-to-date, MDC has gained 35.42%, versus a 8.23% rise in the benchmark S&P 500 index during the same period."}]}