{"article": [{"url": "https://stocknews.com/news/met-kr-nxst-3-extremely-cheap-dividend-stocks/", "published": 1601467700.0, "headline": "3 Extremely CHEAP Dividend Stocks", "body": "The US stock market has endured historic levels of volatility so far this year. Despite the persistent selling in September, investors could face a deeper correction if there is no agreement on a second stimulus package. Moreover, the market is expected to remain highly volatile because of the upcoming elections. So, investing solely with the intention of capital appreciation in the near term could be risky now. However, companies are slowly reinstating their dividend programs after suspending them due to the coronavirus. Hence, this is an opportune time to pick up some attractive dividend-payers. The decline in interest rates is another catalyst for the sector. MetLife, Inc. (MET), The Kroger Company (KR), and Nexstar Media Group, Inc. (NXST) are cheap dividend stocks that have a yield of 2% or better with decent upside potential. 9 \"BUY THE DIP\" Growth Stocks For 2020MetLife, Inc. (MET) MET is one of the world’s leading financial services companies that engage in insurance, annuities, employee benefits, and asset management businesses in more than 40 markets globally. It operates through five segments – United States, Asia, Latin America, EMEA, and MetLife Holdings. MET has been consistently paying quarterly dividends since 2013 and increasing its payout each year. Over the last five years, the average dividend per share growth for MET was 8% per year. The most recent dividend declared by the company was $0.46 for the second quarter, cumulating to an annual dividend of $1.84. While the four-year average dividend yield for the company is 3.62%, the current annual dividend translates into a 4.94% yield. MET recorded a free cash flow of $195 million in the last reported quarter, declining 64.6% year-over-year. It generated $846 million as cash flow from operations and returned $419 million to its shareholders in the form of dividends. The company’s top-line fell 19% year-over-year to $14.1 billion due to the 13% decline in both premium revenue and investment income. However, MET has recently entered into a definitive agreement to acquire Versant Health, which owns the well-established marketplace brands Davis Vision and Superior Vision. The deal will make MET the 3rd largest U.S. vision insurer by the membership and give it access to 35 million new members. EPS for the quarter came in at $0.83, falling 43% from the comparable quarter last year due to increased COVID-19 claims and a decline in the private equity portfolio. However, MET allied with Barnum Financial Group, a financial planning and wealth management firm, in August to enable nationwide delivery of MetLife’s PlanSmart financial education programs, Transition Solutions, and Retirewise. Hence, the street estimates current quarter EPS to grow 26% from the year-ago value. MET closed yesterday’s trading session at $36.77, gaining more than 36% in the last six months. While the sector’s median P/E ratio is 11.56, MET has a forward P/E ratio of 4.84, indicating that the stock is trading cheap. Under our POWR Ratings system, the stock is also ranked #5 out of 25 stocks in the Insurance – Life industry. The Kroger Company (KR) KR operates supermarkets, multi-department stores, marketplace stores, and price impact warehouse stores in 35 states of the United States. As of March 2020, the company operated 2,757 retail food stores which served over 11 million customers daily through a seamless shopping experience under a variety of banner names. KR pays an annual dividend of $0.72, which translates into a dividend yield of 2.14%. The company has been uniformly paying quarterly dividends since 1977. The most recent dividend declared by the company was $0.18 for the second quarter, implying a 12.5% increase. Over the past ten years, KR’s payout has grown at a CAGR of 12.6%. The four-year average dividend yield of the company is 1.97%. KR’s second-quarter results did not fail to impress the street. Free cash flow for the quarter increased 13.3% year-over-year to $520 million. Cash generated from operations grew 15% year-over-year to $1.16 billion. The company returned $126 million to its shareholders during the quarter in the form of dividends. It reported a top-line of $30.5 billion as the digital sales soared 127% year-over-year, thanks to the pandemic. Recently, KR’s delivery services wing — Kroger Ship — partnered with Mirakl, a leading software platform enabling B2C and B2B digital marketplaces. The tie-up will enable the addition of more than 50,000 items across multiple categories. EPS for the quarter came in at $1.03, increasing 178% year-over-year. The company has been making prudent investments to bolster omnichannel operations, improve supply chain, and increase manpower to ensure swift customer service amid such challenging times. In line with the developments, the market expects current year EPS to rise 49% year-over-year. The stock closed yesterday’s trade at $33.77, gaining 18.3% so far this year. It is presently trading just 9.3% below its all-time high of $37.22. KR commands a forward P/E ratio of 9.39 compared to the sector’s median value of 22.47, indicating that the stock is highly undervalued. KR’s POWR Ratings reflect a promising outlook. It has an overall rating of “Buy” with an “A” for Industry Rank, and a “B” for Trade Grade, Buy & Hold Grade, and Peer Grade. Among the 18 stocks in the Grocery/Big Box Retailers industry, it’s ranked #6. Nexstar Media Group, Inc. (NXST) NXST operates as a television broadcasting and digital media company in the United States. The company focuses on the acquisition, development, and operation of television stations and interactive community websites in small and medium-sized markets. It offers free over-the-air programming to television viewing audiences in 115 markets. NXST has been consistently paying quarterly dividends since 2013 and increasing its payout each year. Over the last five years, the average dividend per share growth for NXST was 24.6% per year. The most recent dividend declared by the company was $0.56 for the second quarter ended in June. The company pays an annual dividend of $2.24. While the four-year average dividend yield for the company is 1.86%, the current annual dividend translates into a 2.37% yield. Free cash flow for the last reported quarter came in $195 million, increasing 127% year-over-year. The company generated $290 million as cash flow from broadcasting and returned $25.3 million to its shareholders in the form of dividends. The quarterly revenues grew 41% year-over-year to $915 million, reflecting growth in total television advertising revenue as it drove year-over-year increases in the same station new-to-television business. Political advertising revenue soared 583% compared to the year-ago quarter. The EPS for the quarter came in at $2.13, increasing 50% year-over-year and beating the consensus estimate by 81%. The company has recently issued $1 billion worth of senior notes to improve its liquidity. Hence, NXST is well positioned due to its differentiated broadcast and digital sales programs and continued growth in political ad revenues. The market expects the current quarter EPS to grow 2,369% from the year-ago quarter. NXST has lost 20.5% year-to-date to close yesterday’s trading session at $91.4. However, the stock has recovered sharply from the March crash and is up more than 82% in the last six months. NXST commands a forward P/E ratio of 6.86 compared to the sector’s median value of 18.55, indicating that the stock is trading at a discount. As per our POWR Ratings system, NXST has a “B” for Peer Grade. It is also ranked #2 out of 9 stocks in the Entertainment – Broadcasters industry. Want More Great Investing Ideas? Do NOT Buy Stocks Before the Election! 7 “Safe-Haven” Dividend Stocks for Turbulent Times Chart of the Day- See Christian Tharp’s Stocks Ready to Breakout MET shares were unchanged in after-hours trading Wednesday. Year-to-date, MET has declined -24.46%, versus a 5.54% rise in the benchmark S&P 500 index during the same period."}]}