{"article": [{"url": "https://stocknews.com/news/spy-inx-dia-iwm-qqq-5-winning-stock-chart-patterns-21599987/", "published": 1599221300.0, "headline": "5 Winning Stock Chart Patterns", "body": "First a confession. My father was a Certified Financial Planner and “dyed in the wool” value investor. Not surprising for a guy born during the Great Depression. And yes, I was his prized pupil who took quickly to these value and fundamental investing approaches. 9 \"BUY THE DIP\" Growth Stocks For 2020So why the heck am I writing an article: 5 Winning Stock Chart Patterns? Because during my 40 years of investing I have learned, beyond a shadow of a doubt, that there is more than one way to invest successfully. And it is hard to dismiss the outperformance that comes from proven momentum and technical analysis strategies. The thing that opened my eyes to this was the begrudging admission by one of my fundamental investing heroes. I am referring to the economics Nobel prize winner, Eugene Fama. He is best known for his work on the Efficient-Market Hypothesis (EMH). And the simple version of this widely followed model is that it is very difficult to beat the market. These findings are what pushed a generation of investors into index funds as their best chance to maximize returns. However, he and the other EMH academics talk about a series of anomalies. These are the rare few exceptions to EMH that actually do lead to outperformance. In fact, momentum is “the biggest challenge to (EMH)” according to Eugene Fama. This is where the two investing worlds, fundamental and technical, start to blend together in a wonderful way. That is because the true underlying catalyst behind most big stock moves are fundamental in nature. For example a positive earnings report with raised guidance can ignite a fire under a stock for a 2-3 month run of serious outperformance. And that these outperforming stocks have a way of extending their run well into the future as long as the fundamental picture remains positive. This vital relationship is what led to me to purchase StockNews.com with its proprietary POWR Ratings system. Because truly this is one of the best models for discover stocks experiencing the strongest momentum runs. Aye, But Here’s the Rub! With today’s update of the POWR Ratings model there are a full 2,858 Buy rated stocks (A & B). This makes sense on the level that there is a lot of momentum to be found in a market that had bounced more than 60% since the March lows. But it makes the selection of the 5-10 that go into your portfolio a very time consuming process. We have already created one solution to this problem with my newsletter, the Reitmeister Total Return. This is where I stay up night and day to narrow down these stocks to a manageable 5-10 positions for subscribers. However, this portfolio is based upon my fundamental view of the world. For those who lean more towards technical analysis, and the precision timing found in proven chart patterns, then the help you are looking for is on the way in this new special report: 5 WINNING Stock Chart Patterns This report was put together by Christian Tharp CMT (Chartered Market Technician) Most of you probably already know Christian as one of the most successful traders alive today. And for those that haven’t met him yet, then now is a great chance to get his lifetime of trading experience boiled down into these 5 proven chart patterns. The key word above is “proven”. Meaning most chart patterns don’t really work on a consistent basis. So Christian will share the 5 patterns that time and time again point to the best trade set ups. So claim your copy of this new special report now by clicking the link below. Plus get insights on the top trades Christian Tharp recommends today: 5 WINNING Stock Chart Patterns Wishing you a world of investment success! Steve Reitmeister …but everyone calls me Reity (pronounced “Righty”) CEO, Stock News Network and Editor, Reitmeister Total Return SPY shares were trading at $342.57 per share on Friday afternoon, down $2.82 (-0.82%). Year-to-date, SPY has gained 7.53%, versus a % rise in the benchmark S&P 500 index during the same period."}]}