{"article": [{"url": "https://stocknews.com/news/bhp-mth-big-3-undervalued-stocks-with-high-growth-potential/", "published": 1595506100.0, "headline": "3 Undervalued Stocks with HIGH GROWTH Potential", "body": "Tech stocks are flying sky-high and many believe that we’re in a bubble, similar to the one experienced in 1999. Tech stocks have been receiving most of the attention lately from investors, as the sector has skyrocketed since March 23rd. However, there are a number of undervalued stocks that are being ignored and that could see a significant rebound in the second half of 2020. 7 \"SAFE HAVEN\" Dividend Stocks for Turbulent TimesTo find the best undervalued stocks, I focused on three metrics: I only looked at stocks that have a year-over-year quarterly EPS growth rate of over 25%. I narrowed down that list by considering stocks with a trailing 12-month price/earnings ratio of 15 or under and a Price/Earnings to Growth ratio of under one. This resulted in a list of 150 stocks. I then selected three stocks that had a Buy rating or higher in the exclusive StockNews POWR Ratings system. Here are my favorite three undervalued stocks with high growth potential for the remainder of 2020: BHP Group (BHP) BHP is a leading global diversified miner supplying iron ore, copper, oil, gas, and metallurgic coal. The company, which has a market cap of $80.99 billion, operates as a Dual Listed Company with two parent companies, BHP Group Limited and BHP Group Plc. BHP operates as a single entity with the same management team and board. The stock, which has a current trailing P/E of 13.64, saw quarterly year over year earnings growth of 29.3%. The company has affirmed its production and cost guidance for its fiscal year 2020, even with the ongoing pandemic. BHP has been focusing on lowering its debt and improving its cash flow, which should bode well during these turbulent times. The company is also investing in technology for its operations to make it more efficient. Also, BHP has benefited from rising iron and copper prices. BHP is one of the top-rated stocks in our momentum-based POWR Ratings system. It has a Strong Buy rating and is the #1 ranked stock in the Industrial-Metals industry Meritage Homes (MTH) MTH is an American residential construction company that builds single-family and active adult housing communities throughout the western, southern, and southeastern parts of the United States. It has a presence in over 25 metro markets and is considered one of the industry’s leading energy-efficient homebuilders. The company operates as a holding company and has no independent assets or operations. The stock has a trailing P/E of 11.02 and saw a whopping quarterly year over year earnings growth of 180% for the first quarter. The company reported earnings of $2.31 yesterday for the second quarter, which was an 82% increase from the year-ago. MTH has beat analyst estimates for the last seven straight quarters. The company is focused on the growing demand for entry-level homes and should benefit from the increasing need for millennials to buy starter homes. MTH has four As in our POWR Ratings system, including an overall POWR Rating of Strong Buy. The stock is the #3 ranked stock in the Homebuilders industry. Big Lots (BIG) BIG is a U.S.-based company principally engaged in operating discount retail stores. The company provides an array of merchandise, including food, home products, furniture, electronics, and seasonal products. BIG operates over 1,400 stories in stores in Pennsylvania, Ohio, Alabama, Oklahoma, and California. The company has a trailing P/E ratio of 5.53, making it highly undervalued, which is crazy since the stock is up 115% over the last three months. In its most recent quarterly earnings report, the company saw 217.4% in EPS growth over the prior year. The company has been benefiting from its transformation initiative, which is called Operation North Star. The initiative includes driving top-line growth, lower costs, and enhancing systems and infrastructure. BIG has expanded high-volume stores and is investing in marketing to drive traffic and build its brand. The company is experiencing strong e-commerce growth, due to its “Buy Online Pick-up in Store” offering in many of its stores. BIG holds three As in our POWR Ratings system, including Trade Grade, Buy & Hold Grade, and Industry Rank. Overall, it is rated a Buy. Want More Great Investing Ideas? 9 “BUY THE DIP” Growth Stocks for 2020 Newly REVISED 2020 Stock Market Outlook 7 “Safe-Haven” Dividend Stocks for Turbulent Times BHP shares were trading at $52.91 per share on Thursday afternoon, down $0.28 (-0.53%). Year-to-date, BHP has declined -0.46%, versus a 1.80% rise in the benchmark S&P 500 index during the same period."}]}