{"article": [{"url": "https://stocknews.com/news/wmt-orcl-walmart-may-partner-with-oracle-and-tiktok-in-the-cloud/", "published": 1600690100.0, "headline": "Walmart May Partner with Oracle and TikTok in the Cloud Soon", "body": "Walmart may partner with Oracle and TikTok in the cloud soon, after striking a deal with the latter’s owner ByteDance to gain President Trump’s “blessing” upon ensuring U.S. interests would control the soon-to-be-created TikTok Global and initiate safeguards to prevent China’s government from accessing the personal data of American users. President Trump, speaking from the White House on Saturday, Sept. 20, called Walmart and Oracle “great American companies” with “genius” leaders that will help the video chat TikTok application become a “brand new company,” if it completes its planned formation of TikTok Global. Multinational retail giant Walmart (WMT), of Bentonville, Arkansas, and technology solutions provider Oracle (ORCL), of Redwood Shores, California, will become strategic investors with minority stakes of 7.5% and 12.5%, respectively, in TikTok Global. Oracle will provide cloud computer capabilities to TikTok Global that will be “superior” to anything in the world, Trump said. Plus, TikTok Global likely will be based in Texas, ultimately create 50,000 jobs and pay more than $5 billion in new tax dollars for the U.S. Treasury. 7 \"SAFE HAVEN\" Dividend Stocks for Turbulent TimesWalmart May Partner with Oracle and TikTok in the Cloud Soon with New Entry TikTok, a unit of China’s ByteDance Ltd., could benefit greatly from strategic partners to spur its growth internationally and its acceptance in the United States and other countries that are wary of the Chinese government’s big appetite for gathering private data about its own citizens and foreigners alike. President Trump issued an executive order on Aug. 14 setting a 45-day deadline for China-based TikTok to gain U.S. ownership due to growing concerns that the private data of the 100 million American users of the TikTok service could be obtained by the Chinese government upon request. “[TikTok Global] will have nothing to do with China,” Trump told reporters, while adding he approved the deal in concept. “It’ll be totally secure.” Walmart and Oracle both pay dividend payers, are unquestioned leaders in their respective industries and could offer TikTok’s operations enhanced capabilities and opportunities as new strategic investors. Other than taking an equity stake in the new TikTok Global, Walmart will give the video chat application access to its extensive retail revenue drivers such as Walmart.com, eCommerce marketplace, fulfillment, payment and measurement-as-a-service advertising. Walmart, offering a 1.58% dividend yield and trading at a consensus forward P/E of 27.17, and Oracle, with a 1.64% dividend yield and a consensus forward price-to-earnings (P/E) ratio of 14.29, would gain a seat on the video chat company’s board of directors for Walmart CEO Doug McMillon if the deal is completed. In fact, the five-member board of directors of the proposed TikTok Global would feature four Americans. Chart courtesy of www.stockcharts.com Big Box Retailer Walmart May Partner with Oracle and TikTok in the Cloud Soon The Chinese Communist Party (CCP) has demonstrated the “means and motives” to use apps such as TikTok and WeChat to threaten the national security, foreign policy and the economy of the United States, said William Ross, the U.S. Secretary of Commerce. The Commerce Department on Friday, Sept. 18, announced U.S. companies would be banned from providing downloads or updates for the TikTok and WeChat apps after Sunday, Sept 20, but the President later delayed it until Sept. 27 to allow time for the deal to be finalized. “President Trump will do everything in his power to guarantee our national security and protect Americans from the threats of the Chinese Communist Party,” Ross said in a statement. “At the President’s direction, we have taken significant action to combat China’s malicious collection of American citizens’ personal data, while promoting our national values, democratic rules-based norms and aggressive enforcement of U.S. laws and regulations.” The Commerce Department’s move was intended to eliminate access to TikTok and WeChat applications and significantly reduce their functionality in the United States. U.S. companies would have been blocked from providing WeChat with data-hosting services after Sept. 20, except for an order issued on that day in California by U.S. Magistrate Judge Laurel Beeler who granted a preliminary injunction blocking the ban and upholding a motion from users of the Chinese-owned messaging and e-commerce app. WeChat, owned by Tencent Holdings Ltd., is a provider of mobile payments, messaging, marketing and business communications. Walmart has been using WeChat since 2018 to reach and collect payments from its customers in China. Willing Walmart May Partner with Oracle and TikTok in the Cloud Soon Walmart became a new name in the proposed partnership after word emerged that Oracle only would gain a minority stake in TikTok and become its “technology partner,” falling way short of the Trump administration’s threshold. Oracle’s involvement would be critical to TikTok sustaining and growing its operation in the United States. However, the Trump administration needed to be convinced the technology company could protect the data of American users of the TikTok video chatting service. Chart courtesy of www.stockcharts.com ByteDance is planning a U.S. initial public offering (IPO) of TikTok Global within the next 12 months and a listing on a U.S. stock exchange. After the IPO, U.S. ownership of TikTok Global is expected to increase and continue to grow, according to a joint announcement from Oracle and Walmart. The two American companies also announced that TikTok Global will control the video chat apps technology and will comply with U.S. laws and privacy regulations. Private data of the 100 million American TikTok users will be moved to Oracle’s Generation 2 Cloud data centers that earned President Trump’s praise. WeChat gained a reprieve through the preliminary injunction on First Amendment grounds to avoid a ban in the United States by the Commerce Department starting Sept. 20, from the following activities: Any provision of internet hosting services enabling the functioning or optimization of the mobile application in the United States; Content delivery network services enabling the functioning or optimization of the mobile application in the United States; Directly contracting or arranging internet transit or peering services allowing the function or optimization of the mobile application in America; Any use of the mobile application’s code, functions or services to operate software or services developed and/or accessible within the United States. Walmart May Partner with Oracle and TikTok in the Cloud to Add Growth Oracle’s deal to gain a key technology role in the TikTok social media application TikTok will significantly raise Silicon Valley stalwart’s profile and create buzz in the business world. People might have scoffed years ago that a company called ByteDance, owning another known as TikTok, might partner with venerable software behemoth Oracle, but it could happen if the companies and Walmart can finalize the remaining terms satisfactorily. The alliance would position the revamped entity to profit from cloud computing that allows on-demand availability of data storage and other capabilities, without direct action from a user. Six Republican senators, Marco Rubio, Roger Wicker, Dan Sullivan, Thom Tillis, Rick Scott and JohnCornyn, co-signed a letter to President Trump on Sept. 16 calling for the rejection of any partnership that will retain ties to ByteDance or other Chinese-controlled entities due to U.S. national security concerns. “A partial sale, or trusted partnership deal, is insufficient in achieving the goals of protecting Americans and U.S. interests from the severe risks detailed in the Executive order,” the senators wrote. “Any deal between an American company and ByteDance must ensure that TikTok’s U.S. operations, data and algorithms are entirely outside the control of ByteDance or any Chinese-state directed actors, including any entity that can be compelled by Chinese law to turn over or access U.S. consumer data. As reported, the proposed partnership agreement between Oracle and TikTok leaves significant unresolved national security issues, and we expect the Administration to keep Congress fully informed as you evaluate this potential agreement.” Walmart May Partner with Oracle and TikTok in the Cloud Computing World “The deal is Oracle’s attempt to become a major player in providing cloud computing services,” said Bob Carlson, chairman of the Board of Trustees of Virginia’s Fairfax County Employees’ Retirement System with more than $4 billion in assets and head of the Retirement Watch investment newsletter. “Oracle missed the first phase of cloud computing growth. It preferred to continue its successful practice of selling database software to clients and having them buy the hardware to support it. “Many businesses now want a lot of their operations to be on the cloud, and Oracle hasn’t established itself as a [top] provider of cloud services. If it acquires TikTok, Oracle plans to move TikTok’s operations onto Oracle’s cloud servers. If Oracle is able to provide the services for this high-volume client, that would give it the credibility to compete in that sector against Amazon.com, Google and Microsoft.” (Pension fund Chairman Bob Carlson answers questions from Paul Dykewicz in an interview before social distancing became the norm after the outbreak of COVID-19.) Oracle ideally also would gain access to TikTok’s algorithms and gather some insight into how to improve its software offerings, Carlson continued. Since exact details of the proposal have not been publicly disclosed, it is uncertain what control of the data and algorithms Oracle may gain, he added. (Columnist and author Paul Dykewicz interviews money manager Hilary Kramer, whose premium advisory services include 2-Day Trader, Turbo Trader, High Octane Trader and Inner Circle.) Kramer Eyes Walmart Possibly Partnering With Oracle and TikTok in the Cloud “Big Tech’s size was a comfort in the early pandemic and now it’s dead weight,” said Hilary Kramer, host of a national radio program, “Millionaire Maker,” and head of the GameChangers and Value Authority advisory services. “Microsoft, in particular, looks like it’s going to struggle to regain its recent peak, which is going to be a challenge for the entire sector when you’re dealing with a $1 trillion company. The TikTok deal would have given it the push it needed, but no deal means no push.” Jim Woods, editor of Successful Investing and Intelligence Report investment newsletters, as well as the Bullseye Stock Trader advisory service, said Oracle Chairman Larry Ellison’s public support for President Trump may have helped gain the administration’s approval. “Aside from politics, the deal is likely to be a win-win for both Oracle and TikTok, as it gives the former a hot new app and it gives the latter the tech pedigree it needs to operate in the United States,” Woods said. (Paul Dykewicz meets with Jim Woods before the COVID-19 crisis.) Walmart May Partner with Oracle and TikTok in the Cloud to Fuel Growth “From a strategic standpoint, Oracle getting into the social media business makes sense in that their cloud division stands to gain from the deal as a minority partner,” said Bryan Perry, who leads the Cash Machine investment newsletter and the Premium Income, Quick Income Trader, Breakout Profits Alert and Hi-Tech Trader advisory services. “It stands to reason TikTok will provide a growth driver for Oracle at a time when the company needs to generate some new channels of growth. “Oracle is a low-profile enterprise computing business that gets little if any headlines that move its stock. TikTok is a high-profile business that will keep the keyword algorithms busy paying lots of attention to all things TikTok, and hence some things Oracle.” The proposed alliance also is good publicity, even if TikTok is a “long way from monetizing” its business model through sponsored-advertising expenditures, Perry said. The announcement of the proposal with a trendy social media video service should only enhance the reputation of Oracle, he added. (Paul Dykewicz interviews Bryan Perry at a MoneyShow conference.) President Trump Assessed Walmart’s Plans to Partner with Oracle and TikTok The deal took root after President Trump’s Aug. 14 executive order stating TikTok’s data collection lets the Chinese Communist Party access Americans’ personal and proprietary information — potentially tracking the locations of federal employees and contractors to allow U.S. adversaries to build dossiers of personal information for purposes of blackmail and corporate espionage. The Department of Homeland Security, Transportation Security Administration and the United States Armed Forces have already banned the use of TikTok on federal government phones. “TikTok also reportedly censors content that the Chinese Communist Party deems politically sensitive… concerning protests in Hong Kong and China’s treatment of Uyghurs and other Muslim minorities,” according to President Trump’s order. “This mobile application also may be used for disinformation campaigns that benefit the Chinese Communist Party, such as when TikTok videos spread debunked conspiracy theories about the origins of the 2019 Novel Coronavirus.” Plus, India’s government recently banned use of TikTok and other Chinese mobile applications in its country. India’s Ministry of Electronics and Information Technology claimed that the Chinese were “stealing and surreptitiously transmitting users’ data in an unauthorized manner to servers which have locations outside India.” U.S. COVID-19 Deaths Approach 200,000 and Should Top it Soon China’s lack of transparency about the severity of the COVID-19 crisis that began there has damaged the country’s relationship with U.S. leaders. The global COVID-19 pandemic’s huge human toll globally includes 30,918,269 cases and 959,295 deaths, as well as 6,799,044 cases and 199,474 deaths in the United States, as of Sept. 20, according to Johns Hopkins University. America has amassed the most cases and deaths by far of any country. ByteDance’s attempt to remedy TikTok’s ownership problem with the Trump administration appears to be on the verge of succeeding with Walmart and Oracle as new strategic owners of the video chat app. A willingness to compromise is positioning ByteDance to obtain giant U.S. partners in retail and technology to keep TikTok operating and growing in the United States. ‘Want More Great Investing Ideas?’ Click the links below. Dr. Mark Skousen, world-renowned investment advisor and economist, just released his Top 3 Dividend Plays that are set to skyrocket. Click here now to find out what they are, and how you too can cash in from this profit bonanza. A devastating new law has paved the way for the IRS to confiscate up to 30% of your retirement funds. Bob Carlson, America’s foremost retirement expert, will show you how to protect your hard-earned nest egg, and keep these damning new rules at bay. Click here now to learn more. WMT shares were trading at $136.46 per share on Monday morning, up $1.17 (+0.86%). Year-to-date, WMT has gained 16.32%, versus a 1.59% rise in the benchmark S&P 500 index during the same period."}]}