{"article": [{"url": "https://stocknews.com/news/ocsl-fsk-tslx-this-3-click-retirement-portfolio-pays-10-9/", "published": 1597925300.0, "headline": "This 3-Click Retirement Portfolio Pays 10.9%", "body": "We’re in the deepest recession since World War II, yet the yield on the S&P 500 is at a 10-year low. Buy it today for a lame 1.7% yield. So, we have high stock prices and investor sentiment, a terrible economy—and no dividend yield to compensate us for the concerning level of risk. Why would any serious dividend investor be interested in this “deal?” Fortunately, there are better bargains out there. Today we’ll talk about a less-chatted-about area of the market that pays more. Seven times more, to be specific, as we craft a dividend portfolio that yields 10.9% (yes, you read that right.) 7 Best ETFs for the NEXT Bull MarketTo do this, we’re going to buy three business development companies (BDCs), publicly traded stocks that are simply underfollowed and underowned. BDCs are tax-privileged in that they were created by Congress in 1980 to spur growth in small and midsized businesses, which often struggled to secure financing from actual banks. That’s where BDCs step in: They provide debt, equity and other financing to these companies, and the repayments serve as a steady stream of cash flow. These cash flows end up investors’ pockets because, well, they have to by law. Like real estate investment trusts (REITs)—another Washington creation—BDCs largely get a pass on taxes, on the condition that they return at least 90% of their taxable profits to shareholders as dividends. These aren’t token payouts, either. In fact, BDCs dwarf the yields of almost every other asset class on the market. At a fantastic 12% on average, business development companies dole out more than twice what preferred stocks do, more than three times REITs, and an incredible 7x the yield on the S&P 500 at present. Source: Contrarian Outlook BDCs have been one of the market’s highest-yielding assets for years. And as I wrote last year, the gap between these firms and other income industries has been widening for some time. But it’s not easy to provide financing to small businesses today! These firms are going down left and right, which means BDCs must be extra careful. As a result, BDCs’ “yield leadership” has exploded in recent months as the Robin Hood crowd buys names they know while everyone avoids BDCs: BDCs Jump From “High Yield” to “Higher Yield” Looks great to a dividend investor, but we must be careful. There is no such thing as an “easy” 12% yield. BDCs have been challenging stocks to pick for some time. Their portfolio firms tend to be privately owned, making these holdings exceedingly difficult to analyze. Many BDCs charge exorbitant fees to cover pricey external management. And while business development companies were created to fill an unmet financing need, competitors have been creeping into the space more recently. In fact, it doesn’t pay to invest in these high-yielders as a group. In aggregate, their total returns (dividends plus price gains) have been barely positive in recent years. How can a double-digit annual yield equal a single-digit yearly gain? (Hint: When stock prices drop nearly as fast as their quarterly payouts.) BDCs Underperform the Market This is why we must cherry pick the sector and sidestep the losers. So today, I’m going to dig into a trio of business development companies that yield between 8.4% and 15.1%. Two of these companies show the promise inherent in these private equity-esque vehicles, even in the midst of a black-swan event. The other is a dividend disaster in the making. FS KKR Capital Corporation (FSK) Dividend Yield: 15.1% Let’s start out with FS KKR Capital Corporation (FSK), which has two readily apparent things going for it: a sky-high yield, bargain-basement price. FS KKR provides financing to private middle-market companies, primarily by investing in senior secured debt (70%), though it’ll also deal in subordinated debt. It features 184 portfolio companies spread across a number of industries, including capital goods, software, health care equipment, diversified financials and more. This diversified portfolio has been beat up to the tune of 35% this year. But maybe Wall Street’s too down on this name. FSK shares are now trading at 69 cents for every dollar of net asset value (NAV), and shares yield more than 15% at present. …Or Maybe FSK Is Cheap for a Reason FS KKR has had to cut its payout twice over the past four years, including a 21% haircut to 60 cents per share for the July payout. The outlook for this year is tough. Janney, one of the few analyst firms covering the BDC space, is projecting a $4.83-per-share loss in 2020, followed by a rebound to $2.41 per share in 2021. That translates into returns-on-equity of -16% and 10%, respectively, which is plenty worse than what better-positioned rivals are expected to produce. Lockdowns have hit FS KKR’s portfolio companies hard. Some 20 portfolio companies haven’t paid KKR in more than 90 days! I’ve mentioned previously that FS KKR is one of those BDCs that tend to “take your dividend back” by tapping their own book value to pay you dividends, leading to inferior performance. With 2020 shaping up to be another money-eating year for FSK, this “serial laggard” is set to continue its struggles: FSK Is a Serial Laggard Sixth Street Specialty Lending (TSLX) Dividend Yield: 9.2% Sixth Street Specialty Lending (TSLX) is the new name of TSLX, a promising BDC from the past that’s worth a check-in. TSLX swings for the BDC fences. It makes transactions in a wide range between $15 million-$350 million in companies between $50 million-$1 billion in enterprise value bringing in between $10 million-$250 million in EBTDA. It’s not choosy about how that capital is put to use, either: organic growth, acquisitions, restructuring and a few other uses are all fair game. That lends itself to an eclectic group of portfolio companies, from healthcare analytics firm Quantros and cloud treasury/finance leader Kyriba to struggling retailers such as JCPenney and Neiman Marcus. The good news? Non-accruals are only 0.4% of the portfolio by fair value, and unsurprisingly, two of those companies are JCP and Neiman Marcus. Also, this BDC has an extremely conservative dividend that it “pads” with occasional special dividends; its yield over the past 12 months, including these one-time bonuses, is actually 12.6%. But investors are being asked to pony up a pretty premium for this BDC right now. TSLX shares trade at more than 1.1 times NAV, making it one of the most expensive business development companies on offer. I prefer to buy my BDCs at a discount to NAV, as the margin of safety helps compensate us for the risk in this sector. TSLX Beats Its BDC Brethren Oaktree Specialty Lending Corporation (OCSL) Dividend Yield: 8.4% Oaktree Specialty Lending Corporation (OCSL) is a lesson in the importance of capable management. OCSL boasts a $1.6 billion portfolio spread across 119 companies in a wide range of industries. And while it also offers a number of financing options—including unsecured and mezzanine loans, as well as preferred equity—it primarily deals in first and second lien loans, which make up roughly 80% of the portfolio. And like TSLX, OCSL also has played the name-change game in recent years. It picked up the moniker in 2017 after Fifth Street Finance Corporation picked up a new adviser: Oaktree Capital Management. Oaktree emphasizes consistency and risk control: a message retirees can get behind. “A superior record is best built on a high batting average rather than a mix of brilliant successes and dismal failures,” the company says—and so far, it shows. This BDC Clearly Is on the Ball Management and incentive fees were immediately lowered. The new team went to work on cutting down non-core assets, which Janney points out were reduced from 63% as of Sept. 30, 2017, to just 9% as of 2020’s second quarter. Perhaps best of all: Whereas most BDCs are keeping their payouts level or cutting them, OCSL has raised its payout not once, but twice, since 2018, including a 10.5% upgrade starting in September. Want More Great Investing Ideas? Your Early Retirement Portfolio: 7.7% Dividends—Every Month—Forever How to Retire on 10% Dividends Paid Monthly The Simple (and Safe) Way to Earn 15% Every Year from Stocks OCSL shares were trading at $5.01 per share on Thursday afternoon, up $0.04 (+0.80%). Year-to-date, OCSL has declined -4.19%, versus a 5.95% rise in the benchmark S&P 500 index during the same period."}]}