{"article": [{"url": "https://stocknews.com/news/abbv-pfe-pdco-gild-bntx-3-healthcare-stocks-with-over-3-dividend-yield/", "published": 1597234100.0, "headline": "3 Healthcare Stocks with Over 3% Dividend Yield", "body": "There has been an increasing focus on the healthcare sector since the outbreak of the deadly virus. The significance of healthcare services is more important now more than ever in light of this ongoing health crisis. This is evident from the Health Care Select Sector SPDR Fund’s (XLV) return of more than 30% since its virus-led March lows. The demand inelasticity for healthcare products and services as well as the surge in an aging population are already reasons why healthcare stocks should perform well. Moreover, the potential of the sector to find a cure for the virus could help it grow at an even faster rate. Due to these reasons, healthcare stocks could be valuable additions to your portfolio. In addition to carrying solid growth prospects, AbbVie Inc. (ABBV), Pfizer, Inc. (PFE) and Patterson Companies, Inc. (PDCO) offer dividend yields of more than 3%. 7 \"SAFE HAVEN\" Dividend Stocks for Turbulent TimesAbbVie Inc. (ABBV) ABBV operates in the realm of key therapeutic areas in medicine such as virology, neuroscience, immunology, oncology, gastroenterology amongst other specializations. The company is the race to find a cure for the coronavirus with the aim to develop a novel antibody therapeutic. To that end, ABBV has joined forces with Harbour BioMed, Utrecht University, and Erasmus Medical Centre. Members of the COVID R&D Alliance, which includes ABBV, announced that its first patients will be enrolled in the I-SPY COVID Trial, which will study the impact of cenicriviroc, Otezla®, and Firazyr® on inflammatory response in COVID-19 patients. Furthermore, ABBV has also recently announced positive Phase 3 study results for some of its other products, including RINVOQ™ Monotherapy, which Showed Improvement in Skin Clearance and Itch in a study for Atopic Dermatitis. In the second quarter, net revenues increased 26.3% on a reported basis and earnings per share increased 3.5% year-over-year. The stock has gained more than 45% since it hit its 52-week low of $62.55 on March 23rd. ABBV has issued more total dividends over the past six years than 97% of other dividend issuing US stocks in the Stocknews.com universe. ABBV declared a quarterly cash dividend of $1.18 per share which is payable to shareholders on August 14th of this year. ABBV has an annual dividend of $4.72, which yields 5.11%. The company has increased its dividend by 195% since its inception. The market expects the company to report EPS of $2.76 for the quarter ending September 2020, which represents a 18.5% growth over the year-ago number. Also, ABBV beat the consensus EPS estimates in each of the trailing four quarters. ABBV’s consensus revenue estimate of $12.82 billion for the quarter ending September also indicates a year-over-year increase of 51.2%. How does ABBV stack up for the POWR Ratings? A for Peer Grade B for Trade Grade B for Buy & Hold Grade B for Industry Rank B for Overall POWR Rating The stock is also ranked #11 out of 215 stocks in the Medical-Pharmaceuticals industry. Pfizer, Inc. (PFE) PFE, one of the world’s largest pharmaceutical companies, announced a multi-year agreement with Gilead Sciences (GILD) to bolster supply of Gilead’s investigational antiviral remdesivir for treatment for Covid-19. PFE is also working in collaboration with BioNTech (BNTX) to develop a vaccine for coronavirus. They announced that two out of the four vaccine candidates under the BNT162 Mrna-based vaccine program were granted Fast Track designation from the FDA based on the positive initial data of phase1/2 clinical studies in Germany and the United States. The companies began phase 2b/3 selecting BNT162b2 as the lead vaccine candidate and remain on track for regulatory review as early as October this year. If the trials are successful, the companies will be able to manufacture up to 100 million doses by the end of 2020 and approximately 1.3 billion doses by the end of next year. PFE and BioNTech have recently agreed to supply their BNT162 mRNA-based vaccine candidate to Canada and Japan contingent on clinical success and regulatory approval. PFE paid $4.2 billion of dividends during the first six months of 2020. PFE has an annual dividend of $1.52, which yields 3.96%. Over the past 6 years, PFE has returned more capital to shareholders through dividend issuances than 97.9% of other dividend-paying US stocks in the StockNews.com universe. PFE has an impressive earnings surprise history with the company beating consensus EPS estimates in three out of the trailing four quarters. The stock has grown 35.5% since its March lows. PFE’s POWR Ratings reflect this promising outlook. It has an overall rating of Strong Buy with an A for Trade Grade, Buy & Hold Grade, and Peer Grade. It has a grade of B for Industry Rank. Among the 215 stocks in the Medical-Pharmaceuticals industry, it’s ranked #2. Patterson Companies, Inc. (PDCO) PDCO links dental and animal health customers to innovative business solutions and new technology. The stock hit its 52-week high of $28.42 on August 4th 2020 and has grown approximately 100% since its lows in the beginning of April. PDCO has an annual dividend of $1.04 which yields 3.76%. The company paid a quarterly cash dividend of $0.26 per share on July 31st 2020. In the fiscal fourth quarter ending April 25th 2020, adjusted net income attributable to PDCO, excluding deal amortization, integration and business restructuring expenses, an investment loss and goodwill impairment, increased 16.2% year-over-year. PDCO has an impressive earnings surprise history with the company beating consensus EPS estimates in each of the trailing four quarters. PDCO’s EPS is expected to grow 3% per annum over the next five years. It’s no surprise that PDCO is rated a Strong Buy in our POWR Ratings system. It has a grade of A for Trade Grade, Buy & Hold Grade, and Peer Grade. In the 132-stock Medical-Devices & Equipment industry, it is ranked #19. Want More Great Investing Ideas? 3 Possible Directions for the Stock Market from Here How to Trade THIS Stock Bubble? 9 “BUY THE DIP” Growth Stocks for 2020 ABBV shares . Year-to-date, ABBV has gained 12.31%, versus a 5.92% rise in the benchmark S&P 500 index during the same period."}]}