{"article": [{"url": "https://stocknews.com/news/sbux-mcd-dnkn-shak-are-shares-of-starbucks-worth-buying-under-90/", "published": 1601986100.0, "headline": "Are Shares of Starbucks Worth Buying Under $90?", "body": "With more than 32,000 stores around the globe, Starbucks Corporation (SBUX) is the premier roaster, marketer, and retailer of specialty coffee, tea, and other beverages, and fresh food items worldwide. SBUX has rapidly grown into the world’s dominant coffee shop-themed chain over five decades in 83 markets. It operates through three main business segments and breaks them down into – Americas, International, and Channel Development. SBUX, like many restaurants and retailers, has been severely affected by the impacts of the COVID-19 pandemic this year. The company announced its plan to close up to 400 stores in the United States in its fiscal third quarter ended June 28, 2020. Net revenue for the quarter was $4.2 billion, down 38.1% from the year-ago quarter. The coffee chain posted a net loss of $678.1 million for the quarter, implying a significant decline from the $1.4 billion gain posted in the same three-month period last year. However, the company raised its quarterly dividend by 10% year-over-year to $0.45 per share for its fourth quarter. International store count, during the last reported quarter, increased 9% year-over-year. SBUX’s expansion in China is getting a promising twist. The company has 10 Starbucks Now locations in China, designed exclusively for mobile ordering, takeout, and delivery. Expanding a partnership signed with conglomerate Alibaba (BABA) in 2018, customers can now order drinks on the Taobao marketplace and mobile map app, Amap. Moreover, to accelerate the adoption of the Now model, the company has also extended Now to four of BABA’s platforms. Stores in the United States and China now comprise 61% of the company’s global portfolio, with 15,243 and 4,447 stores, respectively. 9 \"BUY THE DIP\" Growth Stocks For 2020“Starbucks is taking longer to recover than our other restaurant companies given that the brand generates 50% of sales from breakfast, a daypart which is geared towards work and school commuting routines,” Bill Ackman stated in Pershing Square’s semi-annual report in August. SBUX’s recovery looks durable. Also, the potential upside based on several factors has helped it earn a “Strong Buy” rating in our proprietary rating system. Here is how our proprietary POWR Ratings system evaluates SBUX: Trade Grade: A SBUX is currently trading higher than its 50-day and 200-day moving averages of $81.98 and $79.11, respectively, indicating that the stock is in an uptrend. The stock’s 20% return over the past three months reflects a short-term bullishness. SBUX opened 130 net new stores in its fiscal third quarter, yielding 5% year-over-year unit growth. The company ended the period with 32,180 stores globally, of which 51% and 49% were company-operated and licensed, respectively. The company plans to open approximately 300 net new stores in America and at least 500 net new stores in China by the end of this fiscal year. Buy & Hold Grade: A SBUX is well positioned in terms of proximity to its 52-week high, which is a key factor that our Buy & Hold Grade takes into account. The stock is currently trading just 6% below its 52-week high of $94.13. The stock has gained more than 70% in the last three years due to its steady growth in customers, stable cash flows, and increasing dividends. It has an impressive long-term performance, as its revenues grew at a CAGR of 5.5% over the past five years. The company has a history of making strategic pivots to keep up with shifting tastes. One of those is the company’s recent partnership with Impossible Brands to introduce plant-based breakfast sandwiches. This is consistent with the company’s stated sustainability goals as well as the value of many of its consumers. Peer Grade: A SBUX is currently rated #2 out of 49 stocks in the Restaurant industry. Other popular stocks in the industry are McDonald’s Corporation (MCD), Dunkin’ Brands Group, Inc. (DNKN), and Shake Shack, Inc. (SHAK). All of these industry participants have comfortably beaten SBUX’s 2.2% year-to-date gain. MCD, DNKN, and SHAK have returned 16.6%, 9.7%, and 10.1%, respectively, over this period. Industry Rank: A The Restaurant industry is ranked #22 out of the 123 StockNews.com industries. The companies in this industry own and operate restaurants and other eating places, including full-service restaurants, quick-service restaurants, and buffets. The industry was adversely affected by the lockdown and the stay-at-home orders. However, restaurants have ramped up safety measures as indoor dining is steadily returning. Guest temperature checks, online ordering and takeout, and contactless service are among the safety precautions restaurants are implementing. Overall POWR Rating: A (Strong Buy) Overall, SBUX is rated a “Strong Buy” due to its impressive performance, steady growth in stores, and short-and-long-term developments, as determined by the four components of our overall POWR Rating. Bottom Line The coronavirus pandemic made business difficult for the company with temporary store closures. SBUX has soared merely 2.2% so far this year but remains an industry leader. It is a decent investment for investors looking for stable dividends along with growth in the long-run. SBUX is accelerating moves to make on-the-go orders even more convenient while focusing on international expansion. Moreover, the company has the potential to grow based on its continued focus on digital ordering and wellness-centered menu innovation. Analyst sentiment, which gives a good sense of a stock’s future price movement, is pretty impressive for SBUX. The average broker rating of 1.56 indicates a favorable analyst sentiment. Of the 33 Wall Street analysts that rated the stock, 14 have given it a “Strong Buy” rating. The market expects the succeeding year’s revenue and EPS to rise by 19.1% and 184.2% year-over-year, respectively. Want More Great Investing Ideas? Do NOT Buy Stocks Before the Election! 7 “Safe-Haven” Dividend Stocks for Turbulent Times Chart of the Day- See Christian Tharp’s Stocks Ready to Breakout SBUX shares fell $0.41 (-0.47%) in after-hours trading Tuesday. Year-to-date, SBUX has gained 0.53%, versus a 5.55% rise in the benchmark S&P 500 index during the same period."}]}