{"article": [{"url": "https://stocknews.com/news/au-gld-gdx-rgld-aem-three-gold-miners-with-attractive-valuations/", "published": 1598530100.0, "headline": "Three Gold Miners With ATTRACTIVE Valuations", "body": "It’s been a tough couple of weeks for investors in the precious metals space, with cries of manipulation everywhere as gold miners (GDX) trade at lower levels than they did a month ago, despite gold (GLD) at the same levels. While it might seem like manipulation, this is how the miners trade. While they are correlated to gold long-term, things can stretch to both the upside and the downside in the short-term. The good news is that this recent pullback has done a lot to improve valuations in the sector, and we were already seeing very reasonable valuations as we started the month of August. Therefore, this pullback should present some opportunities if this pullback can extend a little further. The key to selecting the best names in the sector is earnings growth coupled with strong management teams, and three names stand out currently in the large-cap space. 7 Best ETFs for the NEXT Bull MarketAgnico Eagle Mines (AEM), AngloGold Ashanti (AU), and Royal Gold (RGLD) share little in common as one is a Tier-1 jurisdiction producer, the other is a Tier-2 jurisdiction producer, and the latter is the second-largest royalty/streaming company in the sector. However, they all have exceptional track records and industry-leading earnings growth, and they’re all priced reasonably considering their growth rates. In a market where it’s hard to find any value out there, investors should be open-minded to the gold sector, where there’s tons of value even among the large-cap names. This is especially true after Powell’s admission that the Fed will be looking to let inflation creep above the previous 2% target, which should be a tailwind for the yellow metal. Let’s take a look at each company below: (Source: YCharts.com, Author’s Chart) Beginning with Agnico Eagle, the company is a two million-ounce gold producer that was hit especially hard by the COVID-19 related mine closures that plagued the sector. Fortunately, the company’s mines have since moved back online with mining declared an essential business, and the gold price has more than offset the 10% lower gold production expected this year. This strength in the gold price has allowed the company to maintain its position as one of the highest-growth miners in the sector, with FY2020 annual EPS on track for 80% plus growth ($1.74 vs. $0.96). This is even more impressive considering that annual EPS was up over 200% last year, so the company is managing to grow annual EPS at break-neck speed despite going up against tough comps, with its highest growth year in over a decade. Some investors have suggested the stock is expensive near $78.00 at over 80x earnings, but I would beg to differ. There is zero value in assessing a stock on last year’s earnings when it’s set to grow at nearly triple-digit levels this year, and an earnings multiple of 45 is more than reasonable for a company growing at this pace. It’s hard to find any large-cap companies paying a dividend with growth this high. (Source: TC2000.com) If we look at AEM’s chart, there’s a lot to like here as well, as the stock is breaking out of a 10-year base to new all-time highs. While there’s no guarantee that the stock will head higher directly from this setup, I would expect any 20% pullbacks to be buying opportunities. As we can see, the quarterly moving average (white line) is trending up just below the price and will be at $71.50 next month, and this would be a low-risk area to look to buy the stock on a dip. Assuming we did get this pullback, it would also significantly improve the valuation, leaving AEM trading at just 41x earnings. Therefore, this is a new I will be watching closely on pullbacks. (Source: YCharts.com, Author’s Chart) Moving to the next company on the list, Royal Gold, we have a company with a flawless track record and one of the best earnings trends in the sector. As we can see, the stock is on track to more than double its annual EPS since FY2013 despite minimal progress from the gold price, a testament to its rock-solid business model. For those unfamiliar, Royal Gold is much lower-risk than most miners as it pays miners upfront to help fund their mines, and then takes a royalty on a percentage of gold or silver ounces produced. As we can see above, this model has delivered steady annual EPS growth over the past seven years, with a compound annual EPS growth rate of over 15%. However, the recent gold price strength is helping this trend to accelerate, with FY2021 annual EPS estimates sitting at $3.37. Assuming the company can meet these estimates, this would translate to over 30% growth year-over-year, the second strong year for annual EPS growth in a decade. One of the best determinants of future share-price performance is accelerating earnings growth, so investors should be paying attention. (Source: TC2000.com) If we look at Royal Gold’s quarterly chart, the stock couldn’t look better, as it has just broken out of a 12-month cup base to new all-time highs. This technical strength suggests that funds are buying into the acceleration in annual EPS going forward, and there are few things more bullish for a stock than new all-time highs. While some investors are hung up on the terrible quarter RGLD just recently with several of its partner’s mines shut down temporarily, I would argue that it’s best to look past the results. Instead, what’s most important is where the annual EPS is going, and the direction is up. (Source: YCharts.com, Author’s Chart) The final name on the list is AngloGold Ashanti, and while the company might not operate out of the best jurisdictions in the world, it’s one of the few growth & value names left in the gold sector. As we can see above, AngloGold Ashanti grew earnings by over 140% last year ($1.80 vs. $0.73), and is on track for over 40% growth this year, with several upward revisions in earnings estimates this month. This is impressive growth given the tough comps that AU is up against, but the most compelling part about the investment thesis is the valuation. At a current share price of $28.00, the stock is trading at just over 8x FY2021 earnings, despite growing annual EPS faster than many tech companies. Therefore, I see a massive margin of safety here, especially because I believe the FY2021 estimates are on the conservative side. (Source: TC2000.com) While the recent 27% pullback may have spooked investors from buying, the bigger picture suggests we’ve seen no real technical damage. This is because the stock remains a 7-year breakout level, and above its key quarterly moving average (white line). Based on this, I believe this correction provides a buying opportunity, especially when considering the valuation. Some investors will argue that the jurisdictions aren’t great with mines spread across Africa and South America, but at just over 8x forward earnings, and down from an average forward earnings multiple of 11, I see an opportunity for multiple expansion here. While we could still have further to go for this sector-wide correction, I see RGLD, AU, and AEM as three of the lower-risk ways to play this current correction. It is certainly possible that the stocks could see a deeper pullback to wash out the sentiment in the sector completely, but I would view any further weakness on RGLD and AU as buying opportunities, and any pullbacks to $72.00 on AEM as a low-risk buying opportunity. For now, I remain long RGLD and AU, and I may look to start a position in AEM next month. Disclosure: I am long AU, RGLD Disclaimer: Taylor Dart is not a Registered Investment Advisor or Financial Planner. This writing is for informational purposes only. It does not constitute an offer to sell, a solicitation to buy, or a recommendation regarding any securities transaction. The information contained in this writing should not be construed as financial or investment advice on any subject matter. Taylor Dart expressly disclaims all liability in respect to actions taken based on any or all of the information on this writing. Want More Great Investing Ideas? 7 Best ETFs for the NEXT Bull Market Why Stocks Could Drop 20% in September? 9 “BUY THE DIP” Growth Stocks for 2020 AU shares fell $0.02 (-0.07%) in after-hours trading Thursday. Year-to-date, AU has gained 28.26%, versus a 9.34% rise in the benchmark S&P 500 index during the same period."}]}