{"article": [{"url": "https://stocknews.com/news/sq-ma-v-aapl-amzn-msft-the-reasons-why-square-shares-should-continue-to-rise/", "published": 1595938100.0, "headline": "The Reasons Why Square Shares Should Continue to Rise", "body": "Payment solutions in the post COVID-19 world The market cap could make it a takeover target The trend is your friend, and it is higher Square, Inc. (SQ) is a company that provides payment and point-of-sale solutions in the United States and worldwide. SQ’s commerce ecosystem includes point-of-sale hardware and software. The Magstripe reader enables swiped transactions of magnetic stripe cars. Contactless and chip readers accept Europay, MasterCard (MA), and Visa (V) (EMV) chip cards and Near Field Communications payments. Square Stand enables an iPad to become a payment terminal or a full point of sale solution. Square Register combines its hardware and point-of-sale software as well as payments technology. Square Terminal is a portable payments device that accepts various payment types. The company offers a wide range of other products that enable sending, spending, and other sales technologies. SQ has been around since 2009, with its headquarters in San Francisco, California. The company’s IPO was in 2015 when it opened at $11.20 per share. Since then, the stock has traded from a low of $8.06 to a high of $133.81. At the end of last week, SQ was not far off its all-time high. Payment solutions in the post COVID-19 world 9 \"BUY THE DIP\" Growth Stocks For 2020Cash could go the way of retail in a new era of germaphobia that follows the coronavirus. It is likely to be a long time before people in the US, and worldwide, are comfortable enough to return to the previous way of life. As technology continues to change the world, the requirement for cash should decline as credit and debit cards provide safer alternatives. Meanwhile, the increase in the demand for online products precludes the use of currency. The payment solutions offered by SQ will become more popular, and the company could become a target for acquisition over the coming months. The market cap could make it a takeover target At a share price of around $121.41 at the end of last week, SQ had a market cap of below $54 billion. In a world where the leading technology companies have valuations of $1 trillion or even $1.6 trillion, SQ could be a bargain for Apple (AAPL), Amazon (AMZN), Microsoft (MSFT), or any of the other leading cash-rich technology leaders. While SQ has not met consensus earnings estimates over the past four quarters, it has posted earnings in three of the four periods. Source: Yahoo Finance After showing a profit from Q2 through Q4 2019, the loss in Q1 was only two cents per share. The company will report Q2 earnings on August 5, and analysts expect a loss of five cents per share. The market cap and earnings could make the company an attractive target for a takeover that would be accretive rather than dilutive for a far larger tech company. As a part of one of the leaders, the potential for expanding the company’s business could grow exponentially. The trend is your friend, and it is higher The trend in SQ shares makes the stock attractive at the current price level. Source: CQG The chart shows a bullish trend in the stock. After it fell to a low of $32.33 in March 2020 on the back of the risk-off conditions created by coronavirus, SQ came storming back. SQ traded to a new record high at almost $134 in July and was over the $121 level at the end of last week. SQ is a company that is going to continue to gain market share. As takeover bait, we could see one of the leading technology companies pay up to dominate payment and point-of-sale solutions. Want More Great Investing Ideas? 9 “BUY THE DIP” Growth Stocks for 2020 Newly REVISED 2020 Stock Market Outlook 7 “Safe-Haven” Dividend Stocks for Turbulent Times SQ shares fell $0.50 (-0.40%) in premarket trading Tuesday. Year-to-date, SQ has gained 100.72%, versus a 1.17% rise in the benchmark S&P 500 index during the same period."}]}