{"article": [{"url": "https://stocknews.com/news/amzn-wmt-walmart-vs-amazon-which-is-a-better-buy/", "published": 1597838900.0, "headline": "Walmart vs Amazon: Which is a Better Buy?", "body": "Walmart (WMT) vs Amazon (AMZN) are battling for retail supremacy. Amazon is dominant in e-commerce, and Walmart is the king of physical retail. However, as both companies keep getting bigger, they are inevitably starting to clash. Walmart is copying Amazon’s playbook by aggressively investing in its online sales channel, developing its version of Amazon Prime with Walmart+, and making same-day delivery a reality for the bulk of its customers. Amazon is modeling Walmart by investing in physical locations, opening smaller, fulfillment centers around the country, and aggressively moving into groceries with Whole Foods and Amazon Fresh. 7 \"SAFE HAVEN\" Dividend Stocks for Turbulent TimesOne consistent trend in the US is that retail spending increases every year with the population and people’s wealth. Given this and their excellent operations, both companies are likely to continue growing over the long-term. There’s no doubt that Walmart and Amazon are high-quality companies with exciting prospects. Both are rated Strong Buys by the POWR Ratings system. So which stock is a better buy? Bigger Picture The competition between these two companies will intensify in the next decade. Yet, the most likely outcome is that both will thrive due to the insatiable US consumer, their strong management teams, and positioning. In 2019, overall retail spending in the US was $3.77 trillion which was a 5% increase from the previous year and a 50% increase from 2010’s $2.62 trillion. Given the current rate of population growth and Millennials entering their peak consumption years, retail sales are expected to climb by at least 50% over the next decade. Retail Supremacy This means there is going to be plenty of opportunity for growth. While Amazon’s share of retail spending is growing larger, Walmart’s continued success depends on e-commerce. Currently, Amazon’s market cap of $1.7 trillion makes it worth almost five times as Walmart. This is despite Walmart having total revenue of $534 billion over the last 12 months, while Amazon’s total revenue is $322 billion over the last 12 months. One reason that Amazon has a higher valuation is that it is growing sales 40% annually, while Walmart’s sales growth is 4%. Additionally, Amazon has 40% gross margins, while Walmart has 24% gross margins. In terms of retail, Walmart’s US sales were $340 billion, while Amazon had US e-commerce revenue of $122 billion. However, Amazon’s sales are growing three times as fast as Walmart’s. It’s only a matter of time before Amazon’s retail sales exceed Walmart’s given current growth rates. Additionally, while Walmart is a traditional retailer that buys products and then sells them at a profit. Most of Amazon’s sales come through its marketplace, where it serves as an intermediary between buyers and sellers. The company takes a cut of each transaction. It also generates more revenue by providing a variety of back-end services for sellers like managing inventory and fulfillment. This makes Amazon’s business much more “asset-light” than Walmart resulting in greater flexibility and profits. It’s also apparent by another measure – Walmart has a valuation of $380 billion and 2.2 million employees. Amazon has a market cap of $1.7 trillion but only 875,000 employees. Walmart’s E-Commerce Division Amazon beating Walmart is fascinating since Walmart is 32 years older than Amazon. Additionally, Amazon CEO and founder Jeff Bezos intently studied Walmart and was inspired by its success. Now, Walmart is copying Amazon’s playbook, to retain its position as the largest retailer by establishing its footing in e-commerce. Walmart’s efforts have vaulted it to second place in terms of percentage of e-commerce sales, although it lags Amazon by a significant margin. So far this year, Amazon has 38.7% of total online spending in the US, while Walmart has 5.3%. In its last quarter, Walmart’s online sales increased by 97% on a year-over-year basis. Amazon’s online sales increased by 22% in the US, as it further extended its lead. Walmart’s e-commerce platform also follows the marketplace model, where the company earns a cut of every transaction and handles the backend. The major difference is that Walmart is very careful about who it allows to sell on its platform, while Amazon is much more open to sellers. Walmart has 33,000 sellers, while Amazon has 2.5 million sellers. The next step in Walmart’s e-commerce strategy is Walmart+. Based on reports, Walmart+ seems almost identical to Amazon Prime. It will cost $98 for an annual subscription and offer same-day delivery for groceries and store merchandise, discounts on certain items, early access to deals, and the most convenient delivery slots. Walmart’s major asset that Amazon doesn’t have is its 4,000 stores. The company says that it has a location within 10 miles of 90% of the US population. For Amazon, Prime is a loss-leader that pays for itself in customer loyalty and increased transactions. Stock Price Both Walmart and Amazon’s stock have been very strong from the March bottom. Amazon is 1% away from a new, all-time high, while Walmart made a new high following its earnings report on Monday. In recent days, Amazon seems to be emerging from a month-long consolidation, following a more than 100% gain off its bottom. Walmart is 35% off its lows and has broken higher from a four-month consolidation pattern. Walmart is a value stock with a catalyst in its growing e-commerce division. However, it’s not big or meaningful enough to move the needle. This is evident from its last earnings report in which total sales increased by 4% despite online sales nearly doubling. Its stock was 6% higher in premarket trading but sold off on management’s comments that it could be negatively affected if Congress fails to reach an agreement on extending the CARES Act. Amazon is a better proposition because it already has the booming e-commerce division and Walmart is playing catch-up. It also has its growth catalyst – Amazon Web Services which is bigger than Walmart’s e-commerce division – that has profit margins of 25%, while Walmart has profit margins of 2.5%. Over the last 12 months, Amazon earned $13 billion, while Walmart earned $15 billion. Next year will mark the first year that Amazon will outearn Walmart as it expects to earn $18 billion, while Walmart expects to earn $16 billion. Amazon is five times bigger than Walmart but also growing earnings five times as fast. The one scenario in which Walmart would outperform Amazon is if there would be multiple compression. Multiple compression is unlikely in this environment when the economy is emerging from a recession, the Fed is determined to keep liquidity flowing, and deficits are at record-highs. These are ingredients for multiple expansion. Another factor is that Amazon is one of the first stocks to make new highs from the coronavirus crash. This has happened multiple times since the March 2009 bottom, when it made new highs well in advance of the broader market. Each time it was a harbinger of future gains. We can see this in the monthly chart below in 2009, 2011, 2016, and now, 2020: In hindsight, this relative strength was a meaningful signal of its fundamental strength. It also continued this outperformance for many months. This likely continues the rest of the year and into 2021. Conclusion The key takeaway is that Amazon is growing faster than Walmart. Though Walmart is doing an admirable job in competing with Amazon, Amazon has a big head start in the e-commerce space, in addition to other high-margin businesses like cloud computing. So if you were to pick one of these retail behemoths to invest in, I believe Amazon is a better choice. Want More Great Investing Ideas? The Best of StockNews 3 Possible Directions for the Stock Market from Here 9 “BUY THE DIP” Growth Stocks for 2020 AMZN shares were trading at $3,297.68 per share on Wednesday afternoon, down $14.81 (-0.45%). Year-to-date, AMZN has gained 78.46%, versus a 6.50% rise in the benchmark S&P 500 index during the same period."}]}