{"article": [{"url": "https://stocknews.com/news/psnl-if-shares-of-personalis-trade-above-this-level-expect-a/", "published": 1600776500.0, "headline": "If Shares of Personalis Trade Above This Level, Expect a Breakout", "body": "Shares of Personalis (PSNL) could see a strong move higher soon. That’s because a key resistance level has formed on the stock’s chart. PSNL is a provider of advanced genomic sequencing and analytics solutions to support the development of personalized cancer vaccines and other next-generation cancer immunotherapies. The company received some good news last week as the U.S. Department of Veterans Affairs Million Veteran Program exercised its option to extend PSNL’s existing contract through September 2021 and issued a new order worth up to $31 million. Take a look at the 1-year chart of PSNL below with added notations: 7 \"SAFE HAVEN\" Dividend Stocks for Turbulent Times Chart of PSNL provided by TradingView PSNL has been trending higher ever since its March bottom. However, the stock eventually stalled, as PSNL has now hit the same resistance at $25 (red) on two separate occasions. The $25 area is also a 52-week high for the stock. A solid close above that mark should lead to another leg higher for the PSNL. Therefore a trader could buy the stock on a breakout above that level with a stop order placed under it, to serve as protection. Want to See My Favorite Stock Trades Today? The process I use to select these “Chart of the Day” stocks is just the starting point for what I put in my private portfolio. There I take a deeper dive into the stock market outlook. And determine which sectors are likely to outperform. Then and only then to do I pull the trigger on the most timely trades. If you would like to be notified of my best trades, then just click on the link below to get started! See Christian Tharp’s Top Stock Picks Now Have a good trading day! Christian Tharp, CMT @cmtstockcoach PSNL shares were unchanged in premarket trading Tuesday. Year-to-date, PSNL has gained 116.24%, versus a 2.87% rise in the benchmark S&P 500 index during the same period."}]}