{"article": [{"url": "https://stocknews.com/news/ups-whr-var-amd-4-top-stocks-helping-to-push-the-sp-500-to/", "published": 1597925300.0, "headline": "4 Top Stocks Helping to Push the S&P 500 to All-time Highs", "body": "The S&P 500 reached a record high of $3399.54 yesterday, which means that it has made back its 35% decline following the coronavirus crash. Investors are becoming increasingly confident in the economic recovery. Further, the drop in interest rates and the Fed’s forward guidance that rates will remain low until the end of next year have been supportive as well. Stock prices are also forecasting improvements in the country’s health situation which would lead to continued gains for corporate profits. This is clear from analysts projecting that by the fourth quarter, the S&P 500’s earnings will start returning to their previous trajectory. However if the health situation deteriorates, then stocks could take a nasty tumble. This is the major risk to the bull case. 7 Best ETFs for the NEXT Bull MarketOn the other hand, these new highs could mark the beginning of a new bull market. The strength in the S&P 500 also indicates that Wall Street is doing a better job of navigating this crisis than Main Street. Some stocks in the S&P 500 such as United Parcel Service, Inc. (UPS), Advanced Micro Devices (AMD), Varian Medical Systems (VAR), and Whirlpool (WHR) have been very strong over the past few weeks and have pushed the index to new highs. United Parcel Service, Inc. (UPS) The coronavirus caused a surge in e-commerce sales which has benefitted UPS. In the second quarter, UPS reported a rise in ground freight volume of 25%. This trend is likely to continue in the near-term. Over the long-term, e-commerce will continue to account for a larger portion of overall retail spending. In the last month, UPS delivered a 35% return. The stock is 50% higher from its pre-coronavirus price levels. For the quarter ended June 30th, the company delivered a positive earnings surprise of 99%. How does UPS stack up for the POWR Ratings? A for Trade Grade A for Buy & Hold Grade B for Peer Grade A for Industry Rank A for Overall POWR Rating You can’t ask for better. The stock is also ranked #1 out of 9 stocks in the Air Freight & Shipping Services industry. Advanced Micro Devices (AMD) AMD has been experiencing solid momentum. In the last month, AMD has added more than 41% to its price. AMD’s performance has been driven by key developments in its business, such as forays into server processors. AMD has also benefited from rival Intel’s (INTC) manufacturing issues and the deferring of Intel’s 7nm chip to 2023/2024. AMD recently launched a budget chipset called the A520 which could lead to an increase in market share for the company. AMD’s earnings surprise history is impressive as well with the stock beating or meeting the consensus EPS estimates in each of the trailing four quarters. It’s no surprise that AMD is rated “Buy” in our POWR Ratings system. It also has an “A” for Trade Grade and Industry Rank. Within the 86-stock Semiconductor & Wireless Chip industry, it is ranked #24. Varian Medical Systems (VAR) VAR designs and manufactures medical devices and software for the treatment of cancer in addition to other health conditions. The company primarily operates in Oncology Systems and Imaging Components. The company is in talks to be acquired by Siemens Healthineers at a price tag of $16.4 billion, which has pushed its stock price higher. This deal could lead to greater synergies for the company since it will enable it to provide more holistic cancer treatment products. For the last month, the company witnessed a rise in stock prices of 33.6% helping the momentum of the S&P 500. VAR delivered an earnings surprise of 50% for the quarter ended June 2020. VAR’s strong fundamentals are reflected in its POWR Ratings, it has a “Strong Buy” rating with an “A” in Trade Grade, Buy & Hold Grade, and Peer Grade. Within the Medical Devices & Equipment industry, it’s ranked #7 out of 136 stocks. Whirlpool (WHR) WHR manufactures and sells home appliances and related products globally. The company’s main offerings include washing machines, refrigerators, dishwashers, and so on. The company has been performing well despite challenges posed by the coronavirus. WHR saw a marked increase in demand in June, and this recovery is expected to continue. Strength in housing means more demand for appliances. WHR reported EPS of $2.15 for the quarter ended June 2020, beating the Street estimate by 115%. WHR has beaten consensus EPS estimates in each of the trailing four quarters. In the last month, the stock price of WHR soared 27.7% on the back of strong quarterly results. It’s no surprise that WHR is rated “Strong Buy” in our POWR Ratings system. It also has an “A” for Trade Grade, Buy & Hold Grade, Peer Grade, and Industry Rank. In the 68-stock Home Improvement & Goods industry, it is ranked #6. Want More Great Investing Ideas? The Best of StockNews 2 Step Process to Sell @ Market Top in September 9 “BUY THE DIP” Growth Stocks for 2020 UPS shares were trading at $160.03 per share on Thursday afternoon, down $0.31 (-0.19%). Year-to-date, UPS has gained 39.51%, versus a 5.98% rise in the benchmark S&P 500 index during the same period."}]}