{"article": [{"url": "https://stocknews.com/news/avlr-apps-rpay-3-lesser-known-technology-stocks-analysts-love/", "published": 1599221300.0, "headline": "3 Lesser-Known Technology Stocks Analysts Love", "body": "Technology stocks have led the market for good reason. Companies are seeing huge increases in demand due to the increasing digitalization of the economy. Economic activity in many sectors is depressed with the overflow benefitting tech. In many sectors, earnings are down between 20 – 40%, however, in tech, they’re up by similar margins. In some way, every company has become a tech company, as they must invest in software, IT, and cloud systems to remain competitive. While the big tech stocks have made major moves, there are some lesser-known stocks, loved by analysts, that offer intriguing upside. Avalara, Inc. (AVLR), Digital Turbine, Inc. (APPS) and Repay Holdings Corp. (RPAY) should continue moving higher into the end of the year. 7 Best ETFs for the NEXT Bull MarketAvalara, Inc. (AVLR) AVLR provides transaction tax compliance cloud-based solutions for all sized businesses worldwide. It operates through two segments – Subscription and returns, and Professional services. The company offers a suite of solutions that enable businesses to address the complexity of transaction tax compliance and process transactions in real-time. With a year-to-date gain of 73%, AVLR closed yesterday’s trading session at $126.9. Ten out of ten Wall Street analysts have a “Strong Buy” rating on this stock. The average price target of $147.1 is 15.9% higher than its yesterday’s closing price. AVLR posted a strong second quarter as the company delivered total revenue of $116.5 million, up 28% from the year-ago period. Subscription and returns revenue came in $108.5 million, up 28% from the same period last year. Professional services revenue was $8.0 million, up 27% year-over-year. It delivered a gross margin of 71.4% and generated $8.17 million as cash from operations. The company reported a negative EPS of $0.13 for the quarter, improving significantly from the year-ago negative EPS of $0.20. The accelerating growth of e-commerce and broader adoption of cloud-based solutions is increasing the need for regulatory compliance enforcement. As a result, the global demand for compliance automation is continuously growing, Hence, the market expects the company’s EPS to grow 76.5% next year. Moreover, the company has recently announced a follow-on public offering of its common share worth $500 million, which should give it financial flexibility. How does AVLR stack up for the POWR Ratings? A for Trade Grade B for Buy & Hold Grade B for Peer Grade B for Industry Rank B for Overall POWR Rating. It is also ranked #26 out of 186 stocks in the Financial Services (Enterprise) industry. Digital Turbine, Inc. (APPS) APPS provides unique software platforms and solutions for mobile operators and advertisers. It is uniquely positioned for growth as the pandemic has contributed significantly to its primary business of brokering advertisements on smartphones. Its technology platform has been adopted by more than 40 mobile operators and OEMs. Six out of six Wall Street analysts have a “Strong Buy” rating on the stock with the consensus price target of $23.8. The stock has already gained more than 238% year-to-date and is trading 14% below its all-time high of $28.14. APPS reported a top-line of $59 million for its fiscal first quarter ended June 2020, indicating a 93% increase year-over-year. It delivered a gross margin of 44.3%. The company’s Application Media software was installed on more than 43 million devices during the quarter and has been installed on more than 450 million devices so far. Net income improved significantly to $9.94 million compared to the year-ago loss of $1.82 million. EPS for the quarter came in at $0.13, beating the consensus estimate by 44.4%. The company has recently launched its first cross-sell opportunity from the Mobile Posse, Inc. acquisition it made earlier this year, hence, the street remains optimistic about the potential to capitalize on additional opportunities as the year progresses. The EPS is estimated to grow 130% in the current year to $0.46. As per our POWR Ratings, APPS is a “Strong Buy”. It holds an “A” in Trade Grade, Buy & Hold Grade, and Industry Rank. It is currently ranked #21 out of 82 stocks in Software – Application industry. Repay Holdings Corp. (RPAY) RPAY provides integrated payment processing solutions to industry-oriented markets. The company offers a range of solutions relating to electronic payment methods, including credit and debit processing, automated clearing house processing, and instant funding. RPAY closed yesterday’s trading session at $24.25, gaining 65.5% year-to-date. Six out of six Wall Street analysts rated RPAY as “Strong Buy.” The stock’s consensus price target of $29.00 is 19.6% higher than its yesterday’s closing price. The stock hit its 52-week low of $10.69 in March and has recovered more than 106% since then. The inclination toward digital payment solutions was evident in RPA’s second-quarter results. Card payment volume increased 63% year-over-year to $3.6 billion. Revenue came in $36.5 million, improving 68% from the year-ago quarter. Gross profit for the quarter also increased 63% year-over-year to $27.8 million. The company generated $0.85 million in cash flow from operations. RPAY has recently announced its partnership with CU*Answers, the 100% credit union-owned, data processing Credit Union Service Organization (CUSO). As an integrated partner, REPAY will enable US-based credit unions to utilize platforms with the ability to streamline processing efficiencies. Moreover, it completed a technology integration with Sage 500, a complete enterprise solution provider, to provide B2B Transactions through APS Payment Platform. RPAY is rated a “Buy” in our POWR Ratings system, consistent with its strong momentum. It holds an “A” in Trade Grade, and a “B” in Buy & Hold Grade, Peer Grade, and Industry Rank. It is ranked #32 out of 156 stocks in the Financial Services (Enterprise) industry. Want More Great Investing Ideas? 7 Best ETFs for the NEXT Bull Market Beware Stocks in September? 9 “BUY THE DIP” Growth Stocks for 2020 AVLR shares were trading at $124.12 per share on Friday afternoon, down $2.78 (-2.19%). Year-to-date, AVLR has gained 69.45%, versus a 8.19% rise in the benchmark S&P 500 index during the same period."}]}