{"article": [{"url": "https://stocknews.com/news/amc-3-reasons-to-buy-amc-entertainment-holdings/", "published": 1598875700.0, "headline": "3 Reasons to BUY AMC Entertainment Holdings", "body": "AMC Entertainment Holdings has more room to gain as US coronavirus cases continue falling. The Federal Reserve’s commitment to low rates allows AMC to weather the storm for longer. High demand for old movies implies moviegoers’ would rush to see new films. Not yet a happy ending – but a positive twist in the plot for AMC Entertainment Holdings (AMC) is certainly on the cards. AMC dropped from the highs but its uptrend remains intact. From the apparent recovery as seen on the share’s chart, there are three good reasons for investors to find encouragement. First, US coronavirus cases have been extending their downtrend. After peaking at around 70,000 daily infections, positive COVID-19 tests are now only around 42,000 and constantly falling. The good news from the health front has several implications for AMC. The lower chances of contracting the disease may encourage some of those worried to spend time in a closed space to step into theaters. It could also allow the company to gradually increase prices – which bottomed at $0.15 in some cases. Assuming the trend continues, capacity at cinemas could also be allowed to rise above 50%, also boosting income. 9 \"BUY THE DIP\" Growth Stocks For 2020The second reason to be optimistic is that many screenings were reportedly sold out. Skeptics pointed to the fact that reduced capacity made it easier to run out of seats, yet the few that entered theaters saw mostly old movies as coronavirus halted production. When new movies come out, they will likely see increased demand, and that could happen sooner than later as America gets back to normal. The third upside driver is a more generalized one. Jerome Powell, Chairman of the Federal Reserve, announced a substantial policy shift – prioritizing full employment at the expense of letting inflation run hot. The practical implication of this change is that the central bank is now committed to keeping interest rates around zero for even longer. Reduced borrowing costs would help AMC Entertainment Holdings weather the current storm and any other potential downturn in the economy. AMC Entertainment Stock AMC dropped on Friday, correcting some of its upward swings and closed the week at $6.30. It remains close to the August close high of $6.50 and not very far from the pre-crash peak of $7.76 recorded in mid-February. The road to reaching the 52-week high peak of $12.13. Support is at around $5.50, which was a battle line last week, followed by $4.75, an early August peak. It is essential to note that the previous dip correctly proved a buying opportunity. AMC shares were trading at $5.83 per share on Monday morning, down $0.47 (-7.46%). Year-to-date, AMC has declined -18.98%, versus a 9.93% rise in the benchmark S&P 500 index during the same period."}]}