{"article": [{"url": "https://stocknews.com/news/etsy-pki-pool-deck-4-top-growth-stocks-to-buy-before-2021/", "published": 1601899700.0, "headline": "4 TOP Growth Stocks to BUY Before 2021", "body": "Growth stocks have outperformed the rest of the market so far in 2020. The SPDR Portfolio S&P 500 Growth ETF (SPYG) has gained 18.7% year-to-date, despite significant challenges posed by the spread of the coronavirus. Many of these stocks may even perform better in 2021, as situations related to Covid-19, the economy and the White House improve. In comparison, the S&P 500 has gained just 3.6% during the same period. This is considered the biggest outperformance of growth stocks since 1979. As uncertainty prevails over the market, it could be wise to invest in some growth stocks at discounted prices before things (hopefully) stabilize in 2021. So take a look at: Etsy, Inc. (ETSY), PerkinElmer, Inc. (PKI), Pool Corporation (POOL), and Deckers Outdoor Corporation (DECK). 7 \"SAFE HAVEN\" Dividend Stocks for Turbulent TimesEtsy, Inc. (ETSY) ETSY operates a platform that allows buyers and sellers to connect both online and offline. Their platform allows marketing of goods in handmade and vintage items, art, supplies, clothing, housewares, bags and purses, and so on. ETSY’s stock has gained 197.1% so far this year. The company’s wholly owned subsidiary, Reverb, recently announced that it is revising its selling fee which would increase further investment in the health of the marketplace. Reverb’s selling fee has been increased from 3.5% to 5%. 12 million new shoppers joined ETSY’s platform during the second quarter of the year, fueled by the circumstances caused by the spread of the coronavirus. The company has reported a 146% increase in gross merchandise sales during the same period. The company’s revenue is expected to grow 83.7% in 2020 and 13.7% in 2021. ETSY’s EPS is estimated to rise 155.3% this year and at a rate of 57% per annum over the next five years. How does ETSY stack up for the POWR Ratings? A for Trade Grade A for Buy & Hold Grade B for Peer Grade B for Industry Grade A for Overall POWR Rating The stock is also ranked #6 out of 57 stocks in the Internet industry. PerkinElmer, Inc. (PKI) PKI provides products and services for the research, environmental, industrial laboratory industries worldwide. The company primarily operates in human and environmental health. PKI’s stock has gained 28.3% so far this year. The company has recently announced that their EONIS screening assay has received approval from the CE-IVD. It allows newborns to be screened for SMA, SCID, and XLA. The company has also introduced the DA 7350 cloud-based software that helps food manufacturers continuously evaluate the quality of the food they produce. Further, PKI is working on the PerkinElmer Signals offerings which will help make scientific workflows more efficient and allow for easier analysis of drug candidates and clinical trial data. The company’s revenue is expected to grow 11.8% in 2020 and 6.4% in 2021. PKI’s EPS is estimated to rise 32.2% this year and at a rate of 16.9% per annum over the next five years. It’s no surprise that PKI is rated a “Strong Buy” in our POWR Ratings system, with a grade of “A” in Trade Grade, Buy & Hold Grade, and Peer Grade. In the 140-stock Medical – Devices & Equipment industry, it is ranked #7. Pool Corporation (POOL) POOL offers swimming pool equipment, supplies, and other related leisure products worldwide. POOL’s stock has delivered returns of 51.9% so far this year. During the second quarter, the company reported record net sales which increased 14% year-over-year. The company’s gross profit increased 13% during the same period. The company strongly benefited from people spending more time at home and reported a growth in demand for its pool-related products. POOL also noted that approximately 60% of the new demand is recurring since several products are meant for maintenance, repair, upkeep, and for chemical rebalancing. The company’s revenue is expected to grow 12.3% in 2020 and 8.9% in 2021. POOL’s EPS is estimated to rise 16.1% this year and at a rate of 17% per annum over the next five years. POOL’s strong fundamentals are reflected in its POWR Ratings, it has a “Strong Buy” rating with a “A” in Trade Grade, Buy & Hold Grade and Peer Grade. In the 33-stock Athletics & Recreation industry, it is ranked #2. Deckers Outdoor Corporation (DECK) DECK designs, distributes, and markets footwear, apparel, and accessories. Their products are marketed through three brands: UGG, Teva, and Sanuk. The stock has gained 40.6% so far this year. The company’s Teva brand is collaborating with outdoor brand Cotopaxi to release a new line of Teva x Cotopaxi products. DECK’s Sanuk brand has recently collaborated with KASSIA+SURF to release a new line of sandals and sneakers. Further, the company’s HOKA brand has announced a multi-year agreement to sponsor the Northern Arizona (NAZ) Elite running team. The company’s revenue is expected to grow 12% in 2022. DECK’s EPS is estimated to rise 21.4% next year and at a rate of 16.3% per annum over the next five years. It’s no surprise that DECK is rated a “Strong Buy” in our POWR Ratings system, with a grade of “A” in Trade Grade, Buy & Hold Grade, and Peer Grade. In the 65-stock Fashion & Luxury industry, it is ranked #4. Want More Great Investing Ideas? Do NOT Buy Stocks Before the Election! 7 “Safe-Haven” Dividend Stocks for Turbulent Times Chart of the Day- See Christian Tharp’s Stocks Ready to Breakout ETSY shares rose $0.14 (+0.10%) in after-hours trading Monday. Year-to-date, ETSY has gained 208.56%, versus a 7.08% rise in the benchmark S&P 500 index during the same period."}]}