{"article": [{"url": "https://stocknews.com/news/vips-jmia-kodk-plce-4-stocks-that-dropped-more-than-20/", "published": 1598270900.0, "headline": "4 Stocks That Have Recently Dropped More Than 20%", "body": "Despite the S&P 500 hitting record highs, certain stocks are significantly underperforming the market due to their inability to adjust their business models to the “new normal”. In fact, some underperforming stocks have recently nosedived due to investors’ disappointment with their latest financial results or other negative developments. Most of us are familiar with the retail woes of many companies due to the coronavirus’s effect on businesses, but other stocks from promising high-growth industries, such as e-commerce, have failed to keep up with their peers. This past week has been especially difficult for Vipshop Holdings, Ltd. (VIPS), Jumia Technologies AG (JMIA), Eastman Kodak Company (KODK), and Children’s Place, Inc. (PLCE). 9 \"BUY THE DIP\" Growth Stocks For 2020Vipshop Holdings, Ltd. (VIPS) VIPS is a Chinese company that provides branded goods at a discount through its online retail portal. VIPS is currently the sixth-largest e-commerce operator in China. The stock lost more than 23% last week. This crash can be attributed to the release of its second-quarter results. Though the company reported revenue growth of 6% year-over-year, it has disappointed investors as other e-commerce players witnessed significantly higher revenues over the same time period. The future performance guidance issued by the company also lacked the strength that investors were expecting. For the third quarter, the company expects revenue to grow between 5% to 10%. How does VIPS stack up for the POWR Ratings? B for Trade Grade C for Buy & Hold Grade B for Peer Grade B for Industry Rank B for Overall POWR Rating The stock is also ranked #19 out of 115 stocks in the China industry. Jumia Technologies AG (JMIA) JMIA is an e-commerce company that focuses on providing logistics and payment services for sellers and consumers. On August 10th, the stock hit a high of $20.7, but since then the stock has been steadily falling and is currently trading at $10. This 50% loss can be attributed to the release of the company’s second quarter results that disappointed investors. The stock lost more than 27% last week. The report released on August 12th reflected a 10% year-over-year decline in revenue. Though the operating loss reduced 43.6% year-over-year, the company is still burning cash at a rate that the market doesn’t like. It is clear that investors have lost faith in this e-commerce company as it failed to report a rise in revenue, despite the favorable market conditions that existed during the second quarter. The company has recently shifted its operations from being a direct retailer to a third-party marketplace. Third-party marketplace revenue increased 38% year-over-year in the second quarter. The shift may be a growth driver, however, for now, the stock has left investors wanting more. JMIA’s weak performance is also reflected in its POWR Ratings, it has a “Sell” rating with a grade of F in Trade Grade and Buy & Hold Grade. Eastman Kodak Company (KODK) KODK provides a diverse range of hardware and software products in the global market. It operates in printing, 3D printing, packaging, and intellectual property sectors. The stock declined more than 22% last week which is part of a broader sell-off for the stock. In the last month, the stock hit a high of $60, but is currently trading at $6.80. KODK was due to receive a loan of $765 million from the US Government as part of the Defense Production Act. This loan was meant to assist KODK in developing a new pharmaceutical business which would help the US in its fight against COVID-19. However, the company is now under investigation by the SEC on possible insider trading charges and misconduct relating to the disclosures about the loan. Investors are disappointed by the turn of events as reflected by its share price movement. In sync with the recent developments at the company, KODK has been accorded an overall POWR Rating of Sell. The company has also been graded an F for Trade Grade and Buy & Hold Grade. KODK is ranked #22 out of 28 stocks in the Technology – Hardware industry. Children’s Place, Inc. (PLCE) PLCE is a children’s clothing company that retails children’s apparel, footwear, and related accessories. Over the course of last week, the stock lost more than 21%. Investor confidence has been falling due to the uncertainty regarding the opening of schools. Most children are taking part in remote education, which could have a significantly negative impact on PLCE’s sales and bottom line. PLCE has not built an effective e-commerce division, which could have helped the company dodge this fall. PLCE, along with other clothing retailers, are expected to report a sharp drop in consumer footfall. PLCE is scheduled to report its second-quarter results on August 25th and the market expects the company to report a loss of $1.14 per share, compared to the year-ago earnings per share of $0.19. PLCE is rated a Strong Sell in the POWR Ratings, along with a grade of F for Trade Grade and Buy & Hold Grade. The company is currently ranked #49 out of 65 stocks in the Fashion & Luxury industry. Want More Great Investing Ideas? The Best of StockNews 2 Step Process to Sell @ Market Top in September 9 “BUY THE DIP” Growth Stocks for 2020 VIPS shares were trading at $17.12 per share on Monday afternoon, down $0.39 (-2.23%). Year-to-date, VIPS has gained 20.82%, versus a 7.32% rise in the benchmark S&P 500 index during the same period."}]}