{"article": [{"url": "https://stocknews.com/news/msft-unh-jpm-dis-4-stocks-with-double-digit-dividend-growth/", "published": 1602072500.0, "headline": "4 Stocks with Double-Digit Dividend Growth", "body": "With continued pandemic-related uncertainty in the economy, market volatility ahead of the presidential election, and lower consumer spending, this is a difficult time to invest. While one could benefit from the intraday volatility now, investing in stocks for the long-term requires a different approach. Investing in healthy stocks that pay attractive dividends could work as a defensive investment strategy now. Several companies have a long history of paying dividends and also increasing their dividend payouts. Of these stocks, the ones with fundamental strength could be solid long-term investments. A steady increase in dividend payouts indicates profitability and strength in business models, which usually translates into stable price appreciation. Microsoft Corporation (MSFT), UnitedHealth Group Incorporated (UNH), JP Morgan Chase & Co. (JPM), and The Walt Disney Company (DIS) have grown their dividend payouts in double-digits, and are well-positioned to soar in the future based on the strength of their underlying fundamentals. 7 Best ETFs for the NEXT Bull MarketMicrosoft Corporation (MSFT) MSFT has been growing at a quick pace under the leadership of its CEO Satya Nadella. The company has expanded into the high-growth cloud services space through its Azure platform. MSFT has delivered year-to-date price returns of 30.5%. The company recently announced the acquisition of ZeniMax Media, which owns Bethesda Softworks, one of the leading game development and publishing companies in the world. Over the last six years, MSFT has returned more capital through dividends than 98.4% of US stocks that are currently paying dividends in the StockNews.com universe. The company pays an annual dividend of $2.04, which translates to a dividend yield of 0.99%. The 4-year average dividend yield for the company is 1.68%. In 2019, the company changed its quarterly dividend payout from $0.46 to $0.51, which marked a growth of 10.9%. MSFT’s dividends grew at a CAGR of 10.5% over the last five years. The company’s revenue is expected to grow 9.6% in 2021 and 11.5% in 2022. MSFT’s EPS is estimated to rise 12.3% this year and at a rate of 15.25% per annum over the next five years. How does MSFT stack up for the POWR Ratings? B for Trade Grade B for Buy & Hold Grade B for Peer Grade B for Industry Grade B for Overall POWR Rating The stock is also ranked #19 out of 96 stocks in the Software – Application industry. UnitedHealth Group Incorporated (UNH) UNH operates as a health and well-being company. The company runs the Optum and UnitedHealthcare business platforms. UNH’s stock has gained 6.96% so far this year. The company has announced its plans to sell its Medicare Advantage healthcare plan in nearly 300 new counties next year. UNH is also in talks to acquire pharmacy startup DivvyDose. Over the last six years, UNH has issued more dividends than 96% of US dividend paying companies in the stockNews.com universe. The company currently issues an annual dividend of $5, which translates into a dividend yield of 1.57%. The 4-year average dividend yield for the company is 1.44%. In 2020, the company increased its quarterly dividend from $1.08 to $1.25 per share, which marked a growth of 15.74%. UNH’s dividends grew at a CAGR of 24.1% over the last five years. The company’s revenue is expected to grow 5.6% in 2020 and 8.8% in 2021. UNH’s EPS is estimated to rise 9.6% this year and at a rate of 12.7% per annum over the next five years. It’s no surprise that UNH is rated a “Strong Buy” in our POWR Ratings system, with a grade of “A” in Trade Grade, Buy & Hold Grade, and Peer Grade. In the 9-stock Medical – Health Insurance industry, it is ranked #1. JPMorgan Chase & Co. (JPM) JPM provides financial services globally. The company operates in four segments: commercial banking, asset management, investment banking, and consumer and community banking. The company’s stock has gained approximately 24% since hitting its low in mid-March. JPM has entered into a strategic agreement with fintech company Affinity Capital Exchange. This new partnership will allow JPM to offer clients an innovative way to secure loyalty financing through using standardized loyalty points called Royalty Points. The company has also partnered with 55ip to provide a tax-efficient way for clients to transition into JPM’s model portfolios. Over the last six years, JPM has returned more capital through dividends than 98.2% of US stocks that are currently paying dividends in the StockNews.com universe. The company pays an annual dividend of $3.6, which translates to a dividend yield of 3.6%. The 4-year average dividend yield for the company is 2.57%. The company has increased its quarterly dividend in 2019 from $0.8 to $0.9, which is an increase of 12.5%. JPM’s dividends grew at a CAGR of 16.2% over the last five years. In the quarter that ended June 2020, the company recorded an earnings surprise of 32.7%. Over the last five years, the company’s EPS has recorded a growth rate of 15.4%. JPM has a “B” for Peer Grade in our POWR Ratings system. In the 10-stock Money Center Banks industry, it is ranked #3. The Walt Disney Company (DIS) DIS has entered the content streaming space through Disney Plus. The company now owns popular brands such as Marvel, Star Wars, and Pixar. Despite significant challenges posed by the spread of the coronavirus, DIS’s stock has gained approximately 40.6% since hitting lows in mid-March. DIS is currently innovating its loyalty program and has partnered with Oracle CloudTwist in an effort to directly reach its consumers. The company plans to reopen several of its hotels and resorts by the end of the year. DIS has a dividend yield of 0.73%. The 4-year average dividend yield for the company is 1.42%. Even though the company suspended its semi-annual dividend payment in May this year due to uncertainty caused by the coronavirus, the company has a history of consistently paying dividends every year since the 1950s. In the last five years, the company has delivered an average dividend growth rate of 10.4% per year. The company’s revenue is expected to grow 9.5% in 2021. DIS’s EPS is estimated to rise 67.1% next year and at a rate of 1.95% per annum over the next five years. DIS has an “A” for Peer Grade in our POWR Ratings system. In the 14-stock Entertainment – Sports & Theme Parks industry, it is ranked #1. Want More Great Investing Ideas? 7 Best ETFs for the NEXT Bull Market What is the Cure for Stock Market Volatility? Chart of the Day- See Christian Tharp’s Stocks Ready to Breakout MSFT shares were trading at $207.75 per share on Wednesday afternoon, up $1.84 (+0.89%). Year-to-date, MSFT has gained 32.79%, versus a 6.80% rise in the benchmark S&P 500 index during the same period."}]}