{"article": [{"url": "https://stocknews.com/news/panw-zs-qlys-ftnt-four-cybersecurity-stocks-for-july/", "published": 1593605300.0, "headline": "Four Cybersecurity Stocks for July", "body": "The coronavirus has destroyed many parts of the economy, but a big winner of the disruption is cybersecurity stocks. This is due to the increase in remote work by many companies to avoid exposure of their employees to the virus. Of course, this has increased security risks that companies need to guard against. Even before this development, corporate spending on cybersecurity was exploding especially with the rise of cloud computing. For example, total corporate spending on cybersecurity was $37 billion in 2018 and is expected to cross $42 billion this year. This doesn’t include spending by state, local, and the federal government. 7 \"SAFE HAVEN\" Dividend Stocks for Turbulent TimesMore data and processes that are integral to a company’s operations are taking place in real-time in the cloud. As the cloud’s importance grows, companies must spend more. Therefore, the coronavirus is an accelerant of this trend. Home networks and personal devices that are now being widely used for work are less secure than office networks. Confidential data is increasingly under attack. These are the 4 of the strongest cybersecurity stocks: Palo Alto Networks Inc. (PANW) PANW has been a leader in cybersecurity due to its successful track record of innovation. The company’s three-month price return stands at 38.7%, and the stock may continue to rally into July given the growth of the sector, and PANW’s leading position. PANW has thrived by continually introducing new, useful products. Recently, it debuted PRISMA ACCESS which is designed for remote workers. It also launched a Next Generation Firewall (NGFW) which is enmeshed with machine-learning tools. This intuitive firewall intelligently detects and prevents threats, recommends new security policies, and makes Internet-of-Things devices safer to use. POWR’s POWR Ratings is consistent with its stock price’s strong performance and successful product launches with a “Buy” rating. It has an “A” in Trade Rank and a “B” grade for Peer Rank, Buy & Hold Grade, and Industry Rank. Within the Software – Security group, it’s ranked #5 out of 23. Fortinet Inc. (FTNT) This Sunnyvale, California-based company makes network security appliances. It provides Unified Threat Management security solutions to government organizations, corporations, and service providers. FTNT competes with PANW in providing Next Generation Firewall services and is one of the leading providers of VPN services. It’s also the first security provider to enable an SD-WAN feature in their NGFW offering. The stock price for FTNT has increased by 28.58% year-to-date. Over the past 12 months, FTNT is 75.74% higher. Its chart below shows its strong gain following the March lows to new highs. Since then, it’s been consolidating between $130 and $150. (source: finviz.com) FTNT has an overall POWR rating of Buy. It’s graded “A” in Trade Grade and “B” in Buy & Hold, Peer Grade, and Industry Rank. Among cybersecurity stocks, it’s ranked #6 out of 26. Zscaler Inc. (ZS) Zscaler is a network security firm that specializes in cloud technology. ZS has returned an impressive 135.5% since the beginning of the year. In June, the firm entered into a contract with the US Department of Defence (DoD) to provide secure cloud management solutions. Its twin offerings, Zscaler Internet Access (ZIA) and Zscaler Private Access (ZPA) are highly versatile and capable of protecting data across several distinct cloud environments. ZPA was accorded FedRAMP high authorization, the first cloud service to obtain this distinction. It was the first such cloud service to obtain it. (source: finviz.com) ZS has been one of the strongest stocks in the market with a more than 200% gain off the March lows. In June, it’s been consolidating in a sideways pattern with a pattern of higher highs and higher lows. The stock is very strong on a fundamental and technical basis. This strength is confirmed by its POWR Ratings which gives it a “Strong Buy”. It’s an “A” for Trade Grade, Buy & Hold Grade, and Peer Grade with a “B” for Industry Rank. Among cybersecurity stocks, it’s #1 out of 23 stocks. Qualys, Inc. (QLYS) Qualys provides cloud security solutions to its customers. One of its more popular offerings is its Remote Endpoint Protection. It offers a sixty-day free trial and has had remarkable success in converting free users into paid users. Like some big winners in stock market history, it has a consistent track record of beating estimates and raising guidance. In the next year, it expects to grow sales by 15% and earnings by 43% while maintaining gross margins above 70%. QLYS is rated “Buy” by the POWR Ratings. It has a “B” for Trade Grade, Buy & Hold Grade, and Peer Rank. Among cybersecurity stocks, it’s ranked #7 out of 23. Want More Great Investing Ideas? 9 “BUY THE DIP” Growth Stocks for 2020 Is the Bull S#*t Rally FINALLY Over? 7 “Safe-Haven” Dividend Stocks for Turbulent Times Top 3 Investing Strategies for 2020 PANW shares rose $0.31 (+0.14%) in after-hours trading Wednesday. Year-to-date, PANW has declined -0.82%, versus a -2.53% rise in the benchmark S&P 500 index during the same period."}]}