{"article": [{"url": "https://stocknews.com/news/pton-will-peloton-continue-to-soar-in-2021/", "published": 1601554100.0, "headline": "Will Peloton Continue to Soar in 2021?", "body": "Peloton Interactive Inc. (PTON) is a retail manufacturer of fitness equipment. Its services include connected fitness subscriptions for access to live interactive workout platforms. PTON gained widespread popularity internationally since the onset of the pandemic, as the lockdown forced people to work out indoors. As people have become accustomed to life under the new normal, the new trend of virtual workouts is expected to continue. In fact, even with the gradual reopening of gyms and other fitness centers in most regions, a recent survey conducted by TD Ameritrade revealed that 59% of people are unlikely to renew their gym membership post COVID. PTON witnessed a record surge in its subscription memberships this year, and currently has over 1.3 million paid subscribers. PTON’s unique business model and first mover advantage allowed it to gain more than 245% year-to-date. On April 22nd, the company hit a record of 23,000 people streaming a single live workout class. This impressive performance combined with several other factors has helped PTON earn a “Strong Buy” rating in our proprietary rating system. 9 \"BUY THE DIP\" Growth Stocks For 2020Here’s how our proprietary POWR Ratings system evaluates PTON: Trade Grade: A PTON is currently trading above its 50-day and 200-day moving averages of $76.75 and $46.83, respectively, indicating a golden cross uptrend. The stock has gained 71.8% in the past three months, reflecting a solid short-term bullishness. PTON’s subscription services gained popularity amid the pandemic, as the lockdowns forced people to exercise at their homes. For the fiscal fourth quarter ended August 2020, PTON’s ending connected fitness subscriptions grew 113% year-over-year to over $1.09 million, while digital subscriptions grew 210% from the year-ago value to over 316,800. Connected fitness subscription workouts increased 333% year-over-year to 76.80 million. Total revenue increased 172% year-over-year to $607.10 million, while gross profit rose 188% from the same period last year to $288.80 million. PTON generated $89.10 million in net income this quarter, indicating a significant improvement over the net loss of $47.40 million reported during the same period last year. PTON introduced a new product suite with Bike+ and treadmills on September 8th. Priced lower than the average market price, this product offers an effective at-home fitness experience to individuals worldwide. It also formed Peloton Health and Wellness Advisory Council, to study and analyze the physical, mental and emotional wellbeing of its members worldwide. Buy & Hold Grade: A In terms of proximity to 52-week high, which is a key factor that our Buy & Hold Grade takes into account, PTON is well-positioned. It is currently trading just 3.5% below its $52-week high of $102.83, which it hit on September 29th. PTON has gained more than 295% in the past year, which can be attributed to its solid revenue growth. Its revenue grew 99.6% in the trailing 12-months. PTON went public in September 2019, at an IPO of $29 per share. The stock more than tripled in just a year’s time. Peer Grade: A PTON is ranked #5 out of 34 stocks in the Consumer Goods industry. Other stocks in this industry include Procter & Gamble Company (PG), Unilever NV (UN), and Colgate Palmolive Company (CL). PG, UN and CL gained 13.4%, 7.7% and 14.1% year-to-date, respectively, versus PTON’s 249.4% returns over the same period. Industry Rank: A The Consumer Goods industry is ranked #12 out of 123 industries in the StockNews.com universe. The retail sales recovery in the fiscal third quarter combined with lower employment and reopening of businesses bodes well for this industry, as overall revenue is on the rise. Also, the consumer goods industry has demonstrated impressive performance during the peak coronavirus crisis throughout global lockdown, as it adapted online sales and delivery techniques over the span of a few months. Also, this industry is expected to witness rising demand in the upcoming months, as consumer spending is likely to shift away from the travelling and other outdoor expenses due to social distancing. The fitness industry has adapted to live interactive exercising during quarantine, and has gained popularity among the masses. Overall POWR Rating: A (Strong Buy) PTON has a “Strong Buy” rating due to its short- and long-term bullishness, impressive past performance, and underlying industry strength, as determined by the four components of our overall POWR Rating. Bottom Line PTON is expected to rally throughout the remainder of 2020 as well as next year due to its solid growth momentum and favorable analyst sentiment. PTON has an average broker rating of 1.21, reflecting favorable analyst sentiment. Out of 26 Wall Street analysts that rated the stock, 20 rated it “Strong Buy.” The consensus EPS estimate of $0.11 for the quarter ending September 2020 indicates significant improvement from negative EPS reported in the prior-year quarter. The consensus revenue estimate of $747.68 million for the quarter indicates a 279.8% growth year-over-year. Want More Great Investing Ideas? Do NOT Buy Stocks Before the Election! 7 “Safe-Haven” Dividend Stocks for Turbulent Times Chart of the Day- See Christian Tharp’s Stocks Ready to Breakout PTON shares were trading at $104.43 per share on Thursday afternoon, up $5.19 (+5.23%). Year-to-date, PTON has gained 267.71%, versus a 6.23% rise in the benchmark S&P 500 index during the same period."}]}