{"article": [{"url": "https://stocknews.com/news/shop-jd-tgt-w-ride-the-ecommerce-train-to-riches-with-these-4-high-flying/", "published": 1599739700.0, "headline": "Ride the \"Ecommerce Train\" to Riches With These 4 High-Flying Stocks", "body": "One of the big winners of the coronavirus-economy has been e-commerce. It’s apparent from their earnings report which shows that they have achieved many years of growth in a couple of quarters. The stocks are also at 52-week highs, and they have increased their forecasts for upcoming quarters. &nbsp This trend isn’t likely over especially as younger people prefer to shop and browse online. Many companies are positioned to take advantage of these changes in how people shop, and investors should consider accumulating shares on weakness. &nbsp Below, we provide a look at four of the more intriguing e-commerce stocks: Shopify (SHOP), JD.com (JD), Target Corporation (TGT), and Wayfair (W). &nbspShopify (SHOP) Shopify’s intuitive e-commerce platform facilitates the creation of a web-based presence for merchants of varying types and sizes. From online storefronts to order payment, fulfillment, and even shipping, SHOP lends invaluable assistance with nearly every aspect of online business. The POWR Ratings show SHOP has A grades in the Peer Grade and Trade Grade POWR Components. SHOP is the top-ranked stock of 34 in the Internet – Services space. The top analysts insist SHOP has a fair price target of $1,111.46. If SHOP reaches this price target, it will have increased by nearly 20%. 7 \"SAFE HAVEN\" Dividend Stocks for Turbulent TimesSHOP’s massive customer base pays a subscription-based fee for affordable plans. Most of these customers are small businesses, the likes of whom will continue to transition to and remain on the web as consumers veer away from conventional brick-and-mortar stores that require face-to-face interactions. SHOP simply has no ceiling. This is a must-own e-commerce stock for every investor. JD.com (JD) As the second-largest e-tailer in China, JD serves as a middleman between companies and consumers and also transmits goods straight to consumers. The POWR Ratings reveal JD has A grades in the Trade Grade and Peer Grade POWR Components. JD is also ranked in the top 10 of 115 China stocks. The average analyst price target for JD is $80.38, indicating the stock has nearly a 5% upside. JD is one of the few stocks that did not suffer a significant setback as a result of the nearly market-wide selloff this past March. Rather, JD has steadily moved upward, popping quite nicely this past month, jumping from the below $60 to nearly $80 per share. It is important to note JD still has a fairly reasonable forward P/E ratio of around 50 for a tech stock in a seemingly unbeatable sector. In other words, JD has plenty of additional room for continued ascension. Target Corporation (TGT) It was not long ago when Target was primarily a brick-and-mortar business. Nowadays, TGT is omnichannel. TGT has a superb website, mobile app, and in-store experience. TGT’s brass was quite savvy when acquiring Shipt, allowing for the same-day delivery of home-related items, groceries, electronics, and essentials. The POWR Ratings show TGT has A grades in its POWR Component categories but for its POWR Component of Peer Grade in which it still grades out well at a B. TGT is ranked third of 18 stocks in the Grocery/Big Box Retailers space. Though TGT has had a nice run of late, the analysts insist it has even more room for upward movement, setting an average price target of $164.68 for the stock. Do not be concerned by the fact that TGT rapidly dropped from its price of $155 a couple of weeks back. The sudden drop is nothing but profit-taking. This is a “buy and hold” stock that should perform quite well in the years and decades ahead. Wayfair (W) W is one of the world’s top web-based sellers of products ranging from home décor items to furniture and home goods. In short, if you need something for your home, you will likely find it on W’s website at a reasonable price. W has solid POWR Ratings Components across the board. The stock is ranked 12th of 34 in the Specialty Retailers segment. If you are hesitant to pull the trigger on an investment in W, look no further than the analysts’ take on this superstar company. The top analysts insist W will not be fairly priced until it reaches $311.35 per share, indicating it has more than 21% upside remaining. W’s active customer base is up nearly 50% this year alone. Plenty of these new additions will remain long after the pandemic ends. W should reach profitability at some point this year. When stocks transition from the red to the black, investors take notice, scoop up more shares, and boost the price all the more. W just might break through $300 by the end of 2020. Want More Great Investing Ideas? 7 Best ETFs for the NEXT Bull Market Will Stocks Fall into Historical September Slump? 9 “BUY THE DIP” Growth Stocks for 2020 "}]}