{"article": [{"url": "https://stocknews.com/news/hd-low-xyl-gnrc-expect-a-busy-hurricane-season-4-stocks-that-will/", "published": 1597234100.0, "headline": "Expect a Busy Hurricane Season - 4 Stocks that Will Benefit", "body": "Hurricane season is here, and the National Oceanic and Atmospheric Administration’s Climate Prediction Center is forecasting a 60% chance of an above-normal season. Though hurricanes are certainly depressing and costly, there is a silver lining. The destruction caused by hurricanes is somewhat of a latent economic stimulus. The little-discussed truth is the money spent to rebuild homes and businesses stimulates economic activity and growth. If hurricane forecasts prove accurate, coastal areas will be inundated with powerful winds and rain in the months ahead, befitting the following four stocks: Home Depot (HD), Lowe’s Companies (LOW), Xylem (XYL), and Generac Holdings (GNRC). 7 \"SAFE HAVEN\" Dividend Stocks for Turbulent TimesHome Depot (HD) Homeowners and business owners in hurricane-prone areas will head out to HD before the storms’ arrival and after the storm ends. HD sells just about everything property owners need to brace for the impact of hurricanes and bounce back in their aftermath. From building materials to home improvement items, home décor, lawn/garden products, and beyond, HD sells it all. Check out HD’s POWR Ratings, and you will find A grades across the board. HD also has an industry rank of #1 out of nearly 70 publicly traded companies in the Home Improvement & Goods space. Review the analysts’ take on HD, and you will find that 15 analysts rate the stock a Buy and 6 rate it a Hold. None advise selling HD at this time. With a reasonable forward P/E ratio of 27.01, HD could be worthy of your hard-earned investing dollars at its current trading price of $277. Lowe’s Companies (LOW) Whether those in hurricane-affected areas are looking to embrace DIY projects or have a company do the work for them, they will enjoy plenty of assistance form the home improvement gurus at LOW. As one of the top home improvement retailers globally, LOW provides services and products to residential property owners and commercial businesses. The POWR Ratings reveal LOW has As in every POWR Component. LOW also has an industry rank of 2nd out of 66 Home Improvement & Goods stocks. Out of 21 analysts who have reviewed LOW, 20 rate it as a Buy, one rates it as a Hold, and zero advise selling. Add in the fact that LOW has a reasonably low forward P/E ratio of 22.52, and it is easy to understand why the investment professionals are so bullish on this stock. Do not assume you missed LOW’s ride to the top. Though LOW is currently trading around its 52-week high, there is a chance it will continue to ascend while even more, fantastic quarterly earnings reports roll in as hurricane season plays out. Xylem Inc. (XYL) Water has the potential to prove quite problematic in the aftermath of a hurricane. Water must be tested, treated, and transported to ensure it is safe for use. Furthermore, wastewater must be returned to the environment. XYL provides these services and more in its whole water-process cycle. The POWR Ratings show XYL has an A Trade Grade, a B Buy & Hold Grade, and a rank in the top third of Industrial – Manufacturing stocks. Add in XYL’s opportunity for growth through its smart advanced infrastructure analytics that boosts network efficiency, and you have quite an intriguing investment opportunity. Generac Holdings (GNRC) Just about everyone who lives in a hurricane-prone area has thought about buying a generator. Plenty of homeowners and business owners in these areas have already purchased a generator. GNRC generators are fueled by gasoline, liquid propane, natural gas, Bi-Fuel, and diesel. The POWR Ratings show GNRC has A grades in every POWR Component, but its Buy & Hold Grade, which is a B. GNRC is ranked 13th out of nearly 60 Industrial – Machinery stocks. The panic induced by the pandemic combined with a foreboding hurricane forecast makes GNRC a must-own. Do not shy away from this stock simply because it is nearing its 52-week high of $179 and change. The rising level of uncertainty sets the stage for the sale of even more GNRC generators in the months ahead. Buy this stock, hold it until its third or fourth-quarter earnings are released, and you could make a tidy profit. Want More Great Investing Ideas? 3 Possible Directions for the Stock Market from Here How to Trade THIS Stock Bubble? 9 “BUY THE DIP” Growth Stocks for 2020 HD shares were trading at $280.45 per share on Wednesday morning, up $5.53 (+2.01%). Year-to-date, HD has gained 30.05%, versus a 5.91% rise in the benchmark S&P 500 index during the same period."}]}