{"article": [{"url": "https://stocknews.com/news/fcel-fuelcell-energy-a-buying-opportunity-or-time-to-sell/", "published": 1600430900.0, "headline": "FuelCell Energy: A Buying Opportunity or Time to Sell?", "body": "FuelCell Energy (FCEL) has come under renewed selling pressure, trading toward the lower of the range. Previous downward moves resulted in significant bounces for the promising company. FuelCell Energy’s disappointing earnings report may turn the recent slide to a more substantial fall. FCEL has been on the back foot in recent days, falling by 1.6% on Thursday with an ongoing slide as investors are still reeling from the recent earnings report. The Danbury, Connecticut-based energy firm reported a loss of $0.06 per share, worse than the Wall Street average of $0.07. While topline sales neared $19 million in the past quarter – exceeding estimates – that was insufficient to convince more buyers to jump in. That may be due to the fact that it represents a drop of 18% year-over-year from 2019. The company continues bleeding cash, and one of the alarming metrics is a -70% return on equity figure. Back in June, FCEL sold $75 million in shares, giving it some breathing room. Nevertheless, FCEL’s significant investment has yet to shore up its finances. 7 \"SAFE HAVEN\" Dividend Stocks for Turbulent TimesHopes were high that the company’s promising hydrogen fuel cell technology would be used by makers of electric or hybrid cars. However, even Nikola (NKLA) – which also had its share of wild market rides – seems hesitant about endorsing FuelCell Energy’s technology. FCEL skeptics may point to the competition as another reason to abandon the firm. Plug Power (PLUG) recently announced a promising new technology – the lightweight 1kW fuel cell, which can be used in autonomous cars and also in drones. Overall, until the company is able to tell another story – such as boasting a lucrative deal or obtaining new investment – fundamentals for FCEL are pointing lower. With all that said, it is essential to note that FuelCell Energy has been around since 1969 and has been able to evolve. Moreover, an examination of recent price action seems to be offering a buying opportunity. As the chart shows, FCEL dropped towards the psychologically significant $2 level three times since early July. After each fall, the equity found new love and rose to above $3. Each fluctuation with this rough $1 range has been different. Is the recent slide a sign that a rally is coming? Also here, there is another way to examine the charts. The mid-August dip bottomed out at a higher point than the previous one. That was encouraging news for bulls, which benefited from a rally from the lower high to a higher high. On the other hand, the September slump already resulted in a lower point than the previous one, creating a lower low and a favorable environment for the bears. Moreover, the price action in mid-September casts doubts if another attempt to hit $3 is feasible. Another technical aspect is FCEL’s failure to break above the 52-week high of $3.50 achieved back in June, while broader equity markets were rallying throughout August, reaching record highs. Technicals do provide hope for another run higher, but the picture is far from being 100% bullish. FCEL shares were trading at $2.57 per share on Friday afternoon, up $0.11 (+4.47%). Year-to-date, FCEL has gained 2.39%, versus a 3.60% rise in the benchmark S&P 500 index during the same period."}]}