{"article": [{"url": "https://stocknews.com/news/kr-pton-chwy-zs-4-stocks-to-buy-on-weakness-after-earnings/", "published": 1600171700.0, "headline": "4 Stocks to Buy on WEAKNESS After Earnings", "body": "While a company’s improved financials encourage investors, for many stocks, positive earnings reports don’t get reflected in the short-term price movements in stocks. Many stocks see a dip in price even after reporting improved and better-than-expected numbers. While it’s hard to understand why an impressive report would fail to encourage investors, this should not be a concern for investors looking for long-term growth. In fact, a price dip after an impressive earnings report gives us an opportunity to enter the stock at a discounted price. After all, improved numbers are indicators of a solid future performance. The Kroger Company (KR), Peloton Interactive, Inc. (PTON), Chewy, Inc. (CHWY), and Zscaler, Inc. (ZS) are four stocks that recently reported impressive results, but their stocks have dropped since their earnings releases. However, considering their business-expansion efforts, impressive financials and expected increase in revenues and earnings, their recent declines could be a good opportunity to enter these stocks. 7 \"SAFE HAVEN\" Dividend Stocks for Turbulent TimesThe Kroger Company (KR) KR is a retailer that operates in the US and internationally. The company is also engaged in manufacturing and processing of food for sale in its retail outlets. KR recently reported its second quarter earnings. The company’s digital sales grew by 127% and its operating profit grew 43% year-over-year. The company increased its dividend by 13%, which makes it the 14th consecutive year in which the company has increased its dividends. However, the stock lost close to 6% since it reported results on September 11th. The stock has upside left because of recent initiatives and the expected growth in earnings and revenues. So, the recent price dip could be a solid buying opportunity. The company has been working on improving its e-commerce services. It has partnered with Miraki to bring a seamless experience to shoppers and it has extended its ship-to-home services. The company has also implemented contactless payments through some of its stores. KR’s is expected to witness an increase in revenues of 5.3% in the current quarter and 7.6% this year. KR’s EPS is estimated to rise 42.5% this year and at a rate of 7.5% per annum over the next five years. How does KR stack up for the POWR Ratings? A for Trade Grade B for Buy & Hold Grade A for Industry Grade B for Overall POWR Rating The stock is also ranked #6 out of 18 stocks in the Grocery/Big Box Retailers industry. Peloton Interactive, Inc. (PTON) PTON runs an interactive fitness platform. This platform consists of in-studio fitness exercises, fitness clubs, at-home fitness equipment, and health and wellness apps. The company reported its fiscal fourth quarter results on September 10th. Subscription revenue grew 99% year-over-year to $121.2 million in the quarter. The company’s total revenue grew 172% year-over-year to $607.1 million. Connected Fitness segment revenue grew 199% year-over-year to $485.9 million. The company expects Connected Fitness Subscriptions to grow 135% for the quarter ended September 2020. Despite this impressive performance, the stock lost 9% since its earnings release. Given its continued efforts to improve its offerings and the expected growth in earnings and revenues, the recent price decline is an opportunity to enter the stock. PTON has recently announced that it will be offering two product tiers in its treadmills and stationary cycles categories. The company will also offer financing options for its connected-hardware offerings. PTON’s revenue is expected to rise 91% this year and 35% next year. PTON’s EPS is estimated to grow 112.5% this year and 625% next year. PTON’s stock has delivered gains of 188.8% so far this year. It’s no surprise that PTON is rated a “Buy” in our POWR Ratings system, with a grade of “A” in Trade Grade, Peer Grade, and Industry Rank. In the 34-stock Consumer Goods industry, it is ranked #10. Chewy, Inc. (CHWY) CHWY operates an online platform for the sale of pet food and pet-related products. The company has largely benefited from the growth in its e-commerce business caused by the spread of the coronavirus. The company reported its second-quarter results on September 10th. CHWY witnessed an increase in net sales of 47% year-over-year for the quarter. The company’s Adjusted EBITDA improved 153% year-over-year. However, the stock lost 14% since reporting the impressive second-quarter numbers. This price dip offers an opportunity to enter the stock, as it has plenty of upside left based on enhanced offerings and expected growth in financials. The company is offering subscription-based services through which customers can automatically get their pet supplies every month. The company is planning to open a new distribution center in Missouri which would cover an area of 800,000 sq. ft. CHWY’s revenue is expected to grow 40.6% this year and 22.7% next year. CHWY’s EPS is estimated to grow by 30.2% this year and at a rate of 132.1% per annum over the next five years. The company’s stock has delivered year-to-date price returns of 82.7%. In our POWR Ratings, the company has been accorded a grade of “A” for Industry Rank. The company has a grade of “B” for Trade Grade. In the 34-stock Consumer Goods industry, it is ranked #13. Zscaler, Inc. (ZS) ZS operates as a cloud computing security company. The company’s software-as-a-service platform allows companies to securely access cloud-based services and applications. The company is well poised to benefit from the boom in the cloud services market. For the fiscal fourth quarter that ended on July 31st 2020, the company witnessed a 46% year-over-year increase in revenue to $125.9 million. The company’s calculated billings grew 55% year-over-year. It had a GAAP net loss of $49.5 million compared to GAAP net loss of $5.3 million a year ago. For the first quarter of fiscal 2021, the company expects non-GAAP earnings per share of approximately $0.05 to $0.06. Despite this impressive performance and guidance, the stock lost more than 2% since releasing the earnings report on September 9th. The company’s recent developments and the expected growth in financials should help the stock move higher. ZS has been selected to provide cloud security solutions to the Defense Innovation Unit, which is a US Department of Defense organization. The company has also announced new innovations in its Zscaler Zero Trust Exchange. These innovations are geared towards allowing users to securely connect with each other and to applications from anywhere. ZS’s revenue is expected to rise 36.3% this year and 28.9% during the next year. ZS’s EPS is estimated to grow 29.2% this year and at a rate of 44.7% per annum over the next five years. ZS’s strong fundamentals are reflected in its POWR Ratings. It has a “Buy” rating with a a grade of “B” in Trade Grade and Peer Grade. Within the Software – Security industry, it’s ranked #3 out of 23 stocks. Want More Great Investing Ideas? 7 Best ETFs for the NEXT Bull Market Is the Stock Market Correction Over? Chart of the Day- See the Stocks Ready to Breakout KR shares were trading at $32.73 per share on Tuesday afternoon, down $0.11 (-0.33%). Year-to-date, KR has gained 14.67%, versus a 7.26% rise in the benchmark S&P 500 index during the same period."}]}