{"article": [{"url": "https://stocknews.com/news/veev-abmd-pki-crl-are-you-a-growth-investor-check-out-these-4-healthcare/", "published": 1598616500.0, "headline": "Are You a Growth Investor? Check Out These 4 Healthcare Stocks Now", "body": "The market’s rally since the March lows has primarily been driven by growth stocks. And if the market keeps rallying, growth stocks are likely to continue outperforming especially in a falling rate environment. The outperformance of growth stocks is evident from the iShares Core S&P U.S. Growth ETF’s (IUSG) nearly 65% gain since hitting its year-to-date low in mid-March versus the S&P 500’s 51% return. Many growth stocks in the technology sector are trading at high premiums now. However, valuations are much more reasonable for growth stocks in the healthcare space. The long-term fundamentals of the healthcare sector remain promising due to the aging population and continuous innovation in new treatments. 7 Best ETFs for the NEXT Bull MarketAnother catalyst is the coronavirus as there are increasing hopes of a vaccine or more effective treatments. It’s leading to enormous sums being invested in healthcare which should have positive ramifications into the future. Here are four growth stocks from the healthcare sector to consider: Veeva Systems Inc. (VEEV), ABIOMED, Inc. (ABMD), PerkinElmer, Inc. (PKI) and Charles River Laboratories International, Inc. (CRL). Veeva Systems Inc. (VEEV) VEEV is a cloud-based software company in the global life sciences industry. VEEV caters to more than 900 customers ranging from Biotechs to large pharmaceutical companies. The stock has grown more than 90% since its March lows. The consensus EPS estimate of $0.63 for the quarter ending October 2020 indicates a year-over-year increase of 5%. Also, it is impressive to note that the company beat consensus EPS estimates in each of the trailing four quarters. VEEV’s EPS is expected to grow 16.9% for the current year and 19.1% for the next year. Moreover, the company’s EPS is expected to grow 17.1% per annum in the next five years and its revenue is expected to grow 26.1% in the current year and 19.6% next year. VEEV’s clinical innovation has impressed many companies as a result of which more than 300 Vault eTMF and 70 Vault CTMS customers, and over 100 clinical trials have started on Vault CDMS. Bayer AG recently selected Veeva Vault Study Start-Up and Veeva Vault eTMF globally to accelerate site activation and improve visibility across trials. Moreover, the company also reported record sales of its Vault Quality applications in the second quarter. In the fiscal second quarter ended July 2020, VEEV’s total revenue increased 33% and operating income increased 39% year-over-year. VEEV’s net income per share was $0.72 as compared to $0.55 per share a year ago. How does VEEV stack up for the POWR Ratings? A for Trade Grade A for Buy & Hold Grade A for Peer Grade B for Industry Rank A for Overall POWR Rating You can’t ask for better. The stock is also ranked #1 out of 69 stocks in the Medical-Services industry. ABIOMED, Inc. (ABMD) ABMD is a provider of medical devices that provide circulatory support. The company reported sequential revenue and patient growth each month within the first quarter of fiscal 2021. ABMD’s June revenue was up 4% as compared to the previous year and the stock gained about 120% since its March lows. The consensus EPS estimate of $0.86 for the quarter ending September 2020 indicates a year-over-year increase of 207.1%. ABMD’s EPS is expected to grow 1.1% for the current year and 18.1% for the next year. Moreover, ABMD’s EPS is expected to grow 24% per annum in the next five years and its revenue is expected to grow 20.7% next year. The FDA recently issued a EUA for left-sided Impella heart pumps manufactured by ABMD to provide left ventricular unloading and support to COVID-19 patients who are undergoing ECMO treatment and develop pulmonary edema or myocarditis. Moreover, a three-year prospective study of Japanese patients who received an Impella heart pump finds the use of Impella is associated with a 77% survival rate at 30 days in AMI cardiogenic shock patients. It’s no surprise that ABMD is rated a “Strong Buy” in our POWR Ratings system. It also has a grade of “A” in Trade Grade, Buy & Hold Grade, Peer Grade, and Industry Rank. In the 138-stock Medical-Devices & Equipment industry, it is ranked #10. PerkinElmer, Inc. (PKI) PKI operates in two segments — Human health and environmental health — and is focused on innovating for a healthier world. The stock has grown by about 70% since its March lows. The consensus EPS estimate of $1.43 for the quarter ending September 2020 indicates a year-over-year increase of 34.9%. PKI’s EPS is expected to grow 31.2% in the current year and 7.1% next year. Moreover, the company’s EPS is expected to grow 17% per annum in the next five years. PKI has an impressive earnings surprise history with the company beating consensus EPS estimates in each of the trailing four quarters. PKI’s consensus revenue estimate of $823.29 million for the same quarter also indicates an increase of 16.4% over the year-ago quarter. The company’s revenue is expected to grow 11.8% in the current year and 6.4% next year. In the second quarter, PKI’s revenue increased 12.3% and operating income from continuing operations increased by 56.3% year-over-year. PKI’s earnings per share from continuing operations for the quarter was $1.57as compared to $1 in the year-ago period. PKI recently announced its hand sanitizer analyzer instrument which can be used to test for the presence of methanol in alcohol-based hand sanitizer products with pass/fail results delivered in 30 seconds or less. The instrument also tests ethanol and isopropanol concentrations to confirm product efficacy. Moreover, the company also announced the launch of explorer™ workstations to boost testing capacity for Covid-19 and attain results faster. PKI’s POWR Ratings reflect this promising outlook. It has an overall rating of “Buy” with an “A” for Trade Grade and Industry Rank and a “B” for Buy & Hold Grade and Peer Grade. Among the 138 stocks in the Medical-Devices & Equipment industry, it’s ranked #36. Charles River Laboratories International, Inc. (CRL) CRL provides products and services to help pharmaceutical and biotechnology companies, government agencies, and leading academic institutions around the globe accelerate their research and drug development efforts. CRL’s consensus revenue estimate of $714.37 million for the quarter ending September indicates an increase of 6.9% over the year-ago quarter. Also, CRL’s revenue is expected to grow by 8.7% in the current year and 9.6% next year. The consensus EPS estimate of $1.78 for the same quarter indicates a year-over-year increase of 5.3%.CRL’s EPS is expected to grow by 7.7% in the current year and 15.3% next year. Moreover, the company’s EPS is expected to grow by 11.3% per annum in the next five years. CRL’s earnings surprise history looks pretty good with the company beating consensus EPS estimates in each of the trailing four quarters. James C. Foster, Chairman, President, and CEO of CRL said, “Based on our second-quarter performance and our current belief that the COVID-19-related headwinds will be more moderate than previously anticipated, we are increasing our revenue growth and earnings per share guidance for 2020. We believe the global scale, broad scientific capabilities, and flexible outsourcing solutions of our leading, early-stage portfolio continue to differentiate us in the marketplace and are enabling us to withstand the initial challenges of the COVID-19 pandemic.” In the second quarter, CRL’s revenue increased by 3.8% and GAAP net income attributable to common shareholders increased by 54.2%. The stock has returned more than 90% from its March lows. In early August, CRL signed a definitive agreement to acquire Cellero, LLC which will enhance the company’s solutions for the high-growth cell therapy market and broaden its access to high-quality, human-derived biomaterials. CRL is rated “Strong Buy” in our POWR Ratings system. It also has an “A” for Trade Grade, Buy & Hold Grade and Peer Grade, and a “B” in Industry Rank. It is also ranked #5 out of 58 stocks in the Medical-Diagnostics/Research industry. Want More Great Investing Ideas? 7 Best ETFs for the NEXT Bull Market Why Stocks Could Drop 20% in September? 9 “BUY THE DIP” Growth Stocks for 2020 VEEV shares were unchanged in after-hours trading Friday. Year-to-date, VEEV has gained 94.85%, versus a 10.05% rise in the benchmark S&P 500 index during the same period."}]}