{"article": [{"url": "https://stocknews.com/news/sne-meli-wix-3-strong-buy-international-stocks-analysts-love/", "published": 1597925300.0, "headline": "3 'Strong Buy' International Stocks Analysts Love", "body": "A number of U.S. based stocks are hitting their all-time highs irrespective of the widespread economic concerns. So, there is a chance some stocks may see a correction in the near term due to fading investor optimism on an economic recovery. Keeping this possibility in mind, it might be a good idea to diversify with stocks of international companies. Many of these stocks have gained since the market crash in March, and may grow further based on a gradual recovery of their economies. Investing in international stocks provides geographical diversity to a portfolio, which is much needed, considering the overall volatility in the market and ongoing health and geopolitical uncertainties. The recovery of global stocks can be seen from the Vanguard FTSE All-World ex-US Index Fund ETF’s (VEU) 45% gain since its March lows. This ETF provides broad exposure across developed and emerging non-US equity markets around the world. Sony Corporation (SNE), MercadoLibre, Inc. (MELI), and Wix.com Limited (WIX) are three international stocks that possess a consensus analyst rating of Strong Buy from Wall Street Analysts. 7 \"SAFE HAVEN\" Dividend Stocks for Turbulent TimesSony Corporation (SNE) SNE is a Tokyo-based entertainment company that designs, develops, produces, and sells electronic equipment, instruments, and devices for the consumer, professional, and industrial markets worldwide. It distributes software titles and add-on content; network services related to game, video, and music content; and game consoles, software, and peripheral devices. SNE closed yesterday’s trading session at $81.1, gaining 19.3% year-to-date. Wall Street analysts rate SNE as a Strong Buy. The stock’s consensus price target is $90.12, which is 11% higher than its yesterday’s closing price. The stock hit a 52-week low of $50.94 in March and has recovered more than 59% since then. The company’s fiscal first quarter revenues rose 2.2% year-over-year to $18.3 billion. The upside was driven by increases in Game & Network Services (G&NS) and Financial Services segment sales, both soaring 32.5% year-over-year. SNE also generated $1.17 billion of net cash from operating activities. Net income for the quarter increased 53% year-over-year to $2.17 billion. EPS for the quarter came in $1.74 and analysts estimate EPS to grow 15.8% next year. Moreover, SNE has recently acquired a minority stake in Epic Games, Inc., a forefront game engine developer, to evolve its digital ecosystem and create unique experiences for consumers. How does SNE stack up for our POWR Ratings system? A for Trade Grade A for Buy & Hold Grade B for Peer Grade B for Industry Rank A for Overall POWR Rating. It is ranked #1 out of 20 stocks in the Entertainment – Media Producers industry. MercadoLibre, Inc. (MELI) MELI is an Argentina-based e-commerce service provider. It operates MercadoLibre Marketplace, an automated online commerce platform that enables businesses and individuals to list merchandise and conduct sales and purchases online; and MercadoPago FinTech, a financial technology solution platform, which facilitates transactions on and off its marketplaces by allowing its users to send and receive payments online. MELI closed yesterday’s trading session at $1,212.45, with a year-to-date gain of 112%. The stock has gained more than 187% from its March low of $422.22. According to Wall Street analysts, MELI is rated a Moderate Buy. The average analyst price target of $1308.18 is 7.9% higher than its last closing price. The company reported excellent second quarter results. The top-line grew 61% year-over-year to $878 million. Operating profits came in $99.4 million compared to the year-ago loss of 12.5 million. MELI also generated $650 million in cash from operating activities, increasing 2,259% year-over-year. Net income for the quarter came in $56 million while the company reported EPS of $1.11, beating the consensus estimate by 1,133%. Analysts expect EPS to grow 112% in the current year. MELI’s POWR Ratings reflect this promising outlook. It has an overall rating of Strong Buy with a grade of A for Trade Grade, Buy & Hold Grade, and Industry Rank. Among the 54 stocks in the Internet industry, it’s ranked #5. Wix.com Limited (WIX) WIX is an Israel-based internet service provider that develops and markets a cloud-based platform enabling anyone to create a website or web application. It offers web development, design, and management solutions and apps through an online platform that enables its user base of businesses, organizations, professionals, and individuals, to create a digital presence in North America, Europe, Latin America, Asia, and internationally. With a year-to-date gain of 133%, WIX closed yesterday’s trading session at $285.61. The stock has gained 49% over the last three months. Fourteen out of fifteen Wall Street analysts have a Buy rating on this stock. The average price target of the stock is $331.67, which is 16.13% higher than its yesterday’s closing price. WIX’s second quarter results did not fail to impress the street. Revenues grew 27% year-over-year to $236 million, while total collections increased 33% year-over-year to $266 million. The company added 9.3 million news users in the quarter. WIX generated a free cash flow of $46.7 million, 52% more than the comparable quarter last year. Despite reporting a negative EPS $0.26 in the preceding quarter, analysts expect EPS to grow 254% next year. It’s no surprise that WIX is rated a Buy in our POWR Ratings system. It also has a grade of B for Trade Grade, Buy & Hold Grade, Peer Grade, and Industry Rank. It is ranked #6 out of 34 stocks in the Internet – Services industry. Want More Great Investing Ideas? The Best of StockNews 2 Step Process to Sell @ Market Top in September 9 “BUY THE DIP” Growth Stocks for 2020 SNE shares were trading at $79.41 per share on Thursday afternoon, down $1.69 (-2.08%). Year-to-date, SNE has gained 17.11%, versus a 6.18% rise in the benchmark S&P 500 index during the same period."}]}