{"article": [{"url": "https://stocknews.com/news/dell-smci-logi-top-3-computer-hardware-stocks-to-buy-now/", "published": 1595333300.0, "headline": "Top 3 Computer Hardware Stocks to Buy Now", "body": "One consequence of the coronavirus and subsequent shutdowns was a surge in demand for computer hardware. All of a sudden, kids were taking classes online, and adults were working from home. Many people had to buy new computers or upgrade existing ones to keep everything running smoothly. Microsoft reported that time spent on Windows has increased by 75% on a year over year basis. And earnings reports from semiconductor companies also confirms this picture. They are seeing higher demand and raising their outlooks which indicates the upgrade cycle for computer hardware is far from over. 7 Best ETFs for the NEXT Bull MarketStores and websites selling computer hardware are still experiencing unprecedented demand. Given that the virus’ spread continues and many schools and offices are going remote in the fall, demand will likely remain above-average levels. Here are the three top computer hardware stocks to buy now: Dell Technologies, Inc. (DELL) As one of the most popular names in the IT industry, DELL has a global presence in designing, developing, and manufacturing both hardware and software components of computers and laptops. Working from home is the “new normal,” the demand for personal computers has increased in the past couple of months. DELL announced deferred revenue of $27.6 billion, an increase of 14% year over year for its first quarter in fiscal 2021 (ending May 1st) DELL currently holds 81% of VMware, which is valued more than the parent company itself. Virtualization is seeing a surge in demand due to its key role in enabling remote work while maintaining security. DELL has recently announced that it is planning a spin-off of its VMware stake, which could increase its valuation by billions. This deal is expected to mutually benefit both companies and help DELL get an investment-grade credit rating. Currently, the spinoff is scheduled for September 202 with the deal timed to limit the federal income taxation applicable, allowing DELL to retain earnings. DELL’s shares have gained over 7% in value in the first week of July, as investors were optimistic about this spin-off. The stock gained more than 140% from the 52-week low of $25.51 it hit on March 18th due to the overall dip in the market. DELL’s strong recovery could be part of growth momentum and sound business plan that could continue through the remainder of 2020. CEO Michael Dell said, “We are focused on winning in the consolidating markets where we operate and innovating across the Dell portfolio to create integrated solutions that turn data into insights and action.” The consensus EPS estimate for the second quarter ending July 2020 of $1.38 indicates a year-over-year decline. However, DELL has surpassed EPS estimates in three out of the last four quarters, which is impressive. How does DELL stack up for the POWR Ratings? A for Trade Grade A for Buy & Hold Grade B for Peer Grade A for Industry Rank A for Overall POWR Rating DELL is also ranked #3 out of 28 stocks in the Technology – Hardware industry. Logitech International SA (LOGI) LOGI is a US-based company that designs and manufactures hardware accessories, such as keyboards and mouse, gaming devices, speakers, video, and other computing products. The company has a global market as it supplies products at affordable prices. The demand for tech products has witnessed a steep rise in the past couple of months owing to the shift to a stay-at-home culture which bodes well for LOGI. The company announced net revenues for the first fiscal quarter of 2021 of $792 million, a year-over-year rise of 23%. Operating income also increased 76% year over year to $83 million. Cash flow from operations increased more than 220% year over year to $119 million. LOGI announced a collaboration with Amazon-owned Alexa and Zoom rooms for contactless video call collaboration. As video conferencing is gaining popularity very fast, this hands-free technology is expected to have a huge demand from people engaging in video conferences for various purposes. LOGI’s earnings surprise history looks impressive with the company beating the consensus EPS estimates in three of the trailing four quarters. LOGI has gained more than 125% since hitting its 52-week low of $31.37 on March 16th. With the rising demand for its products, this momentum should continue. LOGI’s strong fundamentals are reflected in its POWR Ratings, it has a “Strong Buy” rating with an “A” in Trade Grade, Buy & Hold Grade, Peer Grade, and Industry Rank. Within the Technology-Hardware group, it’s ranked #7 out of 28 stocks. Super Micro Computer, Inc. (SMCI) SMCI develops and manufactures high-performance server and storage solutions based on modular and open architecture. SMCI has considerable exposure to 5G, as it has developed fully configurable Intel Xeon Scalable SuperServers running on O-Ran compliant partner software. This technology is designed to help the connections withstand harsh environments, thereby providing stability to users. SMCI is planning on opening a second server assembly in America, which will focus on providing services to cloud computing companies. With the rising demand for data centers and other associated services, this expansion will help SMCI emerge as a dominant player in the 5G race. SMCI has also announced future expansion plans in Taiwan. SMCI’s net sales for the fiscal third quarter ended March 2020 which is a 4% increase year over year to $772 million. Net income for the quarter increased 45% year over year to $16 million. The consensus EPS estimate for the fourth quarter of $0.54 indicates a year-over-year increase of 1.9%. SMCI’s earnings are expected to grow at 10% per annum over the next 5 years. SMCI has gained more than 80% since hitting its 52-week low of $15.76 on March 18th due to the coronavirus-led market crash. SMCI has an overall Buy rating with a “B” for Trade Grade, Peer Grade, Buy & Hold Grade, and Industry Rank. Want More Great Investing Ideas? 9 “BUY THE DIP” Growth Stocks for 2020 Newly REVISED 2020 Stock Market Outlook 7 “Safe-Haven” Dividend Stocks for Turbulent Times DELL shares were unchanged in after-hours trading Tuesday. Year-to-date, DELL has gained 18.82%, versus a 2.02% rise in the benchmark S&P 500 index during the same period."}]}