{"article": [{"url": "https://stocknews.com/news/pypl-sq-docu-fsly-4-stocks-with-accelerated-revenue-growth/", "published": 1600344500.0, "headline": "4 Stocks with ACCELERATING Revenue Growth", "body": "It’s not a coincidence that the best-performing stocks also have the most impressive revenue growth. After all, revenue growth is the best indicator that a company’s product is gaining traction. During the coronavirus, the premium paid for stocks with revenue growth has expanded even more. It’s because the number of growth opportunities has shrunk, and the plummet in interest rates. The coronavirus has caused many tech companies revenues to accelerate which is leading investors to change their expectations for future earnings growth. Companies such as PayPal Holdings, Inc. (PYPL), Square, Inc. (SQ), DocuSign, Inc. (DOCU), Fastly, Inc. (FSLY) have been seen an acceleration in growth which bodes well for their stock prices. 9 \"BUY THE DIP\" Growth Stocks For 2020PayPal Holdings, Inc. (PYPL) PYPL maintains a digital platform to help merchants and individuals transfer payments worldwide. The company has benefitted from the social distancing measures taking place around the world and the resultant growth in e-commerce and remote payments. The company is also taking its partnership with Visa (V) to the next level. Under the new partnership, eligible PayPal users will be able to send and receive money from Visa-branded cards that operate within the Direct system. Numerous platforms can be used to affect these payments such as Venmo and Xoom. During the second quarter of the year, PYPL’s revenue grew 22% year-over-year, significantly higher than the 12% growth it witnessed during the first quarter. In the next quarter, the company’s revenue is expected to grow by 22.6%. The company’s revenue is estimated to grow by 20.4% in the current year and 19.3% next year. The company’s EPS is also expected to grow at a rate of 23.4% per annum over the next five years. PYPL has gained 67.3% year-to-date. How does PYPL stack up for the POWR Ratings? B for Trade Grade B for Buy & Hold Grade B for Peer Grade A for Industry Grade B for Overall POWR Rating The stock is also ranked #5 out of 45 stocks in the Consumer Financial Services industry. Square, Inc. (SQ) SQ develops and offers point-of-sale software for global users. The company’s primary service is Square Register which helps with digital receipts, inventory, sales reports, along with analytics and consumer feedback. The company has announced a new payment service called On-Demand Pay. This allows users to transfer up to $200 of their wages for each payment cycle for free to the Cash App. Users can also transfer the amount to a linked debit card for a small fee. With the ongoing adoption of cashless payments across the world, SQ has seen increasing revenues. During the second quarter of the year, SQ’s revenue increased by 64% year-over-year. The company has recorded double-digit year-over-year revenue growth figures for each quarter in the last year. For the quarter ended September 2020, the company is expected to witness revenue growth of 239.7%. SQ’s revenue is expected to rise 228.4% in the current year and 28.7% next year. SQ’s EPS is estimated to grow by 35.8% per annum over the next five years. SQ’s stock has gained 141.4% year-to-date. It’s no surprise that PTON is rated a “Buy” in our POWR Ratings system, with a grade of “B” in Trade Grade, Buy & Hold Grade, Peer Grade, and Industry Rank. In the 204-stock Financial Services (Enterprise) industry, it is ranked #19. DocuSign, Inc. (DOCU) DOCU is a cloud services company that provides cloud-based transaction products and services in the United States. The company’s e-signature solutions allow users to generate, execute, and act on legal agreements. The company has significantly benefited from the coronavirus since the resultant remote working environment has grown the need to digitally sign agreements and manage them. During the second quarter, the company reported a year-over-year increase in revenue of 45%. For the quarter ended October 2020, the company’s revenue is expected to grow 44.6%. The company’s revenue is expected to grow 42.1% in the current year and 31% next year. DOCU has recently acquired Liveoak Technologies in a $38-million deal. The new acquisition would allow the company to offer web-based video conferencing, several new collaboration features, identity verification, along with other features. DOCU’s EPS is estimated to grow at a rate of 31.2% per annum over the next five years. The stock has delivered 165.8% returns year-to-date. Under our POWR Ratings, the company has been accorded a “B” rating for Industry Rank. In the 93-stock Software – Application industry, it is ranked #31. Fastly, Inc. (FSLY) FSLY is a cloud computing company that operates a real-time content delivery network. Its streaming media services include global video content delivery for both live and on-demand audiences. The company’s Edge platform is now available on Google Cloud Marketplace, which could open the doors to more users and greater adoption for the company. The company has also recently purchased Signal Sciences which is a web application and API security company in a deal worth $775 million. The company’s revenue growth is attributed to growing internet usage due to social distancing norms. For the second quarter of 2020, the company’s revenue grew 62% year-over-year. For the quarter ended September, the company’s revenue is expected to rise by 50.1%. FSLY’s revenue is expected to grow 48% in the current year and 33% next year. FSLY’s EPS is estimated to grow at a rate of 30% per annum over the next five years. FSLY has gained 311.1% year-to-date. Want More Great Investing Ideas? 7 Best ETFs for the NEXT Bull Market Is the Stock Market Correction Over? Chart of the Day- See the Stocks Ready to Breakout PYPL shares rose $0.35 (+0.20%) in after-hours trading Thursday. Year-to-date, PYPL has gained 62.51%, versus a 5.42% rise in the benchmark S&P 500 index during the same period."}]}