{"article": [{"url": "https://stocknews.com/news/ntap-if-shares-of-netapp-break-this-level-expect-a-strong/", "published": 1600949300.0, "headline": "If Shares of NetApp Break This Level, Expect a Strong Move Lower", "body": "As the market continues to sell off this morning, traders should take a look at NetApp (NTAP). The stock is nearing a support level and if it’s broken, a strong move lower may occur. NTAP is a leading provider of enterprise data management and storage solutions. The company transitioned from a data center storage firm to providing software data management solutions for multi-cloud environments. It is poised to benefit from an increased adoption of cloud-integrated all-flash solutions and hybrid multi-cloud offerings. Take a look at the 1-year chart of NTAP below with added notations: 7 \"SAFE HAVEN\" Dividend Stocks for Turbulent Times Chart of NTAP provided by TradingView NTAP has formed an important level of support at $40 (green) over the past several months. The stock has consistently managed to rally off this level, and now it’s nearing $40 again. If the stock moves beneath the support level, a trader could enter a short position below $40 with the expectation for a breakdown. Want to See My Favorite Stock Trades Today? The process I use to select these “Chart of the Day” stocks is just the starting point for what I put in my private portfolio. There I take a deeper dive into the stock market outlook. And determine which sectors are likely to outperform. Then and only then to do I pull the trigger on the most timely trades. If you would like to be notified of my best trades, then just click on the link below to get started! See Christian Tharp’s Top Stock Picks Now Have a good trading day! Christian Tharp, CMT @cmtstockcoach NTAP shares were trading at $40.62 per share on Thursday morning, down $0.57 (-1.38%). Year-to-date, NTAP has declined -32.70%, versus a 0.95% rise in the benchmark S&P 500 index during the same period."}]}