{"article": [{"url": "https://stocknews.com/news/fslr-enph-sedg-run-tan-why-solar-stocks-will-soar-in-the-second-half/", "published": 1596110900.0, "headline": "Why Solar Stocks Will SOAR in the Second Half of 2020", "body": "In recent months, one of the strongest industries in the market has been alternative energy stocks, particularly solar energy stocks. The catalyst for these gains has been Joe Biden’s lead in the polls and the unveiling of his energy plan which is even more ambitious than his previous proposal during the primaries. Dropping Solar Prices Even before this catalyst, It’s worth noting that the price of solar energy has been decreasing at a steady rate. This makes it increasingly cost-competitive with other sources of energy. 9 \"BUY THE DIP\" Growth Stocks For 2020 (source: Berkeley Lab) This trend should continue. Many researchers predict solar will be the most widely used renewable energy by 2023. With that in mind, investors should keep Enphase Energy (ENPH), First Solar (FSLR), SolarEdge Technologies (SEDG), and Sunrun (RUN) on their radars given their strong fundamentals, exciting prospects, and striking parallels to leading stocks of the past. These stocks have been rated as Strong Buys or Buys by our POWR Ratings system. They’ve also started to demonstrate signs of leadership, as they’ve made new 52-week highs in the past couple of months. Solar Sector There are a variety of different ways to get exposure to the solar sector. There are companies that install solar panels for residential customers and businesses, some supply parts, and others manufacture solar cells. The First Solar ETF (TAN) is one way to get diversified exposure to this group. FSLR is one of the best solar panel manufacturers in the world. Unlike other solar panel makers, it’s remained profitable despite recent oversupply in the market. It’s also invested in increasing its production capacity from 6 to 8 megawatts which puts it in a good position for a cyclical upswing in the industry. SEDG and ENPH both supply the solar industry with parts and should benefit from the increasing demand for solar. Both companies make microinverters that convert solar power into electricity. They also have products for storage, transmission, and commercial projects. RUN designs, develops, installs, and maintains residential solar systems. Its stock is up more than 100% year to date. It will be a big beneficiary for tax credits for solar projects as well as increased efficiency. Biden’s Energy Plan Solar energy has strong fundamentals due to technological advances. However, former Vice-President Joe Biden has proposed an ambitious energy plan which would further incentivize investments in solar and subsidize research that would reduce costs even more. Currently, he is leading national polls and in key, swing states. Further, Democrats are also predicted to take control of the Senate which means that Biden’s plan has a better chance of passing. Biden’s original plan called for spending $1.7 trillion over a decade, however, his new plan is aiming to spend $2 trillion in the next four years. The most impactful change for the solar industry is Biden’s intention to achieve 100% clean electricity nationwide by 2035. Currently, the US spends about $100 billion annually on efforts related to clean energy, and this figure is expected to triple or quadruple under the new plan. Currently, fossil fuels account for 63% of electricity generation. Biden wants to install millions of solar panels and create clean energy and efficiency tax credits to expedite this transition. The plan will also make significant investments in energy transmission and storage to bring down these costs. Winning Proposition Lower solar costs and government subsidies are a powerful combination to kick off the next bull market in solar. Companies that make solar panels and install them are likely to see a period of increased demand and pricing power. Another tailwind for the solar industry is that low-interest rates make their projects more viable. Many solar companies install projects, taking on the upfront cost, then receive monthly payments from their customers in exchange for the electricity it generates. The solar companies can then sell this flow of payments to investors basically as bonds. When interest rates drop, the value of these “bonds” or contracts will increase, since it’s a fixed amount. For customers, tax credits will increase the savings of installing solar energy, especially for plans in which the builders pay any upfront installation costs. Conclusion Due to the increased efficiency of solar panels and falling costs, the outlook for the industry was already improving. Now, Biden’s energy plan is increasing the potential upside. Tax credits will lead to more demand, and the investments into R&D will result in pushing down the costs of solar power and energy storage even more. Over the long-term, this will also lead to quicker adoption of solar power. Want More Great Investing Ideas? 9 “BUY THE DIP” Growth Stocks for 2020 How HIGH Can This Tech Bubble Fly? 7 “Safe-Haven” Dividend Stocks for Turbulent Times FSLR shares were unchanged in after-hours trading Thursday. Year-to-date, FSLR has gained 6.68%, versus a 1.69% rise in the benchmark S&P 500 index during the same period."}]}