{"article": [{"url": "https://stocknews.com/news/nke-dkng-penn-3-stocks-that-will-benefit-from-the-return-of-college/", "published": 1601640500.0, "headline": "3 Stocks That Will Benefit from the Return of College Football", "body": "With the United States gradually recovering from the pandemic shock, many schools and colleges are reopening across the country. The college football playoff, which is one of the biggest programs conducted by most colleges across the country, is expected to begin in the fall with proper precautions. The director of sports business program Patrick Rishe values the college football industry at $4 billion (in terms of revenue) in 2020. The return of the college sports industry after a six-month hiatus due to the COVID-19 crisis bodes well for several fitness and virtual sports betting stocks as well. With physical gathering estimated to be limited this time, online sports betting and viewership is expected to skyrocket this fall. Companies such as Nike, Inc. (NKE), Draftkings, Inc. (DKNG), and Penn National Gaming, Inc. (PENN) are expected to see a surge in demand for their products and services ahead of the sports kick-off, resulting in higher revenue and earnings. These companies have also undertaken several tactical agreements, which are likely to boost their growth in tandem with the sports industry, thereby ensuring substantial capital gains for investors. 7 \"SAFE HAVEN\" Dividend Stocks for Turbulent TimesNike, Inc. (NKE) NKE is the biggest and most valuable sports apparel manufacturer in the world, with a 25.1% global apparel market share in the April to June quarter. It has a brand value of over $34 billion, as of the quarter that ended June 2020. The company’s sound business model and financial strength helped the stock gain more than 115% since its March low. The stock hit its 52-week high of $130.38 in September after hitting its 52-week low of $60 in March. On July 22nd, NKE announced several leadership changes to make the brand digitally empowered and support its Consumer Direct Acceleration (CDA) strategy. With digital sales becoming immensely popular in the current economic scenario, this move can help NKE branch out to untapped markets. NKE’s robust recovery, which was a result of its accelerating brand momentum and digital sales since the beginning of the pandemic, was reflected in its results for the fiscal first quarter that ended August 2020. Its direct sales improved 12% year-over-year to $10.60 billion, and brand digital sales increased 82% from the same period last year. EPS increased 10% from the year-ago value to $0.95. NKE’s inventory increased 15% from the year-ago value to $6.70 billion. The consensus revenue estimate of $10.55 billion for the fiscal second quarter ending in November 2020 indicates a slight improvement from the year-ago value. NKE’s EPS is expected to grow at a rate of 25.1% per annum over the next five years. How does NKE stack up for the POWR Ratings? A for Trade Grade A for Buy & Hold Grade A for Peer Grade B for Industry Rank A for Overall POWR Rating. The stock is also ranked #1 out of 33 stocks in the Athletics & Recreation industry. Draftkings, Inc. (DKNG) DKNG is an online sports and betting company providing business to business (B2B) and business to customer (B2C) offerings. It made its stock market debut earlier this year through a special purpose acquisition of Diamond Eagle Corporation. On September 14th, DKNG signed a multi-year agreement with ESPN to be an exclusive daily fantasy sports provider and co-exclusive link out provider. On October 1st, DKNG signed a multiyear agreement to become the official daily fantasy sports partner and official sports betting partner for Philadelphia Eagles. DKNG also signed to be an exclusive sports betting, iGaming and daily fantasy operator for the New York Giants and Chicago Clubs. In addition, DKNG signed to be the official daily fantasy operator and official sports betting operator for Colorado Rockies. It also opened the Draftkings sportsbook at Mardi Gras Casino in Colorado as part of the agreement. DKNG reported a 23.6% year-over-year increase in its revenues to $70.93 million in the second quarter that ended June 2020. DKNG’s EPS is expected to grow at a rate of 40% per annum over the next five years. The stock gained more than 535% to hit its 52-week high of $62.73 in October since hitting its year-to-date low of $10.65 in January. DKNG is rated a “Strong Buy” in our POWR Ratings system, consistent with its sound business model and impressive financials. It also has a grade of “A” for Trade Grade, Buy & Hold Grade, and Peer Grade. In the 22-stock Entertainment – Casinos/ Gambling industry, DKNG is ranked #1. Penn National Gaming, Inc. (PENN) PENN owns and operates racing facilities and casinos across the country. It recently expanded into virtual gaming and sports betting, which bodes well for the stock under the “new normal.” PENN’s revenue for the second quarter that ended June 2020 was $1.11 billion, indicating a year-over-year decline, due to the adverse impact of the coronavirus pandemic. However, the company has undertaken several expansion strategies since then to boost its earnings for the upcoming quarters. PENN launched barstool Sportbook app for online sports betting in multiple games, which quickly gained popularity among the masses and rose to the #1 app on App store. Currently only functioning in Pennsylvania, PENN is planning to expand the reach of the app across the country. It also partnered with Sportsradar to use real-time data of NFL games on its betting platforms. PENN recently raised $982.10 million in an underwritten public offering of 16.10 million shares, which was closed on September 25th. This is expected to drive PENN’s results for the third quarter that ended September 2020. The company expects its revenue for the quarter to be in the range of $1.04 billion to $1.15 billion. Adjusted EBITDA is expected to be around $410 million to $450 million. Its EPS is expected to grow at a rate of 42.6% per annum over the next five years. PENN has gained more than 1,900% since hitting its 52-week low of $3.75 in March. The stock hit its 52-week high of $76.62 in September. PENN’s strong fundamentals are reflected in its POWR Ratings. It is rated a “Strong Buy” with a grade of “A” in Trade Grade, Buy & Hold Grade, and Peer Grade. It is also ranked #2 out of 22 stocks in the Entertainment – Casinos/ Gambling industry. Want More Great Investing Ideas? Do NOT Buy Stocks Before the Election! 7 “Safe-Haven” Dividend Stocks for Turbulent Times Chart of the Day- See Christian Tharp’s Stocks Ready to Breakout NKE shares were trading at $126.64 per share on Friday afternoon, down $0.00 (0.00%). Year-to-date, NKE has gained 25.94%, versus a 5.22% rise in the benchmark S&P 500 index during the same period."}]}