{"article": [{"url": "https://stocknews.com/news/trex-crh-aaon-4-construction-stocks-to-build-a-sturdy-portfolio/", "published": 1595419700.0, "headline": "4 Construction Stocks to BUILD a Sturdy Portfolio", "body": "The construction industry has been quite strong in the past couple of months. This is apparent from several indicators like copper prices, lumber prices, construction equipment companies like Caterpillar (CAT). It’s also evident from the homebuilders, which are now back to or above their pre-coronavirus levels. There’s little reason to believe that its momentum will stall, given low mortgage rates and the low amount of housing supply. The coronavirus is also creating more suburban housing demand as people move out of cities. 7 \"SAFE HAVEN\" Dividend Stocks for Turbulent TimesReal-time indicators like mortgage applications and reports of homes selling for above their asking price are also consistent with this picture. These developments bode well for the construction stocks as their fate is tied to the housing industry. A strong housing market translates into increased revenues for construction stocks due to new homes being built, and people upgrading their existing homes. Here are four high-quality construction stocks: CRH plc (CRH) CRH is a renowned manufacturer of building and construction materials and operates in three primary segments – North American materials, EU materials, and building materials. The company also provides civil engineering contractual services to private builders, contractors, and governments. Though CRH started 2020 on a good note with an increase in sales of building products by 3% in the first quarter, the healthcare crisis started affecting business operations starting in March. As the global lockdown delayed construction activities, CRH’s business operations were halted in Europe and North America. While the company’s sales in the United States increased 8% year over year, business in European and Asian markets slowed down significantly. CRH undertook a massive share buyback program in March, returning more than 200 million pounds to its shareholders. Though CRH has not shared any outlook for the growth of the company in 2020 due to the pandemic, the market expects the company’s EPS to grow 6.6% per annum for the next 5 years. CRH shares regained more than 118% since hitting its 52-week low of $17.73 in mid-March due to a dip in the market. How does CRH stack up for our POWR ratings? A for Trade Grade A for Buy & Hold grade A for Peer Rank B for Industry Rank A for overall POWR rating You can’t ask for better. It also has a #1 rank out of 40 in the Industrial – Building materials industry. TREX Company, Inc. (TREX) TREX manufactures and supplies wooden and plastic materials which have decking and railing use in residential and commercial properties in the United States. It also has wholly-owned subsidiaries operating in lighting, drainage, storage, and furniture manufacturing. TREX managed to sustain its sales volume and profits in the first quarter of 2020, despite the lockdown posing as a barrier. TREX’s net sales increased by more than 12% year over year to $200 million. Gross profit also increased by more than 30%. The impact of COVID-19 on TREX’s business is expected to be reflected in its second-quarter financials, as the lockdown came into effect in mid-March. TREX expects second-quarter earnings to be in the range of $180 to $190 million. The consensus EPS estimate for the second quarter is $0.64, indicating no change from the year-ago number. However, TREX beat consensus EPS estimates in three of the four trailing quarters, which is impressive. TREX’s shares gained more than 120% since hitting the YTD low in mid- March due to the virus-led market crash. This speedy recovery could be due to the growth momentum of the company, which might last for the rest of 2020 given strength in housing and increased home improvement spending. TREX is rated “Strong Buy” in our POWR Ratings system, consistent with its strength in the industrial building materials sectors. It has an “A” in Trade Grade, Buy & Hold grade and Peer Grade, and “B” in Industry rank. Out of the 40 stocks in the Industrial – Building Materials industry, it is ranked #2. AAON, Inc. (AAON) AAON operates in developing, engineering, and manufacturing air conditioning and heating units across the US and Canada. AAON is one of the better-performing stocks of 2020, as it reported record earnings for the first quarter ending March 31st. Net sales rose more than 20% year over year amid the global healthcare crisis. Gross profits also increased by 68% to $42.9 million. TREX managed to streamline the delivery system, which allowed it to maintain the delivery of its products when the country was under lockdown. The consensus EPS estimate for the second quarter of $0.38 indicates a 54% increase year over year. The sales for the quarter are estimated to grow from 5.70% to $135.67 million. TREX has added close to 44% to its stock price since hitting its 52-week low on March 12th. TREX’s impressive performance is reflected in its POWR rating. It has an overall rating of “Strong Buy”, with an “A” in Trade Grade, Buy & Hold Grade & Peer Grade and “B” in Industry Rank. It is ranked #3 out of 40 stocks in the Industrial – Building materials. Installed Building Products, Inc. (IBP) IBP mainly engages in providing indoor insulation, waterproof, and fireproof services to owners of both residential and commercial properties. It also engages in remodeling interiors of buildings. IBP currently has 180 branches across the United States. IBP has acquired three major companies namely Royal Commercial Services, Chicago based shower company, and Nationwide Gutter in 2020 to expand its business in the mid-Atlantic and southern markets. The merger with Nationwide alone is expected to increase IBP’s annual revenues by $5.2 million. IBP’s net revenues for the first quarter ended March 31st were $397.30 million, up 16.1% year over year. Net income rose by 81%. IBP’s monthly revenues for April increased by 2% year over year despite several physical outlets being closed. Though the consensus EPS estimate shows a year over year decline, IBP has surpassed the estimates in the trailing four quarters, which is impressive. IBP recovered more than 155% after hitting its year-to-date low of $30.02 on 19th March. This speedy recovery is due to the sound business model and the expansion of IBP undertook during the first quarter of 2020. IBP is rated a “Strong Buy” in our POWR ratings system, in tandem with its performance in the first quarter. It has an “A” in trade Grade, Buy & Hold Grade and Peer rank, and a “B” in Industry Rank. In the 40-stocked Industrial – Building Material sector, IBP is ranked #4. Want More Great Investing Ideas? 9 “BUY THE DIP” Growth Stocks for 2020 Newly REVISED 2020 Stock Market Outlook 7 “Safe-Haven” Dividend Stocks for Turbulent Times TREX shares were unchanged in after-hours trading Wednesday. Year-to-date, TREX has gained 51.07%, versus a 2.60% rise in the benchmark S&P 500 index during the same period."}]}