{"article": [{"url": "https://stocknews.com/news/amgn-sgen-alxn-gmab-4-game-changing-biotech-stocks-to-buy-right-now/", "published": 1601899700.0, "headline": "4 Game-Changing Biotech Stocks to Buy Right NOW!", "body": "Biotech stocks are among the most coveted stocks during the pandemic, due to their potential to gain significantly in a short span of time through development of an effective vaccine. However, the healthcare industry is facing multiple challenges in addition to the pandemic, including a rising number of cancer patients with each passing day. The American Cancer Society expected at least 1.80 million new cancer cases in 2020. The sedentary lifestyle under the new normal of working and learning from home is expected to put a larger group of people at risk of cancer. Medical advancements in the field of drug development has increased the recovery rate significantly over the past couple of years. Many biotech companies such as Amgen Inc. (AMGN), Genmab A/S (GMAB), Seattle Genetics, Inc. (SGEN) and Alexion Pharmaceuticals (ALXN) are working towards introducing new cancer drugs, as well as improving the efficacy of current medications. AMGN, in collaboration with Adaptive Biotechnologies (ADPT), is also involved in developing fully human neutralizing antibodies targeting SARS-CoV-2 to potentially prevent or treat COVID-19 infection. As the threat of cancer cannot be eradicated overnight, these drugs are expected to drive the revenue and earnings of the above-mentioned companies for the long haul, thereby acting as a profitable bet for investors. 9 \"BUY THE DIP\" Growth Stocks For 2020Amgen Inc. (AMGN) AMGN develops human therapeutic medication for the treatment of cardiovascular, oncology and neuroscience related diseases. Its supply chain comprises wholesale distributors and direct-to-consumer channels. It has recently been included in the Dow Jones Industrial Average. On September 17th, AMGN entered into a global antibody manufacturing collaboration with Eli Lilly and Company (LLY) to significantly increase the supply capacity available for Lilly’s potential COVID-19 therapies. This would allow the two companies to generate profits from scaled up production and supply. AMGN has also shown significant progress in its ongoing clinical trials for refractory melanoma and lung carcinoma. AMGN reported a 6% year-over-year increase in total revenues to $6.20 billion in the second quarter that ended June 2020. Non-GAAP EPS increased 7% from the year-ago value to $4.25, while non-GAAP operating income rose 9% from the same period last year to $3.20 billion. The consensus EPS estimate of $3.80 for the third quarter ending September 2020 indicates a 3.8% rise year-over-year. Moreover, AMGN has an impressive earnings surprise history, as it beat the street EPS estimates in each of the trailing four quarters. The consensus revenue estimate of $6.35 billion for the upcoming quarter indicates a 10.7% rise from the same period last year. AMGN has gained more than 45% since hitting its 52-week low of $177.05 in March. The stock hit its 52-week high of $264.97 in June. How does AMGN stack up for the POWR Ratings? A for Trade Grade A for Buy & Hold Grade A for Peer Grade A for Overall POWR Rating. It is also ranked #1 out of 376 stocks in the Biotech industry. Alexion Pharmaceuticals (ALXN) ALXN is a biopharmaceutical company commercially engaged in the production of therapeutic products. On September 21st, it received a positive opinion and marketing recommendation from CHMP and European Union respectively, for its product Ultomirisis. The drug also received approval from Japan’s Ministry of Health and Labor and Welfare. ALXN also partnered with Caelum BioSciences to develop an amyloid fibril targeted therapy, which is in phase III clinical trials. The company reported a 20% year-over-year increase in net revenue to $1.44 billion in the second quarter that ended June 2020. Non-GAAP diluted EPS rose 17.8% to $3.11 during this time period. Though the consensus EPS estimate of $2.47 for the third quarter ending September 2020 indicates a year-over-year decline, ALXN beat the street EPS estimates in each of the trailing four quarters, which bodes well for the stock. The consensus revenue estimate of $1.39 billion for the third quarter indicates a 10% rise year-over-year. ALXN has gained more than 65% since hitting its 52-week low of $72.67 in March. The stock hit its 52-week high of $121.50 in June. It’s no surprise that AMGN is rated a “Buy” in our POWR Ratings system, with an “A” for Trade Grade and Peer Grade and a “B” for Buy & Hold Grade. It is also ranked #16 out of 376 stocks in the Biotech industry. Seattle Genetics, Inc. (SGEN) SGEN develops and commercially supplies therapy drugs for the treatment of cancer. Its most popular marketed drugs include ADCETRIS and PADCEV, used to treat patients suffering from lymphoma and metastatic cancers. On September 18th, SGEN announced positive results from phase three clinical trials of PADVEC, along with improved overall survival among critical patients, which is expected to support global registrations and accelerated approval in the United States. SGEN entered into two strategic oncology collaborations with Merck & Co (MRK) on September 14th. To this end, MRK is acquiring $1 billion stake in SGEN, allowing the two companies to effectively co-develop and co-commercialize antibody drug Ladiratuzumab for treating breast cancer and solid tumors. SGEN has also received a milestone payment from GlaxoSmithKline (GSK) after receiving approval from the European Commission and FDA. SGEN’s revenue increased 27.3% year-over-year to $278 million in the second quarter that ended June 2020. Cash and cash equivalents balance grew 3.1% from the year-ago value to $895.67 million during this time. The consensus EPS of $0.40 for the third quarter that ended September 2020 indicates significant growth from negative values reported in the same period last year. The consensus revenue estimate of $488.18 million indicates a 130.5% increase year-over-year. SGEN has gained more than 120% since hitting its year-to-date low of $90.57 in March. the stock hit its 52-week high of $200.42 in October. SGEN is rated a “Strong Buy” in our POWR Ratings system, with a grade of “A” in Trade Grade, Buy & Hold Grade, and Peer Grade. It is currently ranked #2 out of 376 stocks in the Biotech industry. Genmab A/S (GMAB) Based in Denmark, GMAB is an international biotechnology company that offers antibody therapeutics for cancer treatment. It currently has two approved antibodies, DARZALEX and Arzerra, and over 20 active pre-clinical programs. GMAB also has a licensing agreement with Janssen Biotech, making it entitled to royalties from the sale of daratumumab. GMAB has increased its share capital for net proceeds of DKK 33.30 million, due to an employee warrant exercise. Furthermore, the company’s collaborations with Janssen Biotech makes it entitled to periodic royalty payments upon sale of Daratumumab and Hexabody -CD38. With a huge client base in the United States, GMAB witnessed soaring revenues and earnings for the second quarter that ended June 2020. Net revenue rose 604.2% year-over-year to DKK 5.54 billion, while net income grew 387.4% to DKK 3.37 billion. Diluted net result per share increased 370.3% to DKK 51.35 during this period. GMAB has delivered a trailing twelve-month gross profit margin of 100%. GMAB growth momentum is expected to continue well into the third quarter, as the consensus revenue estimate of $237.58 million indicates a 53.4% improvement year-over-year. Moreover, the company has an impressive earnings surprise history, as it beat the street net result per share estimates in three out of the trailing four quarters. GMAB has gained more than 135% since hitting its 52-week low of $16.24 in March. The stock hit its 52-week high of $38.87 in September. GMAB is rated “Buy” in our POWR Ratings system, consistent with its sound business model and growth potential. It has a grade of “A” in Trade Grade, Buy & Hold Grade, and Peer Grade. It is currently ranked #3 out of 376 stocks in the Biotech industry. Want More Great Investing Ideas? Do NOT Buy Stocks Before the Election! 7 “Safe-Haven” Dividend Stocks for Turbulent Times Chart of the Day- See Christian Tharp’s Stocks Ready to Breakout AMGN shares were trading at $253.74 per share on Monday afternoon, up $8.33 (+3.39%). Year-to-date, AMGN has gained 7.44%, versus a 6.52% rise in the benchmark S&P 500 index during the same period."}]}