{"article": [{"url": "https://stocknews.com/news/baba-is-now-an-opportune-time-to-buy-shares-of-alibaba/", "published": 1599566900.0, "headline": "Is Now An Opportune Time to Buy Shares of Alibaba?", "body": "Along with being the biggest e-commerce retailer in China, Alibaba Group Holding Ltd. (BABA) is the sixth most valuable company in the world. Since its debut in 1999 as an e-commerce company, BABA has continually expanded with its latest moves in cloud computing and artificial intelligence. BABA has been in the limelight recently as the biggest stakeholder in the Ant Group. With a 33% ownership stake at the Ant group, it is expected to benefit significantly from what is expected to be the world’s largest IPO in history. It’s also been aggressively investing in delivery to complement its logistics business. BABA is planning to expand its stake in Chinese Courier firm YTO Express from 10% to 30%. This would also benefit its retail business, as faster and more efficient deliveries will attract more customers. BABA’s strong growth momentum of the business as well as its impressive financial performance in the recent quarters despite the pandemic-oriented challenges have helped it earn a “Strong Buy” rating in our proprietary rating system. 7 Best ETFs for the NEXT Bull MarketHere’s how our proprietary POWR Ratings system evaluates BABA: Trade Grade: A BABA is currently in an uptrend, as it is trading higher than its 50-day and the 200-day moving average of $256.76 and $219.63, respectively. The stock gained more than 28% in the past three months and is expected to rise even further in the upcoming months. The short-term bullishness of the stock might be due to its impressive performance in the fiscal first quarter ended in June 2020. As China resumed operations in this quarter, BABA’s revenue grew 34% year-over-year to $21.76 billion. Income from operations grew 42% from the year-ago value to $4.91 billion, while net income rose 143% to $6.57 billion. Analysts estimate BABA’s revenues to increase 53.3% year-over-year to $22.94 billion, which should translate into momentum for the stock in the near term. Buy & Hold Grade: A BABA has gained more than 35% year-to-date to hit its 52-week high of $299 in September. In terms of proximity to its 52-week high, which is a key factor that our Buy & Hold Grade takes into account, BABA is well-positioned. The stock is currently trading just 6.3% below its 52-week high. The stock has gained more than 340% in the last five years. It has an impressive long-term performance history, as its three-year revenues grew at a CAGR of 41.9%. Three-year net income and diluted EPS grew at a CAGR of 51.1% and 49%, respectively. The main driver of BABA’s performance is the growth of the Chinese e-commerce market. Also, BABA’s aggressive pricing strategy has led to a higher user base. BABA has become one of the biggest names in the cloud computing market in a short span. It is the biggest provider of Infrastructure-as-a-service (IaaS) in Asia, and the third-largest platform in the world, according to Gartner. Past performance as well as future expansion plans indicate that BABA is well-positioned to sustain its long-term bullishness. Peer Grade: A BABA is ranked #1 out of 115 stocks in the China industry. Other popular stocks in this group include NetEase, Inc. (NTES), New Oriental Education & Technology Group (EDU), and Huazhu Group Ltd. (HTHT). While NTES beat BABA by gaining 59.6% year-to-date, EDU and HTHT returned 23.1% and 13.2%, respectively, over this period. Industry Rank: B The China industry is ranked #25 out of 123 industries. The stocks under this industry have an average POWR Rating of “Buy”, indicating its growth potential in the upcoming months. China has successfully resumed its operations in the April-June quarter and is the only country to report positive GDP growth of 3.2% year-over-year. Overall POWR Rating: A (Strong Buy) Overall, BABA is rated a “Strong Buy” due to its impressive past performance, short-and-long-term bullishness, and solid price momentum, as determined by the four components of our overall POWR Rating. Bottom Line Despite soaring more than 33% so far this year, BABA has the potential to grow even further based on its continued business growth, favorable revenue outlook, and price momentum. Analyst sentiment, which gives a good sense of a stock’s future price movement, is pretty impressive for BABA. Of the 58 Wall Street Analysts that rated the stock, 50 have given it a “Strong Buy.” Hence, it is an ideal time to invest in BABA to enjoy an expected three-digit price return shortly. Want More Great Investing Ideas? 7 Best ETFs for the NEXT Bull Market Will Stocks Fall into Historical September Slump? 9 “BUY THE DIP” Growth Stocks for 2020 BABA shares were trading at $270.02 per share on Tuesday afternoon, down $11.37 (-4.04%). Year-to-date, BABA has gained 27.31%, versus a 4.59% rise in the benchmark S&P 500 index during the same period."}]}