{"article": [{"url": "https://stocknews.com/news/ctl-hp-nbl-wrk-nwl-5-dividend-dumps-just-waiting-to-happen/", "published": 1594901300.0, "headline": "5 Dividend Dumps Just Waiting to Happen", "body": "Let’s keep our heads and our dividends above water in this crazy year that is 2020. Most income investors know that it’s been brutal for dividends. But do you know how horrific it’s actually been? Our pal Howard Silverblatt of S&P Dow Jones Indices has slapped an official number on it: $42.5 billion. 7 \"SAFE HAVEN\" Dividend Stocks for Turbulent TimesThat’s how much cash U.S. stocks cut or suspended their dividends by in the second quarter alone. We haven’t seen pay cuts this steep since Q1 2009, when investors received $43.8 billion less in cash distributions than the year prior. This wasn’t just a couple of large dividend programs tanking, either. In Q2, S&P Dow Jones Indices identified 639 dividend cuts (or outright eliminations) versus just 244 raises. For perspective, consider that in 2019, it was 492 hikes versus a mere 62 cuts or suspensions. Now the worst is likely behind us. But that doesn’t mean every dividend on the board is now safe. Many are still going to suffer as the pie-in-the-sky “V-shaped” recovery slumps into a more realistic bathtub shape. Let’s revisit the DIVCON dividend-health rating system from Reality Shares to see the best and worst companies on the income spectrum. DIVCON 5 stocks that are well-equipped to continue and even raise their payouts, and DIVCON 1 stocks that are at the highest risk of a cut (or, another one). Here are five dividends that continue to worry me. These stocks, yielding anywhere from 1% to 10%, might not eliminate their dividends tomorrow. But they’ve been flagged for their worrisome fundamentals, signaling the potential for future weakness—and payout cuts sometime down the road. 3 Potential “Repeat Offenders” Let’s begin with a trio of stocks, repeat payout problem children, that DIVCON already nailed on the head. The dividend-health system gave each of these firms its lowest rating ahead of their dividend cuts, but continued DIVCON 1 ratings suggest the stocks are far from in the clear, even at their reduced rates: Oil and gas contract driller Helmerich & Payne (HP), which has a 5.3% yield, announced in March that it would cut its dividend by almost 65%. Exploration and production firms are hurting from lower oil prices, as are companies that provide services to the E&P industry. Wall Street sees the company flipping from a $1.75-per-share profit in 2019 to a $1.24 loss this year. It looks worse in 2021, though. HP is already projected to lose twice as much ($2.67 per share). Helmerich’s profits are all over the place, including normalized net losses in two of the past five years. Drilling services is a difficult business, and investors are treated to a roller-coaster ride as a result. Noble Energy (NBL), which has a 0.9% yield, is looking shaky, too. This independent energy exploration firm has operations in the US, eastern Mediterranean and West Africa, and it has lost nearly two-thirds of its value since the start of the year. Earlier this year, Noble had reduced capital expenditures by roughly 50%. But it dug in even deeper in April when it eliminated another $350 million in capex and announced its 85% dividend cut. Yet again, analysts are expecting losses not just this year, but next. NBL and HP Were Left Behind for Good Reason WestRock (WRK), which has a 2.9% yield, is a more nuanced disappointment. WestRock is a packaging company that came about in 2015 with the merger of RockTenn and MeadWestvaco. It makes everything from beer multipack cartons to retail displays to e-commerce packaging. And you and I both know how powerful a trend e-commerce is. But it’s not riding that bull, it’s getting trampled by it. Deutsche Bank analysts say the industry faces supply-chain issues and the potential for pricing battles. And again, profitability is extremely variable here, as is the stock itself. This Is No E-Commerce Winner Like Noble Energy and Helmerich & Payne, WestRock could be a quick swing trade. But after its 57% dividend cut, you’re not exactly getting paid well to wait out a prolonged slump in shares. CenturyLink (CTL) Dividend Yield: 10.3% I beat up on CenturyLink from time to time, but again and again, banking on its large yields has turned out to be a sucker’s bet. The stock has already cut its dividends twice in the past seven years: first in 2013 (by 26%) and again in 2019 (by 54%). But DIVCON still has CTL, whose yield has yet again “soared” up into the double digits, as a DIVCON 1. (As my friend and fellow investment writer Brian Hunt is fond of saying, CTL’s stock has split several times “the wrong way”—with its price being chopped in half again and again!) How CTL Maintains Its High Yield CenturyLink’s problems persist. The provider of home and business phone, Internet and TV services, as well as security, cloud solutions and more, continues to face declines in its margin legacy businesses. Roughly a third of its top line is tethered to “obsolete” copper networks, Oppenheimer says. And shutdowns aren’t helping. Revenues are expected to wane by the high-single-digits this year, and the company sits under nearly $35 billion in net debt. CTL might be able to afford the dividend, but it’ll have a harder time paying off debt if it does. But if CenturyLink does bring out the cleaver once more, we could see the dividend go completely. And that would end CTL’s disgraced run of double-digit yields for good. Newell Brands (NWL) Dividend Yield: 5.9% Newell Brands is, true to its name, a collection of brands. Elmer’s glue, PaperMate pens, Sharpie markers, Baby Jogger strollers, Coleman camping supplies, BRK alarms, Rubbermaid storage solutions and Sunbeam appliances are just a few of several dozen household names under the Newell umbrella. But some of the brands are busts, namely Jarden, which Newell acquired in 2016. NWL is worth a third of what it was then, with several fits and starts in between. In 2018, it announced a transformation plan meant to shrink both its workforce and its brand count, but while it ditched a few brands (such as Jostens and Pure Fishing), it decided not to pull the trigger on its Rubbermaid Commercial Products unit. Based on 2020 earnings projections (a 40% decline), Newell is staring down a 90% dividend payout ratio. It’s also sitting on more than $6 billion in net debt it needs to cut down. Moreover, the distribution has been stuck at 23 cents per share for more than three years, so at the very least, it’s not going anywhere soon. NWL might claw back some more of its losses on positive reopening news, but the company’s long-term positioning makes it look like dead weight for retirement accounts. Want More Great Investing Ideas? Your Early Retirement Portfolio: 7.7% Dividends—Every Month—Forever How to Retire on 10% Dividends Paid Monthly The Simple (and Safe) Way to Earn 15% Every Year from Stocks CTL shares were trading at $9.93 per share on Thursday afternoon, up $0.22 (+2.27%). Year-to-date, CTL has declined -21.37%, versus a 0.69% rise in the benchmark S&P 500 index during the same period."}]}