{"article": [{"url": "https://stocknews.com/news/zg-pmt-redf-fthm-4-stocks-benefiting-from-the-hot-housing-market/", "published": 1599221300.0, "headline": "4 STOCKS Benefiting from the Hot HOUSING MARKET", "body": "Despite high unemployment and a shrinking economy, the U.S. housing market is hot now. This phenomenon has attracted the attention of many analysts and economists that have narrowed it down to two reasons. First is the historically low Fed interest rates, which have reduced the mortgage rates significantly, making it relatively cheaper to buy a house. According to Bankrate’s latest weekly survey of large lenders, the benchmark 30-year fixed mortgage remained at 3.14% in one week, down 710 basis points year-over-year. Second, the pandemic has forced us to spend more time indoors, causing people to move out or shift to a bigger place to adjust to the new normal of working and learning from home. Purchasing or renting a new home has never been as easy as it is now, thanks to the advanced tech-oriented real estate brokerage companies. The housing industry transactions are gradually becoming remote, reducing the hassles of multiple visits during this tumultuous time. The best performing tech-based housing companies in 2020 are Zillow Group, Inc. (ZG), Redfin Corporation (REDF), PennyMac Mortgage Investment Trust (PMT), and Fathom Holdings, Inc. (FTHM), which reported impressive earnings and revenues in the April-June quarter. As the housing sector boom is expected to continue, these companies should keep thriving. 7 Best ETFs for the NEXT Bull MarketZillow Group, Inc. (ZG) ZG offers buying, selling, and leasing of real estate properties on its mobile and web applications. It operates through three main segments – Homes, Internet, Media and technology, and Mortgages. ZG’s portfolio of consumer brands include Zillow, Trulia, StreetEasy, HotPads, Naked Apartments and RealEstate.com. In the booming housing market, Zillow’s Weekly Market Report stated faster sales of listed homes and increasing average prices. Newly pending sales increased 16.9% year-over-year in August, with median list price rising 7.3% from the year-ago value. ZG’s second quarter earnings report reflects these industry tailwinds. Total revenue increased 28% year-over-year to $768 million. Cash balance at the end of the quarter reached a record of $3.5 billion, indicating a 34.6% sequential growth. Adjusted EBITDA grew 591.2% to $15.83 million. The favorable backdrop is expected to drive the third quarter results even higher. The consensus EPS estimate of $0.11 for the quarter indicates considerable improvement from the negative value a year ago. Also, ZG beat the street EPS estimates in each of the trailing four quarters, which is impressive. ZG has gained more than 395% since hitting its 52-week low of $18.65 in March. The stock hit its 52-week high of $92.66 in September. How does ZG stack up for the POWR Ratings? A for Trade Grade B for Buy & Hold Grade A for Peer Grade A for Industry Rank B for Overall POWR Rating. It is also ranked #15 out of 57 stocks in the Internet industry. Redfin Corporation (REDF) REDF is an online real estate brokerage company operating in the United States and Canada. Designed for both home buyers and sellers, REDF provides an automated home valuation tool known as Redfin Estimate. For the 4-week period ending August, 16th, median home prices have risen 11% year-over-year, according to the latest REDF report. This is the highest gain in the housing market since 2014. A recent survey stated that 255 of the potential homebuyers have moved or are planning to move soon, as the pandemic has accelerated the demand for personal space. As a result, REDF’s net revenues increased 8% year-over-year to $214 million in the second quarter that ended in June 2020. Gross margin increased 200 basis points from the year-ago value to 34%. In this regard, REDF CEO Glenn Kelman said, “Within the span of a single quarter, year-over-year changes in demand went from -41% to +40%, a level of volatility that I have never seen in nearly 30 years of business. Over the past two months, Redfin’s online visits and customer inquiries have been growing at a faster rate than at any point in the last three years.” REDF’s business outlook for the third quarter ending September 2020, indicates quarterly revenues to be in the range of $214 to $225 million. REDF’s revenue grew 53.1% in the past 12 months, which is higher than 90.5% of the US stocks in the StockNews.com universe. Net income is expected to be in the range of $18-$23 million. The consensus EPS estimate of $0.20 for the third quarter indicates a 185.7% improvement year-over-year. Also, REDF has an impressive earnings surprise history, as it beat the street EPS estimates in each of the trailing four quarters. REDF has gained more than 430% since hitting its 52-week low of $9.62 in march. The stock hit its 52-week high of $51.49 in September. REDF’s fundamentals and underlying industry strength is reflected in its POWR Ratings. It is rated a Buy with a grade of A in Trade Grade and Peer Grade, and a B in Buy & Hold Grade. In the 44-stock Real Estate Services industry, REDF is ranked #6. PennyMac Mortgage Investment Trust (PMT) PMT is a specialty finance company investing in mortgage-backed assets based in the United States. It conducts all its operations through PennyMac Operating partnership L.P. in three segments – Credit Sensitive Strategies, Interest Rate Sensitive Strategies and Correspondent Production. PMT reported impressive gains for the second quarter that ended in June 2020. Net gain on investments increased 457.1% year-over-year to $488.93 million. Net investment income rose 479.1% from the year-ago value to $558.32 million. Consensus EPS estimate of $0.78 for the third quarter ending September 2020 indicates a 9.8% increase year-over-year. Also, PMT beat the street EPS estimates in three out of trailing four quarters, which is impressive. The consensus revenue estimate of $177.28 million indicates a 35.6% growth from the same period last year. PMT’s shareholder yield of 38.4% is greater than 92.3% of the other US stocks in the StockNews.com universe, ensuring a high return on investment for shareholders. PMT hit its 52-week high of $23.79 in February this year, but collapsed to its 52-week low of $3.50 in March, due to the pandemic driven market crash. The stock has gained more than 390% since then. PMT has a grade of Bin Peer Grade in our POWR Ratings system. Out of 31 stocks in the REITs- Mortgage Industry, it is ranked #7. Fathom Holdings, Inc. (FTHM) FTHM is a cloud-based technology driven real estate brokerage company which offers access to various properties on sale or lease through its website. FHTM went public on August 4th, with a mini-IPO that helped it raise $34.30 million capital. High fund availability in a booming housing market allowed FTHM to expand its business operations, and in turn, its revenue and earnings in the second quarter that ended in June 2020. Net revenue increased 39% year-over-year to $38.70 million, as the real estate transaction grew 31% from the year-ago value to 5,848. Average revenue per transaction increased 6% from the same period last year. FTHM generated positive GAAP income and non-GAAP adjusted EBITDA, compared to negative values reported in the prior-year quarter. FTHM gained more 95% in the past one and half months to reach $19.85. Want More Great Investing Ideas? 7 Best ETFs for the NEXT Bull Market Beware Stocks in September? 9 “BUY THE DIP” Growth Stocks for 2020 ZG shares were trading at $82.34 per share on Friday afternoon, down $2.68 (-3.15%). Year-to-date, ZG has gained 80.02%, versus a 6.59% rise in the benchmark S&P 500 index during the same period."}]}