{"article": [{"url": "https://stocknews.com/news/spy-my-favorite-options-trading-platform/", "published": 1597234100.0, "headline": "My Favorite Options Trading Platform", "body": "We’ve discussed how there has been a resurgence in day trading not seen since the late 1990’s dot.com boom. Brokerage firms from the original online platforms such as “Ameritrade (AMTD)” to the new firms such as Robinhood which drove the trend towards commission-free stock trading. The free trades, combined with work from plus and some stimulus money created the perfect storm for young people, or those that have never traded before, to open accounts and begin actively trading. And we’ve also seen a huge increase in options trading from this same group which has some in the industry doubled worried as their afraid people are not being sufficiently warned of the risks. It should be noted that just because you have a stock account doesn’t automatically mean you can trade options. All firms will require a separate authorization before you can take advantage of option trading. Most firms to varying degrees will require you to show some base level of options before granting authorization. Again, some in the industry complain that the approval process is too easy for some platforms. For my part, I’m a bit torn; some firms create a catch-22 in that if you say you have no options experience you can’t be approved, but if they don’t let you trade how will you get experience? I think in this case, it’s OK to tell a little white lie and just check all boxes. You should be responsible and make you’re not getting in over your head by educating yourself. Also, most firms have their own forms of risk control that provide some guard rails that prevent you from making trades that could result in losses that are too large for your account size. In that vein, some firms require certain account minimums to engage in certain strategies. 7 \"SAFE HAVEN\" Dividend Stocks for Turbulent TimesPart of choosing the right broker will depend on your approach to investing/trading. If you simply want to buy puts or calls for pure speculation I suppose a Robinhood type account is fine. But if you want to take trading/investing seriously and take full advantage of all the benefits of using options strategically, then you want a robust platform. It should be one that also has resources and tools such as education center, charting and position analysis There are some great firms out there. My top choice is Tastyworks. The platform was built by Tom Sosnoff who originally created ThinkorSwim, which is now part of Ameritrade and is probably my second favorite, and is truly built by options traders. It is fairly intuitive and affords a tremendous amount of flexibility to customize your experience. It offers multiple ways to set up the screen with watchlists, charts, option chains and has a host of analytic tools. Another great aspect is Tasty doesn’t have approval levels for engaging in different strategies. This is because it has a terrific back in risk management. If your account has the money to establish a position, even naked option selling which I personally don’t recommend, it will allow you to do it. This stands in contrast to some firms which won’t even allow basic spreads even though they have limited and defined risk. Also, Unlike Think or Swim or “Interactive Brokers (IBKR)” which have a $5,000 account minimum, Tasty has no minimum requirement to open the account. So, if you’re thinking about getting started in trading options you can open an account at Tasty with literally $1 and start using their virtual or paper money feature to practice entering orders and testing out different strategies without risking any real money. Of course, when you’re ready to start trading for real, you’ll need to fund the account with a more realistic amount. My own opinion is you should have at least $2,000 of risk capital before going live with options trading. Click here to find out more about author Steve Smith’s unique and profitable options trading approach — the Options360 service. Want More Great Investing Ideas? 3 Possible Directions for the Stock Market from Here How to Trade THIS Stock Bubble? 9 “BUY THE DIP” Growth Stocks for 2020 SPY shares were trading at $337.84 per share on Wednesday afternoon, up $5.04 (+1.51%). Year-to-date, SPY has gained 6.05%, versus a % rise in the benchmark S&P 500 index during the same period."}]}