{"article": [{"url": "https://stocknews.com/news/tsla-grwg-ostk-3-stocks-that-recently-gained-more-than-20/", "published": 1598270900.0, "headline": "3 Stocks That RECENTLY GAINED More than 20%", "body": "Due to the strong housing market, improving labor market, and resilience in consumer spending, the economy has been better than expected. Further, earnings have also outperformed compared to expectations especially for the mega-cap tech stocks which comprise a large portion of the S&P 500. These factors in combination with the Fed’s aggressive interventions and the federal government’s fiscal largesse have resulted in a V-shaped rebound for stocks. Last week, the S&P 500 made new all-time highs. However it was a mixed week as small-caps sold-off and more economically-sensitive areas like financials and travel stocks were weak as well. Stocks that are leaders in industries with long-term growth potential outperformed. Examples of these industries are electric cars, crypto, e-commerce, and cannabis. So, it’s not surprising that Tesla, Inc. (TSLA), Overstock.com, Inc. (OSTK), and GrowGeneration Corp. (GRWG) are among the stocks that gained more than 20% last week. 7 \"SAFE HAVEN\" Dividend Stocks for Turbulent TimesTesla, Inc. (TSLA) TSLA designs, develops, manufactures, and sells electric vehicles, electric vehicle powertrain components, and stationary energy storage systems in the United States, China, Norway, and internationally. The stock gained 24% last week to close Friday’s session at $2049.98. Strong Model 3 demand from China and the expectation of new battery developments were the primary factors behind the stock’s gains. Moreover, the company announced a five-for-one stock split earlier this month. Some see this as driving increased retail inflows into the stock. Already, TSLA has a year-to-date gain of 390%. TSLA reported strong second-quarter results. EPS for the quarter came in $2.18, delivering an earning’s surprise of 7167%. Additionally, TSLA has beaten EPS estimates in each of the trailing four quarters. The Street also expects TSLA’s inclusion in the S&P 500 index due to its strong earnings momentum. The stock may skyrocket further as institutional investors are forced to buy the stock. After the huge success of the Model 3 and Model Y car, TSLA may announce its new Model S Plaid soon which could lead to further upside for the stock. How does TSLA stack up for the POWR Ratings? A for Trade Grade A for Buy & Hold Grade A for Peer Grade B for Industry Rank A for Overall POWR Rating The stock is also ranked #1 out of 27 stocks in the Auto & Vehicle Manufacturers industry. Overstock.com, Inc. (OSTK) OSTK is a tech-driven online retailer that offers furniture, home décor, and other related products. Apart from providing its products through its internet website, the company also focuses on the development and commercialization of financial applications of blockchain technologies. The stock closed Friday’s trading session at $121.09 delivering 27.7% returns last week. The year-to-date gain for the stock is more than 1617%. OSTK reported strong second-quarter results with the top-line increasing 109% year-over-year to $782.5 million. With the accelerating demand for online products, OSTK has scaled up its operations by growing its new customer base by more than 200% year-over-year. Moreover, the company delivered an earnings surprise of 1100% with reported EPS of $0.8. The recent spike in crypto markets is driving buying in OST. tZero group, a majority-owned subsidiary of OSTK, focuses on the development of fintech based on blockchain technologies. It accounts for approximately 95% of token trade volume and 80% of the total token dollar value. Additionally, the subsidiary has recently signed an agreement with Aspen Digital to trade St. Regis Aspen token on its alternate trading system Furthermore, the company recently announced a follow-on public offering of 1.7 million common shares. OSTK is rated a “Strong Buy” in our POWR Ratings system, consistent with its strong performance and momentum. It holds an “A” in Trade Grade, Buy & Hold Grade and Industry Rank, and a “B” in Peer Grade. It is ranked #12 out of 54 stocks in the Internet industry. GrowGeneration Corp. (GRWG) GRWG owns and operates retail hydroponic and organic gardening stores in the United States. It also operates GrowGen.Pro, an online e-commerce store and engages in the marketing and distribution of horticultural, organics, and lighting and hydroponics products. The stock closed Friday’s trading session with a weekly gain of more than 33%. It closed the week’s last session at $17.34. The stock’s ascent started after its second-quarter earnings reported earlier this month. Revenue increased 123% year-over-year to $43.5 million as same-store sales surged 49%, and online business sales jumped 149% despite lockdowns affecting the first half of the quarter. Net income for the quarter came in $2.6 million, increasing 142% year-over-year. GRWG is a “picks-and-shovels” cannabis stock, as it will profit from the overall growth in the industry. The pandemic has also resulted in increased interest in gardening. With the presidential election approaching, the sector could take off if the Democratic presidential candidate Joe Biden gets elected as that could pave the way to legalization, or at least deregulation. It’s no surprise that GRWG is rated “Buy” in our POWR Ratings system. It also has an “A” for Trade Grade and Industry Rank and a “B” in Peer Grade. It is ranked #34 out of 68 stocks in the Home Improvement & Goods industry. Want More Great Investing Ideas? The Best of StockNews 2 Step Process to Sell @ Market Top in September 9 “BUY THE DIP” Growth Stocks for 2020 TSLA shares . Year-to-date, TSLA has gained 381.49%, versus a 7.64% rise in the benchmark S&P 500 index during the same period."}]}