{"article": [{"url": "https://stocknews.com/news/nke-nls-dks-3-fitness-stocks-to-keep-your-portfolio-in-shape/", "published": 1594901300.0, "headline": "3 Fitness Stocks to Keep Your Portfolio \"In Shape\"", "body": "As people went into lockdown due to the coronavirus, one of the many unfortunate side effects of staying home all the time was weight gain. People stopped going to the gym, and when you’re not working out, it can be hard to stick to a diet. So, weight gain was the result for many. Now that warmer months are upon us, people are choosing to get back into shape for that beach body. The pandemic has created a growth industry for certain products, such as home fitness equipment, apparel, online workouts, and more. This provides an opportunity for investors to take advantage of this trend back towards fitness. Here are three stocks in the fitness industry that can help keep your portfolio fit. Nike, Inc. (NKE) 7 \"SAFE HAVEN\" Dividend Stocks for Turbulent TimesNike needs no introduction. As one of the most popular brands in athletic and recreational products, NKE has managed to survive the economic implications of COVID-19 pandemic through its extensive digital marketing strategies. The company managed to compensate for its loss in sales due to closed physical outlets by increasing digital sales by 75%, thereby generating 30% of the total revenue in fiscal fourth quarter. With most Nike outlets reopening around the country since June, the company is slowly regaining its previous sales turnover. While explaining the vision for 2021, NKE CEO John Donahoe stated, “Amid macroeconomic uncertainty, we will continue to operate with agility, focused on optimizing marketplace supply and demand, cost management and leveraging our financial strength to drive long-term sustainable, profitable growth.” NKE has gained more than 60% since hitting its 52-week low in mid-March. With expected annualized earnings growth of 23.6% for the next five years and a dividend yield of 1.01%, the stock is an attractive bet. How does NKE stack up for the POWR Ratings? A for Trade Grade A for Buy & Hold Grade B for Industry Rank B for Overall POWR Rating The stock is also ranked #8 out of 32 stocks in the Athletics & Recreation industry. Nautilus, Inc (NLS) NLS is a popular name in the fitness industry both domestically and in international markets. As one of the pioneer companies operating in fitness equipment since 1986, NLS is one of the top performing momentum stocks that has beat the recessionary trends. Though gyms are starting to reopen, people will try to avoid going there in order to prevent exposure to the virus. So, NLS should witness increased demand for its home fitness products in this “new normal.” NLX beat the consensus EPS estimates over the last two quarters. The consensus revenue estimate of $68.74 for the quarter ending June 2020 indicates a year-over-year increase of 12.9%. Though NLS hit its 52-week low of $1.20 in mid-March, the company managed to regain price momentum quickly. The stock gained more than 750% since then. It’s no surprise that NLS is rated a “Strong Buy” in our POWR Ratings system. It also has an “A” for Trade Grade, Buy & Hold Grade and Peer Grade, and a “B” for Industry Rank. In the 32-stock Athletics & Creation industry, it is ranked #7. Dick’s Sporting Goods, Inc. (DKS) Dick’s Sporting Goods is one of the most popular stocks under the Athletic and Recreation industry. With a comprehensive product range of fitness machinery, clothes and footwear, DKS has managed to gain market share in the first half of 2020, as people are looking to move from crowded gyms to setting up their home workout stations. DKS managed to gain more than 100% since hitting its 52-week low in mid-March due to the pandemic-led market crash. With a strong e-commerce presence, revenue lost due to closure of all physical outlets was compensated with a 210% rise in online sales during the lockdown period. With gradual upliftment of restrictions, almost 80% of DKS stores have reopened for business since May, which is estimated to boost revenues. The consensus revenue estimate of $2.25 billion for the quarter ending July is almost in line with the year-ago number. Moreover, DKS has an impressive earnings surprise history with the company beating consensus EPS estimates in three out of the last four quarters. According to the POWR Ratings, DKS has a “B” for Trade Grade and Industry Rank. The stock is ranked #18 out of 32 Athletics & Recreation stocks. Want More Great Investing Ideas? 9 “BUY THE DIP” Growth Stocks for 2020 Newly REVISED 2020 Stock Market Outlook 7 “Safe-Haven” Dividend Stocks for Turbulent Times NKE shares were unchanged in after-hours trading Thursday. Year-to-date, NKE has declined -3.49%, versus a 0.69% rise in the benchmark S&P 500 index during the same period."}]}