{"article": [{"url": "https://stocknews.com/news/cpe-callon-petroleum-company-shows-signs-of-hitting-a-bottom/", "published": 1599221300.0, "headline": "Callon Petroleum Company Shows Signs of Hitting a Bottom", "body": "Callon Petroleum Company (CPE) has been bounced from the lows set on Thursday after a substantial downfall. The battered oil firm is showing signs of bottoming out. Callon Petroleum Company’s stock performance depends on financials more than oil prices. Shares of Callon Petroleum Company might have hit a bottom. The Houston-based energy firm’s market capitalization has hit a low point of $250 million. This low level matches the sum available to it in its credit facility. Callon has already exhausted $1.45 billion out of $1.7 billion; its current low valuation may prompt bargain-seekers to scoop up some stock. Another reason for optimism is the leap in Whiting Petroleum Corporation. Callon’s Colorado-based rival has emerged from Chapter 11 bankruptcy protection after five months following a financial restricting and a reshuffle of management. Investors may now be on the lookout for the next oil company that may bounce from the bottom. 7 Best ETFs for the NEXT Bull MarketThe broader energy sector has been stabilizing alongside oil prices. West Texas Intermediate (WTI) Crude Oil is trading steadily above $40 after turbulent months around the peak of the coronavirus crisis. The recent drawdown in US petroleum inventories is another bullish factor supporting the industry. However, Callon’s finances will likely impact the share value more than broader oil prices. Investors who bought CPE shares earlier in the summer are still reeling from the 41.8% fall in August, partially triggered by the firm’s acquisition of Carrizo Oil and Gas. That expansion proved only to add more debt rather than income. Similar to Whiting, the key to recovery is shoring up financials and avoiding bankruptcy. There is still room to bounce from the bottom of the barrel. CPE stock quote CPE ended Thursday’s trading session at $6.29, up about 6.25%. It is still trading at a fraction from its 52-week high of $53.60, but the stock’s ability to defy the sell-off in markets – S&P 500 tumbled by 3.50% – is a bullish sign for bargain-seekers. The immediate upside target is the late August peak of $7.35, while Wednesday’s close at $5.92 is the first support line to watch. CPE shares were trading at $6.23 per share on Friday afternoon, down $0.06 (-0.95%). Year-to-date, CPE has declined -87.10%, versus a 6.59% rise in the benchmark S&P 500 index during the same period."}]}