{"article": [{"url": "https://stocknews.com/news/nem-btg-ngd-fsm-4-precious-metal-stocks-to-buy-if-the-us-dollar/", "published": 1601294900.0, "headline": "4 Precious Metal Stocks to Buy if the US Dollar Weakens", "body": "There are a number of reasons to expect the US dollar to weaken over the coming months. There is political uncertainty due to the November presidential election which has the potential to turn into a crisis if there is a close election. The Fed has committed itself to a very dovish path. And, there is a bipartisan agreement that another dose of fiscal stimulus is needed. All of these factors are bullish for precious metals. So far, 2020 has been a good year for the sector. Investors have flocked to precious metals due to the economic and political uncertainty as well as the expectations of additional stimulus. In recent weeks, there has been profit-taking in the sector but this could end up being an attractive entry point. Quite naturally, stocks of companies that are involved in mining these precious metals should continue to climb. Newmont Corporation (NEM), B2Gold Corporation (BTG), New Gold, Inc. (NGD), and Fortuna Silver Mines (FSM) should gain significantly if the US dollar weakens. 7 \"SAFE HAVEN\" Dividend Stocks for Turbulent TimesNewmont Corporation (NEM) NEM is involved in the exploration, development, and marketing of gold, silver, and copper. The company has operations in the United States, Peru, Indonesia, Australia, New Zealand, and Ghana. The company has benefited from the rise in gold prices caused by the spread of the coronavirus. NEM’s stock has gained 41.4% so far this year. The company reported solid earnings during the second quarter, with revenue rising 5% due to the higher average price of gold. The company has recently announced an agreement with Maverix Metals to sell 11 pre-production royalties at $90 million. The company has also signed a strategic alliance with Kirkland Lake Gold to jointly explore opportunities around Kirkland’s properties in Ontario, Canada, and around Newmont’s properties in Timmins. The company’s revenue is expected to grow 18.6% this year and 19.2% next year. NEM’s EPS is estimated to rise 87.1% this year and at a rate of 35.7% per annum over the next five years. How does NEM stack up for the POWR Ratings? B for Trade Grade B for Buy & Hold Grade B for Industry Grade B for Overall POWR Rating The stock is also ranked #6 out of 30 stocks in the Miners – Gold industry. B2Gold Corporation (BTG) BTG explores, develops, and markets gold and other minerals. The company has operations in Chile, Burkina Faso, Namibia, the Philippines, and Nicaragua. The company’s stock has returned 58.8% for this year. The company reported a stellar quarter which saw a year-over-year increase in revenue of 65%. The company has recently announced the completion of its construction and expansion of a mill at Fekola. This expansion will take the production of the mill to 7.5 million tonnes per annum. BTG has also announced positive results from their drilling operations near Cardinal and FMZ zones around the Fekola area and the Mamba zone in the Anaconda area. The company has declared a third-quarter cash dividend of $0.04 per share. BTG has a dividend yield of 2.51%. It’s no surprise that BTG is rated a “Buy” in our POWR Ratings system, with a grade of “A” in Trade Grade and Peer Grade. In the 30-stock Miners- Gold industry, it is ranked #10. New Gold, Inc. (NGD) NGD is engaged in the exploration, mining, development, and sale of gold and other mineral properties. The company has operations in the United States, Canada, Chile, Mexico, and Australia. The company’s stock has had a stellar year and has returned 88.6% year-to-date. NGD has recently sold its operations in the Blackwater project to Artemis Gold, Inc. at a valuation of $190 million along with a gold stream of 8%. Additionally, the company received $34.4 million worth of stocks in Artemis Gold. The company has also closed a strategic partnership deal with the Ontario Teachers’ Pension Plan through which the latter has acquired a 46% free cash flow interest in the New Afton mine. In a forecast for the rest of the year, the company has stated that it will focus on bringing production back to pre-coronavirus levels. The company is also engaged in completing all non-recurring capital projects in Rainy River. NGD is also going ahead with completing the development of the C-zone mine. NGD’s strong fundamentals are reflected in its POWR Ratings, it has a “Buy” rating with a grade of “A” in Trade Grade, and a “B” in Peer Grade and Industry Rank. In the 30-stock Miners- Gold industry, it is ranked #5. Fortuna Silver Mines (FSM) FSM engages in the exploration and development of silver and gold mining properties. The company has operations in Latin America. FSM’s stock has delivered returns of 52.9% so far this year. The company has completed the construction relating to the Lindero Gold project, and they have started irrigation and leaching of ore. The company has also resumed operations at the Cayllamo Mines, Peru that was suspended due to the spread of the coronavirus and the resultant government lockdowns. FSM has raised $69 million through an equity offering of 23 million shares. The company is also focusing on inculcating a sustainability-based approach to its operations to ensure steady long-term prospects. It’s no surprise that FSM is rated a “Buy” in our POWR Ratings system, with a grade of “A” in Trade Grade, and a “B” in Peer Grade and Industry Rank. In the 11-stock Miners – Silver industry, it is ranked #3. Want More Great Investing Ideas? 7 “Safe-Haven” Dividend Stocks for Turbulent Times When Does the Next Bull Run Start? Chart of the Day- See the Stocks Ready to Breakout NEM shares rose $0.02 (+0.03%) in after-hours trading Monday. Year-to-date, NEM has gained 44.56%, versus a 5.32% rise in the benchmark S&P 500 index during the same period."}]}