{"article": [{"url": "https://stocknews.com/news/ual-jets-save-aal-the-contrarian-case-for-airline-stocks/", "published": 1597061300.0, "headline": "The CONTRARIAN CASE for Airline Stocks", "body": "Airline stocks are due for a multi week, countertrend rally. Not all stocks have been winners since the stock market’s recovery off its March lows. Sectors like technology, real estate/construction, and healthcare have raced off to new highs. In contrast, airlines and hotels have lagged. The coronavirus has led to a surge in sales and profits for winning sectors, while it’s crushed demand for the laggards. 9 \"BUY THE DIP\" Growth Stocks For 2020For example, second-quarter revenue for US-based airlines was down between 80 to 90%. The airlines also were forced to cut costs by reducing the number of flights, selling old airplanes, and offering workers early retirement bonuses. Intriguing Opportunity The negatives for airline stocks are reflected in their underperformance relative to the broader market. From June to August, the US Global Jets ETF (JETS) fell 31%. This followed a more than 65% decline in JETS during the coronavirus crash. In between, the sector had a 95% rally from mid-May to June as the economy started to reopen, case counts declined, and there was growing optimism that the worst was behind us. However, there was another surge in coronavirus infections from June to August which resulted in the sector giving up 50% of these gains. Improving Outlook There are several signs on the horizon that the outlook is improving for the sector. While many parts of the market are making new highs, JETS remains nearly 50% off its pre-coronavirus levels. Given extreme bearish sentiment and the recent positive developments, investors should position themselves for a multi week, countertrend rally that will take airline stocks above their June highs. The best airline stocks to play for a countertrend rally are Spirit Airlines (SAVE), American Airlines (AAL), and United Airlines (UAL). UAL, AAL, and SAVE have very high levels of short interest. This will lead to even bigger rallies as shorts will be squeezed and forced to cover. Double Bottom The first clue is that the sector has formed a double bottom. This creates a low-risk, entry point. It’s also remarkably similar to the last double bottom for JETS from which airline stocks nearly doubled. As the chart shows, airline stocks bottomed in mid-March and then traded sideways. In mid-May, they slightly undercut these lows but then started drifting higher before aggressively rallying. An identical setup is playing out right now. On July 10, JETS bottomed around $15.5. It then retested and slightly undercut this low on August 10 and now has been drifting higher. During the last major move higher, UAL climbed 153%; AAL rose 160%; and SAVE gained 223%. Despite these big moves, short interest in these stocks has remained elevated. Further, the fundamental picture has also significantly improved. Market Rotation One defining characteristic of bull markets is “sector rotation”. Stocks that led the market higher for months will move sideways, while other parts of the market grab the baton. Currently, we seem to be in the midst of a rotation with leading stocks taking a pause, while lagging sectors are seeing inflows. For months, the Nasdaq 100 has been outperforming small caps. Since mid-July, this relationship has inverted. This rotation can be observed in all types of depressed assets like restaurants, retail, and financials. Airlines could be one of the biggest beneficiaries if money continues to move into lagging sectors. The major fundamental driver of this rotation is that the economy seems to be picking up momentum after stalling for the past month. It’s evident in indicators like miles driven, hotel occupancy rates, manufacturing data, and retail sales. Research Showing Airlines are Pretty Safe Another catalyst for airline stocks is that recent research has indicated that flying is safe. There were understandable concerns that being trapped on an aluminum tube with a couple of hundred passengers would lead to everyone getting exposed to the virus, similar to what happened on cruise ships. However, research has dispelled these concerns. A contact-tracing study of airline passengers in Australia found that even when infected people got on planes, the virus didn’t spread to any other passengers. So far, there have been no super-spreading events linked to airplanes. One factor is the air exchange systems in airplanes – the air is completely replaced 30 times every hour, according to University of Massachusetts professor, Erin Bromage. This is better than most indoor ventilation systems. Flying is not as risky as believed. This is the most important catalyst for airline stocks. Behavior like wearing masks and keeping the middle seat empty will further reduce risk. Additionally, TSA data shows that the number of passengers passing through airports has quadrupled from the lows in March and April. If flying was unsafe, there would have been outbreaks that could have been traced back to certain flights. TSA Travel Data Shows Improvement Another positive sign for airline stocks is that TSA travel data shows that the number of passengers continues to improve. We are well-off 2019 levels, but the gap is shrinking. On Sunday, over 800,000 passengers passed through TSA checkpoints which is the highest number since March 17. (source: Statista) The airline industry has faced existential threats before when many predicted that travel would be permanently depressed. None of these predictions came true. Over long periods, the number of flights and passengers has constantly increased. Falling Case Counts (source: worldometers.info) In addition to flights being safer than believed, the number of new cases is now declining. This will also lead to more people flying. It’s not a coincidence that when case counts started increasing from early-June to mid-July, the number of passengers flying stopped growing, and airline stocks tumbled. Both of these indicators are now moving in the right direction for the sector. Conclusion To be clear, significant challenges remain for airlines. Airlines have aggressively cut costs to prepare themselves for a worst-case scenario. However, the outlook is improving, and the stocks have priced in the negative news. Falling case counts, increasing passengers, and a market rotation into lagging sectors are powerful catalysts for airline stocks to begin the second leg of their recovery. On top of these catalysts, the charts are providing a low-risk opportunity. The setup is eerily similar to the last time airline stocks rocketed higher. Investors should look at the stocks with the highest short-interest like UAL, SAVE, and AAL as they have the potential for the biggest gains. Want More Great Investing Ideas? 9 “BUY THE DIP” Growth Stocks for 2020 How to Trade THIS Stock Bubble? 7 “Safe-Haven” Dividend Stocks for Turbulent Times UAL shares fell $0.26 (-0.69%) in after-hours trading Monday. Year-to-date, UAL has declined -57.38%, versus a 5.30% rise in the benchmark S&P 500 index during the same period."}]}