{"article": [{"url": "https://stocknews.com/news/rmm-well-vtr-v-aapl-jnj-mub-asg-amzn-msft-nke-chgg-nvro-pcty-utf-xlu-my-personal-3-click-retirement-plan-for-7-1-dividends-forever/", "published": 1594987700.0, "headline": "My Personal “3-Click” Retirement Plan for 7.1% Dividends (forever)", "body": "This crisis has hit income-seekers—particularly retirees—hard. After the stomach-churning March selloff came the slashing of “sacred cow” dividends, like those of senior-care providers Ventas (VTR) and Welltower (WELL). Look to Closed-End Funds for Retirement Income It’s understandable (and healthy!) if the past few months have made you extra cautious when picking dividend stocks. The good news on the dividend front is that you can still find plenty of high, safe payouts in my favorite corner of the high-yield market: closed-end funds (CEFs). 7 Best ETFs for the NEXT Bull MarketCEFs are a great pick for retirement income today, for three reasons. First, they still give you access to large-cap stocks you know well: mainstays like Visa (V), Apple (AAPL) and Johnson & Johnson (JNJ) feature in many equity-CEF portfolios. For extra safety, you can use CEFs to diversify beyond equities, too, and get exposure to investments like bonds and the safest real estate investment trusts (REITs). Second, CEFs are diversified, with hundreds of holdings in a single fund, making them even safer. Finally, and most importantly, they pay huge dividends, with 7% being the standard and 10% yields not uncommon. Many of these funds have also held payouts steady through this crisis, helping CEF buyers ride it out, quietly paying their bills with their dividends. An “Instant” 3-CEF Retirement Portfolio Now I want to show you how you can build a CEF portfolio for retirement with just three funds. They’ll give you an array of diversified assets in stocks and bonds, while also providing a large income source you could rely on for years. CEF #1: Cut Your Volatility—and Boost Your Income—With Municipal Bonds Our first CEF focuses on municipal bonds, an investment we want to hold now, for two reasons: first, “munis” provide tax-free income, which is important for income-seekers looking to minimize their tax bill. Second, their volatility is low, making them a great addition to a portfolio of stocks, particularly for retirees who want to minimize market headaches. But the muni-bond market is tough for individual investors to access, and buying through an ETF like the iShares National Muni Bond ETF (MUB) doesn’t cut it, either, because their payouts are too low: a paltry 2.3% in MUB’s case. That leaves CEFs as our best option. And we’re going to go with the 6.3%-yielding Rivernorth Managed Duration Municipal Income Fund (RMM) for our three-fund portfolio. RMM is a new fund, just launched in late 2019, but it’s held its dividend (which is paid monthly, by the way) steady through the crisis; RMM yields an impressive 6.3%. Rock-Steady Dividends CEF #2: Beat the Market and Get Paid 6.6% Yearly Of course, we want our portfolio to grow in addition to paying us a high income stream, so we’ll need exposure to the stock market. We can get that with the Liberty All-Star Growth Fund (ASG), which has been edging out the S&P 500 over the last decade. Beating the Index With a CEF That’s impressive on its own, but ASG’s 6.6% yield is even more impressive, yielding over three times more than an S&P 500 index fund. Worried that ASG is taking on risk to fund those payouts? Don’t be. In addition to familiar names like Amazon.com (AMZN), Microsoft (MSFT) and Nike (NKE), ASG has chosen mid-cap winners like Chegg (CHGG), Nevro Corp. (NVRO) and Paylocity Holding (PCTY). This fund’s focus on large, reliable companies and under-the-radar hits has been key to its success, and is why ASG is worth keeping in a retirement portfolio for stable dividends. CEF #3: High-Paying Utilities for a Stress-Free Retirement Finally, we want to invest in the most stable and reliable income-providing sector out there: utilities, a corner of the market where our CEF strategy really shines. We’ll round out this retirement portfolio with the Cohen & Steers Infrastructure Fund (UTF). Cohen & Steers is the best money manager you’ve never heard of. With expertise in utilities and real estate, the firm has some very successful funds. UTF pays a whopping 8.4% dividend that’s far larger than the 3.3% payout on the benchmark Utilities Select Sector SPDR ETF (XLU). Meantime, UTF has even beaten out the S&P 500 over the last decade, even though it holds “boring” utilities. Crushing Utilities and the S&P 500 Putting It All Together With just these three funds, you’ve got a diversified portfolio with an average yield of 7.1%. If you’re looking to replace $50,000 in income, you’d need to save $2.5 million or more to produce that income stream if you invest in index funds. But these three CEFs would fully replace $50,000 in income with a $705,000 nest egg. So with just these three picks, we’ve cut your retirement-savings needs by two-thirds. And they’re just a tiny fraction of the CEFs out there. Want More Great Investing Ideas? Free Report: 5 Bargain Funds with Safe 11% Dividends A “1-Click” Way to Grab Safe 8% Dividends The $43,000 “dividend secret” Wall Street hides from you RMM shares were trading at $17.27 per share on Friday morning, down $0.05 (-0.29%). Year-to-date, RMM has declined N/A%, versus a 0.68% rise in the benchmark S&P 500 index during the same period."}]}