{"article": [{"url": "https://stocknews.com/news/wsm-chart-of-the-day-williams-sonoma-wsm/", "published": 1596456500.0, "headline": "Chart of the Day: Williams-Sonoma (WSM)", "body": "In studying charts over the weekend I noticed that an ascending triangle pattern has formed in Williams-Sonoma (WSM). Williams-Sonoma is a leader in the $117 billion home furnishings industry. The company offers high-end cooking essentials, while it’s Pottery Barn segment provides casual home accessories. Continued improvement in its e-commerce shopping platform has made WSM one of the largest e-commerce retailers in the U.S. and should continue to drive growth. 7 Best ETFs for the NEXT Bull MarketTake a look at the 1-year chart of WSM below with my added notations: Chart of WSM provided by TradingView Over the past two months, WSM has hit the $88 resistance (red) on multiple occasions, while also climbing a trend line of support (green). Together, these two lines have formed an ascending triangle on WSM. Eventually, the stock will have to break either the $88 resistance or the trendline support. A trader could buy WSM if/when the $88 resistance level is surpassed with the expectation of a breakout. And a short trade could be executed if the stock moves lower and the trendline support is broken. Keep a close eye out for WSM’s latest earnings report which will be released on August 28th. Want to Discover More Great Trades? I have explored virtually every flavor of technical analysis and chart pattern known to mankind. The sad fact is that the vast majority of them don’t work at all. That is why I recently put together this presentation to help investors focus on the only 5 chart patterns that matter…the ones that lead to the most timely and profitable stock trades. Click below to learn these patterns and how to quickly find the 5 to 7 best trades today. 5 WINNING Stock Chart Patterns Have a good trading day! Good luck! Christian Tharp, CMT @cmtstockcoach WSM shares were trading at $87.95 per share on Monday morning, up $0.83 (+0.95%). Year-to-date, WSM has gained 22.30%, versus a 3.03% rise in the benchmark S&P 500 index during the same period."}]}