{"article": [{"url": "https://stocknews.com/news/alb-sqm-lac-lthm-4-lithium-stocks-that-could-skyrocket-with-tesla/", "published": 1594728500.0, "headline": "4 Lithium Stocks That Could SKYROCKET With Tesla", "body": "Lithium is going to be one of the most important and impactful metals in the next decade. As more electric cars are built and clean energy is generated, more batteries will be required to store this energy. Just like iron ore is necessary to make steel, lithium is a necessary component of batteries. According to the IEA, there are 8 million electric vehicles on the road. Over the next decade, this figure is expected to hit 100 million. By 2030, sales of electric vehicles are expected to be more than gas-powered vehicles. In the world, renewable energy now accounts for 28% of power generation and is expected to reach 50% by 2050. 7 Best ETFs for the NEXT Bull MarketSeveral catalysts are behind these explosive gains. These explosive gains are due to remarkable improvements in the efficiency and costs of batteries. Also, many countries are determined to reduce emissions for health and environmental reasons. ESG funds are seeing huge inflows to identify the companies that are going to benefit from this boom in alternative energy. And the stock market is already sniffing out this opportunity as stocks like Tesla (TSLA), Nikola Motors (NKLA), Workhorse (WKHS), Plug Power (PLUG) and FuelCell (FCEL). Each of these companies has more than doubled over the past few months. The companies that dig the lithium out of the ground and process it will also be big winners. Here are four lithium investments which could soar to new highs: Albemarle (ALB) ALB is the leader in lithium mining and accounts for 21% of global production. As the price of lithium rises, its earnings and the value of its assets will also increase. Despite its growth potential, the stock is reasonably priced with a price to earnings ratio of 17. Like any commodity stock, it’s subject to extreme price moves. (Souce: Finviz.com) From mid-2015 to late-2017, there was a bull cycle for lithium and ALB nearly tripled. However at that time, the increased demand for lithium never significantly materialized, and prices plummeted. This time, the situation is different. Lithium production has decreased with even less production due to shutdowns from the supply chain. For patient investors, this is creating a big opportunity as ALB expects lithium demand to increase 25% every year for the next decade. The steep decline in prices has also led to many projects being shelved which could result in undersupply down the road. Our proprietary POWR Ratings rates ALB a Buy. It has a “B” for Peer Grade. Among the chemical sector, it’s ranked #9 out of 68. Sociedad Quimica y Minera S.A. (SQM) SQM is another major producer of lithium and accounts for 13% of global production. It also produces several other commodities including iodine and potassium nitrate. Lithium accounts for 26% of its revenue and the majority of revenue growth. During the previous bull market cycle in lithium, SQM more than tripled from its lows. The price action of electric vehicle stocks is signaling that another bull market for the sector is beginning. This makes the stock appealing to growth investors, while its depressed price makes it attractive to value investors given its forward price to earnings ratio of 20. (Souce: Finviz.com) POWR Ratings ranks SQM as a Buy. It has an “A” for Peer Grade and a “B” for Trade Grade. It’s ranked #10 out of 68 chemical stocks. Lithium Americas (LAC) LAC is a riskier investment than SQM and ALB as it’s just starting to begin producing at its mines in Argentina and Nevada. The stock has a forward price to earnings ratio of 11 given its expected production from these projects. Once companies fully commit to electric vehicle production, they will ensure that supply won’t be disrupted. They may do so by paying upfront or by forming joint-venture partnerships. Automakers won’t want to deal with a situation, where they can’t produce cars, because of a shortage of lithium. The price of lithium will be a relatively small part of the final cost of building a car, so they will be willing to pay a premium for a consistent supply. There will also be competition among automakers to secure their source of supply which will also drive up prices. LAC is rated a Buy by POWR Ratings. It has an “A” for Trade Grade with a “B” for Buy & Hold Grade and Peer Grade. Among Diversified Miners, it’s ranked #2 out of 15. Livent Corporation (LTHM) LTHM is a spin-off from FMC (FMC). Since the spin-off, the stock is down 65%. In the last year, it had $360 million in sales and $31 million in profits. The company is also heavily spending to boost production from 18 metric tons to 55 metric tons by 2025. In 2018 as lithium prices dropped, its sales and profits also declined, while it was still spending and taking on debt to increase production. As it stands now, the company is a very leveraged play on lithium prices. If prices quickly recover, then it’s likely that it can take out its previous highs given the increased production. If prices remain at current levels, it’s stock will continue to struggle. Want More Great Investing Ideas? 9 “BUY THE DIP” Growth Stocks for 2020 Top 5 WINNING Stock Chart Patterns 7 “Safe-Haven” Dividend Stocks for Turbulent Times ALB shares were trading at $84.15 per share on Tuesday afternoon, up $2.59 (+3.18%). Year-to-date, ALB has gained 16.38%, versus a 0.11% rise in the benchmark S&P 500 index during the same period."}]}