{"article": [{"url": "https://stocknews.com/news/phi-syna-mx-sprt-4-cheap-tech-stocks-to-buy-before-they-rally/", "published": 1600862900.0, "headline": "4 Cheap Tech Stocks to BUY Before They RALLY", "body": "The NASDAQ started deep in the red at the beginning of the week only to bounce right back and end Monday up 1.7% for the day. It is clear investors still have faith in tech stocks. If you have not loaded up on companies in the tech space, it is time to start identifying the best of the bunch and establish positions before the next rally. It is not a question of if another tech rally will occur, but when. Let’s take a look at four low-cost tech stocks to consider before the next buying spree begins: PLT (PHI), Synaptics Incorporated (SYNA), MagnaChip Semiconductor Corporation (MX), and Support.com (SPRT). 7 \"SAFE HAVEN\" Dividend Stocks for Turbulent TimesPLDT (PHI) Telecom services are garnering considerable attention as the 5G revolution arrives. PHI offerings range from wireless to fixed-line, broadband, and beyond. In fact, PHI even provides mobile financial services. The company is flexible to the point that it allows for both prepaid and postpaid fixed-line connectivity. The POWR Ratings show PHI has “A” grades in the Trade Grade and Peer Grade components. PHI is ranked 7th out of 35 stocks in the Telecom – Foreign industry. It is quite interesting to learn PHI has a forward P/E ratio of 10.85, a relatively low figure for a telecom stock. PHI has soared since dipping to $16 in March. The only question is how high PHI will go in the months ahead. Thankfully, PHI is still priced at an affordable level of $30, presenting an attractive investment opportunity as the economy gradually returns to at least a semblance of normalcy. Synaptics Incorporated (SYNA) Human interface solutions will prove even more profitable as we rapidly segue to a tech-dominated economy and society. SYNA, a tech stock priced well below $100, makes the human interface solutions used in biometric fingerprint sensors, touchpads used on computers, handsets, mobile devices and more. The POWR Ratings are quite complimentary toward SYNA, grading the stock as a “B” in each category. SYNA is ranked in the top 10 of nearly 40 publicly traded companies in the Technology – Electronics industry. If SYNA reaches the average analyst price target of $100.83 as pinpointed by TipRanks, it will have escalated nearly 25%. SYNA is all the more appealing as its forward P/E ratio is a relatively low 12.78. Furthermore, SYNA is still priced well below its 52-week high of $92 and change. SYNA recently announced it had acquired a video interface tech company known as DisplayLink. Check out the rest of SYNA’s news, and you won’t find much negativity. The picture looks quite rosy for this affordable tech stock as the market attempts to bounce back from what looks to be a temporary September selloff MagnaChip Semiconductor Corporation (MX) It is not often you find a chip stock priced at a mere $13. MX is currently trading at this level yet could easily be in the $20s by year’s end. MX designs and makes mixed-signal and analog semiconductor products. MX segments include semiconductor manufacturing, power solutions, and display solutions. MX display solutions are highlighted by timing controllers and source/gate drivers for several flat panel displays. MX’s semiconductor manufacturing services segment consists of mixed-signal and specialty analog services for fabless semiconductor businesses. MX will likely pay off most of its debt following the sale of its foundry services group for $318 million. The POWR Ratings reveal MX has “A” grades in its Peer Grade and Trade Grade components. MX is ranked in the top third of the 90 plus Semiconductor & Wireless Chip stocks. The average analyst price target for MX is just under $16, which is 20% more than its current price. Support.com (SPRT) Recent months have shown investors who neglect low-priced stocks, particularly those that sell a tech product or service, miss out on fantastic opportunities. SPRT is one such stock. SPRT provides immediate tech relief to businesses and consumers through the company’s web portal and channel partners. In short, SPRT helps companies and individuals remedy tech issues. This is a service that will prove necessary far into the future. SPRT trades for only a couple bucks, yet its POWR Components are exemplary, highlighted by a grade of “A” in Trade Grade. SPRT is ranked in the top third of nearly 100 publicly traded companies in the Software – Application industry. SPRT has worked its way back to its pre-COVID trading range, yet profit-taking prevented the stock from moving above $2.20. Want More Great Investing Ideas? 7 “Safe-Haven” Dividend Stocks for Turbulent Times When Does the Next Bull Run Start? Chart of the Day- See the Stocks Ready to Breakout PHI shares were unchanged in premarket trading Wednesday. Year-to-date, PHI has gained 47.05%, versus a 4.26% rise in the benchmark S&P 500 index during the same period."}]}