{"article": [{"url": "https://stocknews.com/news/nvs-now-is-a-good-time-to-buy-novartis-heres-why/", "published": 1600344500.0, "headline": "Now is a Good Time to Buy Novartis, Here's Why", "body": "Novartis AG (NVS) researches, develops, and markets healthcare products worldwide. It primarily operates through two segments – Innovative Medicines and Sandoz. As a leading provider of healthcare products globally, the company deploys innovative science and digital technologies to create transformative treatments. Novartis products reach nearly 800 million people globally. NVS has recently reported that the European Medicines Agency (EMA) has approved the safety label update for Novartis Beovu, a clinically advanced humanized single-chain antibody fragment, after a positive top-line results from the first Phase III trial of Beovu versus aflibercept in patients with diabetic macular edema (DME). NVS also collaborated with the Africa Medical Supplies Platform to facilitate supply of COVID-19 related medicines. In the second quarter, the company’s core operating income increased 6% in constant currency and its earnings per share was up 6% year-over-year. In July, NVS launched a first-of-its-kind not-for-profit portfolio of medicines for symptomatic treatment of COVID-19. This impressive performance and the potential upside based on a number of factors has helped it earn a “Buy” rating in our proprietary rating system. 9 \"BUY THE DIP\" Growth Stocks For 2020Here is how our proprietary POWR Ratings system evaluates NVS: Trade Grade: A NVS is presently trading higher than its 50-day and 200-day moving averages of $86.21 and $87.96, respectively, indicating that the stock is in an uptrend. In fact, the stock’s 4.9% return over the past month reflects short-term bullishness. The company witnessed a series of new approvals from both the FDA and international agencies during the last quarter. Innovative Medicines net sales were USD 9.2 billion for the last reported quarter, up 1% year-over-year in constant currency. Net sales of the top 20 Innovative Medicines products of the company during the quarter increased 2% in constant currency to $7.1 billion. Buy & Hold Grade: B NVS is well positioned in terms of proximity to its 52-week high, which is a key factor that our Buy & Hold Grade takes into account. The stock is currently trading 10% below its 52-week high. The stock has gained close to 30% in the last three years due to its aggressive research and development, successful clinical trials of its diversified product-line and improving margins. It has an impressive history of earnings growth. The company’s EBIT grew at a CAGR of 15.4% over the past three years. As part of the second-quarter results, NVS mentioned, “We are on track to deliver on our commitment to drive consistent margin expansion and are excited by the progress of our deep mid to late stage pipeline to drive long-term growth.” Peer Grade: A NVS is currently ranked #19 out of 232 stocks in the Medical – Pharmaceuticals industry. Other popular stocks in the industry are Johnson & Johnson (JNJ), Merck & Company, Inc. (MRK) and Novo Nordisk A/S (NVO). NVS has lost 2.9% year-to-date. While JNJ and NVO beat NVS by gaining 3.8% and 19.2%, respectively, over this period, MRK has lost 3.7%. However, in terms of product pipeline and financials, NVS is better positioned than many of its peers. Industry Rank: B The Medical – Pharmaceuticals industry is ranked #5 out of the 123 StockNews.com industries. Since the onset of the health crisis, the pharma industry has initiated the development of dozens of potential vaccines for the COVID-19 pandemic in record time. The industry has made huge achievements over time to research into new antibiotics. Moreover, data science and AI have the potential to transform drug discovery in terms of costs, speed and efficiency. Overall POWR Rating: B (Buy) Overall, NVS is rated a “Buy” due to its impressive past performance, short-and-long-term developments, and recent price momentum, as determined by the four components of our overall POWR Rating. Bottom Line Despite losing 3.9% so far this year, NVS has the potential to grow based on its continued business growth and favorable research and development expenditures. The company is trying to mitigate the negative impact of exchange rates on its operations. NVS is optimistic to return to its leadership position in the global healthcare systems, primarily in the prescription dynamics. Analyst sentiment, which gives a good sense of a stock’s future price movement, is pretty impressive for NVS. Of the 22 Wall Street analysts that rated the stock, 12 have given it a “Strong Buy” rating. The market expects EPS to rise 9.3% next year. Want More Great Investing Ideas? 7 Best ETFs for the NEXT Bull Market Stock Market Outlook: Before & After the Election Chart of the Day- See the Stocks Ready to Breakout NVS shares were unchanged in after-hours trading Thursday. Year-to-date, NVS has declined -1.66%, versus a 5.42% rise in the benchmark S&P 500 index during the same period."}]}