{"article": [{"url": "https://stocknews.com/news/msft-zm-now-3-high-profit-tech-cloud-stocks-for-october/", "published": 1601986100.0, "headline": "3 HIGH PROFIT Cloud Stocks for October", "body": "The technology industry has witnessed unforeseen growth with whole world undergoing a rapid digitalization to stay functional in the “new normal.” Business growth has helped tech stocks dramatically outperform the broader market since the pandemic-led crash in March. This is evident from the Technology Select Sector SPDR ETF’s (XLK) 66.9% return since its March low, compared with the S&P 500’s 52.4% gain. The cloud computing industry has gained significant attention with industries going remote. As the shift to the cloud appears permanent and the need for technology becoming more pronounced, key cloud players should continue to soar for the foreseeable future. According to Wedbush analyst Dan Ives, tech stocks could move another 20% to 25% higher in a steady economic recovery through 2021. This growth will likely be driven by the accelerated shift in enterprise IT spending to cloud computing. Many tech stocks still have plenty of room high price appreciation, especially following the September sell-off. Microsoft Corporation (MSFT), Zoom Video Communications, Inc. (ZM), and ServiceNow, Inc. (NOW) could soar soon based on their fundamental strengths and growth drivers. 9 \"BUY THE DIP\" Growth Stocks For 2020Microsoft Corporation (MSFT) The brainchild of Bill Gates, and currently led by Satya Nadella, MSFT is known to everyone. It develops, licenses, and supports a range of software products, services, and devices. The company’s segments broadly include Productivity and Business Processes, Intelligent Cloud and More Personal Computing. MSFT’s revenue for the quarter that ended June 2020 was $38 billion, up 13% year-over-year. The revenue from the Intelligent Cloud segment alone was $13.4 billion, up 17%. Server products and cloud services revenue increased 19%, driven by Azure revenue growth of 47%. MSFT hit its 52-week low of $132.52 in mid-March 2020 and has gained 65.1% since then. In the words of Nadella, “We are the only company with an integrated, modern technology stack – powered by cloud and AI and underpinned by security and compliance – to help every organization transform and reimagine how they meet customer needs.” In fact, it has launched Microsoft Cloud for healthcare which will be available from October 30, 2020 and also plans to build hubs for cloud services in Greece. The market expects MSFT’s revenue to increase 8% in the current quarter and 9.6% in the current financial year. The company’s EPS is expected to increase 11.6% in the current quarter, 12.3% in the current fiscal year, and at a rate of 15.3% in the next five years. MSFT is a high profit company with a sky high net profit margin of 31%. How does MSFT stack up for the POWR Ratings? B for Trade Grade B for Buy & Hold Grade B for Peer Grade B for Industry Rank B for Overall POWR Rating The stock is also ranked #19 out of 96 stocks in the Software – Application Industry. Zoom Video Communications, Inc. (ZM) ‘Zooming’ has almost become synonymous with video-first communications thanks to ZM. The company provides cloud platforms for video, voice, content sharing, and chat, across mobile devices, desktops, telephones, and room systems. In addition to helping students attend virtual classes, it helps businesses bring their teams together virtually due to the pandemic’s social distance guidelines. ZM has been monetizing this growing demand. The company has an impressive earnings surprise history with the company surpassing EPS estimates in each of the trailing four quarters — by a whopping 104.4% in the last quarter. It reported revenue of $663.5 million in the second quarter, up 355% year-over-year. In fact, even when the stock market crashed in mid-March due to the deadly virus, it kept gaining and soared roughly 350% since then. The market expects ZM’s revenue to increase 315.4% in the current quarter and 286.0% in the current financial year. The company’s EPS is expected to increase 744.4% in the current quarter, 611.4% in the current fiscal year, and at a rate of 38.46% in the next five years. ZM has shown its profit potential with a profit margin of 17.1%. While some might be skeptical if this growth is temporary, many big organizations are still considering a shift to a permanent work-from-home setup. So, the market for ZM is brimming with opportunities. It has also partnered with Lumen Technologies further strengthening its market share. ZM’s strong fundamentals are reflected in its POWR Ratings. It has a “Buy” rating with an “A” in Trade Grade and Peer Grade, and “B” in Buy & Hold Grade and Industry Rank. Within the Technology – Services industry, it’s ranked #5 out of 53 stocks. ServiceNow, Inc. (NOW) NOW delivers digital workflows that create great experiences and unlock productivity. It provides cloud-based solutions that define, structure, manage, and automate services to enterprise operations in North America, Europe, the Middle East, Africa, the Asia Pacific, and other countries. It serves government, financial services, healthcare, telecommunications, manufacturing, IT services, technology, oil and gas, education, and consumer products. NOW saw a 97% renewal rate in fiscal second quarter with revenue growth of 27.0% year-over-year. It also has an impressive earnings surprise history with the company beating consensus EPS estimates in each of the trailing four quarters. The market expects NOW’s revenue to increase 27.5% in the current year and 24.4% in the next year. The company’s EPS is expected to increase 33.4% in the current year, 24.2% in the next year, and at a rate of 28.21% in the next five years. NOW also had a strong profit margin of 18.4%. The news of the partnership between NOW and Microsoft Azure also generated some buzz, which could drive further revenue growth. In the words of John Donahoe, president and CEO of ServiceNow, “Expanding our strategic global relationship with Microsoft enables ServiceNow to more fully leverage and integrate our platform and products with Microsoft’s leading enterprise technology and capabilities.” It’s no surprise that NOW is rated “Strong Buy” in our POWR Ratings system. It also has an “A” for Trade Grade, Buy & Hold Grade, and Peer Grade, and a “B” for Industry Rank. In the 48-stock Software-Business industry, it is ranked #1. Want More Great Investing Ideas? Do NOT Buy Stocks Before the Election! 7 “Safe-Haven” Dividend Stocks for Turbulent Times Chart of the Day- See Christian Tharp’s Stocks Ready to Breakout MSFT shares were trading at $206.23 per share on Tuesday afternoon, down $4.15 (-1.97%). Year-to-date, MSFT has gained 31.81%, versus a 5.95% rise in the benchmark S&P 500 index during the same period."}]}