{"article": [{"url": "https://stocknews.com/news/rio-scco-fcx-3-copper-stocks-to-ride-into-2021/", "published": 1599566900.0, "headline": "3 Copper Stocks to Ride Into 2021", "body": "The accommodative monetary policy, supply strains in South America, and the high demand for copper in China have been key drivers for the V-shaped recovery demonstrated by the copper industry. The iPathA Series B Bloomberg Copper Subindex Total Return ETN (JJC) has a year-to-date gain of 8.1% compared to the 7.5% gain of SPDR S&P 500 (SPY), which has been on a bullish run due to performance of tech stocks amid this pandemic. Moreover, JJC has gained more than 35% since its March lows. Copper is used in construction, electrical applications, consumer products, transportation, and industrial machinery. The main demand for copper right now is in the electric vehicle industry. Copper has electrical conductivity, which is why it is used in electric vehicle technology. This includes charging stations and the batteries inside the vehicles. Rio Tinto Plc (RIO), Southern Copper Corporation (SCCO) and Freeport-McMoRan, Inc. (FCX) are three Copper stocks expected to trend higher through the end of 2021. 7 Best ETFs for the NEXT Bull MarketRio Tinto Plc (RIO) This mining and metals company has approved an investment close to $200 million for the next stage of development of the lithium-borate Jadar project in Serbia. The project has the potential to supply a significant number of end-industrial products and supply borates across the world. The stock has grown more than 60% since its March low. In RIO’s second quarter, the company’s production increased in Pilbara iron ore (4% year-over-year), Bauxite (9%), and IOC iron ore pellets and concentrate (9%). RIO’s Kennecott site in the US is the first producer to be awarded the Copper Mark, the copper industry’s new independently assessed responsible production program. The 2020 Argyle Pink Diamonds Tender, a collection of the rarest diamonds from a year’s production from the Argyle mine in the remote east Kimberley region of Western Australia, has strong demand and significant value. The company also revealed the maiden Inferred Mineral Resource at the Winu copper-gold project in Western Australia and the discovery of a new gold dominant mineralization zone approximately 2 km east of the Winu deposit. Subject to regulatory approval, the company targets its first production for 2023. How does RIO stack up for the POWR Ratings? A for Trade Grade A for Buy & Hold Grade A for Peer Grade B for Industry Rank A for Overall POWR Rating The stock is also ranked #2 out of 23 stocks in the Industrial-Metals industry. Southern Copper Corporation (SCCO) SCCO’s cost competitiveness and financial position in the second quarter have been key drivers of its rapid recovery. The stock of this copper miner and refiner has grown about 100% since its March low, and recently hit its 52-week high of $49.19. The market expects the company to report an EPS of $0.43 for the quarter ending September 2020, which would represent a 7.5% increase over the year-ago number. In 2021, SCCO’s EPS and revenue is expected to grow 39.5% and 10%, respectively. In its second-quarter earnings report, Chairman of the Board German Larrea said, “Considering the current environment and the impacts of the COVID-19 pandemic, we believe that mining investment will play an important role in the recovery of both the Mexican and Peruvian economies. As such, we will continue to develop our projects, consistent with our belief that Southern Copper’s operations constitute risk-controlled generators of economic resources that provide well-remunerated employment and tax revenues to the countries in which we operate. We reaffirm our intention to generate long-term value for our shareholders by driving highly competitive projects and cost reduction efforts.” SCCO’s copper production was up by 2% year-over-year in the first half of 2020, mainly due to the new Toquepala concentrator and its expansion project which accelerated Toquepala’s annual copper production by 100,000 tons. In the second quarter, net sales increased 3.8%, net income increased by 20.8%, and EBITDA increased 7.1% quarter-over-quarter. SCCO has the largest copper reserves in the industry, and many investments planned for projects in Mexico and Peru which look promising. It’s no surprise that SCCO is rated a Strong Buy in our POWR Ratings system. It also has a grade of A for Trade Grade, Buy & Hold Grade, and Peer Grade, and a B for Industry Rank. In the 33-stock Industrial-Metals industry, it is ranked #4. Freeport-McMoRan, Inc. (FCX) The ramp-up of underground production at the Grasberg minerals district in Indonesia in order to achieve large-scale, low-cost copper and gold production, and FCX’s initiatives in North America and South America are encouraging. The shares of this miner have grown about 140% since its March low. In the second quarter, FCX’s operating income increased 872.7% year-over-year and EPS was $0.03, as compared to the loss per share of $0.05 a year ago. FCX’s consolidated sales volumes of copper and gold surpassed April 2020 estimates. In addition, FCX has also been planning on investing in new projects that will increase online production. FCX’s consensus revenue estimate of $3.48 billion for the quarter ending September 2020, indicates a year-over-year increase of 5.3%. Also, the market expects the company to report earnings per share of $0.13 for the quarter, which represents a significant improvement over the year-ago loss per share $0.01. In 2021, FCX’s EPS and revenue are expected to grow 452.2% and 29.2%, respectively. FCX’s POWR Ratings reflect this promising outlook. It has an overall rating of Strong Buy with a grade of A for Trade Grade, Buy & Hold Grade, and Peer Grade and a B for Industry Rank. Among the 33 stocks in the Industrials – Metals group, it’s ranked #5. Want More Great Investing Ideas? 7 Best ETFs for the NEXT Bull Market Will Stocks Fall into Historical September Slump? 9 “BUY THE DIP” Growth Stocks for 2020 RIO shares were trading at $61.17 per share on Tuesday morning, down $0.33 (-0.54%). Year-to-date, RIO has gained 10.78%, versus a 5.07% rise in the benchmark S&P 500 index during the same period."}]}