{"article": [{"url": "https://stocknews.com/news/sap-orcl-epam-nuan-4-strong-buy-software-stocks-to-buy-on-the-dip/", "published": 1600949300.0, "headline": "4 “Strong Buy” Software Stocks to Buy on the DIP", "body": "The global software and software services market is expected to grow at a CAGR of 10.7% between 2019 to 2025. Software stocks, along with other technology-related stocks, have been driving gains in the broader markets after the coronavirus-driven crash in March. The importance of software has significantly grown as businesses worldwide are taking part in a digital transformation to stay afloat. Software companies that are working on emerging technology such as cloud computing and AI should see large gains over the next few years. Since September 2nd, the NASDAQ Composite index has fallen approximately 8.5% from its high of 12,074. It is too early to say whether this is a short-term correction or a part of a long-term bearish trend. Even though the NASDAQ, which is dominated by technology stocks, is currently showing signs of bearishness, the underlying strength of software stocks shouldn’t be ignored. In fact, this correction presents a great opportunity for investors to enter into these stocks at discounted prices. 7 \"SAFE HAVEN\" Dividend Stocks for Turbulent TimesStocks such as SAP SE ADS (SAP), Oracle Corporation (ORCL), EPAM Systems, Inc. (EPAM), and Nuance Communications, Inc. (NUAN) have seen their prices drop along with the NASDAQ, however their underlying fundamentals remain strong. SAP SE ADS (SAP) SAP is a software company that provides solutions for asset management, human resources, finance, sales, marketing, manufacturing, supply chain, and several other verticals. SAP has consistently been focusing on innovation to drive growth. The company has recently invested in Jina AI, which is working on providing a neural search solution. The company has also entered into a partnership with E.ON to develop a platform that would ease billing processes and the exchange of information for energy market participants. The company’s stock has delivered a year-to-date return of 13.5%. The stock has lost approximately 7.5% since hitting a high of $169 on September 2nd, giving investors a good entry opportunity. SAP’s revenue is expected to grow 5.2% this year and 7.6% next year. The company’s EPS is estimated to rise 15.1% this year and at a rate of 9.4% per annum over the next five years. How does SAP stack up for the POWR Ratings? B for Trade Grade B for Buy & Hold Grade B for Peer Grade B for Industry Grade B for Overall POWR Rating The stock is also ranked #1 out of 94 stocks in the Software – Application industry. Oracle Corporation (ORCL) ORCL is a software corporation that develops software relating to cloud infrastructure, hardware systems, database maintenance, and middleware. The company has recently entered into a partnership with Walmart (WMT) and TikTok and will work as the technology partner for TikTok’s American operations. The agreement has been approved by the US authorities. The company has also upgraded its cloud infrastructure offering, and now users will be able to access NVIDIA A100 instances through the service. ORCL’s stock has gained 11.3% so far this year. The company’s stock has dipped slightly from its year-to-date high of $61.70. ORCL’s revenue is expected to grow 2.1% this year and 2.4% next year. The company’s EPS is estimated to rise 9.6% this year and at a rate of 9.2% per annum over the next five years. It’s no surprise that ORCL is rated a “Strong Buy” in our POWR Ratings system, with a grade of “A” in Trade Grade, Buy & Hold Grade, and Peer Grade. In the 94-stock Software – Application industry, it is ranked #2. EPAM Systems, Inc. (EPAM) EPAM provides technology services and software solutions worldwide. The company’s software products include custom application development, enterprise application platforms, infrastructure management services, application testing services, and more. The company has recently acquired Ricston Ltd., a move that will help build the company’s API solutions along with salesforce functions. The company has also announced a partnership with Fnality International, a consortium of banks, to develop software-based financial market infrastructures for payment-on-chain use. EPAM’s stock has delivered a year-to-date return of 48.4%. The stock has witnessed a decline of approximately 4% from its high of $339. EPAM’s revenue is expected to grow 14.3% this year and 20.9% next year. The company’s EPS is estimated to rise 9.4% this year and at a rate of 17% per annum over the next five years. EPAM’s strong fundamentals are reflected in its POWR Ratings. It has a “Buy” rating with a grade of “A” in Trade Grade and Peer Grade. In the 94-stock Software – Application industry, it is ranked #3. Nuance Communications, Inc. (NUAN) NUAN provides voice and language solutions for corporations and individual users worldwide. The company is operating at the forefront of emerging technology such as AI-driven language. The company has recently made available its cloud-based Dragon Professional Anywhere speech recognition solution for users in the US across multiple markets such as financial services, law enforcement, and legal. NUAN has also announced that its Nuance Dragon Ambient eXperience ambient clinical intelligence solution can now be integrated with Microsoft Teams. NUAN’s stock has witnessed gains of 83.3% so far this year. The stock’s strong performance has continued despite the overall weakness in the broader markets. The company’s revenue and EPS are expected to grow 4% and 6.1%, respectively, next year. It’s no surprise that NUAN is rated a “Strong Buy” in our POWR Ratings system, with a grade of “A” in Trade Grade, Buy & Hold Grade, and Peer Grade. In the 94-stock Software – Application industry, it is ranked #4. Want More Great Investing Ideas? 7 “Safe-Haven” Dividend Stocks for Turbulent Times When Does the Next Bull Run Start? Chart of the Day- See the Stocks Ready to Breakout SAP shares were trading at $152.78 per share on Thursday afternoon, up $0.67 (+0.44%). Year-to-date, SAP has gained 15.22%, versus a 1.48% rise in the benchmark S&P 500 index during the same period."}]}