{"article": [{"url": "https://stocknews.com/news/tgt-amzn-wmt-target-walmart-or-amazon-which-e-commerce-giant-is-the-best/", "published": 1598357300.0, "headline": "Target, Walmart, or Amazon: Which E-Commerce Giant is the Best", "body": "We’re now six months into the coronavirus era. It’s had a host of consequences, including an economic crisis that is having uneven impacts on different sectors. It’s also becoming increasingly clear that the aggregate effect on economic activity is not as significant as originally expected. This helps explain the recovery in the stock market. Weakness in travel, leisure, and dining has been compensated by strength in areas like housing and technology. Another group that has benefitted has been e-commerce and big-box retailers. The most notable companies in this category are Target (TGT), Walmart (WMT), and Amazon (AMZN). 7 Best ETFs for the NEXT Bull Market(TGT is one of the stocks currently in Steve Reitmeister’s Total Return portfolio. Learn more here.) Outperformance These three companies have been massive outperformers with each retailer making new, all-time highs in recent weeks. Since the March lows, Amazon is 101% higher, Walmart is up 28%, and Target has gained 71%. Early in the crisis, there was a huge surge in purchases as people stockpiled basics like groceries, toiletries, and cleaning supplies. Walmart and Target benefitted as they remained open while many other retailers were shut down. Over the last couple of years, both have also made major investments in their e-commerce operations and curbside pickup. In the second quarter, Walmart’s e-commerce sales increased by 97% and Target’s online sales grew by 195%. Walmart and Target were also helped by the boost in consumer spending due to the stimulus checks and enhanced unemployment insurance. While the first-quarter was dominated by spending on lower-margin items, the second-quarter saw increased demand for TVs, computers, and furniture. Some of this was due to pent-up demand, and the other factor was the increase in remote work and education. Amazon’s business also thrived as its operations were unaffected by the coronavirus, other than having to deal with increased demand. Amazon’s revenues increased by 26% in the first quarter and 40% in the second quarter. POWR Ratings The POWR Ratings are bullish on all three stocks, as they all have Strong Buy ratings. Amazon is ranked #1 among Internet stocks and has an “A” across all POWR Components. Walmart and Target are ranked #1 and #3 respectively among Big-Box Retailers. They also have an “A” across most POWR components. E-Commerce Operations Overall, e-commerce spending has exploded. It now accounts for 14.5% of overall retail spending. Even before the pandemic, online sales were expanding faster than overall retail spending, but this has resulted in acceleration. Amazon remains the dominant company but in recent months, its share of the market has slipped. According to Rakuten Intelligence, Amazon’s share of e-commerce fell from 42.1% in January to 38.5% in June. In contrast, Walmart’s share has increased from 4.2% to 5%, and Target’s increased from 2.2% to 3.5%. One factor was that during the early months of the pandemic, Amazon had trouble fulfilling orders and making deliveries on time. This resulted in gains for Walmart and Target which was able to meet demand given that its stores serve as de facto fulfillment centers. It also validated both companies’ efforts over the past couple of years to enable same-day and curbside pickup at their stores which gave them an advantage over Amazon which had to rely on its delivery network and partners who couldn’t handle the surge in demand. Amazon is looking to expand its presence by building out smaller fulfillment centers across the country. This will help it handle increasing demand and bring expedited delivery to more customers. Given trends in retail, Walmart and Target’s future relevance is dependent on growing its share of the e-commerce market. This is more true for Walmart which has few expansion opportunities left domestically and is dealing with same-store sales flattening over the past decade. Each of these companies is pursuing its strategy in e-commerce. Walmart wants to create its version of Amazon Prime with Walmart+. It hopes to create the same type of customer loyalty and steady, compounding in transactions and transaction size that Prime has done for Amazon. However, the real dark horse is Target. While Walmart is working hard to make up ground with Amazon, it’s losing sight of its smaller rival – Target- which is quickly catching up. Target is much smaller than both companies, so it has more opportunities for expansion in terms of physical retail. It’s also punching above its weight in e-commerce and pursuing a differentiated strategy from Amazon and Walmart. Target is the Best of the Bunch E-commerce Target is punching above its weight, in terms of e-commerce. Target is 4.5% the size of Amazon. However, it’s e-commerce segment is 11% Amazon’s and growing 5x as fast. It’s 20% the size of Walmart, but its e-commerce sales are 70% of Walmart’s and growing twice as fast. Walmart and Amazon are both creating online marketplaces, where it connects buyers and sellers on its platform and then handles the backend. In contrast, Target is pursuing a different strategy of curating its offerings, vetting sellers, and ensuring the highest quality. Target has a little less than 100 sellers on its platform. Walmart has 100,000 and Amazon has over a million. Target’s success is due to its platform being easier to navigate in contrast to Walmart and Amazon which can be overwhelming in the number of items for sale. Amazon, in particular, has a problem with counterfeit products, third-party sellers, and quality-control. It’s also notable that unlike Walmart which is intent on building its version of Amazon, Target is blazing its path. It’s already paying dividends as it’s e-commerce operation is on track to exceed Walmart given its more than double growth rate. Physical retail In terms of physical retail, Target is beating Walmart. Target’s same-store sales increased by 26.9%, while Walmart had a 9.6% increase. Additionally, Walmart noted that spending at stores was moderating with the expiration of unemployment benefits in August. In Target’s earnings report, the company said there was no sign of slowing momentum in August. The most likely reason is that Target’s demo of upper-middle-class shoppers has been insulated from the economic weakness, while Walmart’s shoppers are more exposed. Another positive for Target is that it still has room for expansion given that it has 1,880 stores in the US, while Walmart has 4,756 stores. Over the next 10 years, it plans to add 500 more stores including smaller stores in urban locations that can double as pickup locations for online orders. In contrast, Walmart has maxed out its domestic growth. Valuation Despite Target’s growth, it has the cheapest valuation compared to Amazon and Walmart. Target has a forward price to earnings (P/E) ratio of 21. Walmart’s is 24, and Amazon’s is 75. Amazon still has the best e-commerce operation, however, this is priced into the stock given its elevated valuation. Target’s stocks are still priced attractively given its growth and booming e-commerce operation. Walmart’s stock is less attractive given that its customer demo is more vulnerable to economic weakness, and its same-store sales have been decelerating over the past decade. Another negative for Walmart is that its operating margins of 3.2% are significantly less than Target’s 5.2% and Amazon’s 5.8%. Closing Thoughts Compared to Walmart and Amazon, Target is the best stock. It’s the cheapest among the three and has the fastest growth in e-commerce which is the most important area for any retailer. Compared to Walmart, it still has expansion opportunities. Walmart’s same-store sales growth has been deteriorating over the past decade. Investors are forgetting this given its temporary surge due to the coronavirus. In contrast, Target’s stores are growing in terms of same-store sales. Additionally, its customers are better insulated from the coronavirus. Amazon is the king of e-commerce and will retain its dominant position, although it’s losing market share. However, this is already priced into the stock given its price to earnings ratio of 75. Many believe the story in retail for the next decade is Walmart catching up to Amazon. I believe the real story will be Target catching up to Walmart. Want More Great Investing Ideas? The Best of StockNews 2 Step Process to Sell @ Market Top in September 9 “BUY THE DIP” Growth Stocks for 2020 TGT shares were unchanged in after-hours trading Tuesday. Year-to-date, TGT has gained 21.13%, versus a 8.02% rise in the benchmark S&P 500 index during the same period."}]}