{"article": [{"url": "https://stocknews.com/news/qqq-ixic-tsla-is-the-nasdaq-a-bubble-or-does-it-reflect-a/", "published": 1595333300.0, "headline": "Is the NASDAQ in a BUBBLE?", "body": "The tech bubble over twenty years ago was ugly The tech-heavy NASDAQ leads the market- mirage or reality? A game of musical chairs? The stock market has come a long way from the mid-March lows. In mid-February, the spread of coronavirus worldwide caused a significant correction in equity prices as investors and traders sold just about any stock with a ticker. The VIX index, which reflects the implied volatility of put and call options on shares that trade on the S&P 500, rose to a high of 85.47 in March, the highest level since the 2008 financial crisis and the second-highest level in history. The VIX tends to increase when the stock market declines because market participants purchase price insurance or options during market corrections. Meanwhile, the stock market has come storming back since the March lows in what has been a V-shaped recovery. Since the 2020 bottom, the tech-heavy NASDAQ (QQQ) has been the leader of the pack as it is the only index that has risen to a new all-time high. The NASDAQ was above the 10,500 level at the end of last week. Before March, when all of the indices were at record levels, the NASDAQ peaked at 9,838.37. The explosive move in technology stocks could reflect a significant change in consumer behavior, or it could be a bubble that is waiting to burst. The tech bubble over twenty years ago was ugly 9 \"BUY THE DIP\" Growth Stocks For 2020Just before the turn of the century, the “dotcom bubble” burst. The value of technology equities grew exponentially, pushing the NASDAQ from under 1000 in 1995 to over 4800 in 2000. In 1996, the Chairman of the Federal Reserve, Alan Greenspan, warned of “irrational exuberance.” He was early. By 2002, the NASDAQ was back below the 1000 level, reaching a low of just under 800. It took almost a decade and a half for the index to revisit the high from 2000. The tech-heavy NASDAQ leads the market- mirage or reality? The global pandemic has hastened the death of retail and supported gains in many technology stocks. At the same time, unprecedented levels of liquidity from the Federal Reserve and other central banks worldwide have fostered a buying frenzy in stocks, with technology once again leading the way. While all of the leading indices on the stock market have rallied, only the NASDAQ gas risen to a new record high during the pandemic. Source: Barchart The chart shows that the tech-heavy index had risen to a record high of 9,736.57 in February 2020 at a time when the S&P 500 and the DJIA were also at record levels. After a correction to a low of 6,771.91 in March, the NASDAQ came storming back. Changing consumer behavior because of social distancing and stay at home orders made technology companies even more attractive. The NASDAQ made back all of its losses by June and rose to a new record high. In July, it has followed through on the upside. The explosive move in technology vaulted three companies into a zone where Apple (AAPL), Amazon (AMZN), and Alphabet (GOOG) all have market caps over the $1 trillion level. At the current rate of ascent, AAPL and AMZN could be headed for valuations north of $2 trillion. One of the most incredible rallies belongs to Elon Musk’s Tesla (TSLA). Source: Barchart After trading to a low of $176.99 in June 2019, the shares have reached its latest high at $1794.99 this month and was trading at $1500.84 at the end of last week. At the high, TSLA became a ten-bagger in just thirteen short months. Elon Musk is a genius, but the electric car company’s ascent is the perfect example of bubble behavior. TSLA’s market cap of around $278.4 billion dwarfs all other automobile manufacturers worldwide. A game of musical chairs? Technology has changed the world, and the coronavirus has gone a long way to turbocharging the shift in consumer and investor behavior. The central bank and government monetary and fiscal policy stimulus have poured gasoline on a raging bullish fire in the technology sector. TSLA is not alone. There are a host of other stocks that have risen to levels reminiscent of the late 1990s. Alan Greenspan called the market action in 1996 irrational. The market continued to rise for four years before the exuberance turned to carnage. The risk of the technology sector is rising with the lofty prices. Like a game of musical chairs, the music will stop one day. However, the US Fed intends to keep the music playing for the foreseeable future. Lots of market participants made significant fortunes as tech stocks rose in the 1990s. Those who turned paper profits into realized gains survived. The lesson of the “dotcom bubble” is to control and monitor risk and take those profits when they are on the table. When the game of musical chairs in the tech sector ends, things will get ugly. Remember that it took fifteen years for the NASDAQ to appreciate by 5000 points from 2002 to 2017. Since March, in only four months, the index has rallied by almost 4,200 points at its most recent high. Buyer beware. Make sure to take those profits to the bank. Want More Great Investing Ideas? 9 “BUY THE DIP” Growth Stocks for 2020 Newly REVISED 2020 Stock Market Outlook 7 “Safe-Haven” Dividend Stocks for Turbulent Times QQQ shares rose $1.87 (+0.70%) in premarket trading Tuesday. Year-to-date, QQQ has gained 26.98%, versus a 2.57% rise in the benchmark S&P 500 index during the same period."}]}