{"article": [{"url": "https://stocknews.com/news/nke-pton-fit-plnt-4-best-fitness-stocks-to-strengthen-your-portfolio/", "published": 1599566900.0, "headline": "4 BEST Fitness Stocks to Strengthen Your Portfolio", "body": "One in four American spends more than 8 hours a day sitting, as per the latest federal research report of CDC. Awareness of the side effects of a sedentary lifestyle have led many people to join a gym, or take up any outdoor activity, thereby creating a $94 billion dollar fitness industry. However, the picture changed dramatically since the onset of the pandemic, as all fitness studios remained closed for months. Even after reopening, the average foot traffic has been reduced, as people are apprehensive about working out in such close proximity during these times. Instead, working-out at-home has become the new trend, with virtual training sessions conducted by instructors. As the pandemic has further reduced body movements of people, many of them have actively incorporated some form of home exercise into their day-to-day lives. Many people have also taken up exercise to build up strength and increase their immunity, thereby reducing the chances of getting sick. As a result, the Athleisure industry has maintained its position, despite the effect of the pandemic on the fitness industry as a whole. Technavio’s recent reports state that the U.S. Athleisure market has the potential to grow by $80.74 billion during 2020-2024. The growth momentum of the industry is expected to be reflected through the performance of the top industry participants, namely, Nike, Inc. (NKE), Peloton Interactive, Inc. (PTON), Planet Fitness, Inc. (PLNT), and Fitbit, Inc. (FIT). 7 Best ETFs for the NEXT Bull MarketNike, Inc. (NKE) NKE is the biggest sports apparel manufacturer in the world, with a 25.1% global market share. The company’s sound business model and financial strength allowed it to gain more than 95% since its March low. The stock hit its 52-week high of $117.41 in September, after hitting its 52-week low of $60 in March. The growth of its digital sales allowed NKE to remain profitable in the fiscal fourth quarter that ended in May 2020. Online sales increased 75%, and accounted for 30% of the total revenue. Despite store closures in various parts of the world for 2 months, NKE managed to generate a net income of $2.50 billion. NKE’s working capital grew 41.7% year-over-year during the quarter. NKE is a component of the rallying Dow Jones Industrial Average (DJIA). As DJIA crossed 29,000 for the first time since February, investors are optimistic about the performance of the underlying stocks in the future. Analysts expect NKE’s EPS to grow at 23.6% per annum over the next five years, with a forward revenue growth rate of 4.3%. How does NKE stack up for the POWR Ratings? A for Trade Grade A for Buy & Hold Grade A for Peer Grade B for Industry Rank A for Overall POWR Rating. You can’t ask for better. It is also ranked #1 out of 33 stocks in the Athletics & Recreation industry. Peloton Interactive, Inc. (PTON) PTON is an interactive fitness platform providing technology-based fitness products, and subscription-based streaming classes. PTON operates through three main categories – connected fitness product segment, subscription segment and others. With 1.4 million subscribers, PTON is known for its on-demand live classes and PTON Digital app for connected access. PTON’s subscription services have gained popularity amid the pandemic, as the lockdown has forced people to exercise in their homes. For the fiscal third quarter that ended in May 2020, PTON’s ending connected fitness subscribers grew 94% year-over-year, while digital subscribers grew 66% from the year-ago value. Total revenue increased 66% year-over-year to $524.60 million. Gross profit rose 104% from the same period last year to $245.80 million. PTON’s trailing twelve-month revenue grew 80.6%, while EBITDA grew 31.3% during the same period. PTON expects fiscal fourth quarter revenue to be in the range of $500 and $520 million, indicating a 128% increase year-over-year at midpoint. PTON gained more than 420% since hitting its 52-week low of $17.70 in March. The stock hit its 52-week high of $92.50 in September. PTON’s strong fundamentals are reflected in its POWR Ratings. It is rated a Buy, with a grade of A in Trade Grade, Peer Grade, and Industry Rank, and a B in Buy & Hold Grade. In the 34-stock Consumer Goods industry, PTON is ranked #10. Planet Fitness, Inc. (PLNT) PLNT owns and operates franchise fitness centers globally through three segments – Franchise, Corporate-owned stores, and Equipment. While its corporate owned stores are located across the United States and Canada, its franchise stores are spread across the globe. PLNT’S operations were severely affected by the lockdown, as all stores remained closed for some time. Even after resuming operations, the customer footprint reduced substantially due to social distancing norms. However, PLNT’s second-quarter financials improved significantly over the year-ago quarter. PLNT’s EPS is expected to grow at 7.9% per annum over the next five years. Its forward revenue and EBITDA is expected to grow at 7% and 10.5%, respectively, over the next two years. PLNT has gained more than 155% since hitting its 52-week low of $23.77 in March. PLNT holds a grade of B in Industry Rank in our POWR Ratings system. It is also ranked #14 out of 33 stocks in the Athletics & Recreation industry. Fitbit, Inc. (FIT) FIT is a leading manufacturer of fitness accessories across the globe. It recently partnered with Scripps Research Institute and Stanford Medicine to evaluate the ability of fitness wearables to detect, track, and contain infectious diseases such as coronavirus. On June 3rd, FIT rolled out an easy to use ventilator called Fitbit Flow for coronavirus emergency. It obtained the Emergency Use Authorization (EUA) from the FDA. On August 126th, FIT launched an advanced health smartwatch called Fitbit Sense, with an electrodermal sensor, advanced heart tracking technology, and ECG app. This allowed the company to reach a paid-subscriber base exceeding 500,000 in less than a year. However, FIT reported a slowdown in business volume in the second quarter that ended in July 2020, as a result of the pandemic. Though the quarterly reports indicated a year-over-year decline, FIT’s no-device revenue grew 195% year-over-year. EBITDA grew 219.1% in trailing twelve months, while operating income increased 127.8%. FIT’s EPS is expected to grow 22.7% per year over the next five years. FIT has gained more than 15% since hitting its year-to-date low of $5.85 in March. FIT is rated a Buy in our POWR Ratings system, with a grade of B for Buy & Hold Grade and Industry Rank. In the 33-stock Athletics & Recreation Industry, it is ranked #20. Want More Great Investing Ideas? 7 Best ETFs for the NEXT Bull Market Will Stocks Fall into Historical September Slump? 9 “BUY THE DIP” Growth Stocks for 2020 NKE shares were trading at $112.24 per share on Tuesday morning, down $0.16 (-0.14%). Year-to-date, NKE has gained 11.62%, versus a 5.85% rise in the benchmark S&P 500 index during the same period."}]}