{"article": [{"url": "https://stocknews.com/news/fb-snap-hubs-3-social-media-stocks-thriving-during-covid-19/", "published": 1594382900.0, "headline": "3 Social Media Stocks THRIVING During COVID-19", "body": "Companies are battling every day to capture your attention. Nowhere is this more evident than on social media platforms. Due to network effects, the value of a social network increases as it gets larger, and people spend more time on it. This translates into more ads and higher ad rates. The coronavirus is leading to people spending more time online due to the dearth of other activities. This is boosting the revenues of social media companies as they can deliver more ads. 7 Best ETFs for the NEXT Bull MarketEven before the coronavirus, advertising budgets were shifting to social media from traditional media. Ad spending on social media is expected to grow by 7.6% between 2020 to 2024, while ad spending on traditional media will decline. Here are three social media stocks that are benefitting from this situation: Facebook, Inc. (FB) FB has recently come under fire with advertisers boycotting its platform amid concerns over hate speech and misinformation. The company is in active talks with various stakeholders to resolve the issue. However, the stock price continues to rise, demonstrating investors’ confidence in its ability to resolve the issue efficiently. In the first quarter of 2020, FB reported a year-over-year increase in revenue of 17%. While FB missed the consensus EPS estimate in the first quarter, it beat the estimates in the prior two quarters. The company is scheduled to release its second-quarter results on July 28th and the consensus EPS estimate of $1.37 for the quarter indicates year-over-year growth of 50.5%. FB delivered a YTD price return of 19.1%. It has also witnessed positive price returns in the one-month, six-month, one-year, and three-year periods. How does FB stack up for the POWR Ratings? A for Trade Grade A for Buy & Hold Grade A for Industry Rank B for Peer Grade A for overall POWR Rating Snap Inc.(SNAP) SNAP reported a 44% year-over-year increase in revenue in the first quarter of 2020. Its second-quarter results will demonstrate how the company has benefited from the pandemic due to increased user traffic and engagement. SNAP also announced a host of new updates during the virtual Snap Partner Summit. These updates include augmented reality, Bitmoji for games, and Local Lenses. These improvements in its platform will lead to greater user engagement that will translate into increased ad revenues. SNAP delivered a YTD price return of 58.8% along with positive price returns in the one-month, six-month, one-year, and three-year periods. The company has been accorded an overall POWR Rating of A along with an A for each of the four POWR components. HubSpot, Inc. (HUBS) The trends of increasing spending in inbound marketing, online marketing, and the decline in traditional advertising are all moving in HUBS’ favor. Further, its stock has been performing well since its first-quarter earnings which beat expectations by more than 50%. HUBS has beat EPS estimates in each of the last four quarters. HUBS is likely to continue this momentum, as its reduced pricing is helping with customer acquisition. It has delivered a YTD price return of 50.2% while also maintaining positive price returns in the one-month, six-month, one-year, and three-year periods. The company has received an overall POWR Rating of A along with an A for each of the four POWR components. Want More Great Investing Ideas? 9 “BUY THE DIP” Growth Stocks for 2020 Is the Bull S#*t Rally FINALLY Over? 7 “Safe-Haven” Dividend Stocks for Turbulent Times Top 3 Investing Strategies for 2020 FB shares fell $0.07 (-0.03%) in after-hours trading Friday. Year-to-date, FB has gained 19.40%, versus a -0.31% rise in the benchmark S&P 500 index during the same period."}]}