{"article": [{"url": "https://stocknews.com/news/gld-gdx-auy-hmy-gold-hits-all-time-highs-more-gains-are-likely/", "published": 1595938100.0, "headline": "Gold Hits All-Time Highs, Why More Gains Are Likely", "body": "Gold (GLD) started the week off by making new, all-time highs, as it exceeded its 2011 high of $1,907. (source: Finviz.com) 7 Best ETFs for the NEXT Bull MarketThe gains are even more exciting in gold miners. The gold miners ETF (GDX) is up 155% since it bottomed on March 16. Individual miners have even more impressive gains. Yamana Gold (AUY) is up 25% in July. Harmony Gold (HMY) is up more than 100% since mid-June. At today’s gold prices, nearly every miner is profitable, so each additional gain in the gold price goes straight to the bottom line. What’s Driving Gold Higher? A major factor driving gold higher is that the US dollar has been weakening due to the economy’s momentum stalling. This is evident from the Weekly Employment Pulse provided by the Census Bureau. After three months of job gains, it looks like there will be job losses in July. (source: Census Weekly Pulse) Further, July has made clear that there’s still a tradeoff between economic activity and the virus’ spread. In many areas, state and local governments are putting in various restrictions. And, the public is venturing out less, on their accord, which is apparent in TSA travel data and restaurant reservations. The recovery in economic growth is already rolling over, and any efforts to rekindle it, risks the virus’ spread getting worse. In terms of the real economy, it means that real interest rates will trend lower which is bullish for gold. Typically, when real interest rates are high, gold is less attractive, because it represents the cost of holding gold. Since real interest rates are currently negative, it means that there’s no cost to owning gold. (source: Bloomberg) The only thing that could interrupt gold’s momentum in the short-term is if the dollar catches a bid. The most likely way this would happen is if economic growth starts ticking higher which would lead to interest rates starting to move higher, and the Fed taking its foot off the accelerator. Parallels to 2009-2011 There are several striking parallels between the current situation and the last time that gold prices made new, all-time highs. In both instances, the US economy emerged out of a devastating recession, and monetary policy was at full aggression with the Fed using new tools to ease financial conditions. The Fed’s tools were sufficient to keep the real economy from falling into deflation and preventing a recession, but they weren’t successful in terms of generating enough economic growth that would lead to a full-on recovery. However, they were very impactful in terms of inflating asset prices like gold, stocks, and bonds. One difference between these two periods is inflation. Many believed that the Fed’s unprecedented actions instituting quantitative easing would lead to inflation. It turned out not to be the case. When growth picked up, interest rates started to rise against a backdrop of weak inflation which caused gold prices to plummet almost 50% between 2011 and 2016. However, the case for inflation is much stronger this time. Fiscal policy is being utilized with the deficit expected to be between $2.5 and $3 trillion this year. We’ve had a quasi-experiment in universal basic income with the $600 boost to unemployment checks which proved successful in stabilizing the economy. If current polling holds, Democrats will have full control of the federal government and are less likely to be restrained, when it comes to deficit spending. The Fed is also much more aggressive than last time. FOMC Chair Powell has already said that inflation will stay low until 2022. He and other FOMC officials have mused about additional steps they could take like raising the Fed’s inflation level to 3% from 2%, tolerating “symmetrical inflation” to undo the period in which inflation was below their desired level, letting QE run until some employment target is hit, ending the use of the Phillips Curve, and capping rates on long-term bonds. Want More Great Investing Ideas? 9 “BUY THE DIP” Growth Stocks for 2020 Newly REVISED 2020 Stock Market Outlook 7 “Safe-Haven” Dividend Stocks for Turbulent Times GLD shares were trading at $183.03 per share on Tuesday afternoon, up $0.80 (+0.44%). Year-to-date, GLD has gained 28.08%, versus a 1.26% rise in the benchmark S&P 500 index during the same period."}]}