{"article": [{"url": "https://stocknews.com/news/v-fdx-flo-bgs-4-stocks-to-buy-to-protect-your-portfolio-from-a/", "published": 1601381300.0, "headline": "4 Stocks to Buy to Protect Your Portfolio from a Market CRASH", "body": "A clear disconnect between the global economy and the stock market has developed since the onset of the coronavirus pandemic. As long as the recovery continues, the disconnect isn’t a cause for concern. However, now that there’s an increasing concern of the second wave of the virus, stock prices are more vulnerable to a market crash. This is especially true as Congress seems unable to reach a deal on a stimulus package especially with the election approaching and the situation getting more contentious with a Supreme Court vacancy. For investors, it could be an opportunity to add some high-quality companies. Several companies such as Visa Inc. (V), FedEx Corporation (FDX), Flowers Foods, Inc. (FLO) and B&G Foods, Inc. (BGS) should outperform in the coming months. 9 \"BUY THE DIP\" Growth Stocks For 2020Visa Inc. (V) V is a global technology-based payment processing company. V holds a 60% share of the debit and credit card market globally. The COVID crisis hurt V’s business operations, as the volume of POS transactions around the world fell drastically. However, the company’s dominating market presence allowed it to generate profits at a time when most companies are struggling to stay afloat. V’s net revenues and net income were $4.84 billion and $2.73 billion respectively in the third quarter ended June 2020. The company’s real-time push payments platform VisaDirect witnessed an 80% year-over-year increase in transactions in the United States. On September 10th, V extended its longstanding partnership with Paypal, Inc. (PYPL) to allow users faster access to their funds, and facilitate domestic as well as cross-border digital payments. V also developed an AI-based stand-in processing technology to help financial institutions process payments, especially during any service disruptions. V’s EPS is expected to grow at 8.8% per annum over the next five years. Moreover, V beat the street EPS estimates in three out of trailing four quarters, which bodes well for the stock. V has gained more than 60% since hitting its 52-week low of $113.93 in March. The stock hit its 52-week high of $217.35 in September. How does V stack up for the POWR Ratings? B for Trade Grade B for Buy & Hold Grade A for Peer Grade B for Industry Rank B for Overall POWR Rating. It is also ranked #2 out of 46 stocks in the Consumer Financial Services industry. FedEx Corporation (FDX) FDX is famous for its efficient shipping and transportation services across 220 countries. It transports an average of 3.60 million shipments each day. FDX gained more than 190% to hit its 52-week high of $259.95 in September since hitting its 52-week low of $88.69 in March. The company recently started using a lightweight sensor-based logistics device, called SenseAware ID, to ensure efficient tracking and provide customers with real-time updates regarding the location of a package. FDX plans to increase its average shipping rates by 4.9% within January 2021. Also, the company intends to increase its service efficiency and adapt various technological advancements in its delivery service. FDX reported strong results for the fiscal first quarter ended in August 2020, particularly due to the increase in e-commerce and business services. As many companies have outsourced their delivery requirements to FDX, the company witnessed significant volume growth. Revenue increased 13.5% year-over-year to $19.30 billion during the quarter, while net income rose 67.8% from the year-ago value to $1.25 billion. EPS improved 66.2% from the same period last year to $4.72. The consensus EPS estimate of $3.72 for the fiscal second quarter indicates a 48.2% increase year-over-year. The consensus revenue estimate of $19.21 billion indicates a 10.9% growth from the same period last year. It’s no surprise that FDX is rated a “Strong Buy” with a grade of “A” in Trade Grade, Buy & Hold Grade and Peer grade, and a “B” in Industry Rank. In the 9-stock Air Freight and Shipping Services industry, FDX is ranked #2. Flowers Foods, Inc. (FLO) FLO is the second-largest producer of packaged bakery products in the United States. With around 46 bakeries in over 85% states, FLO’s products are accessible to 85% of the U.S. population. The pandemic left a positive impact on FLO because of its market growth via innovation, improved brand presence, and M&A. FLO’s revenue increased 5.1% year-over-year to $1.03 billion in the second quarter ended June 2020, while adjusted EBITDA grew 21% from the year-ago value to $129 million. On July 20th, FLO announced its plans to consolidate its fresh packaged bread business unit with its specialty snacking business for improved revenue management. The consensus EPS estimate of $0.26 for the third quarter ending September 2020 indicates an 18% increase year-over-year. Moreover, the company has an impressive earnings surprise history, as it beat the street EPS estimates in each of the trailing four quarters. The consensus revenue estimate of $982.23 million indicates a slight improvement from the same period last year. FLO has gained more than 40% since hitting its 52-week high of $17.42 in March. The stock hit its 52-week high of $25.18 in September. FLO’s strong fundamentals are reflected in its POWR Ratings. It has a “Strong Buy” rating with an “A” for Trade Grade, Buy & Hold Grade, and Peer Grade. It is ranked #3 out of 58 stocks in the Food Makers industry. B&G Foods, Inc. (BGS) BGS manufactures and distributes an assortment of shelf-stable frozen foods across the United States through supermarket chains, mass merchants, and specialty distributors. The company has gained significant traction in the past couple of months amid rising unpopularity of dining out due to the pandemic. BGS’ net sales increased 38.1% year-over-year in the second quarter ended June 2020, while base business net sales rose 33.9% from the year-ago value to $496.90 million. Net income grew 146.1% year-over-year to $44.90 million, and EPS improved 150% from the same period last year to $0.70. The consensus EPS estimate of $0.65 for the third quarter ending September 2020 indicates a 20.4% improvement from the year-ago value. The consensus revenue estimate of $457.24 million for the ongoing quarter indicates a 12.5% rise year-over-year. BGS has gained more than 205% since hitting its 52-week low of $10.39 in March. The stock hit its 52-week high of $31.93 in August. BGS is rated a “Buy” in our POWR Ratings system, with a grade of “B” in Trade Grade, Buy & Hold Grade, and Peer Grade. It is currently ranked #16 out of 58 stocks in the Food Makers industry. Want More Great Investing Ideas? 7 “Safe-Haven” Dividend Stocks for Turbulent Times When Does the Next Bull Run Start? Chart of the Day- See the Stocks Ready to Breakout V shares were trading at $200.35 per share on Tuesday afternoon, up $0.03 (+0.01%). Year-to-date, V has gained 7.12%, versus a 4.96% rise in the benchmark S&P 500 index during the same period."}]}