{"article": [{"url": "https://stocknews.com/news/unh-is-unitedhealth-a-buy-sell-or-hold/", "published": 1598011700.0, "headline": "Is UnitedHealth a Buy, Sell or Hold?", "body": "UnitedHealth Group Inc. (UNH), is the world’s largest healthcare company with 130 million customers worldwide. It generates revenue from a variety of sources, including premiums on risk-based products, fees from various services, sales on healthcare products, and services and investment. Currently, UNH is the 19th largest publicly-listed company in the US. It grew along with the healthcare sector. In 1970, the total amount spent on healthcare was $74.6 billion which was 1.4% of GDP. In 2018, healthcare spending was $3.6 trillion, accounting for 17.7% of GDP. Given current rates, healthcare is expected to become nearly 25% of GDP by 2030. UNH is split into two divisions – UnitedHealthcare and Optum. UnitedHealthcare is its insurance division which accounts for 80% of its revenue. Optum is composed of a mail-order pharmacy, health savings account administration, and payment processing for healthcare providers. 7 \"SAFE HAVEN\" Dividend Stocks for Turbulent TimesUNH’s stock is trading about 3% below all-time highs. Since the market bottomed in late-March, the stock is 65% higher, and it’s 2% above its pre-coronavirus peak. (source: finviz.com) Its recent results have been very strong, although the numbers are skewed since many patient visits and procedures were delayed due to the coronavirus. Of course, the company kept collecting premiums which temporarily boosted earnings. UNH has been transparent about this issue and lowered its guidance for the second half of the year. Another potential issue is that if unemployment stays elevated, then it will experience a loss in revenue since it provides health insurance through corporate plans. Nevertheless, investors aren’t deterred, as the stock has been making new, all-time highs over the past couple of months. Given these risks and lofty levels, it’s worth asking if the stock is a buy, sell, or a hold. Some of the factors to examine to assess UNH are its POWR Ratings, earnings power, valuation, income, and technicals. POWR Ratings The great thing about the POWR Ratings is that it combines different fundamental and technical elements to give a holistic view of a stock. It’s a very useful tool to quickly identify which stocks are set up to outperform and underperform. For UNH, the POWR Ratings are very strong. It has a Strong Buy rating and an “A” in all categories except a “B” in Peer Grade. Among health insurers, it’s ranked #1 out of 9. Earnings Power In the long-run, UNH’s stock price will be determined by its earnings. (source: macrotrends) Above, we can see UNH’s 12-month trailing earnings and its consistent track record of earnings growth. It’s only decline came during the Great Recession when unemployment was elevated for an extended period. We can also see the transitory effect of the coronavirus leading to an earnings spike. In its last quarter, UNH said that the percent of premiums it paid out for medical expenses fell to 70% from an average of 83%. It’s expecting a higher payout in the next two quarters due to pent-up demand for procedures and doctor visits. It still maintained its full-year guidance of $16.25 to $16.55 per share in earnings. It also noted a decline in people on employer-sponsored plans due to job losses which led to only 1% revenue growth compared to 8% growth last year. In the long-term, the company’s earnings are going to grow along with healthcare’s share of the economy. That trend isn’t going to change given the aging population, increase in healthcare, and rising costs of healthcare. Over the last 10 years, CPI has averaged 1.7%, while healthcare inflation has averaged 3%. UNH is positioned to raise premiums along with healthcare spending and costs. In the short-term, the major risk is an extended period of unemployment. However, the market and UNH seem more focused on incremental improvements in the employment picture. Valuation UNH is the largest health insurer in the US with 50 million members. It acquired its market-leading position through a combination of organic growth and acquisitions. In 28 states, UNH is the first or second-largest provider of health insurance. In the insurance business, size matters. Larger insurers can offer more benefits and a larger provider network for its customers. It can also better distribute and manage risks. Since operating and profit margins are low in health insurance, there’s minimal risk of disruption. In turn, this attracts more customers and employers. As a result, UNH has a higher valuation than its closest competitor – Anthem (ANTM) due to its higher growth rate and more secure position. Now that it’s understood why UNH has and deserves a higher valuation than its peers let’s look at its financials. Consensus 2020 EPS is $16.23 which gives it an 18 multiple at the current price. To compare, the S&P 500’s price to earnings ratio is 29, and the average for health insurance stocks is 16. Like P/E, all of its valuation metrics are above the industry average. Some will see that as a negative, I believe it’s positive and justified by the company’s leading position and superior operations. The price to sales is 1.19, price to FCF is 18.5, and price to book is 4.67. UNH has had a higher valuation than its peers over the last decade, and it’s outperformed all its peers. The one risk of a higher valuation is that if sentiment turns negative and leads to multiple compression then it’s likely that UNH will have the most downside. However, during the coronavirus crash, UNH was the most resilient stock out of the group and posted the strongest rebound. Income UNH has raised its dividend for 11 straight years. This is an impressive feat, and it seems likely to continue this steak and become a dividend aristocrat. These are companies that have raised dividends for 25, consecutive years. Currently, UNH pays a 1.6% dividend which is significantly higher than the 10-year Treasury yield of 0.6%. The low-interest-rate environment creates a natural tailwind for high-quality dividend stocks, especially as bond investors are forced further down the risk curve to meet return targets. UNH should also appeal to dividend growth investors, as it’s increased its dividend by a 24% rate over the last 5 years. This year, it increased by 15.7%. Given that it has a payout ratio of 31% of its projected 2020 earnings, there’s further upside and no concern about it being unsustainable. Technicals UNH’s stock price strength over the past couple of months is notable that it’s happened despite a weak labor market, and the company issuing pessimistic guidance for the rest of the year. Bullish price action in the face of negative news always has to be respected. It’s a sign that investors have discounted near-term headwinds and are focused on the future. (source: finviz.com) Its relative strength to other stocks in the sector should also be noted. Looking at UNH’s long-term, monthly chart against the S&P 500 over the past decade, one thing stands out. Other than December 2018, after every pullback in the S&P 500, UNH made a new high as the index emerged from its lows. And, it went on to trend higher for months. The stock is also emerging from a 2.5-year consolidation from when it topped in December 2018 to making a new high in June 2020. Over this range-bound period, UNH grew earnings and revenue by 11% and increased its dividend by 45%. Closing Thoughts There are also two, potential catalysts for the stock. The economy continues to recover and the labor market keeps adding jobs which would mean more revenues and earnings for UNH. If Joe Biden is elected President, likely, the individual mandate comes back, and there are more generous subsidies which could also increase demand for health insurance. Even absent these catalysts, there is a lot to like about UNH. It has a massive moat, sells an expensive product that people need, and double-digit dividend growth rate. Want More Great Investing Ideas? The Best of StockNews 2 Step Process to Sell @ Market Top in September 9 “BUY THE DIP” Growth Stocks for 2020 UNH shares were trading at $312.81 per share on Friday afternoon, down $0.52 (-0.17%). Year-to-date, UNH has gained 7.33%, versus a 6.35% rise in the benchmark S&P 500 index during the same period."}]}