{"article": [{"url": "https://stocknews.com/news/clx-chd-kmb-3-consumer-products-stocks-that-are-cleaning-up/", "published": 1594296500.0, "headline": "3 Consumer Products Stocks that are Cleaning Up", "body": "At the beginning of the coronavirus pandemic, people were rushing to supermarkets and drugstores for essential items. Toilet paper, paper towels, and cleaning supplies were flying off the shelves. The current situation isn’t as dire as it was, but if you walk through a supermarket, you will likely see empty shelves in the paper product and cleaning supply aisles. The run on personal supply products was very profitable for the companies that manufactured them. This should continue as cases of COVID in the U.S. continue to surge. We are in our fourth month into the outbreak and daily infection rates are breaking records. The government has no clear plan to stop it and many citizens are ignoring social distancing rules. As the long as the pandemic continues, consumer products stocks should rise. 7 Best ETFs for the NEXT Bull MarketHere are three Consumer Product companies that are cleaning up during the coronavirus crisis: Clorox (CLX) Most people know about CLX from its cleaning supplies, but the company sells several other consumer products such as trash bags, laundry supplies, cat litter, and food dressings. Some of CLX’s brands include Pine-Sol, Glad, Hidden Valley, and Brita. While CLX isn’t typically considered high flying stock, COVID changed that. Bleach based cleaning products are one of the most in-demand items since the pandemic started. The stock is currently up 49% year to date. CLX’s 52-week high of $230.28 is the highest price the stock has ever reached. Plus, if you consider that the company also pays out a 1.9% dividend, you have a recipe for happy shareholders. It’s no surprise that CLX is one of the top rated stocks in our momentum based POWR Ratings system. Overall it is the #4 ranked stock in the #12 ranked industry (Consumer Goods). Church & Dwight (CHD) CHD is a company that does not have the same name recognition as CLX, but I’m sure you’ve used their products. CHD’s portfolio of products includes Arm & Hammer, Trojan condoms, and OxiClean stain cleaning supplies. Many of their products are considered lower cost compared to their competitors. This plays into the recession as many people are unemployed due to the pandemic. CHD has partnered with Amazon (AMZN) and Walmart (WMT) to provide products on each of their sites. Many of CHD’s products are top sellers on each platform. The company saw revenue jump 11.5% for the first quarter, and net income rose 30.1%. The company also generates strong cash flow. It is currently sitting on $1 billion in cash. The stock is up 16% year to date. CHD is holding a poker hand with 5 Aces. By that, I mean that all 5 scores of our exclusive POWR Ratings system are an A for the stock. It is also the #5 ranked stock in a top-ranked industry (Consumer Goods). Kimberly-Clark (KMB) The final company on the list is a manufacturer of personal care and tissue products. Its brands include Huggies, Kotex, Kleenex, and Cottonelle. The company has held up well during the pandemic due to the crazy demand for toilet paper, as I mentioned earlier. Revenue at the company increased 8% in the first quarter, while net income was up 45.5% during the same period. KMB is a company to buy and hold for the long term as people will always be going to the bathroom and need their products. KMB also has a high dividend yield of 3%. The company has been raising its dividend for 47 years in a row. While the stock took a hit in March, it has rebounded nicely, as it is up 26.6% since its low on March 23rd. Besides benefiting from the recent demand in paper products, the stock also provides safe investment in a prolonged recession. How does KMB stack up for the POWR Ratings? A for Trade Grade A for Buy & Hold Grade A for Industry Rank A for Peer Grade A for overall POWR Rating You can’t ask for better. The stock is also the #3 rated stock in the Consumer Goods industry. Want More Great Investing Ideas? 9 “BUY THE DIP” Growth Stocks for 2020 Is the Bull S#*t Rally FINALLY Over? 7 “Safe-Haven” Dividend Stocks for Turbulent Times Top 3 Investing Strategies for 2020 CLX shares . Year-to-date, CLX has gained 51.30%, versus a -1.32% rise in the benchmark S&P 500 index during the same period."}]}