{"article": [{"url": "https://stocknews.com/news/klac-snps-xrx-sabr-2-tech-stocks-to-buy-right-now-and-2-to/", "published": 1599739700.0, "headline": "2 Tech Stocks to BUY Right Now and 2 to AVOID", "body": "The stock market, and more specifically, the tech sector, has had a rocky week. The tech stocks have been down in three out of the past four trading sessions. The Nasdaq Composite index is down 9.4% since Sept 2, and the SPDR Technology ETF (XLK) is down 10.4% over the same period. Some of the biggest stocks that have benefited from the pandemic are seeing some of the most significant losses. For instance, Tesla (TSLA) is down 17% since last Wednesday. Investors may be wondering if it’s time to pull out of tech stocks. While I don’t believe the sector needs to be avoided altogether, I do think we need to be selective in which tech stocks we invest in. Some tech companies have great futures in front of them. At the same time, others should be avoided completely. While there were many stocks to choose from, I selected two stocks I believe have healthy fundamentals and a strong path to future growth, and two stocks with strong headwinds and a much murkier future. KLA (KLAC) and Synopsys (SNPS) are two stocks with great outlooks, and Xerox (XRX) and Sabre (SABR) are two stocks with I would avoid. 7 \"SAFE HAVEN\" Dividend Stocks for Turbulent TimesStocks to Buy KLA Corp. (KLAC) KLAC designs and manufactures yield-management and process-monitoring and control systems for the semiconductor industry. These systems are used to analyze the manufacturing process at various steps in a product’s development. The company’s laser-scanning products are used for wafer qualification, process monitoring, and equipment monitoring. The firm also provides inspection tools and systems for optical metrology and e-beam metrology. The company has a strong competitive position in inspection and metrology and long-term growth potential in yield management solutions. The firm’s transition to advanced nodes is expected to drive growth in the future. KLAC is trading at a reasonably low price based on StockNews.com discounted cash flow analysis, which has placed a fair value price of $211.52 on the stock. It closed today at $173.13. Its price to free cash flow ratio is 16.8, which is considerably lower than the industry average of 28.2. The company also has strong growth numbers, with a 27% increase in sales over the last year. KLAC is also highly profitable, with a return on equity of 45.7% and a return on invested capital (ROIC) of 22%. The stock is rated a “Buy” in our POWR Ratings system. KLAC has a grade of “A” for Industry Rank and a grade of “B” for Trade Grade and Peer Grade. These are three out of the four components that make up the POWR Ratings. The company is also the #11 ranked stock in the Semiconductor & Wireless Chip industry. Synopsys (SNPS) SNPS is a market leader in electronic design automation software. The company provides an end-to-end workflow of EDA products, which are used to automate the design and verification of integrated circuits or larger chip systems. SNPS also offers a broad set of design intellectual property and leading software integrity tools that help customers develop secure code. The company’s tools have traditionally been used by semiconductor firms, but the company has made a shift to providing workflows for the Internet of Things (IoT), artificial intelligence, autonomous vehicles, and cloud computing. The company is benefiting from its robust product portfolio. Work-from-home and e-learning trends have driven driving demand for bandwidth. and the company is also seeing growing demand for its design, IP, and security solutions. SNPS had a strong quarter beating both earnings and revenue estimates. Earnings grew 167.7%. The company also has a healthy profit margin of 17.9%. The firm is poised for future growth due to its EDA and chip design IP businesses. SNPS will also benefit over the long-term as it shifted to a subscription-based, recurring revenue model. SNPS is rated a “Buy” by our POWR Ratings system. The company has a grade of “A” for Trade Grade, Peer Grade, and Industry Rank. It has a grade of “B” for the remaining component, Buy & Hold Grade. SNPS is the #5 ranked stock in the Technology – Hardware industry. Stocks to Sell Xerox (XRX) XRX is an original equipment manufacturing and software company. It operates in one segment–design, development, and sale of printing technology and related solutions. In addition to equipment, the company provides post-sales services like managed print services-, which helps to bring smart servicing and efficiencies to how employers use their print and copy equipment. XRX is looking to enter new markets like digital print packaging solutions and printed electronics. The company has been grappling with a decrease in the demand for paper related products. This is due to advancements in technology that allow documents to be transferred through digital media. The company is also facing strong competition from companies such as Canon (CAJ), Hewlett-Packard (HP), and Toshiba (OTCMKTS:TOSBF). This has reduced XRX’s profit margin. The company had an abysmal recent quarter as both earnings and revenues were not only down from last year, but missed analyst expectations. XRX is rated a “Sell” by our POWR Ratings system. The company has a grade of “F” for Buy & Hold Grade, and a grade of “D” for Trade Grade and Peer Grade. The stock is also ranked near the bottom of the Technology – Hardware industry. Sabre (SABR) SABR provides software and technology solutions that power the global travel industry. The firm connects travel suppliers such as tour operators, airlines, hotels, and cruise lines with travel buyers. The company offers a suite of solutions that helps travel suppliers improve their reservation systems, enhance marketing, and manage daily operations. With the travel industry so negatively affected by the coronavirus pandemic, SABR prospects remain low. Worldwide lockdowns limited SABR’s travel bookings and financials. Approximately 80% of the company’s business is linked with air travel, and its gross air bookings were down 90% year over year in April and May. The company had a horrible quarter as both sales and revenue were down considerably from last year. EPS came in at $-1.30, and revenue dropped from $1 billion to only $83 million. Another reason to avoid SABR is its debt load. As of Jun 30, 2020, the company’s net debt was $3.38 billion. SABR is rated a “Sell” in our POWR Ratings system. The company has grades of “F” for Trade Grade and Buy & Hold Grade, and a grade of “D” for Peer Grade. It is also ranked #33 out of 57 stocks in the Internet industry. Want More Great Investing Ideas? 7 Best ETFs for the NEXT Bull Market Will Stocks Fall into Historical September Slump? 9 “BUY THE DIP” Growth Stocks for 2020 KLAC shares . Year-to-date, KLAC has declined -1.45%, versus a 4.81% rise in the benchmark S&P 500 index during the same period."}]}