{"article": [{"url": "https://stocknews.com/news/t-vz-ibm-3-dividend-tech-stocks-yielding-up-to-7/", "published": 1600258100.0, "headline": "3 Dividend Tech Stocks Yielding Up to 7%", "body": "When it comes to investing in dividend stocks, technology companies have traditionally taken a back seat. Companies that generate a steady stream of cash flows reinvest it in capital expenditure. Alternatively, income streams can also be used to reduce debt or pay a dividend to investors. Technology stocks are generally disruptive and use any additional capital for growth and expansion efforts. However, there are a few tech companies that have attractive dividend yields making them a top bet for income investors. Dividend stocks provide investors with a predictable stream of income and the possibility of capital appreciation over the long-term. Let’s take a look at three such tech companies that are yielding up to 7%. 7 Best ETFs for the NEXT Bull MarketAT&T has a forward yield of 7% The first stock on the list is AT&T (T) which is trading at a price of $29.37, indicating a forward yield of 7%. AT&T stock was actually trading at this price in 1997. The stock hit a record high of $60 during the dot-com boom and has burnt massive investor wealth. Over the years, AT&T has had to spend billions in capital expenditure to build a robust telecom infrastructure to first support landlines and then smartphones. The upcoming transition to 5G will also require significant investments. It has also spent heavily on acquisitions of WarnerMedia and DirecTV, which means it ended the June quarter with long-term debt of $157 billion. However, the company’s huge market presence and diversified business mean that A&T will continue to pay dividends to investors. In Q2, AT&T’s payout ratio stood at 50% given its free cash flow of $7.6 billion and quarterly dividend costs of $3.75 billion. The telecom behemoth has suspended its share repurchase program amid the COVID-19 pandemic which will increase liquidity. While AT&T stock trades at a cheap valuation, it is also growing revenue and earnings at a sluggish rate. Analysts tracking the stock expect AT&T sales to fall by 6.4% to $169 billion while earnings decline is forecast at 11% for 2020. Comparatively, its revenue and earnings are estimated to grow by 1.3% in 2021. Even if the stock remains range bound, AT&T’s dividend yield is too good to ignore especially in the current environment that is volatile, to say the least. The company has increased its dividends by 24% in the last 10 years and investors can expect the payout to continue to increase over the long-term. Verizon has a dividend yield of 4.14% Another telecom stock with an attractive forward dividend yield is Verizon (VZ). The stock is trading at $60.60, indicating a yield of 4.14%. Telecom businesses provide essential services in this technology age as consumers are likely to pay their phone bills, recession or not. Due to their recession-proof business, cash flows for telecom companies remain stable across business cycles allowing them to maintain or even raise dividend payouts. Verizon increased its quarterly dividend by $0.01 per share to $0.63, indicating an annual payout of $2.52 per share. Verizon managed to increase its operating cash flow to $14.7 billion, up from $8.8 billion due to a lower churn rate. In the last 12-months, the company’s free cash flow stood at $21.1 billion while it paid over $5 billion to shareholders, indicating a payout ratio of about 50%. In the June quarter, Verizon sales fell 5% year-over-year which was attributed to tepid advertising sales due to COVID-19. In the first six months, operating revenue was down 3.3% at $62.1 billion while net income decline was lower at 1.2%. Similar to AT&T, Verizon is also trading at a lower valuation. Its forward price to earnings multiple stands at 12.7x. Verizon will continue to invest heavily due to the 5G transition and expects to spend up to $18.5 billion to fight competition from 5G peers. Verizon recently acquired prepaid service Tracfone for $6.25 billion. This includes $3.125 billion in cash and the rest in Verizon common stock. Verizon Group CEO Ronan Dunne said, “This transaction firmly establishes Verizon, through the Tracfone brands, as the provider of choice in the value segment, which complements our clear leadership in the premium segment. Being connected is now more important than ever, and Tracfone customers will benefit from Verizon’s innovations–both now and in the future.” Verizon ended Q2 with $7.9 billion in cash and its operating cash flow of $43.46 billion in the last 12-months indicates it can easily fund the acquisition, despite its total debt of $135.7 billion. IBM has a dividend yield of 5.3% The third and final high yielding tech stock on the list is International Business Machines (IBM). The company’s dividend yield stands at 5.33% and similar to the other two stocks here, IBM is also a Dividend Aristocrat. The Dividend Aristocrat status is given to companies that raise dividends for 25 consecutive years, indicating stability. IBM also increased its quarterly dividends by $0.01 per share to $1.63 in April 2020. In the June quarter, IBM sales fell 5.4% to $18.1 billion. However, its cloud business sales were up 3.3% at $5.7 billion. IBM expects to benefit from the transition towards the public cloud. IBM stock is trading at a forward price to earnings ratio of 11.05x which again is a cheap multiple. The Final takeaway If you invest $5,000 in each of these stocks, you can generate close to $850 in annual dividend payments. But due to their mature businesses, the three tech stocks might continue to underperform the broader markets in terms of stock returns. If you are looking at generating a recurring income stream, investing in quality and safe dividend stocks such as Verizon, AT&T and IBM make perfect sense. Want More Great Investing Ideas? 7 Best ETFs for the NEXT Bull Market Stock Market Outlook: Before & After the Election Chart of the Day- See the Stocks Ready to Breakout T shares were trading at $29.35 per share on Wednesday afternoon, up $0.23 (+0.79%). Year-to-date, T has declined -21.21%, versus a 7.33% rise in the benchmark S&P 500 index during the same period."}]}