{"article": [{"url": "https://stocknews.com/news/nio-gsx-fsly-3-stocks-that-more-than-doubled-this-month/", "published": 1594642100.0, "headline": "3 Stocks That DOUBLED Over the Past Month", "body": "The stock market has been scorching hot this summer. Over the past month, the Nasdaq has made all-time highs. Within this index, there have been several standouts, individual stocks that have doubled. One common thread between these winners has been accelerating revenue growth and a major opportunity in terms of the total addressable market. Another factor is that all of these stocks are in hot sectors which are seeing tremendous amounts of investor interest. For example, NIO (NIO) is a Chinese stock and an electric vehicle manufacturer. Many EV stocks have seen monster gains over the last couple of months, and many Chinese stocks have been making new highs as well. 9 \"BUY THE DIP\" Growth Stocks For 2020During bullish periods, investors are apt to focus on a stock’s potential rather than other concerns like valuation. Here are three stocks with tremendous upside potential that have doubled over the past month: NIO Inc. (NIO) NIO has gained more than 500% since hitting its year-to-date low in mid-March due to the pandemic-driven market crash and concerns about its ability to meet debt obligations. Since its bottom, NIO has furiously rallied and hit an all-time high of $15.73 on July 10th. The primary catalyst for this rally was an improvement in its liquidity position. A secondary factor was increased investor interest in electric vehicle stocks as many stocks in the sector have seen extraordinary gains over the past few weeks. Regarding its financial condition, at the end of April, NIO entered into an agreement with strategic investors into its business. In another attempt to boost its liquidity, NIO recently secured credit lines worth $1.48 billion from a few national state-owned commercial banks in China. This China-based company specializes in the manufacturing and sale of smart electric vehicles. NIO provides its customers with unique user-centric services and charging solutions. The expansion of its sales network, user community support, and competitive products are the main drivers of its growth. Improved cost control and operational efficiency in the past few quarters have helped it cope with the difficulties of the Covid-19 outbreak. NIO delivered 4,740 vehicles in June, a new monthly record, and 10,331 vehicles in the second quarter this year, exceeding its quarterly guidance. Although there has been a decrease in revenue and vehicle sales in the first quarter due to Covid-19, there has been measurable growth and recovery with the company returning to its pre-coronavirus trajectory. How does NIO stack up for the POWR Ratings? A for Trade Grade A for Buy & Hold Grade A for Peer Grade A for Industry Rank A for Overall POWR Rating You can’t ask for better. The stock is also ranked #8 out of 115 stocks in the China group. GSX Techedu Inc. (GSX) As a provider of online education, GSX was in a position to benefit from the coronavirus as schools were shut down for many months. Its gains over the past month are primarily due to its emergence from a three-month consolidation between $30 and $45. The catalyst for the breakout was a better than expected earnings report. In May, GSX’s stock was hit by fraud allegations as many Chinese companies’ financials were being questioned. So far, GSX’s management pushed back aggressively and seems to have dispelled these concerns. The stock price has also rebounded to its highest ever level of $89.00 on July 10th. This represents a more than 200% return since it hit its lowest level on May 21st. GSX is a tutoring service provider in China that specializes in online K-12 courses. GSX offers courses for primary and secondary grades and also foreign language, professional and interest courses. The company aims for sustained long-term growth and has a huge total addressable market. GSX increased its investments in technological development as well as customer acquisition in the first quarter and aims to hire highly skilled teaching and technological professionals. In the first quarter, GSX’s net revenue increased 382% year over year, net income increased 336.6% year over year and gross profit increased by 442.1% year over year. The company reported an EPS of $0.76 for the quarter, beating the consensus estimate by 33.3%. Moreover, the market expects GSK to report EPS of $0.38 for the quarter ended June, which compares to $0.01 in the year-ago quarter. The revenue expectation for the quarter also represents an increase of 364.2% over the prior-year quarter. GSX’s impressive price momentum over the past few months is reflected in its POWR Ratings, it has a “Strong Buy” rating with an “A” in Trade Grade, Buy & Hold Grade, Peer Grade, and “B” in Industry Rank. Within the Outsourcing-Education Services group, it’s ranked #1 out of 26 stocks. Fastly, Inc. (FSLY) FSLY is a modern-edge cloud platform. It focuses on processing, serving, and securing its customer’s applications. Fastly is a winner of the coronavirus economy due to the increased demand and use of cloud services and products. As cloud computing grows, FSLY will have more demand for its services. FSLY has gained more than 575% since hitting an all-time low of $10.63 in mid-March. The price skyrocketed because of the rise in demand for its platform amid strong growth for its customers. It has experienced increased usage of its cloud platform across a multitude of verticals and geographies. Many big companies such as Spotify (SPOT), Shopify (SHOP), Microsoft (MSFT), and Wayfair (W) are customers of FSLY. For the first quarter, enterprise customers constituted 88% of FSLY’s total revenue and the number of enterprise customers had increased to 297, compared to 249 in the first quarter last year. FSLY is focused on customer base expansion and also increasing its existing customer engagement. It recorded a dollar-based net expansion rate of 133% in the first quarter. FSLY plans to continue investing in innovative technologies as well as internal optimization and automation. In the first quarter, revenue increased by 38% year-over-year and FSLY also recorded a net retention rate of 130%, which demonstrates the stickiness of its cloud platform. FSLY’s POWR Ratings reflect this promising outlook. It has an overall rating of “Buy” with an “A” for Trade Grade and Peer Grade and a “B” for Buy & Hold Grade and Industry Rank. Want More Great Investing Ideas? 9 “BUY THE DIP” Growth Stocks for 2020 Top 5 WINNING Stock Chart Patterns 7 “Safe-Haven” Dividend Stocks for Turbulent Times NIO shares rose $0.06 (+0.43%) in after-hours trading Monday. Year-to-date, NIO has gained 244.28%, versus a -1.17% rise in the benchmark S&P 500 index during the same period."}]}