{"article": [{"url": "https://stocknews.com/news/nvda-cmg-bkng-3-companies-that-should-issue-stock-splits/", "published": 1597666100.0, "headline": "3 Companies That Should Issue Stock Splits", "body": "Now that Apple (AAPL) and Tesla (TSLA) have announced stock splits, inspiring a flurry of buying activity, it is time to shift our attention to other stocks that might follow suit. A stock split is when a company significantly increases the amount of outstanding shares, while preserving market value, in order to attract more retail investors that might shy away from high-priced stocks. Though there is no guarantee a stock split will result in a rally, there is certainly a good chance for a meaningful increase in market interest that sends the stock to new heights, prior to its division. 7 \"SAFE HAVEN\" Dividend Stocks for Turbulent TimesThe following stocks are solid split candidates, largely because of their elevated price and popularity with the general stock-buying public: NVIDIA (NVDA), Chipotle Mexican Grill (CMG) and Booking Holdings (BKNG). NVIDIA (NVDA) When it comes to graphics processing and computer processing functions, NVDA is king. If you own any type of handheld or consumer electronic device, there is a good chance it has at least one NVDA component. The rise of the gaming industry and the upcoming virtual reality (VR) era has set the stage for NVDA’s continued success. The only question is how high this stock will go before it eventually splits. Currently the stock is trading at about $493. The POWR Ratings show NVDA has A grades in each POWR Component. NVDA is ranked second of nearly 90 stocks in the Semiconductor & Wireless Chip category. The analysts are fairly bullish on NVDA. Out of 29 analysts who have reviewed the stock, 25 rate the stock as a Buy, three rate it as a Hold and one advises selling. NVDA has a forward P/E ratio of 58.53, meaning it is priced quite fairly at its current trading level especially when juxtaposed against other tech stocks. If NVDA’s next earnings are solid, which will be released on Wednesday AUgust 19th, the stock will likely break through the $500 level, possibly prompting a stock split before year’s end. Chipotle Mexican Grill (CMG) CMG is an extremely popular fast-casual restaurant that serves a variety of Mexican food. Shares of CMG have nearly tripled in value since its mid-march low of $465, and are currently at about $1,215. CMG has performed quite nicely during the pandemic, providing efficient pre-order and carryout service for those who do not want to stand elbow-to-elbow while waiting in CMG restaurants’ notoriously long in-store lines. Though CMG’s forward P/E ratio of 113 is fairly high for a restaurant stock, it is well worth it considering CMG’s offerings are loved by youngsters. These consumers will continue to patronize CMG restaurants far into the future, ultimately making CMG a growth stock. The POWR Ratings show CMG has A grades in each POWR Component with the lone exception of its Industry Rank grade of B. Out of nearly 50 publicly traded companies in the Restaurants sector, CMG is ranked second. Look for CMG to split after the stock moves even higher once the economy fully reopens and its restaurants become that much more crowded. Booking Holdings (BKNG) Though travel is not exactly the hottest industry at the moment due to the spread of the virus, BKNG’s stock is ascending toward its pre-COVID levels. As one of the world’s largest travel businesses, BKNG has plenty of promise, especially in a post-COVID world when everyone will be looking to travel. BKNG has established strategic relationships with all sorts of transportation companies and vacation providers that enable the company to accept bookings placed through those partners’ sites. Priced at about $1,750, BKNG could be considered overdue for a stock split. Not to mention, a split would bring a significant amount of attention to the company from retail investors, during a time in which travel stocks are being ignored. When in doubt, check the POWR Ratings. BKNG has A grades in two of the four POWR Components, its Trade Grade and Industry Rank. Though BKNG has C grades in the remaining POWR Components, it is ranked in the top 10 of more than 50 Internet stocks. Furthermore, the top analysts have set a $1,922.50 price target for the stock, indicating it has around 10% upside. Want More Great Investing Ideas? The Best of StockNews 3 Possible Directions for the Stock Market from Here 9 “BUY THE DIP” Growth Stocks for 2020 NVDA shares were trading at $493.48 per share on Monday afternoon, up $30.92 (+6.68%). Year-to-date, NVDA has gained 109.95%, versus a 6.07% rise in the benchmark S&P 500 index during the same period."}]}