{"article": [{"url": "https://stocknews.com/news/pfe-is-pfizer-stock-a-buy/", "published": 1600171700.0, "headline": "Is Pfizer Stock a Buy?", "body": "Pfizer Inc. (PFE), one of the leading drug makers in the world, has experienced moderate growth rates over the past five years. This led to the stock being dropped from the Dow Jones Industrial Average in August. However, the stock is now garnering attention from across the globe regarding its coronavirus vaccine development. CEO Albert Bourla recently stated that a coronavirus vaccine could be distributed before the end of 2020. The efficacy of the vaccine can be determined by the end of October, following which mass production and distribution would begin. Apart from COVID-19, PFE has a number of candidates for other diseases in its pipeline. By 2025, PFE is expected to get approval for 6 diabetic medicines, 6 vaccines, 12 autoimmune drugs, 3 gene therapies and 14 cancer treatments, which would contribute more than $15 billion to its annual revenue. 7 \"SAFE HAVEN\" Dividend Stocks for Turbulent TimesPFE’s expected growth in the upcoming years, coupled with several other factors, has helped it earn a ‘Buy” rating in our proprietary rating system. Here’s how our proprietary POWR Ratings system evaluates PPE: Buy & Hold Grade: A In terms of proximity to its 52-week high, which is a key factor that our Buy & Hold Grade takes into account, PFE is well positioned. The stock is currently trading 10.6% below its 52-week high of $40.97, which it hit on January 24th. PFE gained 3.5% in the past three years, which can be attributed to its income and EPS growth. The company’s net income grew at a CAGR of 19.4% in the past three years, while diluted EPS rose at a CAGR of 22.7% over the same period. PFE’s solid drug manufacturing history, financial strength and a dividend yield of 4.11% make it an ideal long-term investment. Peer Grade: A PFE is currently ranked #21 out of 232 stocks in the Medical-Pharmaceuticals industry. Other popular stocks in this industry are Johnson & Johnson (JNJ), Novo Nordisk A/S (NVO) and Sanofi (SNY). Year-to-date, JNJ, NVO and SNY gained 4.4%, 19.7% and 7.6%, respectively, versus PFE’s loss of 3%. However, in terms of product pipeline and financials, PFE is in a better position than many of its peers. Trade grade: B PFE is currently trading above its 200-day moving average of $36.51. However, it is trading slightly lower than its 50-day moving average of $37.20. However, it indicates an uptrend in the stock. Moreover, PFE gained 9.6% in the past three months, implying short-term bullishness. PFE’s short-term performance was driven by its involvement in the COVID-19 vaccine development. On September 9th, PFE and BioNTech announced progress in the preclinical trials of its m-RNA based vaccine. Based on the potential success of the drug, PFE and BioNtech already entered into agreements with the European Union and Japan to supply 200 million and 120 million doses to the respective countries. PFE’s revenue from the biopharma segment increased 4% year-over-year to $9.79 million in the second quarter ended June 2020. Industry Rank: B The Medical–Pharmaceutical industry is ranked #7 out of 123 industries in the StockNews.com universe. With the raging coronavirus pandemic, the Medical–Pharmaceutical industry is currently under pressure for developing an effective vaccine or a drug. Many countries are unable to control the rapid spread of the virus, and those which successfully flattened the curve in the past are witnessing a second wave. With the rising global demand for an effective vaccine and/or a treatment, pharmaceutical companies are expected to benefit substantially. Overall POWR Rating: B PFE is rated “Buy” based on its past performance, short-and-long-term bullishness, and underlying industry strength, as determined by the four components of our overall POWR Rating. Bottom Line Despite it’s stock being down more than 5% year-to-date, PFE is still rated a “Buy.” It has the potential to trend higher in the upcoming months based on a possible coronavirus vaccine and its underlying industry strength. PFE has an average broker rating of 1.56, indicating favorable analyst sentiment. The company has an impressive earnings surprise history as well, as it beat the street EPS estimates in three out of trailing four quarters. Want More Great Investing Ideas? 7 Best ETFs for the NEXT Bull Market Is the Stock Market Correction Over? Chart of the Day- See the Stocks Ready to Breakout PFE shares were trading at $37.00 per share on Tuesday afternoon, down $0.01 (-0.03%). Year-to-date, PFE has declined -2.71%, versus a 6.93% rise in the benchmark S&P 500 index during the same period."}]}