{"article": [{"url": "https://stocknews.com/news/xom-psa-not-all-stock-yields-are-the-same/", "published": 1596629300.0, "headline": "Not All Stock Yields Are the Same", "body": "The 10-year treasury bond now yields 0.5% Last Friday, the yield on the 10-year Treasury note dropped to 0.520%. According to Deutsche Bank, that’s the lowest yield in 234 years. Whenever you see stats like this, know that someone is getting get a little creative. What they’re doing is splicing data from other sources to come up with a continuous look at treasury yields. Still, my data only goes back a few decades, so I’ll take their word for it. 7 Best ETFs for the NEXT Bull MarketNevertheless, these rock-bottom yields are remarkable. Think of it this way: the 10-year Treasury note now yields 5.2%, not per year, but the combined total over the life of the bond. Less than two years ago, the 10-year was yielding over 3%. As recently as 2007, the 10-year could fetch you over 5%. Those days are gone. What’s happening now, of course, is an outgrowth of the pandemic and the related economic lockdown. It really doesn’t say much about the brilliance of the governance of our finances. In fact, our government’s finances are in pretty lousy shape, too. The good news is that investors are still willing to lend Uncle Sam lots of money. When people are scared, they want to put their money in a place where they know it will be safe. Right now, that’s the U.S. treasury market. There’s a bubble emerging right now, but it’s not in the bond market. Rather, we’re seeing fear manifesting itself as a bond market bubble. Bond yields have fallen recently, despite many “expert” predictions that yields would soon soar, or that inflation would make a dramatic comeback. After all, the government was printing so much money and putting it in people’s hands… those yields had little choice but to go higher, right? Well, apparently not. We’re also in an interesting spot, with stock yields significantly above Treasury yields. I could see an argument that stocks are more volatile than bonds, so the higher yield is deserved, but is that protection really worth 150 basis points? Hmm… call me a doubter. Not All Stock Yields Are the Same ExxonMobil (XOM) There’s an important point to be made here. Investors need to understand that not all stock yields are the same. For example, shares of ExxonMobil (XOM) currently yield well over 8%, but that’s based on the current dividend. ExxonMobil has been paying out a dividend of 87 cents per share. The problem is, this dividend is not sustainable. In fact, most any dividend from the company is hard to sustain. Let’s look at the numbers. ExxonMobil recently reported a quarterly loss of 70 cents per share—even worse than the dismal expectations Wall Street had. The bad news doesn’t stop there. ExxonMobil made only 53 cents per share for Q1 and 41 cents per share for last year’s Q4. The oil giant is consistently paying its shareholders more than the company makes. A company can do that for a little while, but at some point, reality has to set in. Amazingly, ExxonMobil just declared another payment of its 87-cent dividend for shareholders of record on August 13. The dividend will be paid on September 10. The amount of money shed is staggering. Vitaliy Katsenelson writes: “Over the last ten years ExxonMobil spent $275 billion returning money to shareholders through dividends and stock buybacks, while it earned $318 billion of net income.” For Q2, Wall Street expects ExxonMobil to lose only two cents per share. It’s odd when a loss like that will be a nice improvement. I suspect that the company will soon slash its dividend to something like 30 cents per share. If that’s correct, that means the stock will yield around 2.8%. I doubt I’ll be exactly right, but I think I’ll be closer to the market than the current dividend. Something has to give. Looking for Yield? Check out Public Storage I’ve been impressed by the number of high-quality stocks that still pay decent dividends. One of the best areas is in storage real estate investment trusts (REITs). (Note: my colleague Tim Plaehn has quite the level of expertise with REITs. In fact, he just suggested three REITs you should look into, including one tied into the growing 5G roll-out.) Let’s say your boss offers you a big raise and a promotion, but the catch is that the job requires you to move out the country. You’d love to see the world, so you jump at the chance. But there’s one nagging question: what do you do with all your stuff? Public Storage (PSA) Nowadays, there’s an easy answer. You rent a storage unit. There are lots of these facilities all over the country. If you look long enough, you’re bound to come across my favorite storage name in the field, Public Storage (PSA). Public Storage is the largest self-storage REIT in the United States—there are currently more than 2,200 locations around the world. If you’re not familiar with REITs, they’re basically a landlord for real estate. If an REIT pays out almost all of its income to shareholders, then it gets preferential tax treatment. As a result, REITs often have good dividend yields. More than 90% of Public Storage’s revenue comes from its self-storage business. Of course, the company does a lot more than just providing storage space. Public Storage also offers insurance and packing products, and the company has a subsidiary that provides boxes and truck rentals. It’s an interesting business because the storage lots tend to be located in unforgiving sections of large cities. They’re often located in dense clusters near freeways and intersections. It’s also interesting that Public Storage has relatively few employees. The lots are automated so customers can access their units at any time. Public Storage has been a tremendous business over the years. Thirty years ago, you could have picked up one share for less than $7. Since then, the stock has increased by nearly 30-fold… and if you include dividends, then Public Storage gained over 110-fold! All from renting storage units. But here’s the best part: the dividend. Public Storage currently pays out a quarterly dividend of $2 per share, or $8 for the year. Based on the current share price, the stock now yields about 4%. That’s certainly a lot better than competing investment at quarter-of-a-millennium lows. Want more great investing ideas? Download free the “10-Step Options Trading Checklist” you need before making a trade. The Virtual Trading Pit Is Open: Trade Set-ups, Training, New Trading Ideas How to Try Out Options Without Risking a Penny XOM shares were unchanged in after-hours trading Wednesday. Year-to-date, XOM has declined -35.02%, versus a 4.25% rise in the benchmark S&P 500 index during the same period."}]}