{"article": [{"url": "https://stocknews.com/news/rio-bti-bep-3-international-dividend-stocks-to-hold-long-term/", "published": 1594642100.0, "headline": "3 International Dividend Stocks to Hold Long Term", "body": "In a challenging economic environment, investors need to think about reducing the risk profile in their portfolios. One way to do that is to add dividend producing stocks. Adding equity income to your portfolio is a good idea in any economic environment but especially while interest rates are low, like they are now You can diversify your portfolio even more by looking at companies outside the United States. Here is a list of three international dividend-yielding stocks that are either a Strong Buy or Buy in the POWR Ratings system: 9 \"BUY THE DIP\" Growth Stocks For 2020Rio Tinto (RIO) RIO engages in finding, mining, and processing mineral resources worldwide, with iron ore being the dominant commodity. The company, which is based in London, generated $9.2 billion in free cash flow last year. This provides the company enough cash to distribute a dividend of $3.82 per share. This is a 6.5% dividend yield with a 38.7% payout ratio. The company owns an integrated network of 16 mines in the Pilbara region of Western Australia. RIO extracts the bulk of its ore from this mine. 76% of the company’s EBITDA comes from ore. As commodity prices go higher, RIO’s free cash flow will follow. Healthy demand from China should continue to propel the price of iron ore over the long term. How does AAPL stack up for the POWR Ratings? A for Trade Grade A for Buy & Hold Grade B for Industry Rank A for Peer Grade A for overall POWR Rating Those are excellent grades, including the fact that it is the #1 rated stock in one of the top industries, Industrial – Metals. British American Tobacco Industries (BTI) Investors looking for defensive stocks can typically find them in the tobacco industry. BTI provides cigarettes and other tobacco products worldwide. Based in London, the company acquired Reynolds American in 2017, which gave the company the second-largest market share in the U.S. market. BTI operates in two different segments, Cigarettes or Combustible Tobacco Products and Vapor Products. The company recently reported continued growth in the cigarette business and growth in vapor products and oral products. Surprisingly enough, BTI is also working on a vaccine for COVID-19. The company is testing a plant-based solution. BTI has a dividend yield of 7.4% with a payout ratio of 73.0% The stock is rated a Buy in the POWR Ratings and is ranked the #1 stock in the Tobacco industry. BTI also holds grades of B for Trade Grade and A for Peer Grade. These are two of the components that make up the POWR Ratings. Brookfield Renewable Partners (BEP) One of the latest trends in investing is ESG investing. This stands for environmental, social, and corporate governance. In terms of environmental investing, renewable energy fits the bill. BEP is a renewable power generating company. It owns a portfolio of renewable power generating facilities that are spread across North America, Latin America, and Europe. These include solar, wind, distributed generation, and energy storage. Since the company has facilities worldwide, it can tap into developing nations that are reliant on old technology such as dams. BEP provides them an alternative that isn’t dependent on the weather. The stock has performed well. It is up 38% over the last year and has an average annual return of 17% since its inception almost 20 years ago. BEP has a dividend yield of 4.4%. The stock is rated a Buy in the POWR Ratings and is ranked the #2 stock in the MLPs – Other Stocks industry. Companies in this industry own and operate contracted clean energy projects and have interests in wind and solar projects, and energy and transport businesses. BTI also holds grades of As for Trade Grade and Peer Grade. Want More Great Investing Ideas? 9 “BUY THE DIP” Growth Stocks for 2020 Top 5 WINNING Stock Chart Patterns 7 “Safe-Haven” Dividend Stocks for Turbulent Times RIO shares . Year-to-date, RIO has gained 3.84%, versus a -1.17% rise in the benchmark S&P 500 index during the same period."}]}