{"article": [{"url": "https://stocknews.com/news/unp-glw-tsco-3-recently-upgraded-stocks-for-august/", "published": 1596197300.0, "headline": "3 Recently UPGRADED Stocks for August", "body": "The stock market has been quite unpredictable recently. We are in the midst of a recession that has the potential to become a depression yet plenty of stocks are soaring to new heights. Some stocks are certainly worthy of the hype while others are overvalued at current trading prices. Our exclusive POWR Ratings system performs complex quantitative analyses of stocks daily to identify those that are worthy of being upgraded and downgraded. Let’s take a look at three of the POWR Ratings latest upgrades: Union Pacific (UNP), Corning Incorporated (GLW), and Tractor Supply (TSCO). Let’s take a look at these three stocks: 9 \"BUY THE DIP\" Growth Stocks For 2020Union Pacific (UNP – Rated “A” – Strong Buy) Though the railroad industry is past its prime, there is still money to be made in this industry. In particular, UNP is quite attractive. UNP operates one of the largest rail networks in the United States. UNP’s rail network stretches across the western portion of the United States along with Burlington’s Northern Santa Fe railroad. All in all, UNP provides rail service in nearly two dozen states, linking ports in the west and south with gateways connecting to the rest of the country. UNP’s rail network even adjoins with Canada’s railroad. Furthermore, UNP’s rail is the only one that serves the half-dozen major gateways into South America. All sorts of items are transported along with UNP’s rail network including food, coal, paper, steel, lumber, industrial products, agricultural products, and more. UNP’s POWR Ratings are nearly perfect, highlighted by A grades in all POWR Components but for its Peer Grade. UNP is ranked number one of 14 railroad stocks. Check out the analysts’ take on UNP and you will find a price target of $186.11, meaning the stock has about 7% upside. UNP’s relatively moderate forward P/E ratio of 23.04 indicates the stock is a fair value at its current price of $173. There is a good chance reshoring will occur in the years ahead, spiking industrial activity within the United States and helping the likes of UNP. Furthermore, UNP has the potential to obtain market share from the trucking industry. In other words, UNP is an underrated growth stock. Corning Incorporated (GLW – Rated “A” – Strong Buy) Glass production is quickly becoming a hot industry. Travel to central New York to see GLW’s glass-making facility for yourself and you will be impressed. GLW makes specialty glass as well as ceramics. GLW’s creations are used in smartphones, optical fiber, TVs, biosensors, and more. GLW also makes the much-hyped Glass Victus that is scratch-resistant and unlikely to break even when dropped from a considerable height. The POWR Ratings show GLW has A grades across the board but for its Industry Rank which is graded as a C. GLW is the top-ranked stock of nearly 40 publicly traded companies in the Industrial – Manufacturing sector. GLW has fantastic price returns of 18% across the past six months, 15% across the past three years, and nearly 90% across the past five years. Tractor Supply (TSCO – Rated “A” – Strong Buy) The rural lifestyle is finally back en vogue now that densely populated cities have been ravaged by COVID-19. TSCO stands to benefit from the return to America’s heartland as the urban exodus continues and the DIY movement hits its stride. TSCO operates retail farms as well as ranch stores throughout the United States. Ranchers, recreational farmers, and others in rural areas rely on TSCO for a litany of products and support. TSCO has A grades in each POWR Component but for its Industry Rank which has a B grade. TSCO is ranked third of more than 33 publicly traded companies in the Specialty Retailers segment. In terms of price returns, TSCO is in the green going back to 2016. TSCO has a three-year price return of 168%, a one-year price return of 34%, and a six-month price return of 56%. The top analysts have set a price target of just under $150 for TSCO, indicating it has around 4% upside remaining at a bare minimum. Want More Great Investing Ideas? 9 “BUY THE DIP” Growth Stocks for 2020 How HIGH Can This Tech Bubble Fly? 7 “Safe-Haven” Dividend Stocks for Turbulent Times UNP shares were trading at $171.64 per share on Friday morning, down $1.16 (-0.67%). Year-to-date, UNP has declined -3.97%, versus a 1.88% rise in the benchmark S&P 500 index during the same period."}]}