{"article": [{"url": "https://stocknews.com/news/cmg-intc-vrsn-3-buy-rated-stocks-reporting-earnings-this-week/", "published": 1595333300.0, "headline": "3 \"Buy Rated\" Stocks Reporting Earnings THIS WEEK", "body": "The S&P 500 had been in a trading range for most of June, in between 3,000 and 3,200. That changed last week when stocks rallied on positive coronavirus vaccine data. Where is the market headed from here? This question will be answered over the next month as publicly traded companies release their quarterly earnings report. 9 \"BUY THE DIP\" Growth Stocks For 2020Earnings season is underway with 74 companies reporting their results yesterday. This is an important time for investors to learn more about a company’s performance over the last quarter and its guidance for the next quarter and/or year. This year’s second quarter’s earnings are especially crucial in light of the coronavirus pandemic and ensuing recession. Here are three stocks that currently have a “Buy” rating, or better, in our exclusive POWR Ratings system that could see major moves after reporting earnings: Chipotle Mexican Grill (CMG) CMG is the largest company in the $16 billion domestic fast-casual Mexican restaurant industry. It has a menu that includes burritos, bowls, tacos, and salads, all of which are made from high-quality ingredients. The company operates over 2,600 restaurants in North America, the U.K., France, and Germany. CMG relies on a consumer awareness model to drive business, such as its loyalty program, Chipotle Rewards, which was launched in 2018 and has more than 11.5 million enrolled members. In 2016, the company suffered through a series of embarrassing news coverage due to foodborne illnesses that customers received from eating at the chain. CMG has recently bounced back and revived its brand image. In addition to appointing Brian Niccol to CEO, it has also relaunched its restaurant standards by focusing on food safety. The company has also spurred growth through its e-commerce initiatives. CMG is reporting earnings tomorrow, July 22nd. CMG is one of the top-rated stocks in our POWR Ratings system with a Strong Buy Rating. The stock also holds grades of A in Trade Grade, Buy & Hold Grade, and Peer Grade. Overall, it is the #1 ranked stock in the Restaurants industry. Intel (INTC) INTC is one of the world’s largest chipmakers. It designs and manufactures microprocessors for personal computers and data center markets. The company has recently shifted its focus from the PC market to data-rich business such as artificial intelligence and autonomous driving. Revenue from data-focused businesses already accounts for 48.3% of the company’s $71.97 billion in revenue last year. The company will release its quarterly earnings report after the market close on Thursday, July 23rd. The company’s switch to data business has been the right call as data centers, and the cloud has been a dominant theme over the past few months. INTC is also investing in the Internet of Things (IoT), which should see strong growth in the next few years. The company is also investing in non-volatile memory/ storage by targeting high margin data center customers. INTC still benefits from PC sales, which have increased as more people work from home. The company will report its latest earnings on Thursday. INTC has a Buy rating in our POWR Ratings system. It also holds an A for Industry Rank and a B for Trade Grade and Buy & Hold Grade. VeriSign (VRSN) VRSN is the sole authorized registry for several generic top-level domains, including the .com and .net domains. The company also operates two of the world’s 13 root servers used to route Internet traffic. VRSN has an agreement with the U.S. Department of Commerce to provide registrations for the .com domain. The company is benefiting from the growth in both the .com and .net domain registrations. Per terms of its agreement with the Department of Commerce, it can increase .com domain registrations by 7%. This price increase plus renewal registrations are the main growth driver for the company. As more domains are registered outside the U.S., the company should see continued growth. The company has strong cash flow, which allows it to provide value to shareholders through share buybacks. The company will release its quarterly earnings report on Thursday, July 23rd. VRSN is a solid Buy in our POWR Ratings system. It holds a B in three out of the four components that make up the POWR Ratings. It is also the #6 ranked stock in the Internet-Services industry. The company is expected to announce earnings on Thursday. Want More Great Investing Ideas? 9 “BUY THE DIP” Growth Stocks for 2020 Newly REVISED 2020 Stock Market Outlook 7 “Safe-Haven” Dividend Stocks for Turbulent Times CMG shares were trading at $1,154.00 per share on Tuesday afternoon, down $9.72 (-0.84%). Year-to-date, CMG has gained 37.86%, versus a 2.31% rise in the benchmark S&P 500 index during the same period."}]}