{"article": [{"url": "https://stocknews.com/news/hl-ag-fsm-svm-the-4-best-silver-miners-for-august/", "published": 1596715700.0, "headline": "The 4 BEST Silver Miners for August", "body": "Due to the rising uncertainty in the global economy and the recent devaluation of the dollar, many investors are shifting toward precious metals. While gold is up 36% year-to-date, silver is actually up 59% in 2020. Silver has several uses in the industrial and technology sectors, such as in batteries, LED, batteries, engines, solar panels, and 3D printing. Many analysts believe silver will continue to outshine gold, including Michael Hseuh at Deutsche Bank. In a recent interview on CNBC he said, “Silver … has a much higher industrial component to it. So, much higher component of silver supply demand in industrial consumption. And in an environment where we see the global economy recovering, that’s another reason to buy silver.” 7 Best ETFs for the NEXT Bull MarketTake a look at Hecla Mining Company (HL), First majestic Silver Corp. (AG), Fortuna Silver Mines (FSM), and Silvercorp Metals, Inc. (SVM). They are some of the best silver mining stocks that have tremendous growth potential. Hecla Mining Company (HL) HL discovers, acquires, develops, and produces precious and base metals. The company offers lead, zinc, and carbon materials to custom smelters, metal traders, and third-party processors. It also offers unrefined gold and silver bullion bars to precious metals traders. It has mining units across the United States, Canada and Mexico. HL recently expanded its business operations in Canada by acquiring a 10.7% stake in Dolly Varden Silver Corporation through its wholly-owned subsidiary. Though the pandemic forced the mining industry to cease operations during the lockdown, the demand for precious metals have been rising in the international markets amid global uncertainty. As a premier mining corporation, HL has benefited from this scenario, as its gross profits increased 230% in the first quarter alone. It restarted operations in all five of its mines after a mandatory 4-week lockdown, and produced over 2.7 million ounces of silver and 13,104 ounces of gold. The consensus revenue estimate of $149.29 million for the third quarter indicates a year-over-year rise of 11.3%. HL gained more than 350% to hit its 52-week high in August since its year-to-date low in March. How does HL stack up for POWR Ratings? A for Trade Grade A for Buy & Hold Grade A for Peer Grade A for Overall POWR Rating HL is also ranked #1 out of 16 in the Miners – Diversified industry. First majestic Silver Corp. (AG) AG partakes in production, acquisition, development and exploration of primarily silver mining properties. Headquartered in Canada, AG also owns several properties in Mexico. AG has entered into an agreement to acquire 50% of the total payable silver produced Springpole Gold project in exchange for $22.5 million in cash and shares and 33% of the silver spot price per ounce. AG produced 3.5 million ounces of silver equivalents, 1.8 million ounces of silver and 15,764 ounces of gold in the second quarter ended June 2020. It is currently holding 970,000 ounces of silver as inventory to book higher profits by selling them when the prices are higher in the third and fourth quarters. AG hit its 52-week low of $4.17 in March due to the virus-driven market crash. It gained more than 245% since then, hitting its 52-week high on August 5th. AG is rated “Strong Buy” in our POWR Ratings system, consistent with its business model and production capacity. It has an “A” in Trade Grade, Buy & Hold Grade and Industry Rank. In the 11-stock Miners – Silver industry, AG is ranked #4. Fortuna Silver Mines (FSM) FSM explores, extracts and processes precious and base metals in several north and south American countries. Its operations are spread across Mexico, Argentina and Peru. FSM recently raised $69 million through issuance of 23 million shares in May. This has allowed the company to retain its strong financial position to endure the losses incurred due to shutdown of operations for over 4 weeks. It successfully commissioned the primary and secondary crushing circuits for the heap leach pad at Lindero Gold Project in Argentina. With most minefields resuming operations since May, FSM reported a net production of 1.3 million ounces of silver and 7,099 ounces of gold in the second quarter. The stock gained 40% to hit its 52-week high on July 27th since hitting its 52-week low in mid-March. FSM is rated “Strong Buy” in our POWR Ratings system, with an “A” in Trade Grade, Buy & Hold Grade and Industry Rank and “B” in Peer Grade. It is ranked #7 out of 11 in the Miners – Silver industry. Silvercorp Metals, Inc. (SVM) Headquartered in Canada, SVM engages in the acquisition, exploration, development, and mining of mineral properties in China. The company primarily explores for silver, gold, lead, and zinc. In the first quarter of fiscal 2021, SVM produced approximately 1.8 million ounces of silver, 20.1 million pounds of lead and 7.5 million pounds of zinc. Its lead and zinc production increased 1% and 4% year over year, respectively. SVM aims to produce 6.2-6.5 million ounces of silver, 66.1-68.5 million pounds of lead and 24.5–26.7 million pounds of zinc in fiscal 2021. On July 20th, SVM intercepted a 1.9-meter interval grading 15 grams per ton gold while drilling a hole in a DCG mine in China. SVM gained more than 410% since hitting its 52-week low of $1.50 on March 16th. SVM has a “Strong Buy” rating in our POWR Ratings system. It has an “A” in Trade Grade, Buy & Hold Grade and Industry Rank. Out of 11 stocks in the Miners- Silver industry, SVM is ranked #6. Want More Great Investing Ideas? 9 “BUY THE DIP” Growth Stocks for 2020 How to Trade THIS Stock Bubble? 7 “Safe-Haven” Dividend Stocks for Turbulent Times HL shares were trading at $6.41 per share on Thursday afternoon, down $0.01 (-0.16%). Year-to-date, HL has gained 89.33%, versus a 4.86% rise in the benchmark S&P 500 index during the same period."}]}