{"article": [{"url": "https://stocknews.com/news/awk-msex-yorw-3-water-stocks-to-dip-your-feet-into/", "published": 1594642100.0, "headline": "3 Water Stocks to Dip Your Feet Into", "body": "Water is one of the most common and widely used resources on the planet. Without water, we can’t live. Increased droughts and floods in recent years have led to decreased access to fresh water. 90% of natural disasters are related to water. The supply of fresh water in the world is limited and demand will increase as the population grows. In the U.S., massive sums of money need to be invested to repair increasingly outdated and aging water systems. As water scarcity becomes more of a growing threat, water stocks can provide substantial upside potential. Adding water stocks to your portfolio can also add instant diversification. These companies pay dividends and produce high earnings growth. Here are three water companies to consider. American Water Works, Inc.(AWK) 7 \"SAFE HAVEN\" Dividend Stocks for Turbulent TimesAWK distributes water in around 47 American states, along with one Canadian province. The company beat consensus EPS estimates in three of the trailing four quarters. The market expects AWK to report second-quarter EPS of $0.95, which indicates a marginal increase from its EPS of $0.94 from one year-ago. The expected ESP growth suggests that the market doesn’t expect a significant impact of the pandemic on its business. West Virginia American, a subsidiary of the company, has also recently filed paperwork seeking approval for its infrastructure replacement plan. This will help reduce the long-term costs for customers and improve the reliability of the company. The company’s stock price has been rising steadily since a plunge in March when the market crashed due to the spread of the coronavirus. AWK has gained more than 30% since hitting the year-to-date low in March. The positive developments surrounding the company should keep momentum alive. How does AWK stack up for the POWR Ratings? A for Trade Grade A for Buy & Hold Grade C for Industry Rank A for Peer Grade A for overall POWR Rating. You can’t ask for better. The stock is also ranked #1 out of 13 stocks in the Water Industry. Middlesex Water Company (MSEX) MSEX provides water utility services in New Jersey, Pennsylvania, and Delaware. The volatility of MSEX’s price is greater than that of merely 1.09% US stocks with at least 200 days of trading history. The company has recently completed the construction of a water transmission main. The large underground water main transmits a water supply from the company’s largest treatment plant in Edison through Metuchen. It will help MSEX ensure overall resiliency for its water distribution system. This is undoubtedly a development that could boost investors’ optimism. MSEX gained significantly since the pandemic-driven market crash to hit an all-time high of $72.41 in mid-June, which is a surge of more than 40%. MSEX is rated “Buy” in our POWR Ratings system, consistent with its recent momentum. It also has a “B” for Trade Grade, Buy & Hold Grade and Peer Grade. Within the Water industry, it’s ranked #3 out of 13 stocks. The York Water Company (YORW) YORW purifies and delivers water with the help of its two treatment systems and three wastewater collection facilities. The company performed well in the first quarter of the year, with an operating revenue of approximately $13 million which was an increase of approximately $1 million from the same period last year. The consensus EPS estimate for the quarter ended June 2020 is in line with the ESP the company reported a year ago, indicating that analysts are not expecting any measurable impact of the pandemic on its bottom line. YORW has gained close to 15% since hitting the year-to-date low in mid-March. It’s no surprise that YORW is rated “Strong Buy” in our POWR Ratings system. It also has a “A” for Trade Grade, Buy & Hold Grade, and Peer Grade. In the 13-stock Water industry, it is ranked #2. Want More Great Investing Ideas? 9 “BUY THE DIP” Growth Stocks for 2020 Top 5 WINNING Stock Chart Patterns 7 “Safe-Haven” Dividend Stocks for Turbulent Times AWK shares were unchanged in after-hours trading Monday. Year-to-date, AWK has gained 9.15%, versus a -1.17% rise in the benchmark S&P 500 index during the same period."}]}