{"article": [{"url": "https://stocknews.com/news/jd-meli-se-jmia-pg-ul-4-international-e-commerce-stocks-you-need-to-know-about/", "published": 1596629300.0, "headline": "4 International E-Commerce Stocks You Need to Know About", "body": "The e-commerce market has experienced strong gains five months due to the spread of the coronavirus. With shelter-in-place orders being in effect all around the globe, consumers have preferred to shop online rather than visiting brick-and-mortar stores. In this type of economic environment, e-commerce stocks have outperformed the rest of the market by leaps and bounds. These stocks are seen as safer and potentially more profitable in an otherwise uncertain economic future. Bloomberg Intelligence has estimated that e-commerce sales in the U.S. alone could double by the year 2024. In addition, e-commerce companies are performing well internationally. 7 Best ETFs for the NEXT Bull MarketHere are 4 international e-commerce stocks that you should keep an eye on:JD.com, Inc. (JD), MercadoLibre, Inc. (MELI), Sea Limited (SE), and Jumia Technologies AG (JMIA). JD.com, Inc. (JD) JD is a Chinese company that operates a direct sales online portal for consumers. It primarily focuses on home appliances and electronics, along with books and general merchandise. JD recently acquired a sizable stake in supply chain management company Li & Fung. This move could further help the company bolster its logistics and make its supply chain more efficient. JD has also entered into an alliance with gaming smartphone makers to capitalize on the growing demand for such mobiles in China. The stock has been performing pretty well in the “new normal.” It has gained more than 90% since this year’s low of $32.70 on March 16th due to the virus-driven market crash. JD’s earnings surprise history is impressive, with the stock beating consensus EPS estimates in each of the trailing four quarters. How does JD stack up for the POWR Ratings? A for Trade Grade A for Buy & Hold Grade A for Peer Grade B for Industry Rank A for Overall POWR Rating You can’t ask for better. The stock is also ranked #3 out of 115 stocks in the China industry. MercadoLibre, Inc. (MELI) MELI operates e-commerce platforms in Latin American countries. It allows for both fixed-price and auction-based formats through its e-commerce portals. Recently, the company has made a $27.1 million investment in Jalisco, Mexico, in an effort to bolster its operations in the region. MELI has also been making headway into the fintech space in Chile. Its financial services arm Mercado Pago has recently applied for a special license to begin a variety of fintech operations in the country. MELI’s recent price performance reflects its ability to capitalize on the recent trend to go digital. The stock has gained more than 170% since hitting its 52-week low in mid-March. The company is forecasted to see revenue growth of 38.3% for the quarter ending June 2020. It’s no surprise that MELI is rated a “Strong Buy” in our POWR Ratings system. It also has an “A” for Trade Grade, Buy & Hold Grade, Peer Grade, and Industry Rank. In the 54-stock Internet industry, it is ranked #3. Sea Limited (SE) SE operates e-commerce portals and digital financial services in Southeast Asia. In the first quarter of 2020, the company’s e-commerce revenue saw a 74% year-over-year increase. In addition, SE’s gaming operations revenue also saw a rise of 31% year over year. Recently, SE became Singapore’s most valuable listed company beating the likes of DBS Group Holdings. The coronavirus-caused market slump has not seemed to affect this stock. SE has delivered year-to-date price returns of more than 240%. SE’s momentum might continue, given the strength in its business model. SE’s revenue is projected to grow 52.4% year over year for the quarter ending September 2020. SE’s strong fundamentals are reflected in its POWR Ratings, it has a “Strong Buy” rating with an “A” in Trade Grade, Buy & Hold Grade, and Industry Rank. Within the Internet industry, it’s ranked #4 out of 54 stocks. Jumia Technologies AG (JMIA) JMIA operates an e-commerce platform for the provision of logistics services internationally. This company is known as the “Amazon of Africa” and it has significant growth potential amid this pandemic. JMIA has recently started a cost-cutting initiative in an effort to boost profitability. The company has also unveiled arrangements with leading brands such as Nestle (OTC:NSRGY), Procter & Gamble (PG), and Unilever (UL) , which could help drive future growth for the company. JMIA has delivered price returns of 141% year to date, and the momentum is likely to continue. The company is slated to announce its second-quarter results later in August, which could tell us more about the future of this stock. JMIA has an impressive earnings surprise history with the company surpassing consensus EPS estimates in three of the trailing four quarters. It’s no surprise that JMIA is rated a “Buy” in our POWR Ratings system. It also has an “A” for Trade Grade and Industry Rank. Want More Great Investing Ideas? 9 “BUY THE DIP” Growth Stocks for 2020 How to Trade THIS Stock Bubble? 7 “Safe-Haven” Dividend Stocks for Turbulent Times JD shares were unchanged in after-hours trading Wednesday. Year-to-date, JD has gained 85.98%, versus a 4.25% rise in the benchmark S&P 500 index during the same period."}]}