{"article": [{"url": "https://stocknews.com/news/zm-goog-googl-acn-tsla-4-stocks-that-made-all-time-highs-last-week/", "published": 1598357300.0, "headline": "4 Stocks that Made All-Time Highs Last Week", "body": "The coronavirus has had significant economic effects. Many stocks and industries have been negatively affected like travel, leisure, and banks. Others are soaring to new highs as the changes in the economy and lower interest rates are boosting profits and valuation. Some of the strongest parts of the economy are technology, housing, and healthcare. It’s not a coincidence that these were the strongest areas going into the crisis due to strong growth and fundamentals. During many recessions, the strongest areas see the biggest losses, but it seems the coronavirus is actually accelerating these trends. Last week, Alphabet, Inc. (GOOG), Tesla (TSLA), Accenture (ACN), and Zoom (ZM) all reached fresh, all-time highs. Read below to find out what was driving the gains in these stocks. 7 Best ETFs for the NEXT Bull MarketAlphabet, Inc. (GOOG) This earnings season, GOOG reported the first-ever decline in revenues year-over-year due to a dip in its advertisement revenue which dropped by 9.8%. However, this hasn’t stopped the stock from reaching its all-time high of $1614.2 last week. GOOG stock is currently priced at $1588 which is a positive change of 4% from the pre-coronavirus highs that it hit in February this year. Investors’ confidence in GOOG remains high thanks to its several investments in emerging technology and growing cloud business. GOOG remains a hotbed of innovation due to its interests in autonomous vehicles, artificial intelligence, and biotechnology. Analysts estimate that GOOG will witness an EPS growth of 27.8% next year. Despite its current astronomical valuation, GOOG remains a growth stock to pick for future gains. How does GOOG stack up for the POWR Ratings? A for Trade Grade A for Buy & Hold Grade A for Peer Grade A for Industry Rank A for Overall POWR Rating You can’t ask for better. The stock is also ranked #2 out of 57 stocks in the Internet industry. Tesla (TSLA) TSLA hit an all-time high of $2095 on August 21st. The stock has witnessed a price surge of 381% so far this year. TSLA is slated to split its stock (five-for-one) at the end of the month to make it affordable for investors. Investors are also anticipating the announcement of new battery technology along with cost efficiencies on the upcoming Battery Day which will take place on September 22nd. The production of more cost-effective batteries could solidify TSLA’s position as a leader in the electric vehicle market and also open up new avenues for the company as a battery supplier. Growing demand for its Model 3 from China has also put the company back on track to meet its goal of 500,000 deliveries this year. For the quarter ended June 30th, TSLA beat earnings estimates by 7,166.7% by delivering an EPS of 2.18. It’s no surprise that TSLA is rated “Strong Buy” in our POWR Ratings system. It also has an “A” for Trade Grade, Buy & Hold Grade, and Peer Grade. In the 28-stock Auto and Vehicle Manufacturers industry, it is ranked #1. Accenture (ACN) ACN is a global leader in management consulting and business process outsourcing. The company operates in the health and public services, financial services, communications, and other segments. ACN hit its all-time high of $239.4 on August 24th which is an increase of 10.1% from the pre-coronavirus highs which the company reached in February 2020. The company is looking to strengthen its cloud computing services with the acquisition of Organize Cloud Labs. The new acquisition will further help ACN provide digital transformation services to large enterprises. The company has also announced the acquisition of Creative Drive which is a technology-driven content production company. This move will help ACN scale its digital marketing and content services. ACN has beaten consensus EPS estimates in all of the trailing four quarters. The EPS of the company is expected to grow by 6% next year. ACN’s strong fundamentals are reflected in its POWR Ratings, it has a “Strong Buy” rating with an “A” in Trade Grade, Buy & Hold Grade, and Peer Grade. Within the Outsourcing – Tech Services industry, it’s ranked #1 out of 14 stocks. Zoom (ZM) Zoom is a video calling platform that has significantly benefited from the rise of remote working and remote learning environments. ZM’s stock prices have been steadily rising throughout the year and it is one of the rare stocks that was not affected by the overall crash in the stock market caused by the coronavirus. ZM’s stock has risen by 314% year-to-date and hit its all-time high of $293.8 on August 24th. Investors are in anticipation of ZM’s quarterly report which is slated to be released on August 31st. Analysts estimate that ZM would declare an EPS of $0.45 which is significantly higher than the year-ago EPS of 0.08. In the trailing four quarters, ZM has also beaten EPS estimates by large margins. The company also announced that its Zoom Phone cloud services are now available in 25 more countries which is a move that could position the company as a global leader. It’s no surprise that ZM is rated “Strong Buy” in our POWR Ratings system. It also has an “A” for Trade Grade, Buy & Hold Grade, and Peer Grade. In the 51-stock Technology – Services industry, it is ranked #1. Want More Great Investing Ideas? The Best of StockNews 2 Step Process to Sell @ Market Top in September 9 “BUY THE DIP” Growth Stocks for 2020 ZM shares rose $2.06 (+0.71%) in after-hours trading Tuesday. Year-to-date, ZM has gained 326.87%, versus a 8.02% rise in the benchmark S&P 500 index during the same period."}]}