{"article": [{"url": "https://stocknews.com/news/aaxn-vsto-swbi-spwh-4-gun-stocks-that-will-keep-climbing-into-2021/", "published": 1599826100.0, "headline": "4 Gun Stocks That Will Keep Climbing into 2021", "body": "Gun sales in the US have exploded over the past few months due to social unrest and the uncertainty caused by the spread of the coronavirus. The presidential election is also not too far off, and historically, gun sales typically see an increase during such times. Moreover, the popularity of hunting as a leisure activity has significantly increased over the past few months, as this form of recreation allows the maintaining social distancing. As reflected by an FBI National Instant Criminal Background System (NICS) check, nearly 15 million units were sold as of September 1, 2020, which exceeded the number for the entire year of 2019. According to Small Arms Analytics & Forecasting chief economist Jurgen Brauer, “With the hunting season about to begin in earnest and the presidential election season about to start in earnest as well, 2020 will without doubt exceed the previous high of 16.6 million units sold in 2016.” The demand for guns may continue well into 2021 as the spread of the coronavirus shows no signs of easing. If Joe Biden wins the presidential election, the demand for guns may increase further. Gun companies have been grappling to meet the growth in demand and have ramped up operations. 9 \"BUY THE DIP\" Growth Stocks For 2020Stocks of companies such as Axon Enterprises, Inc. (AAXN), Vista Outdoor, Inc. (VSTO), Smith & Wesson Brands, Inc. (SWBI), and Sportsman’s Warehouse Holdings, Inc. (SPWH) are gaining from this trend and should continue to perform well. Axon Enterprises, Inc. (AAXN) AAXN develops, designs, and markets conducted electrical weapons (CEWs) to customers worldwide. The company operates through TASER weapons and AXON segments. The company has recently announced that UK police forces will now be using AAXN’s TASER Conducted Energy Device (CED) for their law enforcement operations. The Taser 7 is AAXN’s most effective less-lethal weapon so far. The company also recently launched Axon Respond, which is a real-time awareness and communications platform that runs through the cloud. AAXN’s stock has returned 15% year-to-date. This price gain may be attributed to the increased need of its products due to protests against lockdowns in the US. AAXN is expected to witness a rise in revenue of 15.2% in the current year, and 16.3% next year. The company’s EPS is estimated to grow 18.8% per annum over the next five years. AAXN has been accorded a grade of “B” in Peer Grade in our POWR Ratings system. The stock is also ranked #20 out of 65 stocks in the Air/Defense Services industry. Vista Outdoor, Inc. (VSTO) VSTO designs, develops, and sells products for outdoor sports and recreation. The company is a market leader in producing firearm ammunition, which is a lucrative market experiencing high demand. The company primarily operates in shooting sports along with other outdoor activities. Blackhawk, one of several brands owned by VSTO, recently announced the launch of Level 2 Compact (L2C) models to expand its popular line of T-series holsters. The company’s Bushnell brand has recently started shipping Powerview 2, which is a versatile binocular for general use. In the quarter that ended in June 2020, the company realized gross profits of $125 million which was a 32% increase year-over-year. The company’s operating expenses were reduced 23% during the same time period. VSTO’s stock has gained 143.4% year-to-date. The company is expected to see a rise in revenue of 7.9% this year. The company’s EPS is estimated to grow by 695.8% this year and at a rate of 25% per annum over the next five years. In our POWR Ratings system, the company has been accorded a grade of “B” for Industry Rank. Within the Athletics & Recreation industry, it’s ranked #22 out of 33 stocks. Smith & Wesson Brands, Inc. (SWBI) SWBI is a company that focuses on the design, development, and marketing of firearms and related accessories. The company’s offerings include handguns, handcuffs, suppressors, and more. The company has witnessed a surge in demand over the last few months due to an overall increase in the demand for firearms. In the first fiscal quarter of the year, SWBI saw net sales of $278 million, as compared to $123.7 million from the same quarter last year. SWBI has restructured its operations, and has formed American Outdoor Brands as a separate company. This means that SWBI is now a purely fire-arms based company. The company has been launching a host of new products such as the Performance Center M&P 9 Shield EZ and M&P M2.0 Pistols. The company’s stock has delivered price returns of 140% so far this year. SWBI is expected to see a growth in revenue of 19.1% in the current year. The company’s EPS is estimated to grow 156.1% this year and at a rate of 15% per annum over the next five years. Under POWR Ratings, the company has been accorded a grade of “B” for Industry Rank. Within the Athletics & Recreation industry, it’s ranked #24 out of 33 stocks. Sportsman’s Warehouse Holdings, Inc. (SPWH) SPWH is an outdoor sporting goods retailer in the US. The company’s offerings include camping essentials, sleeping bags, outdoor tools, tents, and other camping equipment. The company also sell shooting equipment. The company delivered an impressive performance in the quarter that ended on August 1st. The company’s same store sales were up 61% from the same period last year. The company has been focusing on upgrading its e-commerce capabilities. Revenue through e-commerce has increased by 300%, compared to the same period last year. The company has also entered into an agreement to sponsor the popular archery hunting show “Respect the Game” for a period of one year, starting from December 28th, 2020. SPWH’s stock has risen 70.1% so far this year. The company’s revenue is expected to rise 34.5% for the quarter ending October 2020 and 41.3% in the current year. The company’s EPS is estimated to grow 219.1% in the current year and 20.7% per annum over the next five years. In our POWR Ratings system, the company has been accorded a grade of “B” for Industry Rank. Within the Athletics & Recreation industry, it’s ranked #25 out of 33 stocks. Want More Great Investing Ideas? 7 Best ETFs for the NEXT Bull Market Will Stocks Fall into Historical September Slump? 9 “BUY THE DIP” Growth Stocks for 2020 AAXN shares were trading at $83.89 per share on Friday afternoon, down $0.40 (-0.47%). Year-to-date, AAXN has gained 14.48%, versus a 4.82% rise in the benchmark S&P 500 index during the same period."}]}