{"article": [{"url": "https://stocknews.com/news/snow-ncno-vitl-3-recent-tech-ipos-that-can-beat-the-sp-500/", "published": 1602072500.0, "headline": "3 Recent Tech IPOs That Can Beat the S&P 500", "body": "Initial public offerings (IPOs) continue to attract investors. Investing in an IPO provides you with an opportunity to bet on a high-growth company that has massive potential to create long-term wealth. For example, Facebook (FB) went public back in 2012 at $38 a share and has returned 580% since then. Comparatively, Zoom Video (ZM) and Shopify (SHOP) have returned 1,230% and 6,000% respectively since they went public. However recently listed companies are also extremely volatile and carry significant risks. While blue-chip companies are established players that generate a steady stream of income, IPOs are companies that are betting on expanding the top-line at a rapid pace. Here we take a look at three recent IPOs that have the potential to outpace the S&P 500 in the upcoming decade. 9 \"BUY THE DIP\" Growth Stocks For 2020A Warren Buffett bet Warren Buffett generally does not invest in IPOs, as he is a fan of companies that have a large economic moat with significant competitive advantages. However, Berkshire Hathaway invested $730 million in Snowflake (SNOW) and surprised Wall Street. Snowflake went public last month on September 16th and has already doubled in value to currently trade at $250 per share. SNOW’s cloud data platform allows customers to consolidate data and drive meaningful insights as well as build data-driven applications. The company claims it solves the decade-old problem of data silos and data governance as enterprises can now unify and query data to support several use cases. SNOW’s cloud-native architecture has three scalable layers across compute, storage, and cloud services that are integrated with the company’s single cloud data platform. As of July 2020, SNOW had 3,117 customers, up from 1,547 customers in July 2019. This includes seven of the Fortune 10 companies and 146 of the Fortune 500 companies. The number of customers that have spent over $1 million on SNOW’s product platform has surged from 22 to 56 in the last year. This has helped the company increase sales from $96.7 million in fiscal 2019 to $264.7 million in fiscal 2020, a growth of 174% year-over-year. In the last two-quarters revenue has risen from $104 million to $242 million, up 133% year-over-year. Similar to several other tech companies, Snowflake is still unprofitable. Its net loss expanded from $178 million in 2019 to $348.5 million in 2020. In the first six months of fiscal 2021, net loss stood at $171.3 million, compared with a net loss of $177.2 million in the prior-year period. Snowflake’s astounding growth rates have driven its valuation sky-high. Investors expect the company to narrow its net loss over the years and are betting on Snowflake’s stellar top-line growth to drive the stock higher. SNOW is trading at a trailing price to sales multiple of 260x making it one of the most expensive companies on Wall Street. In case it experiences a significant decline in top-line growth coupled with expanding losses, Snowflake could lose its luster resulting in a massive sell-off. However, Snowflake’s focus on customer acquisition and dazzling revenue growth as well as an expanding addressable market make it a top stock for the upcoming decade. A fin-tech company nCino (NCNO) provides cloud-based software for financial institutions. Its platform digitizes, automates, and streamlines inefficient and complex processes and workflow. The company leverages data analytics and machine learning technologies to enable financial institutions onboard clients, manage the loan life cycle, open deposits, and other accounts. Its SaaS platform aims to replace legacy technology solutions over time. nCino went public in July 2020 at an IPO price of $31 per share. The stock is currently trading at $71 and is valued at a market cap of $6.5 billion, at the time of writing. nCino has onboarded over 1,110 financial institutions as customers that include Toronto-Dominion Bank (TD) and Bank of America (BAC). In fiscal 2020 (ended in January), nCino posted sales of $138 million, up 57% year-over-year. Comparatively, its subscription sales were up 60% in fiscal 2020. In the April quarter, its revenue growth stood at 50% while subscription sales were up 65%. Similar to Snowflake and other SaaS companies, nCino is also posting an adjusted loss and is focused on revenue growth. In its first-quarter as a public company, nCino sales rose 52% to $48.8 million in fiscal Q2 of 2021, while subscription sales were up 70% at $39.4 million. The company’s adjusted loss per share stood at $0.01 compared with a loss of $0.08 per share in the prior-year quarter. We can see nCino is nearing profitability which is a good sign given its robust growth rates. An ethical food company The third company on the list is Vital Farms (VITL), an ethical foods company that went public at an IPO price of $22. Vital Farms stock is currently trading at $38 indicating a market cap of $1.5 billion. The company is one of the top brands in the U.S. when it comes to pasture-raised eggs and pasture-raised butter. It is the second-largest egg brand by retail dollar sales. Vital Farms aims to “bring ethically produced food to the table by working with small family farms who share our commitment to the humane treatment of animals and sustainable agricultural practices.” Its products are sold in conventional and natural grocery stores as well as in foodservice outlets all around the country. In the second quarter, VITL reported sales of $59.3 million, up 84% year-over-year. Its gross profit stood at $22.7 million, indicating a gross margin of 38.3%, up 400 basis points compared with the prior-year quarter. VITL managed to increase EBITDA by 111% to $9.3 million while its net income also more than doubled to $5.9 million in Q2. Vital Farms is profitable and growing at an enviable pace. Its products are sold at 13,000 retail stores, up from just 4,000 in 2016, making it one of the fastest-growing companies in the food space. Want More Great Investing Ideas? Do NOT Buy Stocks Before the Election! 7 “Safe-Haven” Dividend Stocks for Turbulent Times Chart of the Day- See Christian Tharp’s Stocks Ready to Breakout SNOW shares were trading at $248.97 per share on Wednesday morning, up $3.87 (+1.58%). Year-to-date, SNOW has declined -1.95%, versus a 6.92% rise in the benchmark S&P 500 index during the same period."}]}