{"article": [{"url": "https://stocknews.com/news/spy-qqq-aapl-crm-tsla-2-reasons-to-worry-about-a-stock-market-reversal/", "published": 1598616500.0, "headline": "2 Reasons to Worry About a Stock Market Reversal", "body": "Stocks continued their incredible run this week, and the SPDR S&P 500 ETF Trust (SPY) is now up more than 50% from its March low. Meanwhile the tech heavy Nasdaq (QQQ) has ripped 79% from the March low and is up an eye-popping 21% year-to-date. On the way to the current gains the markets have set all sorts of records, such as: the fastest bear, back to bull market, the strongest 100 trading days since 1933, and the best two week period in the past 9 years. To put it bluntly, the bears are getting steamrolled. You hardly ever want to try to call a top, especially when there are large macro forces at work such as unprecedented liquidity and stimulus from both the Federal Reserve and Congress, combined with an unprecedented acceleration in the transformation of the structure of the economy. This is benefitting a cohort of large companies, which have an outsized influence on the major indices. 7 \"SAFE HAVEN\" Dividend Stocks for Turbulent TimesThat said, two flags (if not red then at least yellow) have been hoisted over the past week: Price no longer matters There is an old saying, “if you have to ask the price, you can’t afford it.” The two fold gist of that old saying is that you need to be incredibly wealthy to even walk into the ‘store’ and you’re complicit in acknowledging the item is ‘overpriced’ and your purchase decision is based on status, emotion or some other non-economic factor. But right now it looks like investors have money to burn as they are willing to buy stocks at nearly any price. This has led to individual names racking up 20%, 30% or even 50% gains in a matter of weeks, even as nothing has fundamentally changed with their business prospects or profitability. The standout examples are the price runs in Apple (AAPL) and Tesla (TSLA) which have gained 35% and 52% in just the two weeks since each announced stock splits. We all know a stock split does absolutely zero in terms of adding value to a company but people wanted these stocks no matter what price. Some other recent examples of inexplicable price moves include Facebook (FB) jumping 9% on the day it revealed how AAPL’s iOS update could slash FB’s app-based ad revenue by over 40%. That doesn’t sound like such good news to me. And just two days ago shares of Salesforce (CRM), which had already jumped 7% on news it would be added to the Dow Jones index, soared a jaw dropping 25% after posting a solid earnings report. I hate to use the word unprecedented again, but this increase in market cap (CRM’s market cap is now about $250 billion and AAPL’s is 2.2 trillion!) is truly something that has never before occurred. I don’t want to call this a bubble, as these companies are some of the most profitable and globally entrenched brands and it’s highly unlikely they are going ‘bust,’ like bubbles do. But price is certainly becoming disconnected from value. I feel like we are getting close to the breaking point, where prices will once again matter and investors will ask where something is actually trading, rather than just saying “Buy!” In my Options360 trading service I take a 3-P (process, price, profit) approach in which price takes precedence over any story, trend or rumor. If the price of either the underlying share stock or the option strategy doesn’t fit my risk/reward requirements I don’t make the trade. To learn more about my 3P approach you can watch this presentation Volatility is Issuing a Warning The CBOE Volatility Index, or VIX, has always been a reliable gauge of investor concern and right now it is extremely high on a relative basis and suggests traders are bracing for a major correction. Let me explain, while the absolute reading of the VIX is currently 22, which is well below the March peak of 95 and just a tad above the 25 year mean of 19, it is more than double the 10-day realized or historical volatility which sits at seven. Meaning, as the market has moved higher in an orderly fashion and actual volatility has dropped to 10-year lows the VIX is carrying one of the largest premiums ever. And the VIX futures are even higher for the October and November months, due to the upcoming elections; are trading near the 30% level. The image below shows 10-day realized (yellow line) vs. VIX (green line) vs. the futures curve (blue line). The spread between real and implied volatility is, how shall i say, unprecedented. Even AAPL has seen the implied volatility of it’s options hit 4 month highs even as the stock hits all-time highs. Not a typical occurrence. At some point price will not reconnect with value and VIX will need to converge with the realized volatility. My concern is this will through a precipitous drop in price which will lead to a very real increase in volatility. If you want more of my insights and learn how I’m trading this market, claim your one-month trial offer to my Options360 Service by CLICKING HERE. Want More Great Investing Ideas? 7 Best ETFs for the NEXT Bull Market Why Stocks Could Drop 20% in September? 9 “BUY THE DIP” Growth Stocks for 2020 SPY shares were trading at $349.40 per share on Friday afternoon, up $1.07 (+0.31%). Year-to-date, SPY has gained 9.68%, versus a % rise in the benchmark S&P 500 index during the same period."}]}