{"article": [{"url": "https://stocknews.com/news/tsm-intc-avgo-mrvl-asml-which-semiconductor-stock-is-the-best-buy/", "published": 1599826100.0, "headline": "Which Semiconductor Stock is the Best Buy?", "body": "Taiwan Semiconductor Manufacturing Company Ltd. (TSM) is one of the biggest semiconductors and integrated circuit manufacturers in the world. TSM’s products are widely used in electronics, such as personal computers, wired/ wireless communication systems, digital TVs, cameras and gaming consoles, etc. It’s 5-nanometer technology chips and metal oxide semiconductors are considered best in class, especially with Intel’s (INTC) failure to keep up with TSM. This $385-billion company has the potential to grow even further, and expand its operations in the US markets. The possibility of expansion has increased with the trade war between the United States and China, and the strengthening of ties between the US and Taiwan. The recent surge in demand for electronic applications, particularly personal computers has contributed to the stock’s 35.8% year-to-date gain. Due to the increase in remote work and learn-from-home, demand for semiconductors will continue rising. 9 \"BUY THE DIP\" Growth Stocks For 2020The upcoming 5G upgrade cycle will also play an important role in driving the semiconductor industry’s growth. With the current conflict with Huawei Technologies, TSM will play a larger role in 5G integration in the United States. TSM’s impressive year-to-date performance, potential upside, and favorable market expectations have helped the stock to earn a “Strong Buy” rating under our proprietary rating system. Here’s how our proprietary POWR Ratings system currently evaluates TSM: Trade Grade: A TSM is currently trading above its 50-day and 200-day moving averages of $75.17 and $59.39, respectively. This indicates an uptrend in the stock, with a golden cross bullish breakout pattern. Moreover, the stock returned 37.1% in the past three months, which indicates a short-term bullishness. The short-term bullishness can be attributed to its recent moves to capitalize on the rapid digital transformation and impressive second-quarter results. TSM’s revenue grew 28.9% year-over-year to $10.38 billion for the quarter ended June 2020, while net income increased 81% from the year-ago value to $4.04 billion. TSM recently extended its collaboration with Marvell to deliver a comprehensive silicon portfolio for the data infrastructure market leveraging the industry’s most advanced 5-nanometer process technology. It also partnered with NXP Semiconductors to develop the next generation computing system for automobiles using 5-nanometer technology. Buy & Hold Grade: A In terms of proximity to its 52-week high, which is a key factor that our Buy & Hold Grade takes into account, TSM is well-positioned. It is currently trading just 4.8% below its 52-week high of $84.00, which it hit on August 5th. TSM gained 110.4% in the past three years. This performance was backed by its solid revenue and earnings growth. Net revenue grew at a CAGR of 8.2% and EBITDA rose at a CAGR of 6.8% over the past three years. Diluted EPS also increased at a CAGR of 9.3%. One of the main reasons behind TSM’s growth in the past couple of years is the U.S.-China trade war. The conflicts with China put Taiwan on the radar of many tech companies for their chip requirements, causing TSM to enjoy a higher flow of orders, and thereby revenues. Also, the ongoing 5G race since 2018 has increased the demand for semiconductors worldwide for replacing the older versions. Peer Grade: A TSM is currently ranked #1 out of 86 stocks in the Semiconductor & Wireless Chip industry. Other stocks in this industry include Broadcom, Inc. (AVGO), Marvell Technology Group Ltd. (MRVL), and ASML Holding N.V. (ASML). While MRVL beat TSM’s 35.8% year-to-date gains by 910 basis points, AVGO and ASML returned 12.9% and 20.6%, respectively. Industry Rank: B The Semiconductor & Wireless Chip industry is ranked #10 out of 123 industries in the StockNews.com universe. The industry’s strength can be attributed to the rising sales for personal electronics and ongoing digital transformation. Overall POWR Rating: A (Strong Buy) TSM’s overall rating of “Strong Buy” reflects its impressive short-and-long-term bullishness, favorable analyst sentiment, and solid growth attributes, as determined by the four components of POWR Rating. Bottom Line TSM is set to soar even higher in the upcoming months. It has an average broker rating of 1.25 which indicates favorable analyst sentiment. Also, out of 31 Wall Street Analysts that rated the stock, 22 rated it “Strong Buy.” The consensus EPS estimate of $0.77 for the third quarter ending September 2020 indicates a 24.1% growth year-over-year. TSM has an impressive surprise earnings history as well, as it beat the street EPS estimates in three out of trailing four quarters. The consensus revenue estimate of $11.60 billion indicates a 23.5% increase from the same period last year. Want More Great Investing Ideas? 7 Best ETFs for the NEXT Bull Market Will Stocks Fall into Historical September Slump? 9 “BUY THE DIP” Growth Stocks for 2020 TSM shares were trading at $78.82 per share on Friday afternoon, down $0.08 (-0.10%). Year-to-date, TSM has gained 37.48%, versus a 4.87% rise in the benchmark S&P 500 index during the same period."}]}