{"article": [{"url": "https://stocknews.com/news/bce-trtn-bgs-wdr-4-top-dividend-stocks-for-the-rest-of-2020/", "published": 1599566900.0, "headline": "4 TOP Dividend Stocks for the Rest of 2020", "body": "The market took a pause last week after continuously rallying since March. While analysts are yet to come to an agreement on whether this is an early sign of a market correction, the market is expected to remain highly volatile due to the upcoming election. So, investing with the expectation of stable capital appreciation in the near term could be risky. That along with the record-low interest rate environment is a strong reason why this could be an appropriate time for dividend investing. Global dividends are anticipated to have fallen 17% in the second quarter, the worst drop since 2009. More than 750 companies, including over 60 members of the S&P 500, have slashed or suspended their payouts due to the pandemic. So, it’s prudent to add stocks that are not only still able to pay stable dividends, but are expected to sustain them due to their fundamental strength. BCE Inc. (BCE), Triton International Limited (TRTN), B&G Foods, Inc. (BGS) and Waddell & Reed Financial, Inc. (WDR) have a reliable history of dividend payments and are well positioned to weather the ongoing crisis and maintain their dividends over the long-run. 7 Best ETFs for the NEXT Bull MarketBCE Inc. (BCE) BCE is a telecommunications and media company that provides wireless, wireline, Internet, and television services to residential, business, and wholesale customers in Canada. It operates in three segments – Bell Wireless, Bell Wireline, and Bell Media. BCE has been consistently paying a dividend at the end of each quarter since 1985. Over the last 10 years, the average growth for dividends was 9.7% per year. The most recent dividend declared by the company was $0.611 for the second quarter, cumulating to an annual dividend of $2.45. The company has a four-year average dividend yield of 9.52%. The company delivered a free cash flow of $1.61 billion in the last reported quarter, increasing 49.7% year-over-year. It generated $2.56 billion as cash flow from operations, growing 22.4% compared to the year-ago quarter. The top-line came in at $5.35 billion as the company added 50,121 new customers in wireless, retail internet, and IPTV during the quarter, despite significantly reduced commercial activity. It also surpassed 10 million wireless subscribers over the same period. EPS for the quarter came in $0.63, beating the consensus estimate by 1.7%. BCE has recently announced a partnership with Samsung to offer its full lineup of 5G smartphones in Canada. It launched Canada’s largest 5G wireless network in June this year after partnering with Western University to accelerate 5G innovation. Hence, the street estimates EPS to grow 5.9% next year. The stock closed Friday’s trading session at $42.77, which is 13.7% lower than its 52-week high of $49.58. BCE has recovered more than 19% from its March low. How does BCE stack up for the POWR Ratings? A for Trade Grade B for Buy & Hold Grade A for Peer Grade B for Overall POWR Rating. It is ranked #4 out of 35 stocks in the Telecom – Foreign industry. Triton International Limited (TRTN) TRTN engages in the acquisition, leasing, re-leasing, and sale of various types of intermodal containers and chassis to shipping lines, freight forwarding companies and manufacturers. It operates in two segments – Equipment Leasing and Equipment Trading. TRTN pays an annual dividend of $2.08, which translates into a dividend yield of 5.71%. The company has been uniformly paying a dividend of $0.52 every quarter since 2018. It was paying a fixed amount of $0.45 dividend prior to this period. The most recent dividend declared by the company was for the second quarter ended June, implying a payout ratio of 51.7%. The four-year average dividend yield of the company is 5.01%. TRTN’s second-quarter results did not fail to impress the street. Free cash flow for the quarter came in $114 million while cash generated from operations grew 6.3% year-over-year to $219 million. The company returned $35.85 million back to its shareholders during the quarter in the form of dividend. It reported a top-line figure of $321 million as the equipment fleet utilization averaged to 95% for the quarter. TRTN also repurchased 2.1 million common shares during the quarter. EPS for the quarter came in at $0.86, beating the consensus estimates by 10.3%. The resiliency of the utilization reflects a high-quality long-term lease portfolio. The company’s used container sale prices and volumes have also held up well and should continue to generate sizable disposal gains. In line with the large decrease in bunker fuel prices, EPS is expected to grow 19% next year. The stock closed Friday at $36.43, 10.7% below its all-time high of $40.81. It has gained nearly 63% from its March low and returned more than 11% in the last three months. TRTN’s POWR Ratings reflect a promising outlook. It has an overall rating of Buy with a grade of A for Trade Grade and Peer Grade, and a B for Buy & Hold Grade. Among the 46 stocks in the Shipping industry, it’s ranked #3. B&G Foods, Inc. (BGS) BGS manufactures, sells, and distributes a portfolio of shelf-stable and frozen foods, and household products in the United States, Canada, and Puerto Rico. It operates more than 50 brands and distributes its products directly and through supermarket chains. The company has been consistently paying a fixed $0.475 dividend every quarter since 2018. It was paying a fixed amount of $0.465 dividend prior to this period. Over the last 10 years, the average dividend per share growth for BGS was 10.8% per year. The most recent dividend declared by the company was for the second quarter that ended in June. BGS pays an annual dividend of $2.04. The four-year average dividend yield for the company is 7.37%. Free cash flow for the last reported quarter came in at $185 million, compared to the year-ago negative cash flow of $43 million. The company generated $189 million as cash flow from operations. It returned $30.5 million back to its shareholders during the quarter in the form of dividend. Quarterly revenues grew 38% year-over-year to $512.5 million, primarily due to increased demand for frozen food during the pandemic. The company’s sales also benefited from the “Clabber Girl” and “Farmwise” acquisitions completed earlier this year. The EPS for the quarter came in at $0.71, increasing 150% year-over-year and beating the consensus estimate by 16.4%. The company is working closely with its supply chain partners to turn this pandemic-related increase in demand into a long-term growth opportunity. The market expects the EPS to grow 33.5% in the current year. BGS closed Friday’s trading session at $30.00, gaining more than 69% year-to-date. The stock has recently hit an all-time high of $31.93 and is up more than 82% in the last six months. It’s no surprise that BGS is rated a Strong Buy in our POWR Ratings system. It also has a grade of A in Trade Grade, Buy & Hold Grade, Peer Grade, and Industry Rank. It is ranked #15 out of 57 stocks in the Food Makers industry. Waddell & Reed Financial, Inc. (WDR) WDR provides investment management and advisory, investment product underwriting and distribution, shareholder services administration to mutual funds, institutional and separately managed accounts in the United States. WDR pays an annual dividend of $1 which translates into a dividend yield of 6.34%. The company has been unvaryingly paying a dividend of $0.25 per share at the beginning of every quarter since 2018. It was paying a fixed amount of $0.46 per share as dividend prior to this period. The last dividend paid by the company was $0.25 in July 2020. The company has grown its dividend at a CAGR of 3.1% over the last ten years. The four-year average dividend yield for the company is 8.16%. The last financial result reported by WDR was for the second quarter. The company produced a negative free cash flow of $3.61 million for the quarter. It also generated a negative $0.53 million cash flow from operations. However, WDR has returned $16.53 million back to its shareholders this quarter in the form of dividend. The company delivered $240 million as revenue with the underwriting and distribution fees forming 51.5% of the total revenues. WDR reported preliminary assets under management of $67.8 billion for the month ending July 31, 2020, compared to $65 billion in the quarter that ended in June. EPS for the quarter came in $0.38, beating the consensus estimate by 18.8%. Moreover, WDR beat consensus EPS estimates in each of the trailing four quarters, which is impressive. The company has recently launched the second phase of its wealth management technology transformation, ONESource, which seamlessly connects data across platforms for advisors, and ONEService, a digital repository of processes, procedures and other information available to all advisors. The stock closed Friday’s trade at $15.78, gaining nearly 17% over the last six months. Furthermore, it is trading at a 13.9% discount to its all-time high of $18.33. WDR’s strong momentum is reflected in its POWR Ratings. It has a Buy rating with a grade of A in Trade Grade and Peer Grade and a B in Buy & Hold Grade and Industry Rank. Within the Asset Management industry, it’s ranked #13 out of 45 stocks. Want More Great Investing Ideas? 7 Best ETFs for the NEXT Bull Market Will Stocks Fall into Historical September Slump? 9 “BUY THE DIP” Growth Stocks for 2020 BCE shares were trading at $42.36 per share on Tuesday morning, down $0.41 (-0.96%). Year-to-date, BCE has declined -4.09%, versus a 5.51% rise in the benchmark S&P 500 index during the same period."}]}