{"article": [{"url": "https://stocknews.com/news/pm-mo-2-tobacco-dividend-stocks-yielding-over-6/", "published": 1597406900.0, "headline": "2 Tobacco Dividend Stocks Yielding Over 6%", "body": "The tobacco industry usually faces an inelastic demand due to the addictive nature of the products. However, over the years, the number of smokers seems to be declining with new generations becoming more health conscious. Consequently, the industry has been evolving by selling new-age products — such as IQOS, e-vapor, smokeless tobacco and nicotine pouches — which are alternatives to cigarettes and have less health risks. And these new-age products that tobacco companies are adding to their portfolio, have been gaining popularity among customers, helping the companies stay afloat. Moreover, some of the tobacco stocks pay generous dividends which help them draw significant attention from income investors. Philip Morris International Inc. (PM) and Altria Group, Inc. (MO) are two such stocks that are hard to ignore when looking at their dividend yields. 7 \"SAFE HAVEN\" Dividend Stocks for Turbulent TimesPhilip Morris International Inc. (PM) The FDA authorized the marketing of IQOS, which is PM’s electrically heated tobacco system, as a Modified Risk Tobacco Product in July. This makes IQOS the first and only electronic nicotine product to be granted marketing orders through the FDA’s MRTP process. This has been a key driver of the stock’s performance. PM has gained about 39.5% since it hit its 52-week low of $56.01 in March. PM has increased its annual dividend every year since becoming a public company in 2008, representing a total increase of 154.3%. During the second quarter, PM declared a dividend of $1.17 per share. The company pays an annual dividend of $4.68 which yields 6%. PM has issued more total dividends over the past six years than 97.7% of other dividend-paying US stocks in the StockNews.com universe. PM has an impressive earnings surprise history with the company beating consensus EPS estimates in each of the trailing four quarters. PM’s POWR Ratings reflect this promising outlook. It has an overall rating of Buy with a grade of A for Trade Grade and Peer Grade, and a grade of B for Buy & Hold Grade and Industry Rank. Among the 9 stocks in the Tobacco industry, it’s ranked #1. Altria Group, Inc. (MO) On the FDA authorization of IQOS tobacco heating system, CEO of MO Billy Gifford said, “We’re delighted that the FDA authorized IQOS to be marketed as a modified-risk tobacco product. This authorization gives PM USA an opportunity to communicate additional benefits of switching to IQOS and this decision is an important step for adult smokers. Our 10-year vision is to responsibly lead the transition of adult smokers to a non-combustible future. IQOS is a key part of that future as we develop our portfolio of FDA-authorized, non-combustible products and actively switch adult smokers to them.” On July 27th 2020, MO declared a dividend of $0.86 per share indicating a new annual dividend of $3.44 per share, which indicates a 2.4% increase from its previous annualized dividend. MO’s target dividend payout ratio is approximately 80% of adjusted earnings per share. The dividend will be paid to shareholders on October 9, 2020, and the latest increase marks the 55th increase over the last 51 years. Over the past six years, MO has issued more dividends than 97.1% of other dividend-issuing US stocks in the StockNews.com universe. In the first half of 2020, net revenues increased 3.9% and adjusted EPS increased 8.5% as compared to the year-ago period. The stock has returned more than 35% since its March lows. MO’s consensus revenue estimate of $5.47 billion for the quarter ending September 2020 indicates a year-over-year increase of 1.2%. MO has an impressive earnings surprise history with the company surpassing consensus EPS estimates in three of the trailing four quarters. Moreover, MO’s EPS is expected to grow 6.1% per annum over the next five years. It’s no surprise that MO is rated Buy in our POWR Ratings system. It also has a grade of A for Trade Grade, and a grade of B for Buy & Hold Grade, Peer Grade, and Industry Rank. In the 9-stock Tobacco industry, it is ranked #2. Want More Great Investing Ideas? 3 Possible Directions for the Stock Market from Here How to Trade THIS Stock Bubble? 9 “BUY THE DIP” Growth Stocks for 2020 PM shares were unchanged in after-hours trading Friday. Year-to-date, PM has declined -5.55%, versus a 5.73% rise in the benchmark S&P 500 index during the same period."}]}