{"article": [{"url": "https://stocknews.com/news/jnj-tsm-mu-cag-4-stocks-raising-guidance-this-quarter/", "published": 1595246900.0, "headline": "4 Stocks RAISING Guidance This Quarter", "body": "Due to the challenging economic environment caused by the coronavirus pandemic, many companies have been pulling guidance due to the uncertain outlook. However, this isn’t true for all companies. Earnings season is upon us and we’ve seen some companies report and actually raise their guidance for the upcoming quarter and/or the full year. Guidance is important because stock prices often rise on increased guidance, as it means that the company has higher expectations in their earnings and/or sales, which in turn can catapult their stock price higher. 9 \"BUY THE DIP\" Growth Stocks For 2020Here are four stocks that recently reported earnings and raised their guidance: Micron (MU) MU had a particularly strong earnings report on July 18th. The company shipped more chips than expected, and the price per chip was higher than expected. MU also said that orders for the next quarter were “very strong”. As a result, MU increased its earnings forecast for the fourth quarter by 20%, and revenue by 10%. This was a sharp contrast from analysts who were expecting a decline in earnings due to lower demand. The POWR Ratings is constructive on MU as well as it’s rated a Buy. It has an “A” for Trade Grade and Industry Rank. It’s ranked #31 out of 86 stocks in the Semiconductor & Wireless Chips group. Taiwan Semiconductor (TSM) TSM is the world’s largest chip foundry. The company reported earnings on July 16th and beat consensus expectations in the current quarter and guided higher for the next quarter. It’s clear from MU and TSM that demand for computer chips is strong as the coronavirus and “work from home” has led to many companies making hefty investments in their cloud infrastructure. Another factor is the worldwide spending on upgrading mobile networks to the 5G standard. For its next quarter, TSM forecast revenue between $11.2 billion and $11.5 billion which was above expectations of $10.7 billion. TSM’s stock has been a winner with a 15% gain so far this month, as it’s carving out fresh, all-time highs. It’s also up 50% from its March-lows and 12% higher than its pre-coronavirus peak. The POWR Ratings are also consistent with this strong outlook, as it has a Strong Buy Rating. It has an “A” in all categories including Trade Grade, Buy & Hold Grade, Peer Grade, and Industry Rank. Among semiconductor stocks, it’s ranked #1 out of 86. Johnson & Johnson (JNJ) On July 16th, JNJ released earnings in which they beat sales and earnings forecast, and it upgraded its outlook for the remainder of the year. Despite the coronavirus leading to a reduction in many people getting medical care, JNJ’s medical devices and pharmaceuticals business continued to grow. For the next quarter, JNJ raised its earnings forecast to $7.75 to $7.95 per share which was above its previous guidance and analysts’ expectations. It also increased its revenue forecast to $79.9 billion to $81.4 billion. JNJ is rated a Strong Buy by POWR Ratings. It has an “A” in all categories including Trade Grade, Buy & Hold Grade, Industry Rank, and Peer Grade. Among the Medical – Pharmaceuticals group, it’s ranked #1 out of 213. Conagra (CAG) Another sector that has benefited from the coronavirus is food stocks which are seeing increased demand and more pricing power as more people are preparing food at home. CAG is 90% higher from its March lows and is now just 10% off it’s all-time highs set in 2017. Its strong performance was also reflected in its June 30th earnings release as the company increased profit by 108% on a year over year basis. Earnings and revenue also came in above expectations. CAG also lifted its forecast for earnings to between $2.66 and $2.76 which was above its previous forecast and analysts’ consensus of $2.50 per share. CAG’s POWR Ratings are also consistent with these positive developments, as it has a Strong Buy rating. It has an “A” for Trade Grade, Buy & Hold Grade, and Peer Grade with a “B” for Industry Rank. Among Foodmakers, CAG is ranked #6 out of 56. Want More Great Investing Ideas? 9 “BUY THE DIP” Growth Stocks for 2020 Newly REVISED 2020 Stock Market Outlook 7 “Safe-Haven” Dividend Stocks for Turbulent Times JNJ shares were trading at $149.67 per share on Monday afternoon, up $0.32 (+0.21%). Year-to-date, JNJ has gained 3.98%, versus a 1.82% rise in the benchmark S&P 500 index during the same period."}]}