{"article": [{"url": "https://stocknews.com/news/amzn-docu-qqq-xlk-two-tech-stocks-to-buy-on-dips/", "published": 1597320500.0, "headline": "Two Tech Stocks To Buy On Dips", "body": "It’s been an incredible recovery from the mid-March lows for the Nasdaq-100 (QQQ) as it is up over 66% in less than 100 trading days. This relentless advance has produced several triple-digit winners in the technology sector (XLK). While sentiment remains quite complacent in the market currently, it’s always a good idea to keep a shopping list handy for the inevitable pullback. A 7-10% pullback in the QQQ would not be surprising to shake out some weak hands, so I am not doing any new buying this moment. However, even though several tech names are quite overbought as is the Nasdaq-100, a few names have taken a rest the past couple of weeks and would become attractive if this weakness continues a little longer. Let’s take a closer look at two of these stocks below: 9 \"BUY THE DIP\" Growth Stocks For 2020 (Source: TC2000.com) The two stocks that stand head and shoulders above most of their peers in the technology space are Docusign (DOCU) and Amazon (AMZN), with earnings growth rates that dwarf most of their large-cap peers. While these two stocks have little in common from a fundamental basis as one is in the Internet-Retail space, and the other is in the Software-Enterprise area, they were both first-movers to disrupt their industry, and both continue to charge ahead of their peers in gaining market share. While their massive rallies year-to-date of 170% and 70% respectively might suggest it’s too late, I would argue that this isn’t the case, as any stock that can perform that well coming out of a mini-bear market likely still has a decent runway for growth. Fortunately, the annual earnings trend for these companies confirms this. We’ll begin with Amazon: As we can see from the chart below, AMZN broke out of a massive base earlier this year and has seen persistent accumulation since getting through its 52-week high at the $2,170.00 level. Generally, the stocks that see the most impressive follow-through from their breakouts tell us something, and Amazon has done precisely this. While a 5-month rally is generally not the best time to buy a position, I believe that any 14% pullbacks for Amazon below $2,900 will provide a buying opportunity as the long-term chart looks like it’s still in inning three or four of this breakout. (Source: TC2000.com) (Source: TC2000.com) As we can see from the previous multi-year breakout, the move lasted well over two years, with a steady uptrend producing a more than 200% gain for shareholders. The previous uptrend was much more gradual in slope, but any 15-25% corrections presented buying opportunities. Given that this uptrend is a much more violent slope, I would argue that the end of this uptrend could mark a long-term top, but a move to $4,000 to $4,400 before that long-term top is in place is certainly possible. Therefore, while the bears are likely to come out in full force on the first 15% to 20% pullback we see, I would argue that any corrections to $2,900 would be opportunities for long-term investors to top up their positions. So, what’s the catalyst for a move to new highs? One only needs to look at Amazon’s earning trend. (Source: YCharts.com, Author’s Chart) If we look at the chart above, we can see that Amazon has seen a steady climb in annual earnings per share [EPS] for several years, with an acceleration from this trend in FY2018 with 300% plus growth year-over-year ($20.14 vs. $4.55). In FY2019, we saw a significant deceleration as the company continued to invest in itself. However, the robust growth is back with a vengeance and is projected to continue at break-neck speed out to FY2022. As we can see from current estimates, FY2020 annual EPS is expected to come in at $31.90, translating to 39% growth, and FY2021 forecasts are sitting at $45.20, a 300 basis point sequential acceleration to 42% growth year-over-year. These are unheard of growth rates for a mega-cap company, and they explain why the stock has been so in vogue all year. If we look out even further to FY2022, annual EPS is projected to climb above $63.00, representing another year of 40% plus growth. At the current share price of $3,000~, Amazon is trading at less than 50x FY2022 earnings with a growth rate that dwarfs nearly every mega-cap peer on the US Market. Therefore, if we could see a pullback to $2,900 where Amazon would be valued closer to 45x FY2022 earnings, I believe it would spell opportunity for investors. (Source: TC2000.com) Moving over to Docusign, the company has had an incredible year as we can see from the chart above. However, while most stocks that catapult higher by 150% in six months run into intense selling pressure, Docusign looks like it’s just building a new base or launchpad for its next move higher. This is extremely bullish. It suggests that long-term investors are not parting with their core positions and are instead likely looking ahead to FY2021 and FY2022 as Docusign continues to be adopted by more industries. For those unfamiliar, the company offers a seamless E-Signature solution that enables businesses to prepare and execute legal agreements digitally. In a COVID-19 dominated world, this is essential to get business done. However, even outside a world that encourages social distancing, it’s a far more convenient way to complete agreements than face-to-face meetings. Let’ s take a look at the earnings trend: (Source: TC2000.com) As the chart above shows, annual earnings per share grew by an incredible 244% in FY2020 and is on track to grow 54% in FY2021 based on current estimates. This is exceptional growth that makes Docusign one of the top-100 growth companies currently, with a two-year stacked EPS growth rate just shy of 300%. While some investors might think Docusign looks expensive at 400x FY2021 earnings, I would argue that this isn’t overly expensive for a company with a compound annual earnings growth rate above 100%. Therefore, if we could see a pullback below $180.00 where the stock would head to oversold levels, I believe this would be a low-risk spot for investors to increase their position. I remain long from $82.00, but I would be more than willing to average up on a pullback below $180.00. AMZN and DOCU have had very nice runs the past few in a market that’s already expensive, and this suggests that holding is the best option here. However, if we were to get a healthy pullback in the QQQ, which took a bite out of growth stocks, I believe these are two of the best candidates to park in one’s portfolio. Obviously, a pullback isn’t guaranteed, but it’s better to prepare ahead with levels in mind than being caught flat-footed in a correction without a buy-list ready. When it comes to AMZN and DOCU, they remain leaders in their sector both from a product/service standpoint and from an earnings standpoint, and I believe these leaders still have more gas left in their tank long-term. Disclosure: I am long DOCU, AMZN Disclaimer: Taylor Dart is not a Registered Investment Advisor or Financial Planner. This writing is for informational purposes only. It does not constitute an offer to sell, a solicitation to buy, or a recommendation regarding any securities transaction. The information contained in this writing should not be construed as financial or investment advice on any subject matter. Taylor Dart expressly disclaims all liability in respect to actions taken based on any or all of the information on this writing. Want More Great Investing Ideas? 9 “BUY THE DIP” Growth Stocks for 2020 How to Trade THIS Stock Bubble? 7 “Safe-Haven” Dividend Stocks for Turbulent Times AMZN shares were trading at $3,172.79 per share on Thursday afternoon, up $10.55 (+0.33%). Year-to-date, AMZN has gained 71.70%, versus a 5.75% rise in the benchmark S&P 500 index during the same period."}]}