{"article": [{"url": "https://stocknews.com/news/lfc-chu-hnp-fcx-cha-top-5-large-cap-dividend-stocks-for-july-6-2020/", "published": 1594037300.0, "headline": "Top 5 Large Cap Dividend Stocks for July 6, 2020", "body": "The top winners in the large cap US dividend space for Monday, July 6, 2020 are LFC, CHU, HNP, FCX, and CHA. Below is a recap of how they fared. China Life Insurance Co Ltd (LFC) Daily Price Recap China Life Insurance Co Ltd is up 17.87% ($1.95) since yesterday, marking the 4th day in a row an increase has occurred. As for how volume fared, yesterday’s volume was up 283.89% from the previous day (Saturday), and up 1046.62% from Sunday of the week before. Below is a daily price chart of China Life Insurance Co Ltd. Dividend investors may wish to pay attention to the dividend yield of dividend stocks, and for LFC, its higher than that of 8.66% of US dividend-issuing stocks. 7 Best ETFs for the NEXT Bull MarketIs LFC a Buy, Hold or Sell? See the POWR Ratings now! CHINA UNICOM (HONG KONG) Ltd (CHU) Daily Price Recap CHINA UNICOM (HONG KONG) Ltd came into today up 14.03% ($0.79) from the open of the day prior, marking the 3rd day in a row it has gone up. The price move occurred on stronger volume; specifically, yesterday’s volume was up 141.04% from the day prior, and up 144.37% from the same day the week before. Below is a daily price chart of CHINA UNICOM (HONG KONG) Ltd. Its beta is lower than 88.2% of US dividend stocks. Make investment decisions regarding CHU using the data that counts. Learn more about POWR Ratings. Huaneng Power International Inc (HNP) Daily Price Recap Huaneng Power International Inc came into today up 13.72% ($2.05) from the open of the day prior, marking the 2nd day in a row an increase has occurred. As for how volume fared, yesterday’s volume was up 66.38% from the previous day (Saturday), and up 447.8% from Sunday of the week before. Let’s take a look at the daily price chart of Huaneng Power International Inc. Its annual compound dividend growth rate is higher than 2.19% of US dividend stocks. What is the outlook for HNP? Use POWR Ratings for clearer insight into price direction. Freeport-Mcmoran Inc (FCX) Daily Price Recap Freeport-Mcmoran Inc closed the day prior up 10.83% ($1.24); this denotes the 2nd day in a row it has gone up. As for how volume fared, yesterday’s volume was up 34.06% from the previous day (Saturday), and up 82.09% from Sunday of the week before. The daily price chart of Freeport-Mcmoran Inc below illustrates. Dividend investors may wish to pay attention to the dividend yield of dividend stocks, and for FCX, its higher than that of 18.51% of US dividend-issuing stocks. Make investment decisions regarding FCX using the data that counts. Learn more about POWR Ratings. China Telecom Corp Ltd (CHA) Daily Price Recap China Telecom Corp Ltd closed yesterday up 7.72% ($2.27); this denotes the 4th day in a row it has gone up. The price move occurred on stronger volume; specifically, yesterday’s volume was up 115.3% from the day prior, and up 59.11% from the same day the week before. Here is a daily price chart of China Telecom Corp Ltd. Its annual compound dividend growth rate is higher than 37.85% of US dividend stocks. Is CHA a Buy, Hold or Sell? See the POWR Ratings now! Want More Great Investing Ideas? 9 “BUY THE DIP” Growth Stocks for 2020 Is the Bull S#*t Rally FINALLY Over? 7 “Safe-Haven” Dividend Stocks for Turbulent Times Top 3 Investing Strategies for 2020 To further your research on dividend stocks, check out our list of dividend stocks sorted by yield. LFC shares were unchanged in after-hours trading Monday. Year-to-date, LFC has declined -3.09%, versus a -0.48% rise in the benchmark S&P 500 index during the same period."}]}