{"article": [{"url": "https://stocknews.com/news/hd-low-home-depot-vs-lowes-which-stock-is-a-better-buy/", "published": 1601294900.0, "headline": "Home Depot vs. Lowe's: Which Stock is a Better Buy?", "body": "Home Depot, Inc. (HD) and Lowe’s Companies, Inc. (LOW) are two of the biggest home improvement companies operating in the United States. These companies have been soaring amid the pandemic, as the demand for home renovation and repairs is on the rise. The sheer market size and brand value of the two companies have allowed them to grow significantly over the past five years. While HD returned 130% over this period, LOW gained 132.3%. In terms of year-to-date performance, LOW is the clear winner with 33.2% returns versus HD’s 23% gains. But which of these stocks is a better buy now? Let’s find out. 7 \"SAFE HAVEN\" Dividend Stocks for Turbulent TimesBusiness Structure and Latest Movements HD is the biggest home improvement company in the world, with $110.20 billion in revenues in 2019. LOW ranks second on the global home improvement retail companies list, generating total revenues of $72.10 billion for the same year. Both HD and LOW supply a similar array of goods for home remodeling, repairs, and decoration. Catering to both do-it-yourself (DIY) customers and professionals, HD and LOW compete for the same customers. However, HD is potentially more popular among professional users. On August 4th, HD announced its plans to open three new distribution centers in Georgia to facilitate flexible delivery and pick options for its customers. This 18-month project is part of HD’s initiative to establish 150 new supply chains across the country, making it accessible to 90% of the U.S. population. It also launched premiere outdoor power brand categories earlier this year. LOW also plans to expand its supply chain by opening 50 cross-dock delivery terminals over the next 18 months, as announced on August 12th. This will allow the company to improve its home delivery channels as well as cater to the increasing demand for home improvement products. LOW announced a nationwide tool rental program earlier in August, allowing customers to access the appropriate tools for the home improvement projects. This is expected to generate substantial profits for the company by expanding its client base. Moreover, LOW has initiated a contactless delivery service on September 22nd, through “buy online and pick up in-store” service. This will allow customers to get their orders in the same day while complying with the social distancing rules. LOW is planning to install pick-up lockers in all the stores located in the United States in this regard. Recent Financial Results HD’s sales increased 23.4% year-over-year to $38.10 billion in the second fiscal quarter ended August 2020. EPS increased by 26.8% from the same period last year to $4.02. Gross profit rose 24.1% from the year-ago value to $12.94 billion, while net earnings grew 24.5% to $4.33 billion. LOW’s net sales increased 30% year-over-year to $27.30 billion in the second quarter ended in July 2020. While digital sales increased 135% from the year-ago value during this time, U.S. comparable sales grew 35.1% from the same period last year. EPS grew 75% year-over-year to $3.74, while net earnings rose 68.7% to $2.83 billion. Here, LOW is in an advantageous position in terms of year-over-year growth. Past and Expected Financial Performance HD’s revenue and diluted EPS grew at CAGR of 7% and 16.3%, respectively, over the past three years. Also, the CAGR of the company’s free cash flow has been 19.9%. The market expects HD’s revenue to increase by 14.3% in the current quarter and 13.3% in the current year. Its EPS is expected to grow 16.6% in the ongoing quarter and 10.5% in the current year. Moreover, its EPS is expected to grow 6% per annum over the next five years. Contrarily, LOW’s revenue and diluted EPS grew at a CAGR of 5.8% and 28.7%, respectively, over the past three years. Also, the CAGR of LOW’s free cash flow has been 28.7%. The market expects LOW’s revenues to increase by 18.2% in the current quarter and 17.7% in the current year. Its EPS is expected to grow 33.3% in the current quarter and 48.3% in the current year. Moreover, the company’s EPS is expected to grow by 21.8% per annum over the next five years. Hence, LOW has an edge over HD in terms of both past and expected financial performance. Profitability HD’s trailing-twelve-month revenue is 48.4% higher than what LOW generated. But HD is just marginally more profitable with a gross margin of 34.1% versus LOW’s 33.1%. HD’s ROA of 18.1% compares favorably with LOW’s 11.8%. Valuation In terms of forwarding P/E, HD is currently trading at 23.64x, 26% more expensive than LOW, which is currently trading at 18.76x. HD is more expensive in terms of trailing 12-month P/S as well (2.43x versus LOW’s 1.53). Its forward PEG of 3.16x is almost 190% higher than LOW’s 1.09x. In terms of trailing-12-month price/cash flow as well, HD’s 14.45x is 49.4% higher than LOW’s 9.67x. LOW is relatively cheaper with a solid earnings growth potential, and thereby a preferable option over HD. POWR Ratings Both HD and LOW are rated “Buy” in our proprietary POWR Ratings system. Here’s how the four components of overall POWR Rating are graded for both the stocks: HD has an “A” for Trade grade and Industry Rank, and “B” in Buy & Hold grade and Peer Grade. In the 68-stock Home Improvement & Goods industry, it is ranked #1. LOW has an “A” for Trade grade, Peer grade, and Industry Rank, and “B” for Buy & Hold Grade. It is ranked #2 out of 68 in the Home Improvement & Goods industry. The Winner While both HD and LOW are ideal for long term investments given their market share and past performance, LOW is the better buy based on the factors discussed here. LOW’s growth potential is significantly higher compared to HD, as observed from the street estimates. Along with all other advantages, its relatively cheaper valuation makes it an attractive investment option now. Want More Great Investing Ideas? 7 “Safe-Haven” Dividend Stocks for Turbulent Times When Does the Next Bull Run Start? Chart of the Day- See the Stocks Ready to Breakout HD shares rose $0.17 (+0.06%) in after-hours trading Monday. Year-to-date, HD has gained 26.95%, versus a 5.32% rise in the benchmark S&P 500 index during the same period."}]}