{"article": [{"url": "https://stocknews.com/news/wmt-pg-mcd-dltr-4-stocks-to-buy-and-hold-for-a-drawn-out-recession/", "published": 1596197300.0, "headline": "4 Stocks to BUY and HOLD for a Drawn-Out Recession", "body": "The U.S. economy experienced the most significant quarterly drop in history as the gross domestic product (GDP) dove 32.9% from April to June on an annualized basis. The closest previous fall was in 1921. GDP is a combined count of all goods and services produced during a period of time. There were significant contractions in exports, inventories, personal consumption, and investment and spending by state and local governments. Personal consumption, which typically represents two-thirds of all activity in the U.S., subtracted 25% from the second-quarter total. There was a drop in spending on goods such as clothing, services such as travel, and inventory investments, such as motor vehicle dealerships. 9 \"BUY THE DIP\" Growth Stocks For 2020This drop emphasizes just how bad the recession is. While the economy started to open up in May, the U.S. will likely stay in a recession for the foreseeable future. There are millions out of work, and many businesses have either shut down for good or have scaled back their operations considerably. That’s not to mention the recent surge in corona cases. I believe that we are headed for a drawn-out recession, and as investors, we need to consider stocks that will hold up during these tough times. Walmart (WMT), Procter & Gamble (PG), McDonald’s (MCD), and Dollar Tree (DLTR) are four stocks I believe will not only endure a recession but provide solid gains for investors. Walmart (WMT) WMT has been benefiting from increased demand for essential everyday items due to the pandemic. COVID-19 has forced consumers to social distance and stay home. This drove sales of items such as toilet paper, masks, disinfectants, and masks. As expected, this provided a revenue boost for WMT. The company has also boosted its e-commerce footprint. WMT has contracts with Green Dot, and Microsoft, and purchased a 77% stake in Flipkart to bolster e-commerce sales. The company has also made an effort to expand its online grocery store. The company’s delivery service has become essential due to corona. WMT revealed Express Delivery at several stores, which delivers orders to customers in less than two hours. U.S. e-commerce sales grew 74% in the first quarter due to strength in grocery pickup and delivery, and walmart.com. WMT is one of the top-rated stocks in our momentum-based POWR Ratings system. Overall, it has a Strong Buy Rating and is the #1 ranked stock in the Grocery/Big Box Retailers industry. The company’s immense size and its ability to serve products at a lower cost make it recession-proof. Keep out on August 18th when the company reports earnings. Procter & Gamble (PG) PG, founded in 1837, is one of the world’s largest consumer product manufacturers, with nearly $70 billion in annual sales. It has a portfolio of leading brands, including 21 that generate more than $1 billion in annual sales. This includes Charmin toilet paper, Pantene shampoo, Pampers diapers, and Tide laundry detergent. PG has played a vital role in providing products during the pandemic, especially pertaining to health, hygiene, and cleaning products. The company made a concerted effort to make its cleaning products available while products were flying off the shelves. This helped bolster sales. PG has seen an increased demand for surface cleaners, hand soaps, and detergents. The company also remains focused on efficient and cost-saving plans to boost its margins. The company reported quarter-end earnings yesterday of $1.16 per share compared with a consensus estimate of $1.01. The demand for cleaning products led to an impressive fiscal fourth quarter. It reported net sales of $17.6 billion, which was a 4% increase year over year. PG is another company that should provide stable growth in a recessionary environment. The company holds grades of A in five out of five scores in the POWR Ratings. It is also the #1 ranked stock in the Consumer Goods industry. McDonald’s (MCD) MCD is the world’s largest chain of fast-food restaurants. The company has a presence in more than 100 countries. MCG has almost a 10% share of the global fast-food market. Its size provides a competitive advantage to scale its operations in the future. The company’s top priority is to grow guest counts and focus on food quality, value, and convenience. MCD is looking to drive future growth with digital orders and delivery. Since the coronavirus pandemic started, the company focused on drive-thru and delivery. Before the outbreak, drive-thru accounted for almost two-thirds of all sales in the U.S. It now accounts for 90% of sales. The company has also launched its mobile order and pay in nearly all U.S. restaurants. MCD provides delivery from more than 25,000 restaurants in 75 countries. During a recession, consumers typically have less money to spend, and food is one way to lower costs. MCD provides food at value prices for people that want to skip a day of cooking. The company has a Buy rating in our POWR Ratings system and is ranked #6 out of 48 stocks in the Restaurant industry. Dollar Tree (DLTR) DLTR operates discount stores in the U.S. and Canada, with over 7,500 stores under the Dollar Tree banner and more than 7,700 under the Family Dollar name. The company features brand name and private-label products priced at $1. Almost 50% of Dollar Tree’s 2019 sales came from consumable items, including food, health and beauty, and household and cleaning products. Those numbers have only gone up since the pandemic. The company reported robust first-quarter results due to an extraordinary spike in demand for these types of products. DLTR’s expansion and restructuring plans will continue to drive revenues. In the first quarter, the company opened 99 stores and completed a renovation of 220 Family Dollar stores. DLTR plans to open 500 stores for fiscal 2020. Since the company provides food and consumer products for only $1 at most locations, DLTR is a great stock to hold during a recession. In terms of financial stability, the company grew cash and cash equivalents to $1.8 billion from $539.2 million at the end of the previous quarter. The company lowered its long-term debt 4.6% to $8.1 billion. Keep out on September 9th when the company reports earnings. Want More Great Investing Ideas? 9 “BUY THE DIP” Growth Stocks for 2020 How HIGH Can This Tech Bubble Fly? 7 “Safe-Haven” Dividend Stocks for Turbulent Times WMT shares were trading at $129.40 per share on Friday afternoon, down $0.72 (-0.55%). Year-to-date, WMT has gained 9.85%, versus a 2.49% rise in the benchmark S&P 500 index during the same period."}]}