{"article": [{"url": "https://stocknews.com/news/sono-sonos-a-bargain-and-a-takeover-candidate/", "published": 1594728500.0, "headline": "Sonos: A Bargain and a Takeover Candidate", "body": "Sonos equipment is the bomb The stock is at the same price as the IPO in July 2018 The market cap and products make the company a steal for the trillion-dollar club Sonos (SONO) designs, develops, manufactures, and sells multi-room audio products worldwide. The company provides wireless speakers, home theater speakers, components, and accessories. The products are available through around 10,000 retail stores, custom installers or home audio systems, and e-commerce retailers, and the company’s website, sonos.com. Sonos has been around since 2002, with headquarters in Santa Barbara, California. The company became public in August 2018 at $15 per share. It has traded in a range from $6.58 to $23.60 since its initial public offering. At just over the $15 level at the end of last week, the stock was in the middle of its trading range. It was back at the IPO price. The lows came in mid-March. SONO fell with the rest of the market on the back the global pandemic’s risk-off period. Sonos is an innovative audio technology company that could be takeover bait at its current share price and valuation. Sonos equipment is the bomb 7 \"SAFE HAVEN\" Dividend Stocks for Turbulent TimesA few years ago, I purchased two Sonos speakers for my backyard. The wireless technology is nothing short of amazing. When streaming music, accessing downloaded playlists, or listening to the radio, the speakers provide a crisp tone and incredible bass. The speakers fill the whole backyard with music as the smart technology adjusts to its surroundings. The setup took a few minutes, and I operate it from my smartphone for music selection and volume. Sonos products are priced competitively and are an excellent choice for music, home theater, and other audio needs. I have been an audiophile for years and have owned come of the best equipment. The Sonos speakers perform better than most of the others I have owned, which were far more expensive. The stock is around the same price as the IPO in July 2018. Want More Great Investing Ideas? 9 “BUY THE DIP” Growth Stocks for 2020 Top 5 WINNING Stock Chart Patterns 7 “Safe-Haven” Dividend Stocks for Turbulent Times SONO shares fell $0.04 (-0.28%) in premarket trading Tuesday. Year-to-date, SONO has declined -9.03%, versus a -1.50% rise in the benchmark S&P 500 index during the same period."}]}