{"article": [{"url": "https://stocknews.com/news/ffiv-dgx-regn-value-stocks-that-were-recently-upgraded/", "published": 1594987700.0, "headline": "Value Stocks That Were Recently UPGRADED", "body": "A value stock is a stock that trades at a lower price compared to its underlying fundamentals. Some common characteristics of a value stock include a low Price/Earnings ratio, a low Price/Book ratio, and a low Price/Sales ratio. These stocks are typically out of favor due to reasons such as negative press, legal issues, or industry wide problems. A diversified portfolio should include some value stocks. After all, value stocks have outperformed growth stocks over the long term. Value stocks offer an opportunity for an investor to profit off the market imbalance that is making the stock priced lower than its true value. Value stocks offer an opportunity to invest in a good company with plenty of room to grow over the long term. Today we are going to look at three value stocks that were recently upgraded. Wall St. analyst’s use different ratings to evaluate a stock: such as Buy and Sell or Underweight and Overweight. Investors should pay attention to upgrades, and downgrades for that matter, because they can typically affect the price of the stock. 7 \"SAFE HAVEN\" Dividend Stocks for Turbulent TimesF5 Networks (FFIV) FFIV is a market leader in the application delivery controller market. The company sells products for networking traffic, security, and policy management. These products improve the performance, security, and availability of applications that run on networks that use Internet Protocol (IP). FFIV customers include service providers such as telecommunication companies, financial services firms, and the government. The company reported $583 million in revenue for the quarter ending March 2020, which was a 7% increase from the year-ago quarter. FFIV is gaining momentum from software growth and an increase in cloud and security offerings. The company is also benefiting from the rising demand for application security across multi-cloud platforms. FFIV is profiting from increasing software subscriptions for products such as ELA, NGINX, and Virtual Edition. The stock was recently upgraded to Overweight on July 9th by Morgan Stanley. FFIV is rated a Buy in our momentum-based POWR Ratings system. The stock is the #18 ranked stock in the Software-Business industry. FFIV has a current Price/Sales figure of 3.9 and a Price/Book of 4.5, well below the industry average. Quest Diagnostics (DGX) If you lived in the Northeast and were sent for labs by a doctor, you have probably heard of Quest. DGX is a leading independent provider of diagnostic testing in the U.S. It generates over 95% of its revenue through clinical testing, anatomic pathology, esoteric testing, and substance abuse testing. The company currently has a national network of 2,000 patient service centers. DGX recently got into the COVID test game. The company reported that it had performed almost one million molecular tests. It has also begun to start antibody testing as well. These tests should boost revenue for the foreseeable future. Over the long term, the company should also benefit from the baby boomers’ increased testing needs. The stock was upgraded to a Buy on July 14th by Bank of America Securities. DGX is currently rated a Strong Buy in the POWR Ratings. It holds grades of A and B for the four components that make up the POWR Ratings system and is the #3 ranked stock in the Medical – Diagnostics/Research industry. DGX has a current Price/Sales figure of 2.2 and a Price/Book of 2.9. Regeneron Pharmaceuticals (REGN) REGN discovers, develops, and commercializes products that fight eye disease, cardiovascular disease, cancer, and inflammation. The company has seven drugs that are sold today, including Arcalyst, Dupixent, Eylea, Kevzara, Libtayo, Praluent, and Zaltrap. The company is also developing monoclonal antibodies with Sanofi for immunology and cancer. For the quarter ending March 2020, the company reported an increase in net product sales to $1.2 billion compared with $1.1 billion for last year’s first quarter. The company’s performance has been primarily driven by strong sales from Dupixent and Libtayo, and the label expansion of Eylea. Dupixent treats asthma, dermatitis, and nasal polyposis. Libtayo treats metastatic or locally advanced cutaneous squamous cell carcinoma, while Eylea treats eye diseases. Another growth driver for the company is the development of REGN-COV2, REGN’s double-antibody cocktail for the treatment and prevention of COVID-19. The drug just started Phase 3 trials. REGN was upgraded to a Buy on July 9th by SunTrust Robinson Humphrey. How does REGN stack up for the POWR Ratings? A for Trade Grade A for Buy & Hold Grade A for Industry Rank A for Peer Grade A for overall POWR Rating Five aces, that’s pretty good. The stock is also the #3 ranked stock in the Biotech industry. Want More Great Investing Ideas? 9 “BUY THE DIP” Growth Stocks for 2020 Newly REVISED 2020 Stock Market Outlook 7 “Safe-Haven” Dividend Stocks for Turbulent Times FFIV shares were trading at $149.02 per share on Friday afternoon, up $1.58 (+1.07%). Year-to-date, FFIV has gained 6.71%, versus a 0.90% rise in the benchmark S&P 500 index during the same period."}]}