{"article": [{"url": "https://stocknews.com/news/iipr-cron-grwg-apha-4-cannabis-stocks-ready-to-run/", "published": 1597234100.0, "headline": "4 Cannabis Stocks READY to RUN", "body": "This week on CNBC’s Fast Money is “Cannabis Week.” It’s another indication that cannabis is now mainstream. According to Pew Research, 2/3 of Americans now support its legalization. Cannabis is now recognized as a form of medicine, safer form of pain relief, and a way to unwind similar to a glass of wine. These changing attitudes are leading to it becoming a growing industry that will create a number of opportunities for investors. Another catalyst for the sector is a “blue wave” which increases the likelihood of decriminalization or legalization at the federal level. Also, it would lead to a change in the Department of Justice’s policy of prosecuting companies who work with cannabis companies. Investors should consider cannabis stocks given this potent catalyst and the long-term trends that are making it a mainstream product. The following four cannabis stocks could be on the cusp of a bull run: Innovative Industrial Properties (IIPR), Cronos Group (CRON), Aphria (APHA), and Grow Generation (GRWG). 7 \"SAFE HAVEN\" Dividend Stocks for Turbulent TimesInnovative Industrial Properties (IIPR) Most people are unaware of the fact that they have the opportunity to make money through a cannabis-related real estate investment trust. IIPR, a San Diego-based business, is the perfect place to park your money if you want to capitalize on the cannabis craze. Rather than attempting to compete with the seemingly endless number of cannabis growers, IIPR acquires, owns, and manages cannabis industrial properties, leasing them to operators throughout the country. The primary risk in investing in IIPR is the potential for nationwide legalization that would inevitably open the door for many more competitors to provide cheaper lease agreements to growers, essentially undercutting IIPR’s business. However, it appears as though state-by-state legalization might occur in the years ahead rather than across-the-board nationwide legalization. The POWR Ratings show IIPR has A grades in each POWR Component. The only exception is the stock’s B Industry Rank grade. IIPR is ranked 8th of more than 20 REITs – Industrial stocks. The top analysts have a price target which is 7% above the current, market price. Sweetening the pot is the fact that IIPR’s dividend is creeping up toward 4%. IIPR is a must-own for every investor looking for a piece of the cannabis action. Cronos Group (CRON) Instead of trying to pinpoint the best couple of cannabis growers, it is better to invest in a company that invests in the firms that have obtained the license necessary to grow and sell medical cannabis. CRON is one such group. Examples of CRON holdings include ABcann, Vert Medical, Peace Naturals, and In The Zone. CRON is like a “streaming” company that invests in a variety of growers. This spreads out the risk and gives investors exposure to the sector. CRON is ranked 15 of 27 stocks in the agriculture sector. CRON moved up to $8 in a post-corona sell-off bump yet traded right back down to $5 and change. However, the top analysts insist CRON has a price target of $7.40, indicating there is around 30% upside. With nearly $10 million in quarterly sales, CRON has some momentum moving forward, especially if more states legalize cannabis. About one-quarter of CRON’s sales are in the United States. This figure is likely to grow if there is a blue wave this November that leads to cannabis legalization in several more states. Aphria Inc. (APHA) The days of shunning cannabis as a faux medicine are long gone. Cannabis is now embraced as a highly effective medicine, especially in Canada. APHA makes, supplies, and sells cannabis for medical purposes. Most of APHA’s business is conducted in Canada. Aside from the cannabis flower, APHA also sells cannabis-based oils. APHA is ranked in the top third of more than 215 publicly traded companies in the Medical – Pharmaceuticals category. The stock has an Industry Rank of B and a solid Peer Grade. It is quite interesting to learn the top analysts insist APHA has more than 50% upside, setting a lofty price target of $6.89. APHA is on pace for four straight quarters of positive EBITDA earnings. Look for APHA to move back toward its 52-week high of $7.14 before the end of the year. Grow Generation (GRWG) If you do not like the idea of investing in cannabis growers, consider investing in those that own and operate hydroponic gardening stores. GRWG is one such company. GRWG sells organic products including soils and nutrients used to grow cannabis. The company also sells additional equipment such as lighting that facilitates large scale cannabis growth. If Joe Biden is elected president and legalizes cannabis across the country, GRWG’s organic gardening and hydroponic stores will undoubtedly benefit. Priced at $9.11, GRWG is an affordable cannabis stock likely to rise beyond $10 if the analysts are right. Want More Great Investing Ideas? 9 “BUY THE DIP” Growth Stocks for 2020 How to Trade THIS Stock Bubble? 7 “Safe-Haven” Dividend Stocks for Turbulent Times IIPR shares were trading at $115.56 per share on Wednesday morning, up $1.62 (+1.42%). Year-to-date, IIPR has gained 56.08%, versus a 5.84% rise in the benchmark S&P 500 index during the same period."}]}