{"article": [{"url": "https://stocknews.com/news/orcl-zm-dell-twtr-roku-5-tech-stocks-rallying-during-septembers-market-selloff/", "published": 1601294900.0, "headline": "5 Tech Stocks Rallying During September's Market Selloff", "body": "Even though the market is seeing an impressive rally today, the S&P 500 (SPY) is down more than 4% in the past month. That’s due in part from an overarching fear that the coronavirus will linger well beyond the new year, limiting economic progress possibly until an effective vaccine is available. A handful of stocks have bucked September’s bearish trend, continuing to climb in spite of the fact that this has been a down month for the market as a whole. In particular, certain tech stocks have climbed higher amidst the market-wide sell-off. Below, we provide a look at five tech stocks that have been rallying during the market’s September slide: Oracle (ORCL), Zoom Video Communications (ZM), Dell Technologies (DELL), Twitter (TWTR), and Roku (ROKU). 7 \"SAFE HAVEN\" Dividend Stocks for Turbulent TimesOracle Corporation (ORCL) ORCL’s September rally is largely due to the company’s partial acquisition of the popular social media business TikTok. However, even if ORCL’s acquisition of TikTok is completed, it will only comprise a small portion of the company’s business. ORCL also provides cloud services and solutions, and numerous other services through subscription. The POWR Ratings reveal ORCL has “A” grades in each POWR Component but for its Industry Rank which is a “B.” ORCL is ranked 2nd of 94 stocks in the Software – Application space. Check out the analysts’ take on ORCL and you will find a price target of $61.69. In spite of ORCL’s recent ascension, the stock still has a fairly low forward P/E ratio of 14.27. If there is any additional positive news about the TikTok deal, ORCL could move past its 52-week high of $62.60. Zoom Video Communications (ZM) It should come as no surprise that ZM has moved higher during a bearish month. ZM has proven integral to both business and socialization, providing helpful videoconferencing service during the pandemic. Examples of ZM products include Zoom Meetings, Zoom Chat, Zoom Video Webinars, Zoom Phone and Zoom for developers. ZM’s POWR Ratings are nearly perfect: “A” grades in each POWR Component but for its Industry Rank of B. ZM has quickly zoomed up its Industry Rank (pun intended) rising to #3 of 53 stocks in the Technology – Services sector. ZM fell down to $350 in early September only to soar right back up to the low $500s in the weeks following the decline. Though ZM provides a free video conferencing service, the company makes plenty of money from its premium offerings. ZM’s revenue growth skyrocketed 355% this past quarter. Furthermore, the company enjoyed a 458% spike in customers from companies with more than 10 employees. Even if the pandemic were to end tomorrow, ZM would retain a significant number of its customers simply because business is transitioning away from office-based in-person interactions to remote work conducted on the web. Dell Technologies (DELL) DELL is still going strong long after it rose to prominence in the 90s and early aughts. DELL computers are favored by businesses far and wide. Though some of the company’s cheaper offerings have a reputation for faltering, the company is still one of the computing industry’s power players. Furthermore, DELL provides services, peripherals, third-party software, servers, storage and more. DELL has “A” grades in each POWR Component except for its Industry Rank. DELL is the top-ranked stock of nearly 30 in the Technology – Hardware space. The analysts are bullish on DELL even after its recent upward movement, with nine recommending investors buy the stock and six advising investors hold. DELL appears to be undervalued at its current price of $66 as its forward P/E ratio is slightly above 10. DELL’s VMware virtualization segment is growing at a 10% clip with profit growth up nearly 20%. This is important as VMware virtualization is one of the company’s highest margin segments. DELL is also benefiting from the fact that computers are flying off the shelves during the pandemic. Look for DELL to continue its upward trend as the year rounds out. Twitter (TWTR) TWTR just keeps on inching upward with each passing month. TWTR was rumored to be interested in TikTok yet ended up standing pat. Aside from the potential for the company to implement a subscriber service, the stock was upgraded last week by Pivotal Research Group from a “Hold” to a “Buy” and a price target of $59.75. TWTR is a POWR Ratings superstar with “A” grades in three of four components. TWTR is ranked in the top 10 of nearly 60 Internet stocks. TWTR’s transition toward direct-response marketing combined with the 2021 Olympics heightening engagement on the message service should help this stock gradually climb higher in the months ahead. Roku (ROKU) ROKU streaming units and TVs are selling like gangbusters amidst the pandemic. ROKU facilitates streaming with its diminutive box yet the company is also making gains in the TV segment thanks to its successful partnerships with Sharp, JVC and TCL. The POWR Ratings reveal ROKU has “A” grades in the Trade Grade and Peer Grade components. The stock is in the top five of nearly 30 in the Technology – Hardware category. More people could scoop up Roku devices and TVs as the weather turns cold in the months ahead and the prolonged pandemic forces people to remain indoors. Furthermore, nearly 7 million more households in the country will cut the cord on cable this year alone, helping ROKU expand its customer base all the more. Want More Great Investing Ideas? 7 “Safe-Haven” Dividend Stocks for Turbulent Times When Does the Next Bull Run Start? Chart of the Day- See the Stocks Ready to Breakout ORCL shares were trading at $59.85 per share on Monday morning, up $0.05 (+0.08%). Year-to-date, ORCL has gained 14.49%, versus a 5.22% rise in the benchmark S&P 500 index during the same period."}]}