{"article": [{"url": "https://stocknews.com/news/well-vtr-ctre-3-senior-living-reits-to-capitalize-on-the-aging-baby/", "published": 1596542900.0, "headline": "3 Senior Living REITs to Capitalize on the Aging Baby Boomers", "body": "The United States’ population is rapidly aging. The country’s birth rates are at an all-time low. Marriage has become a cultural tradition nearly exclusive to the wealthy and upper-middle class. The U.S. has sizable Generation X and millennial age cohorts that will care for the aging Baby Boomers. However, problems are likely to arise when the millennials reach their golden years, and the comparably small Generation Z is tasked with providing care for their millennial elders. Instead of dreading a potentially dystopian future where the millennial age cohort has to rely on robotic nurses for assistance in senior living facilities, let’s turn our attention to profiting from the country’s current aging trend. Though we all dread the aging process, there is no reason we should sweep it under the metaphorical mental rug. The simple truth of the matter is our aging population will steer beaucoup bucks toward senior living facilities. The following three senior living REITs are well-positioned to benefit from this phenomenon: Welltower (WELL), Ventas Inc. (VTR), and CareTrust REIT (CTRE). 9 \"BUY THE DIP\" Growth Stocks For 2020Welltower Inc. (WELL) Suppose you are uncertain as to which specific area to invest in to capitalize on our aging society. In that case, it is best to invest in the entire spectrum of senior housing facilities and healthcare-related real estate. From nursing homes to medical office facilities, independent living centers, and beyond, WELL has its hands in all the money-rich, aging-related pies. Check out WELL’s POWR Ratings, and you will find average grades yet respectable price returns. WELL had a 15% price return in ’18, a 23% price return in ’19, and a 12% price return across the prior three months. WELL has a forward P/E ratio of 15.62, indicating the stock might be a bit undervalued at its current trading price of $53. The bottom line is WELL is oversold at its current price. The stock was trading near $100 before the coronavirus sell-off. WELL might not completely fulfill expectations in the year ahead simply because Baby Boomers are hesitant to leave their homes as the virus might lurk in assisted living facilities. However, WELL stands a good chance of moving back toward its pre-COVID trading level in the months to come. Ventas Inc. (VTR) Investing in healthcare real estate can prove quite profitable in the months and years to come, primarily if the investment is spread out across multiple regions. If the coronavirus is restricted to one part of the country and the elderly pass away at a higher rate in that region, it won’t impact the business of healthcare living facilities in other areas. Enter VTR. VTR’s senior housing properties are spread out across the country. VTR has a forward P/E ratio of 12.02, meaning it is a solid value at its current trading price of $37.81. VTR is still priced well below its pre-COVID trading range of $60 to $70. VTR’s 4.69% dividend holds considerable appeal even though the stock is struggling. This is a reliable value play that should gradually trend upward in the quarters to come. CareTrust REIT (CTRE) CTRE owns and leases healthcare facilities. CTRE provides a 5.55% dividend, a return that might not outpace the average stock portfolio yet is still quite substantial. The POWR Ratings show CTRE has solid grades across the board. The stock is ranked in the top 10 in the REITs – Healthcare industry. CTRE has a forward P/E of 13.38, meaning its trading price of $18.07 is reasonable. It is hard to believe CTRE dropped down to $8 in March. Currently, the stock is trading around $18, yet not much has changed in the context of this stock since the arrival of the coronavirus. CTRE has recently been upgraded to a Buy thanks to its increase in earnings estimates, yet no other news of significance has been made public. In short, CTRE provides services that are absolute necessities regardless of the state of the economy. CTRE will continue to collect rent in a recurring manner irrespective of whether the economic trough remains. Want More Great Investing Ideas? 9 “BUY THE DIP” Growth Stocks for 2020 How HIGH Can This Tech Bubble Fly? 7 “Safe-Haven” Dividend Stocks for Turbulent Times WELL shares were unchanged in after-hours trading Tuesday. Year-to-date, WELL has declined -33.18%, versus a 3.60% rise in the benchmark S&P 500 index during the same period."}]}