{"article": [{"url": "https://stocknews.com/news/ltc-ohi-snr-3-popular-high-yield-healthcare-reits-could-be-going-code-blue/", "published": 1600430900.0, "headline": "3 Popular High-Yield Healthcare REITs Could Be Going 'Code Blue'", "body": "The coronavirus pandemic has put a tremendous strain on the healthcare sector. At times, emergency rooms have been overrun. Simultaneously, the healthcare industry has committed many resources to fighting the virus, meaning individuals with other illnesses and afflictions may not be getting the care they need. The healthcare industry accounts for 17% of the U.S. economy. That means almost one out of every five dollars spent goes to healthcare services. Healthcare real estate investment trusts (REITs) make up a similar portion of the overall real estate investment trust universe. In the current economy, investors should be asking themselves whether the pandemic will be a net positive or a negative for healthcare REITs. REITs in the healthcare sector own senior living facilities, skilled nursing care facilities, medical office buildings, and hospitals. The 18 REITs in the sector typically focus on one or two of the different types of healthcare properties. Amongst these, I think REITs that own senior living and skilled nursing facilities are the ones of most concern. 9 \"BUY THE DIP\" Growth Stocks For 2020LTC Properties (LTC) In my Dividend Hunter service, I recommended selling the last REIT on the recommendations list in February 2019. LTC Properties (LTC) had been a recommended stock since October 2016. I recommended selling due to the lack of dividend growth combined with a relatively low yield. For diversification, I would like to have one or two healthcare REITs on the Dividend Hunter list. However, for the reasons discussed here, I think the risks currently outweigh the benefits. Dividend Hunter readers are currently enjoying other high-yield opportunities while we wait for the healthcare sector to turn around. REITs that own senior living and skilled nursing facilities, with third-party operators that pay them rent. Many nursing homes and senior living operators faced financial challenges even before the pandemic landed in the U.S., hitting especially hard at these facilities. CDC recently reported that more than 54,000 nursing home residents died of COVID-19—a quarter of all U.S. deaths from the coronavirus. It’s not just U.S. facilities suffering these losses. A July article from McKnight’s Long-Term Care News reported that “more than 80% of all COVID-19 deaths in Canada are from long-term care facilities and retirement homes.” Another reason I think healthcare REITs are particularly risky right now, with current unknown effects, is how much will pandemic prevention measures increase the costs of senior living and skilled nursing homes? Profit margins for operators were already slim before the pandemic. I suspect could be pushed into bankruptcy or force the REITs to give rent concessions. Unfortunately, skilled nursing and senior living REITs have the most attractive dividend yields; however, I want to wait for at least several quarters to determine the extent of the financial damage wreaked by the coronavirus pandemic. Here are three healthcare REITs with extensive senior living/nursing home exposure to avoid until their future prospects become more evident. LTC Properties (LTC) owns a portfolio that consists of 72 skilled nursing properties and 107 assisted living facilities. Twenty-seven operators are currently leasing from LTC. Through the 2020 second quarter, the $0.19 per share monthly dividend continued to be well covered by cash flow. However, second-quarter revenue was down 38% compared to the same quarter in 2019. For the second quarter, 92% of contracted rent was collected. During a recent presentation, the company made no mention of any of the pandemic’s effects on the residents and operators. I don’t take that overlook as a positive. There is too much risk for the current 6.2% dividend yield. Omega Healthcare Investors (OHI) Omega Healthcare Investors (OHI) is a popular REIT with a long-term track record of dividend growth. Omega owns over 900 skilled nursing facilities located in the U.S. and United Kingdom. The REIT had a solid 2020 second quarter with operating revenue up 14% year over year; funds from operations (FFO) per share of $0.80 was up from $0.71 a year earlier and handily covered the $0.67 per share dividend. From the second-quarter results, Omega remained a nicely profitable REIT. For this REIT, the metrics to watch are the coronavirus-related expenses going forward. Omega Healthcare Investors currently yields 8.1%. New Senior Investment Group (SNR) At the other end of the spectrum sits New Senior Investment Group (SNR). In June, this small-cap senior housing REIT slashed its dividend by 50%. With its 2020 first-quarter earnings, released in May, New Senior reported that occupancy had dropped by 1.2%, and monthly move-ins were off by 55% due to the pandemic. For the second quarter, the company reported continuing declining occupancy and additional operating expenses due to the coronavirus. For the 2020 second half, the company guided for net operating income to drop by and an additional 4.5% to 7.5%. New Senior Investment may be the canary in the coal mine for senior living focused healthcare REITs. Want More Great Investing Ideas? Top Dividend Stock to Own! Download Free Report Today Buy These 3 High-Yield Dividend Stocks All Under $15 Buy and Hold These 3 Dividend Stocks Forever LTC shares were trading at $35.71 per share on Friday afternoon, down $0.51 (-1.41%). Year-to-date, LTC has declined -16.91%, versus a 3.40% rise in the benchmark S&P 500 index during the same period."}]}