{"article": [{"url": "https://stocknews.com/news/sq-crwd-lvgo-gsx-4-buy-rated-large-cap-stocks-to-buy-on-dips/", "published": 1601467700.0, "headline": "4 \"Buy Rated\" Large-Cap Stocks to Buy on Dips", "body": "Although stocks have bounced back to start the week, the market has moved lower nearly the entire month of September. Take a close look at the premier large-cap stocks that have suffered setbacks and you will find plenty of buying opportunities. Instead of investing hour after hour sorting through the seemingly endless number of large-cap stocks, let our team do the work for you. We have whittled down the large-caps to four that are particularly appealing following challenging Septembers. Let’s take a look at Buy rated large-caps to add to your portfolio following the September swoon: Square (SQ), CrowdStrike Holdings (CRWD), GSX Techedu (GSX), and Livongo Health (LVGO). Square (SQ) 7 Best ETFs for the NEXT Bull MarketYou will be hard-pressed to find a stock with better long-term prospects than SQ. SQ is at the forefront of the transition from local brick-and-mortar businesses to the web. Furthermore, SQ’s Cash App is emerging as one of the leading money transfer tools around. SQ dropped down to $137 earlier this month and has since moved up to the $160s. However, the stock is still priced lower than it was around one month ago. The POWR Ratings show SQ has A grades in all POWR Components. SQ is ranked third of more than 200 stocks in the Financial Services (Enterprise) category. SQ’s price returns are in the green in each period. Even if the market dips once again in October, SQ is worth owning simply because mobile payments are on the rise. SQ is a legitimate payment processing disruptor, set to expand its customer base with each passing year as more and more businesses and payments shift to the internet. Furthermore, SQ will launch its own industrial loan company in ’21 to provide loans and direct deposits through its Cash App. Every investor should own SQ. CrowdStrike Holdings (CRWD) CRWD was priced at $143 to start the month, dipped to $125, and is currently trading around $137. CRWD is quite an intriguing stock for reasons beyond its recent price decline. CRWD provides important endpoint protection, safeguarding against cyberattacks to keep networks up and running. CRWD has A grades in two of the four POWR components (Trade Grade and Peer Grade). CRWD also has a solid B Buy & Hold Grade. TipRanks reports the average analyst price target for CRWD is $149.55, indicating the stock has at least an 8% upside remaining. CRWD recently acquired Preempt Security to bolster its cybersecurity offerings with another important module. This is a good example of how CRWD grows with the addition of customers as well as the implementation of new digital security modules. As many more people shift to the web for work, cybersecurity services provided by the likes of CRWD will prove even more important. Look for CRWD’s quarterly growth rate of nearly 85% to climb even higher in the months to come. The little-known truth is CRWD only has about 5% of the endpoint digital security market, meaning there is still plenty of market share to capture. GSX Techedu (GSX) Education is shifting away from in-school instruction toward the web, empowering students to learn from home. GSX is a specialist in tech-driven learning, providing kindergarten through grade 12 courses on the web. Furthermore, GSX also provides professional and foreign language courses to boot. The POWR Ratings show GSX has an A Peer Grade, a B Trade Grade, and solid Buy & Hold and Industry Rank grades. GSX is ranked second of nearly 30 stocks in the Outsourcing – Education Services category. GSX was priced at $94 to start September yet slid down to the $70s. The stock has bounced back to the $90s yet it has the potential to undulate once again, possibly back down to the $70s. Rumors have swirled that GSX reported more sales and user accounts than it had in prior quarters. However, the company has not admitted to such exaggerations. Furthermore, the accusations have not been proven. GSX should continue to inch upward as the pandemic steers that many more students toward online learning. Livongo Health (LVGO) LVGO was priced around $140 to start the month. The stock fell to $121 in September and has since moved back toward the price level it was at to start the month. Investors did not like the company’s merger with Teladoc. LVGO uses tech and data science to better monitor and treats those who suffer from chronic conditions. The POWR Ratings reveal LVGO has A grades in the Peer Grade and Trade Grade components. LVGO has B grades in the remaining POWR Components. LVGO is ranked in the top 15 of 70 publicly traded companies in the Medical – Services category. If a second wave of the virus appears this fall, LVGO will benefit as the company has merged with Teladoc, a company that provides medical analysis and advice through videoconferencing. Furthermore, many more people will tap into the power of LVGO’s digital health platform if the virus returns in the form of a second wave as we transition to the new year. Want More Great Investing Ideas? Do NOT Buy Stocks Before the Election! 7 “Safe-Haven” Dividend Stocks for Turbulent Times Chart of the Day- See Christian Tharp’s Stocks Ready to Breakout SQ shares were trading at $162.86 per share on Wednesday afternoon, down $1.95 (-1.18%). Year-to-date, SQ has gained 160.33%, versus a 5.43% rise in the benchmark S&P 500 index during the same period."}]}