{"article": [{"url": "https://stocknews.com/news/spy-inx-dia-iwm-qqq-2-step-process-to-sell-market-top/", "published": 1597838900.0, "headline": "2 Step Process to Sell @ Market Top in September", "body": "(Please enjoy this updated version of this week’s commentary from the Reitmeister Total Return newsletter). As previewed in our recent commentary there was little doubt that the market was going to touch the all time high. That took place today in an odd session where basically the usual suspect FAANG + Tesla type stocks were on the rise pushing the S&P and Nasdaq higher. However, the broader market was very Risk Off as best represented by the nearly -1% decline of the Russell 2000. Heck, even the Dow was in the red. What does it all mean? And what is the trading plan from here? 9 \"BUY THE DIP\" Growth Stocks For 2020The answers await you below… Market Commentary The sector rotation discussed last week did continue onward. And as suspected it was a 360 degree rotation with investors flocking back to the same names that were their favorites beforehand. I am referring to the top tech and growth stocks. And also precious metals. Gladly we did not buckle under the pressure of the rotation and stayed firmly entrenched in these same names with serious outperformance as our reward. In fact, our the Reitmeister Total Return portfolio rallied +4.06% since last Tuesday’s commentary. (More details on performance in the Portfolio Summary section below). After most sector rotation periods you see the overall market continue in the same direction it was headed before it started. That is why we saw stocks pushing higher and finally eclipsing the all time highs at 3,393 to a new mark of 3,395. After that stocks slinked into the finish line at 3,389.78. My outlook remains the same. That this mini stock bubble will keep blowing up til sometime in September where there are some things stacking up against the market and we will want to get more defensive. Here is the best hits list of those negative elements: September is historically the worst month of the year for stocks with 38 out of the last 70 years in negative territory. That is not a horrifying stat on its own. So what matters is what the environment looks like for that specific September. And as you will see below there are some things stacked up pointing to likely downside. Presidential Election years are VERY unkind to stocks starting in September. We covered that in detail in our 8/3/20 Members Only Webinar. I suspect stocks will fall into this same pattern. Students returning to school could cause a new spike in coronavirus cases. There are signs of that potential already coming from the University of North Carolina that saw a scary outbreak leading to all classes being online only. As the father of two college age daughters I am very aware of these things as they are set to return to school over the next couple weeks. The spike in economic data from pent up demand is starting to run out of steam and investors should be faced with more negative reports. Let’s talk more about this one below. Consumer Sentiment continues to be very low and is usually a good predictor of future buying behavior. On Friday we got the latest reading coming in at 82.5 for current conditions. Remember that below 100 is consider negative. And 82.5 is truly a horrifying number. But for as bad as that is the Expectations of the future component is at 66.5. Meaning the view of the future is MUCH WORSE. And that typically is a sign of lower consumer spending going forward. Another sign of the temporary spike in economic data rolling over and ready to show signs of weakness was on display in yesterday’s Empire State Manufacturing report. That declined from 17.2 in the last reading to 3.7 now. But more importantly, the forward looking New Orders component fell back into negative territory. I believe there will be more and more reports like this showing that the initial spike in demand after the re-opening of the economy will fade with more negative readings befitting the recession and maybe depression we are truly in. And lastly, something that we spoke about last week that demands repeating given how far reaching I believe this economic data point is for the overall economy: “…this morning the NFIB Small Business Optimism Index came in lower than expected. But most importantly see the full take by TradingEconomics.com with the key sections highlighted in bold by me. “The NFIB Business Optimism Index in the United States fell to 98.8 in July of 2020 from 100.6 in the previous month, as coronavirus cases continue to rise across the country. The outlook for general business conditions over the next six months deteriorated 14 points to 25, and the percentage of owners thinking it’s a good time to expand dropped 8 points to 5 percent. In addition, the Uncertainty Index increased seven points to 88. “Owners continue to temper their expectations of future economic conditions as the COVID-19 public health crisis is expected to continue”, NFIB’s chief economist said.” Yes, only 5 percent of small business owners believe that now is a good time expand. And as you likely know small business owners are traditionally the key drivers of the economic growth and job creation. This report doesn’t look good for those claiming an economic recovery is at hand. And stocks are at the all time highs because what???” This gets us back to our trading strategy where I shared last week that we intend to get more defensive in 2 steps. “First step = take profits off the table of the most Risk On positions. Second step = add inverse ETFs to profit from market downside. But no sense buying them until there is some sign that indeed other investors are willing to concede to the weak fundamentals. Or fall into the Presidential Election sell off pattern. So this move is contingent on seeing early signs of an actual sell off forming.” Let’s talk a tad more about that first step. As the saying goes…nobody rings a bell at the top. And thus, it is hard to say when the perfect moment to take profits will arise. Likely it will happen at the moment of greatest euphoria. When it truly seems that the ONLY direction for stocks is up. And yes, that will be the most difficult moment to sell. But that is what I am shooting for. Yes, easier said than done. First, because it is hard to sell at those moments as you always wonder if there is another puff or two of hot air that will go into the bubble before it pops. And then there is the idea that other folks may have the same plan. That they want to take money off the table before Mr. Market screams “Jenga!” and everything comes toppling down. So don’t expect perfection as that is rarely attainable in investing. Think of this like a 50 foot putt in golf. Our goal is to get within 3 feet for an easy tap in. If we happen to sink it on just one stroke then we will consider ourselves truly blessed. As for step 2, when we buy inverse ETFs to settle back in our defensive hedge, the timing of that should be a notch easier. That is because we are going to wait for the market to show its hand with some clear sign of sell off. Still not an exact science, but I so strongly believe this “irrational exuberance party” is about to run out of steam that I would rather jump at the first sign then miss it entirely. Adding it altogether we continue to ride the stock market bubble to new heights. The main difference between us and other investors is that we are FULLY aware that it is a bubble and are ready to get out in time to actually profit from its eventual decline. Portfolio Update The start of the sector rotation 8/7 to 8/11 was rather unkind to our portfolio. But as recommended it was best to stay the course as quite often it is a 360 degree rotation and the market action comes right back to you. Sure enough that’s what happened including a glorious outperformance on Thursday when we gained +1.68% versus -0.20% for the S&P. Monday was almost as good with our portfolio swelling +1.55% handily beating the +0.27% for the S&P. And today was not too shabby at +0.51%. Adding it altogether we gained +4.06% since last Tuesday’s commentary handily beating the market averages. Trading Strategy Right now my Reitmeister Total Return portfolio is positioned based upon the theory that we are in the midst of a mini stock bubble that will likely end as soon as September Of the 11 stocks and ETFs on board I am overweight technology and precious metals. Plus 3 stocks that are uniquely positioned in both a Coronavirus fueled recession and when things get back to normal. Few stocks check both those boxes…but these 3 stocks certainly do which is why they are all serious outperformers of late. At this stage I am sleeping with one eye open awaiting for the party to be over with 20%+ correction quite likely in store. Why? For the 4 key reasons shared earlier in this article from softening economic data to negative effects of the Presidential election cycle to likely spike in Coronavirus cases as students return to school. The plan is to bag gains on all the big stock winners and switch over to inverse ETFs as the best route to profits. Meaning if the market is going to tank then going to cash is nice…but inverse ETFs are going to be the best trade in town. But let’s be honest with ourselves. Its crazy out there! That’s why I am trying my best to help investors make sense of it all and profit from whatever scenario comes our way. The best way for me to do that is give you 30 days access to the Reitmeister Total Return. This is my newsletter service where I share more frequent commentaries on the market outlook, trading strategy, and yes, a portfolio of hand selected stocks and ETFs to produce profits whether we have a bull…a bear…or anywhere in between. As shared above, the unique portfolio I have constructed at this time leans into the stocks that are benefiting the most from the current bubble. That explains how we continue to top the market at this time. Yet we are FULLY prepared for when the rug gets pulled out and stock prices better reflect the still dire economic situation. Just click the link below to see all 11 stocks and ETFs in this uniquely successful portfolio. Plus get ongoing commentary and trades to adjust your strategy as 2020 continues to the wildest market in history. Gladly it can be tamed. About Reitmeister Total Return newsletter & 30 Day Trial Wishing you a world of investment success! Steve Reitmeister …but everyone calls me Reity (pronounced “Righty”) CEO, Stock News Network and Editor, Reitmeister Total Return SPY shares were trading at $338.42 per share on Wednesday afternoon, down $0.22 (-0.06%). Year-to-date, SPY has gained 6.23%, versus a % rise in the benchmark S&P 500 index during the same period."}]}