{"article": [{"url": "https://stocknews.com/news/iipr-iipr-adds-another-tenant-with-their-latest-14-million-dollar/", "published": 1595419700.0, "headline": "IIPR Adds Another Tenant with Their Latest $14 Million Dollar Deal", "body": "Innovative Industrial Properties (IIPR) has been on an acquisition spree over the past few years and there may be no end in sight. The company announced this week that it has expanded its portfolio by adding two cannabis facilities in New Jersey. The first facility is an industrial building roughly 50,000 square feet in size along with a retail location totaling roughly 4,000 square feet. The company paid approximately $12.4 million for both properties by closing a sale-leaseback agreement with a subsidiary of Columbia Care. The way this works is that IIPR acquired the cultivation facility site for cash and then immediately leased the property back to Columbia. IIPR has agreed to provide Columbia Care with up to $1.6 million in reimbursements for improvements to the property. The company plans to continue to operate the retail property as a regulated medical-use cannabis dispensary and the industrial property as a regulated medical-use cannabis cultivation and processing facility. 7 \"SAFE HAVEN\" Dividend Stocks for Turbulent TimesColumbia Care is a perfect tenant for IIPR as they focus heavily on the medical cannabis sector. The company sells medical and adult-use cannabis products and related services in 18 jurisdictions in the United States and the European Union. Columbia Care is one of the largest and most experienced providers of medical cannabis in the United States. President and Chief Executive Officer of IIPR Paul Smithers said, “Columbia Care is one of the preeminent cannabis operators in the United States, and we are thrilled to introduce them as a new tenant partner. As one of the largest cannabis operators, Columbia Care is dedicated to providing the highest quality products and services to patients and customers, and we look forward to supporting them as a long-term real estate capital partner in New Jersey, including providing the additional real estate capital for further enhancements to their cultivation and processing facility,” Nicholas Vita, the CEO of Columbia Care also had some enthusiastic remarks regarding the transaction, “Partnering with IIPR provides Columbia Care with access to non dilutive capital that offers flexibility and provides us with the ability to continue to build and expand our cultivation, manufacturing, and retail capabilities in the markets that matter most.” I look forward to watching IIPR continue to expand and execute as they further cement themselves in the cannabis sector. Want More Great Investing Ideas? 9 “BUY THE DIP” Growth Stocks for 2020 Newly REVISED 2020 Stock Market Outlook 7 “Safe-Haven” Dividend Stocks for Turbulent Times IIPR shares were unchanged in premarket trading Wednesday. Year-to-date, IIPR has gained 28.19%, versus a 1.88% rise in the benchmark S&P 500 index during the same period."}]}