{"article": [{"url": "https://stocknews.com/news/ea-ttwo-atvi-3-best-video-game-stocks-for-the-remainder-of-2020/", "published": 1595506100.0, "headline": "3 BEST Video Game Stocks for the Remainder of 2020", "body": "The video game sector was flourishing even before the coronavirus pandemic. In the Newzoo’s Global Games Market Report, approximately 2.5 billion gamers worldwide spent more than $150 billion on games in 2019. And the future looks bright for this industry; video game revenue is expected to climb to $300 billion within five years. And this projection could possibly even get bigger due to people sheltering in place because of Covid-19. 9 \"BUY THE DIP\" Growth Stocks For 2020Here are three video game stocks to own for the rest of the year. Electronic Arts, Inc. (EA) EA is a major video game developer and distributor, publishing games in various genres. It also provides advertising and licensing services, as well as engages in third-party distribution. EA is the maker and distributor of popular games such as FIFA, Need for Speed, Madden NFL, and Star Wars Jedi. With lockdowns forcing millions of people to stay at home, the popularity of video games as a major form of remote entertainment has risen. EA’s digital bookings increased 9% year over year for the fiscal year 2020 that ended on March 31st, and now represents 78% of total net bookings. Quarterly revenues increased by more than 14% year over year, while net income rose by 100% to $418 million. According to Mordor Intelligence, the global gaming market expected to grow at a CAGR of 9.17% to reach a value of $256.97 billion by 2025. And being one of the major players in the gaming market, EA should significantly benefit from this growth. EA’s consensus EPS estimate of $0.76 for the quarter ending June 2020 indicates a year-over-year increase of 204%. Moreover, you should note that the company has surpassed EPS estimates in each of the last four quarters. The consensus revenue estimate of $1.04 billion also indicates a year-over-year rise of 44.1%. EA gained more than 65% in value since its 52-week low of $85.69 in mid-March due to the pandemic driven crash. How does EA stock up on our POWR Ratings? A for Trade Grade A for buy & Hold Grade A for Peer Grade B for Industry Rank A for Overall POWR Rating You can’t ask for better. EA is also ranked #2 out of 13 stocks in the Entertainment – Toys & Video games industry. Take Two Interactive Software, Inc. (TTWO) TTWO develops and markets interactive gaming and entertainment solutions under Rockstar Games, 2K labels, private division, and social point labels. TTWO’s games are designed for console gaming systems, as well as computers and smartphones. Amid the pandemic and social distancing regulations, the e-Sports audience is expected to grow to 495 million globally this year. The audience is expected to grow at a CAGR of 10.4% through 2023 to reach 646 million. As one of the major players in this industry, TTWO has massive growth potential in the upcoming years. The consensus EPS estimate for the about-to-be-reported quarter indicates a year-over-year increase of more than 492%. Moreover, TTWO beat the consensus EPS estimates in three out of the trailing four quarters. TTWO has gained 54% since hitting its 52-week low of $100 on March 23rd. In fact, the momentum helped the stock hit its 52-week high of $156.32 on July 21st. TTWO is rated a “Strong Buy” in our POWR Ratings, consistent with its impressive performance in the first half of 2020. It has an “A” in Trade Grade, Buy & Hold Grade and Peer Grade, and “B” in Industry Rank. Out of 13 stocks in the Entertainment – Toys and Video Games industry, TTWO is ranked #3. Activision Blizzard, Inc. (ATVI) ATVI develops and distributes content and services on video game consoles, personal computers (PC), and mobile devices in the Americas, Europe, the Middle East, Africa, and the Asia Pacific. Operational since 1979, the most famous product franchises owned by ATVI include Call of Duty, World of Warcraft, Diablo, Hearthstone, Overwatch, and Candy Crush. ATVI’s GAAP net revenues from digital sales channels increased by almost 4% year over year in the first quarter. The company’s quarterly net booking also increased by 20.6% during this period. The consensus EPS estimate for the second quarter indicates a 76% year-over-year increase. The market also expects ATVI’s revenue to increase by 39.1% year over year. ATVI hit its year-to-date low of $59.38 in mid-March, but the stock managed to gain more than 36% since then. ATVI is rated a “Strong Buy” stock in our POWR Ratings system, with an “A” in Trade Grade and Buy & Hold Grade, and a “B” in Peer Grade and Industry Rank. It is the #1 ranked stock out of 13 in the Entertainment – Toys and Video games industry. Want More Great Investing Ideas? 9 “BUY THE DIP” Growth Stocks for 2020 Newly REVISED 2020 Stock Market Outlook 7 “Safe-Haven” Dividend Stocks for Turbulent Times EA shares were unchanged in after-hours trading Thursday. Year-to-date, EA has gained 25.90%, versus a 1.38% rise in the benchmark S&P 500 index during the same period."}]}