{"article": [{"url": "https://stocknews.com/news/hd-shw-mas-fbhs-after-a-significant-rally-are-shares-of-home-depot-still/", "published": 1599653300.0, "headline": "After a Significant Rally, are Shares of Home Depot Still a Buy?", "body": "Home Depot Inc. (HD) is the largest home improvement company in the United States, with a 29% market share, as of 2019. HD sells its products to do-it-yourself customers and professionals through 2,293 retail stores across 50 states. The home improvement industry saw surging demand during the pandemic, as the stay-at-home norm led many people to undertake home renovation projects. Recent research from consumer specialists and home projects council states 57% of homeowners have focused on home improvement over the first three months of the COVID crisis. This bolstered the earnings and revenue of HD in the second quarter that ended in July 2020, thereby allowing the stock to soar 23.3% year-to-date. Recent price performance, impressive financials, and business expansion plans allowed the company to generate higher profits during the pandemic-induced recession. These factors combined with the potential upside of HD in the upcoming months has helped the stock earn a Buy rating in our proprietary rating system. 7 Best ETFs for the NEXT Bull MarketHere’s how our proprietary POWR Ratings system evaluates HD: Trade Grade: A HD is currently trading above its 50-day and 200-day moving averages of $268.69 and $234.21, respectively, signaling an uptrend in the stock. The stock returned 32.4% over the past six months, indicating a solid short-term bullishness. HD delivered impressive financials in the fiscal second quarter of 2020 that ended in August 2020, which bolstered the stock’s short-term performance. Net sales increased 23.4% year-over-year to $38.10 billion, while net earnings grew 22.8% from the same period last year to $4.3 billion. Gross profit rose 24.1% to $12.94 billion. HD undertook several expansion projects recently to facilitate the increase in demand during the pandemic. On August 4th, it revealed the development of three new distribution centers in Georgia, for flexible delivery to customers. It also plans to open a Flatbed delivery center and order fulfilment operation center by 2021. The company increased its investments in outdoor power categories earlier in July, and aims to rollout the same in approximately 1,300 U.S. stores by the end of 2020. These projects are expected to increase HD’s turnover and revenue over the long run, thereby ensuring sustained growth of the company in the upcoming years. Industry Rank: A The Home Improvement & Goods industry is ranked #20 out of 123 industries in the StockNews.com universe. The rising demand for home improvement products and building materials have resulted in impressive performance of this industry recently, as the industry’s consolidated sales grew 22.6% year-over-year. With the-work-and-learn-from-home trend here to stay amid increasing coronavirus cases across the country, the industry is well positioned to grow. Buy & Hold Grade: B In terms of proximity to its 52-week high, which is a key factor that our Buy & Hold Grade takes into account, HD is well positioned. It is currently trading just 8.4% below its 52-week high of $292.95. HD hit its 52-week high on August 27th. HD gained more than 80% over the past three years with solid growth in earnings and revenues. The company’s revenue and net income grew at a 3-year CAGR of 7% and 12%, respectively. Diluted EPS grew at a CAGR 16.2% during this time period, while leveraged free cash flow improved at a CAGR 19.8%. Peer Rank: B HD is currently ranked #12 out of 68 stocks in the Home Improvement & Goods industry. Other prominent companies in this industry include Sherwin-Williams Company (SHW), Masco Corporation (MAS) and Fortune Brands Home & Security, Inc. (FBHS). FBHS’s year-to-date gain of 25.8% is slightly higher than HD’s 25.5%, while SHW and MAS returned 15.5% and 17.7%, respectively. Overall POWR Rating: B (Buy) Overall, HD is rated a Buy due to its impressive past performance, short-and-long-term bullishness, and solid price momentum, as determined by the four components of our overall POWR Rating. Bottom Line Despite growing more than 25% this year, HD has the potential to grow even further based on its business expansion plans, favorable earnings, revenue outlook and industry strength. Out of the 32 Wall Street analysts that have rated the stock, 16 rated it as Strong Buy. It has an average broker rating of 1.47, indicating favorable analyst sentiment. The consensus EPS estimate of $2.95 for the third quarter ending October 2020 indicates a 16.6% growth year-over-year. The consensus revenue estimate of $31.13 billion indicates a 14.3% improvement from the same period last year. Hence, HD is well positioned to gain significantly in the upcoming months. Want More Great Investing Ideas? 7 Best ETFs for the NEXT Bull Market Will Stocks Fall into Historical September Slump? 9 “BUY THE DIP” Growth Stocks for 2020 HD shares were trading at $278.57 per share on Wednesday afternoon, up $9.31 (+3.46%). Year-to-date, HD has gained 29.86%, versus a 7.20% rise in the benchmark S&P 500 index during the same period."}]}