{"article": [{"url": "https://stocknews.com/news/splk-mdb-ayx-estc-tlnd-5-big-data-stocks-to-up-your-returns/", "published": 1594987700.0, "headline": "5 Big Data Stocks to Up Your Returns", "body": "Big Data refers to data that is so massive or complex that processing it using conventional methods is impossible. Data is considered one of, if not the world’s most valuable commodity. There are three types of Big Data: Volume refers to the amount of date, Velocity is the fast rate at which the data is received, and Variety refers to the many different types of date that are available. Most businesses are now powered by data. The value in data is what a business can do with it. Data can be used to address business problems that companies wouldn’t have been able to deal with before. Companies can also take data and use it for cost reductions and new product development. New trends have created an immense need for Big Data. Technologies such as cloud computing and the Internet of Things (IoT) require a lot of data. Data powers our smartphones and computers. Right now, online education and working from home have created a massive need for data. Over the long-term, new technologies will continue to require a lot of data. This offers an opportunity for investors to buy Big Data stocks to profit in the short and in the long-term. 7 \"SAFE HAVEN\" Dividend Stocks for Turbulent TimesHere are five stocks in the Big Data industry that could amp up your portfolio: Splunk, Inc. (SPLK) SPLK allows companies to monitor, analyze, and visualize big data gathered from diverse sources such as servers, websites, networks, and mobiles, through its cloud services and software. SPLK recently released Splunk Remote Work Insights, which is a way for companies to gain information and insight into the systems on which their employees are working remotely. With the spread of the coronavirus and the rise of remote working, this new offering could be a gamechanger for the company. For the quarter ended April 2020, Splunk announced that its cloud revenue was up 81%, and total annual recurring revenue (“ARR”) was up 52% year over year. This could signal a coming period of high growth for the big data service provider. SPLK has an impressive earnings surprise history with the company surpassing consensus EPS estimates in three of the trailing four quarters. The stock has gained more than 100% since hitting its 52-week low of $93.92 on March 16 due to the wider stock market crash caused by the coronavirus. How does SPLK stack up for the POWR Ratings? A for Trade Grade A for Buy & Hold Grade A for Industry Rank A for Peer Grade A for overall POWR Rating You can’t ask for better. The stock is also ranked #6 out of 82 stocks in the Software- Application Industry. MongoDb, Inc. (MDB) MDB operates a general-purpose database platform that is meant for enterprises. The company has recently launched MongoDB 4.4, which is the first cloud-to-mobile experience ever. This new offering from the company allows developers to work without data silos and fragmented APIs. With the increasing shift of enterprises to the cloud, this development could lead to bigger gains for MDB. MDB also recorded a strong performance for the quarter ending April 2020. The company’s total revenue rose 46% year over year with subscription revenue forming the biggest factor by rising 49% year over year. MDB’s earnings surprise history is impressive, with the stock beating consensus EPS estimates in each of the trailing four quarters. MDB hit its 52-week low of $93.81 this year in March due to the overall dip in the stock market but has recorded an impressive rise of more than 120% since. It’s no surprise that MDB is rated a “Strong Buy” in our POWR Ratings system. It also has an “A” for Trade Grade, Buy & Hold Grade, and Industry Rank. In Peer Grade, it’s rated a “B”. In the 82-stock Software- Application industry, it is ranked #11. Alteryx, Inc.(AYX) Alteryx provides a self-service data analysis platform that companies use to make business decisions and enhance the productivity of their analysts. The company recently rebranded itself to emphasize the robotic process automation capabilities of its platforms along with bringing all of its offerings under one roof. Earlier, AYX also added two new features to its platform, the Analytics Hubnew and the Intelligence Suite. Both these new capabilities are designed to help analysts gain greater insights from the available datasets. As big data analysis becomes a must-have for enterprises worldwide, AYX is well-poised to do well in the coming future. For the quarter ending March 2020, AYX delivered a strong performance with a year over year rise in revenue of 43%. The company also gained a slew of new customers, which increased its total by 30% compared to the same period in 2019. Though AYX missed the consensus EPS estimate last quarter, it beat estimates in the prior three quarters. In the mid-March crash, the stock hit a low of $80.00, but it admirably bounced back by around 57%. AYX is rated “Strong Buy” in our POWR Ratings system, consistent with the strength in its business model. It also has an “A” for Trade Grade, Buy & Hold Grade, Peer Grade, and Industry Rank. It is also ranked #13 out of 82 stocks in the Software- Application industry. Elastic N.V. (ESTC) ESTC operates a cloud-based portal that allows users to manage sales forces and gain analytics and metrics to explore sales campaigns and execute them. The company has recently released the Elastic Enterprise Search on the Elastic Cloud. This new offering greatly simplifies the usability of the company’s enterprise-grade search functions. It can be used in conjunction with leading cloud services such as Amazon Web Services, Microsoft Azure, and Google Cloud. By enhancing the flexibility and user-friendliness of their Cloud platform, Elastic could see greater engagement and adoption of their services in the cloud space. For the quarter ending April 2020, the company experienced a 53% year-over-year rise in revenue. Their SaaS platform also performed well with revenue from it growing by 110% year over year. The earnings surprise history for ESTC looks pretty good, as the company beat the consensus EPS estimates in each of the trailing four quarters. ESTC saw a low of $41.3 this year in March; however it has gained close to 100% since then. ESTC’s strong fundamentals are reflected in the POWR Ratings; it has a “Buy” rating with an “A” in Trade Grade and Industry Rank, along with a “B” in Buy & Hold. Within the Software – SAAS group, it’s ranked #4 out of 10 stocks. Talend S.A. (TLND) TLND operates the Talend Data Fabric platform, which works across big data and cloud environments to integrate data and applications. This allows users to develop an integrated view of their business operations and customers. The company recently partnered with HVR Software to further optimize its data processing capabilities. This move will help the company provide its users with real-time data on customers’ end feeds. This new partnership could help Talend towards becoming a market leader in data integration. For the quarter ending March 2020, the company recorded revenue growth of 18% year over year. The company’s revenue from subscriptions was also up by 22% year over year. TLND’s consensus revenue estimate of $66.3 billion for the quarter ending June 2020 indicates a year-over-year increase of 12.6%. Also, TLND beat consensus ESP estimates in each of the trailing four quarters. TLND’s stock prices have risen close to 90% since hitting its 52-week low of $18.30 on April 3. The company is well-poised to continue the momentum. TLND is rated a “Buy” in our POWR Ratings system, consistent with the strength in its business model. It also has an “A” for Trade Grade and a “B” for Industry Rank. It is ranked #23 out of 47 stocks in the Software – Business industry. Want More Great Investing Ideas? 9 “BUY THE DIP” Growth Stocks for 2020 Newly REVISED 2020 Stock Market Outlook 7 “Safe-Haven” Dividend Stocks for Turbulent Times SPLK shares were trading at $200.01 per share on Friday afternoon, up $0.99 (+0.50%). Year-to-date, SPLK has gained 33.54%, versus a 0.83% rise in the benchmark S&P 500 index during the same period."}]}