{"article": [{"url": "https://stocknews.com/news/kars-gdx-tan-ipo-4-etfs-setting-up-for-major-breakouts/", "published": 1600949300.0, "headline": "4 ETFs Setting Up for Major Breakouts", "body": "Since the onset of the pandemic, there has been a huge disconnect between the economy and the stock market. The market has been rallying for the last five months despite the 31.7% drop in GDP in the second quarter. With the unemployment rate being 8.4% and continued weakness in the economy, it’s not surprising that there’s been a market correction. Moreover, the upcoming presidential election and the second wave of coronavirus in many parts of the country are uncertainties for the market. So, investing in individual stocks in the near term could be risky. But you should not ignore the opportunities the market is offering now by investing in a less risky way. Exchange traded funds (ETFs) could help you mitigate the risks to some extent as they provide broad and diversified exposure at minimal costs. Four ETFs that stand to deliver exceptional performance soon are KraneShares Electric Vehicles and Future Mobility Index ETF (KARS), VanEck Vectors Gold Miners ETF (GDX), Invesco Solar ETF (TAN), and Renaissance IPO ETF (IPO). These ETFs can help investors get an all-round exposure to the best performing industries. 7 Best ETFs for the NEXT Bull MarketKraneShares Electric Vehicles and Future Mobility Index ETF (KARS) KARS tracks the index of global stocks that are involved in the production of electric vehicles or other initiatives to enhance future mobility. It focuses on companies engaged primarily in electric vehicle production, autonomous driving, and lithium and/or copper-producing sub-industries. KARS tracks the Solactive Electric Vehicles and Future Mobility Index. The ETF has an MSCI ESG Fund Rating of BBB based on a score of 5.57 out of 10. In terms of sector exposure, the portfolio is heavily weighted toward consumer discretionary and information technology names. The fund holds 57 companies in total with an average market capitalization of $68.9 billion. The top 3 holdings of the fund are Analog Devices Inc (ADI), Texas Instruments Inc (TXN), and Advanced Micro Devices (AMD), with the weights of 3.58%, 3.56% and 3.5%, respectively. The ETF paid an annual dividend of $0.44 last year, which translates into a dividend yield of 1.52%. KARS has an AUM of $28.54 billion and an expense ratio of 0.7%. The electric vehicle market has been strong while the overall auto market is suffering deep losses. Hence, this ETF is all set for a major breakout. KARS closed yesterday’s trading session at $27.88 with a year-to-date gain of 17.9%. The ETF has gained huge momentum in the last six months and is up more than 47% in the same period. How does KARS stack up for the POWR Ratings? A for Trade Grade B for Buy & Hold Grade B for Industry Rank B for Overall POWR Rating. It is ranked #26 out of 107 ETFs in the Global Equities ETFs group. VanEck Vectors Gold Miners ETF (GDX) GDX offers investors exposure to some of the largest gold mining companies in the world, thereby allowing indirect exposure to the rallying yellow metal. Because the profitability of gold miners depends on the prevailing market price for the goods that they sell, these stocks exhibit a strong correlation to movements in spot gold prices. The ETF has the NYSE Arca Gold Miners Index (GDMNTR), which is intended to track the overall performance of companies involved in the gold mining industry, as its underlying benchmark. It’s worth noting that over the past five years the index has risen 178%, significantly outpacing the 61% rise in the gold prices. The ETF has a 56.6% weightage in Canada-based companies, while also being exposed to companies based in the United States, Australia, and South Africa. The top 3 of the 55 holdings by the fund are Newmont Corporation (NEM), Barrick Gold Corp (GOLD), and Franco-Nevada Corp (FNV) with weightings of 11.7%, 11.6%, and 6.2%, respectively. The ETF pays an annual dividend and made a payout of $0.19 last year. GDX has a dividend yield of 0.51%. The fund has $16.05 billion as AUM and an expense ratio of 0.52%. GDX closed yesterday’s trading session at $37.63, gaining 28.5% so far this year. The ETF has gained huge momentum during the pandemic and is up more than 54.4% in the last six months as easy monetary policy and economic uncertainty are typically favorable for gold. GDX is rated a “Buy” in our POWR Ratings system. It holds an “B” in Trade Grade and Industry Rank. It is ranked #16 out of 35 ETFs in the Precious Metals ETFs group. Invesco Solar ETF (TAN) TAN is a leveraged ETF that provides investors exposure to renewable energy by holding a concentrated portfolio of companies involved in the solar industry. Thus, it cuts out much of the broader renewable energy market covered by its benchmark. TAN delivers targeted exposure to solar power, making it potentially useful for both betting on long-term adoption of this energy source or capitalizing on perceived short-term mispricing. The investment objective of TAN is to provide investment results that correspond to the price performance of the MAC Global Solar Energy Index, which is designed to provide exposure to companies listed on exchanges in developed markets that derive a significant amount of their revenues from business segments of the solar industry. The index has a long track record in the industry as it is the first solar index for the exchange traded fund industry with an inception date of March 31, 2008. According to Bloomberg, solar and wind made up the majority of new power generation in the world last year. Moreover, the use of wind and solar for electric power doubled in the last five years, which underscores the ability for renewable energy sources to thrive amid an economic downturn. TAN overweighs the United States and Hong Kong, while favoring smaller firms. The fund exposes 55% and 15.5% to the United States and Hong Kong, respectively, followed by 8.6% weightage to China. The top 3 holdings of the fund are SolarEdge Technologies Inc (SEDG), Enphase Energy Inc (ENPH), and Sunrun Inc (RUN) with 9.9%, 8.5%, and 7.7% weights, respectively. TAN has an AUM worth $1.25 million and an expense ratio of 0.71%. The ETF paid a dividend of $0.09 last year, which translates into a dividend yield of 0.16%. TAN closed yesterday’s trading session at $56.29 with a year-to-date gain of 82.8%. The ETF has gained huge momentum in the last six months and is up more than 125% in this period because of the rising solar additions in the recent years. TAN is rated a “Strong Buy” in our POWR Ratings system, with an “A” in Trade Grade, Buy & Hold Grade and Peer Grade. Out of 36 ETFs in the Energy Equities ETFs group, TAN is rated #7. Renaissance IPO ETF (IPO) IPO is an actively managed ETF that invests in US-listed companies that have recently gone public. It holds the largest, most liquid newly-listed public companies and adds a new company to its basket within 90 days of listing and removes a firm after two years of public trading. The IPO ETF has an MSCI ESG Fund Rating of B based on a score of 2.51 out of 10. IPO seeks to replicate the price and yield performance of the Renaissance IPO Index, which is a portfolio of companies that have recently completed an initial public offering (“IPO”) and are listed on a US exchange. IPO has the largest exposure to Zoom Video Communications Inc (ZM) with a weightage of 11.7%. This is followed by a weight of 8.5% and 6.8% in Uber Technologies Inc (UBER) and CrowdStrike Holdings Inc (CRWD), respectively. The ETF has a sectoral weightage of 46% in technology, 19% in healthcare, and 16% in consumer discretionary. The ETF has an expense ratio of 0.6% and an AUM worth $192.3 thousand. It has a dividend yield of 0.25%. It declared a dividend of $0.07 in March this year, increasing its payout by 3.1%. The primary market is very hot right now and is starting to pick up. IPO closed yesterday’s trading session at $50.62, gaining 63.2% year-to-date. The ETF is up more than 92% in the past six months. It’s no surprise that IPO is rated a “Strong Buy” in our POWR Ratings system. It also has an “A” for Trade Grade and Buy & Hold Grade, and a “B” for Peer Grade. IPO is ranked #2 out of 4 ETFs in the IPO ETFs group. Want More Great Investing Ideas? 7 Best ETFs for the NEXT Bull Market Is the Stock Market Correction Over? Chart of the Day- See the Stocks Ready to Breakout KARS shares were trading at $28.15 per share on Thursday afternoon, up $0.37 (+1.33%). Year-to-date, KARS has gained 19.48%, versus a 2.41% rise in the benchmark S&P 500 index during the same period."}]}