{"article": [{"url": "https://stocknews.com/news/azn-nvax-jnj-top-3-stocks-racing-to-discover-a-covid-19-vaccine/", "published": 1594296500.0, "headline": "Top 3 Stocks Racing to Discover a Covid-19 Vaccine", "body": "The COVID-19 pandemic has affected roughly 12 million people and caused more than 548,000 deaths worldwide. The virus sparked an economic downturn and created health crises in many countries. Now companies are in a race to find a vaccine. There are currently 135 vaccines in preclinical trials and twenty that are being tested on humans. Each company is trying to speed up the clinical trial process to be the first with a vaccine. The company with the first successful vaccine will reap the rewards of profit and worldwide recognition. Although developing a vaccine is a time-consuming process involving multiple trials, three companies are well-positioned to manufacture these vaccines on a large scale, once approved. As far as R&D, these three companies are ahead of the pack. 7 Best ETFs for the NEXT Bull MarketAstraZeneca PLC (AZN) AZN’s collaboration with the University of Oxford has helped the biopharmaceutical company take the lead in the race to find a Covid-19 vaccine. The vaccine named AZ1222 is made from a weakened adenovirus that causes infections in Chimpanzees. The Phase 3 study, which focuses on investigating the vaccine’s efficacy, was initiated in June with ongoing enrollments in South Africa and Brazil. AZN signed an $87 million deal with Emergent (EBS) in June to help boost the company’s manufacturing capabilities. Although no data has been released as of yet by researchers, if the trials go well, AZN could have a vaccine ready by the end of the year. AZN has a dividend yield of 3.48%, with a payout ratio of 50.8%. The stock has returned 35.7% over the past year and is up 10.9% year to date. The company has a return on equity of 33.97% and a debt-equity ratio of 1.32 as of the first quarter. AZN also recorded a 15.7% year-over-year increase in revenue over the same period. How does AZN stack up for the POWR Ratings? A for Trade Grade A for Buy & Hold Grade A for Peer Grade B for Industry Rank A for overall POWR Ratings It ranks #4 out of 213 stocks in the Medical-Pharmaceuticals Industry Novavax, Inc. (NVAX) NVAX shares jumped 30% after the company announced $1.6 billion in funding from Operation Warp Speed, a U.S. government program that aims to begin delivering millions of doses of a safe, effective vaccine for COVID-19 in 2021. This should help facilitate the late-stage clinical trial process of NVAX’s Covid-19 vaccine. NVAX’s acquisition of Praha Vaccines and deals with the Coalition for Epidemic Preparedness Innovations (CEPI) and Emergent Bio (EBS), has helped strengthen its manufacturing capacity. The company’s vaccine is a recombinant nanoparticle vaccine that includes NVAX’s proprietary Matrix‑M adjuvant to enhance immune responses. The results of its phase 1 trial is expected this month. Phase two trial is expected to be conducted in multiple countries, including the U.S. NVAX also has two non-COVID vaccine projects in phase 3 clinical trials. NVAX’s stock has returned 1816.2% over the past year and is up 2369.9% year to date. Analysts have an average price target of $101.20. NVAX has a Buy rating in our POWR Ratings system. It has a grade of A for all POWR components except Buy & Hold, where it grades a B. In the Biotech industry, the stock is ranked #15 out of 338 stocks. Johnson & Johnson (JNJ) JNJ signed a $480 million deal with Emergent BioSolutions (EBS), which should facilitate the production of its recombinant DNA vaccine shot. The company plans to conduct its randomized placebo-controlled initial phase study in the U.S and Belgium during the second half of July. The company is already planning its phase 3 clinical trials with the National Institute of Allergy and Infectious Diseases (NIAID) ahead of schedule, w contingent on approval of its phase 1 studies. JNJ’s collaboration with Janssen and Biomedical Advanced Research and Development Authority (BARDA) will help accelerate vaccine development. The company’s deal with Catalent Pharma Solutions (CTLT) will also help ramp up its vaccine production infrastructure. JNJ, an Operation Warp Speed finalist, is also expected to receive $456 million in aid from the U.S. government. With a market cap of $377.46 billion, JNJ has a higher market value than 99.82% of stocks in the U.S. The stock has an average analyst price target of $164.60, a dividend yield of 2.83%, and a payout ratio of 45.5%. In the first quarter of this year, the company reported a 54.6% year-over-year increase in net income and a 56.1% year-over-year increase in earnings per share. JNJ has a Buy rating in the POWR Ratings system with B grades in all of the components that make up the POWR Ratings. Want More Great Investing Ideas? 9 “BUY THE DIP” Growth Stocks for 2020 Is the Bull S#*t Rally FINALLY Over? 7 “Safe-Haven” Dividend Stocks for Turbulent Times Top 3 Investing Strategies for 2020 AZN shares were trading at $53.97 per share on Thursday afternoon, down $0.22 (-0.41%). Year-to-date, AZN has gained 10.40%, versus a -1.40% rise in the benchmark S&P 500 index during the same period."}]}