{"article": [{"url": "https://stocknews.com/news/twlo-estc-dt-evbg-will-shares-of-twilio-continue-to-skyrocket/", "published": 1601640500.0, "headline": "Will Shares of Twilio Continue to Skyrocket?", "body": "Twilio Inc. (TWLO) provides a cloud communications platform that enables developers to build, scale, and operate communications within software applications in the United States and internationally. Its customer engagement platform provides a set of application programming interfaces that handle the higher-level communication logic needed for nearly every type of customer engagement, as well as enable developers to embed voice, messaging, and video capabilities into their applications. TWLO powers communications for the contact tracing initiatives as well. Its customer base includes the Illinois Department of Innovation & Technology and the Department of Information Technology & Telecommunications of New York City. The demand for TWLO’s product portfolio has increased exponentially since the onset of the pandemic. Total revenue of $401 million, in the second quarter, was up 46% year-over-year. However, a loss of $0.71 per share remained relatively stable compared to the previous year. TWLO has recently announced a major expansion of the company’s Internet of Things (IoT) offerings with the launch of Microvisor, an IoT connectivity and device management platform that offers embedded developers a one-stop-shop for building connected devices, keeping them secure, and managing them through their lifetime. 7 \"SAFE HAVEN\" Dividend Stocks for Turbulent TimesWith robust growth in the digital mode of working and learning, the stock has gained 161.5% year-to-date. This impressive performance and the potential upside based on several factors have helped it earn a “Buy” rating in our proprietary rating system. Here is how our proprietary POWR Ratings system evaluates TWLO: Trade Grade: A TWLO is currently trading higher than its 50-day and 200-day moving averages of $249.16 and $169.77, respectively, indicating that the stock is in an uptrend. The stock’s 12.8% return over the past three months reflects short-term bullishness. TWLO added nearly 10,000 new users during the quarter, growing 23.6% year-over-year to 200,000 active customers on its platform. TWLO’s ability to drive growth and generate incremental revenue depends, in part, on the company’s ability to maintain and grow its relationships with existing active customer accounts. The dollar-based net expansion rate for active customer accounts came in at 132% for the last reported quarter. Moreover, Twilio SendGrid, an email application programming interface (API), crossed a new milestone in the last quarter, surpassing three trillion processed emails since inception. Buy & Hold Grade: B TWLO is well positioned in terms of proximity to its 52-week high, which is a key factor that our Buy & Hold Grade takes into account. The stock is currently trading 11% below its 52-week high of $288.81. TWLO has recently announced platform enhancements that help fast forward companies’ digital acceleration. Recent research from Twilio reveals that 97% of enterprises have accelerated their digital transformation efforts in response to COVID-19 and their digital communications strategy has sped up by an average of six years. Moreover, 92% of organizations are looking to expand their digital communication channels. New digital engagement channels are powering the shift from physical to digital. In words of Jeff Lawson, the CEO of TWLO, “Organizations in nearly every industry are turning to Twilio as they identify new ways to communicate with their customers and stakeholders…” Peer Grade: B TWLO is currently rated #2 out of 11 stocks in the Software – SAAS industry. Other popular stocks in the industry are Elastic (ESTC), Dynatrace, Inc. (DT), and Everbridge, Inc. (EVBG). TWLO comfortably beat the year-to-date performance of these industry participants. ESTC, DT, and EVBG have returned 73.9%, 63.6%, and 64.1%, respectively, over this period. Industry Rank: C The Software – SAAS industry is ranked #59 out of the 123 StockNews.com industries. The companies in this industry operate as software-as-a-service companies, providing software analytics products worldwide. Demand for such services is primarily driven by corporate spending. And since the onset of the health crisis, the remote working culture has amplified the dependence on digital infrastructure to overcome operational challenges. Overall POWR Rating: B (Buy) Overall, TWLO is rated a “Buy” due to its impressive quarterly performance, steadily growing customer base, and solid price momentum, as determined by the four components of our overall POWR Rating. Bottom Line TWLO has gained significantly so far this year and is a decent investment for investors looking for stability and growth in the long run. The stock was hit hard in the preceding month’s massive sell-off but has recovered well. TWLO’s valuation looks frothy as it is burning cash, and is not profitable yet. However, we expect a permanent shift toward hybrid work environments in 2021, which will increase the ubiquity of digital communications platforms and the need for such APIs. Hence, we can expect a healthy increase in demand for TWLO’s services in the coming quarters. Analyst sentiment, which gives a good sense of a stock’s future price movement, is pretty impressive for TWLO. The average broker rating of 1.27 indicates a favorable analyst sentiment. Of the 28 Wall Street Analysts that rated the stock, 21 have given it a “Strong Buy” rating. Consensus revenue estimate for the upcoming year indicates a 25% year-over-year growth. The market expects EPS for the next year to rise 130% from the current year value. This outlook should keep TWLO’s price momentum alive. Want More Great Investing Ideas? Do NOT Buy Stocks Before the Election! 7 “Safe-Haven” Dividend Stocks for Turbulent Times Chart of the Day- See Christian Tharp’s Stocks Ready to Breakout TWLO shares were trading at $288.53 per share on Friday afternoon, up $31.57 (+12.29%). Year-to-date, TWLO has gained 193.58%, versus a 5.54% rise in the benchmark S&P 500 index during the same period."}]}