{"article": [{"url": "https://stocknews.com/news/sedg-azre-enph-csiq-4-green-energy-stocks-to-grow-your-portfolio/", "published": 1599048500.0, "headline": "4 Green Energy Stocks to GROW Your Portfolio", "body": "Climate change has been a rising concern for over a decade now, but many countries fail to take it seriously and prefer to continue with traditional energy-backed industrial growth. However, lately, the warning signs of nature have become harder to ignore. For example, the United States has grappled with some unusual natural catastrophes over the past few years. Ranging from California wildfires to frequent floods and hurricanes in different parts of the country, people are becoming increasingly aware and concerned over the future of this planet for upcoming generations. According to the latest survey released by the Climate Change communication, six out of ten Americans are alarmed about global warming. As a result, most companies are shifting towards a “greener” method of production. This not only bodes well for the environment, but also motivates the investors, allowing companies involved in alternative energy to raise capital more effectively. Solar energy has emerged as one of the most preferred sources of renewable energy, and is expected to grow further in the upcoming years. As most countries are actively trying to reduce their greenhouse emissions, and have already set targets for the same, companies such as SolarEdge Technologies, Inc. (SEDG), Enphase Energy, Inc. (ENPH), Canadian Solar Inc. (CSIQ) and Azure Power Global Ltd. (AZRE) are expected to see a rise in their business operations and revenues in the years ahead. 7 Best ETFs for the NEXT Bull MarketSolarEdge Technologies, Inc. (SEDG) SEDG designs, manufactures and sells direct current (DC) optimized inverter systems for solar photovoltaic (PV) installations. Its SolarEdge system operates through a cloud-based monitoring platform comprising inverters, power optimizers and smart energy management solutions. With increasing focus on climate change, most countries are steadily trying to adopt alternative energy solutions to reduce total emissions. On June 23rd, SEDG launched its new Energy Hub Inverter with Prism technology to provide higher flexibility in home backup for residential and commercial users. As a result, SEDG maintained healthy financial performance amid the pandemic. Revenues increased slightly from the year-ago value to $331.90 million in the second quarter that ended in June 2020. GAAP net income increased 11% year-over-year to $36.70 million. Cash flow from operating activities increased 16.7% from the same period last year to $59.3 million. SEDG expects its revenues to be in the range of $325-$350 million for the third quarter ending September 2020. Its trailing 12-month revenue growth of 45% is greater than 88.8% of the U.S. stocks in the StockNews.com universe. Its EPS is expected to grow 20% per annum over the next five years. Also, SEDG beat the street EPS estimates in three out of trailing four quarters, which is impressive. SEDG has gained more than 240% since hitting its 52-week low of $67.02 in March. The stock hit its 52-week high of $229.49 in August. How does SEDG stack up for the POWR Ratings? A for Trade Grade A for Buy & Hold Grade A for Industry Rank A for Overall POWR Rating. You can’t ask for better. It is also ranked #1 out of 14 stocks in the Solar industry. Enphase Energy, Inc. (ENPH) ENPH designs, manufactures, and sells home energy solutions such as microinverter systems to the photovoltaic industry globally. It is the world’s leading supplier of microinverters, with a dominating global market presence. Its semiconductor-based microinverter converts individual solar molecule energy and combines it with its patented networking and software technology for energy monitoring and control services. The company also provides AC battery storage systems, Envoy communications gateway and Enlighten cloud-based monitoring services. To compensate for the negatives caused by the pandemic, ENPH opened online stores in Europe and Australia as well as launched an online Enphase community. It also entered into a strategic partnership with Maxeon Solar technologies to develop seventh-generation microinverters.On June 1st, ENPH announced its expansion plan to Poland through a partnership with solar distributor SmartX Sp. z.o.o. Also, on July 15th, it collaborated with Maxeon Solar Technologies to manufacture a factory integrated Enphase IQ microinverter by the fourth quarter for residential customers worldwide. Though ENPH’s revenue for the second quarter that ended in June 2020 indicates a year-over-year decline, the company reported a record non-GAAP gross margin of 39.6%. Its worldwide Net Promoter Score of 66% this quarter indicates a slight increase from the year-ago value. Gross profit increased 6.67% from the same period last year to $48.38 million. ENPH’s earnings grew 314.7% over the past twelve months, making it better than 95.4% of the U.S. stocks based on EPS growth. ENPH expects its third-quarter revenues to be in the range of $160-$ 175 million and non-GAAP gross margin to be in the range of 37-40%, excluding stock-based compensation. Though the consensus EPS estimate for the third quarter ending September 2020 indicates a year-over-year decline, ENPH surpassed market estimates in each of the trailing four quarters, which is impressive. ENPH gained more than 255% to hit its 52-week high on August 6th after hitting its year-to-date low of $21.49 in March. ENPH’s strong fundamentals are reflected in its POWR Ratings. It is rated a Strong Buy with a grade of A for Trade Grade, Buy & Hold Grade and Industry Rank, and a B in Peer Grade. In the 14-stock Solar industry, ENPH is ranked #2. Canadian Solar Inc. (CSIQ) CSIQ develops and manufactures solar power products such as solar ingots, wafers, cells modules, etc. through two segments – module and Systems solutions (MSS) and Energy. Its MSS segment operates to design, develop, manufacture and sell a range of solar power products, while the energy segment develops and sells solar power projects and electricity. CSIQ entered into two power purchase agreements to acquire 274 MWp solar power projects from Braskem S.A. and Copel Energia in Brazil. In exchange, CSIQ plans to build a 152 MWp project in the State of mine Gerais and a 122 MWp project in the State of Pernambuco. CSIQ started construction of a 10 MWp Siemz solar power plant in Germany on August 4th. The company is also building one of the largest commercial and industrial rooftop projects in Malaysia. CSIQ plans to list its MSS business in China’s stock market, giving the company access to huge amounts of capital to fund its expansion projects and research and development departments. CSIQ’s gross margin increased 369 basis points from the same period last year to 21.2% for the second quarter that ended in June 2020. Net revenue of $696 million surpassed the estimates of $630-$680 million. Total module shipments increased 31% sequentially to 2,905 MW in the quarter. CSIQ has a shareholder yield of 49%, which is higher than 92.42% of the U.S. stocks listed in the StockNews.com universe. The consensus revenue estimate of $861.93 million for the third quarter ending September 2020 indicates a 13.4% rise year-over-year. CSIQ’s EPS is expected to grow 20% per annum over the next five years. Moreover, the company beat street EPS estimates in each of the trailing four quarters, which bodes well for the stock. CSIQ has gained more than 120% since hitting its 52-week low of $12 in March. The stock hit its 52-week high of $26.72 in August. It’s no surprise that CSIQ is rated a Strong Buy in our POWR Ratings system, with a grade of A in Trade Grade, Buy & Hold Grade, and Industry Rank. In the 14-stock Solar industry, CSIQ is ranked #6. Azure Power Global Ltd. (AZRE) AZRE owns and operates solar power plants in India under long-term contracts with government agencies, non-governmental energy distribution companies and commercial customers. It has 43 utility scale projects and multiple commercial rooftop projects with a combined capacity of 1,808 MWp. AZRE has been named the most sustainable company in the solar energy industry by the World Finance magazine. It has also been ranked as the top 10th global renewable power producer by Sustainalytics. AZRE’s Operating Megawatts increased 12% year-over-year in the fiscal 2020 first quarter. Operating and Committed Megawatts of 7,1115 MWs increased 112% from its year-ago value. Revenue increased 16% from the same period last year to $52.2 million. Non-GAAP adjusted EBITDA rose 29% year-over-year to $43.70 million. The consensus revenue estimate of $43.90 million for the fiscal second quarter ending September 2020 indicates an 8.9% increase year-over-year. AZRE’s EPS is expected to grow 108% annually over the next 5 years. AZRE has strong growth features, as its earnings grew at 640.5% in the past twelve months, while revenue grew at 335.2% during the same time. AZRE has gained more than 115% since hitting its year-to-date low of $11.75 in January. The stock hit its 52-week high of $25.62 in August. AZRE is rated a Strong Buy in our POWR Ratings system, consistent with its sound business model and impressive financials. It also has a grade of A in Trade Grade, Buy & Hold Grade, and Industry Rank. AZRE is ranked #7 out of 14 stocks in the Solar industry. Want More Great Investing Ideas? 7 Best ETFs for the NEXT Bull Market Beware Stocks in September? 9 “BUY THE DIP” Growth Stocks for 2020 SEDG shares were trading at $218.20 per share on Wednesday morning, down $5.56 (-2.48%). Year-to-date, SEDG has gained 129.47%, versus a 11.03% rise in the benchmark S&P 500 index during the same period."}]}