{"article": [{"url": "https://stocknews.com/news/bill-fivn-zm-pton-2-stay-at-home-tech-stocks-to-buy-on-dips/", "published": 1601986100.0, "headline": "2 \"STAY AT HOME\" Tech Stocks to Buy on Dips", "body": "We’ve seen a strong bounce off the lows for the major market averages over the past two weeks, with the Nasdaq-100 (QQQ) leading the charge, up 7% in the past eight trading days. While the news of President Trump contracting COVID-19 briefly derailed the market last week, we’ve seen minimal downside follow-through. This shouldn’t be surprising as Presidential shocks have rarely done much lasting damage to the market, and in most cases have been single-day shocks that were quickly bought up by the bulls. The jury is still out on whether we’ll see a re-test of the 3200 levels on the S&P-500 (SPY), but if we do, it’s essential to keep a shopping list ready as the best time to buy growth stocks is on weakness. In this article, we’ll discuss two names that have superior fundamentals that should be at the top of investor’s watchlists if this correction does continue: 9 \"BUY THE DIP\" Growth Stocks For 2020 (Source: TC2000.com) While the stay-at-home stocks have received the most attention from COVID-19 with names like Zoom (ZM) and Peloton (PTON) up over 100% year-to-date, there are less obvious names that are also managing to grow earnings and sales at a rapid pace. Two software companies that have also shrugged off the recessionary environment and put up incredible growth are Five9 (FIVN) and Bill.com (BILL), two lesser-known mid-cap companies with industry-leading sales growth. For those unfamiliar, Five9 provides cloud contact software and has seen a surge in demand with many call centers at lower capacity during COVID-19, and Bill.com offers cloud-based software to automate monotonous back-office financial operations for small and mid-sized businesses. During their most recent quarters, both companies managed to grow sales by over 25% year-over-year, which currently places these two tech names among the top 200 growth stocks in the market. Typically, the top 200 growth stocks are a good place to go fishing for new ideas: Let’s take a closer look at each company’s growth below: (Source: YCharts.com, Author’s Chart) Beginning with Bill.com, the company is relatively new, so it does not yet have positive annual earnings per share (EPS). However, the company’s net losses continue to narrow as it increases its customer base, with the company finishing fiscal Q4 2020 with 98,000 customers, translating to 28% growth year-over-year. It’s worth noting that this growth is occurring at a time when some industries are seeing unprecedented headwinds, so this is extremely impressive. If we look ahead to FY2022 estimates, the company is expected to post net losses per share of $0.21, with preliminary FY2023 forecasts showing that Bill.com could post its first profit in FY2023. This might not be all that exciting for investors used to companies with steady double-digit earnings growth like most of the FAANGs, but the below chart of sales growth shows that strong earnings growth should not be far away as sales continue to ramp up. (Source: YCharts.com, Author’s Chart) As we can see from the chart above, Bill.com reported quarterly revenue of $42.1 million in Q4 2020, a new record driven by an increased customer count and stable margins. It’s worth noting that the company continues to enjoy operating leverage as revenues grow, with sales & marketing expenses coming in at just 28% of revenue in Q4, an improvement of 400 basis points year-over-year (32% vs. 28%). If we look to ahead of Q1 2021 and Q2 2021, revenue is expected to continue to grow at a double-digit pace, even though it’s lapping strong double-digit growth. Based on estimates of $43.4 million in Q1 2021, revenue should grow by 23% year-over-year, and Q2 2021 revenue is anticipated to grow at 18%. Given that Bill.com is lapping 50% growth from the same period last year, this growth is exceptional, translating to a two-year stacked revenue growth rate of 70% for the next two-quarters assuming estimates are met. (Source: TC2000.com) If we look at the chart above, there’s a lot to like here as well, with Bill.com building a new base above its prior resistance level. Also, Bill.com looks like it wants to make a run to new all-time highs before year-end regardless of what the market’s plans are, as the stock is less than 5% off its all-time highs, while the S&P-500 is still struggling to find its footing above its key moving averages. Given the bullish fundamental picture combined with impressive relative strength, I believe any dips below $89.00 on Bill.com will be low-risk buying opportunities. (Source: Company Presentation) Moving over to Five9, the company just came off a strong quarter as well, reporting record revenue of $99.8 million, up 29% year-over-year. These exceptional results were driven by strong growth from enterprises, with enterprise now making up 82% of total revenue, and commercial business making up the other 18%. It’s worth noting that we saw a slight headwind from payment extension requests, but Five9 still managed to post 105% dollar-based revenue retention, up 200 basis points sequentially from Q1 2020. Given the strong EBITDA margins of 18.3% and double-digit revenue growth, Five9 is on track to grow annual EPS by more than 20% next year, with analysts increasing their FY2021 estimates to $0.99. Meanwhile, FY2022 estimates got a lift as well, and they’re sitting at $1.27 currently, a bullish development. (Source: TC2000.com) The best-performing stocks since the 1950s are those that have consistently grown annual EPS by 20% or more each year, and Five9 is on track to meet this criterion in FY2021. While FY2020 saw a drop-off in earnings growth with earnings stagnating due to higher spending, FY2021 and FY2022 annual EPS growth are forecasted at 21% and 28%, respectively, showing an acceleration in earnings growth going forward. While I believe Five9 is a little expensive here above $130.00, I would ultimately expect funds to defend the stock’s recent support level at $115.00 in its multi-week base. Therefore, I would view any pullbacks below $115.00 as low-risk buying opportunities. (Source: TC2000.com) Growth stocks have had an incredible run this year, but I see the stay-at-home trade as getting crowded, especially as some of these names are now up well over 100% year-to-date. Fortunately, Bill.com and Five9 offer growth at a reasonable price and industry-leading sales growth, and both companies have a product that changes the way businesses and enterprises conduct their daily work. Given each company’s impressive dollar-based retention rates and ability to grow customer counts at a double-digit pace during a recession, I expect their strong growth to continue as the economy gets back on its feet. Therefore, if this market correction continues, I would view any pullbacks below $115.00 on FIVN and $89.00 on BILL as low-risk areas to start a position. For now, I am long FIVN, but I may look to start a position in BILL before year-end. Disclosure: I am long FIVN Want More Great Investing Ideas? Do NOT Buy Stocks Before the Election! 7 “Safe-Haven” Dividend Stocks for Turbulent Times Chart of the Day- See Christian Tharp’s Stocks Ready to Breakout Disclaimer: Taylor Dart is not a Registered Investment Advisor or Financial Planner. This writing is for informational purposes only. It does not constitute an offer to sell, a solicitation to buy, or a recommendation regarding any securities transaction. The information contained in this writing should not be construed as financial or investment advice on any subject matter. Taylor Dart expressly disclaims all liability in respect to actions taken based on any or all of the information on this writing. BILL shares . Year-to-date, BILL has gained 172.30%, versus a 5.55% rise in the benchmark S&P 500 index during the same period."}]}