{"article": [{"url": "https://stocknews.com/news/baba-chart-of-the-day-alibaba-group-holding-baba/", "published": 1597838900.0, "headline": "Chart of the Day: Alibaba Group Holding (BABA)", "body": "A symmetrical triangle pattern has emerged in the chart of Alibaba Group Holding (BABA). Alibaba Group Holding (BABA) is the world’s largest online and mobile commerce company. It operates China’s most-visited online marketplaces, including Taobao and Tmall. The company continues to see strong growth in e-commerce, and its strengthening cloud business will be an additional tailwind going forward. Take a look at the 1-year chart of BABA below with my added notations: 7 Best ETFs for the NEXT Bull Market (Chart of BABA provided by TradingView ) As you can see, a symmetrical triangle chart pattern has formed in BABA. There is trendline resistance converging with trendline support, which forms the triangle pattern (blue). A trader could enter a long position on a break above the trendline resistance or a short trade if/when it falls below the trendline support. (BABA is one of the stocks currently in Steve Reitmeister’s Total Return portfolio. Learn more here.) Keep an eye out tomorrow, Thursday 8/20/20, morning before the opening bell, as BABA will report its latest quarterly financial results. Want to Discover More Great Trades? I have explored virtually every flavor of technical analysis and chart pattern known to mankind. The sad fact is that the vast majority of them don’t work at all. That is why I recently put together this presentation to help investors focus on the only 5 chart patterns that matter…the ones that lead to the most timely and profitable stock trades. Click below to learn these patterns and how to quickly find the 5 to 7 best trades today. 5 WINNING Stock Chart Patterns Have a good trading day! Good luck! Christian Tharp, CMT @cmtstockcoach BABA shares were trading at $258.35 per share on Wednesday morning, down $0.85 (-0.33%). Year-to-date, BABA has gained 21.81%, versus a 6.34% rise in the benchmark S&P 500 index during the same period."}]}