{"article": [{"url": "https://stocknews.com/news/cl-avtr-chd-xlp-3-consumer-stocks-soaring-above-their-moving-averages/", "published": 1596024500.0, "headline": "3 Consumer Stocks Soaring Above Their Moving Averages", "body": "The consumer staples sector is made up of companies that create and sell items that are considered essential for everyday use. This includes food and beverages, household goods, and hygiene products. These companies usually perform well during any economic environment. They are typically large market leaders that provide reliable profits. Consumer stocks are important as they offer investors safety during poor economic climates. They also tend to perform well in down markets. Some even pay consistent dividends to shareholders. They are typically popular among older investors seeking income. Some of these companies have significantly benefited due to the demand for everyday products stemming from the pandemic. While the Consumer Staples Select Sector SPDR ETF (XLP) is slightly negative for the year, many consumer stocks have performed well. One way to find top-performing stocks is through a technical indicator used by traders called a moving average. This helps investors and traders determine an overall trend in the market. The most widely used moving average is the 200-day simple moving average. If a stock is trading above its 200-day moving average, it is considered to be in a positive trend. 9 \"BUY THE DIP\" Growth Stocks For 2020Colgate-Palmolive (CL), Avantor (AVTR), and Church & Dwight Co (CHD) are three stocks trading above their 200 day moving averages. Colgate-Palmolive Company (CL) CL is currently trading above its 50-day and 200-day moving averages of $73.06 and $70.29. As one of the leading brands in the personal and household healthcare industry, CL has gained momentum since the pandemic. With more than 34,000 loyal consumers in more than 200 countries, the company manufactures products pertaining to oral, personal, and home care along with pet nutrition. CL has partnered with the World Health Organization’s #SafeHands effort to produce 25 million soap bars. Its net sales for the first quarter grew 5.5.%, and organic sales increased 7.5% year over year. The company retained its position as the leading manufacturer of toothpaste and toothbrushes by holding a global market share of 40.5% and 32.1%. Moreover, CL is a major dividend-paying stock. During these unprecedented times, many investors have switched to such dividend-bearing stocks to maintain a stable income source. CL pays an annual dividend of $1.76, which yields 2.32% based on its current price. CL’s consensus EPS estimates indicate a 4.5% increase annually for the next five years. Since hitting its 52-week low of $58.49 in March, CL has gained more than 25%. How does CL stock up for POWR Ratings? A for Trade Grade A for Buy & Hold Grade A for Peer Grade A for Industry Rank A for Overall POWR Rating You can’t ask for better. It is also ranked #4 out of 33 stocks in the Consumer Goods sector. Avantor, Inc. (AVTR) AVTR is currently trading ahead of its 50-day moving average of $18.02 and 200-day moving average of $16.41. It is one of the biggest Fortune 500 companies operating in the biopharma and healthcare sectors. As the healthcare sector is gaining traction during the pandemic, AVTR, a major supplier of critical products and services in the field of biopharma has been faring well. AVTR has recently announced upsizing and offering of senior notes worth $2 billion, redeemable in 2028. The company’s proceeds can be utilized for business expansion purposes as most countries are entering Stage 3 of COVID- vaccine trials. AVTR is also planning to increase its revolving credit facility to $515 million; and extend its maturity date to July 2025. The company expanded its innovation center to promote research and development of bioprocessing, gene therapy, and monoclonal antibodies. With increased requirement for COVID-19 treatment, AVTR stands to gain significantly from that business expansion. AVTR’s consensus EPS estimates indicate a 20.9% yearly growth over the next five years. The stock gained more than 190% since hitting its 52-week low of $6.66 on March 18th due to an overall dip in the market. It gradually recovered to hit its 52-week high of $19.75 on July 27th. It’s no surprise that AVTR is rated as a “Strong Buy” stock in our POWR Ratings system. It has an “A” in Trade Grade, Buy & Hold Grade, Peer Grade, and Industry Rank. It is ranked #8 out of 33 stocks in the Consumer Goods sector. Church & Dwight Co., Inc. (CHD) CHD is trading significantly higher than its 50-day and 200-day moving averages of $78.23 and $72.60, respectively. As a leading manufacturer and distributor of household, personal care, and specialty products, CHD’s impressive performance comes in the light of surging demand for such consumer goods during the lockdown. As domestic consumption rose 30% in March alone, CHD’s sales in the first quarter grew by 11.5% year-over-year. CHD pays an annual dividend of $0.96, which yields 1.09% based on its current price. The consensus EPS estimate of $0.63 for the second quarter indicates a 10.5% year-over-year rise. The consensus revenue estimate of $1.15 billion also indicates a 6.9% increase over the year-ago quarter. CHD has gained 85% since hitting its 52-week high of $89.29 in July after hitting its 52-week low of $47.98 in mid-March. CHD is rated “Strong buy” in our POWR Ratings system, consistent with its strong performance in 2020. It is rated “A” in Trade Grade, Buy & Hold Grade, Peer Grade, and Industry Rank. It is ranked #7 out of 33 in the Consumer Goods industry. Want More Great Investing Ideas? 9 “BUY THE DIP” Growth Stocks for 2020 Newly REVISED 2020 Stock Market Outlook 7 “Safe-Haven” Dividend Stocks for Turbulent Times CL shares rose $0.18 (+0.24%) in after-hours trading Wednesday. Year-to-date, CL has gained 12.70%, versus a 2.05% rise in the benchmark S&P 500 index during the same period."}]}