{"article": [{"url": "https://stocknews.com/news/jnj-is-johnson-johnson-jnj-a-buy-sell-or-hold/", "published": 1597838900.0, "headline": "Is Johnson & Johnson (JNJ) a Buy, Sell or Hold?", "body": "Johnson & Johnson (JNJ) is the world’s largest and most diverse healthcare firm. The company operates through three product divisions: pharmaceuticals, medical devices, and consumer products divisions. It has approximately 250 subsidiaries, providing diversification that enables it to withstand the various economic cycles. The company also has one of the largest research and development budgets in the pharmaceutical industry. The drug and device divisions represent close to 80% of sales and drive most of the company’s cash flows. The drug division focuses on the following therapeutic areas: immunology, oncology, neurology, pulmonary, cardiology, and metabolic diseases. The device segment focuses on orthopedics, surgery tools, vision care, and a few smaller areas. The company recently beat estimates for both sales and earnings for the second quarter. The firm has also raised its 2020 outlook due to a faster-than-expected recovery in the medical devices segment. The segment had been hurt due to a decline in elective surgery amid the pandemic. JNJ’s pharmaceutical division has been performing well despite competition for generic drugs. Pharmaceutical sales rose 2.1% year over year in the second quarter, led by JNJ’s oncology drugs, Imbruvica and Darzalex, and its psoriasis treatment, Stelara. 9 \"BUY THE DIP\" Growth Stocks For 2020These second-quarter results were positive for the company, but is the stock a Buy? To determine a stock’s potential, I like to look at various factors to evaluate a company. Factors such as growth, value, income, and momentum are just a few areas I need to explore before deciding if it’s a candidate for investment. Let’s take a look at where JNJ stands among these factors. Growth Within each factor, I like to evaluate different ratios and metrics. For instance, for growth, I want to look at three-year growth rates for different growth metrics. JNJ has a three-year revenue or sales growth rate of 3.5%. While higher than its industry, it is considerably lower than the S&P 500. Its three-year EPS growth is -1.3%, and its three-year earnings before interest, taxes, depreciation, and amortization (EBITDA) is -1.7%. Those are not good figures. In terms of future growth, JNJ has a forecasted one-year revenue growth rate of 8.5%. Its EPS one-year growth estimate is 14.9%, and its EBITDA growth forward rate is 13.9%. Based on past growth alone, JNJ certainly doesn’t shine, but when you consider future growth potential, I’d say its growth factor is average. Value There are many metrics to look at a company’s valuation, so I decided to consider six different parameters to get a complete picture of a company’s worth. The first is the StockNews.com fair value estimate based on a discounted cash flow analysis. JNJ has a current price of $150.80, and the StockNews fair value target is $62.9, which would indicate a high valuation for the stock. JNJ’s trailing twelve-month price to earnings ratio (P/E) is 26.5, above its industry average, but below the S&P 500. The company’s other valuation ratios are also higher than its industry average. Price/sales is 5.0, price/free cash flow is 23.1, price/book is 6.3, and EV/EBITDA is 17. The EV/EBITDA ratio measures a company’s enterprise or total value (EV) to its EBITDA. This is one of my favorite valuation metrics. I want stocks with EV/EBITDA below 10. Based on all the valuation metrics alone, JBJ is not a stock to buy; but that is why I like to look at different factors. Income JNJ currently sports a dividend yield of 2.7%, with a payout ratio of 66.9%. The yield is equal to the industry average but is higher than the S&P 500 yield. The company has also been growing its dividend with a three-year average growth rate of 6.3% and a five-year average growth rate of 6.1%. While its dividend yield is not sky high, 2.7% is pretty solid yield, so for the income factor, JNJ is in Buy territory. Profitability Profitability or efficiency is another factor I rate very highly. If a stock isn’t making profits, it’s not for me. JNJ’s operating margin is 25%, higher than both the industry average and the S&P 500. Operating margin is the profit a company makes on a dollar of sales, after paying for costs, but before paying interest or taxes. The stock’s return on assets is 9.6%, once again above both the industry average and the S&P 500. Return on assets is an indicator used to determine how profitable a company is relative to its total assets. The final two metrics are my favorites and where JNJ shines. JNG has a return on equity of 24.1% and a return on invested capital of 17.1%. Both are high profitability figures, so for profitability, JNJ is flying high. Fundamentals A company’s fundamental strength or financial health is another critical factor to consider. I don’t like investing in stocks with a lot of debt. JNJ currently has a low debt/equity ratio of 0.5. The debt-to-equity ratio is calculated by dividing a company’s total liabilities by its shareholder equity. The ratio indicates a company’s ability to cover outstanding debts during a business downturn, which we are currently in. The other ratio I focus on for a business’s financial health is its current ratio. I like companies that have the liquidity to pay off short term obligations. JNJ has a current ratio of 1.03. Based on these figures alone, I am confident in the company’s financial health. Momentum The last factor I evaluate is a company’s momentum. I like to look at momentum over the short term and the medium term. JNJ’s one-month performance is 1.3%, and its three-month performance is 1.1%. Both figures are on the lower side compared to the company’s industry competitors. Over the last twelve months, the stock rose over 17%. The stock is currently trading above both its 50-day and 200-day moving averages, which should certainly be taken into consideration. Our momentum-based POWR Ratings have JNJ rated as a Strong Buy. So, while short term momentum isn’t anything to get excited about, the stock has performed well over the long term. Final Word After considering every factor, I believe JNJ, which is the #1 ranked stock in the Medical – Pharmaceuticals industry on POWR Ratings, is a Buy. While the company has average growth and is overvalued based on many metrics, its profitability figures and financial health cannot be overlooked. This is a highly profitable company with a strong balance sheet, which consistently rewards shareholders with dividends. The fact that the stock is above both major moving averages only helps its case. Don’t expect huge gains, but if you are looking for steady returns from a large proven company, JNJ fits the bill. Want More Great Investing Ideas? The Best of StockNews 2 Step Process to Sell @ Market Top in September 9 “BUY THE DIP” Growth Stocks for 2020 JNJ shares rose $0.21 (+0.14%) in after-hours trading Wednesday. Year-to-date, JNJ has gained 4.48%, versus a 5.86% rise in the benchmark S&P 500 index during the same period."}]}