{"article": [{"url": "https://stocknews.com/news/xom-bp-wfc-apts-psec-et-the-last-double-digit-yields-on-the-big-board-up-to/", "published": 1600344500.0, "headline": "The Last Double-Digit Yields on the Big Board (Up to 20%)", "body": "What if I told you that, even in this expensive stock market, that we can still find yields of 9%, 10%… heck, even 20%? Volatility is back, and with it, some discounted stocks with generous yields that we can snag. We’ll talk about big dividends up to 20% today. An S&P 500 index fund, as usual, won’t pay you enough income to retire. You have to buy the pricey basket and hope it’ll keep levitating higher. A purchase of the popular index today and you’ll barely squeeze out $18,000 in dividends by this time next year. That’s not much but it’s downright lavish compared with the $6,700 you’d eke out of a 10-year T-note. 9 \"BUY THE DIP\" Growth Stocks For 2020Fortunately, if you look in the right corners of the market, you can take a nest egg half that size and generate anywhere between $46,000 and $100,000 annually in cold, card cash. But you can’t just blindly chase yields and hope for the best. Dividend cuts can cripple your retirement plans, as investors in the likes of Boeing (BA), Ford (F) and Marriott (MAR) experienced earlier this year. The good news is, stocks often provide some early warning signals. Let’s look at how Wall Street tipped its hands before recent dividend cuts by BP (BP) and Wells Fargo (WFC). In BP’s case, Wall Street kept failing to buy a massive dip in shares—a move so noticeable I mentioned it in July. BP’s Resurgence Fizzled Out While the Market Marched On The same goes for Wells Fargo, which kept trending flat to lower even as bank stocks slowly began to recover. No One Believed Wells Fargo Was Coming Off the Mat Let me introduce you to five simply breathtaking dividend payers delivering between 9.2% and 20% on current prices, spanning the gamut, from REITs to MLPs to even a “disgraced” blue chip as we search for dividend diamonds in the rough. Preferred Apartment Communities (APTS) Dividend Yield: 11.1% Let’s start with Preferred Apartment Communities (APTS)—a real estate investment trust (REIT) that, just by looking at its name, you know has been knocked around by COVID-19. Preferred Apartment Communities boasts 101 properties in 15 states, primarily in the southeast U.S. It primarily invests in multifamily properties, but also Class A office buildings and grocery-anchored shopping centers. Eight of those properties are student housing, but the pandemic has thrown that real estate industry into question; APTS reportedly is near a deal to unload those properties on private equity firm TPG for $480 million. At current prices, APTS is yielding more than 11% … but investors are buying into a complicated story, for better and for worse. On the upside, the company is more operationally sound than you’d think. While shares are off 50% in large part because of rent-collection fears early on during the coronavirus outbreak, more recent collection stats are more encouraging. The company reported Q2 recurring rental revenues of 99% for both its multi-housing and office portfolios, and 92% for its grocery-anchored retail. But the financial situation is murkier than that performance would indicate. The 11.1% yield is based on Preferred Apartment Communities’ reduced dividend. Preferred Apartments’ Price, Payout Go Hand in Hand APTS cut the payout by 33% in May, after it had raised it annually since initiating the payout in 2011. Yes, APTS had to adjust for a downturn in funds from operations (FFO), but it also needed to ensure it could keep paying dividends on its large lot of preferreds. During Q2, the REIT paid out $8.6 million in regular dividends … but $35.6 million in preferred distributions. The new, lower dividend is more sustainable while still attractive at double digits. And APTS will be a natural beneficiary of a more robust economic recovery. But it could be a slow, frustrating wait. Analysts expect even 2022 FFO will be 40% lower than what the REIT earned last year. Prospect Capital (PSEC) Dividend Yield: 14.4% Prospect Capital (PSEC) is a business development company (BDC) that provides capital for middle-market companies. It primarily deals in first- and second-lien senior loans and mezzanine debt, but it will also use equity. At the moment, PSEC’s portfolio boasts 121 investments across 39 industries. So you’re getting a diversified private-equity-esque investment—one with a sky-high yield (paid monthly!) to boot. But that dividend comes with two important asterisks. BDCs are among the income world’s heaviest hitters. This is one of just two asset classes averaging double-digit yields, so understand that while Prospect Capital’s (PSEC) 14%-plus yield might seem other-worldly, it’s merely considered above-average within its peer group. More importantly, PSEC’s dividend is, to put it kindly, erratic. Prospect Capital Is Not Shy About Dividend Cuts Any potential buyer of PSEC has to know that the company has a history of aggressive dividends that the business hasn’t been able to back up. So you need abundant proof that Prospect Capital is in the midst of a dependable upswing to feel comfortable in locking in this yield. PSEC simply isn’t there yet. Second-quarter net interest income (NII) of 16 cents per share was down 16% both year-over-year and quarter-over-year, and its net asset value (NAV) per share, while up a couple percent from Q1 2020, is still off 9% from last year. Moreover, the BDC has paid out 100% of its NII in dividends, which is a troubling figure considering the firm’s dividend history. Energy Transfer LP (ET) Distribution Yield: 20.0% Energy Transfer LP (ET) is one of America’s larger midstream energy firms – a roughly $17 billion outfit that’s responsible for some 90,000 miles of national energy infrastructure in 38 states. Last year, 30% of natural gas and crude oil that moved across the U.S. did so on the firm’s pipelines. ET units, off 52% year-to-date, have given up much of what was a sizable rebound off the lows amid dwindling momentum in crude and natural gas prices. Energy Transfer, like other pipeline companies, doesn’t make its money by selling oil at a certain price, but instead is a “toll taker” that collects as resources make their way through its infrastructure. Nonetheless, ET and other master limited partnerships (MLPs) have suffered just like their exploration-and-production brethren given cripplingly low demand, which translates into less need for their services. So what comes next for demand? The Energy Information Administration is forecasting an 8.3 million barrel-per-day decline from 2019 to 93.1 million in 2020, but a 6.5 million b/d increase in 2021. But that estimate, made in September, is half a million barrels lower than it was in August. Translation: The more sluggish the country’s economic recovery, the slower ET will return to normalcy. That would seem to mean trouble for Energy Transfer’s wildly high distribution, but the MLP is grinding it out. The company has preserved cash by reducing its capital growth plans by 15%, to $3.4 billion, across two different cuts. The upshot? ET announced in July that it would keep its August payout level at 30.5 cents per unit, and that distributable cash flow (DCF, an important MLP metric that outlines cash that can be redistributed to unitholders) was 1.54x what it needed to cover the distribution. I can’t recommend ET for investors looking for a reliable long-term source of income. Commodities are too volatile, MLPs are a tax headache, and what you gain in yield with ET, you lose in heartburn from the unit price whipping around and wondering whether the next oil crash will be the straw that breaks the camel’s back. But short-term speculators might be able to make something out of this downtrodden energy play. ET Has Yielded ~20% Three Stints in the Past Four Years Exxon Mobil (XOM) Dividend Yield: 9.2% For the past few months, every time Exxon Mobil (XOM) has triggered one of my yield signals, I’ve done a double-take. It’s just nothing you would have imagined from what for so long was one of Wall Street’s premier integrated energy majors. We’re in Uncharted Territory Exxon has suffered through an excruciating year: Shares are off 46% in 2020. Exxon announced $33 billion in planned capital expenditures in March, only to turn around in April and reduce that figure by 30%. It lost $610 million in Q1, then $1.1 billion in Q2. Exxon kept the payout level in April; it traditionally raises its dividend during the month, so its status as a Dividend Aristocrat is in doubt. XOM, which had been a member of the Dow Jones Industrial Average since 1928, was booted in August. The next domino to fall might be the dividend, which even Wall Street’s analysts are discussing as a real possibility. Counterintuitively, a dividend cut could end up being a buy signal, as it’s one of the best things Exxon could do for its long-term sustainability. XOM has failed to cover its dividend with free cash flow since 2019. Exxon has been moving heaven and earth to protect its payout, not just cutting capital expenditures, but nipping and tucking anywhere it can. XOM even went so far as to suspend 401(k) matches before touching the dividend. If oil prices continue to wallow, Exxon will have to keep borrowing to keep the payout intact. And believe it or not, that is an option, at least in the near-term. Exxon’s leverage isn’t as high as many of its global peers, so it could borrow to sustain the dividend until energy prices recover and keep one of its few remaining favored statuses. But doing so would dig an even larger hole for XOM to climb out of, and the longer it cuts back on capex, the more it’s jeopardizing its future growth potential. Want More Great Investing Ideas? Your Early Retirement Portfolio: 7.7% Dividends—Every Month—Forever How to Retire on 10% Dividends Paid Monthly The Simple (and Safe) Way to Earn 15% Every Year from Stocks XOM shares were trading at $37.56 per share on Thursday afternoon, down $0.25 (-0.66%). Year-to-date, XOM has declined -43.24%, versus a 4.90% rise in the benchmark S&P 500 index during the same period."}]}