{"article": [{"url": "https://stocknews.com/news/td-ubs-cs-3-buy-rated-bank-stocks/", "published": 1597752500.0, "headline": "3 \"Buy Rated\" Bank Stocks", "body": "The banks have not attracted much investor interest following the spread of the coronavirus. Money is tight, and financial institutions are less likely to loan money unless stringent standards are met. Also, clients could soon be defaulting on loans. Though the banking sector is not exactly on fire, there are some diamonds in the rough. Even if you are not bullish on the banks as a sector, you should give serious consideration to adding at least a couple of them to your portfolio. Below, I provide a look at three Buy rated bank stocks: Toronto Dominion Bank (TD), UBS Group (UBS) and Credit Suisse Group (CS). 7 \"SAFE HAVEN\" Dividend Stocks for Turbulent TimesToronto Dominion Bank (TD) If you have not heard of TD, don’t feel bad. Plenty of investors are unaware of this North American financial services provider. TD provides across-the-board commercial and retail banking services and products, along with wealth management services. TD’s dividend of 4.90% is made all the more appealing by its comparably low trading price. TD has a 14% profit margin, a low forward P/E ratio of 13, and a relatively safe outlook. Each of these numbers is fantastic for a stock in the banking industry. Out of seven analysts who have analyzed TD, three recommend buying, four advise holding, and none recommend selling. If you are still on the fence as to whether TD is worthy of your money, take a look at the POWR Ratings. TD has A grades in its Peer Grade and Trade Grade components. TD is ranked second out of 44 stocks in the Foreign Banks category. UBS Group (UBS) Banks with a worldwide client base are that much more attractive than those that primarily do business in one nation or region. Geographic diversification provides a buffer against the potential concentration of coronavirus cases in one particular location. UBS has the global client base investors are looking for. UBS services include global wealth management, asset management, investment banking, and personal and corporate banking. The POWR Ratings show UBS has A grades in its Peer Grade and Trade Grade components. UBS has a grade of B for Buy & Hold Grade. The stock is ranked third of 44 in the Foreign Banks category. Analysts have set a price target of $14.16 for UBS, which is 15% higher than its current price. The stock has a forward P/E ratio of 10.24, indicating it is underpriced at its current trading level of $12 – $13. UBS’ solid earnings reports, combined with its bullish long-term outlook, make it quite an interesting investment opportunity. In other words, there is a good reason for its Buy rating. Credit Suisse Group (CS) CS provides financial services to clients in the Private Banking, Investment Banking, and Asset Management divisions. The POWR Ratings reveal CS has A grades in its Peer Grade and Trade Grade components. CS is ranked in the top six of 44 stocks in the Foreign Banks industry. Analysts have an average price target of $11.66. CS also appears undervalued with a forward P/E ratio under 8. Add in CS’s 13% income growth along with net revenue growth of nearly $400 million on a year-over-year basis, and you have the foundation for a winning banking stock that holds steady throughout the pandemic. Want More Great Investing Ideas? The Best of StockNews 3 Possible Directions for the Stock Market from Here 9 “BUY THE DIP” Growth Stocks for 2020 TD shares were unchanged in after-hours trading Tuesday. Year-to-date, TD has declined -12.49%, versus a 6.30% rise in the benchmark S&P 500 index during the same period."}]}