{"article": [{"url": "https://stocknews.com/news/chkp-pcty-sbsw-hlf-four-upgraded-stocks-to-buy-now/", "published": 1600430900.0, "headline": "Four Upgraded Stocks to Buy NOW!", "body": "The daily POWR Ratings are in. Several stocks have been upgraded to “Buy” or “Strong Buy” ratings. Our POWR Ratings system is an exclusive momentum-based stock-rating system that grades stocks based on several metrics. Though the stock market has been quite unpredictable of late, this is not a time to go all-cash and wait until another correction occurs. Instead, this is an opportune time to pick up shares of quality companies. Below, I look at four stocks recently upgraded to an “A” or “B” rating by our POWR Ratings system: Check Point Software (CHKP), Paylocity(PCTY), Sibanye Stillwater Limited (SBSW), and Herbalife Nutrition (HLF). In other words, they are “Strong Buys” or “Buys.” 7 Best ETFs for the NEXT Bull MarketCheck Point Software (CHKP) CHKP offerings include IT, software, and computer hardware services and products. The company’s initial product, the FireWall-1, was designed with groundbreaking inspection technology, setting the stage for additional offerings to an ever-growing client base. In short, CHKP bolsters IT security with network and data protection tools. These services are becoming even more critical as employees work remotely due to the spread of COVID-19. The POWR Ratings show CHKP has “A” grades in each component, but its Industry Rank. CHKP is ranked first out of 23 stocks in the Software – Security industry. CHKP has a three-month price return of 12%, a six-month price return of 35%, and a five-year price return of 52%. Analysts have set a price target of $126.72 for the stock. CHKP has a fairly low forward P/E ratio of 18.59, considering it is an emerging force in the high-tech space. CHKP executives are shrewdly transitioning to a subscription-based service. The company raked in nearly $160 million from security subscriptions this past quarter, representing a 10% increase on a year-over-year basis. CHKP’s subscription service is likely to prove even more successful in the long-run as more companies shift to the cloud in response to the pandemic. Paylocity (PCTY) Cloud-based payroll services and software solutions are gaining more momentum as the pandemic plays out. PCTY provides such solutions, primarily for medium-sized businesses. All in all, PCTY served 20,000 clients in 2019. PCTY’s overarching goal is to facilitate strategic decision-making, boost human resource efficiency, and make a meaningful impact on clients’ bottom lines. The POWR Ratings show PCTY has “A” grades in each POWR component, but its Industry Rank, which has a grade of “B.” The company is rated a ‘Buy” in the POWR Ratings system. PCTY is ranked 6th of more than 90 stocks in the Software – Application industry. Furthermore, PCTY has returned 79% over six months, 53% across the past year, and an incredible 215% over three years. Out of the nine analysts who have studied PCTY, five recommend buying the stock, and four recommend holding. PCTY has moved right back up to its pre-COVID trading price of $150, following a drop down to $70. PCTY recurring/other revenue boomed 25% on a year-over-year basis. The company anticipates sales will grow by about 20% on a year-over-year basis. Sibanye Stillwater Limited (SBSW) A considerable sum of money has moved into precious metals mining companies as the economy entered a deep trough. SBSW is one such company. SBSW has an expansive portfolio of gold and platinum operations and projects. The company is rated a “Buy” by our POWR Ratings system. SBSW has “A” grades in the Trade Grade and Peer Grade components and a “B” Buy & Hold Grade. The company is ranked first out of 16 publicly traded companies in the Miners – Diversified industry. SBSW has a three-month price return of 63%, a six-month price return of 241%, and a year-to-date return of 26%. It appears as though SBSW is undervalued as its forward P/E ratio is a mere 6.1. Herbalife Nutrition (HLF) It was not long ago when investors shunned HLF as a supposed pyramid scheme. However, HLF products are proving quite successful, and the stock is moving upward. HLF’s health-oriented offerings will prove even more popular in the aftermath of the lengthy quarantine in which most people added a few pounds. The company is rated a “Strong Buy” by our POWR Ratings system. HLF has “A” grades in the Trade Grade and Buy & Hold Grade POWR components, a “B” Peer Grade, and a #1 ranking out of 14 stocks in the Medical – Consumer Goods industry. HLF has a three-month price return of 12%, a six-month price return of 76%, and a five-year price return of 75%. Analysts have set a price target of $62.25, which means they believe the stock has more room to grow. If HLF reaches $62, it will have spiked by more than 25%. The stock has a forward P/E ratio of 14, litigation woes in the rear view mirror, and plenty of buzz surrounding its health products. Want More Great Investing Ideas? 7 Best ETFs for the NEXT Bull Market Stock Market Outlook: Before & After the Election Chart of the Day- See the Stocks Ready to Breakout CHKP shares were trading at $120.71 per share on Friday morning, up $0.73 (+0.61%). Year-to-date, CHKP has gained 8.79%, versus a 5.02% rise in the benchmark S&P 500 index during the same period."}]}