{"article": [{"url": "https://stocknews.com/news/acb-will-aurora-cannabis-ever-be-profitable/", "published": 1602072500.0, "headline": "Will Aurora Cannabis Ever Be Profitable?", "body": "To the chagrin of many Aurora Cannabis (ACB) investors, the stock lost -52.6% last month and is down more than 4% to start this month. Part of that is due to its financial results last quarter, in which the company posted a $2 billion loss and projected a revenue decline in this current quarter. But the company’s problems go beyond a couple quarters. If you remember early last month, ACB announced that it was ending its relationship with the UFC for a CBD research partnership. And then at the end of the month, billionaire Nelson Peltz resigned as a senior advisor. Then you factor in its management team. Its management failed to snag an equity partner to strengthen its financial position, yet they went on a buying frenzy the last couple years. Now we find out that executives were paid bonuses last year of $7.4 million in total, while the stock plunged. This isn’t a good look for the company. 9 \"BUY THE DIP\" Growth Stocks For 2020To make matters worse, the Law Offices of Frank R. Cruz announced yesterday a class action lawsuit against the company on behalf of shareholders. The complaint alleges that ACB made false and/or misleading statements and failed to disclose adverse facts about the company’s business. With all these problems, it’s worth wondering if the company will ever be profitable. Analysts Tamy Chen and Peter Sklar at BMO Capital markets wrote in a note to clients on Monday that, “If Aurora does not endeavor further meaningful [selling, general and administrative expense] cuts, we believe the timeline to achieve the sales volumes that would break even at EBITDA is three years away. This assumes Aurora can achieve the premium mix in our analysis, which requires a substantial increase from today.” ACB’s new CEO Miguel Martin told investors recently that he would be putting more focus on higher-margin, more expensive premium products to grow revenues in future quarters. Unfortunately, this conflicts with what consumers are actually spending their money on. Sixty-two percent of sales from the consumer recreational market last quarter came from ACB’s daily special brand which is their discount brand. One would think that if ACB was to focus on discount brands, the company they might have a fighting chance at achieving profitability sooner. Chen and Sklar said, “Aurora needs a substantial increase in current volumes (+25 percent in flower with a big jump needed into premium, six-fold increase in vapes, three-fold increase in edibles). Because new management is trying to shift from value to more premium, we do not expect growth on a volume basis over the next three years until the company settles into a steady state market share, which we define as low-to-mid-teens percentage. If Aurora is successful in this shift, there should be revenue-dollar growth.” Right now, I believe that ACB is in a tough position and needs to start delivering results to investors. If substantial progress cannot be made over the next few quarters, then I believe ACB could be in serious trouble. I continue to remain optimistic about the cannabis sector as a whole, but the fact that ACB has already initiated a 12:1 reverse stock split with little success, it’s hard to stay confident in a company that continues to underdeliver. (Disclosure: The author is long ACB) Want More Great Investing Ideas? 7 Best ETFs for the NEXT Bull Market What is the Cure for Stock Market Volatility? Chart of the Day- See Christian Tharp’s Stocks Ready to Breakout ACB shares were trading at $4.55 per share on Wednesday morning, up $0.05 (+1.11%). Year-to-date, ACB has declined -82.45%, versus a 7.01% rise in the benchmark S&P 500 index during the same period."}]}