{"article": [{"url": "https://stocknews.com/news/lulu-are-shares-of-lululemon-a-buy-at-315/", "published": 1600949300.0, "headline": "Are Shares of lululemon a Buy at $315?", "body": "Lululemon, Inc. (LULU) is a designer of lifestyle athletic apparel and accessories, operating through its retail store chain and direct-to-consumer segment. It has gained 36.7% year-to-date. LULU grew steadily since the market crash in March, and gained more than 200% to hit its 52-week high of $399 on September 2nd since hitting its 52-week low in March. However, the market correction since the first week of September resulted in a 30% decline for the stock. However, despite market volatility, LULU resumed its share buyback program, which was previously halted due to the coronavirus crisis. This is definitely a sign of its financial strength. The company is also planning on manufacturing footwear, as a port of its omnichannel expansion program, which is expected to boost its profits in the upcoming months. However, as the global economy is still struggling with coronavirus, with rising cases in the United States and second wave in recovered countries, the outcome of LULU’s expansion plan is still dubious. This, combined with several other factors has made our proprietary rating system rate LULU as “Neutral.” 7 \"SAFE HAVEN\" Dividend Stocks for Turbulent TimesHere’s how our proprietary POWR Ratings system evaluates LULU: Peer Grade: B LULU is currently ranked #18 out of 65 stocks in the Fashion – Luxury industry. Other stocks in this industry are Estee Lauder Companies, Inc. (EL), L Brands, Inc. (LB) and Hanesbrands Inc. (HBI). LULU beat EL and HBI’s year-to-date gains of 1% and 12%, respectively, while LB returned 68.2% over the same time period. Industry Rank: B The Fashion – Luxury industry is ranked #20 out of 123 industries in the StockNews.com universe. The pandemic driven lockdown and social distancing norms have significantly reduced the demand for products of companies in this industry. With shut down of most stores for several weeks in the first half of 2020, companies operating in this sector reported massive losses. However, under the new normal, many people have started going outdoors, boosting the sales of respective companies. The popularity of live interactive workout programs has risen tremendously during this time as well, which bodes well for the industry. Trade Grade: C LULU is currently trading above its 200-day moving average of $266.94, but below its 50-day moving average of $339.36. The stock has gained 5.2% in the past three months, which doesn’t indicate enough short-term bullishness. LULU acquired a home fitness company named Mirror to provide a live interactive workout platform to its customers. This $500 million acquisition is a part of LULU’s Power of Three growth plan. LUL reported a 2% year-over-year increase in its net revenue to $902.90 million in the second quarter ended June 2020. Direct-to-customer revenue increased 155% to $554.30 million. Gross profit increased 1% to $485.90 million. Buy & Hold Grade: C In terms of proximity to its 52-week high, which is a key factor that our Buy & Hold Grade takes into account, LULU is not positioned well. The stock is currently trading 20.8% below its 52-week high of $399.90, which it hit on September 2nd. LULU has gained 444.8% in the past three years, which can be attributed to its solid revenue and earnings growth. The company’s net revenue grew at a CAGR of 16.7% over the past three years, while EBITDA increased at a CAGR of 21.8% over the same time period. Also, diluted EPS increased at a CAGR of 25.8% in the past three years. LULU, which primarily manufactured fitness apparel has been expanding into the men’s section in the past couple of years. It has also opened several retail sources around the country in the past couple of years as a part of its expansion policy. However, LULU faces stiff competition from well-established companies operating in this industry. Overall POWR Rating: C (Neutral) LULU is rated “Neutral” due to its bleak future outlook and modest price performance in the short term despite having positives such as share buybacks and launch of new products, as determined by the four components of its overall POWR Rating. Bottom Line LULU has an average broker rating of 1.41, indicating favorable analyst sentiment. Out of 35 Wall Street analysts that rated the stock, 21 rated it “Strong Buy”. Its EPS is expected to grow at 15.2% per annum in the next five years. LULU also has an impressive earnings surprise history, as it beat the street EPS estimates in three out of trailing four quarters. Shares of LULU have the potential to rally in the upcoming months, due to its solid business momentum and favorable analyst sentiment. However, a high P/E ratio of 46.42 versus sector median of 0.81 might indicate that the stock is overvalued at current levels. Want More Great Investing Ideas? 7 “Safe-Haven” Dividend Stocks for Turbulent Times When Does the Next Bull Run Start? Chart of the Day- See the Stocks Ready to Breakout LULU shares fell $0.08 (-0.03%) in after-hours trading Thursday. Year-to-date, LULU has gained 36.22%, versus a 1.95% rise in the benchmark S&P 500 index during the same period."}]}