{"article": [{"url": "https://stocknews.com/news/mrna-nly-spce-3-overvalued-stocks-to-avoid/", "published": 1600258100.0, "headline": "3 OVERVALUED Stocks to AVOID", "body": "The market’s rally over the last six months has led to several stocks becoming overvalued at current prices. The S&P 500 has gained 52% since the coronavirus-driven low of 2191.9 mid-March. This momentum has helped stocks reach levels never achieved before. While the high valuation for some of these stocks are in sync with their fundamental strength, limited growth makes current valuations look unjustified for others. As a result, these stocks could be due for a pullback. The market has already entered a correction phase and contracted 4.7% over the last two weeks. And these overvalued stocks could be responsible for a further correction in the overall market in the near term. Stocks such as Moderna, Inc. (MRNA), Annaly Capital Management (NLY), and Virgin Galactic Holdings, Inc. (SPCE) are currently trading at higher-than-industry-average valuation multiples. In addition, these stocks either lack near-term growth catalysts or are facing challenges in their business models. 9 \"BUY THE DIP\" Growth Stocks For 2020Moderna, Inc. (MRNA) MRNA is a biotechnology company that focuses on the development of transformative medicine based on mRNA (messenger ribonucleic acid). The company’s product pipeline includes systemic intracellular therapeutics, intertumoral immune-oncology, cancer vaccines, and more. As of last quarter, the company was a loss-making enterprise. For the quarter that ended June 30th, the company incurred a loss of $116 million, as compared to a loss of $135 million a year ago. While this is an improvement, the company’s administrative and general expenses increased to $36.6 million from $28.5 million during the same period last year. The company’s road to profitability depends on the development of a successful coronavirus vaccine. However, since the vaccine may or may not be successful, the company’s current valuation remains unjustified. The company is currently trading at a P/B (TTM) ratio of 8.5 which is higher than the industry average. Moreover, MRNA’s P/S (TTM) ratio of 210.38 is significantly higher than the industry average. The company’s EPS is expected to decline 18.9% year-over-year in the current quarter. MRNA’s stock price has risen 241.9% so far this year. MRNA’s weak fundamentals are reflected in its POWR Ratings. The stock has a “Neutral” rating with a grade of “D” in Trade Grade. Annaly Capital Management (NLY) NLY focuses on investing in different types of mortgage-backed securities along with related derivatives for hedging purposes. The company’s portfolio includes collateralized mortgage obligations, agency callable debentures, and mortgage pass-through certificates. The company’s stock is down 20.8% year-to-date. The company’s poor performance may be attributed to the spread of the coronavirus, which has caused the company’s inability to leverage its investments. For the quarter that ended June 30th, the company’s economic leverage fell to 6.4x from 6.8x during the prior quarter. The average yield on interest earning assets for the company was 2.77%, down from 3.03% a year ago. NLY is currently trading at a P/S ratio of 3.4, which is higher than the industry average. The company’s revenue is expected to fall 37.8% this year. NLY’s EPS is expected to contract at a rate of 3.25% per annum over the next five years. NLY’s weak fundamentals are reflected in its POWR Ratings, it has a “Neutral” rating with a grade of “D” for Industry Rank. Virgin Galactic Holdings, Inc. (SPCE) SPCE focuses on owning and operating privately-built spacecrafts. The goal of the company is to fly people to space without any expertise or intensive training. This space tourism pioneer’s stock has risen 53.3% so far this year. However, the stock price is not backed up by any revenue on the company’s part. For the quarter that ended June 30th, the company had no revenue. The company’s operating loss also increased to $63 million compared to $60 million a year ago. In addition, SPCE delayed the start of its commercial space operations to at least the first quarter of 2021. SPCE’s operations are expected to bring in a revenue of $1 billion in ten years, which could be a long wait for most investors. Further, the company still has to prove that it has a viable business model. SPCE is currently trading at a P/B (TTM) ratio of 10.3 which is significantly higher than the industry average. The company’s P/S (TTM) ratio of 2.19 is also way above the industry average. The company’s revenue is expected to fall 47.6% this year. Moreover, SPCE’s EPS is expected to fall 159.1% during the next quarter. SPCE’s weak fundamentals are reflected in its POWR Ratings, it has a “Strong Sell” rating with a grade of “F” in Trade Grade and Buy & Hold Grade. Within the Airlines industry, it’s ranked #18 out of 22 stocks. Want More Great Investing Ideas? 7 Best ETFs for the NEXT Bull Market Stock Market Outlook: Before & After the Election Chart of the Day- See the Stocks Ready to Breakout MRNA shares were trading at $69.30 per share on Wednesday afternoon, up $2.42 (+3.62%). Year-to-date, MRNA has gained 254.29%, versus a 7.05% rise in the benchmark S&P 500 index during the same period."}]}