{"article": [{"url": "https://stocknews.com/news/spy-inx-dia-iwm-qqq-beware-stocks-in-september/", "published": 1598616500.0, "headline": "Beware Stocks in September?", "body": "Does this market rally seem a bit too good to be true? Are you aware that September is the worst month of the year for stocks? Did you know stocks normally tumble into the Presidential Election? 7 \"SAFE HAVEN\" Dividend Stocks for Turbulent TimesIt is for these, and many other reasons, that so many market investment experts expect stocks to fall starting as early as September. And yes, I am one of those experts which is why John Thomas (aka The Mad Hedge Fund Trader) asked me to present my findings to his audience in this new presentation: Beware September? Click Here to Watch Now Let me share with you some more details on this presentation. And why you should take the time to explore its contents. The market has rallied over 50% in just 5 months. That is truly an exceptional showing regardless of the economic climate. However, with the US GDP down 31% in the past quarter, and many experts believing this could devolve into a depression…then it makes this meteoric advance all the more curious. That is why so many investment professionals have called this market a bubble. We are not quite at the same nose bleed valuations as we endured back in 1999. However, the current PE of 30 for the S&P 500 does have one think twice before joining the rally at this time. Valuation is not the only concern. In all I explore the current market outlook with the following key factors in mind: September is historically the worst month of the year for stocks Presidential election pattern is a big negative for the market Increase in write in ballots = increased risk of contested election results Kids going back to school could spark a Coronavirus surge Economic data starting to sour once again There has NEVER been a V bottom in bear market history Add altogether and investors should prepare for more downside ahead Now is the right time to explore my market outlook, detailed trading plan and top 11 picks for today’s market. Its all in my new presentation: Beware September? Click Here to Watch Now Wishing you a world of investment success! Steve Reitmeister …but everyone calls me Reity (pronounced “Righty”) CEO, Stock News Network and Editor, Reitmeister Total Return SPY shares were trading at $349.46 per share on Friday afternoon, up $1.13 (+0.32%). Year-to-date, SPY has gained 9.69%, versus a % rise in the benchmark S&P 500 index during the same period."}]}