{"article": [{"url": "https://stocknews.com/news/spy-inx-dia-iwm-qqq-do-not-buy-stocks-before-the-election/", "published": 1601467700.0, "headline": "Do NOT Buy Stocks Before the Election!", "body": "(Please enjoy this updated version of my weekly commentary from the Reitmeister Total Return newsletter). We have seen stocks bounce mightily from hitting a recent low of 3,209 on Thursday. Yet as shared in my end of the week note, this is prototypical pre-election stock market results: “Fall > Bounce > Fall > Bounce > Fall, Fall, Fall 7 \"SAFE HAVEN\" Dividend Stocks for Turbulent TimesThe # of cycles of this varies. But the final outcome is about the same. And that is the likelihood to head lower than where we are now.” The three day rally had stocks testing resistance at the 50 day moving average (3,355) all session long on Monday. Then in the final hour it slinked lower to close just under the mark. Tuesday provided another early test of this key technical level. In the end we have the same result with the S&P selling off about -0.5%. The main point is that the 50 day moving average is clearly a meaningful level. Yes, it is possible to break above for a short while, but the pressures on the market have not ended and still very much suspect we will spend more time under this level…and likely on down to the 200 day moving average now at 3,109. Why? First, because we are still in the midst of a recession and share prices got WAY AHEAD of themselves on the move up to new all-time highs. Second, and what is really the key story for investors at this time, is the idea of a contested election and the havoc that would likely wreak on stock prices. This concept is grabbing more headlines because of recent comments from President Trump. Here is CNBC’s take on the event: Trump won’t commit to peaceful transfer of power if he loses the election (The above notion got turbo charged during the Tuesday night debate when the President made it abundantly clear that he is likely to question any election result given his concerns about voter fraud with write in ballots. It is not wild speculation to believe that a contested election would be downright dreadful for the country with mass demonstrations and riots erupting around the country. This would not be a positive for the markets). Interactive Brokers is taking notice. That is why they are now demanding higher cash levels from their active traders who use margin. Read the rest of it in the article below: Interactive Brokers braces for election volatility by telling clients to put up more cash Plain and simple, it seems very risky to get back to buying stocks now with this election risk growing in likelihood. And thus still expect downside to make the most sense with the 200 day moving average (the long term trend line) at 3,109 to get its first test since June. On the economic front the data in the US continues to improve. This was most notable in the PMI Composite Flash report from Thursday that came in at a hearty 54.4 with both manufacturing and services showing growth. Also today’s leap in Consumer Confidence from an anemic to 84.8 to a surprisingly good 101.8 is a reason for some renewed economic optimism. Conversely our friends across the pond in Europe are not having such a fun time as there is talk of a double dip recession. This is because a serious spike in Coronavirus cases is hampering their economy. That was on clear display in the Eurozone PMI Composite Flash report from last week at a barely expansionary 50.1. Unfortunately as you dig below the surface you see that the services sector has fallen back into contraction territory at 47.6. In the general the economic diseases caught in Europe don’t usually wash to our shores in the US. But in this case the weakness is because of a 2nd wave of Coronavirus and that is something that could occur in the US as well. So worth keeping an eye on. Note that the rest of the week there are some meaty economic announcements to consider such as ISM Manufacturing, ADP & Govt Employment reports. The upside potential of each is muted because of the aforementioned election concerns. But if there is renewed weakness in the data, then it likely will act as a fresh catalyst to the downside. Adding it altogether I believe the recently bolstered Reitmeister Total Return hedged portfolio is the right place to hang out with more market downside likely on the way. What To Do Next? Right now my Reitmeister Total Return portfolio has already taken steps to protect against the correction that likely will extend into (and beyond) the November election. All in all we have 8 positions that are just right for the times. 3 stocks that are uniquely built to excel during the Coronavirus recession. 2 precious metals ETFs because when the US government and Fed throw money out of a helicopter it devalues the dollar and makes precious metals all the more valuable. 3 inverse ETFs that rise as the market falls. This has been our saving grace in September as the market tumbled from recent highs. And likely will continue to rise in value as this correction has not yet run its course. But let’s be honest with ourselves. Its crazy out there! That’s why I am trying my best to help investors make sense of it all and profit from whatever scenario comes our way. The best way for me to do that is give you 30 days access to the Reitmeister Total Return. This is my newsletter service where I share more frequent commentaries on the market outlook, trading strategy, and yes, a portfolio of hand selected stocks and ETFs to produce profits whether we have a bull…a bear…or anywhere in between. As shared above, we properly called an end to the stock bubble in September and already aligned our portfolio to protect against the downside. That explains how we continue to handily top the market at this time while others are seeing dramatic losses. Just click the link below to see all 8 stocks and ETFs in this uniquely successful portfolio. Plus get ongoing commentary and trades to adjust your strategy as 2020 continues to be the wildest market in history. Gladly it can be tamed. About Reitmeister Total Return newsletter & 30 Day Trial Wishing you a world of investment success! Steve Reitmeister …but everyone calls me Reity (pronounced “Righty”) CEO, Stock News Network and Editor, Reitmeister Total Return SPY shares were trading at $336.52 per share on Wednesday morning, up $4.15 (+1.25%). Year-to-date, SPY has gained 6.06%, versus a % rise in the benchmark S&P 500 index during the same period."}]}