{"article": [{"url": "https://stocknews.com/news/mtch-lov-momo-3-online-dating-stocks-for-the-long-term/", "published": 1593691700.0, "headline": "3 Online Dating Stocks for the Long-Term", "body": "Not long ago, if you wanted to ask someone out on a date, you had to summon up the courage to go and talk to another human being face-to-face. However, times have changed and now there’s an app for that. Just like food delivery apps have made getting your meals easier and more convenient without having to talk to anyone, and navigation apps have eliminated the need to ask for directions, dating apps have simplified the process of meeting someone. Let’s take a look at 3 dating stocks that are helping people find love and companionship in this modern world we live in: 7 Best ETFs for the NEXT Bull MarketMatch Group, Inc. (MTCH) MTCH is the largest company in this space with 21 million users and has a portfolio of different properties including Match, Tinder, Hinge, plentyofFish, OkCupid, and several smaller, targeted offerings. In total, it has 9.9 million paying subscribers for $2.1 billion in revenue over the past 12 months and $796 million in adjusted EBITDA. The company claims that 60% of relationships in America that start through online dating are from a Match property. Match.com and Tinder are the most well-known ones. Tinder is the #1 most downloaded app, and the highest-grossing app on the Apple (AAPL) and Android app store. In 2019, 19% of all couples met online. If current trends persist, that figure will reach 30% sometime in the next decade. Match is the dominant stock in this category in terms of market share and monetization. (source: visualcapitalist.com) MTCH’s promising prospects are reflected in its strong POWR Ratings which rate it a “Strong Buy”. It’s graded an “A” in all categories including Trade Grade, Buy & Hold Grade, Industry Rank, and Peer Grade. Among Internet stocks, it’s ranked #12. Spark Networks, ADR (LOV) LOV has several well-known dating sites like JDate, Zoosk, Christian Mingle, and Elite Singles. The company is more focused on commitment-minded users targeted toward smaller niches based on religion, age, or interests with a slant towards compatibility. The company’s old-fashioned approach hasn’t been as appealing to Wall Street as shares are down 48% over the past year. In contrast, MTCH is up 61% over the same period. Although the stock has been a laggard, there are some positive developments. Earnings per share in the next 12 months are expected to climb by 91%. It has an attractive price to sales ratio with $167 million in sales compared to a $91 million market cap. Its latest earnings report showed continued growth with total registrations increasing 72% and paying subscribers increasing 113%. The company continues to grow with more users joining every day and through acquisitions. Momo Inc. (MOMO) Momo brands itself as the “Tinder of China”, however, this isn’t evident in the company’s stock chart. It’s down by 50% over the past six months. It’s one of the few stocks in the broader market that are making lower lows relative to the March bottom. Further, Chinese stocks have been pretty strong over the past couple of months with many breaking out to new highs. (source: finviz.com) Momo owns two of the three largest dating apps in China and has a market cap of $3.9 billion with $2.4 billion in sales. The company’s poor performance is puzzling given that it earned $455 million in net income over the past 12 months and expects to earn $570 million in the next 12 months which gives it a forward price to earnings ratio of 5.93. The average analyst target for the stock is $29 which gives it 65% upside from current levels. Traders and investors should watch this stock for signs of a trend change, as it could have upside. There’s always some concern with Chinese companies especially in light of these strong figures which are almost too good to be true, however, the stock is held by some well-known funds in large quantities like Renaissance Technologies and Blackrock (BLK). Want More Great Investing Ideas? 9 “BUY THE DIP” Growth Stocks for 2020 Is the Bull S#*t Rally FINALLY Over? 7 “Safe-Haven” Dividend Stocks for Turbulent Times Top 3 Investing Strategies for 2020 MTCH shares were trading at $98.74 per share on Thursday afternoon, down $6.93 (-6.56%). Year-to-date, MTCH has gained 20.25%, versus a -1.85% rise in the benchmark S&P 500 index during the same period."}]}