{"article": [{"url": "https://stocknews.com/news/iau-gld-gldm-sgol-the-4-largest-gold-etfs-to-buy-now/", "published": 1596110900.0, "headline": "The 4 Largest Gold ETFs to Buy NOW", "body": "Gold has been one of the strongest assets since the coronavirus disrupted markets and the economy. The metal has gained nearly 35% since its March lows and is now making new, all-time highs. The crisis has resulted in interest rates dropping, the Federal Reserve shifting to an extreme, dovish stance, and the federal government running deficits of more than $2 trillion. Given the extent of the damage, it’s clear that these measures are not going to end anytime soon. This will create a strong tailwind for gold prices. SPDR Gold Trust (GLD), iShares Gold Trust (IAU), SPDR Gold MiniShares Trust (GLDM), and Aberdeen Standard Physical Gold Shares ETF (SGOL) are the four, largest gold ETFs to buy now. 7 Best ETFs for the NEXT Bull MarketSPDR Gold Trust (GLD) GLD aims to reflect the price performance of gold bullion, minus the expenses of trust operations. This ETF moves in line with spot gold prices, as the underlying assets consist of gold bullion stored in secure vaults. This fund offers an excellent opportunity to hedge against the ongoing market volatility and weakening of the U.S. dollar. Since its March lows, GLD has grown by more than 30%. The fund has returned 39% over the past year and 29.6% year to date. The expenses ratio for GLD of 0.40% is lower than its category average of 0.45%, which makes it a low-cost option to invest in gold. How does GLD stack up for the POWR Ratings? A for Trade Grade A for Buy & Hold Grade B for Industry Rank A for Overall POWR Rating You can’t ask for better. The ETF is also ranked #1 out of 35 ETFs in the Precious Metals ETFs industry. iShares Gold Trust (IAU) With an investment objective of reflecting the performance of the price of gold, IAU aims to invest in a cost-conscious manner. The fact that IAU holds gold bars in a secure vault makes it an easier investment in gold, as investors do not need to think about storage. Since hitting its March lows due to the coronavirus induced market crash, IAU has gained more than 30%. The fund has returned 39.1% over the past year and 29.7% year to date. IAU has $30.44 million assets under management and its expense ratio of 0.25% is much lower than its category average of 0.45%, which makes the fund a cost-effective investment in its category. IAU is rated “Strong Buy” in our POWR Ratings system, consistent with the strength in the precious metal. It also has an “A” for Trade Grade and Buy & Hold and a “B” in Industry Rank. It is also ranked #2 out of 35 ETFs in the Precious Metals ETFs industry. SPDR Gold MiniShares Trust (GLDM) This fund also seeks to offer physically-backed exposure to gold. GLDM has assets under management of $3.14 billion. GLDM has also been performing pretty well amid the political and health uncertainty. It has added more than 30% to its price since hitting lows in March. GLDM has returned 39.4% over the past year and 29.8% year to date. The fund’s expense ratio of 0.18% is much lower than its category average of 0.45%, making it a low-cost option to bet on right now. It’s no surprise that GLDM is rated “Strong Buy” in our POWR Ratings system. It also has an “A” for Trade Grade and Buy & Hold Grade, and a “B” for Peer Grade and Industry Rank. In the 35 Precious Metals ETFs group, it is ranked #6. Aberdeen Standard Physical Gold Shares ETF (SGOL) SGOL holds gold bars in vaults in Switzerland and also runs audits twice a year. The fund’s ability to update investors on their investments in the gold market is reassuring. SGOL has grown by about 31% since its March lows. The fund has returned 24.1% over the past six months and 29.6% year to date. SGOL’s expense ratio of 0.17% is much lower than its category average of 0.45%, making it a low-cost option to invest in the precious metal. The ETF’s underlying index is London Gold Market Fixing Ltd and it has $2.50 billion assets under management. SGOL’s POWR Ratings reflect this promising outlook. It has an overall rating of “Strong Buy” with an “A” for Trade Grade and Buy & Hold Grade and a “B” for Industry Rank. Among the 35 ETFs in the Precious Metals ETFs group, it’s ranked #7. Want More Great Investing Ideas? 9 “BUY THE DIP” Growth Stocks for 2020 How HIGH Can This Tech Bubble Fly? 7 “Safe-Haven” Dividend Stocks for Turbulent Times IAU shares rose $0.01 (+0.05%) in after-hours trading Thursday. Year-to-date, IAU has gained 28.69%, versus a 1.69% rise in the benchmark S&P 500 index during the same period."}]}