{"article": [{"url": "https://stocknews.com/news/blk-stt-msci-3-etf-stocks-taking-over-the-financial-future/", "published": 1594296500.0, "headline": "3 ETF Stocks Taking Over the Financial Future", "body": "ETFs are taking over the stock market in terms of trading and investing. Trading in ETFs now accounts for about 30% of the daily average volume. On days of extreme volatility, it can reach above 40%. Passive investing is also increasing in popularity as many people are electing to put a portion of their portfolio in low-cost, diversified ETFs that give them exposure to a large part of the market. 7 \"SAFE HAVEN\" Dividend Stocks for Turbulent TimesOver the last decade, assets in ETFs have grown from $700 billion to over $4.3 trillion. At its current growth rate, it’s expected to hit $50 trillion by 2030 according to Bank of America. In contrast, mutual funds are seeing a much smaller pace of growth. Over the last decade, assets grew from $11 trillion to $21 trillion. Here are three stocks that are issuing and managing the ETFs that are revolutionizing the world of investing and trading: Blackrock (BLK) Blackrock is an interesting company that has managed to become integral to the functioning of the financial system. This was again confirmed by the Federal Reserve which chose BLK to manage its portfolio of junk bonds. BLK also owns iShares which is one of the largest ETF providers in the US. In total, BLK has 39.6% of the global ETF market. This brand equity has some intangible value, as it’s held in high regard across Wall Street. It’s the premier asset manager of choice for pension funds, governments, endowments, and unions due to their long track record of success and outperformance. Its price to earnings ratio of 20 is higher than the financial sector’s 12.5 which represents some of this premium. However, BLK is growing sales at 11% and has gross margins of 82% which is much higher than its peers. It also pays out a 2.6% dividend. BLK’s stock is up 250% over the last decade. Over the last two and a half years, BLK has been range-bound between $400 and $550. It’s now nearing an upside breakout, and there’s a good chance of follow-through given the combination of above-average dividends and above-average growth. The POWR Ratings are constructive on BLK as well with a Strong Buy rating. It has an “A” for Trade Grade, Buy & Hold Grade, and Peer Grade with “B” for Industry Rank. Among the Asset Management sector, it’s ranked #1 out of 45. State Street (STT) STT is one of the innovators in the ETF space with its SPDR S&P 500 ETF (SPY) which is the largest ETF with $275 billion in assets under management. It also has a well-known line of sector-based SPDR ETFs. STT has a $22 billion market cap, $11 billion in revenue, $3 trillion in assets, and $34 trillion in assets under custody. Despite being in one of the fastest-growing parts of the financial world, the stock is reasonably priced with a forward price to earnings ratio of 10.8 and a 3.2% dividend. STT also has an attractive price to book value of 1.0. Its stock has been trending lower since 2018 due to interest rates moving lower and a price-cutting war in the ETF world. Since STT holds so much cash, it can generate a risk-free return on that in short-term Treasuries. However, this is not the case in the current low-rate climate. Further, the ETF price war has intensified with many companies offering ETFs with no commissions, as they are desperate to not be left out of this growing market. MSCI (MSCI) MSCI is a market data and index provider with its customers being the largest asset managers including BLK and STT. Its largest source of revenue is from building proprietary indexes and then charges license fees for asset managers and exchanges to track and build products around them. This is a great business as its costs are relatively fixed but revenues are trending higher. Another revenue source for MSCI is market data and analytics for portfolio managers. These tools are designed to improve performance, find opportunities, and increase compliance and risk management. Like its licensing, its costs are relatively fixed. MSCI’s stock has been a big winner in nearly every timeframe. Over the year and a half, it’s up to 150%. It’s had a big rebound off the March lows, gaining 70%. In recent days, the stock market has broken out to a new, all-time high. Given its central role in the ETF ecosystem, MSCI has a promising outlook. Its POWR Ratings are also strong with a Strong Buy rating. It has an “A” for Trade Grade, Buy & Hold Grade, Peer Grade, and a “B” for Industry Rank. Among the Financial Services – Enterprise sector, it’s ranked #5 out of 135 stocks. Want More Great Investing Ideas? 9 “BUY THE DIP” Growth Stocks for 2020 Is the Bull S#*t Rally FINALLY Over? 7 “Safe-Haven” Dividend Stocks for Turbulent Times Top 3 Investing Strategies for 2020 BLK shares were trading at $549.53 per share on Thursday afternoon, down $8.08 (-1.45%). Year-to-date, BLK has gained 10.88%, versus a -1.30% rise in the benchmark S&P 500 index during the same period."}]}