{"article": [{"url": "https://stocknews.com/news/ago-omer-dvax-flxn-plce-5-downgraded-stocks-to-avoid/", "published": 1598011700.0, "headline": "5 DOWNGRADED Stocks to AVOID", "body": "The POWR Ratings are updated on a daily basis to reflect new developments and can help you identify risks and opportunities. During market rallies, it’s important to pay attention to the stocks that are underperforming. Sometimes, these can catch up to the market but more often it’s an indication that something is amiss. And, when the market’s trend turns, these stocks tend to be the most vulnerable. 7 \"SAFE HAVEN\" Dividend Stocks for Turbulent TimesThe POWR Ratings downgrade list gives a comprehensive look at these struggling names. Below, we provide a look at five recently downgraded stocks: Assured Guaranty (AGO), Omeros (OMER), Dynavax Technologies (DVAX), Flexion Therapeutics (FLXN) and The Children’s Place (PLCE). Assured Guaranty (AGO) The financial sector has been hit hard by the pandemic. Investing in a business that provides credit enhancement products for structured finance, public finance, and mortgage markets looks shaky given concerns that defaults are going to increase. This is precisely why AGO was recently downgraded. AGO has Fs and Ds in each of its POWR Rating POWR Components. AGO’s price returns were in the red for much of its history. In fact the stock has a year-to-date price return of -51% and a three-year price return of -42%. AGO has not even come close to recovering from the coronavirus sell-off. It is quite possible this stock will linger around the $15 to $20 mark in the months ahead. Omeros (OMER) The central nervous system is essential to human health and functionality. OMER develops and brings to market products that treat the central nervous system’s inflammation and disorders. However, there’s intense competition in this space. OMER has F grades in the POWR Rating Buy & Hold and Trade Components. The stock has a Peer Grade of D. Check out OMER’s price returns and you will find an abundance of red. OMER’s year-to-date price return is around -5%, its three-year price return is just under -40%. Though OMER had a brief spike up to $21.32 in early August, the stock quickly sold off, moving down to $13.41. The bottom line is OMER lacks a history of commercial success. Until the company makes measurable progress, investors should stay far away. Dynavax Technologies (DVAX) The treatment of infectious diseases, cancer, chronic inflammation, and allergies is big business. However, DVAX has been unsuccessful in creating effective treatments and bringing them to market. DVAX has F grades in its Trade Grade and Buy & Hold Grade POWR Components along with a D Peer Grade and a C Industry Rank. DVAX has a one-month price return of -43.69%, a ’19 price return of -37.49%, a three-year price return of -59.32%. It will prove awfully difficult for DVAX to compete with the big boys of the industry who have multi-billion dollar valuations unless the company receives an infusion of cash in the near future. Flexion Therapeutics (FLXN) One would think injectable pain therapies would be a reliable business with considerable potential moving forward. Though the majority of companies operating in this space have the potential to dramatically increase in value as time progresses, FLXN is not one of them. FLXN has not even come close to returning to its pre-COVID trading price of $17. The stock has slowly inched upward yet investors are quick to sell after each successive spike. FLXN is an underperformer considering its Industry Rank grade of A. The stock has F grades in its Trade and Buy & Hold POWR Components along with a D Peer Grade. All in all, FLXN is ranked 149 out of 217 stocks in the Medical – Pharmaceuticals space. FLXN’s year-to-date price return is -38.41%. The stock has a six-month price return of -26.34% and a three-year price return of -42.36%. Unless demand for FLXN’s osteoarthritis treatment known as Zilretta bumps back up in the near future, this stock will likely continue to struggle. It does not look like doctors’ offices will reopen any time soon due to the pandemic so FLXN is likely to stagnate or decline even more in the months ahead. The Children’s Place (PLCE) PLCE is being hurt as back-to-school spending is expected to be depressed this year given that 66% of kids will be doing remote learning. Additionally, PLCE has never successfully built an e-commerce division, and retail foot traffic is down. l learning and virtual learning reduces the demand for kids’ clothing all the more. If you have any doubt as to whether PLCE is likely to continue to fall in price, consider its F POWR Ratings grades in the Buy & Hold and Trade Grade POWR Components. The stock is ranked 52nd of 65 in the Fashion & Luxury category. Furthermore, PLCE had a 2018 price return of -36.99%, a ’19 price return of -28.65% and a year-to-date price return of -61.60%. Stay far away from this stock unless you are considering a short or a put. Want More Great Investing Ideas? The Best of StockNews 2 Step Process to Sell @ Market Top in September 9 “BUY THE DIP” Growth Stocks for 2020 AGO shares were trading at $22.48 per share on Friday morning, down $0.16 (-0.71%). Year-to-date, AGO has declined -53.14%, versus a 6.02% rise in the benchmark S&P 500 index during the same period."}]}