{"article": [{"url": "https://stocknews.com/news/urbn-amwd-asur-soho-sprt-5-stocks-to-avoid/", "published": 1595506100.0, "headline": "5 Downgraded Stocks to AVOID", "body": "The stock market has rebounded quite impressively following the coronavirus crash. However, some stocks have not performed up to expectations and are continuing to lag. Investors should pay attention to stocks that underperform when the broad market is strong as it’s often an indication of poor fundamentals. Our exclusive POWR Ratings upgrade and downgrade stocks on a daily basis after reviewing a wide array of factors and can help identify these laggards. The latest POWR Ratings results show the following stocks have been downgraded to either a Strong Sell or Sell rating: Urban Outfitters (URBN), American Woodmark Corporation (AMWD), Asure Software (ASUR), Sotherly Hotels (SOHO) and Support.com (SPRT). 7 \"SAFE HAVEN\" Dividend Stocks for Turbulent TimesUrban Outfitters (URBN) It was not long ago when URBN had some of the trendiest clothing around. The company has nearly half a dozen brands that sell clothing and décor both at conventional brick-and-mortar stores and on the web. Check out URBN’s POWR Ratings and you will find it has Fs in its Trade Grade and Buy & Hold Grade. The stock is ranked 43rd of 65 stocks in the Fashion & Luxury category. URBN has terrible price returns. You have to go back to 2017 to find URBN a year when it was green. Year to date, it’s 43% lower. The company has a three-year price return of -13% and a five-year price return of -53%. Out of the 13 analysts who have performed an in-depth review of URBN, eight recommend holding, one recommends selling and only four recommend buying. American Woodmark Corporation (AMWD) This is not the best time to be in the kitchen cabinet and vanity markets. Few people have the discretionary income necessary to perform kitchen remodeling. Furthermore, the new home construction market is not exactly booming amidst the pandemic. The POWR Ratings show AMWD has a D Grade in all POWR Components but for its Industry Rank. The stock is slotted in at #47 of 66 Home Improvement & Goods companies. AMWD has a year-to-date price return just under -30%. Though the company’s ’19 price return was solid, its three-year price return is a dismal -25%. Asure Software (ASUR) You would think internet-based workforce management services that empower companies to better manage offices including payroll and human resources functions would prove quite profitable during the pandemic. However, as revealed by the POWR Ratings, ASUR’s services are not proving that lucrative. ASUR has a D Grade in all POWR Components. The stock is ranked 8th of 10 in the Software – SAAS category. ASUR was trading over $9 per share prior to the March sell-off. The stock dipped down below $5, inched up to $6 and has stagnated from there. ASUR has a negative price return in each period of time going back three years but for the lone glimmer of hope in 2019. The company’s year-to-date price return is -27%. ASUR has a three-year price return of -56%. Sotherly Hotels (SOHO) You could not pick a worse time in human history to own upscale hotels. SOHO owns such hotels throughout the southeastern and mid-Atlantic parts of the United States. The POWR Ratings show SOHO is ranked dead last of 18 publicly traded companies in the REITs – Hotel category. SOHO has an F Trade Grade and Buy & Hold Grade. SOHO’s six-month price return is -60%. The company’s year-to-date price return is -62%. SOHO was holding steady between $6 and $7 up until the coronavirus outbreak. The stock dropped down to a dollar and change, spiked to $4 in June and reversed course back to $2. Steer clear of this hospitality stock until an effective vaccine is available. Support.com (SPRT) It was not long ago when the bulls were quite boisterous about SPRT. This provider of software for automating tech challenges has fallen on hard times due to increased competition in the category. The POWR Ratings show SPRT has Ds in all POWR Components but for its Industry Rank. SPRT is ranked 74 out of 82 stocks in the Software – Application category. Many companies are making lots of money in software but SPRT’s products have failed to catch on with customers. SPRT had a -55% price drop in ’19. The company also has a three-year decline of -40%. Want More Great Investing Ideas? 9 “BUY THE DIP” Growth Stocks for 2020 Newly REVISED 2020 Stock Market Outlook 7 “Safe-Haven” Dividend Stocks for Turbulent Times URBN shares were trading at $15.81 per share on Thursday morning, down $0.10 (-0.63%). Year-to-date, URBN has declined -43.07%, versus a 2.23% rise in the benchmark S&P 500 index during the same period."}]}