{"article": [{"url": "https://stocknews.com/news/ups-fdx-hubg-3-transportation-stocks-to-boost-your-portfolio/", "published": 1594728500.0, "headline": "3 Transportation Stocks to BOOST Your Portfolio", "body": "The increasing coronavirus case counts will lead to more people staying at home and choosing to shop online. In the parts of the country that are heavily affected, real-time economic data like credit card spending and restaurant reservations are already showing signs of turning lower. Even before the coronavirus, online shopping was growing at 14.9%, compared to 2% growth for overall, consumer spending. Earnings reports from e-commerce companies are showing revenue growth of 20-30% in the first quarter due to the shutdown orders. They will likely retain many of these customers when things get back to normal. Initially, it seemed that the virus would be under control by the summer, it now seems likely that we will have to live with the virus, until at least through the winter. Of course, air freight and shipping stocks are an important intermediary for e-commerce companies. They are also likely to see increased activity with online shopping becoming more popular. Here are three of the best stocks in this space: 7 \"SAFE HAVEN\" Dividend Stocks for Turbulent TimesUnited Parcel Service (UPS) The world’s top package delivery business is sure to benefit from more people shopping online. Instead of consumers picking up their goods at local stores, they will order online and UPS delivers them directly to their door. Even if an effective vaccine is developed, consumer behavior is likely to have changed to the point that fewer people choose to shop at traditional brick-and-mortar businesses, instead, opting for delivery by UPS. There is also a question of how many brick-and-mortar businesses will be left standing after the pandemic ends. If half of America’s retail stores close, there will be fewer traditional shopping options and consumers will be forced to buy even more items online. UPS stands to benefit from this development. The POWR Ratings have UPS rated as a Strong Buy with an A Trade Grade and an A Buy & Hold Grade. The company also has a B Peer and Industry Rank Grade. UPS is ranked first of nine stocks in the Air Freight & Shipping Services category. The rebound of the industrial economy combined with the uptick in e-commerce orders has the potential to send UPS toward its 52-week high of $125.31. FedEx (FDX) The “new economy” brought about by the pandemic favors businesses that transport goods and provide e-commerce solutions. These are FDX’s strengths. FDX is a POWR Ratings monster with an A Trade Grade and solid grades in all remaining POWR Components. The company is ranked third of nine Air Freight & Shipping Services stocks. The top analysts have set a price target of $164.35 for FDX, which is 5% above current prices. FDX has a reasonable forward P/E ratio of 15.58, indicating good value. However, FDX might be underpriced given its growth potential. Though FDX no longer ships on behalf of Amazon (AMZN), FDX’s quarterly earnings were quite impressive in subsequent quarters despite losing Amazon as a customer. FDX has since partnered with Microsoft (MSFT) in an attempt to upgrade its operations. The company’s joint project, dubbed FedEx Surround caters to high-margin commercial businesses to address supply chain challenges. FDX stands a good chance of moving toward its 52-week high of $178.50 as the pandemic continues. Hub Group (HUBG) Logistics and transportation management have always been important. Yet during the pandemic, we no longer take it for granted. Supply chains have wavered, making companies like HUBG that much more important. HUBG’s nationwide hub network strategically positioned near densely populated parts of the country has proven essential to maintaining the delivery of essential items. The POWR Ratings show HUBG is ranked in the top half of Air Freight & Shipping Services stocks with a B Trade and Industry Rank Grade. The stock has a one-year price return of nearly 30% and a three-year price return just under 29%. HUBG has an average analyst price target of over $51. It appears as though HUBG is on its way to returning to its pre-COVID high of $60. The company’s 52-week high is $60.42. The renewed focus on logistics and supply chain management are likely to work in HUBG’s favor and the growth in e-commerce. Want More Great Investing Ideas? 9 “BUY THE DIP” Growth Stocks for 2020 Top 5 WINNING Stock Chart Patterns 7 “Safe-Haven” Dividend Stocks for Turbulent Times UPS shares were unchanged in after-hours trading Tuesday. Year-to-date, UPS has gained 0.54%, versus a 0.11% rise in the benchmark S&P 500 index during the same period."}]}