{"article": [{"url": "https://stocknews.com/news/cat-chart-of-the-day-caterpillar-cat/", "published": 1596629300.0, "headline": "Chart of the Day: Caterpillar (CAT)", "body": "A key level of resistance has formed on the Caterpillar Inc. (CAT) chart. If this market continues to rally everyday, this level could be eclipsed soon. Caterpillar is the largest manufacturer of heavy equipment, power solutions, and locomotives. While the company has seen reduced demand due to the coronavirus, its cash and liquidity remain strong. Cash and short-term investments were $8.8 billion through the second quarter. The company has also reduced discretionary expenses and suspended 2020 base salary increases due to the pandemic. Take a look at the 1-year chart of CAT below with added notations: 7 Best ETFs for the NEXT Bull Market Chart of CAT provided by TradingView Over the course of the past six months, CAT has formed a key level of resistance at $140 (blue line). The stock has tested that $140 level several times since the beginning of the year. If/when the stock were to surpass and close above $140, a trader could buy the stock with the expectation of a breakout. The stock is currently trading less than 5% away from the $140 resistance level, so keep an eye out on CAT this week as the market continues to trend higher. Want to Discover More Great Trades? I have explored virtually every flavor of technical analysis and chart pattern known to mankind. The sad fact is that the vast majority of them don’t work at all. That is why I recently put together this presentation to help investors focus on the only 5 chart patterns that matter…the ones that lead to the most timely and profitable stock trades. Click below to learn these patterns and how to quickly find the 5 to 7 best trades today. 5 WINNING Stock Chart Patterns Have a good trading day! Good luck! Christian Tharp, CMT @cmtstockcoach CAT shares were trading at $134.10 per share on Wednesday morning, up $2.58 (+1.96%). Year-to-date, CAT has declined -7.03%, versus a 4.18% rise in the benchmark S&P 500 index during the same period."}]}