{"article": [{"url": "https://stocknews.com/news/swbi-rgr-vsto-3-gun-stocks-on-the-rise/", "published": 1592914100.0, "headline": "3 Gun Stocks on the Rise", "body": "Though the stock market has seen quite a rally, most economists believe we are in the midst of an economic recession. Some are worried that if the coronavirus cases continue to rise and force and/or it takes longer than expected to find a vaccine, this recession could lead to a depression. If that happens, we could see widespread social unrest, as people become frustrated, desperate and angry. As a result, gun sales are surging in the US. The FBI completed 1.6 million gun background checks last month — a 75% jump from the year prior, according to the National Shooting Sports Foundation 7 \"SAFE HAVEN\" Dividend Stocks for Turbulent TimesTherefore, gun companies such as Sturm, Ruger & Company (RGR), Smith & Wesson Brands (SWBI) and Vista Outdoor (VSTO) are likely to continue to see robust sales throughout 2020. Sturm Ruger & Co. (RGR) Outdoorsmen and responsible citizens alike are scooping up RGR firearms. RGR’s firearms are used for sporting purposes and also for self-defense. Between hunting, target practice and protecting one’s home, there are numerous reasons to pick up a RGR firearm. After all, we can’t go to sporting events nor can we feel safe in movie theaters, so why not head outdoors for some target practice? The POWR Ratings have RGR rated as a Strong Buy with A grades in all POWR Components but for its Industry Rank. Furthermore, RGR is ranked second of 65 stocks in the Air/Defense Services category. RGR has a one-year price return slightly above 35%. The company’s six-month price return is 55.98%. The analysts have set a price target of $80 for RGR, meaning there is more than 10% upside. RGR’s quarterly results released in May beat expectations with revenue jumping more than 8% on a year-over-year basis, hitting $123.6 million. Earnings per share increased nearly 18%. It is clear people desire RGR guns for self-defense and sporting purposes. American Outdoor Brands/Smith & Wesson Brands (SWBI) The riots and looting that occurred in the past few weeks have many people concerned for their safety and for their loved ones. Therefore, it isn’t surprising that we’ve seen an uptick in gun sales, which benefits SWBI. SWBI recently announced the stock will be split in two, divided up between its outdoor products and firearms. The company sells a wide variety of outdoor items, some of which are used for hunting. However, Smith & Wesson firearms are its bread and butter. S&W guns are revered across the globe for their quality, reliability and accuracy. The analysts have set an average price target of $22 for SWBI. SWBI trades at a forward P/E ratio of merely 10.41, meaning it has solid value at its current price. Add in the fact that the Supreme Court has decided to review appeals concerning a litany of gun control laws and there is even more reason to consider establishing a position in SWBI. Vista Outdoor (VSTO) When people buy guns, they also buy gun-related accessories. VSTO sells such accessories ranging from optics to eyewear, decoys, gun care products, game calls, targets, powder, mounts and more. VSTO’s brands include but are not limited to Bushnell, Gold Tip, Tasco, Weaver, GunMate, Redfield and Raskullz. The POWR Ratings have VSTO rated as a Strong Buy with As in all POWR Component categories but for its Industry Rank grade of B. The stock is ranked 7th of 31 stocks in the Athletics & Recreation space. The analysts’ high forecast for VSTO is $16. Look for VSTO to continue to climb upward as a result of social unrest and the emerging shift to outdoor activities. VSTO will likely zoom past its 52-week high of $14.12 this summer. Want More Great Investing Ideas? 9 “BUY THE DIP” Growth Stocks for 2020 Top 3 Investing Strategies for the Year Ahead 7 “Safe-Haven” Dividend Stocks for Turbulent Times SWBI shares fell $0.24 (-1.30%) in after-hours trading Tuesday. Year-to-date, SWBI has declined %, versus a -2.48% rise in the benchmark S&P 500 index during the same period."}]}