{"article": [{"url": "https://stocknews.com/news/tsla-plug-wkhs-3-stocks-to-electrify-your-portfolios-returns/", "published": 1600430900.0, "headline": "3 Stocks to ELECTRIFY Your Portfolio's Returns", "body": "The energy sector has been witnessing a slow but steady transformation due to climate change and more efficient alternative energy sources. Electric cars are another important part of the solution. In a report published by BloombergNEF in May this year, electric vehicles might share almost 28% of the global vehicle sales by 2030. There has been growing excitement among the investors about this trend. It’s also evident from the KraneShares Electric Vehicles and Future Mobility Index ETF (KARS) 75% return in the last six months. Moreover, Presidential candidate Biden plans a massive $2 trillion green infrastructure and jobs plan over his first term in office. If elected, Biden’s plan would push to make commuter trains, buses, and passenger vehicles run on electricity or clean energy. Hence, it could be a good idea to add Tesla, Inc. (TSLA), Plug Power Inc. (PLUG), and Workhorse Group, Inc. (WKHS) to your portfolio as these companies are working on electric or hydrogen-powered vehicles. 7 \"SAFE HAVEN\" Dividend Stocks for Turbulent TimesTesla, Inc. (TSLA) TSLA designs, develops, manufactures, and sells electric vehicles, electric vehicle powertrain components, and stationary energy storage systems in the United States, China, and internationally. It is the world’s only fully integrated sustainable energy company. TSLA has been highly volatile lately due to its recent developments. The company went for a five-for-one stock split in August to encourage retail participation. TSLA has recently decided to further dilute its shareholding by selling more stocks. The company announced that it will directly sell shares in the secondary market to raise approximately $5 billion. Moreover, the street anticipated its inclusion into the S&P 500 index, but the stock has not been included in the broader index yet. In the second quarter ended June 2020, TSLA generated $6.04 billion in revenues and managed to top 90,650 units of vehicle deliveries, despite the pandemic. The positive impact of higher vehicle deliveries, higher regulatory credit revenue, and higher energy generation and storage revenue did not fail to impress the market. In the second quarter, energy storage deployed increased by 61% quarter-over-quarter to 419 MWh. EPS for the last reported quarter came in at $0.5, growing 525% quarter-over-quarter. After the huge success of the Model 3 and Model Y car, TSLA may announce its new Model S Plaid soon which could lead to further upside for the stock. Moreover, investors are looking forward to the 2020 Annual Meeting of Stockholders and the Battery Day Event, scheduled next week. The street expects current year EPS to rise 4100% compared to the year-ago value. The stock gained 406% year-to-date to close yesterday’s session at $423.43. Strong product demand from China and its battery unique development are primarily driving the stock higher. The stock is up more than 395% in the last six months. How does TSLA stack up for the POWR Ratings? B for Trade Grade B for Peer Grade B for Industry Rank B for Overall POWR Rating The stock is also ranked #6 out of 29 stocks in the Auto & Vehicle Manufacturers industry. Plug Power Inc. (PLUG) PLUG is an alternative energy technology provider that engages in the design, development, manufacture, and commercialization of fuel cell systems for the industrial off-road markets worldwide. It provides hydrogen fuel cell turnkey solutions for the electric mobility and stationary power markets. PLUG has recently announced a new 1kW ProGen fuel cell system intended for small scale robotics, automatic guided vehicles (AGVs), and other aerospace applications. The company has been on an expansion spree lately. It has recently completed a $314 million worth follow-up public offering of its common shares. It has also issued $200 million worth convertible senior notes to improve its liquidity. Additionally, PLUG completed acquisitions of United Hydrogen and Giner Elx in the second quarter to accelerate its green hydrogen strategy. Despite the pandemic, PLUG managed to generate a revenue of $68 million in the last reported quarter, increasing 18% year-over-year. The company has efficiently managed and grown the capability of its supply chain to meet increased volumes while reducing costs. While PLUG reported a negative EPS of $0.03 for the quarter, the company is making big moves by signing new clients. Revenue is estimated to increase 34.7% in the current year while the EPS is anticipated to grow 25% per annum over the next 5 years. PLUG closed yesterday’s trading session at $12.84, gaining 306.3% year-to-date. Environmental concerns have boosted demand for clean hydrogen power and hence, the stock is exhibiting strong momentum. The stock is up more than 134% in the last three months and is trading 10.5% below its 52-week high of $14.35. PLUG’s POWR Ratings reflect a promising outlook. It has an overall rating of “Buy” with a “B” for Trade Grade, Buy & Hold Grade, Peer Grade, and Industry Rank. Among the 58 stocks in the Industrial – Equipment industry, it’s ranked #15. Workhorse Group, Inc. (WKHS) WKHS designs, manufactures, and sells electric, high-performance, medium-duty trucks. The company’s products include trucks comprising a powertrain and chassis. Their powertrain products include E-GEN and E-100. E-GEN is an electric, transmission-free system that works as an auxiliary generator while the E-100 is an all-electric, medium-duty truck. It has recently begun the production of its C-series electric step vans. WKHS has recently announced a new strategic alliance with the tech giant Hitachi group. The company was included in the Russell 3000 Index in June. The other catalyst favoring WKHS’s strength is its 10% stake in Lordstown Motors which is competing with Tesla to bring an electric pickup truck to market. The company is also developing electric delivery vans that would be suited for FedEx (FDX) and United Parcel Services (UPS). Moreover, WKHS is one of three finalists for a $6.3 billion worth contract to supply delivery vehicles to the US Postal Service. Revenue for the last reported quarter came in $92,000, increasing 1572.7% year-over-year. The company is still not making any profit and reported a negative EPS of $1.76 for the quarter. Research and development expenditure increased 33% year-over-year to $1.6 million, primarily due to an increase in engineering and consulting expenses related to the design of its latest C-Series. The company expects to produce and deliver 300 to 400 vehicles this year. Hence, its revenue is estimated to rise significantly in the coming quarters while the EPS is expected to grow 82.4% next year. The stock has gained more than 822% year-to-date to close yesterday’s trading session at $28.03. The stock gained momentum after the March-crash and skyrocketed in June when the company announced that two of its electric delivery vans had completed Federal Motor Vehicle Safety Standards testing, paving the way for its sales and production in the United States. The stock has increased by more than 1662% in the past six months. WKHS’s strong momentum is reflected in its POWR Ratings. It has a “Strong Buy” rating with an “A” in Trade Grade, Buy & Hold Grade and Peer Grade, and a “B” in Industry Rank. Within the Auto & Vehicle Manufacturers industry, it’s ranked #5 out of 29 stocks. Want More Great Investing Ideas? 7 Best ETFs for the NEXT Bull Market Is the Stock Market Correction Over? Chart of the Day- See the Stocks Ready to Breakout TSLA shares were trading at $441.85 per share on Friday afternoon, up $18.42 (+4.35%). Year-to-date, TSLA has gained 428.11%, versus a 3.65% rise in the benchmark S&P 500 index during the same period."}]}