{"article": [{"url": "https://stocknews.com/news/itb-xhb-pkb-3-home-builders-etfs-to-buy-as-new-home-sales/", "published": 1596110900.0, "headline": "3 Home Builders ETFs to Buy as New Home Sales Jump", "body": "One surprising development of the coronavirus has been increased housing demand. It’s surprising due to increased economic uncertainty. Additionally, health concerns have complicated the homebuying process in terms of realtors being able to show their clients’ homes. Despite these issues, demand has increased as people look to move out of urban areas cities due to cities areas having the most risks and the rise in remote work opportunities. Mortgage purchase applications are considered to be a leading indicator of housing demand, and they’re hitting new multi year highs. Pending home sales data was also stronger than expected, with June sales increasing 16.6% versus the previous month and 6.6% higher than June 2019. Given the extended period of zero percent interest rates, the number of Millennials who want to become homeowners over the last decade, and low housing supply, the housing market’s strength is going to persist. 7 Best ETFs for the NEXT Bull MarketThe iShares US Home Construction ETF (ITB), SPDR S&P Homebuilders ETF (XHB), and Invesco Dynamic Building and Construction ETF (PKB) are three ETFs to buy. iShares U.S. Home Construction ETF (ITB) ITB invests in construction and home building companies operating in the United States. The ETF is passively managed and tracks the underlying Dow Jones U.S. Select Home Construction Index. ITB’s major holdings include D.R. Horton Inc (DHI), Lennar Group (LEN), and NVR Inc (NVR). ITB has an expense ratio of 0.42%, comparatively lower than the category average of 0.52%. With $1.88 million assets under management (AUM) value, it is one of the best performing ETFs in its category. ITB has returned 45.6% to its investors in the last three months, and 17.7% year to date. ITB pays an annual dividend of $0.23, which yields 0.47% based on its current price. The ETF has a consistent dividend payout history. ITB hit its 52-week low on 18th March due to the pandemic-driven market crash but gained more than 130% since then. How does ITB stack up for POWR Ratings? A for Trade Grade A for Buy & Hold Grade A for Peer Grade A for Overall POWR Rating You can’t ask for better. It is also ranked #2 out of 33 ETFs in the Industrials Equities ETFs group. SPDR S&P Homebuilders 500 ETF (XHB) XHB is another major ETF primarily investing in home building and construction companies. It invests in both large and small-cap companies, thereby reaching a balance between risk and return. XHB’s main holdings include Whirlpool Corp (WHR), Pultegroup Inc. (PHM), and Carrier Global Corp (CARR). XHB’s expense ratio of 0.35% is significantly lower than its category average of 0.52%. The ETF has returned 41.9% in the last three months and 10.7% year to date. It is also a reliable dividend ETF, with a consistent quarterly payout history for 7 years. XHB pays an annual dividend of $0.43, yielding 0.88% on its prevailing price. XHB gained more than 105% to hit its 52-week high of $50.21 on July 29th since hitting its 52-week low in March, showing a strong recovery. XHB is rated as a “Strong Buy” ETF in our POWR Ratings system, with an “A” in Trade Grade, Buy & Hold Grade, Peer Grade, and Industry Rank. It is ranked #6 out of 42 ETFs in Consumer-Focused ETFs. Invesco Dynamic Building and Construction ETF (PKB) PKB invests in homebuilding and engineering companies based in the United States. PKB uses quant-based stock screens to choose relevant companies for its portfolio. It is a passively managed fund with 32 companies and follows the Dynamic Building & Construction Intellidex Index. PKB has slightly higher than the category average expense ratio of 0.60%. It has returned 35.4% to its investors over the last three months. PKB pays an annual dividend of $0.13 per share, yielding 0.4% on its current price. It is a reliable ETF for income investors with its dividend payout history of 6 years. PKB hit its 52-week low of $16.80 on March 18th due to the market crash. It has gained more than 100% since then. PKB is rated “Buy” in our POWR Ratings system. It holds an “A” in Trade Grade and a “B” in Buy & Hold Grade and Peer Grade. It is ranked #16 out of 33 in the Industrials Equities ETFs group. Want More Great Investing Ideas? 9 “BUY THE DIP” Growth Stocks for 2020 How HIGH Can This Tech Bubble Fly? 7 “Safe-Haven” Dividend Stocks for Turbulent Times ITB shares rose $0.25 (+0.48%) in after-hours trading Thursday. Year-to-date, ITB has gained 17.35%, versus a 1.69% rise in the benchmark S&P 500 index during the same period."}]}