{"article": [{"url": "https://stocknews.com/news/spy-earnings-season-is-upon-us-what-you-need-to-know/", "published": 1594210100.0, "headline": "Earnings Season is Upon Us, What You Need to Know", "body": "Last quarter’s earnings season was a riddle, wrapped in an enigma, in which investors were essentially willing to throw away the results and accept the lack of forward guidance from companies as the economy was shut down due to the Covid-19 virus. But now, as the reopening has begun (albeit in fits and starts) the rubber will meet the road and investors will want to get a handle on the immediate and longer-term impact. The earnings season will really kick off next week with the big banks such as “JPM Morgan (JPM)” , “Bank America (BAC)” and “Goldman Sachs (GS). The following week things shift into a higher gear as tech names start taking center stage with “Netflix (NFLX)” and “IBM (IBM)” two of the notable names reporting. This quarter’s reports will let us know whether the bell-weather stocks such as “AAPL (AAPL)” and “Microsoft (MSFT)” were truly immune to the economic shutdown and whether it was warranted for the major indices such as “SPDR 500 (SPY)” to return back to al time highs. Even under the best of circumstances earnings can be very tricky to trade as there are many moving and unknown parts; will the company miss or beat expectations, what will be the guidance, will traders ‘sell the news’ or buy into the unknown on the belief the recent decline has priced in a near worst-case scenario? 7 Best ETFs for the NEXT Bull MarketBut there is one predictable pricing behavior that savvy option traders use to produce steady profits. And given all recent volatility and with all of the unknowns, options premiums will be at record high levels, as market makers need to price options for outsized moves. So how does one trade earnings in a world without guidance? At 6pm Eastern tonight, veteran trader Adam Mesh and I are going to host a FREE Webinar that answers this question. We are going to discuss the best way to utilize options to generate profits this earnings season. So please join us, it will be a great event. Also, here’s a quick guide that I’ve created to give you a snapshot of my earnings season approach: Use the “Post Earnings Premium Crush” The one item we can count on is that no matter what a company reports or how the stock reacts the options will undergo a Post Earnings Premium Crush (PEPC) which is my label for how the implied volatility contracts sharply immediately following the report no matter what the stock does. You can see the repeating pattern of the implied volatility of NFLX options spiking and retreating on the quarterly reports. You’ll often hear traders cite what percentage move options are “pricing in” the earnings. The quick back of the envelope calculation for gauging the magnitude of the expected move is to add up the at-the-money straddle. This article does a great job of explaining how to use the straddle to both assess expectations and potentially profit. Once option traders are armed with this bit of knowledge they can advance to using spreads to mitigate the impact of PEPC when looking to make a directional bet. Some will graduate to getting this predictable pricing behavior in their favor by selling premium via strangles or the more sensible limited risk iron condors. But these strategies still carry the risk of trying to predict, if not the direction, then the magnitude of the move. The Pre-Earnings Trade The true professionals pursue a safer and more reliable path of positioning in anticipation of the increase in implied volatility that precedes earnings and avoids the actual event altogether. Just as PEPC is predictable so is the pumping up of premium leading into the event; it’s just more subtle in that it occurs incrementally over the course of many days. One strategy for taking advantage of rising IV leading into earnings is calendar spreads, in which you sell an option that expires prior to the earnings while simultaneously purchasing one that expires after the event. Like any calendar spread it will benefit from the accelerated decay of the nearer dated options sold short. But this has the added tailwind as earnings approach the option which includes the earnings will see it IV rise causing the value of the spread to increase. To keep the position delta neutral both put and call calendars should be established. These positions must be established in advance and closed before the actual earnings. The profits might not be as dramatic as catching a huge post-earnings move but they can be substantial. More importantly, they can be consistent and have a high probability. With weekly options, there should be plenty of situations in the coming weeks to take advantage of the rise in IV leading into earnings. This site provides a good starting point of a list of names and their options specific pricing tendencies. With most offering weekly options there should be plenty of opportunities for double calendars. As always, do your own research and confirm the reporting dates but this offers a great starting point. Just remember, a big move doesn’t guarantee a profit, you still have to get the direction and what the options expectations were pricing in. Good luck, keep social distancing and happy earnings. Kind regards, Steve Smith P.S. A reminder to please join me tonight at 6 pm ET on the webinar we’re calling “Learn How To Harness The Power And Profit from Earnings Season.” The training you’ll receive is FREE, all you need to do is register. Want More Great Investing Ideas? 9 “BUY THE DIP” Growth Stocks for 2020 Is the Bull S#*t Rally FINALLY Over? 7 “Safe-Haven” Dividend Stocks for Turbulent Times Top 3 Investing Strategies for 2020 SPY shares were trading at $314.24 per share on Wednesday afternoon, up $0.46 (+0.15%). Year-to-date, SPY has declined -1.36%, versus a % rise in the benchmark S&P 500 index during the same period."}]}