{"article": [{"url": "https://stocknews.com/news/lly-nvo-amgn-3-stocks-bargain-hunters-dont-want-to-ignore/", "published": 1594123700.0, "headline": "3 Stocks Bargain Hunters Don't Want to Ignore", "body": "The market is close to recovering from the sell-off driven by the coronavirus pandemic. The S&P 500 has gained more than 40% since its low closing price of 2,191 in March. While several stocks have rebounded, there are still some great stocks trading at affordable prices. Whether the market continues to go up or reverses course, this is a great opportunity to find a few good stocks trading at attractive prices. Eli Lilly and Company (LLY) 9 \"BUY THE DIP\" Growth Stocks For 2020LLY develops and manufactures pharmaceutical products for global consumption. The company has been in the headlines recently as it is developing a potential coronavirus drug. Their drug Olumiant is currently in Phase 3 clinical trials. If the drug successfully makes it to market, LLY stands to make substantial gains. This stock has an average analyst price target of $173.56. The company has also made consistent dividend payments over the last ten years. LLY currently has a dividend yield of 1.8% and a payout ratio of 45.8%. LLY is one of the top rated stocks in our momentum based POWR Ratings system. Overall, it is the #1 ranked stock in the #6 ranked industry (Medical – Pharmaceuticals Stocks). The stock has returned 28.7% year to date. Novo Nordisk (NVO) This pharmaceutical company focuses on diabetes care and bio-pharmaceuticals. NVO recently acquired Corvidia Therapeutics in a deal worth $725 million. This move will help the company solidify its position in the cardio-metabolic disease sector, which is closely related to its core businesses of diabetes and obesity care. NVO has a sound balance sheet with a return on equity of 74.3%, and a price to sales ratio of 8.1, which is lower than the industry average of 13.0. NVO has a dividend yield of 1.69% and has returned more capital to its investors than 98.4% of other US stocks that pay dividends. NVO’s has an average analyst price target of $72. NVO almost gets straight As. By that, I mean that 4 out of 5 scores of our exclusive POWR Ratings system is an A for the stock. It also the #2 ranked stock in one of the top industries, (Medical – Pharmaceuticals Stocks). Amgen (AMGN) AMGN focuses on the treatment of illnesses in the cardiovascular, bone health, and hematology areas. The company could see significant growth in revenues due to the release of three new drugs, Repatha, Otezla, and Evenity. The company also recently benefited from a court judgment on two of its patents. An appeals court ruled in favor of the AMGN, upholding the validity of two patents on its rheumatoid arthritis drug Enbrel. Like NVO, AMGN also has a high return on equity. Its ROE of 80.9% is considerably more than the industry average of 30.3. The stock has an average analyst price target of $256.25. AMGN has a dividend yield of 2.50% and a payout ratio of 41.5%. How does AMGN stack up for the POWR Ratings? A for Trade Grade A for Buy & Hold Grade A for Industry Rank A for Peer Grade A for overall POWR Rating You can’t ask for better, including the fact that it is the #1 rated stock in the Biotech industry. Want More Great Investing Ideas? 9 “BUY THE DIP” Growth Stocks for 2020 Is the Bull S#*t Rally FINALLY Over? 7 “Safe-Haven” Dividend Stocks for Turbulent Times Top 3 Investing Strategies for 2020 LLY shares were trading at $166.92 per share on Tuesday afternoon, up $0.03 (+0.02%). Year-to-date, LLY has gained 28.26%, versus a -0.66% rise in the benchmark S&P 500 index during the same period."}]}