{"article": [{"url": "https://stocknews.com/news/vz-mrk-pfe-3-undervalued-mega-cap-stocks-to-buy-now/", "published": 1597666100.0, "headline": "3 UNDERVALUED Mega-Cap Stocks to Buy Now", "body": "This year has been a roller coaster ride for investors. There was a market crash in March due to the coronavirus which was followed by a substantial recovery. Certain companies have exceeded their pore-coronavirus highs, as they are thriving in the “new normal”. However, there are still a few mega-cap stocks that are trading at a discount and offer intriguing upside. These stocks have solid balance sheets and stable businesses that will continue to grow earnings in the coming years. They also pay above-average dividends. While bargain hunting, narrowing down the list to Mega-Cap companies can ensure stability and financial flexibility. Verizon Communications Inc. (VZ), Pfizer, Inc. (PFE), and Merck & Company, Inc. (MRK) are three mega-cap stocks that are currently available at markdown prices. 7 Best ETFs for the NEXT Bull MarketVerizon Communications Inc. (VZ) VZ is a $242.74-billion company that offers voice, data, and video services and solutions on its networks and platforms. The stock has a forward P/E ratio of 12.32 and a Price/Cash Flow ratio of 6.64, which are both lower than their respective industry averages. In the second quarter, VZ reduced its net debt by $5.7 billion, and the company reported an EPS of $1.13 as compared to $0.95 in the previous year period. VZ ended the first half of 2020 with a free cash flow of $13.7 billion, an increase of 74.1% year-over-year. VZ’s earnings surprise history looks pretty good, with the company beating consensus EPS estimates in three out of the trailing four quarters. The stock has returned more than 15% since its March lows. VZ has been selected by Bayer to develop next-generational global network infrastructure to improve the company’s network management worldwide. Recently, VZ also led a $4.5 million Series A financing round in PICadvanced (PICa). The company’s disciplined network strategy and wireless customer growth are encouraging signs for long term growth. How does VZ stack up for the POWR Ratings? A for Trade Grade A for Buy & Hold Grade A for Peer Grade B for Industry Rank A for Overall POWR Rating You can’t ask for better. The stock is also ranked #1 out of 24 stocks in the Telecom-Domestic industry. Pfizer, Inc. (PFE) PFE, one of the world’s largest pharmaceutical companies with a market cap of $212.50 billion, announced a multi-year agreement with Gilead Sciences (GILD) to bolster the supply of Gilead’s investigational antiviral remdesivir for the treatment of Covid-19. The stock has grown more than 30% since its March lows. PFE has an EV/EBITDA ratio of 10.10 and a Price/Book ratio of 3.28, which are both lower than their respective industry averages. The average analyst price target of PFE is $41.88, which represents a potential upside of 10%. PFE is also working in collaboration with BioNTech (BNTX) to develop a vaccine for coronavirus. The company announced that two out of the four vaccine candidates under the BNT162 Mrna-based vaccine program were granted Fast Track designation from the FDA based on the positive initial data of phase1/2 clinical studies in Germany and the United States. The companies began phase 2b/3 selecting BNT162b2 as the lead vaccine candidate and remain on track for regulatory review as early as October this year. If the trials are successful, the companies will be able to manufacture up to 100 million doses by the end of 2020 and approximately 1.3 billion doses by the end of next year. PFE and BioNTech have recently agreed to supply their BNT162 mRNA-based vaccine candidate to Canada and Japan contingent on clinical success and regulatory approval. PFE has an impressive earnings surprise history with the company beating consensus EPS estimates in three out of the trailing four quarters. PFE’s POWR Ratings reflect this promising outlook. It has an overall rating of “Strong Buy” with an “A” for Trade Grade, Buy & Hold Grade, and Peer Grade. It has a grade of “B” for Industry Rank. Among the 215 stocks in the Medical-Pharmaceuticals industry, it’s ranked #2. Merck & Company, Inc. (MRK) MRK is a $213.92-billion biopharmaceutical company that researches and develops vaccines and medicines to improve lives. MRK treats diseases such as cancer, infectious diseases like HIV and Ebola, and emerging animal diseases. MRK has an average analyst price target of $93.50, which represents a potential upside of 10.9%, and the company’s earnings yield of 6.7% is lower than the industry average. The stock has gained more than 15% since its March lows. MRK has been working with IAVI and has acquired Themis for the development of V590 and V591, respectively, which are two vaccine candidates for Covid-19. Furthermore, MRK has also collaborated with Ridgeback Bio to develop an oral antiviral candidate called MK-4482 for the treatment of Covid-19, which is currently in Phase 2 trials. Merck Animal Health acquired IdentiGEN, which will improve Farm-to-Table Animal Traceability Solutions for Livestock and Aquaculture. Recently, the FDA accepted two new supplemental Biologics License Applications for KEYTRUDA in Triple-Negative Breast Cancer. In the second quarter, GAAP EPS increased by 15%, and GAAP net income increased by 12% year-over-year. MRK has an impressive earnings surprise history with the company beating consensus EPS estimates in each of the trailing four quarters. MRK’s EPS is expected to grow by 6.3% per annum in the next five years. It’s no surprise that MRK is rated “Buy” in our POWR Ratings system. It also has an “A” for Trade Grade and Peer Grade, and a “B” for Buy & Hold Grade and Industry Rank. In the 215-stock Medical-Pharmaceuticals industry, it is ranked #10. Want More Great Investing Ideas? The Best of StockNews 3 Possible Directions for the Stock Market from Here 9 “BUY THE DIP” Growth Stocks for 2020 VZ shares were trading at $58.76 per share on Monday afternoon, down $0.03 (-0.05%). Year-to-date, VZ has declined -1.17%, versus a 6.07% rise in the benchmark S&P 500 index during the same period."}]}