{"article": [{"url": "https://stocknews.com/news/lly-abbv-zts-nbix-4-top-pharmaceutical-stocks-for-the-second-half-of-2020/", "published": 1593691700.0, "headline": "4 Top Pharmaceutical Stocks For The Second Half of 2020", "body": "Pharmaceutical stocks have been soaring in the past couple of months. Many are nearing their 52-week highs and could easily eclipse these levels in the second half of 2020. Though many investors are concerned about a possible stock market retracement as the coronavirus continues to spread throughout the US, drugmakers typically have significant financial flexibility to weather most economic environments. That’s because they sell products that are needed by people regardless of how good or bad the economy is doing. Here are four pharmaceutical stocks that could continue to soar for the remainder of 2020: 7 \"SAFE HAVEN\" Dividend Stocks for Turbulent TimesEli Lilly & Co (LLY) LLY is a pharmaceutical giant, with a market capitalization of $156 billion. It operates in two segments: Human Pharmaceutical products and Animal Health products. The company has a large drug-development pipeline with dozens of projects in late-stage development, seven different therapies in regulatory review, and two recently approved drugs that will be hitting the market soon. In the past few months the company has been developing antibody products for the treatment and prevention of COVID-19 with AbCellera, a privately owned biotech company. LLY currently pays a 1.81% dividend and it’s stock price is just about 2% away from it’s all-time high of $167.43. According to TipRanks.com, five of nine Wall Street analysts have a “Buy” rating on the stock. The stock also has an Overall POWR Rating of A (Strong Buy) and tops the POWR Industry Rankings in the Medical-Pharmaceutical industry. LLY has a grade of “A” in all its POWR components except Industry Ranking in which it has a grade of “B”. LLY has returned 111.71% over the past three years and 45.78% over the past year. AbbVie Inc. (ABBV) AbbVie operates in the realm of key therapeutic areas in medicine such as virology, neuroscience, immunology, oncology, gastroenterology. The company has recently joined the race to find a cure for the coronavirus with an aim to develop a novel antibody therapeutic by joining forces with Harbour BioMed, Utrecht University and Erasmus Medical Centre. The American biopharmaceutical company declared a quarterly cash dividend of $1.81 per share which is payable to shareholders on 20th August this year. ABBV has a Dividend Yield of 4.76% and a Payout Ratio of 51.2%. The stock generated a price return of 40.13% in a year’s time and 15.18% year to date. The average analyst price target is $110.25 and ranks #2 out of 214 stocks in the Medical-Pharmaceutical space and has an Overall POWR Rating of ‘Strong Buy’. ABBV has a grade of A in all of its POWR components but for industry rank in which it has a grade of “B”. Zoetis Inc. (ZTS) Zoetis is the largest animal health company in the world and its business deals with the manufacture and development of vaccines and animal health medicines. Pets and their health care needs are “recession proof.” Most pet owners will spend thousands of dollars on their pets, especially if they are sick or need medical care. ZTS is a Strong Buy according to POWR Ratings and ranks #3 out of 214 stocks in the POWR Industry Ranking. The stock has a Peer Grade of “A”. The stock has gained 111.71% over the last three years and 45.78% over the past year. The stock is currently trading right near 52-week highs. Neurocrine Biosciences, Inc. (NBIX) Neurocrine is a biopharmaceutical company that focuses on the treatment of neurological and endocrine related diseases. NBIX recently announced a multi drug partnership with Takeda in which Neurocrine gets the license to seven of Takeda’s psychiatry programs. This will help the company expand its clinical resources. NBIX has an Overall POWR Rating of a Strong Buy with a grade of “A” in Trade and Buy & Hold. Twelve analysts recommend a buy rating on this stock. The year-to-date return of NBIX is 17.07% and the stocks returned 46.67% over the past year. The stock is approaching its 52-week high of $131 which could mean a bullish trend during this period. The stock ranks #4 out of 214 in the Pharmaceutical industry according to the POWR Industry Rankings. Want More Great Investing Ideas? 9 “BUY THE DIP” Growth Stocks for 2020 Is the Bull S#*t Rally FINALLY Over? 7 “Safe-Haven” Dividend Stocks for Turbulent Times Top 3 Investing Strategies for 2020 LLY shares . Year-to-date, LLY has gained 25.92%, versus a -1.99% rise in the benchmark S&P 500 index during the same period."}]}