{"article": [{"url": "https://stocknews.com/news/sedg-emph-run-vslr-4-solar-stocks-with-a-bright-future/", "published": 1601986100.0, "headline": "4 Solar Stocks with a “Bright” Future", "body": "The stock market might be on the cusp of a prolonged decline, especially if COVID-19 continues to spread and causes increased damage to the economy. However, there are some companies that will continue to trend upwards, even amidst lengthy political and social uncertainty. These are solar companies that are so promising that they should buck the market trend and continue to ascend regardless of extraneous factors. Let’s take a look at four solar stocks likely to maintain bull runs regardless of the state of a seemingly uncertain economy, government, and overarching society amidst the pandemic: SolarEdge Technologies (SEDG), Enphase Energy (ENPH), Sunrun (RUN), and Vivint Solar (VSLR). 7 \"SAFE HAVEN\" Dividend Stocks for Turbulent TimesSolarEdge Technologies (SEDG) Solar stocks have been blazing hot in recent months. However, selecting the cream of the crop is challenging, considering the sheer number of publicly-traded solar companies. SEDG appears to have a particularly bright future. SEDG offers inverter solutions, power optimizers, and a high-tech monitoring platform that functions with the cloud. SEDG provides residential solar installations as well as solar installations for commercial enterprises. This renewable energy powerhouse has operations throughout the United States and Europe, providing affordable solar solutions to both companies and individuals. The company’s revenue has soared an average of 45% each year since 2015. SEDG has “A” grades in the Buy & Hold and Trade components of the POWR Ratings, a “B” for Industry Rank, and a top-ranking in the Solar industry. Though SEDG is only a couple dollars away from its 52-week high of $265.42, it just might blast right on past this benchmark and continue to ascend. Enphase Energy (ENPH) Another solar industry superstar, ENPH, creates and sells solar solutions for residences. These solutions connect the generation, storage, and control of energy through a single, smart platform. The company’s primary products are microinverters. ENPH ships more than a couple million microinverters every year. Furthermore, ENPH’s solar systems have been deployed in more than 130 countries. ENPH POWR Ratings are nearly perfect: “A” grades in Trade Grade and Buy & Hold Grade and “B” grades in the remaining components. ENPH is ranked in the top two out of 14 businesses in the Solar industry Of the 15 analysts who have studied ENPH, nine insist it is a “Buy”, six advise holding, and none advise selling. J.P. Morgan analysts recently increased their ENPH price target by $12, thinking it will reach the low $90s within a year. It is clear the company’s microinverter business has serious potential for residential homeowners across the world, as evidenced by its sales doubling to more than $600 million last year. ENPH is now profitable, setting the stage for a bull run. Sunrun (RUN) RUN provides solar services in the form of direct channels to consumers and mounting structures with its SnapNrack brand. RUN, a San Francisco-based company, operates in more than 15 states. RUN has an “A” Trade Grade in the POWR Ratings and “B” grades in the remaining components. Furthermore, RUN is ranked in the top half of solar stocks. Though RUN has had quite the epic bull run in recent months, it is still priced more than $5 below its 52-week high of $82.42. RUN’s power storage solutions prove particularly helpful to those devastated by wildfires and other natural disasters. Vivint Solar (VSLR) As time progresses and the planet warms, many more homes will rely on solar energy systems, many of which will be provided by the likes of VSLR. VSLR makes, installs, and maintains such systems. VSLR also offers photovoltaic installation devices and software. VSLR’s POWR Ratings are nearly perfect, highlighted by “A” grades in the Peer Grade and Trade Grade components. Out of nearly 15 stocks in the Solar industry, VSLR is ranked third. VSLR’s forward P/E ratio is more than 3,150. If the stock dips in the days or weeks to come, it may offer an opportunity for investors who have been waiting on the sidelines to consider establishing a position. Want More Great Investing Ideas? Do NOT Buy Stocks Before the Election! 7 “Safe-Haven” Dividend Stocks for Turbulent Times Chart of the Day- See Christian Tharp’s Stocks Ready to Breakout SEDG shares rose $1.01 (+0.37%) in premarket trading Tuesday. Year-to-date, SEDG has gained 189.20%, versus a 7.11% rise in the benchmark S&P 500 index during the same period."}]}