{"article": [{"url": "https://stocknews.com/news/ko-pep-mnst-bf-b-are-shares-of-coca-cola-a-buy-sell-or-hold/", "published": 1600171700.0, "headline": "Are Shares of Coca-Cola a Buy, Sell or Hold?", "body": "Coca-Cola Company (KO) is the world’s largest total beverage company that manufactures and markets various nonalcoholic beverages worldwide. The company offers over 500 brands in more than 200 countries and territories. The 134-year-old company is constantly transforming its portfolio by reducing sugar in its drinks and bringing innovative new products. KO is also working to reduce environmental impact by replenishing water and promoting recycling. The beverage giant is a decades-long top holding of famed investor Warren Buffett’s Berkshire Hathaway (BRK.A), which maintains an ownership stake of over 9% today. However, in the second quarter, the KO’s top-line declined 28% and the earnings per share were down 32%, year-over-year, primarily driven by pressure in away-from-home channels. Moreover, the global unit case volume declined 16% during the quarter as a result of the pandemic. Despite the high degree of uncertainty, the company is well-positioned to emerge stronger as consumer confidence increases. Its current focus is on maintaining strong system economics, strengthening its reputation with stakeholders, and positioning the organization to win in the “new normal.” KO retains potential upside based on several factors that have helped it earn a “Buy” rating in our proprietary rating system. 7 Best ETFs for the NEXT Bull MarketHere is how our proprietary POWR Ratings system evaluates KO: Trade Grade: A KO is currently trading higher than its 50-day and 200-day moving averages of $47.87 and $49.92, respectively, indicating that the stock is in an uptrend. The stock’s 11.2% return over the past three months reflects a solid short-term bullishness. Globally, KO’s zero-sugar products have been performing extremely well. As of 2019, 45% of its beverage portfolio was either low-sugar or no-sugar, and 18 of its 20 top brands offer variants with those options. The company’s organic sales grew 6% year-over-year in the preceding year. However, disruption caused by the pandemic resulted in revenue to drop by 26% in the second quarter of 2020, but management raised its dividend payout and expects a rebound in the remainder of the year. Buy & Hold Grade: B KO is well positioned in terms of proximity to its 52-week high, which is a key factor that our Buy & Hold Grade takes into account. The stock is currently trading 15.6% below its 52-week high. The stock has gained close to 21.3% in the last three years due to its innovative product line and steady growth in the user base. It has an impressive long-term performance history, as its net income grew at a CAGR of 30% over the past three years. It is a Dividend King, one of the S&P 500 companies that have raised dividends for at least 50 straight years. In March, KO hiked its quarterly dividend payment to $0.41, bringing its streak to a remarkable 58 years. Hence, the stock is an all-time favorite for income investors. Peer Grade: B KO is currently rated #9 out of 29 stocks in the Beverages industry. Other popular stocks in the industry are PepsiCo, Inc. (PEP), Monster Beverage Corporation (MNST), and Brown Forman Inc (BF.B). All of KO’s peers have comfortably beaten its year-to-date return. While PEP returned nothing this year, MNST and BF.B returned 30.4% and 17.6%, respectively, over this period. Industry Rank: B The Beverages industry is ranked #10 out of the 123 StockNews.com industries. Since the onset of the health crisis, the stay-at-home orders have severely impacted the industry, resulting in declining sales at restaurants, convenience stores, and gas stations. However, growing at-home consumption of beverages has helped the industry stay afloat. Nevertheless, the U.S. soft drinks sales are expected to grow by 6.5% annually between 2020 and 2025. Overall POWR Rating: B (Buy) Overall, KO is rated a “Buy” due to its impressive past performance, short-and-long-term developments, and strength in its financials, as determined by the four components of our overall POWR Rating. Bottom Line KO has been severely affected by the pandemic and has lost 8% so far this year. Nevertheless, the stock is a decent investment for investors looking for stable dividends along with capital appreciation in the long run. The company has been modifying its strategy to accomplish long-term goals. The growth should resume after the pandemic’s impacts subside, as KO has the potential to grow based on its diversified business model. Analyst sentiment, which gives a good sense of a stock’s future price movement, is pretty impressive for KO. The average broker rating of 1.26 indicates a favorable analyst sentiment. Of the 21 Wall Street analysts that rated the stock, 14 have given it a “Strong Buy” rating. The market expects EPS for the next year to rise by 14.4% year-over-year. Want More Great Investing Ideas? 7 Best ETFs for the NEXT Bull Market Is the Stock Market Correction Over? Chart of the Day- See the Stocks Ready to Breakout KO shares were trading at $50.93 per share on Tuesday afternoon, up $0.22 (+0.43%). Year-to-date, KO has declined -5.58%, versus a 7.03% rise in the benchmark S&P 500 index during the same period."}]}