{"article": [{"url": "https://stocknews.com/news/nuan-chart-of-the-day-nuance-communications-nuan/", "published": 1594901300.0, "headline": "Chart of the Day: Nuance Communications (NUAN)", "body": "Nuance Communications (NUAN) has surged since it hit its 52-week low in March. Not only has it regained all of it’s losses but it’s surpassed its previous 52-week high and is now consolidating near all-time highs. NUAN is the pioneer in conversational Artificial Intelligence (AI) innovations that bring intelligence to everyday work and life. The company delivers solutions that understand, analyze, and respond to people amplifying human intelligence to increase productivity and security. Last month at the Society for Imaging Informatics in Medicine virtual annual meeting, NUAN announced that the Nuance® AI Marketplace for Diagnostic Imaging is accelerating AI adoption for radiologists at leading US healthcare systems. This should serve as a catalyst for future growth prospects. 9 \"BUY THE DIP\" Growth Stocks For 2020As you can see in the 1-year chart below, NUAN has been consolidating under its 52-week and all-time high of $26 (red) and a resistance level as formed: Chart of NUAN provided by TradingView A solid close above $26 should lead to another leg higher for NUAN. If this happens I believe NUAN would reach $28 quickly. As you can see in the chart above, NUAN seems to move in $2 surges when levels are broken. Also, something traders should pay attention to is NUAN’s August 5th earnings release date. Quarterly earnings reports often bring additional volatility to a stock. Have a good trading day! Good luck! Christian Tharp, CMT @cmtstockcoach Want More Great Investing Ideas? 9 “BUY THE DIP” Growth Stocks for 2020 Top 5 WINNING Stock Chart Patterns 7 “Safe-Haven” Dividend Stocks for Turbulent Times NUAN shares were trading at $25.47 per share on Thursday morning, up $0.14 (+0.55%). Year-to-date, NUAN has gained 42.85%, versus a 0.47% rise in the benchmark S&P 500 index during the same period."}]}