{"article": [{"url": "https://stocknews.com/news/vxrt-mrna-why-are-shares-of-vaccine-maker-vaxart-surging-this-week/", "published": 1600171700.0, "headline": "Why are Shares of Vaccine Maker Vaxart Surging this Week?", "body": "Vaxart (VXRT) soared more than 46% in Monday’s trading and has hit its highest in three weeks. The FDA gave Vaxart the green light to begin a human Phase 1 trial for its vaccine candidate. An orally-administered vaccine requires no refrigeration and could leapfrog rival projects. The race to clinch a coronavirus vaccine is still on – and a latecomer may become a winner. That is at least the signal from investors. Shares of Vaxart Inc., the California-based biotechnology company, soared by over 46% on Monday. Shares are now trading at their highest since late August, and the firm is close to a valuation of $1 billion. There is still room to rise toward the 52-week high of $17.49 and the interim peak of $10.50. A downward correction may result in the stock price finding support at $5, which has cushioned it in recent weeks. VXRT Stock News 9 \"BUY THE DIP\" Growth Stocks For 2020VXRT surged after the American Food and Drugs Administration (FDA) gave the green light for the company to begin a human Phase 1 trial of its COVID-19 vaccine candidate. With Russia already having declared victory in the race for a vaccine and several companies busy in Phase 3 trials, Vaxart may seem like a late-comer. However, the company’s solution has several advantages. First, it is administered orally rather than by injection, making it easier to administer. Almost anyone is able to swallow a pill, while an injection often requires a medical professional to conduct. Second, the tablets do not require storage in cold conditions. One leading candidate, being created by Moderna (MRNA), requires extremely low refrigeration temperatures to maintain their quality. Vaxart’s pills can, therefore, be distributed and stored at a much lower cost. The third advantage is that the company will receive funding from the US government via Operation Warp Speed. That means it has more money to manage and analyze the test. Also, its connections with federal officials could help in securing approval if all trials conclude successfully. VXRT shares were trading at $6.50 per share on Tuesday afternoon, down $1.28 (-16.45%). Year-to-date, VXRT has gained 1,754.49%, versus a 6.76% rise in the benchmark S&P 500 index during the same period."}]}