{"article": [{"url": "https://stocknews.com/news/dao-avro-mrus-pnrg-4-downgraded-stocks-that-arent-worth-the-risk/", "published": 1600430900.0, "headline": "4 DOWNGRADED Stocks That Aren't Worth the Risk", "body": "The latest POWR Ratings have arrived. A wide array of stocks were upgraded and downgraded in the past 24 hours. The market is in an interesting place, following its recent correction. This week, it’s been consolidating in a tight range. If the market breaks lower, then it’s likely that certain stocks on the downgrade list could see the most sizable losses. It could be a good time to reduce exposure to these positions. ly exiting those positions. Without further adieu, here are four of the latest POWR Rating downgrades: Youdao (DAO), Avrobio (AVRO), Merus (MRUS), and PrimeEnergy (PNRG). 7 Best ETFs for the NEXT Bull MarketYoudao (DAO) If you are hesitant to invest in Chinese stocks, your concern is justified. There are always lingering concerns about the validity of financial statements given some recent, high-profile stories. DAO is a high-tech intelligent learning business that creates smart learning devices, apps, and web-based courses. While plenty of market analysts are touting the supposed merits of Chinese company DAO, the POWR Ratings recently downgraded this stock. The POWR Ratings reveal DAO has D grades in each Component but for its Trade Grade which is an F. DAO has a one-month price return of -26% and a three-month price return of -23%. DAO has quickly sold off from its summer high of $46. The stock currently trades around $26. However, DAO traded at $29 before the coronavirus pandemic. It is clear investors have soured on this stock following a spectacular June. Look for DAO to trade sideways or dip from here as it is currently trading at more than 24 times anticipated 2020 earnings. Avrobio (AVRO) AVRO creates cell and gene therapies with the overarching goal of treating rare diseases and cancer. However, AVRO has not proven as successful as expected. AVRO has an F Trade Grade, D grades in the Peer Grade and Buy & Hold Grade Components, and a disappointing Industry Rank of 152 out of 373 Biotech stocks. AVRO’s price returns are concerning: -7% across the past month, -26% across the prior three months, and -19% year-to-date. AVRO appeared to be moving back toward its pre-COVID high of $27 only to subsequently dip after reaching $23. Today, AVRO trades for $16 per share. AVRo’s gene therapy drug candidates are still in the early stage of development. In short, AVRO has yet to deliver on its aims. This is a risky stock that is only worth considering if those provided with its drug candidates demonstrate positive results. Savvy investors will avoid this stock until more positive news about its drug offerings is provided. Merus (MRUS) MRUS develops antibody therapeutics to treat cancer. MRUS’s one-year chart is not exactly easy on the eyes. Rewind to this time last year and MRUS was priced at $16. The stock quickly moved above $20 only to fall to $16, move back toward $20 before the pandemic, drop down near $10, bounce to $17, and slide down to its current price of $12. There is no evidence MRUS’s antibody helps in the quest to destroy cancer cells. The lack of optimism is reflected in MRUS’s disappointing chart. Stay far away from this stock until it makes significant headway in drug development. PrimeEnergy (PNRG) It should come as no surprise that yet another oil and gas stock has been downgraded in the POWR Ratings. PNRG explores for oil and gas, develops and produces these fossil fuels. PNRG operations are positioned throughout the south, southwest, and northern portion of the country. The POWR Ratings show PNRG has F grades in each POWR Component but for its Peer Grade. PNRG is ranked outside of the top quarter of Energy – Oil & Gas stocks. Furthermore, PNRG has a three-month price return of -10% and a one-year price return of -34%. Though PNRG bounced back from $65 earlier this month, reaching the mid-$70s, the stock is quite the way away from its 52-week high of $170.99. Investors have lost their appetite for oil/gas stocks and the likes of PNRG will continue to pay the price. Want More Great Investing Ideas? 7 Best ETFs for the NEXT Bull Market Is the Stock Market Correction Over? Chart of the Day- See the Stocks Ready to Breakout DAO shares were trading at $26.77 per share on Friday morning, down $0.91 (-3.29%). Year-to-date, DAO has gained 90.13%, versus a 4.26% rise in the benchmark S&P 500 index during the same period."}]}