{"article": [{"url": "https://stocknews.com/news/dks-hibb-esca-bgfv-4-sporting-goods-stocks-to-buy-as-americans-head-outdoors/", "published": 1595938100.0, "headline": "4 Sporting Goods Stocks to BUY as Americans Head Outdoors", "body": "Sporting goods stocks are on the rise as people head outdoors to enjoy fresh air, sunlight without risk of contracting COVID-19. Instead of venturing out to malls, movie theaters, and other enclosed spaces, people are hiking, camping, running, and biking. Let’s take a look at four stocks which will benefit from the escalating interest in outdoor sports and activities from enthusiasts and newcomers: Dick’s Sporting Goods (DKS), Hibbett Sports (HIBB), Escalade (ESCA) and Big5 Sporting Goods (BGFV). Dick’s Sporting Goods (DKS) Outdoor activities require sneakers, sports apparel, hats, and sporting goods. DKS sells each of these items. With stores located throughout the United States, DKS is in the optimal position to benefit from the spiking interest in sports and outdoor activity. DKS sells everything from sneakers to fishing rods, tennis rackets, jogging pants, and beyond. It also has a growing online presence with its store as convenient, pickup locations for items. 7 Best ETFs for the NEXT Bull MarketThe POWR Ratings show DKS has an A in the Trade Grade and Buy & Hold Grade POWR Components. DKS is ranked in the top three of more than 30 stocks in the Athletics & Recreation category. However, DKS has not yet returned to its pre-COVID trading price of nearly $50 reached this past January. Look for DKS to break through this 52-week high as the summer rounds out. Hibbett Sports (HIBB) When it comes to outdoor activity, those in the sunbelt take the crown. Southerners salivate at the opportunity to get outside, play sports, hunting, hiking, fishing, and so on. HIBB stores are available to those in the sunbelt as well as those in the Midwest and Mid-Atlantic states. The POWR Ratings reveal HIBB has an A Trade Grade, a B Industry Rank Grade, and a solid Buy & Hold Grade. HIBB is currently a regional operator but if interest in these activities persists, it will have a number of expansion opportunities. The top analysts have set a price target of $25.67 for HIBB, which is 5% above current prices. It is quite interesting to learn HIBB has a shockingly low forward P/E ratio of 8.40, meaning it is significantly undervalued at its trading price of $24.54. HIBB executives insist the company’s second-quarter store comp sales will soar 70% on a year-over-year basis. This would be quite the feat considering Wall Street analysts anticipated comp growth around 15%. HIBB’s 52-week high of $30 and change is certainly within reach as we transition to the second half of summer, and outdoor activities continue to increase in popularity. Escalade (ESCA) It is not often you find a business that sells both sporting goods, graphics arts products, and office equipment. ESCA does exactly that. In terms of sporting goods, ESCA sells basketball equipment, archery equipment, and table games such as ping pong tables, pool tables, and foosball tables. The POWR Ratings are quite complimentary toward ESCA, rating its Trade Grade and Buy & Hold Grade as an A. ESCA has price returns in the green in the past three months, six months, year, three years and five years. ESCA’s six-month price return is more than 70%. ESCA is ranked in the top half of all Athletics & Recreation stocks. Big5 Sporting Goods (BGFV) If you have not heard of BGFV, you are not alone. This under-the-radar sporting goods stock has locations along the west coast and south. BGFV sells footwear, sporting goods, apparel, hunting and fishing equipment, camping gear, and more. The POWR Ratings reveal BGFV has As in both the Trade Grade and Buy & Hold Grade Components. The stock is ranked in the top half of all publicly traded companies in the Athletics & Recreation category. It is hard to believe this stock dropped below a dollar in early April. Look for BGFV to break through its 52-week high of $4.75 in the next couple of months. Want More Great Investing Ideas? 9 “BUY THE DIP” Growth Stocks for 2020 Newly REVISED 2020 Stock Market Outlook 7 “Safe-Haven” Dividend Stocks for Turbulent Times DKS shares were trading at $45.57 per share on Tuesday afternoon, down $0.47 (-1.02%). Year-to-date, DKS has declined -5.46%, versus a 1.44% rise in the benchmark S&P 500 index during the same period."}]}