{"article": [{"url": "https://stocknews.com/news/shop-twlo-okta-3-overvalued-tech-stocks-to-buy-when-the-stock-market/", "published": 1599653300.0, "headline": "3 Overvalued Tech Stocks to Buy When the Stock Market Crashes", "body": "Even with today’s rally, there is a strong chance that the stock markets will experience another round of selling soon. The S&P 500 fell by 7% in the previous three trading sessions while the tech-heavy NASDAQ declined by 10%. Investors experienced a bear market in early 2020 when the COVID-19 pandemic wreaked havoc and decimated multiple sectors. The S&P 500 fell over 36% in about a month but has since recovered to trade at record highs and this V-shaped recovery has surprised investors and analysts alike. Several experts believe the stock market is not in sync with the economy. As people are largely staying at home, consumer spending has fallen and global GDP has declined significantly in Q2. 7 \"SAFE HAVEN\" Dividend Stocks for Turbulent TimesThe Warren Buffett indicator, also known as the market cap to GDP ratio, indicates the U.S. markets are overvalued by almost 75%. Warren Buffett had famously said this ratio is “probably the best single measure of where valuations stand at any given moment.” The Oracle of Omaha did not buy stocks in the bear market of early 2020 and is in fact a net seller of equities this year. This suggests Buffett expects another round of correction or even a market crash to hit public equities in the near-term. So, how do you play a volatile market? Tech stocks have been on an absolute tear this year and are now trading at frothy valuations. Several tech companies have been immune to the impact of COVID-19 and the pandemic has acted as a tailwind for stocks in the e-commerce and cloud computing space. However, market weakness will also drag tech stocks trading a premium significantly lower. In case market crash fears come true, here are three tech stocks that you can buy on the dip. An Ecommerce Giant Shares of Canada-based Ecommerce heavyweight Shopify (SHOP) are trading at about $950 which is 17% below its record highs. Shopify stock went public in May 2015 and its IPO was priced at $17. This means early investors would have returned a staggering 5,300% in just over five years. Shopify is the second largest e-commerce platform in North America after Amazon (AMZN). Driven by the stellar rise in its stock price it is now the largest Canadian company in terms of market cap. Shopify is valued at a market cap of $110 billion while Canada’s second-largest company the Royal Bank of Canada (RY) is valued at $103.2 billion. The ongoing pandemic has accelerated the e-commerce trend and changed buying patterns at least in the near-term. Shopify sales were up 97% year-over-year in the second quarter which was its best Q2 since going public. Shopify’s GMV (gross merchandise volume) soared 119% as the number of new stores on its platform was up 71% year-over-year in the June quarter. However, Shopify stock is trading at a forward price to sales multiple of 43 while its price to earnings multiple is close to 400x. While Shopify’s long-term revenue drivers remain intact the stock might experience weakness amid a sluggish macro environment. This provides an opportunity for investors to buy a quality stock at a lower valuation. Shopify’s leadership position in online retail coupled with the overall growth in e-commerce sales makes it a top bet for long-term investors. Analysts tracking Shopify stock have a 12-month price target of $1097 which means that Shopify is trading at a discount of 19.6% to analyst estimates. A Cloud Communications Player Another tech stock that has gained significant momentum in 2020 is Twilio (TWLO), a cloud communications company. Twilio was publicly listed in June 2016 at a price of $24 and is currently trading at $233. Twilio stock has gained 138% year-to-date but is trading 19% below its record high. Twilio’s cloud platform processes millions of calls, text messages, and videos each day for several mobile applications. Its clientele includes companies such as Yelp (YELP), Salesforce (CRM), Lyft (LYFT), Twitch, and Airbnb. Twilio provides enterprises with a platform to embed new features into existing applications or build new apps with faster programmable APIs. This helps companies interact with customers at every stage of their buying journey from marketing and operations to customer service. Last year, Twilio supported 600 billion interactions across email, chat, voice, and SMS. In the last quarter, Twilio sales were up 46% which was marginally lower compared to its 48% growth reported in the first quarter. Similar to most other SaaS stocks, Twilio continues to trade at a premium with a forward price to sales multiple of 20.2x. Due to low profit margins, the stock’s price to earnings multiple is well over 2,000x. It is not unreasonable to wonder if Twilio’s valuation has been stretched especially if the market continues to trade lower in the coming months. Analysts tracking Twilio have a 12-month average target price of $298 on the stock which indicates an upside potential of 32% for investors. A Remote Work Enabler The third company that investors need to buy at every major dip is Okta (OKTA), an enterprise-facing identity management platform. The company’s cloud-based platform aims to secure users by connecting them to the applications they use. The work-from-home trend has accelerated due to the coronavirus pandemic and might well be the new normal for several companies that are embracing a remote work culture. The near-term tailwind has sent Okta stock soaring higher to its current trading price of $200. Okta went public at a price of $17 per share and has returned over 1,000% in just over three years. In fiscal Q2, Okta sales were up 43% at $200.4 million while adjusted earnings grew to $0.07, compared with a loss of $0.05 in the prior-year period. Its backlog also rose by a healthy 56% to $1.43 billion indicating robust demand for its services. Okta stock has a forward price to sales multiple of 31.5 and the company is expected to post a non-GAAP loss in fiscal 2021. It is another company that is trading at a premium and is overvalued given the current market dynamics. Okta stock is down 14.7% from record highs but is a stock that can create massive wealth in the upcoming decade. Analysts tracking Okta have a 12-month average trading price of $223 which is 13% above its current price. The Final Takeaway Shopify, Twilio and Okta have generated outsized returns for investors since their respective IPOs. Twilio and Okta generate a majority of sales via subscription which means they will be able to withstand a weak economic environment due to a predictable revenue stream. The three tech stocks are currently overvalued but also have rapidly expanding addressable markets which will drive revenue growth for multiple years. We can see the three tech stocks are trading below analyst estimates and should be on your investment radar as it is impossible to time the market. Want More Great Investing Ideas? 7 Best ETFs for the NEXT Bull Market Will Stocks Fall into Historical September Slump? 9 “BUY THE DIP” Growth Stocks for 2020 SHOP shares were trading at $952.10 per share on Wednesday afternoon, up $34.70 (+3.78%). Year-to-date, SHOP has gained 139.47%, versus a 6.92% rise in the benchmark S&P 500 index during the same period."}]}