{"article": [{"url": "https://stocknews.com/news/atvi-ttwo-scpl-3-video-gaming-stocks-to-buy-and-hold-for-5/", "published": 1601467700.0, "headline": "3 Video Gaming Stocks to Buy and Hold for 5 Years", "body": "The coronavirus crisis has created an enormous growth opportunity for the video game industry. The global video game market is expected to grow at 15.6% in 2020 and 12.4% in 2021, and thereby reach a market value of $293.10 billion by 2027. It is estimated to grow at a CAGR of 9.3% over the next seven years. Over this period, consumer spending on online video games is expected to rise by 25% in the United States alone. Since the onset of the pandemic, video games have emerged as a popular form of indoor entertainment among youth worldwide. As people are getting accustomed to the new normal, demand, and time spent on video gaming has exploded. Companies such as Activision Blizzard, Inc. (ATVI), Take Two Interactive Software, Inc. (TTWO) and SciPlay Corporation (SCPL) are likely to see the benefits from this trend. 9 \"BUY THE DIP\" Growth Stocks For 2020Activision Blizzard, Inc. (ATVI) ATVI develops and distributes content and services on video game consoles, personal computers, and mobile devices in the Americas, Europe, the Middle East, Africa, and the Asia Pacific. Operational since 1979, the most famous product franchises owned by ATVI include Call of Duty, World of Warcraft, Diablo, Hearthstone, Overwatch, and Candy Crush. As one of the most popular gaming platforms worldwide, ATVI had a monthly active user base (MAU) of 428 million as of June 30th. On September 4th, ATVI launched Tony Hawk’s pro-Skater 1 and 2, which is a remaster of the first two titles of the billion-dollar Tony Hawk video game franchise. It also released a new generation of Call of Duty and is planning to release an expansion to World of Warcraft by October. With virtual gaming gaining popularity during these unprecedented times, ATVI’s impressive second-quarter results indicate a dominating position of the company in this market. ATVI’s net revenues increased by37.8% to $1.93 billion in the second quarter ended June 2020. Net revenue from digital channels increased 45.8% from the year-ago value to $1.59 billion. Operating metrics such as net bookings improved 71.9% from the same period last year to $2.08 billion. Net income rose 76.8% year-over-year to $580 million, while GAAP EPS increased 74.4% from the same period last year to $0.75. The gaming industry is expected to grow continuously in the new normal. ATVI’s net revenues are expected to be approximately $1.80 billion in the third quarter ending September 2020. To reach this target, ATVI raised $2 billion in unsecured senior notes as of August 10th for financing and general corporate purposes. The consensus EPS estimate of $0.64 for the third quarter indicates a 100% rise year-over-year. Also, ATVI has an impressive earnings surprise history, as it beat the street EPS estimates in each of the trailing four quarters. Its EPS is expected to grow at a rate of 24.4% per annum over the next five years. ATVI gained more than 70% to hit its 52-week high of $ 87.73 in August, since hitting its year-to-date low of $50.51 in mid-March. How does ATVI stack up for the POWR Ratings? A for Trade Grade B for Buy & Hold Grade B for Peer Grade B for Industry Rank B for Overall POWR Rating ATVI is also ranked #2 out of 14 stocks in the Entertainment – Toys & Video Games industry. Take Two Interactive Software, Inc. (TTWO) TTWO develops and markets interactive gaming and entertainment solutions under Rockstar Games, 2K labels, private division, and social point labels. Its games are designed for console gaming systems as well as computers and smartphones. On August 18th, TTWO entered into a definitive agreement to acquire Playdots, Inc. for $192 million. TTWO reported impressive results for the fiscal first quarter ended June 2020. Its GAAP net revenue grew 54% year-over-year to a record of $831.30 million. Adjusted unrestricted operating cash flow increased 595% from the year-ago value to $324 million, while net cash from operating activities increased 310% over the same period to $445.40 million. TTWO’s net bookings rose 136% year-over-year to a record of $996.20 million. EPS increased by 88% from the same period last year to $0.77. TTWO’s EPS is expected to grow at a rate of 14.7% per year over the next five years. Moreover, the company has an impressive earnings surprise history, as it beat the street EPS estimates in three out of trailing four quarters. TTWO has gained more than 80% since hitting its 52-week low of $100 in March. The momentum helped the stock to hit its 52-week high of $180.61 in August. TTWO is rated a “Buy” under our POWR Ratings, consistent with its impressive financials and solid momentum. It has an “A” for Trade Grade and Peer Grade, and a “B” for Buy & Hold Grade and Industry Rank. Out of 14 stocks in the Entertainment – Toys and Video Games sector, TTWO is ranked #4. SciPlay Corporation (SCPL) SCPL designs and publishes digital games on mobile applications and Web platforms. It currently offers seven social casino games along with 1,500 slot style and table style games provided by its parent company Scientific Games Corporation. SCPL recently acquired Israeli based game developer Come2Play, making it the fastest-growing company in the casual gaming segment as well as expanding its addressable market. SCPL’s net revenue increased 47% year-over-year to $165.60 million in the second quarter ended June 2020. Net income rose 86% from the year-ago value to $48.80 million, while adjusted EBITDA grew 80% to $59.60 million over this period. EPS increased by 16% from the same period last year to $0.29. Consensus EPS estimate of $0.24 for the third quarter ending September 2020 indicates a 20% improvement year-over-year. Moreover, the company’s EPS is expected to grow at 16.4% per annum over the next five years. The consensus revenue estimate of $141.94 million indicates a 21.9% growth from the same period last year. SCPL has gained more than 195% since hitting its 52-week low of $5.82 in March. The stock hit its 52-week high of $17.23 in August. SCPL’s strong fundamentals are reflected in its POWR Ratings. It has a “Strong Buy” rating with an “A” for Trade Grade, Buy & Hold Grade, Peer Grade, and Industry Rank. In the 34-stock Consumer Goods industry, SCPL is ranked #7. Want More Great Investing Ideas? Do NOT Buy Stocks Before the Election! 7 “Safe-Haven” Dividend Stocks for Turbulent Times Chart of the Day- See Christian Tharp’s Stocks Ready to Breakout ATVI shares fell $0.35 (-0.43%) in after-hours trading Wednesday. Year-to-date, ATVI has gained 37.13%, versus a 5.54% rise in the benchmark S&P 500 index during the same period."}]}