{"article": [{"url": "https://stocknews.com/news/gold-gld-au-hmy-nem-btg-gold-mining-stocks-face-increased-risk-in-mali-after-a/", "published": 1600085300.0, "headline": "Gold Mining Stocks Face Increased Risk in Mali After a Coup D’état", "body": "Gold mining stocks face increased risk in Mali after a coup d’état there ousted the country’s president, left mutinous military men in charge and precipitated a slide in the company’s share prices. The gold mining stocks facing increased risk in Mali after coup d’état report they have avoided operational disruption but the unlawful removal of President Ibrahim Boubacar Keita sparked international condemnation from the United States, France, the United Nations (UN), the regional 15-nation Economic Community of West African States (Ecowas), the African Union and others. Since the Aug. 18 mutiny in Mali, border crossings have been closed or had severely limited operations, impairing the free flow of goods and commerce outside the country, according to the U.S. State Department. “We remain concerned for the safety of detained government officials and their families and call for their immediate release,” a U.S. State Department spokesman said. “We can confirm that former President Keita traveled to the United Arab Emirates for medical treatment.” 7 Best ETFs for the NEXT Bull MarketGold mining stocks face increased risk in Mali after a coup d’état Ousts President Members of the military shockingly seized President Keita, 75, who initially won election in 2013 to fill a vacancy caused by a March 2012 coup that removed the previous president. Keita gained re-election in 2018. But a group of armed military members caught Keita by surprise with their Aug. 18 mutiny, forcing his announcement on state television the next day that he was resigning, dissolving the general assembly and wanting to do so to avoid any bloodshed. His exodus from office marked the fourth coup d’état in Mali since 1960, when the country gained its independence from France. Stake holders in the country are discussing when the military mutineers will relinquish control to a civil president and a prime minister, how the new leaders should be chosen and the length of time they would serve before a national election. Keïta fell victim to a minor stroke in the days following the coup and left a hospital in Mali’s capital of Bamako on Thursday, Sept. 3, after a two-day stay to receive additional treatment in the United Arab Emirates’ capital of Abu Dhabi. Representatives of the Economic Community of West African States and the UN persuaded coup leaders to allow Keita to leave the country temporarily with his expected return to Mali within 15 days of his departure, according to the BBC. Mutiny Leaves Gold Mining Stocks Facing Increased Risk in Mali after a coup d’état The mutinying soldiers, reportedly led by Col. Malick Diaw, deputy head of the country’s Kati military camp, and another commander, Gen. Sadio Camara, also detained the nation’s Prime Minister Boubou Cissé. A spokesman for the soldiers who seized the country’s leaders called for “a civil political transition leading to credible general elections.” Col. Assimi Goita is leading Mali’s military junta. A three-day national consultation in Mali with key stake holders ended Saturday, Sept. 12, with military rulers agreeing to establish an 18-month interim government led by either a military or civilian leader until an election would be held. However, that timetable falls short of the 12-month limit and the need for civilian rather than military leadership set by the 15-nation Economic Community of West African States (ECOWAS). The regional bloc imposed a Sept. 15 deadline for Mali to conclude consultations with political, social and religious representatives to appoint a transitional civilian president and prime minister, while also imposing sanctions that include barring trade and closing borders for land and air transportation. ECOWAS heads of state attended an ordinary meeting on Sept. 7 in Niamey, Republic of Niger, that also reaffirmed their previous call for constitutional order to be restored quickly in Mali, according to a communique. Whoever ends up as the next president of Mali will face daunting challenges, including a weak economy worsened by the COVID-19 pandemic, highway banditry, a jihadist insurgency, alleged corruption and public protests. Geographically, 65 percent of landlocked Mali is desert or semidesert, with most economic activity confined to areas along the Niger River, according to the USAID, an independent U.S. government agency that administers civilian foreign aid and development assistance. 3 of World’s Top 12 Gold Mining Stocks Face Increased Risk in Mail After Coup D’état Three of the world’s 12 largest gold mining companies conduct operations in Mali and they announced their business activities have not been uninterrupted in the wake of the coup. The two biggest mining operators in Mali feature global giants Barrick Gold Corporation (NYSE:GOLD), of Toronto, and AngloGold Ashanti Limited (NYSE:AU), of Johannesburg, South Africa. Barrick Gold and AngloGold Ashanti announced on Aug. 31 that they agreed to sell their 80% controlling interest in Mali’s Morila mine to publicly traded Mali Lithium Limited (ASX:MLL), of Perth, Australia, for $22-27 million in cash. The Morila mine had served as a tailings retreatment operation since 2014 and had been winding down operations for final gold production in 2021. Barrick Gold officials indicated the transaction was unrelated to the coup. The deal to sell the Morila mine provides the equal partnership between Barrick Gold and AngloGold Ashanti with an exit strategy that will remove the political risk inherent in operating a business in a country that is undergoing civil upheaval. The final sale price will depend on adjustments at the time the deal is closed, possibly as soon as October, and require meeting conditions that include approval of Mali’s government, which owns the other 20% of the Morila gold mine. Vancouver, Canada-based B2Gold Corp. (NYSE:BTG) reported on the day of President Keita’s resignation that it will keep operating its Fekola mine in Mali as it monitors the nation’s “evolving political situation.” B2Gold’s Fekola mine is the second-biggest gold producer in Mali behind Barrick Gold’s Loulo-Gounkoto mine. Barrick Gold, the largest gold miner in Mali, confirmed its Loulo-Gounkoto mine operation — consisting of 9% of the company’s expected production this year — has not been affected. Gold Mining Stocks Face Increased Risk in Mail After Coup D’état Hurts Share Prices Mali is Africa’s fourth-biggest gold miner and its output rose to 71.1 tons in 2019, with the government earning revenue of 403.6 billion CFA ($734,311,051) from gold mining companies. Mali is one of eight countries that use the West African CFA franc as their currency, along with Benin, Burkina Faso, Guinea-Bissau, Ivory Coast, Niger, Senegal and Togo. Other gold miners that operate in Mali include Perth, Australia-based Resolute Mining, London’s Hummingbird Resources and Tortola, British Virgin Islands-based Cora Gold, with each reporting their operations and staff have been unaffected by the coup d’état. However, the share prices of the three stocks that are listed on the London Stock Exchange dropped on Aug. 19 after the military takeover. On that day, the share prices of the larger companies proved more resilient than the smaller ones, as Barrick Gold dipped 2.7%, AngloGold Ashanti slipped 4%, B2Gold fell 8.8%, Resolute Mining dove 11.7%, Hummingbird slid 9.4% and Cora Gold plunged 9.3%. Shareholders’ Gold Mining Stocks Face Increased Risk in Mail After Coup D’état The gold mining companies vary in size and activities as they try to extract value from their operations in Mali. The financial stakes are high as silver and gold, respectively, have soared 49.80% and 27.68% this year through Sept. 11 to beat all the U.S. stock market indexes. Those precious metals outperformed the NASDAQ Composite, jumping 20.96%; the S&P 500, rising 3.41%; and the Dow Jones Industrial Average, dipping 3.06%, also through Sept. 11. The strong rise of silver and gold followed $6-trillion-plus in COVID-19 U.S. government stimulus and Federal Reserve actions. A recent pullback in gold and silver prices gives investors incentive to buy the precious metals, as well as their related stocks and funds. 2 of World’s 3 Biggest Gold Mining Stocks Face Increased Risk in Mail After Coup D’état Barrick Gold and AngloGold Ashanti, the world’s second- and third-largest gold mining companies, announced on Aug. 31 that the new ownership of the Morila mine would bring additional resources and a new approach to using the infrastructure to prolong the life of the mining operations. The sale would allow Barrick Gold to focus on its strategy of discovering, developing, owning and operating Tier One assets, its officials said. The Morila mine first produced gold in October 2000 and laid the foundation for Randgold Resources, the property’s previous owner, to develop into one of the world’s biggest precious metals mining companies. The large mine, once known as “Morila the Gorilla,” produced 6.9 million ounces of gold and paid more than $2.5 billion to its stakeholders through taxes and dividends. Billionaire Warren Buffett announced in mid-August that his investment company Berkshire Hathaway (NYSE:BRK.B) bought half a billion dollars of Barrick Gold stock. Buffett traditionally has avoided investing in gold, but the current investing climate is causing people who once looked elsewhere for profitable opportunities to reconsider. Chart courtesy of www.StockCharts.com Kramer Counsels Gold Mining Stocks Face Increased Risk in Mail After Coup D’état “This is a classic transaction that tells us a lot about where we are in the commodity cycle, said Hilary Kramer, host of a national radio program called “Millionaire Maker” and head of the GameChangers and Value Authority advisory services. Senior mining companies such as Barrick Gold dig for profits, Kramer said. Barrick Gold is experienced in leading big projects efficiently, can assemble property packages and can allocate production to squeeze the best overall return out of every pound of ore, she added. That approach can mean selling rights to the ore in the ground to a junior mining operator, Kramer said. Columnist and author Paul Dykewicz interviews money manager Hilary Kramer, whose premium advisory services include 2-Day Trader, Turbo Trader, High Octane Trader and Inner Circle. Barrick Gold Is 1 of 3 Gold Mining Stocks Facing Increased Risk in Mail After Coup D’état Barrick Gold Corp. recently produced a 38% share price gain and a 213% profit in call options in less than two months as a recommendation of the Fast Money Alert investment advisory service. Barrick Gold turned into a top performer in the trading service co-led by Mark Skousen, PhD., and stock picker Jim Woods, who also heads the Successful Investing and Intelligence Report investment newsletter, as well as the Bullseye Stock Trader advisory service. Paul Dykewicz interviews Jim Woods before the COVID-19 crisis. Skousen, a Presidential fellow at Chapman University who also leads the Forecasts & Strategies investment newsletter, began advocating the purchase of gold mining stocks in 2019. He cited catalysts for gold and silver prices that include large deficit spending of countries around the world, easy-money policies to keep interest rates low and government stimulus programs. Barrick Gold has more than doubled in price in the past year to top the SPDR Gold Shares fund (NYSE:GLD), among others, said Skousen, who also leads the Five Star Trader, Home Run Trader and TNT Trader advisory services. The company has $3.3 billion in cash as financial cushion to back its $5.5 billion in long-term debt, added Skousen, whose accolades include receiving the inaugural Triple Crown in Economics in 2018 and ranking as one of the world’s 20 most influential living economists. The company further offers a dividend yield of 1. 08%. Barrick Gold’s consensus forward price-to-earnings ratio is 25.06. Mark Skousen, a descendant of Benjamin Franklin, meets with Paul Dykewicz. Barrick Gold last year produced 5.5 million ounces of gold, achieved profit margins above 40% and earned $4 billion on revenues of $9.7 billion. Wall Street has noticed, with TD Securities boosting its rating of Barrick Gold to a “buy” on April 1, when the brokerage set a price target of $28. Another upgrade occurred on March 26 when Deutsche Bank initiated a “buy” on Barrick Gold and gave the stock a price target of $25. GOLD already has topped both price targets. AngloGold Is Among Gold Mining Stocks Facing Increased Risk in Mail After Coup D’état AngloGold Ashanti, a recommendation in Skousen’s Five Star Trader advisory service, has more than one dozen properties in Africa, North and South America and Australia. The company sold its last gold mine in South Africa to Harmony Gold (NYSE:HMY) earlier this year to end its operations in that country. Both South Africa and Mali have been politically unstable. In 1970, South Africa was the top gold producer in the world by a wide margin. Now, South Africa is the world’s eighth-biggest producer of gold. Since AngloGold Ashanti combined with Goldfields in 2004, its gold-producing properties span well beyond South Africa. With rising gold and silver prices, along with improved ways to reduce costs, AngloGold Ashanti’s profit margins now top 10%. Its revenues rose 26% in the past year to reach $3.9 billion and its earnings skyrocketed 287% to $619 million. The company has $1.3 billion in cash, with only $2.9 billion in long-term debt. Chart courtesy of www.StockCharts.com All Gold Mining Stocks Face Increased Risk in Mail After Coup D’état AngloGold Ashanti’s shares sell “more cheaply” than its rivals Barrick Gold and Newmont Gold (NYSE:NEM) because it is headquartered in South Africa, Skousen said. The stock now sells for 12 times 2020 earnings and has a price/earnings-to-growth (PEG) ratio of 0.54. A PEG less than 1 is considered excellent, added Skousen, who also heads the TNT Trader and Home Run Trader advisory services. The company offers a modest dividend yield of 0.33%. AngloGold Ashanti’s consensus forward price-to-earnings ratio is 10.19, less than half Barrick Gold’s ratio, offering investors a better value. AngloGold Ashanti’s mines have increasing profits and cash flow, despite the COVID-19 crisis. On Sept. 1, Christine Ramon, who had been the company’s chief financial officer, succeeded Kelvin Dushnisky as the chief executive officer. B2Gold Joins Gold Mining Stocks Facing Increased Risk in Mail After Coup D’état Interest in gold is fueled by the most aggressive monetary and fiscal policies since 2008, Skousen said. In his Forecasts & Strategies investment newsletter, he is recommending B2Gold Corp. a mid-tier Canadian gold mining company. The stock briefly topped $7 a share before retreating after Mali’s political coup. Despite its share price slipping lately, B2Gold officials said the Malian government’s 20% stake in the Fekola mine operation provides a financial interest to preserve mining operations and the safety of employees. B2Gold offers a dividend yield of 2.50%. Its consensus forward price-to-earnings ratio is 13.21, nearly half of Barrick Gold’s ratio and just above the one of AngloGold Ashanti. Chart courtesy of www.StockCharts.com Volatile Gold Mining Stocks Face Increased Risk in Mail After Coup D’état Investors can profit from rising precious metals prices by purchasing gold mining stocks, said Bob Carlson, chairman of the Board of Trustees of Virginia’s Fairfax County Employees’ Retirement System with more than $4 billion in assets. But the share prices of mining companies are “far more volatile” than the prices of gold and silver themselves, he added. Carlson, who also leads the Retirement Watch advisory service, said mining company shares fluctuate due to reasons other than the price of precious metals. Key variables include a company’s debt level, management skill, labor issues and COVID-19 risks, he added. Pension fund Chairman Bob Carlson answers questions from Paul Dykewicz in an interview before social distancing became the norm after the outbreak of COVID-19. Gold Mining Stocks Face Increased Risk in Mail After Coup D’état but May Rebound Despite gold prices and mining stocks slipping, the trend should reverse soon, said Rich Checkan, president and chief operating officer of Asset Strategies International, a full-service tangible asset dealer in Rockville, Maryland. Rich Checkan, president, Asset Strategies International COVID-19 pandemic’s heavy human toll includes 28,565,084 cases and 916,919 deaths globally, 6,462,169 cases and 193,320 deaths in the United States and 2,916 cases and 128 deaths in Mali, as of Sept. 12, according to Johns Hopkins University. America has endured the most cases and deaths by far of any country in the world, including China, where COVID-19 originated. Gold mining stocks facing increased risk in Mali after the coup d’état could keep producing superior returns, compared to U.S. market indexes, into next year and beyond. But Mali’s political instability adds increased risk to the gold mining companies operating in that strife-torn country. ‘Want More Great Investing Ideas?’ Click the links below. Dr. Mark Skousen, world-renowned investment advisor and economist, just released his Top 3 Dividend Plays that are set to skyrocket. Click here now to find out what they are, and how you too can cash in from this profit bonanza. A devastating new law has paved the way for the IRS to confiscate up to 30% of your retirement funds. Bob Carlson, America’s foremost retirement expert, will show you how to protect your hard-earned nest egg, and keep these damning new rules at bay. Click here now to learn more. GOLD shares were trading at $30.13 per share on Monday morning, up $0.38 (+1.28%). Year-to-date, GOLD has gained 63.55%, versus a 6.77% rise in the benchmark S&P 500 index during the same period."}]}