{"article": [{"url": "https://stocknews.com/news/bio-moh-musa-3-value-stocks-that-could-make-you-rich/", "published": 1598530100.0, "headline": "3 Value Stocks That Could Make You Rich", "body": "As most of us are well aware, the market rally since March has primarily been driven by growth stocks. However, many investors don’t know that value stocks have historically outperformed growth stocks over the long-term. If you look at the chart below that compares stocks with high book-to-market ratios (value) to stocks with low book-to-market ratios (growth), value stocks have crushed growth stocks. If you started with $1 at the end of 1927 and invested in value stocks, you would have $65,008. If you invested in growth stocks instead, you would only have $4,108. (Data courtesy of http://mba.tuck.dartmouth.edu/pages/faculty/ken.french/index.html) 7 Best ETFs for the NEXT Bull MarketNow the last ten years is a different story. Growth stocks have outperformed value stocks, especially from 2015 – 2020, and even more so over the last few months. They have returned almost twice as much as value stocks over the past ten years, as shown in the chart below. This is due to growth companies benefiting from the work-from-home trend. Historically, when growth stocks are so much more expensive than value stocks, as they are now, value stocks typically outperform. There is no question value stocks are out of favor now, but that only means value stocks offer more upside over the long-term, plus they typically rise as the economy recovers from a recession. In terms of finding value stocks for the long-term, I look for companies with low EV/EBITDA ratios. The EV/EBITDA ratio compares a company’s enterprise value (EV) to its earnings before interest, taxes, depreciation & amortization (EBITDA). I also make sure that the companies are profitable and managed well, so I look for a high return on equity and a high return on invested capital (ROIC). Here are three companies that fit the bill: Bio-Rad Laboratories (BIO), Molina Healthcare (MOH), and Murphy USA (MUSA). Bio-Rad Laboratories (BIO) BIO manufactures and supplies systems to separate and analyze chemical and biological materials to life sciences and healthcare companies. The firm is run through two business segments: life science and clinical diagnostics. The life sciences segment manufactures reagents and laboratory instruments used by researchers, food producers, and pharmaceutical manufacturers. The clinical diagnostics segment, which generates over half of the firm’s revenue, creates test systems, informatics systems, test kits, and technical quality controls for diagnostic labs. The company reported better-than-expected results for the second quarter. The company’s life sciences segment saw growth on strong sales of products related to the pandemic. BIO saw an uptick in core polymerase chain reaction (PCR) and Droplet Digital PCR (ddPCR) revenues due to COVID-19 testing. The FDA’s emergency use authorization for the ddPCR COVID-19 test kit also aided growth. In addition, the company has been focused on international markets as more than 60% of its net sales are global. The stock is trading at attractive valuations as its EV/EBITDA ratio is only 5.4, compared to its industry average of 26.3, and 23.0 for the S&P 500. The stock’s price to earnings ratio is also low at 7.7. BIO has a high return on equity of 26.5% and an even higher ROIC of 28.0%. Its future earnings growth looks solid as well, with a next year EPS estimate of 27.7%. The stock is currently rated a Strong Buy by our POWR Ratings system. In the four components that make up the POWR Ratings, BIO has a grade of A for Trade Grade and Buy & Hold Grade, and a B for Peer Grade and Industry Rank. It is also the #4 ranked stock in the Medical – Diagnostics/Research industry. Molina Healthcare (MOH) MOH offers healthcare plans focused on Medicaid-related solutions for low-income families and individuals. The company’s health plans are operated by a network of subsidiaries, licensed as a health maintenance organization, or HMO. Aside from its health plans segment, the company has a Medicaid solutions segment that provides U.S. state governments solutions for their Medicaid management information systems. The company has seen consistent revenue growth over the past few years. Its revenue jumped to $4.62 billion for the second quarter, a 10.3% increase from the prior year. Its earnings per share (EPS) increased by 54% to $4.79. MOH started a restructuring initiative in 2017 to reduce costs and enhance efficiency. This led to expenses declining 13.2% in 2018 and 11% in 2019. The company’s membership increased by 5.5% over the first six months of this year. MOH should launch Medicare in new geographic areas due to its acquisition of the Magellan Complete Care line from Magellan Health (MGLN). The transaction should close by the end of the year. This acquisition should be a key growth driver going forward. MOH has a low EV/EBITDA of 6.1 and a low P/E of 14.2, both below its industry average. The company has a return on equity of 39.9%, reflecting its effectiveness in utilizing shareholders’ money. It also has a high ROIC of 24.6%. The company has a five-year EPS growth rate of 41.4% with a 13.6% estimate for next year. The stock is rated a Buy by our POWR Ratings system. It has a grade of A for Trade Grade, and a grade of B for Buy & Hold Grade, Peer Grade, and Industry Rank. It is also the #4 ranked stock in the Medical – Health Insurance industry. Murphy USA (MUSA) MUSA is an American retailer of gasoline products and convenience-store merchandise operating in the United States. The stores are 100% company-operated and 90% company-owned. Most of the stores are located adjacent to Walmart (WMT) stores. The company also provides product supply and wholesale assets, such as product distribution terminals and pipelines. MUSA essentially is a low-price, high-volume fuel retailer selling through low-cost kiosks and small stores. The company’s business model allows it to achieve high profitability. It sells more than 4 billion gallons of retail fuel annually. By mostly owning the stations, MUSA can keep its operating expenses low. Plus, the proximity to WMT allows the company to leverage WMT’s consistent foot traffic. The company’s sourcing infrastructure also helps its bottom line as it can access pipelines and product distribution terminals. This allows it to access fuel at a lower cost than its competitors, which the company can then sell at a discount. The company is also known for its shareholder-friendly policies through ongoing share repurchases. Its loyalty program, Murphy Drive Rewards was launched in 2018. MUSA has low EV/EBITDA of 6.6 and a P/E of 11.1, indicating a favorable valuation. The company has had strong earnings grown over the past few years, with high profitability metrics. It has a return on equity of 40.9% and an ROIC of 22.8%. The stock is rated a Strong Buy by our POWR Ratings system. It has a grade of A for Trade Grade and Buy & Hold Grade, and a B for Peer Grade and Industry Rank. It is also the #5 stock in the Specialty Retailers industry. Want More Great Investing Ideas? 7 Best ETFs for the NEXT Bull Market Why Stocks Could Drop 20% in September? 9 “BUY THE DIP” Growth Stocks for 2020 BIO shares . Year-to-date, BIO has gained 34.35%, versus a 9.34% rise in the benchmark S&P 500 index during the same period."}]}