{"article": [{"url": "https://stocknews.com/news/amzn-baba-tgt-sfix-4-e-commerce-stocks-to-pick-up-at-a-discount/", "published": 1600949300.0, "headline": "4 E-Commerce Stocks to Pick Up at a Discount", "body": "The global e-commerce market is expected to grow at a CAGR of 7.9% until 2027 and is estimated to eventually reach a size of $6.2 trillion. E-commerce has significantly benefited from the spread of the coronavirus and the resultant lockdowns and social distancing. More people are shopping online than ever before. This spells a huge growth opportunity for e-commerce players. The market has significantly rewarded this business growth by sending most e-commerce stocks to new highs. This is evident from the Global X E-commerce ETF’s (EBIZ) 90% gain since hitting its 52-week low in mid-March versus the S&P 500’s 31% return. The current correction in the overall stock market has caused a dip in prices of the high-flying e-commerce stocks. This correction started after several months of sustained momentum and may have been caused by profit-taking and sector rotation. However, the sector’s long-term outlook remains promising, so this correction may be offering a good opportunity to enter into some high-potential e-commerce stocks. 7 Best ETFs for the NEXT Bull MarketE-commerce stocks such as Amazon.com, Inc. (AMZN), Alibaba Group Holding Ltd. (BABA), Target Corporation (TGT), and Stitch Fix, Inc. (SFIX) are leaders in the e-commerce space and are expected to witness high growth in revenue and EPS. Amazon.com, Inc. (AMZN) AMZN’s e-commerce business has significantly benefited from the spread of the coronavirus due to the rapid growth in online shopping. AMZN’s stock has delivered year-to-date returns of 62.3%. The stock is currently trading at a discount from its year-to-date high of $3552.25 after falling around 11% since September 2nd due to the overall market correction. The company’s bid to use drones for last-mile delivery services has received approval from the US authorities. This move will help the company make its e-commerce services faster and more cost-effective. The company has also entered into the grocery market which could be a significant growth driver. AMZN’s revenue is expected to rise by 31.3% in the current year and 18% next year. The company’s EPS is estimated to grow 37.5% in the current year and at a rate of 36.3% per annum over the next five years. AMZN has a “B” for Peer Grade in our POWR Ratings system. The stock is also ranked #12 out of 57 stocks in the Internet industry. Alibaba Group Holding Ltd. (BABA) BABA is widely known as the Amazon of China due to its dominance in the e-commerce sector in China and forays into cloud services. The company has reported strong performance in all e-commerce categories despite early disruptions caused by the pandemic. The company’s revenue grew 34% year-over-year and a significant portion of the revenue increase came from its e-commerce business. BABA has recently announced that its logistics arm Cainiao has launched a new logistics package service which would allow the company’s vendors to directly send packages from Chinese warehouses to buyers in Malaysia. This move could significantly boost the company’s operations in South-East Asia. The company is also developing robots for last-mile delivery which will ease operations in the future. In addition to its e-commerce business, the company could also see big returns due to the upcoming IPO of its fintech arm Ant Group, which is planning to raise at least $35 billion. BABA’s stock has returned 28.6% so far this year. The stock has fallen approximately 5.5% since hitting a year-to-date high of $298 amidst the overall market correction. BABA’s revenue is expected to rise 36.4% this year and 25.6% next year. The company’s EPS is estimated to grow 23.7% this year and at a rate of 3.4% per annum over the next five years. It’s no surprise that BABA is rated a “Buy” in our POWR Ratings system, with an “A” in Trade Grade and Peer Grade. In the 115-stock China industry, it is ranked #8. Target Corporation (TGT) TGT’s digital sales grew by 195% in the second quarter, while its overall sales increased by 25%. The company has managed to retain its customer base by pivoting to e-commerce rather than solely relying on brick-and-mortar operations. TGT’s shares have returned 17.8% so far this year. The company’s stock was on a trajectory of fast growth but has flattened over the last month, signaling a buying opportunity. TGT has been investing in fulfillment centers such as Drive Up and Shipt which has bolstered the company’s ability to make same-day deliveries. The company is involved in opening small-scale stores in underserved areas to tap into an unsaturated market in both physical stores and e-commerce. TGT’s revenue is expected to rise by 10.5% in the current quarter and 12.9% this year. The company’s EPS is estimated to grow 12.4% this year and at a rate of 7.07% per annum over the next five years. TGT’s strong fundamentals are reflected in its POWR Ratings, it has a “Strong Buy” rating with an “A” in Trade Grade, Buy & Hold Grade, Peer Grade, and Industry Rank. In the 18-stock Grocery/Big Box Retailer industry, it is ranked #1. Stitch Fix, Inc. (SFIX) SFIX is a clothing-related e-commerce retailer that runs an online platform and also offers subscription services. The company has an AI-driven platform that uses an algorithm to recommend clothes to users based on budget and style. SFIX’s stock price has fallen approximately 15% from its year-to-date high of $31.6. SFIX is now looking to introduce live styling sessions in which users can interact with a Stitch Fix stylist. The company has also introduced a Direct Buy feature that allows users to shop on the platform just like any other online clothing platform. SFIX’s revenue is expected to rise 16.8% this year and 17.5% next year. The company’s EPS is estimated to grow 68.2% this year and at a rate of 14.6% per annum over the next five years. It’s no surprise that SFIX is rated a “Buy” in our POWR Ratings system, with a grade of “A” in Trade Grade and Peer Grade. In the 34-stock Internet – Services industry, it is ranked #2. Want More Great Investing Ideas? 7 Best ETFs for the NEXT Bull Market Is the Stock Market Correction Over? Chart of the Day- See the Stocks Ready to Breakout AMZN shares were trading at $3,038.22 per share on Thursday afternoon, up $38.36 (+1.28%). Year-to-date, AMZN has gained 64.42%, versus a 2.36% rise in the benchmark S&P 500 index during the same period."}]}