{"article": [{"url": "https://stocknews.com/news/pfe-bntx-pm-mo-cvx-rds-b-bp-3-blue-chip-dividends-for-a-weak-dollar/", "published": 1596110900.0, "headline": "3 Blue Chip Dividends for a Weak Dollar", "body": "“Money printer go brrrrrrrrr!” This humorous investor war cry making the social media rounds these days is all you need to know about the Federal Reserve’s tactics to fight off the coronavirus. Jerome Powell is printing money like there’s no tomorrow. In fact, since March, he’s created more than $3 trillion fresh dollars! This has been the largest money creation event in the history of the planet. 7 Best ETFs for the NEXT Bull MarketPowell Prints, Money Supply Soars More money is lousy news for each outstanding greenback. The US dollar is starting to tailspin lower thanks to a flood of supply: More Dollars Means Each One is Worth Less What dividends do we buy when the dollar is weak? One playbook is gold miners and high-yielding overseas bond funds. But let’s not forget select blue-chips! US multinationals that generate significant sales overseas also benefit from a weaker buck, because: Their products and services become cheaper (and thus more accessible) in foreign markets. Plus, Their reported financials look better because the yen, euros, yuan and other currencies they’re collecting translate into more dollars. Here, we’re looking for big cash cows that are growing their dividends quickly. With this in mind, here are three stocks likely to benefit from the weak greenback. Pfizer (PFE) Dividend Yield: 3.8% I’ll start with Pfizer (PFE), which is heating up thanks to a pair of drivers: Its COVID-19 vaccine, in partnership with BioNTech (BNTX), recently entered late-stage trials. An encouraging second-quarter earnings report that saw revenues and profits both decline less than expected on the strength of its biopharma division. More importantly, Pfizer raised full-year profit guidance from $2.82-$2.92 per share to $2.85-$2.95. Pfizer not only derives more than half of its revenues overseas, but the rest of the globe’s contributions are growing. International revenues came to $7.2 billion in 2019, or about 57% of total sales, up from 53% in 2018. It’s a trait you’ll see in a lot of blue-chip pharma stocks, and one that should benefit them if the U.S. dollar continues to wither. I like the dividend growth story here, too. While PFE lost Aristocrat status during the Great Recession when it cut its payout in half, it has since rebuilt the dividend past pre-reduction levels. That includes 6.3% compound average dividend growth in the past five years, which is a generous level for such a mature company. Pfizer’s Yield Pretty Good by Historical Standards Philip Morris International (PM) Dividend Yield: 6.0% If a weak dollar props up U.S. multinationals, you have to love an American-headquartered company that reports its results in U.S. dollars but doesn’t generate a cent of revenue domestically. NYC-based Philip Morris International (PM), which was spun off from Altria Group (MO) in 2008, sells cigarettes and other products in more than 180 international markets, where it often holds either the No. 1 or No. 2 position. It boasts six of the top 15 international brands, including longtime leader Marlboro. It has also invested heavily in heated tobacco, which is yet another cigarette alternative that’s picking up speed. Its IQOS brand boasted 15.4 million users as of the end of the second quarter, up from 14.6 million in Q1, its pace of growth slowed by COVID-19, but not squashed. While Philip Morris is fighting many of the same anti-tobacco trends here in the U.S., it has been slowly but surely able to grow revenue for several years without interruption. While 2020 should end that streak, it still appears far better-positioned than its American counterparts. No yield concerns here, either. At 6%, PM shares are at the high end of what you can expect from traditional blue chips. Its dividend growth rate of 3.2% annually, while modest, outstrips current-day inflation; we’ll see if the Fed’s printing press changes that. Just be realistic. Tobacco, at best, will provide merely glacial growth. The yield will be most of your returns, so ask yourself: Is 6% enough? Philip Morris’ Next Decade Could Look Just Like This, Too Chevron (CVX) Dividend Yield: 5.6% In June, I highlighted Chevron (CVX) as a good yield that we’d soon be able to buy as a great yield. And guess what? We’re getting there. Chevron’s Yield Is Creeping Back Into Can’t-Miss Territory You know the story. Oil fell off a pair of cliffs this year—first as COVID-related pressures started to mount, then again as the Saudis started a brief price war that momentarily sent crude prices into negative territory. Several small energy players have been forced into bankruptcy. Blue-chip Royal Dutch Shell (RDS.B) cut its payout, and Wall Street seems to believe BP (BP) will, too. Dividend Aristocrat Chevron (CVX), which faced similar conjecture in 2015, has vowed this year to protect the dividend. We’ll see if that’s the case in Chevron’s latest earnings report, but between killing off share repurchases and slashing capex, as well as recovering oil prices, I tend to think CVX will keep its payout intact. The fact that Chevron felt brave enough to buy Noble Energy in a $5 billion all-stock deal gives me more confidence. Short-term, however, oil’s rebound has flattened and so has the recovery in Chevron’s stock, which is nudging the yield back toward 6%. There’s no doubt a weak U.S. dollar could help Chevron. The company’s international segments generated $8.6 billion in earnings when it only earned $2.9 billion total – U.S. Upstream and “All Other” accounted for nearly $7 billion in losses. But given CVX’s prospects for slow dividend growth in the face of low oil prices, we should wait to see if a bigger bargain presents itself. Want More Great Investing Ideas? Your Early Retirement Portfolio: 7.7% Dividends—Every Month—Forever How to Retire on 10% Dividends Paid Monthly The Simple (and Safe) Way to Earn 15% Every Year from Stocks PFE shares were trading at $38.42 per share on Thursday morning, down $0.46 (-1.18%). Year-to-date, PFE has gained 0.05%, versus a 1.17% rise in the benchmark S&P 500 index during the same period."}]}