{"article": [{"url": "https://stocknews.com/news/abbv-rio-ngg-mpw-4-large-cap-stocks-that-pay-a-high-dividend/", "published": 1597320500.0, "headline": "4 Large-Cap Stocks That Pay a High Dividend", "body": "Low-interest rates and an uncertain economic outlook make dividends even more attractive. Due to low bond yields, many bond investors are adding dividend-paying stocks to their portfolios in search of higher returns which be a potent tailwind for the sector. Dividends of large-cap stocks are considered the safest because they have large balance sheets that insulate them from any negative shocks. Their size also enables them to take advantage of the liquidity in financial markets by issuing debt at low-rates. AbbVie Inc. (ABBV), Rio Tinto Plc (RIO), National Grid Transco (NGG), and Medical Properties Trust, Inc. (MPW) are four high-quality, large-cap, dividend-paying stocks that are worth considering for your portfolio. 7 Best ETFs for the NEXT Bull MarketAbbVie Inc. (ABBV) With a market cap of $168.56 billion, ABBV operates in the realm of critical therapeutic areas in medicine such as virology, neuroscience, immunology, oncology, gastroenterology, among other specializations. The stock has grown more than 50% since hitting its 52-week low of $62.55 in March. This company is in the race to find a cure for the coronavirus with an aim to develop a novel antibody therapeutic. To that end, ABBV joined forces with Harbour BioMed, Utrecht University, and Erasmus Medical Centre. Members of the COVID R&D Alliance, which includes ABBV announced the first patients enrolled in the I-SPY COVID Trial, which will study the impact of Cenicriviroc, Otezla®, and Firazyr® on inflammatory response in COVID-19 patients. Furthermore, ABBV has also recently announced positive Phase 3 study results for some of its products, which could be an encouraging sign for investors. ABBV has issued more total dividends over the past six years than 97% of other dividend issuing US stocks in the StockNews.com universe. ABBV declared a quarterly cash dividend of $ 1.18 per share, which is payable to shareholders on 14th August this year. ABBV has an annual dividend of $4.72, which yields 4.94%. The company has increased its dividend by 195% since its inception. In the second quarter, net revenues increased 26.3% on a reported basis, and earnings per share increased 3.5% year-over-year. The market expects the company to report an EPS of $2.76 for the quarter ended September 2020, which represents a 18.5% growth over the year-ago number. Also, ABBV beat its consensus EPS estimates in each of the trailing four quarters. ABBV’s consensus revenue estimate of $12.82 billion for the quarter ended September indicates a year-over-year increase of 51.2%. How does ABBV stack up for the POWR Ratings? A for Buy & Hold Grade A for Peer Grade B for Trade Grade B for Industry Rank B for Overall POWR Rating The stock is also ranked #11 out of 215 stocks in the Medical-Pharmaceuticals industry. Rio Tinto Plc (RIO) This $77.78-billion mining and metals company has approved an investment close to $200 million for the next stage of development of the lithium-borate Jadar project in Serbia. The project has the potential to supply a significant number of end-industrial products and supply borates across the world. The company also revealed the maiden Inferred Mineral Resource at the Winu copper-gold project in Western Australia and discovery of a new gold dominant mineralization zone approximately 2 km east of the Winu deposit. Subject to regulatory approval, the company targets the first production for 2023. In spite of the difficult market challenges, RIO has operated its global mine to market diamonds. In the second quarter, RIO’s production increased in Pilbara iron ore (4% year-over-year), Bauxite (9%), and IOC iron ore pellets and concentrate (9%). The stock has grown more than 70% since its March lows. RIO pays an annual dividend of $3.10, which yields 5.05%. RIO has declared an interim dividend of $2.5 billion with an interim pay-out ratio at 53% of underlying first-half earnings, equivalent to 155 cents per share. The 2020 interim dividend will be paid on 17th September to Rio Tinto Limited, Rio Tinto plc, and Rio Tinto plc ADR shareholders. It’s no surprise that RIO is rated “Strong Buy” in our POWR Ratings system. It also has an “A” for Trade Grade, Buy & Hold Grade and Peer Grade, and a “B” for Industry Rank. In the 33-stock Industrial-Metals industry, it is ranked #2. National Grid Transco, PLC National Grid PLC (NGG) ISO-New England selected the Ready Path Solution, a collaboration between NGG and Eversource, to maintain grid-reliability following the retirement of the Mystic Generating Station in 2024. The $44.20-billion electricity and natural gas delivery company has grown 35.3% since hitting its 52-week low of $44.29 in March. NGG is planning a $10 million pound project in England to check if hydrogen could be used for heating with a view to contributing to Britain’s 2050 net-zero emissions goal. In the report for the year ended March 2020, CEO John Pettigrew, said, “We maintained high levels of reliability across our networks and delivered good financial performance. Asset growth of 9% was underpinned by record investment of £5.4 billion. We achieved continued regulatory progress in the UK, responded proactively to the challenges in downstate New York, whilst further developing our interconnector and renewable portfolios. Looking ahead, whilst COVID-19 will impact our financial performance in FY21, we expect this to be largely recoverable over future years and therefore anticipate no material economic impact on the Group in the long-term. We continue to target the asset growth of 5-7% in the near term. With an efficient balance sheet that underpins asset and dividend growth, the Group is well-positioned to create value for shareholders.” NGG has an annual dividend of $3.99, which yields 6.88%. NGG usually dividends: on a semiannual basis. NGG’s POWR Ratings reflect this promising outlook. It has an overall rating of “Buy” with an “A” for Trade Grade and Peer Grade and a “B” for Buy & Hold Grade and Industry Rank. In the 18-stock Utilities-Foreign industry, it is ranked #1. Medical Properties Trust, Inc. (MPW) MPW is a $10.32-billion real estate investment trust that acquires and develops net-leased hospital facilities. The stock has returned more than 55% since its March lows. In the second quarter, total revenues increased by 51.6%, and net income attributable to common stockholders increased by 37.8% year-over-year. MPW has an annual dividend of $1.08, which yields 5.54%. The company has increased its dividend for 22 quarters in a row. MPW’s consensus revenue estimate of $ 320.31 million for the quarter ended September indicates a year-over-year increase of 42.5%. The market expects the company to report an EPS of $0.26 for the quarter ended September 2020, which represents a 30% growth over the year-ago number. MPW is rated “Buy” in our POWR Ratings system. It also has an “A” for Trade Grade and a “B” for Peer Grade. It is also ranked #2 out of 16 stocks in the REITs-Healthcare industry. Want More Great Investing Ideas? 9 “BUY THE DIP” Growth Stocks for 2020 How to Trade THIS Stock Bubble? 7 “Safe-Haven” Dividend Stocks for Turbulent Times ABBV shares rose $0.42 (+0.44%) in after-hours trading Thursday. Year-to-date, ABBV has gained 11.34%, versus a 5.73% rise in the benchmark S&P 500 index during the same period."}]}