{"article": [{"url": "https://stocknews.com/news/amc-why-are-shares-of-amc-entertainment-holdings-surging/", "published": 1599048500.0, "headline": "Why are Shares of AMC Entertainment Holdings SURGING?", "body": "Shares of AMC Entertainment Holdings (AMC) are advancing, exceeding its post-coronavirus peak of $6.52. AMC Entertainment Holdings has agreed to sell its theatres in the Baltics. The firm is attempting to reverse a pre-pandemic court order and repurchase US theaters. There is no place like home – the old adage probably resonates with AMC Entertainment Holdings recent moves in Europe and the US. AMC announced it is selling its theaters in the Baltic Region to UP Invest, an operator of theaters in Latvia, Lithuania, and Estonia. That adds cash to the firm, adding to its capital raising and debt restructuring. The deal is estimated at $77 million. Apart from bolstering its finances, CEO Adam Aron is set to extend the company’s presence in its home market. After antitrust regulators forced AMC to divest its holdings in several theaters in 2016 and 2017, Â The Hollywood Reporter has said that AMC Entertainment Holdings has asked a court in Washington D. C. to reverse that order. 7 \"SAFE HAVEN\" Dividend Stocks for Turbulent TimesThe company cites the changed circumstances as the motive for reacquiring cinemas. Given the difficulties of COVID-19 – which triggered sales of movie tickets for as low as $0.15 – the Department of Justice may soften its opposition to such an accord. While officials may be less wary of consolidation in the theater business, the run-up to the elections may be a cause for a pause. AMC is owned by Dalian Wanda Group – a Chinese conglomerate. Sino-American relations have deteriorated and there is a bipartisan consensus against Beijing. AMC management probably assumes that a deal involving cinemas – 20th-century technology, and not hi-tech – regulators may allow for the purchase that could also save American businesses from shutting down. AMC Stock Forecast AMC has been extending their gains on Wednesday, reaching as high as $7.71. The current valuation is still half of the 52-week high above $12, but the prospects of Americans returning to the movies could help it gradually recover lost ground. AMC shares were trading at $6.74 per share on Wednesday afternoon, up $0.67 (+11.04%). Year-to-date, AMC has declined -6.33%, versus a 11.53% rise in the benchmark S&P 500 index during the same period."}]}