{"article": [{"url": "https://stocknews.com/news/aapl-khc-gs-amzn-4-warren-buffett-stocks-to-buy-in-august/", "published": 1596110900.0, "headline": "4 Warren Buffett Stocks to Buy in August", "body": "Going into the coronavirus crisis, Warren Buffett’s Berkshire-Hathaway (BRK.A) $137 billion in cash and investors were speculating which company he might buy next. Buffett is famous for making some of his greatest investments during economic and market crises. So, it’s been surprising, he hasn’t put much money to work in the past 5 months, except his recent purchase of natural gas pipelines from Dominion Energy (D) for $10 billion. Many are interpreting his inaction as him being skeptical about the stock market’s recovery and his bearish attitude about the economy. 7 \"SAFE HAVEN\" Dividend Stocks for Turbulent TimesBerkshire-Hathaway owns a variety of companies in many different parts of the economy, so he has a deeper insight into how the economy is doing based on the performance of his businesses. Further, he’s cultivated relationships with CEOs and leaders in many fields who can give him valuable information. He also has a close, personal relationship with Bill Gates, who was one of the first to warn about the coronavirus and has spearheaded efforts to develop a vaccine. Buffett has also sold positions in some stocks like Wells Fargo (WFC) and the airlines. However, his core holdings remain unchanged which indicates that he continues to believe in these stocks’ long-term potential. Apple (AAPL), Kraft-Heinz (KHC), Goldman Sachs (GS), and Amazon (AMZN) are four stocks that Buffet continues to own significant stakes in. Apple Inc. (AAPL) Speaking about AAPL Warren Buffett said, “I don’t think of Apple as a stock. I think of it as our third business. It’s probably the best business I know in the world. And that is a bigger commitment that we have in any business except insurance and the railroad.” AAPL constitutes a sizable chunk of Warren Buffett’s investments, about 35.5% of his portfolio. The company’s strong customer loyalty and diversification of its business give it an edge. There has been immense hype for the first 5G iPhone which could face a delay in launch due to the current circumstances. However, most experts are projecting that over 100 million iPhone 12s will be sold within a couple of months of the phone’s release. Twenty-five out of thirty-two Wall street analysts recommend a ‘Buy’ rating on the stock. Since its March lows, the stock is up by about 70%. AAPL has an impressive earnings surprise history with the company beating consensus EPS estimate in each of the trailing four quarters. In the fiscal second quarter, EPS was up 4% year over year and AAPL’s operating cash flow was up $2.2 billion as compared to the year-ago period. How does AAPL stack up for the POWR Ratings? A for Trade Grade A for Buy & Hold Grade B for Peer Grade A for Industry Rank A for Overall POWR Rating You can’t ask for better. The stock is also ranked #1 out of 28 stocks in the Technology-Hardware industry. The Kraft Heinz Company (KHC) Berkshire Hathaway owns about a 27% stake in KHC and the stock has a weightage of 4.59% in his portfolio. As a result, any change in position from Warren Buffet’s company could either attract investor attention or make them dump KHC. KHC is one of the leading food and beverage companies with a diverse portfolio of iconic and emerging brands. KHC has been focused on growing its business across all segments by investing in product development and its e-commerce platform. The company has also been undertaking measures to augment efficiency in supply chain management and control costs. The higher pricing in the United States and international segments has increased KHC’s overall pricing 1.6% year over year in the first quarter. However, net sales were up 3.3%, and operating income increased 37.1% year over year. KHC currently pays an annual dividend of $1.60 per share, which yields 4.59% based on its current price. While the company cut its quarterly dividend in 2019, the current dividend yield is pretty attractive for income investors. The company should be able to sustain the current dividend level, as it has been witnessing continued growth in free cash flow. Moreover, KHC has an impressive earnings surprise history with the company beating consensus EPS estimates in each of the trailing four quarters. The consensus revenue estimate for the quarter ended June indicated an increase of 1.9% year over year. KHC has been showing a bullish trend and is up by more than 65% from its March lows. It’s no surprise that KHC is rated “Strong Buy” in our POWR Ratings system. It also has an “A” for Trade Grade, Buy & Hold Grade, Industry Rank, and Peer Grade. In the 56-stock Food Makers industry, it is ranked #2. Goldman Sachs Group, Inc. (GS) Buffett reduced his stake in GS by selling about 84% of his holdings in the first quarter. However, the investment bank’s EPS is expected to grow by 6.1% per annum in the next five years. Since the stock hit a 52-week low of $130.85 in mid-March, it has gained more than 50%. In the second quarter, net revenues increased 41% year over year and firmwide assets under supervision increased to a record $2.06 trillion. Moreover, GS launched its transaction banking business in the United States which involves payments, deposit-taking, liquidity management, and escrow services. The deposits on the platform increased by $16 billion to $25 billion. Equity multiplier, or assets relative to shareholders’ equity, comes in at 11.04 for Goldman Sachs Group Inc; that’s greater than it is for 94.71% of US stocks in the Stocknews.com universe. GS has an annual dividend of $5, which yields 2.48% GS has a grade of B in Trade Grade according to the POWR Ratings system. Among the 27 stocks in the Investment Brokerage group, it’s ranked #11. Amazon.com, Inc. (AMZN) In an interview with CNBC, Buffett admitted that he was a fan of AMZN and that he had been an idiot for not buying the stock earlier. Berkshire Hathaway bought AMZN shares last May and raised its stake by 11% in August 2019 from its previous buy, which left the company with 537,300 shares of Amazon, worth $947 million at the end of the second quarter. AMZN’s recent price performance reflects its ability to capitalize on the recent trend of digitalization. The stock has gained more than 70 % since hitting a year-to-date low in mid-March. Amazon Web Services recently announced a multi-year global agreement with HSBC Holdings plc (HSBC) in which its technology will be used across the bank’s line of business and will help deliver new personalized banking services. In July, AMZN announced the general availability of some of its valuable services such as Contact lens, Interactive Video Service, and AWS IoT SiteWise which is an encouraging sign for potential investors. The average revenue estimate of $81.5 billion for the quarter ended June 2020 indicates an increase of 28.5% over the year-ago quarter. AMZN’s EPS is expected to grow 30.7% per annum in the next five years. In the first quarter, net sales increased 26% year-over-year, and trailing 12-month operating cash flow increased by 16%. It’s no surprise that AMZN is rated “Buy” in our POWR Ratings system. It also has an “A” for Trade Grade and Industry Rank and a “B” for Buy & Hold Grade and Peer Grade. In the 54-stock Internet industry, it is ranked #16. Want More Great Investing Ideas? 9 “BUY THE DIP” Growth Stocks for 2020 How HIGH Can This Tech Bubble Fly? 7 “Safe-Haven” Dividend Stocks for Turbulent Times AAPL shares rose $22.05 (+5.73%) in after-hours trading Thursday. Year-to-date, AAPL has gained 31.69%, versus a 1.69% rise in the benchmark S&P 500 index during the same period."}]}