{"article": [{"url": "https://stocknews.com/news/msft-aapl-microsoft-and-apple-continue-to-thrive/", "published": 1594037300.0, "headline": "Microsoft And Apple Continue to Thrive", "body": "The stocks continue to soar Beating expectations consistently Tweaking the business to stay ahead- Closing retail outlets Microsoft (MSFT) is the king of software. Apple’s (AAPL) franchise in smartphones and personal computers and tablets is unrivaled. At the end of last week, MSFT and APPL had a combined market cap of an incredible $3.142 trillion. Each company is a member of the exclusive club with a value of over $1.5 trillion. When it comes to computers, the first names that come to mind are Bill Gates and Steve Jobs, the founders of the two companies. The shares of both companies fell dramatically with the rest of the stock market in March. Fears over the global pandemic gripped markets across all asset classes caused a temporary spike to the downside in the shares. At the end of last week, MSFT shares were almost 57% above the March low after making a new record high. AAPL shares were over 75% higher after reaching an all-time peak in June. 9 \"BUY THE DIP\" Growth Stocks For 2020Coronavirus has presented a challenge for many companies across all business sectors. When it comes to MSFT and AAPL, the virus may have increased their value. Both companies set a standard for retail businesses as they close storefronts and move towards an online presence. The decline in costs could make their products less expensive and increase their earnings in the future. The stocks continue to soar Thanks to the Fed’s accommodative monetary policy and significant outperformance by the tech sector, shares of MSFT and AAPL have moved to new all-time highs. Source: Barchart The long-term chart of MSFT shares shows that the stock rose to its most recent peak at $208.02 on July 2. The move from a low of $132.52 on March 23 has been a one-way street to the upside. Source: Barchart AAPL hit a record high at $372.38 on June 23, after trading to s a low of $212.61 on March 23. APPL was at over $364 at the end of last week with MSFT at over $206. Both stocks were knocking on the door at even higher highs. Beating expectations consistently Part of the magic for the tech sector’s two leaders is that they continually beat analyst EPS estimates. Source: Yahoo Finance MSFT earnings have come in above analyst estimates over the past four consecutive quarters. In Q1 2020, the company reported $1.40 per share, while the projections were for $1.26. In Q2, the expectations are for $1.38 per share. Source: Yahoo Finance APL has been on the same path, with Q1 EPS of $2.55, which beat estimates of $2.26 per share. The expectations for Q2 are currently for earnings of $2.00 per share. The two tech franchises continue to be an integral part of most investment portfolios. Tweaking the business to stay ahead- Closing retail outlets The global pandemic will change the business world. Retail stores were already showing signs of a steady decline. During the annual holiday season, sales on “Black Friday,” the day after Thanksgiving, have declined compared to on cyber Monday. The popularity and ease of shopping online have changed retail businesses forever. Meanwhile, social distancing and stay at home guidelines during the global pandemic has only hastened the demise of retail and bolstered the rise of e-commerce. Last week, Microsoft announced that it was closing all of its physical stores and transforming just four flagship establishments into “experience centers” to cause consumers to seek support over the phone or via online links. Apple could be moving in the same direction as Microsoft. Last week, the company closed 28% of its retail outlets in the US because of new outbreaks and hotspots for coronavirus. The temporary closures include fifteen stores in California, ten in Texas, five of Georgia’s six locations, four of five stores in Nevada, and two in Florida. Apple has a total of 271 stores across the US, and the company said “We look forward to resuming full operations as soon as it’s safe to do so,” but the shutdowns since February and March did not stop the company from continuing to sell its products, and the shares are at a record level. I would not be surprised to see Apple’s Genius Support to move online as the business transforms. Lower overheads may translate to lower product prices for consumers as well as higher earnings for the two technology giants. Meanwhile, both MSFT and AAPL are both in a position to acquire smaller technology companies to expand their suite of products and services. The tech sector leaders should continue to thrive in the post-COVID 19 environment as they transform their business to reflect the changes in human behavior. Technology has risen above the global pandemic on so many levels. Want More Great Investing Ideas? 9 “BUY THE DIP” Growth Stocks for 2020 Is the Bull S#*t Rally FINALLY Over? 7 “Safe-Haven” Dividend Stocks for Turbulent Times Top 3 Investing Strategies for 2020 MSFT shares were trading at $210.83 per share on Monday morning, up $4.57 (+2.22%). Year-to-date, MSFT has gained 34.43%, versus a -0.46% rise in the benchmark S&P 500 index during the same period."}]}