{"article": [{"url": "https://stocknews.com/news/lqd-pff-vpu-buy-these-2-secure-dividend-funds-for-a-zero-interest/", "published": 1598011700.0, "headline": "Buy These 2 Secure Dividend Funds For a Zero Interest Rate World", "body": "Casual investors will be aware of what happens in the stock market, but may not be as well informed about the current state of interest rates. Retirement plan experts recommend allocating a large portion of 401(k) accounts to bonds, and those building for retirement using their company 401(k) plans may not be aware of how much low interest rates are hurting their retirement prospects. I suspect savers would be shocked if they knew how little the fixed income investments that are in their 401(k) and other retirement accounts have been earning. 401(k) advisors almost universally recommend making retirement plan contributions into exchange-traded funds to have a balance of equity (stocks) and fixed income (bonds) in the account. The most historical allocation strategy is to go with 60% stocks and 40% bonds. An article in Forbes provides these allocation models: Income Portfolio: 70% to 100% in bonds. 7 Best ETFs for the NEXT Bull MarketBalanced Portfolio: 40% to 60% in stocks. Growth Portfolio: 70% to 100% in stocks. The fund industry has developed “target” date funds that hold an allocated portfolio based on when the 401(k) saver expects to retire. Fidelity calls theirs Freedom funds. For a target to retire in 20 years, the Freedom Fund 2040 is 10% in bonds and 90% divided between U.S. and international stocks. As the individual gets closer to retirement, the percentage in bonds increases, with the Freedom 2030 fund up to 30% allocated to bonds, and the 2025 fund is up to 41% in bonds and short term investments. The point is if you have a 401(k) plan through your employer, as much as 40% of your retirement account is likely invested in the bond market. That should scare you. Interest rates have crashed in 2020, and your fixed-income investments are hardly earning any yield. Let’s look at some examples. iShares iBoxx Investment Grade Corporate Bond ETF (LQD) The largest investment-grade bond ETF, the iShares iBoxx Investment Grade Corporate Bond ETF (LQD), reports a current SEC yield of $3.17%. In dollar terms, $100,000 invested in this fund will produce $3,170 per year in interest income. Vanguard Short-Term Investment-Grade Fund (VFSTX) Shorter-term bond funds are more conservative, and the Vanguard Short-Term Investment-Grade Fund (VFSTX) reports a current yield of 2.52%. Fidelity uses its own Fidelity Government Money Market Fund as the sweep account for cash in a brokerage account. This money market fund currently yields just 0.01%. That is one-hundredth of a percent. Put $100,000 into this fund, and it will pay $10.00 per year in interest. I suspect that if you had $100k in an account, you would like to earn more than ten bucks a year. The point of this is that your 401(k) may be up to 40% in bond investments that earn meager yields. This large portion of the typically allocated retirement account is not earning and growing at a rate which will help provide a substantial nest egg at retirement. If employees knew how little their 401(k) money was earning, they’d revolt . The only way the large financial firms get away with this is that 401(k) plans hold trillions of dollars in low yield bonds because the workers those plans are supposed to help don’t understand. The traditional 401(k) allocation rules don’t work in this world where the ten-year Treasury note yields just 0.65%. Where money market funds barely pay interest. It is time to rethink where to invest the money in a retirement plan allocated to fixed income. Here are a couple of ideas. iShares Preferred and Income Securities ETF (PFF) Preferred stocks pay safe dividends that are guaranteed as long as the issuing company continues to pay common stock dividends. The iShares Preferred and Income Securities ETF (PFF) yields 5.5%, almost double the yield on a corporate bond ETF. Vanguard Utilities ETF (VPU) Utility stocks also pay steady and growing dividends with a high level of safety. Utilities are boring in that yields are moderate, and dividend growth is sustained. But that’s what makes a quality utility ETF an excellent substitute for a low yield bond fund. For example, the Vanguard Utilities ETF (VPU) yields 3.24%, and you can expect the dividends to grow by 3% to 4% each year. If you are allowed to broadly self-direct the investments in your 401(k) account, other preferred stock and utility funds pay even better yields. Want More Great Investing Ideas? Top Dividend Stock to Own! Download Free Report Today Buy These 3 High-Yield Dividend Stocks All Under $15 Buy and Hold These 3 Dividend Stocks Forever LQD shares were trading at $136.45 per share on Friday afternoon, up $0.25 (+0.18%). Year-to-date, LQD has gained 8.47%, versus a 6.56% rise in the benchmark S&P 500 index during the same period."}]}