{"article": [{"url": "https://stocknews.com/news/cmg-wen-wing-pzza-4-restaurant-stocks-prospering-in-the-pandemic/", "published": 1596542900.0, "headline": "4 Restaurant Stocks PROSPERING in the Pandemic", "body": "The restaurant industry has been hit hard by the pandemic. Despite the gradual reopening of most restaurants after prolonged closure, people are still apprehensive about dining in. So, online delivery and drive-thru systems are gaining popularity now. Chipotle Mexican Grill, Inc. (CMG), Papa John’s International, Inc. (PZZA), The Wendy’s Company (WEN), and Wingstop, Inc. (WING) are four such stocks that gained momentum despite a slow sectoral recovery. These companies modified their business models to focus more on digital sales and drive-thru services. They have also expanded their operations by opening new outlets and hiring additional employees. The financial stability and robust recovery have allowed these stocks to gain more than 100% in value since the onset of the pandemic. 9 \"BUY THE DIP\" Growth Stocks For 2020Chipotle Mexican Grill, Inc. (CMG) CMG has managed to not only retain its business operations during the pandemic, but also undertake expansion projects. It opened 19 new restaurants in the first quarter of 2020, and its digital sales increased 80% year over year during the lockdown. CMG’s drive-thru facility, known as Chipotlane, is present in 32 states, and has been introduced in 11 of the new restaurants opened in 2020. Out of its estimated new employee hiring of 10,000, CMG has already appointed 8,000. Moreover, CMG recently launched a new avocado dyed clothing and accessories line, with first access given to 15 million Chipotle Rewards’ members. CMG’s second-quarter results were impressive. Digital revenue increased 216.3% year over year during the quarter, accounting for 60.7% of its total revenue. Net sales increased 6.4% month to date (through July 23rd). CMG opened 37 new restaurants, including relocations, during this quarter, while 3 restaurants were permanently closed. The company also has substantial cash holdings and credit facilities, which will help it brave the crisis. CMG’s EPS is expected to grow 22.2% annually for the next five years. The consensus revenue estimate of $1.58 billion for the third quarter indicates a 12.4% rise year over year. Since hitting its 52-week low of $415.00 on March 18th, CMG gained more than 185% to hit its 52-week high on July 22nd. How does CMG stock up for POWR Ratings? A for Trade Grade A for Buy & Hold Grade A for Peer Grade B for Industry Rank A for Overall POWR Rating. You can’t ask for better. It is also ranked #1 out of 48 stocks in the Restaurants industry. Papa John’s International, Inc. (PZZA) As one of the biggest fast food chains operating in the United States and internationally with more than 5,395 restaurants, PZZA has been one of the better-performing companies during the pandemic. It hired around 20,000 people in the first half of 2020 and plans to hire 10,000 more. PZZA reported sales increases of 5.3% and 2.3% in the United States and the international markets, respectively, in the first quarter, despite most countries announcing a complete lockdown. With the gradual reopening of most economies since May, PZZA witnessed 28% growth in sales in the second quarter in the United States, and 5.3% internationally. Same store sales in the United States grew 24.5% in June alone. The consensus EPS estimate of $0.45 for the second quarter indicates a 60.7% rise year over year. PZZA hit its 52-week low of $28.55 on March 18th and gained more than 230% since. PZZA is rated a “Strong Buy” stock in our POWR Ratings system, due to its impressive performance year-to-date. It has an “A” in Trade Grade, Buy & Hold Grade and Peer Grade, and a “B” in Industry Rank. Out of 48 stocks in the Restaurants industry, PZZA is ranked #4. The Wendy’s Company (WEN) Mostly known for its quick-service restaurant business, WEN also operates in global real estate and development. Apart from more than 6,400 outlets, Wen owns 1,248 properties lent out on lease for commercial use. WEN digital sales grew 5.5% in the first quarter of 2020, indicating the strong business momentum despite the lockdown. It also added 2 new delivery partners to facilitate the timely delivery of food to its consumers. To ensure steady demand during this crisis, WEN introduced a new loyalty program on July 22nd to provide substantial discounts to its regular customers. Almost 99% of the restaurants in the United States have reopened as of May 31st, and 89% of the WEN’s chain is now operational. Digital sales contributed 4.5% to the total systemwide sales in the country, while the breakfast menu contributed 8% in the month of May. WEN’s EPS is expected to grow at 9.2% annually for the next five years. It regained more than 235% since hitting its 52-week low of $6.82 on March 18th. WEN is rated a “Strong Buy” in our POWR Ratings, with an “A” in Trade Grade, Buy & Hold Grade, and Peer Grade, and a “B” in Industry Rank. In the 48-stock Restaurants industry, it is ranked #2. Wingstop, Inc. (WING) WING is known for chicken tenders and wings with special handmade sauce. The company has over 1,400 outlets worldwide. WING reported impressive profits for the second quarter, despite the adverse effect of the pandemic on the restaurant industry. It opened 23 new outlets during the quarter, and its systemwide sales increased 37% year over year to $509 million. WING’s digital sales accounted for 63.7% of the domestic system-wide sales. Domestic same-store sales grew 31.9% year over year during the same period. WING’s net revenue increased 36.1% year over year to $66.1 million in the second quarter. Consequently, quarterly net income grew 134.6% year over year to $11.5 million. As dine-in restaurants are quickly being replaced by online delivery and drive-thru systems due to the social distancing norms, WING aims to shift its kitchens 100% off-premise. In this regard, it opened its first ghost kitchen on June 30th. Chairman and CEO Charlie Morrison said, “We have a goal to digitize 100% of transactions as we drive to become a top 10 global restaurant brand and we believe ghost kitchens are a great step for the brand as delivery and digital sales continue to increase.” WING hit its 52-week low of $44.27 on March 19th due to the virus led market crash but gained more than 265% since then. WING is rated “Strong Buy” in our POWR Ratings system, consistent with its impressive performance in the second quarter. It holds an “A” for Trade Grade, Buy & Hold Grade, Peer Grade, and a “B” in Industry Rank. It is currently ranked #3 out of 48 stocks in the Restaurants industry. Want More Great Investing Ideas? 9 “BUY THE DIP” Growth Stocks for 2020 How HIGH Can This Tech Bubble Fly? 7 “Safe-Haven” Dividend Stocks for Turbulent Times CMG shares were unchanged in after-hours trading Tuesday. Year-to-date, CMG has gained 39.12%, versus a 3.60% rise in the benchmark S&P 500 index during the same period."}]}