{"article": [{"url": "https://stocknews.com/news/acb-the-bullish-and-bearish-case-for-aurora-cannabis/", "published": 1596024500.0, "headline": "The Bullish and Bearish Case for Aurora Cannabis", "body": "Yesterday, Aurora Cannabis (ACB) rallied more than 10% with the rest of the cannabis industry, only to fall 9% today. Investors are understandably confused about where this stock is headed. So today I’m laying out the bullish and bearish cases for the company: Bullish Case for ACB The next quarter will be crucial for ACB. The company will need to show further improvement in SG&A costs as it moves towards its goal of $40 million per quarter. If the company can post stable revenues with decreasing SG&A costs along and prove to investors that they are on track to record positive EBITDA by next quarter, then ACB has the chance to rally again. 7 \"SAFE HAVEN\" Dividend Stocks for Turbulent TimesI will also be watching how much revenue the company was able to generate from its international efforts in Germany and CBD sales in the United States. After announcing its acquisition of Reliva earlier this year, ACB said that it planned to grow global revenue. Bearish Case for ACB Despite delivering a relatively positive quarter for Q1, it’s pretty clear that ACB has resumed its downtrend. After the stock shot up from $5 a share to almost $17, it’s been declining since. Last week the price almost fell into single digits. The company has also been unable to bring in a new permanent CEO. It’s hard to put faith in a company that has an interim CEO. Although the company has been making drastic changes to management, a new CEO is essential for the long term. Also, ACB is still hauling around $2 billion in debt on its balance sheet and may need to write down some of its assets. Until this has been done, the company still carries a ton of risk. Final Thoughts There are still some things to like about ACB despite its poor performance and questionable management. With the stock being one of the most popular stocks among millennials, there is still a chance for a rally. ACB remains a highly volatile and speculative company but could reward investors that can stomach the volatility. Disclosure: The author is long ACB Want More Great Investing Ideas? 9 “BUY THE DIP” Growth Stocks for 2020 Newly REVISED 2020 Stock Market Outlook 7 “Safe-Haven” Dividend Stocks for Turbulent Times ACB shares were trading at $10.72 per share on Wednesday afternoon, down $0.98 (-8.38%). Year-to-date, ACB has declined -58.64%, versus a 2.18% rise in the benchmark S&P 500 index during the same period."}]}