{"article": [{"url": "https://stocknews.com/news/w-ostk-fvrr-prts-4-buy-rated-internet-retail-stocks/", "published": 1597147700.0, "headline": "4 \"Buy Rated\" Internet Retail Stocks", "body": "The e-commerce industry has quite successful amid the coronavirus pandemic when almost all the sectors were left to bleed. A change in consumer behavior to comply with the “new normal” has worked in favor for the industry. Customers are adapting to the digital space in buying all types of products ranging from groceries to furniture. According to Adobe’s (ADBE) Digital Economy Index report, the first six months of 2020 has seen a spending of $368.8 billion on online platforms, and June saw a 76.2% year-over-year increase in online spending in the United States. This shift has instilled huge momentum into internet retail stocks. Wayfair Inc. (W), Overstock.com, Inc. (OSTK), Fiverr International Ltd. (FVRR) and CarParts.com, Inc. (PRTS) are the four “Buy rated” stocks that should continue moving higher as Covid-19 continues to persist. 9 \"BUY THE DIP\" Growth Stocks For 2020Wayfair Inc. (W) W is an e-commerce platform in the United States and internationally, offering a range of furniture, home furnishings, decor, and goods. The Boston-based company provides approximately eighteen million products for the home sector under various brands. The pandemic has accelerated the demand for home furniture and the need for home offices due to the new “remote” work culture. W has hit the 26 million active customers mark in its direct retail business during the on-going crisis. W had an excellent second quarter. Net revenue for the quarter increased 84% year-over-year to $4.3 billion. U.S. revenue increased 83% year-over-year, whereas international revenue increased 91% year-over-year. The international segment’s net revenue constant currency growth was 97%. The company also reported free cash flow of $1.1 billion. This was the first positive free cash flow generated by W after nine preceding quarters. The company reported EPS of $3.13, beating the consensus estimate by 201%. Orders delivered in the second quarter were 18.9 million, an increase of 106% year-over-year when 61% of total orders delivered in the direct retail business were placed via mobile devices. The company’s EPS is expected to grow more than 86% in the next quarter. W is presently trading at $298, a 1,273% gain from its March low of $21.7. How does W stack up for the POWR Ratings? A for Trade Grade B for Buy & Hold Grade A for Peer Grade B for Industry Rank B for Overall POWR Rating You can’t ask for better. The stock is also ranked #1 out of 33 stocks in the Special Retailers industry. Overstock.com, Inc. (OSTK) OSTK is a tech-driven online retailer that offers furniture, home décor, and other related products. Apart from providing its products and services through its internet website, the company also focuses on the development and commercialization of financial applications of blockchain technologies. It operates in the United States and internationally. tZero group, a majority-owned subsidiary of OSTK, focuses on the development of Fintech based on Blockchain technologies. It accounts for approximately 95% of security token trade volume and 80% of total token dollar value. The subsidiary has recently signed an agreement with Aspen Digital to trade St. Regis Aspen token on its alternate trading system. OSTK reported strong second-quarter results. Revenues increased 109% year-over-year to $782.5 million. Gross profit rose 143% to $180 million compared to the year-ago quarter. Free cash flow for the company stood at $177 million for the quarter. OSTK has scaled up by growing its new customer base by more than 200% year-over-year. The company also delivered an earnings surprise of 1100% with reported EPS of $0.8. The rising demand for online products and the recent spike in the crypto rates is favoring OSTK’s growth. Analysts expect the company’s EPS to grow 102% next year. OSTK had hit a low of $2.53 on March 18th and the stock is presently trading at $95.58. This accounts to a 3678% gain in less than five months. The stock has also grown more than 165% in July. OSTK is rated a Buy in our POWR Ratings system, consistent with its strong performance and momentum. It holds an A in Trade Grade, Peer Grade, and Industry Rank. It is ranked #16 out of 54 stocks in the Internet industry. Fiverr International Ltd. (FVRR) FVRR operates an online marketplace worldwide. Its platform connects businesses of all sizes with skilled freelancers offering digital services. It enables sellers to sell their services and buyers to buy them. With companies laying off their employees, more people are taking up freelancing jobs. Hence, there has been a surge in both the demand and supply of freelancers. FVRR reported outstanding second quarter results this month. Revenue was $47.1 million, an increase of 82% year-over-year. The gross margin for the quarter stood at 83%. Cash flow provided by operating activities was $5.2 million versus the $3.4 million cash flow used in the comparable quarter last year. Active buyers for the quarter grew to 2.8 million, compared to 2.2 million in the year-ago quarter, an increase of 28%. The company has an impressive history of reporting earnings surprises, consistently beating estimates in the trailing four quarters. FVRR reported an EPS of $0.1 for the second quarter, beating the consensus estimate by 267%. FVRR recently went for a follow-up public offering of $120 million, indicating strong public confidence. The street expects the company’s EPS to grow 77.1% annually over the next five years. The stock is currently trading at $106, recovering more than 520% from it’s all-time low. FVRR’s year-to-date gain stands 351%. FVRR is rated as a Buy in our POWR Ratings system, with an A for Trade Grade, Peer Grade, and Industry Rank. CarParts.com, Inc. (PRTS) PRTS operates as an online retailer of aftermarket auto parts and accessories primarily in the United States, Canada, and the Philippines. It offers collision parts, such as parts for the exterior of an automobile and related products to individual consumers through its network of e-commerce websites and online marketplaces. The company also sells and delivers auto parts to collision repair shops. The second quarter marked significant growth for the company with its inclusion in the Russell 2000 index. PRTS recently reported impressive second quarter results. The company saw revenues grow year-over-year 61% to $119 million. Gross profit for the quarter increased 88% to $41 million. Gross margin was up 480 basis points to 34.3%. Net income for the quarter improved to $1.6 million compared to the year ago quarterly loss of $1.5 million. Moreover, the company reported an EPS of $0.03 for the quarter. The six-months cumulative cash flow from operations increased more than 753% year-over-year to $25.17 million. PRTS has gained more than 523% year-to-date and is presently trading at $13.71. The stock is up by more than 193% in the past three months. It’s no surprise that PRTS is rated a Buy in our POWR Ratings system. It also has an A for Trade Grade and Peer Grade, and a B for Buy & Hold Grade and Industry Rank. In the 50-stock Auto Parts industry, it is ranked #16. Want More Great Investing Ideas? 3 Possible Directions for the Stock Market from Here How to Trade THIS Stock Bubble? 9 “BUY THE DIP” Growth Stocks for 2020 W shares rose $3.37 (+1.09%) in after-hours trading Tuesday. Year-to-date, W has gained 242.07%, versus a 4.46% rise in the benchmark S&P 500 index during the same period."}]}