{"article": [{"url": "https://stocknews.com/news/adbe-orcl-mjco-mndo-are-shares-of-adobe-a-buy-under-500/", "published": 1599653300.0, "headline": "Are Shares of Adobe a Buy Under $500?", "body": "Adobe Inc. (ADBE) is one of the largest global software companies that helps create experiences across billions of screens and has driven incredible innovation. It offers content creation, document management, and digital marketing and advertising software and services to creative professionals and marketers. The company operates with three segments – digital media, digital experience, and publishing for legacy products. With the robust growth in people going digital amid the pandemic, demand for ADBE’s products and services has increased exponentially. The stock is up 40% year-to-date and hit a 52-week high of $536.88 last week. However, the stock has stumbled in the last four trading days due to the technology sell-off and is currently trading 13.9% lower than the recently achieved high. Adobe achieved record quarterly revenue of $3.13 billion in the second quarter of the fiscal year 2020, which represents 14% year-over-year growth. Digital Media segment revenue was $2.23 billion, up 18% year-over-year. Digital Media Annualized Recurring Revenue (ARR) grew to $9.17 billion. Creative ARR formed $7.93 billion, and Cloud ARR grew to $1.24 billion. This impressive performance and the potential upside based on several factors have helped it earn a “Buy” rating in our proprietary rating system. 9 \"BUY THE DIP\" Growth Stocks For 2020Here is how our proprietary POWR Ratings system evaluates ADBE: Trade Grade: A ADBE is currently trading higher than its 50-day and 200-day moving averages of $459.08 and $375.68, respectively, indicating that the stock is in an uptrend. The stock’s 16.2% return over the past three months reflects a solid short-term bullishness. ADBE has been witnessing increasing demand for its products during the pandemic, as the “new normal” way of working and learning are making people depend on cloud platforms. ADBE’s last earnings report showed that its Digital Media segment, which includes its Creative Cloud and Document Cloud divisions, generates 18% higher revenue year-over-year. The company also launched the Adobe Digital Economy Index, which acts as a real-time barometer, analyzing trillions of online transactions across 100 million products and categorizes them in 18 categories. Buy & Hold Grade: B ADBE is fairly positioned in terms of proximity to its 52-week high, which is a key factor that our Buy & Hold Grade takes into account. The stock is currently trading 13.9% below its 52-week high. The stock has gained more than 77% in the last couple of years. The recent developments within the company are enabling enterprises to engage with their customers digitally. The company has produced record revenue in every quarter going back more than five years. It has an impressive long-term performance history, as its revenues grew at a CAGR of 22% over the past five years. In words of Shantanu Narayen, the CEO of Adobe, “The tectonic shift towards ‘all things digital’ across all customer segments globally will serve as a tailwind to our growth initiatives.” Peer Grade: A ADBE is currently rated #5 out of 92 stocks in the Software – Application industry. Other popular stocks in the industry are Oracle Corporation (ORCL), Majesco (MJCO), and MIND C.T.I. Ltd. (MNDO). While MJCO beat ADBE by gaining 94% year-to-date, ORCL and MNDO returned 4.4% and -3.3%, respectively, over this period. Industry Rank: A The Software – Application industry is ranked #9 out of the 123 StockNews.com industries. Since the onset of the health crisis, remote working, and learning culture amplified the dependence on digital infrastructure, resulting in an operational challenge for firms that were less dependent on technology. This situation has created enormous opportunities for the software industry. The major software companies rose to the occasion and are catering to the needs of all other industries. Overall POWR Rating: B (Buy) Overall, ADBE is rated a “Buy” due to its impressive past performance, short-and-long-term developments, and solid price momentum, as determined by the four components of our overall POWR Rating. Bottom Line ADBE has soared as high as 61% so far this year and is a decent investment for investors looking for stability and growth in the long run. It was hit hard last week in the rapid technology sell-off but has the potential to grow further based on its continued business growth and favorable earnings. Analyst sentiment, which gives a good sense of a stock’s future price movement, is pretty impressive for ADBE. Average broker rating of 1.41 indicates a favorable analyst sentiment. Of the 27 Wall Street Analysts that rated the stock, 16 have given it a “Strong Buy” rating. The market expects EPS for the current year to rise 24.1% from the year-ago value. Want More Great Investing Ideas? 7 Best ETFs for the NEXT Bull Market Will Stocks Fall into Historical September Slump? 9 “BUY THE DIP” Growth Stocks for 2020 ADBE shares rose $0.96 (+0.20%) in after-hours trading Wednesday. Year-to-date, ADBE has gained 45.37%, versus a 6.66% rise in the benchmark S&P 500 index during the same period."}]}