{"article": [{"url": "https://stocknews.com/news/spy-inx-dia-iwm-qqq-is-the-bull-st-rally-finally-over/", "published": 1593346100.0, "headline": "Is the Bull S#*t Rally FINALLY Over?", "body": "I normally write this weekly commentary on Friday afternoon. But this time around I had to wait til Sunday evening to see the stock futures. And to witness if investors were finally willing to admit that the rally up to 3,200 was always a case of “irrational exuberance”. Right now market futures are pushing just below 3,000 which is kind of an important psychological area of support for stocks. The last couple times we got to this juncture stocks bounced back with gusto. Interestingly a couple weeks ago the looming break down below 3,000 was thwarted by a “Hail Mary” from the Fed and Trump administration. First, the Fed announced the coming purchases of individual corporate bonds. Then later that same day the Trump administration trotted out plans to for $1 trillion in fresh infrastructure spending. Next thing you know the market rallied 5%. 9 \"BUY THE DIP\" Growth Stocks For 2020Day by day since then the air has been coming out of the tires. And here we are again ending the week precariously balanced on this important level of 3,000. This sets things up for a very interesting week where stocks either succumb to the depressing realities of the economic situation. Or we continue building this house of cards awaiting the collapse at some later date. I know that with Coronavirus cases up 50% coupled with the worst economy in our lifetime that stocks SHOULD tumble below 3,000. I sense that once that actually occurs, then the FOMO will kick in to the downside and we could easily see stock prices tumble another 10-20% lower in short order. On the other hand, I could just as well see stocks spike again extending the trading range scenario I spoke about in this recent article: Bear Case + Bull Case = Trading Range? Especially true if the Fed has another well timed trick up their sleeve. So yes, it could truly go either way at this stage. However, my economics degree + 40 years of investing tell me that we should still be mired in a nasty bear market. And that the bounce from bottom was starting to take on bubble proportions. It has always just been a matter of time before the price of stocks better matches up with the still raging virus that will continue to hamper the economy and corporate earnings for months and, likely, years to come. This is why I am confidently loaded up in a hedged portfolio for the Reitmeister Total Return newsletter that is built to rise as stock prices go lower. For example, this past week alone this portfolio has rallied +1.84% while the S&P shed -2.86%. So imagine how well it will do with the eventual return of the bear market. The hedged portfolio is constructed of 4 stocks and 5 ETFs in order to enjoy gains while the market tumbles lower. And gladly it is not too late to get on board this strategy if you have not protected yourself already. Going forward I will look for spots to emerge from the hedge by buying more and more undervalued stocks for the eventual return to a bull market. I know its crazy out there. And I am trying my best to help investors make sense and profit from the situation. The best way for me to do that is give you 30 days access to the Reitmeister Total Return. This is my newsletter service where I share frequent commentaries on the market outlook, trading strategy, and yes, a portfolio of hand selected stocks and ETFs to produce profits whether we have a bull…a bear…or anywhere in between. Just click the link below to see 4 stocks and 5 ETFs in the portfolio now, and all the future trades as we find bottom on this bear and the new bull emerges. About Reitmeister Total Return newsletter & 30 Day Trial Wishing you a world of investment success! Steve Reitmeister …but everyone calls me Reity (pronounced “Righty”) CEO, Stock News Network and Editor, Reitmeister Total Return SPY shares closed at $300.05 on Friday, down $-7.30 (-2.38%). Year-to-date, SPY has declined -5.82%, versus a % rise in the benchmark S&P 500 index during the same period."}]}