{"article": [{"url": "https://stocknews.com/news/spy-how-to-protect-your-retirement-portfolio-from-the-potential-coming/", "published": 1597406900.0, "headline": "How to Protect Your Retirement Portfolio From the Potential Coming Pandemic Carnage", "body": "On almost all valuation metrics the S&P 500 is trading at some of its loftiest levels in history. Which means the market is priced for nothing bad ever happening again.In part 1 of this series, I explained the first two critical facts about the pandemic all investors need to know. One of those facts was that the second wave that was expected in the fall, is still expected to happen, for two important reasons. In part two of this series, I’ll explain the kind of grisly toll the pandemic is expected to take through the end of the year, both in terms of lives, but potentially also in terms of your portfolio. Fortunately, there are things prudent long-term investors can do to steel themselves financially and emotionally from the coming pain that is likely to befall us all in the coming months. Fact 3: The Butcher’s Bill Is Could Be Steep The reason we locked down the economy in March and April was to avoid the healthcare system from becoming overwhelmed, and sending the death count soaring. 7 \"SAFE HAVEN\" Dividend Stocks for Turbulent Times(Source: IHME) The coming second wave of the virus, which is expected to begin in mid-October, could see America’s ICU capacity overwhelmed because approximately 60% of ICU’s are already occupied, including with non-COVID-19 related illnesses and conditions. (Source: CDC) note that as of mid-July CDC no longer updates US ICU capacity IHME estimates that 19,500 ICU beds will be needed for COVID-19 cases by December 1st, which will be near our current national capacity for COVID-19 cases. As long as states continue to ramp up ICU capacity, including life-saving ventilators, we are currently expected to be relatively OK. But if the pandemic slightly exceeds the IHME’s current baseline projections, such as the potential 100K+ daily cases that IHME, Anthony Fauci, and Dr. Michael Osterholm of the Centers for Infectious Disease and Research Policy (CIDRAP) believe are possible, then we may need to lock down the country, again, for up to six weeks. We believe the choice is clear. We can continue to allow the coronavirus to spread rapidly throughout the country or we can commit to a more restrictive lockdown, state by state, for up to six weeks to crush the spread of the virus to less than one new case per 100,000 people per day. That’s the point at which we will be able to limit the increase in new cases through aggressive public health measures, just as other countries have done. But we’re a long way from there right now… If we aren’t willing to take this action, millions more cases with many more deaths are likely before a vaccine might be available. In addition, the economic recovery will be much slower, with far more business failures and high unemployment for the next year or two. The path of the virus will determine the path of the economy. There won’t be a robust economic recovery until we get control of the virus… If we do this aggressively, the testing and tracing capacity we’ve built will support reopening the economy as other countries have done, allow children to go back to school and citizens to vote in person in November. All of this will lead to a stronger, faster economic recovery, moving people from unemployment to work… There is no trade-off between health and the economy. Both require aggressively getting control of the virus. History will judge us harshly if we miss this life- and economy-saving opportunity to get it right this time.” – Michael Osterholm, Neel Kashkari In fact, Dr. Osterholm just published an NYT op-ed with MN Fed President Neel Kashkari, who was responsible for managing the TARP bailout during the Financial Crisis, recommending a six-week national lockdown that would be far more severe than what we experienced in April. It would be Italian in nature, including strict travel restrictions and limit the number of “essential services and jobs” that many states allowed the first time. What are Osterholm and Kashkari so worried about? (Source: IHME) Likely a potential spike in daily deaths well above the 1,000 we’re seeing today. That’s a number that IHME expects to remain relatively stable for the next few weeks before beginning a steady rise to nearly 1,900 per day by December 1st. For context, 1,900 daily deaths would be approximately a daily 9/11 occurring every day through the month of December and that number might end up climbing much higher. IHME’s 95% confidence interval is 834 to 3,516 meaning that by the end of the year we might potentially break the terrible record we set on April 21st when 2,749 Americans died from the virus in a single day. (Source: World of Meters) (Source: IHME) In terms of total mortality IHME’s base case forecast is currently 295,000 Americans dead by December 1st. as many as 524,000, if all social distancing measures are eliminated as few as 205,000 if 95% of us correctly wear masks base case mask forecast, is 228,271 wearing masks could save 66,740 Americans by December 1st By the end of the year, the US could be facing a death toll ranging from 300K to 400K and that would be year one of a 2.5 to a 3-year pandemic. If the vaccine is delayed into 2022, a scenario that JPMorgan is planning for, then potentially America might end up reaching 60% to 70% herd immunity without the benefit of a vaccine, simply because an estimated 60% to 70% of Americans would become infected meaning. 198.6 to 231.7 million infections 1% of those will die 2.0 to 2.3 million US deaths The researchers estimate IFR to be 0.68% on average but find it varies substantially across nations: approximately 0.56% for Iceland, 0.64% for New Zealand, 0.99% for the United States, 1.59% for the UK, and 2.08% for Italy.” – MIT The US is actually rather fortunate that our population isn’t as old as that of Britain or Italy where the estimated infection mortality rate is 60% to 100% higher than in the US. So let’s provide some context about how bad this pandemic has already been ad could potentially become. Estimated Effects Of 10KT Terrorist Nuclear Bomb In NYC (Source: Nukemap) It’s estimated that terrorists detonating a 10KT nuclear bomb in Manhattan would kill 103,000 people. We’ve lost 60,000 more than that already and this virus is just getting started with us. Estimated Effects Of 1.2 MT Nuke In NYC (Largest Yielding Bomb In US Arsenal) (Source: Nukemap) A 1.2 megaton hydrogen bomb, the largest the US currently has detonated in NYC would kill about 1.8 million, which represents close to the worst-case scenario that MIT says is possible for the US. In actuality, a vaccine is likely to become available in 2021 except that mass-producing it is going to represent the largest logistical challenge in medical history. We also have to keep in mind the pace of the ramp-up for any approved vaccine. The 3 most advanced vaccines currently require two doses several weeks apart 70% of global herd immunity will require about 11 billion doses How quickly can we ramp up vaccine production once one has been approved? We are likely going to have maybe tens of million of doses in the early part of [next] year. But as we get into 2021, the manufacturers tell us that they will have hundreds of millions and likely a billion doses by the end of 2021,” Fauci said in an interview with Reuters. That, of course, depends on an effective vaccine actually being developed and approved. “I’m cautiously optimistic, though you can never guarantee things with a vaccine,” Fauci commented… “I hope and feel it’s possible that by the time we get through 2021 and go around for another cycle, that we’ll have this under control,” Fauci said. “Do I think we’re going to have a much, much better control one full year from this winter? I think so.” – Dr. Anthony Fauci One billion doses by the end of 2021 are what various drug makers such as Moderna, Pfizer, JNJ, and AstraZeneca have said is reasonable to expect. If we can get another 10 billion doses by the end of 2022 that would represent the greatest vaccine war-time effort ever achieved. Yet it would likely still take another six to 12 months for the world to become vaccinated, achieve herd immunity, and for this pandemic to likely end. Basically, we have to be realistic and understand that this pandemic represents one of the most complex challenges ever to face our global economy and society. This means that the stock market, pricing in nothing but perfect execution on all fronts, from every part of the medical sector, may be set up for some nasty surprises in the coming months. This brings us to the most important fact of all, how to protect your portfolio from what might be a very grisly fall and winter in the history of this pandemic. Fact 4: The Best Way To Protect Your Retirement Portfolio From The Potential Pandemic Carnage Ahead (Source: JPMorgan Asset Management) JPMorgan’s (JPM) economists (ranked among the 16 most accurate out of 44 tracked by MarketWatch) believe that if the pandemic doesn’t go well, the S&P 500 could fall 22%. What does “not well” mean? There is a resurgence of the virus in areas that had slowed the spread, and social distancing measures are only effective when practiced more strictly. Therefore, social distancing cannot be meaningfully lifted until the vaccine is released, which is delayed into 2022. As part of the economy partially lockdown, more businesses permanently shut and workers struggle, despite trillions more in fiscal stimulus. The Fed continues to offer tremendous support, but the banking system comes under pressure, although not to the extent of the Financial Crisis. Global markets plunge back into bear market territory, yields collapse but do not enter negative territory, and the dollar strengthens again. When the vaccine does arrive, despite pent-up demand, the damage due to the duration of the recession weakens the recovery.” – JPMorgan Asset Management Now it’s important to keep in context that a 22% market decline, while scary would not be anything unusual in terms of market declines. (Source: Guggenheim Partners, Ned Davis Research) In fact, it would be a relatively mild bear market as far as the historical severe downturn goes. So should investors pull all their money out of stocks right now and go into cash or bonds? Absolutely not. That would be market timing and numerous studies show that over time market timing is the 2nd greatest retirement dream killer second only to insufficient savings. Rather the reasonable and prudent course for most long-term investors to take is to make sure to their asset allocation, the mix of stocks, bonds, and cash they own, is appropriate for their risk profile. For example, let’s consider a 75/25 stock/bond portfolio that Wharton Professor Jeremy Sigel considers the new default standard for his clients. 75/25 Stock/Bond Portfolio Under JPMorgan Stress Tests (Source: JPMorgan Asset Management) A 75/25 balanced portfolio is one the JPMorgan’s stress test expects to fall 6.2% less during a frightening but realistic worst-case scenario for the pandemic. It’s also one that does well against all of the risks facing investors right now, including the November election (which has little expected effects regardless of the outcome) as well as the potential for the trade war to worsen and a sharp and protracted spike in inflation. In case a 15% decline is too much for you to stand without losing sleep and portfolio discipline consider a more conservative allocation, like the old standard 60/40 stock/bonds. 60/40 Stock/Bond Portfolio Under JPMorgan Stress Tests (Source: JPMorgan Asset Management) A 60/40 portfolio would be expected to fall about 9% less during a future pandemic induced bear market as well as perform very well in most major risk events. Or if your portfolio is large enough and your primary goal is preserving capital, minimizing volatility, and merely achieving total returns faster than the rate of inflation (1.6% over the next 30 years according to the bond market) then you could get even more conservative. A 40/60 stock/bond portfolio is considered the most conservative that’s prudent for most investors. And here’s how that would perform under JPMorgan’s economists’ stress tests. (Source: JPMorgan Asset Management) Such a portfolio would still be expected to fall during a pandemic bear market, but almost 2/3 less and would be expected to generate extremely strong downside protection against most major current risk factors investors face. Worried about what might happen if interest rates rise? JPMorgan has stress-tested that as well. In the event of a 1.5% increase in interest rates bonds (the BbgBarc U.S. Aggregate Total Treasury Index) are expected to fall almost 11%. (Source: JPMorgan Asset Management) This would represent approximately 2% 10-year US treasury yields which happen to be Moody’s long-term forecast (post-pandemic) for the proxy for long-term interest rates. Even if that scenario, which is actually expected to play out over the next decade, if it happened suddenly, such as in a single year, your portfolio would be expected to generate about 1% positive returns. Why? Because in order for bond yields to rise that quickly and that strengthen the economy would need to be doing exceptionally well, driving very good corporate earnings and strong stock gains in 40% of the portfolio. I’m not saying that any of these asset allocations are necessarily right for your individual needs. You and your financial advisor (if you have one) need to determine a prudent asset allocation for your specific risk profile and long-term goals. (Source: UBS) Historical stock/bond asset allocation tables such as this one from UBS, showing how each portfolio did during historical bear markets can be a useful tool for getting started in determining prudent asset allocation for your portfolio. Want More Great Investing Ideas? 3 Possible Directions for the Stock Market from Here How to Trade THIS Stock Bubble? 9 “BUY THE DIP” Growth Stocks for 2020 SPY shares were trading at $337.12 per share on Wednesday morning, up $4.32 (+1.30%). Year-to-date, SPY has gained 5.82%, versus a % rise in the benchmark S&P 500 index during the same period."}]}