{"article": [{"url": "https://stocknews.com/news/amzn-baba-jd-shop-4-strong-buy-online-retail-stocks-to-invest-in/", "published": 1599134900.0, "headline": "4 \"Strong Buy\" Online Retail Stocks to Invest In", "body": "Many e-commerce companies have reported some of their best results ever in the last reported quarter, as their businesses were blessed with huge demand amid the pandemic. According to eMarketer, the online retail industry is set to witness a 18% increase in total sales in 2020. With the pandemic and social distancing norms affecting the “usual” way of shopping, it’s no surprise that the industry’s sales are growing exponentially. According to an Adobe Analytics report, online sales increased 55% year-over-year to $66.30 billion in July. Analysts expect this growth momentum to continue well into the upcoming quarters for multiple reasons. First, no definitive news regarding the vaccine combined with a rising coronavirus infected people is making online shopping from the safety and comfort of homes more appealing. Second, the unemployment rate is declining. With a higher percentage of employed individuals in the country, consumer spending is rising. The biggest online retailers in the world — Amazon.com, Inc. (AMZN), Alibaba Group Holding Ltd. (BABA), JD.com, Inc. (JD) and Shopify Inc. (SHOP) are already thriving and the rally in their stock prices may not stop anytime soon. 7 \"SAFE HAVEN\" Dividend Stocks for Turbulent TimesAmazon.com, Inc. (AMZN) AMZN’s business model has allowed it to become one of the most successful companies amid the pandemic. It is the second largest company in the United States with a $1.77 trillion market capitalization. AMZN’s Prime subscription service, which provides swift delivery, has allowed the company to reach its record highs during the pandemic. RiskHedge reporter Stephen McBride has labelled Prime subscription as a “game changer,” which allowed AMZN to reach its $1.77 trillion market valuation from an $18 billion internet retailer. AMZN launched Project Zero across multiple countries to ensure that 100% authentic goods are sold through its website. Initially launched in 2019, AMZN extended it to 7 new countries on August 11th. AMZN recently announced its plans to strategically invest $1.4 billion across the United States to boost its reach across the country. To this end, the company has also revealed plans of opening a new fulfillment and delivery center in Texas. AMZN spent over $4 billion in the second quarter ended June 2020 to deal with Covid-19. This allowed the company to ensure safe and speedy delivery of its products across the country, leading to a 40% year-over-year increase in net sales to $88.90 billion. Operating income increased 87% from the year-ago value to $5.80 billion, and net income rose 100% year-over-year to $5.20 billion. AMZN’s operating cash flow of $51.20 billion increased 42% from the same period last year. Also, AMZN invested more than $9 billion in capital projects including fulfillment, transportation and Amazon Web Services (AWS). Analysts estimate the third quarter ending September 2020 revenue to be $92.37 billion, indicating 32% increase year-over-year. The consensus EPS estimate of $7.22 indicates a 70.6% rise from the year-ago value. AMZN hit its 52-week low of $1,626.03 in March, and gained more than 110% since then. The stock hit its 52-week high of $3,451.74 in August. How does AMZN stack up for the POWR Ratings? A for Trade Grade A for Buy & Hold Grade A for Peer Grade A for Industry Rank A for overall POWR Rating. You can’t ask for better. It is also ranked #1 out of 57 stocks in the Internet industry. Alibaba Group Holding Ltd. (BABA) BABA is the one of the biggest e-commerce platforms in the world, with a market capitalization of $813 billion. It has operations in four primary segments – Core Commerce, Cloud Computing, Digital Media and Entertainment and Innovation Initiative and others. BABA owns and manages both wholesale and retail marketplaces, third party online and mobile commerce platforms, monetization platforms as well as internet platforms for healthcare products, among others. BABA’s digital technology and intelligence backbone Alibaba Cloud aims to be the world’s leading digital intelligence platform by 2023. On July 2nd, BABA announced that 38% of the Fortune 500 companies use Alibaba Cloud as their preferred cloud service provider. On August 11th, BABA signed a memorandum of understanding (MoU) with Total (China) Investment. The two companies agreed to a strategic collaboration to drive the digital transformation of their operations in China and globally. BABA has a significant stake in electric vehicle maker XPeng, which gained more than 40% since going public on the New York Stock Exchange. BABA’s affiliate Ant Group has filed to go public in Hong Kong and Shanghai simultaneously. With an expected valuation of over $200 billion, Ant could raise $30 billion through its stock market debut, making it the world’s largest IPO. BABA reported impressive financials in the fiscal first quarter ended June 2020, stating that it completely recovered from the coronavirus shock. Revenues increased 34% to $21.76 billion. Mobile monthly active users increased 3.3% quarter-over-quarter to 874 million. Income from operations increased 43% from the year-ago value to $4.91 billion, while adjusted EBITDA rose 30% during the same time to $7.22 billion. Non-GAAP net income rose 28% from the same period last year to $5.58 billion. Its net cash from operating activities increased 48% year-over-year to $7.09 billion. The consensus EPS estimate of $2.13 for the second fiscal quarter ending September 2020 indicates a 15.1% rise year-over-year. Also, BABA has an impressive earnings surprise history, as it beat the street EPS estimates in each of the trailing four quarters. The consensus revenue estimate of $23 billion for the ongoing quarter indicates a 53.7% increase from the year-ago value. BABA gained more than 70% since hitting its year-to-date low of $169.95 in March. The stock hit its 52-week high in August. It’s no surprise that BABA is rated a Strong Buy in our POWR Ratings system, with an A for Trade Grade, Buy & Hold Grade and Peer Grade, and a B for Industry Rank. It is also ranked #1 out of 115 stocks in the China industry. JD.com, Inc. (JD) Based in China, JD is an e-commerce and infrastructure retail company operating through two main segments – JD Retail and New Businesses. Apart from its online marketplace business, JD provides asset management and logistics services to customers domestically. Tencent Holdings Ltd. had a 17.1% ownership stake in JD, as of early 2020. As the fast recovering country from the pandemic shock, China reported expansion in its industrial and services industry in the past two months. JD started trading on the Hong Kong market on June 18th as the third U.S.-listed Chinese mainland company that completed a secondary listing in Hong Kong. Fueled by driving domestic demand, China’s internal recovery is reflected in JD’s impressive second quarter earnings. Net revenue increased 33.8% year-over-year to $28.50 billion in the quarter. Annual active customer accounts increased 29.9% from the same period last year to 417.40 million. JD’s capital turnover ratio is better than 88.5% of other U.S. stocks in the StockNews.com universe. The consensus EPS estimate of $0,39 for the third quarter ending September indicates a 34.4% increase year-over-year. Moreover, JD beat the street EPS estimates in each of the trailing four quarters, which is impressive. Consensus revenue estimate of $24.91 billion for the ongoing quarter indicates a 29.3% rise from the year-ago value. JD has gained more than 215% since hitting its year-to-date low of $32.70 in March. the stock hit its 52-week high of $86.58 in September. JD’s strong fundamentals and growth potential is reflected in its POWR Ratings. It is rated a Strong Buy with a grade of A in Trade Grade, Buy & Hold Grade and Peer Grade, and B in Industry Rank. In the 115-stock China industry, JD is ranked #2. Shopify Inc. (SHOP) SHOP is a cloud-based multichannel e-commerce site for MSMEs. It operates internationally through its merchant and subscription solutions. SHOP is one of the first e-commerce companies to enter into a strategic partnership with CoinPayments to establish a crypto payments platform on its website. The thriving online retail business has accelerated SHOP’s growth in the second quarter ended June 2020. New store creation increased 71% year-over-year, due to rising demand and an extension in the free trial period. Gross Merchandise Value (GMV) grew 119& from the year-ago value, with a 97% year-over-year increase in net revenues to $714.30 million. Adjusted gross profit of $381.40 million grew 84% from the same period last year. The consensus revenue estimate of $647.42 million for the third quarter ending September 2020 indicates a 65.8% improvement year-over-year. The consensus EPS estimate of $0.49 indicates a substantial rise from the year-ago value. Also, SHOP has an impressive earnings history, as it beat the street EPS estimates in three out of trailing four quarters. SHOP gained more than 275% since hitting its year-to-date low of $305.30 in March. The stock hit its 52-week high of $1146.91 in September. SHOP is rated a Strong Buy in our POWR Ratings system, consistent with its sound business model and growth momentum. It has an A in Trade Grade, Buy & Hold Grade and Peer Grade and B in Industry Rank. It is also ranked #1 out of 34 stocks in the Internet – Services industry. Want More Great Investing Ideas? 7 Best ETFs for the NEXT Bull Market Beware Stocks in September? 9 “BUY THE DIP” Growth Stocks for 2020 AMZN shares were trading at $3,376.33 per share on Thursday afternoon, down $155.12 (-4.39%). Year-to-date, AMZN has gained 82.72%, versus a 8.57% rise in the benchmark S&P 500 index during the same period."}]}