{"article": [{"url": "https://stocknews.com/news/azn-nvax-pfe-mrna-xph-vrtx-top-4-covid-stocks-to-buy-before-vaccine-is-created/", "published": 1596456500.0, "headline": "TOP 4 COVID Stocks to Buy Before a Vaccine is Created", "body": "COVID-19 cases continue to rise in the United States and doctors and health professionals fear that a larger second wave of the virus will hit us in the fall, overwhelming healthcare systems across the nation. That’s why a vaccine is crucial to getting the economy back on its feet. Through its Operation Warp Speed program, the U.S. government has granted billions of dollars to companies to bring a vaccine to market by the beginning of next year. Therefore, it’s not surprising that shares of biotechnology and pharmaceutical companies that are working on developing a vaccine have been surging. It’s expected that whichever company or companies that successfully create a vaccine will see extraordinary profits, as billions of people around the world will need to be vaccinated. There are 26 vaccine candidates already in clinical testing. Here are four top candidates developing a vaccine: AstraZeneca (AZN), Novavax (NVAX), Pfizer (PFE), and Moderna (MRNA). 9 \"BUY THE DIP\" Growth Stocks For 2020AstraZeneca (AZN) AZN was formed through a merger between Astra of Sweden and Zeneca Group of the United Kingdom in 1999. The company sells branded drugs across various major therapeutic classes, such as gastrointestinal, diabetes, cardiovascular, respiratory, cancer, and immunology. The company is working with the University of Oxford to develop a non-replicating viral vector vaccine, ChAdOx1-S. The drug is currently in a phase III study. The company’s stock is up over 14% compared with a 6% loss for the SPDR S&P Pharmaceuticals ETF (XPH). The company is generating top-line growth through new drugs like Brilinta, which treat cardiovascular issues, Farxiga and Forxiga for type II diabetes, Lynparza for ovarian cancer, and Tagrisso for lung cancer are driving top-line growth. AZN is also focused on emerging markets. It represents the largest market for the company by product sales. The company reported earnings of $0.48 per share last week, compared with the consensus estimate of $0.44. AZN is currently rated a Buy in our exclusive POWR Ratings system. It holds grades of A in Trade Grade, Peer Grade, and Industry Rank, which are components that make up the POWR Ratings. The company is currently ranked #13 out of 213 stocks in the Medical – Pharmaceuticals industry. Novavax (NVAX) NVAX is a biotechnology company that specializes in developing vaccines. The company works in the clinical stage of development by focusing on delivering products that prevent a broad range of diseases. The company is working on a full-length recombinant SARS CoV-2 glycoprotein nanoparticle vaccine. The drug, NVX-CoV2373, is currently in Phase 1/2 trials. In addition to a COVID vaccine, the company is on track to produce a potential flu vaccine. It developed a nanoparticle seasonal influenza vaccine candidate called NanoFlu, for senior patients over the age of 65. The company announced positive efficacy and safety data from a phase III study. The company is also developing ResVax, a respiratory syncytial virus vaccine that protects infants by immunizing their mothers against the disease. NVAX is also a Buy in our POWR Ratings system. The stock holds grades of A for Trade Grade and Peer Grade, and B for Buy and Hold Grade and Industry Rank. The stock is ranked #20 out of 338 stocks in the Biotech industry. Keep an eye out on Wednesday as NVAX is expected to report earnings. Pfizer (PFE) PFE, one of the world’s largest pharmaceutical companies, has annual sales of over $50 billion. Prescription drugs and vaccines account for a majority of the company’s sales. PFE is aligned with German biotech BioNTech on a few different COVID vaccine candidates. Two vaccines have been granted FDA fast-track designation to speed up the drugs’ regulatory process. PFE has been boosting growth through acquisitions. In October 2009, the company acquired Wyeth to develop a more substantial presence in emerging markets. In September 2015, PFE acquired Hospira to expand the company’s sterile injectable and biosimilar capabilities. The company is also actively involved in licensing deals. It has a co-marketing deal with Merck for a new type II diabetes medicine called Steglatro. PFE currently has a deep drug pipeline. It expects 25 to 30 drug approvals through 2022. How does PFE stack up for the POWR Ratings? A for Trade Grade A for Buy & Hold Grade A for Industry Rank A for Peer Grade A for overall POWR Rating The company is also the #2 ranked stock in the Medical – Pharmaceuticals industry. PFE beat analyst expectations last week when it reported EPS of $0.78, compared with the consensus estimate of $0.64. Moderna (MRNA) MRNA is engaged in creating transformative medicines based on messenger RNA. The company transfers information stored in genes to the cellular machinery that makes all the proteins required for life. It is developing therapeutics and vaccines for infectious diseases, immuno-oncology, and autoimmune and cardiovascular diseases. MRNA has teamed up with the National Institutes of Health to develop an LNP-encapsulated mRNA COVID vaccine candidate. The drug, mRNA-1273, is currently in phase III trials. The company has eight mRNA-based prophylactic and cancer vaccine candidates in clinical-stage development. MRNA is also developing several other mRNA candidates that are in early-stage clinical studies. Its KRAS vaccine, mRNA-5671, treats colorectal cancer, non-small cell lung cancer, and pancreatic cancer. The company has agreements with AZN and Vertex Pharmaceuticals (VRTX) to develop some of its drug candidates. The deals provide upfront funds, and the companies will share research and marketing costs. Keep an eye out on Wednesday as MRNA is expected to report earnings before the market opens. Want More Great Investing Ideas? 9 “BUY THE DIP” Growth Stocks for 2020 How HIGH Can This Tech Bubble Fly? 7 “Safe-Haven” Dividend Stocks for Turbulent Times AZN shares were trading at $56.85 per share on Monday afternoon, up $1.07 (+1.92%). Year-to-date, AZN has gained 16.29%, versus a 3.26% rise in the benchmark S&P 500 index during the same period."}]}