{"article": [{"url": "https://stocknews.com/news/tsla-nio-li-3-automobile-stocks-that-soared-more-than-10-last-week/", "published": 1598875700.0, "headline": "3 Automobile Stocks That “Soared” More Than 10% Last Week", "body": "The automotive sector has become surprisingly volatile during the coronavirus pandemic. In particular, investors and traders are buying and selling stocks of electric vehicle-makers at an especially high frequency. The auto sector’s volatility is interesting as fewer cars are likely to be sold in the year ahead. More people will stay at home to work, learn, and live due to the pandemic. However, this does not mean investors should completely neglect the auto stocks. The following three automotive stocks jumped more than 10% last week: Tesla (TSLA), Nio (NIO), and Li Auto (LI). Let’s take a look at the merits of each to determine if any belong in your portfolio. 7 \"SAFE HAVEN\" Dividend Stocks for Turbulent TimesTesla (TSLA) When it comes to electric vehicle makers, none draw the same level of attention as TSLA. Turn on CNBC, open up the Wall Street Journal, or look at any investment-related website, and you are sure to find mention of TSLA. TSLA jumped last week in anticipation of its stock split. Its POWR Ratings could not get much better: A grades in three out of the four POWR components except Industry Rank, which has a grade of B. TSLA is ranked second of 28 stocks in the Auto & Vehicle Manufacturers industry. TSLA may continue its upward ascent now that the stock has been democratized for the masses’ investment with a 5-for-1 stock split. More investors will have access to the stock as it is more affordable and will likely enter the S&P 500 index. Nio (NIO) NIO is one of the hottest stocks in the automotive sector and in the overall market. This EV-maker designs, builds, and sells premium EVs under the ES8, EVE, and EP9 brand names. Based in China, NIO might not prove that be as attractive to TSLA cars to some Americans, yet there is no shortage of interest in this stock from investors, as evidenced by its dramatic ascent last week. NIO has A grades in Trade Grade and Peer Grade, and B grades in Buy & Hold Grade and Industry Rank. NIO is ranked higher than all but 17 out of 115 China stocks. It is quite interesting that NIO traded sideways through most of 2019 and early 2020 only to soar to new heights in the past couple of months following the spike in investor interest in EVs. The spike results from positive comments from analysts at Citibank and Morgan Stanley, along with a secondary stock offering that will raise $1.5 billion. Though it is a bit difficult for investors to reconcile that NIO relinquished one-quarter of its assets this past April to obtain financing to remain in business, the stock skyrocketed after the deal closed one month later. NIO may move back toward its 52-week high of $20.97 as investor interest in EVs increases in the months ahead. Li Auto (LI) China is the perfect market for an EV company. With 1.393 billion people and a desperate need for clean EV vehicles amidst a developing ecological nightmare, China will likely transition to all-EV cars within the next couple of decades. LI, an EV innovator, designs, makes, and sells electric EVs throughout china. LI has a market cap of a mere $836 million based in Beijing, yet the analysts are quite bullish on the stock. Out of the five analysts who have reviewed LI, TipRanks reports four rates the stock as a buy; one rates it as a hold, and none rate it as a sell. TipRanks analysts also insist LI has a fair price target of $18.22, which is 6.3% higher than its current price. The bullish sentiment from Wall Street analysts will generate more investor interest in LI, possibly helping the stock blast through its 52-week high of $24.48 before 2020 comes to an end. Want More Great Investing Ideas? 7 Best ETFs for the NEXT Bull Market Beware Stocks in September? 9 “BUY THE DIP” Growth Stocks for 2020 TSLA shares fell $0.99 (-0.19%) in after-hours trading Monday. Year-to-date, TSLA has gained 21.43%, versus a 9.65% rise in the benchmark S&P 500 index during the same period."}]}