{"article": [{"url": "https://stocknews.com/news/bfam-rst-aspu-3-education-stocks-to-buy-for-the-new-school-year/", "published": 1601035700.0, "headline": "3 Education Stocks to Buy for the \"New School Year\"", "body": "The pandemic has proven to be especially difficult for families quarantined with children, as parents must manage their careers, household chores, and kids at the same time. With virtual working and learning now becoming the new normal, working mothers have revealed the strains of taking care of their children and balancing a career. This has resulted in plenty of women leaving the workforce permanently. Though reopening of schools might act as a boon for such households, it does not come without risks. As the number of coronavirus cases are rising with each passing day, sending kids to school without proper vaccination could be risky. On the other hand, there are limitations to virtual learning from reduced efficiency to technological limitations. Several education providers such as Bright Horizons Family Solutions, Inc. (BFAM), Aspen Group, Inc. (ASPU), and Rosetta Stone, Inc. (RST) are actively working to resolve the problems associated with remote learning, and have launched various products and services to help. From in-house caregivers of children to technological support for remote learning, these products and services are specifically designed to ease the difficulties of this “new normal.” Ahead of the upcoming school session, these products are expected to rack up in demand, allowing companies to reap the rewards. 7 \"SAFE HAVEN\" Dividend Stocks for Turbulent TimesBright Horizons Family Solutions, Inc. (BFAM) BFAM provides childcare, early education services and workforce education advisory to employers and families across the United States. It operates through three segments – Full-Service Center-Based Child Care, Back-Up Care, and Educational Advisory Services. On August 6th, BFAM acquired Sittercity’s business to expand its client base and current portfolio of family focused solutions. It also provides in-home caregivers and tutors who can conduct in-person or virtual classes to facilitate the learning experience for children. The prolonged quarantine period and consequent adoption of virtual education negatively impacted BFAM’s second quarter results. Revenue declined 44% year-over-year to $294 million during the quarter that ended in June 2020, while diluted EPS fell 56.5% from the same period last year to $0.44. However, with the gradual recovery of the economy and reopening of schools, the company is expected to recuperate quickly. BFAM’s revenue increased at a CAGR of 3.6% over the past three years, while diluted EPS grew at a CAGR of 2.5% over the same time period. Its EPS is expected to rise at 4.6% per year over the next five years. BFAM hit its 52-week high of $176.98 in early February before the onset of the pandemic, but lost 60% since then, hitting its 52-week low of $64.23 in March. The stock has gained more than 115% since its March low. How does BFAM stack up for the POWR Ratings? B for Trade Grade A for Peer Grade B for Overall POWR Rating. It is also ranked #2 out of 29 stocks in the Outsourcing – Education Services industry. Aspen Group, Inc. (ASPU) ASPU is an education technology holding company which uses core infrastructure for single education delivery operations online. It owns and operates two universities in the country — Aspen university, Inc. and United States University, Inc. — offering several certification programs, bachelor’s and master’s courses, and doctoral degree programs. ASPU closed its senior note conversion worth $10 million on September 15th, which made it free of debt. This move allows the company to save approximately $700,000 annually in interest rate expenses. ASPU’s revenues increased 46% year-over-year to $15.20 million in the fiscal first quarter that ended in July 2020. Its gross profit increased 56% from the year-ago value to $9 million, while new student enrollments rose 22% from the same period last year to 2,351. ASPU’s EPS is expected to grow at 40% per annum over the next five years. Moreover, the company has an impressive earnings surprise history, as it beat the street EPS estimates in three out of trailing four quarters. ASPU has gained more than 180% since hitting its 52-week low of $4.65 in March. The stock hit its 52-week high of $13.16 in August. ASPU’s strong fundamentals are reflected in its POWR Ratings. It has a “Buy” rating with a grade of “A” in Peer Grade and a “B” in Trade Grade. In the 29-stock Outsourcing – Education Services industry, it is ranked #3. Rosetta Stone, Inc. (RST) RST provides technology-based learning products such as personalized language and reading programs across the United States and internationally. It operates through three segments — Literacy, E&E Language and Consumer Language to provide web-based software subscriptions and online and professional services to schools and businesses across the world. RST’s literacy program Lexia Learning has been awarded the Best Personalized/Adaptive Learning App or Tool for the past two consecutive months. On August 12th, RST launched Rosetta Stone English for grades K-6 for academic success in emergent bilinguals. RST’s consolidated revenue increased 7% year-over-year to $49.20 million in the second quarter that ended June 2020. Consolidated bookings increased 41% from the year-ago value to $59.30 million, while adjusted EBITDA grew 95.2% from the same period last year to $4.10 million. Though the consensus EPS estimate for the ongoing quarter ending September 2020 indicates a year-over-year decline, RST beat the street EPS estimates in each of the trailing four quarters, which bodes well for the stock. The consensus revenue estimate of $48.12 million for the quarter indicates a 5.9% growth from the year-ago value. RST has gained more than 250% since hitting its 52-week low of $8.85 in March. The stock hit its 52-week high of $31.24 in August. RST is rated a “Strong Buy” in our POWR Ratings, consistent with its sound business model and impressive financials. It has an “A” for Trade Grade, Buy & Hold Grade, and Peer Grade. It is also ranked #1 out of 29 stocks in the Outsourcing – Education Services industry. Want More Great Investing Ideas? 7 “Safe-Haven” Dividend Stocks for Turbulent Times When Does the Next Bull Run Start? Chart of the Day- See the Stocks Ready to Breakout BFAM shares were trading at $143.39 per share on Friday afternoon, up $2.42 (+1.72%). Year-to-date, BFAM has declined -4.59%, versus a 2.78% rise in the benchmark S&P 500 index during the same period."}]}