{"article": [{"url": "https://stocknews.com/news/ayx-avlr-two-tech-stocks-with-big-upside-potential/", "published": 1593691700.0, "headline": "Two Tech Stocks With Major Upside Potential", "body": "We’ve seen a strong bounce off of the recent lows for the Nasdaq 100 (QQQ) since the late June pullback, and we continue to see a relentless bid under the top growth stocks, with many names like DocuSign (DOCU) up triple digits year-to-date. However, we’re finally beginning to see a little bit of froth in the market, and the Nasdaq-100 is getting a little extended short-term, suggesting that it might be wise to be patient before putting any new money to work here. Fortunately, there a couple of mid-cap tech stocks that continue to stand head and shoulders above the rest, with sales growth of 30% or higher that is carving out a niche with their unique offerings. If we could see the market pull back a little, these are two candidates worth keeping an eye on, as I believe they still have further room to grow long-term. Let’s take a closer look below: 7 Best ETFs for the NEXT Bull Market (Source: Company Websites) The Software Group (IGV) has been one of the strongest groups this year, and Avalara (AVLR) and Alteryx (AYX) are two relatively new companies in the group, both seeing their IPO debuts in the past five years. Generally, it’s the newer companies that have the most considerable runways long-term as they’ve yet to mature to a point where they can no longer grow sales at 30% plus each year. Avalara and Alteryx both fit this bill, and both have dominant positions in their niche within the software space. The former is the leader in tax-automation software, an area that’s seen significant demand from businesses since the South Dakota vs. Wayfair (W) decision, which requires remote sellers to collect and remit sales tax. The latter, Alteryx, is a data-analytics software platform that makes advanced analytics available to workers. This both speeds up their everyday processes and minimizes human errors. While both companies have had incredible runs since their IPO debuts, we continue to see upwards earnings revisions in both names, suggesting that they are likely headed higher long-term. Let’s take a look at Avalara first: (Source: Company Presentation) As noted above, Avalara is the leader in the tax automation space, and its software is essential for small and medium businesses operating out of several states. This is because we now have more than 90% of the states with economic nexus laws, but most of them have different thresholds for collecting and remitting sales tax. Some states have a minimum limit of $50,000, others as much as $150,000, and some even had quirky rules, like in Iowa, where you are do not have to collect sales tax if consumers are eating the pumpkins you’re selling them, but you better collect it if they’re planning to carve or decorate them. This extremely confusing process is solved by Avalara, whose software automates the process for businesses so they can focus on what’s important, their business, and leave figuring out which rules apply to each state to the software. Let’s take a look at the company’s growth below: (Source: YCharts.com, Author’s Chart) As we can see from the chart above, Avalara has spent several years posting net losses but is finally expected to report positive annual earnings per share in FY-2021. For companies that don’t have earnings on the table yet, I rely on sales growth, and the sales over the past few quarters have been incredible. Avalara reported sales of $111.4 million in Q1 2020, up 31% year-over-year, another quarter of record revenue for the company. Circling back to earnings, the move to positive annual EPS is a significant catalyst as many of the largest growth funds will not buy a stock until it has positive earnings growth. If we look ahead to FY-2022, annual EPS estimates have climbed from $0.24 to $0.32 in the past six months, and this would translate to a 1000% growth rate in FY-2022, assuming the company can hit these targets. Based on this, the company would be one of the highest-growth companies in the market. It’s worth noting that the company has barely scratched the surface on its international opportunity, as it’s just begun to start selling in Europe. Given these robust growth rates and a leading position in a growing space with an estimated TAM of over $10 billion, I see the company as a buy on any dips below $120.00. (Source: Youtube.com) If we move over to Alteryx, there’s a lot to like here as well, as the company is a leader in the data analytics space, giving back several hours per day to workers that now able to automate relatively monotonous tasks and manipulate their data like never before. Like Avalara, the company is a powerhouse when it comes to growth, with revenue growth of 43% in the most recent quarter, and gross margins of 88%, an industry-leading figure. From an earnings standpoint, the company has seen massive growth, but annual EPS is expected to drop off this year to $0.54, a 40% drop compared to the $0.94 reported in FY-2019. While this may be spooking some investors, I see it as immaterial, and merely an aberration in the long-term earnings trend. This is because analysts continue to ratchet up their earnings estimates for FY-2020 and FY-2021, with forecasts sitting at $1.08 and $1.70, respectively. (Source: YCharts.com, Author’s Chart) While it may seem crazy to pay 160x FY-2021 earnings for Alteryx, I would argue that P/E ratios are less valuable for companies growing earnings at high double-digit levels each year. Shopify has been trading at a quadruple-digit P/E ratio for a few years now, and as long as an ultra-growth company can maintain its growth rates, there’s nothing wrong with paying up for that growth. Based on FY-2022 estimates, we’re expecting to see annual EPS grow by over 55% in FY-2022, and hit a new all-time high at $1.70. The technical picture is corroborating this view, Alteryx is breaking out of a massive base that it’s been building for over a year, and a successful breakout is targeting a move to $220.00. Therefore, as long as the stock holds above the breakout of $155.00 on a weekly close, I see no reason to doubt the stock. While Alteryx is a little bit extended here short-term, meaning it’s just a Hold, I would view any dips below $158.00 as a low-risk buying opportunity. While AMZN and NFLX have been massive winners for investors, capable of producing consistent double-digit returns this year, I prefer to look in the mid-cap space where there’s more upside as long as one can sniff out the winners ahead of the crowd. When it comes to Alteryx and Avalara, each company still has a significant runway for growth, and they’re leaders in their field. Therefore, they will likely continue to outperform their peers, especially when combined with their robust margins and industry-leading revenue growth rates. However, and as noted earlier, the market is a little extended short-term, suggesting that buying the dips in these names is the wise move, not rushing in to chase here. I believe any dips to $120.00 on Avalara would provide a low-risk buying opportunity and any pullbacks to $158.00 on Alteryx. For now, I see both stocks as Holds. Disclosure: I am long AMZN, NFLX, AYX, DOCU, and I am short QQQ Disclaimer: Taylor Dart is not a Registered Investment Advisor or Financial Planner. This writing is for informational purposes only. It does not constitute an offer to sell, a solicitation to buy, or a recommendation regarding any securities transaction. The information contained in this writing should not be construed as financial or investment advice on any subject matter. Taylor Dart expressly disclaims all liability in respect to actions taken based on any or all of the information on this writing. Want More Great Investing Ideas? 9 “BUY THE DIP” Growth Stocks for 2020 Is the Bull S#*t Rally FINALLY Over? 7 “Safe-Haven” Dividend Stocks for Turbulent Times Top 3 Investing Strategies for 2020 AYX shares were trading at $176.69 per share on Thursday afternoon, up $1.47 (+0.84%). Year-to-date, AYX has gained 76.57%, versus a -1.50% rise in the benchmark S&P 500 index during the same period."}]}