{"article": [{"url": "https://stocknews.com/news/unh-hum-mgln-3-strong-buy-health-insurance-stocks-to-add-to-your/", "published": 1599134900.0, "headline": "3 \"Strong Buy\" Health Insurance Stocks to Add to Your Portfolio", "body": "The coronavirus pandemic has created immense pressure on the US healthcare system, and health insurance companies are no exception. In the short-term, they benefited from the decrease in medical services. In the long-term, it simply means costs will be higher in upcoming quarters. If weakness in employment continues, then it’ll lead to fewer revenues for health insurers as well. However, the long-term picture for health insurance looks solid given that healthcare spending will continue to rise. Joe Biden’s nomination means that “Medicare for All” is not going to become reality anytime soon. The sector’s valuation looks favorable to the rest of the market. Health insurance stocks traded in a sideways pattern over the last couple of years, while their earnings kept growing. Companies such as UnitedHealth Group Incorporated (UNH), Humana, Inc. (HUM), and Magellan Health, Inc. (MGLN) are poised to keep trending higher in the coming months. 7 Best ETFs for the NEXT Bull MarketUnitedHealth Group Incorporated (UNH) UNH is a diversified healthcare company operating through four segments – UnitedHealthcare, Optum Health, OptumInsight, and OptumRx. Its business operations are spread across two business platforms, UnitedHealth services, which cater to the individuals and communities, and Optum, which serves the healthcare marketplace such as caregivers, employers, governments, and life science companies. With price volatility more than only 2.9% of the U.S. stocks listed in the StockNews.com universe, UNH is a safe stock to invest in amid this market volatility. UNH expanded its operations across the country during the pandemic, including setting up over 500 testing centers and providing free medical kits to the underserved communities. The company reported a profitable second quarter ended in June 2020. Revenue increased 2.4% year-over-year to $62.10 billion. Earnings from operations increased 104.4% from the year-ago value to $9.20 billion. The operating margin rose 890 basis points to 14.3%. Net earnings increased from 97.9% to $6.69 billion. UNH’s EPS is expected to grow 12.7% per year for the next five years. Moreover, the company has an impressive earnings surprise history, as it beat the street EPS estimates in each of the trailing four quarters. The consensus revenue estimate of $63.89 billion for the third quarter ending September 2020 indicates a 5.9% rise year-over-year. UNH’s capital turnover is higher than 89.1% of other U.S. stocks in our universe. UNH has gained more than 70% since hitting its 52-week low of $187.52 in March. The stock hit its 52-week high of $324.57 in August. How does UNH stack up for the POWR Ratings? A for Trade Grade A for Buy & Hold Grade B for Peer Grade B for Industry Rank A for Overall POWR Rating. You can’t ask for better. It is also ranked #1 out of 9 stocks in the Medical – Health Insurance industry. Humana, Inc. (HUM) HUM is a health and well-being company operating through three segments – Retail, Group, and Specialty and Healthcare services segment. It provides Medicare benefits, pharmacy solutions, home-based services, and clinical programs. HUM’s client base includes individuals, employer and family groups, and military solutions. It ranked #1 in mail order pharmacy customer satisfaction in the J.D. Power 2020 U.S. Pharmacy Study. HUM entered into a multi-year agreement with Salesforce (CRM) to develop and ensure an integrated and connected healthcare service for its members. It also partnered with SeniorLink to offer care management to at-risk members during the pandemic. HUM provided multiple waivers and discounts for the lower-income groups for COVID testing and associated costs. The company still managed to remain profitable due to economies of scale. Pretax income rose 111.4% to $2.58 billion in the second quarter ended June 2020. Adjusted non-GAAP income increased 122.4% to $2.38 billion. GAAP revenue increased 17.4% to $19.8 billion, while GAAP operating cash flow increased 31% to $3.06 billion. HUM’s price volatility is more than only 8.9% of the listed U.S. stocks, making it a stable investment option. Though the consensus EPS estimate for the third quarter ending September 2020 indicates a year-over-year decline, HUM beat the street EPS estimates in each of the trailing four quarters, which bodes well for the stock. The consensus revenue estimate of $18.63 billion for the ongoing quarter indicates a 14.7% rise from the year-ago value. HUM gained more than 100% to hit its 52-week high of $425.46 in August since hitting its 52-week low of $208.25 in March. HUM’s strong fundamentals are reflected in the POWR Ratings. It is rated “Strong Buy” with an “A” in Trade Grade, Buy & Hold Grade, and Peer Grade and a “B” in Industry Rank. In the 9-stock Medical- Health Insurance industry, it is ranked #2. Magellan Health, Inc. (MGLN) MGLN is a healthcare management company assisting highly-priced individuals, and group members. Its business operations are divided into three main segments, Healthcare, Pharmacy management, and corporate. MGLN’s wholly-owned subsidiary Magellan Complete care of Virginia got Medicaid HMO Accreditation and long-term services and supports distinction from NCQA. MGLN reported a 552.9% increase in net income to $47.10 million for the second quarter ended June 2020, as a result of the ongoing pandemic. Segment profit increased 6.34% to $57 million, while adjusted net income rose 64.7% to $21.30 million. MGLN’s price to sales ratio of 0.29 is lower than 89.53% of the other U.S. stocks, making it an undervalued stock. The company has witnessed a trailing twelve months earnings growth of 143%, which is greater than 91.8% of the stocks in our set. MGLN has gained more than 150% since hitting its 52-week low of $30.60 in March. The stock hit its year-to-date high of $78.50 in June. It’s no surprise that MGLN is rated a “Strong Buy” in our POWR Ratings system with an “A” in Trade Grade and Buy & Hold Grade, and “B” in Peer Grade and Industry Rank. It is also ranked #4 out of 9 stocks in the Medical – Health Insurance industry. Want More Great Investing Ideas? 7 Best ETFs for the NEXT Bull Market Beware Stocks in September? 9 “BUY THE DIP” Growth Stocks for 2020 UNH shares were trading at $315.05 per share on Thursday afternoon, down $5.19 (-1.62%). Year-to-date, UNH has gained 8.09%, versus a 8.26% rise in the benchmark S&P 500 index during the same period."}]}